{
    "app_id": 267340,
    "name": "Beware Planet Earth",
    "release_date": "2014-04-11",
    "developer": [
        "Lightmare Studio"
    ],
    "publisher": [
        "BANDAI NAMCO Entertainement"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "Strategy",
        "Indie"
    ],
    "achievements": 33,
    "positive_ratings": 177,
    "negative_ratings": 80,
    "price": 6.99,
    "description": "Beware Planet Earth! is a beguiling mix of classic tower defense and time management coming to PC via Steam for the first time. Save your cows from the Martian invasion by building an effective defense using towers, traps and objects, and also by firing your Zapper directly at the invading force of little green men!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/267340/header.jpg?t=1489395381",
    "minimum_requirements": "Mínimo: SO: Windows XP Procesador: 1,8 Ghz Memoria: 512 MB de RAM Gráficos: 64 MB Video Card DirectX: Versión 9.0c Almacenamiento: 350 MB de espacio disponible Tarjeta de sonido: Direct Sound Compatible",
    "recommended_requirements": "Recomendado: SO: Windows XP, Windows 7, Windows 8 Procesador: 2Ghz+ Memoria: 1 GB de RAM Gráficos: 256 MB Video Card DirectX: Versión 9.0c Almacenamiento: 500 MB de espacio disponible Tarjeta de sonido: Direct Sound Compatible",
    "reviews": [
        {
            "review_text": "To me, it's hard to make a 2D Cartoony style like this entertaining, and honestly I laughed a lot as I discovered the cows along the seasons, the aliens' animations, and of course, Barney ! This toilets cabin makes him so alive, and yet we never see the guy ! Now, imagine that all the 'towers' you put in the fields are alive too... Man, this ambiance is soooo fun ! It's actually a part of the machine, but it's also its eyes. It's a vent, but it's also its mouth. Just love the design of these characters/machines ! Mobs have suits, costumes, cohesive animations, and their abilities are related to their appearance. You could guess what it can or cannot do by just looking at them. It's very pleasant and made me feel like I was watching a good old cartoon from Tex Avery/Hanna Barbera. So alive !  Then came the game... I really don't like Tower Defense game type. BPE is the first one I DO want to complete ! God, I felt entertained all time long ! The first levels were clearly designed as tutorials. That's why all the people who got used to play TDs may be bored, but I think their experience will allow them to complete these levels very fast, to finally get to...  ... THE ZAPPER !  Here is how you can turn a simple TD into a frenetic game experience : developpers managed to give you this intense feeling of being overwhelmed, without simply adding mobs, and mobs, and a new wave of mobs... The ZAPPER ! They also played on mobs' resistance, and finally managed to balance mobs' speed, defense, zapper's power, machines' utility and player's actions so that you have a lot of things to setup, manage and use... but in a very effective way ! Everything is damn simple to understand and use, and provides a lot of fun ! Don't... forget... to use... the ZAPPER ! It's your best ally all game long !  And finally, a new dimension came to my attention: mobs' transformations ! You think you killed it, it turns into something else ! Hard Rockers turn into 'Berserk Hard Rockers', Zombies turn into graves, where new smaller zombies emerge, ... but I won't spoil everything ^_^ I found these game mechanics very inventive !  A lot of TDs should take example on this game. It's simple, yet effective and terribly addictive, fun and easy to play, and includes a very well balanced challenge.  I should have given feedback on the 'charismatic' fields, or on the growing number of aliens' spawn points as you progress in the game, or maybe on the evolutive environment (mushrooms and their spores, ice forming on your machines during winter and the zapper's utility at this moment of the game,...), and maybe I should have told you about the bosses, the drill, the gears or the cow bell... but I really have nothing to say about it, because everything was part of the fun, and very well thought !  Play this game, it really worths its price !",
            "review_score": "1"
        },
        {
            "review_text": "Painfully addicitive tower defense in a playful enough package to keep me coming back. Hints of Plants vs Zombies, but stands on it's own quite well. Kept me coming back and well worth the time. Challenging enough to make the effort to get 100 percent completion and I strongly suggest you do.",
            "review_score": "1"
        },
        {
            "review_text": "This game is challenging, fun, creative, colorful, funny, its really depressing to see it buried under the pile of trash of indie games, this game deserves better.  Anyone whos interested in a proper TD game that involves proper planning, strategy, and resource management, thats not just about spamming the same tower all over the place, do your self a favor and buy this game.  Edit: Played it on Desura.",
            "review_score": "1"
        },
        {
            "review_text": "Hours of fun if youre into tower defence and strategy. Mind you, youve got to be prepared to redo levels...",
            "review_score": "1"
        },
        {
            "review_text": "People make comparisons to Plants vs Zombies. I'm only a couple hours in and found it frustrating. On Veteran Mode, your towers feel miniscule compared to the enemy hp pool. Winning on some level requires taking exactly the right towers. Towers are overall very boring, the first 5 you get (compared to Plants vs Zombies): Sunflower, Incredibly Weak PeaShooter, Frozen Pea Shooter, and then you get the two worst, a Bomb and a Landmine. I keep waiting to unlock good towers but the only ones I've gotten are an Ember-shooting Grill and a Fire Hose. Everything else makes me want to wait till the next good thing comes along. Developers seem to care about the game but I don't know how much they've actually played it on Veteran......  Hope this helps.",
            "review_score": "-1"
        },
        {
            "review_text": "Loads of fun. Spiritual successor to PvZ. Great game. Well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game wish there were more like",
            "review_score": "1"
        },
        {
            "review_text": "Plants vs Zombies in disguise with a twist...",
            "review_score": "1"
        },
        {
            "review_text": "Awesome tower defense game. If you get tired of PvZ, you must definately try this one out. :)",
            "review_score": "1"
        },
        {
            "review_text": "how do i file for a refund? game is for kids and not for anyone with a 3 digit IQ.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible td if you want to call it a td. Even on veteran too easy. Found a bug, too.",
            "review_score": "-1"
        },
        {
            "review_text": "It's fun, it reminds me of plants vs zombies. The towers and mobs are more boring than that, the general pace of the game is also slower because the towers are pretty weak. I got it in a humble bundle and i think it's fun solely because of that, I'd buy it when it's under 5 euros or something. It's a nice pastime though.",
            "review_score": "1"
        },
        {
            "review_text": "nice game if you like cows and aliens",
            "review_score": "1"
        },
        {
            "review_text": "In brief: A game made because of great popularity of 'Plants vs Zombies'. And made just for money. But it's good, it's alright. Just as good as 'PvZ', or close to that title.  CONS: - almost a clone of 'Planst vs Zombies' - made just for money - too much crowd on the screen, sometimes - a little bit too difficult, sometimes  PROS: - very playable - becomes quite difficult after a while, but not too much (I hope) - great visuals - nice music tune - something new and fresh with every new mission, which is just great! - ...like: many new weapons, many new enemies - you have to think sometimes ;) because of 'special powers' of some zombies, er, Marsians ;) - you rescue cows, which is great! - the cows say: 'Moo!' - the cows are adorable! - the Martians are evil!  VERDICT: Not very original, but polished and very well executed. If you like light tower defence games, with humor and nice visuals, this is a very good product. You shouldn't be dissapointed. If only it was made before 'Plants vs Zombies', the developers would have made a fortune ;)",
            "review_score": "1"
        },
        {
            "review_text": "Uninspired tower defense game.. could really use some more variety or gimmicks or something.  No huge complaints, but there's a lot of games in this space and I can't see any reason to recommend this game over lots of others.",
            "review_score": "-1"
        },
        {
            "review_text": "A nice little jem of a tower defense game. Much more depth to it then shows in the screenshots! One of my classic favorite games now. Closer to 8 or 9 hours play time. Rest was computer idling.",
            "review_score": "1"
        }
    ]
}