{
    "app_id": 267360,
    "name": "MURI",
    "release_date": "2013-12-06",
    "developer": [
        "Ludosity",
        "Remar Games"
    ],
    "publisher": [
        "Ludosity"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Platformer",
        "Retro"
    ],
    "achievements": 0,
    "positive_ratings": 408,
    "negative_ratings": 39,
    "price": 3.99,
    "description": "MURI is a DOS-style shooter from Remar Games and Ludosity. Features PC Speaker sound and 16-color EGA graphics.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/267360/header.jpg?t=1453388569",
    "minimum_requirements": "OS: Windows XP Processor: Pentium 4 @ 1,5 GHz Memory: 512 MB RAM DirectX: Version 9.0c Storage: 50 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Really well done 2D platformer, very authentic to the shareware-style DOS games from the early 90s. This goes beyond simply the pixel art craze, it's spot on in art style, sound effects, color palette, gameplay, hidden areas, even the menus and episode selection.  The gameplay is immediately familiar and nostalgic for those who grew up on these games. Strongly inspired by and reminiscent of games like Commander Keen, Crystal Caves, Duke Nukem I and II, Cosmo's Cosmic Adventure, Monster Bash, etc.  Highly recommended if you enjoy the genre and have any fondness for games of that period.",
            "review_score": "1"
        },
        {
            "review_text": "Nowadays many try to make an 8-bit platformer/shooter game. MURI does it right.  The nostalgia levels in this game are incredibly high. It really feels like a game made 'back in the days', but with modern thought given to it. A very pleasant game with an intriguing plot. Totally recommend it to people who like oldschool games.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome throwback game to games like original Duke Nukem 1 &amp; 2",
            "review_score": "1"
        },
        {
            "review_text": "MURI feels like a game designed with a purpose, and it meets that purpose well. It duplicates the appearance and structure of an EGA-era DOS platformer, and feels very authentic to that. It even has an option to scroll tile-by-tile as those games often did to compensate for the underpowered PC graphics hardware of the day.   The game consists of twenty levels divided into four episodes. Much like the games it follows, you do lose all your weapons and powerups after each, but the game is designed for this; boss fights give you massive arsenal upgrades and the first level always gives you a few extra guns if you're careful with your special ammunition.  The game's challenge level is fairly even, with a gentle upward slope as you progress. Though the game's final chapters do ramp up the enemy and bullet density, there aren't any egregious 'gotcha' spots, at least on Normal difficulty that I played.  Overall it's an average game, but one worth playing if you enjoy the EGA aesthetic. If you're a fan of Duke Nukem 1 and 2, or Commander Keen, grab this.",
            "review_score": "1"
        },
        {
            "review_text": "A game that brings you back if you ever had the chance to play any dos games like this, then MURI is a treat for you :) It was released on steam 2013, and I thought to my self. 'Meh why not' And then it just was there in my library, waiting... and now 2014 I played it from the start to end and I found my self eating the story line fully!   The storyline is well written, and far from too long nor too short The classic graphics is nothing to complain about as the developers made sure not to go too far with it. and 'bleep boop♪' Classic sfx ingame just to die for.  I reccomend this game to any person who needs a small vacation from their Fps and just kick back and sit with a controller in your hand as you engulf your self into the story of MURI  10/10 From Lyh Flare :8bitheart:",
            "review_score": "1"
        },
        {
            "review_text": "Fun if you enjoy challenging, nostalgic games.  With all the megaman, sonic, and mario homage games out there these days it snice to play something that references back to the games *I* played in my childhood: DOS platformers. You could list out dozens of classic DOS games that Muri is like but it bares the strongest resembalence to the original Duke Nukum even to the point of having nearly identical assets at times.  Where Muri fails at its emulaiton of Duke is its lack of puzzles to progress, most levels can just be run through without fighting enemies (if you dodge their attacks) and rarely do you ever encounter anything more than a few tricky platforming sections. The Challenge of Muri comes from its unforgiving combat and sheer number of enemies. I don't particularly care for that aspect of the game so I played on an easier difficulty and just enjoyed the nostalgic gameplay.   Where Muri wins majorly is its secrets, it has TONS of hidden areas and secret items throughout the levels which allow you access to special weapons at the boss fights. If you enjoy finding secrets and racking up a high score this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "I thought it was just another rushed 2D pixel side scroller shooter. Got a very well designed 2D pixel side scroller shooter. They got the rule of 'make it simple' and got it right.",
            "review_score": "1"
        },
        {
            "review_text": "A really fun and difficult action platformer with great nonlinear level design, i highly recommend it. :)",
            "review_score": "1"
        },
        {
            "review_text": "Really slick throwback to classic DOS run 'n guns like Duke Nukem and Commander Keen. Nice that the dev tried to remain authentic to MURI's forerunners, though the 'authentic' 16 fps setting ended up giving me motion sickness about an episode in. Had to change it to smooth fps to resume comfortable play.  Setting up an Xbox 360 controller was really easy and the controls respond well. MURI doesn't like alt-tabbing out of full screen, so the few times I did, I needed to quit the episode to re-configure Jump to A.  Biggest drawbacks? The two problems mentioned above, plus NO MUSIC. For what it's worth, the game plays really well to the classic Mega Man soundtracks.  Only took me 90 minutes to beat on Normal, even with restarting Episode 2 twice after alt-tab shenanigans. But the multiple difficulties and high score hunting give MURI good replay value.  Overall? A good game, especially for its price.",
            "review_score": "1"
        },
        {
            "review_text": "A perfect throwback and rendition of games such as Apogee's original Duke Nukem, Crystal Caves, Bio Menace. Worth the price, especially if you're longing for your old 386!",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of DOS games of any kind, this is a must have. Its very similar to Duke Nukem, so its automatically great. :)",
            "review_score": "1"
        },
        {
            "review_text": "Disappointed in this game's short length and lower quality compared to Remar's previous efforts Iji and Hero Core. Go play those good games for free instead. The only reason I didn't regret paying for this is the low price and the fact that Remar deserves the money for his previous work. Sorry I can't recommend this, maybe only on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is freakin' amazing. It's like a brand new blast from the past. Very well made!",
            "review_score": "1"
        },
        {
            "review_text": "I had trouble getting my Gravis UltraSound working with the game, but finally got it after fiddling with my autoexec.bat. Also, the duck mechanic is really innovative. I bet that will catch on.",
            "review_score": "1"
        },
        {
            "review_text": "I assume this is a faithful DOS tribute..?",
            "review_score": "1"
        },
        {
            "review_text": "Look at the other reviews and they already said everything: Did you grow up with classic DOS games? The EGA Platformers from Apogee (Duke Nukem, Bio Menace) or the first id Software games like Commander Keen? Then you know what you get here. The game is based on those old titles and is just like the first Duke Nukem with simple EGA-like graphics, emulated PC Speaker sound and it controls great on Keyboard, you can use a gamepad but back then in the DOS age you either used a Joystick or a Keyboard with the arrow keys and ALT + STRG and the game gets this right. The Levels have a lot to offer with a ton of secret passages to discover and while it may not be a game you'd play for 10 hours, it's entertaining, offers various difficulties and doesn't cost much. 20 years ago it would've been celebrated as a masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "cheap. ugly. not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a genuine fake Duke Nukem 1 - faithful in every way. Totally rad. The only real downside I can think of is that levels seem small compared to DN, but that game had some awful backtracking issues at times so it's kind of a trade off. Call it short and sweet.",
            "review_score": "1"
        },
        {
            "review_text": "It reminds me of 1990's sharware, in a good way.",
            "review_score": "1"
        },
        {
            "review_text": "Best 3 MB that I ever had.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it because it was made by one of my favorite indie devs. I was not disappointed. There's plenty of secret items to find and the gameplay genuinely feels like an old DOS game (Duke Nukem 1 and Commander Keen come to mind). Story's pretty alright, too.",
            "review_score": "1"
        },
        {
            "review_text": "A game made for a simpler time. I didn't play computer games from the era, but it reminds me of games for the NES. The game is simple and straightforward: jump around and shoot everything. Honestly, the gameplay is a bit boring, but I recommend it for having a pretty cool sci-fi story and showing that you don't have to have state of the art graphics and all the bells and whistles of modern gaming to spin an interesting tale.",
            "review_score": "1"
        },
        {
            "review_text": "At first glance I thought this was just a rip off of the classic DOS platformer Duke Nukum, the similarity is mainly cosmetic. MURI has many differences that make it its own game.  First, the protagonist is a chubby Martian chick. Second, you can't save, although the episodes aren't very long so it's not a big deal. Finally, the controls don't feel nearly as solid as good ol' Duke: jumping is very weird and takes some getting used to, since you have to hold the key to reach maximum height. It feels more like a limited flight, and if MURI had a jetpack it would make sense. But I guess on Mars you can somehow jump around corners. However once you get used to it, it works pretty well.  Overall it doesn't feel nearly as sold as the original Duke Nukem, which is a little disappointing. I was expecting a hard-chiseled DOS platformer that felt like an old Apogee game. However it's not bad but in the end it just makes you want to play the old classics again.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely feels like the classics. From the physics, to the graphics, to the exit to dos menu option. This game truly lives up with the best of them. Grab this with the commander keen and duke nukem packs on steam and you will have yourself a classic gaming weekend.",
            "review_score": "1"
        },
        {
            "review_text": "A nostalgia fest for fans of the old days of 2d shooters such as Commander Keen and Duke Nukem. Made by the man who also made the excellent Iji, Hero Core and Hyper Princess Pitch. All are freeware, and are highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "great game now a days retro is the in thing and theres some really impressive indie games now and they seem to be getting even better but one style u still dont see recreated much is old dos vga and this game does it well i have really enjoyed it and would reccomend it to others just keep in mind it is a verry short game",
            "review_score": "1"
        },
        {
            "review_text": "To start: I used to add a header to these reviews, but since it often times made the reviews a bit too long, I've left it on my Backloggery page. Even though I don't think that'll be an issue for this game, I feel compelled to point that out anyways. Besides, it's worked fine so far.  Gameplay: If you've never played a DOS-style shooter before, think something like the original Contra but with more maze-y levels. If you have played a DOS-style shooter, this is pretty much par for the course. The stages are labyrinthean with plenty of secrets; some of which are pretty easy to spot while others require you to dig deeper into the level for something like a switch that activates something at the beginning of the level. I got an average of 95% of the points for each of the levels, with the exception of the boss levels, but that's just because of how the game scores points. There's four episodes which consist of five levels a piece; four stages and a boss stage. Hidden somewhere in the first four stages of each episode are items called cells which allow you to get some extra powerups before the boss of that stage. They're not essential, but they certainly do help.  Bosses in this game are actually really good; certainly a lot better than some of the bosses you'd see in the Commander Keen series. I only played through the game on Normal, but even on that difficulty they were a bit of a handful. The final boss was just plain excellent and a great way to end the game. As for the weapons, you have your standard pea shooter, a rapid shot, a five-way spread, a laser that splits and bounces off of walls, a homing explosive shot, and Chaos which just does things and kills enemies sometimes.   Apart from that, that's pretty much your lot for this game. It took me just over an hour and a half to beat the game on normal with a fair bit of exploration of the stages, but that's a pretty good length for a DOS-style game. It definitely has replay value, especially with higher difficulties and 100% playthroughs, so if you're into that kind of thing, this game will certainly be worth the $4. It's simple and compact, and there really isn't a thing Id change about it. 10/10.  Story: Unlike a lot of DOS-shooters, this game actually has a pretty good story. It's a bit hard to follow, but it's a fairly high-level Sci-FI storyline about the creation of life. Surprisingly interesting and a not half bad delivery of what could be perceived as a dramatic ending. 8/10.  Graphics: Fortunately, the game doesn't launch in CGA resolution; that would be annoying. Rather, it fullscreened to my native resolution of 1080p without a hassle, so that's all good. As for the art direction, it's quite good, even if the MURI suits look a bit like Robo-Bunnies. Apart from that, the world designs are good, the enemy designs can be absolutely fantastic, with the boss of Stage 3 being the big standout. I can't quite speak for whether or not it rigidly conforms to the EGA palette or not, but it looks DOS-y and it looks good. 5/5.  Sound: This is something that I don't think I've done in the year or so since I started reviewing games (three months since I started publishing Steam reviews): I'm not gonna rate sound. I really can't, since the game itself goes for yet another factor of the DOS design in that there is no music - save for the title track - and all of the sounds are blips. So yeah, it feels a bit weird to do that, but that's what's happening.  Overall scores are: 10/8/5/0; 9.2/10. A very solid little shooter that's well worth the money. I'll definitely play it again in the future.",
            "review_score": "1"
        },
        {
            "review_text": "I picked this game up for 39 cents. Not only does it have trading cards (that almost pays for the game, give or take a dime), but this feels like a legitimately old game, reminiscent of games such as Xargon, Gate World, Commander Keen or Duke Nukem.  Definitely pick this up for 39 cents, maybe even for the full 4 dollars, although the original Duke Nuken is on steam for 2.99. ",
            "review_score": "1"
        },
        {
            "review_text": "You know, I feel the nostalgia for the type of game this emulates. The old 2D shooters, like the original Duke Nukem. But as nice as it is to remember those games. They just don't hold up well.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a love letter to the DOS Era of PC gaming.  Mostly Apogee platformers Era (Duke Nukem 1, Cosmo's Cosmic Adventure, Secret Agent, Crystal Caves)  * 16 EGA-like colors * PC-Speaker-like sounds and music. * One button for jump, and one for shooting. * 16 frames per second scrolling (you can choose 32, but that ruins the immersion)  The game is pretty short, and very easy on normal difficulty, so I recommend higher difficulty levels for old school gamers.",
            "review_score": "1"
        },
        {
            "review_text": "Better than Mighty No.9  PS: This game NEED TO have Achievements.",
            "review_score": "1"
        },
        {
            "review_text": "110% authentic DOS gaming experience.",
            "review_score": "1"
        }
    ]
}