{
    "app_id": 267530,
    "name": "The LEGO® Movie - Videogame",
    "release_date": "2014-02-27",
    "developer": [
        "TT Fusion",
        "Traveller's Tales",
        "Feral Interactive (Mac)"
    ],
    "publisher": [
        "Warner Bros. Interactive Entertainment",
        "Feral Interactive (Mac)"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "LEGO",
        "Adventure",
        "Action"
    ],
    "achievements": 48,
    "positive_ratings": 1825,
    "negative_ratings": 374,
    "price": 14.99,
    "description": "Join Emmet and an unlikely group of resistance fighters in their heroic quest to thwart Lord Business’ evil plans—a mission that Emmet is hopelessly and hilariously unprepared for.  It’s a wild ride with a surprising mix of over 90 playable characters including Batman, Superman, Wonder Woman, the Green Ninja, Gandalf, Shakespeare,...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/267530/header.jpg?t=1546279947",
    "minimum_requirements": "OS: Windows®XP SP3, Windows Vista/7/8 with latest service packs and updates installed Processor: AMD Athlon 64 X2 EE 3800+ (2*2000 Mhz) or similar Intel CPU, such as Intel Pentium Dual Core E2180 (2*2000 Mhz) Memory: 2 GB RAM Graphics: NVIDIA GeForce 7600 GS or ATI Radeon X1950 Pro or better DirectX: Version 10 Network: Broadband Internet connection Storage: 10 GB available space",
    "recommended_requirements": "OS: Windows XP/Vista/7/8 Processor: AMD or Intel Quad Core running at 4*2600 Mhz Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 480 or ATI Radeon HD 5850 or better DirectX: Version 11 Network: Broadband Internet connection Storage: 10 GB available space",
    "reviews": [
        {
            "review_text": "Bought this for my kids and they love it. Both have spent tons of time on this game and it seems like it never gets old to them. Very good buy. I should also add that this game runs very well on low end systems. Have yet to get a complaint from them on any bugs or annoyances.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, awesome price. Everything is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "There should be a 'Game for Parent and Kid' Award for this",
            "review_score": "1"
        },
        {
            "review_text": "The LEGO Movie game is just like any other LEGO game, except for once it caters to people who actually like playing with LEGOS.   Instead of just breaking stuff and combining it into whatever you need, now sometimes you need to find instructions for more complex LEGO creations and then play a mini-game that gets you more involved with the building and let's you appreciate how much effort goes into these creations a bit more.  The 'job' system also caters a bit more to real LEGO fans since the jobs are the kind you get from normal LEGO sets, firemen, builders, wild west gunmen and cops.  The real difference from other LEGO games is the 'completionist' part. This game 'only' has 75 gold brick, but after the nightmare of collecting the brutal 250 gold bricks in LEGO Marvel, this is a much less frustrating and more fun experience.  Gone are the terrible racing games that were either too easy or too hard, gone are the overly long and convoluted quests for a measly gold brick. This is something I sincerely welcome and I really hope this stays this way.  You only have to get all the collectibles and all the rest of the gold bricks are in the bonus room, that's it and that's how I hope it stay for the next game.  The fact that I'm probably going to buy a LEGO set after playing this game speaks volumes on how this game is about the love for LEGOs.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely loved this game. I'm a fan of Lego games anyways, but this one was just hilarious. I feel that it could have been a bit longer, but has good replay value since I finished the main story and only have a 39.5% completion status!! Overall, VERY good game, worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game. Suitable For kid and adults. Im a big lego fan. Completed the game 100% very easy. The game has the same storyline as the movie, thumbs up and high scores for that!.",
            "review_score": "1"
        },
        {
            "review_text": "I own all or most of the Lego games, finished a fair few of them. I figured the Lego Movie game would be right at the top of the quality list but so far (after a few hours play) it's been rather - meh. I wish I could give it a neutral rating but since that's impossible, I'm going to give it a not recommended.   The main reason to play the Lego games is the fun of the grind, because you will grind a lot. So you have enjoyable humour and fast action within that grind. This game fails then in two ways.  1) The comedy is weak. It's not bad, but it's just rare and repeated. 2) The unskipable cutscenes on free play.  Compare this to say the great Lego Batman or Marvel franchises or LOTR, all of which really got the humour and grind right. Play any of those instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty fun, watch the movie first so you don't spoil the plot.",
            "review_score": "1"
        },
        {
            "review_text": "LEGOs are always fun with a friend. All cutscenes are taken directly from the movie and can contain major spoilers so make sure you watch the movie in first place!  8/10",
            "review_score": "1"
        },
        {
            "review_text": "BitzComms Reviews: The Lego Movie Video Game  (This review covers the PC - Your experience may differ from platform to platform)  I have to be honest with you - The Lego Movie came to me by complete surprise. For all the time I spend on YouTube, no word was spoken of the movie (at least that I saw) until I first saw the trailer for it on TV...   But then I was surprised even more when a video game was announced for it - It wasn't even a full year after Lego Marvel Super Heroes came out, and Traveller's Tales came out with a new game already?  It was more surprising that the game was coming to all major platforms, INCLUDING next gen platforms like the PS4, Xbox One, Wii U, in addition to the PC, Xbox 360 and PS3... Yikes.  The short development period between this and Marvel seemed like a sign that this game was going to blow HARD... But then I played it, and it is probably my favorite Traveller's Tales Lego game of all time.  STORY:  The game follows the story of the movie down pat... Which might turn off those who haven't seen it yet. I suggest you see the movie before you play the game, but even if you don't, the game doesn't feature EVERY scene from the movie... Some of the scenes that are in the game have parts that were cut from the movie, most likely to keep from spoiling the movie for those who haven't seen it. I won't explain the story itself, because we have a movie for that, and I wouldn't want to spoil anything.  PRESENTATION:  The Lego games that have been developed by Traveller's Tales over the years have had a reputation of exceptional presentation, and this one is no different. The game is fully voiced, and either they got the celebrity voices from the movie to do the game, or they just got really, really good sound-alikes. If it's the latter, I wouldn't be able to tell the difference because the acting in this game is so damn good. As I said before, the story is presented through scenes from the movie, and while that may sound kind of cheap, you have to keep in mind the short period between the release of this and Marvel. Plus, the scenes look so good already that you won't mind at all. It kind of harkens back to the days of movie tie-ins on the Playstation, which generally used scenes from the movie for the cutscenes of the game. Anyone remember Toy Story 2: Buzz Lightyear to the Rescue? (also developed by Traveller's Tales) The game also makes use of a new animation style - The characters actually move like actual lego... No more bendy, stretchy lego limbs. This is probably done to stay true to the stop-motion style of the movie.  GRAPHICS:  The game looks amazing, as everything is made of Lego this time around. The game also runs really well on low-end machines like mine, and that's always a plus.  SOUND:  Everything is Awesome!  GAMEPLAY:  Here's where things get pretty iffy - The game itself is a mixed bag. While this is my favorite TT Lego title so far, I can't deny this game has some serious problems. Let's first talk about the character selection - There are over NINETY characters... NINETY CHARACTERS. Don't get too excited though, as most of the characters are either clones of existing characters, or very minor characters that no one cares about. Most of the characters are different suits for Emmet. Wild Style or Unikitty. There are some good ones in this game, such as Lord Business, Metalbeard, Batman, Super Man, The Green Lantern, Wonder Woman and even the Green Ninja from Lego Ninjago.  Emmet himself is a pretty boring character as well. For the majority of the game, all he can really do is use instruction builds. He can't use master builds, and he doesn't have any interesting attacks or gimmicks. Most of the time, you'll be playing as Wild Style, Batman and Unikitty, switching to Emmet only when you need to use an instruction build. Eventually Emmet gets the ability to use Master Builds, but that's very late in the game.  Next, let's talk about the gameplay. The game follows the same basic formula as any other TT Lego title before it - Go through the levels, collecting studs and accomplishing objectives with preset characters, then go back and play those levels as any character to find hidden unlockables - Only this time it's mixed with free-roaming hub worlds, and my GOD these are underwhelming. Compared to Lego City: Undercover and especially Lego Marvel Super Heroes, these free-roaming segments seem to be just an after-thought. They are very small and contained. Not very much fun.  Next, let's talk about the levels for a minute. The levels are probably the best part of the game, with only a few stinkers here and there. The only problem is that many of them are very long, and when there's a bad level, there's a REALLY bad level. Each level is quite interesting, with its own gimmick and setpieces. There's an entire level that takes place on an under-constuction submarine that's careening down an ablaze Cloud Cuckoo Land. Many of the level designs are very inspired and smart, but they are quite long, and if you don't have a lot of time for one session, you're ♥♥♥♥ed. There are checkpoints placed around the levels that allow you to save your progress, but some of them are placed in areas where you really wouldn't notice them... oops.  THE VERDICT:  As a whole, however, The Lego Movie Video Game is quite solid, considering the short development period. There's a lot of content in here, and most of the levels are fun, if not a bit too long. I'm giving this game a 7.0 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, this was my first Lego Game. I knew that they are very popular but i never had the chance to play one. So it was just a matter of time when i would buy the first. So thanks Summer sale ;)  I recommend watching the movie first before playing the game but it sure works the other way round too. Soo ye, what to say about that game? Great, great and great. If you have a weak spot for Lego, why hesitate? Buy it! Now!   It got everything you'll need to enjoy couple of hours. The humor is hilarious (not just for kids, still funny for grown-ups), the gameplay and controls are awesome and the graphics lovely. I really love the details. You can basically destroy everything and gather so new characters with differnent attributes. And there are so many different characters (with different skill sets). Beginning from Emmet (the main guy) up to playing freakin' Batman! So if that doesn't bring you to buy this game, i don't know what would.   I mean, there are some glitches sometimes, but not that bad or so often that i wouldn't recommend this game. So all in all i would give this game 9/10 (not finished yet, but i don't see anything that would lower that score!)  Sooo, everything is awesoooome!  ",
            "review_score": "1"
        },
        {
            "review_text": "Its very good game! I saw levels with explosives and jokes and understand. In Lego Movie levels only with fun and jokes and funny moments and explosives. KA-BOOM! Redigit-Terraria. Legmakeit-Lego movie XD. Download this very cool game!",
            "review_score": "1"
        },
        {
            "review_text": "Game is so much fun. Best lego game on road.",
            "review_score": "1"
        },
        {
            "review_text": "I can't say why i dont like this one but there is something in this game that makes it bad when you look at other lego games.Every thing is LEGO concept is actually a really nice idea but it dont give that good feeling of lego games.",
            "review_score": "-1"
        },
        {
            "review_text": "is this co-op?",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and interesting video game. Everything is indeed awesome. Played this game cause of someone special. (Thats you Rage). *Sings Everything is awesome together* &lt;3. Must buy game if you loved the movie. Cant wait for Lego Movie 2. 8.6/10",
            "review_score": "1"
        },
        {
            "review_text": "this game is alot of fun it is good for aduilts but also better yet better for the kids I would say buy this game. I know I am working on getting the rest of them :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game!! I was Luckily my laptop was just able to play the and only suffered a few graphical issues and a couple of lag spikes but none to actually affect my gameplay, but is actually for my pc to be blamed since it has an Intel HD Graphics unfortunately. The levels were great and you're able to play co-op with a friend but I beleive it is only local since I haven't tested it out. Other than that its a great game to play with friends and family alike and was easily able to put in hours worth my time, but it is a bit short than other Lego games just to keep in mind. I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty fun for local co-op 2 player. Me and my wife play it and it isn't too challenging and we have a lot of fun. The game itself is best with controllers (the keyboard bindings suck). The storyline follows the movie but the game play is enhanced in some areas to introduce more detailed action sequences. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "I have just started this game, and I can rightfully say it is awesome. No more words needed.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have played in a while...no joke! Great graphics, story is funny and surprising. Characters are hilarious...10/10",
            "review_score": "1"
        },
        {
            "review_text": "its a lego game, all lego games are the same you do the same thing in all of them  i liked it",
            "review_score": "1"
        },
        {
            "review_text": "Morgan freeman voiced one of charachters. 10/10   SPACESHIP!",
            "review_score": "1"
        },
        {
            "review_text": "i only bought this because its lego and i think lego games are fun. like star wars and indiana jones. i did not watch this movie or do i plan to.",
            "review_score": "1"
        },
        {
            "review_text": "Everything is awesome! :)",
            "review_score": "1"
        },
        {
            "review_text": "game is awsome",
            "review_score": "1"
        },
        {
            "review_text": "Everything is awesome! :)",
            "review_score": "1"
        },
        {
            "review_text": "Everything is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun to play it has good graphics. But they could be better.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing movie. Great game.  The Lego Star Wars games are better in my opinion, but they don't seem to go on sale, so go for this or one of the other Lego games instead.",
            "review_score": "1"
        },
        {
            "review_text": "Great game filled with adventure",
            "review_score": "1"
        },
        {
            "review_text": "Love it EVERYTHING IS AWESOME 1 prob when u do the second everything is awesome dance thing it does not work for mac but I figured out how to do it Y= Y+U X= H+J A=B+(SPACE) like u have to hold them down at the same time. Its wired bug but fun game in general AWESOMEMME suggest it to eveyone that saw the movie. Its a great game overal graphics not bad there alright but better then some other lego games this one is one of my favorites. I suggest u all to play it any age. Even if your 30 and ur like wow why am i playing a game for 6 year olds its not really like that this game is for all ages and very very fun",
            "review_score": "1"
        },
        {
            "review_text": "Every thing is awesome, Everything is awesome when your not a King!",
            "review_score": "1"
        },
        {
            "review_text": "dont buy it their are so many bug which I can find very frustating like my chracter stuck or some moving shet cant move and also sometime the enermy dont spawn and it make the game stuck and the only solution is to restart the whole level if u dint care my warning and u found I bug like a did and get ♥♥♥♥ off and smash your computer remember u have been warn",
            "review_score": "-1"
        },
        {
            "review_text": "Evertything is Awsome!!!....Buy it      awsome",
            "review_score": "1"
        },
        {
            "review_text": "Poorly ported. The in-game input controller does NOT play nicely with Logitech controllers, but does with Xbox controllers. No video options in the main menu, but inside the game (thank you, Sneakytryx)  The one good thing I do like about this game is that it keeps the childish allure of being a Lego video game.",
            "review_score": "-1"
        },
        {
            "review_text": "i have two major problems with this game, 1. the voice acting, is not good, 2.the lighting is not to my liking, i was expecting the lighting to be like the actual movie, but was somewhat dissapointed to find out otherwise. aside from those 2 problems the game is great. (its may be that my settings arent set right, so if you think this is the case, please tell me)",
            "review_score": "1"
        },
        {
            "review_text": "This game is just a normal lego game... The developers were so lazy that they needed to put cutscenes fromt he movie! ",
            "review_score": "-1"
        },
        {
            "review_text": "This is a badly ported game from the consoles with hard to use controls and poor menu navigation. The options are hard to figure out and it isn't possible to use the mouse in this game.  2/10.  (I've played through the first mission)",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible port. Can't even use a mouse in menus! Seriously reccomend against this unless you use a controller.",
            "review_score": "-1"
        },
        {
            "review_text": "It was amazing at first, but I slowly became disappointed when I got to the wild west world. They tried changing the game mechanics for the better, which is fine once in a while, but it just doesn't feel like a lego game. I'm switching to another character every 10 seconds so I can progress in the level. The worst part is the machines only robots can use. It's this small minigame where you hop around as a block on this puzzle and get to a battery while dodging the skull blocks, and they make you do this minigame way too much in the game. Some mechanics are good, like bigger hubs with cars and the ability to have like 8 people to pick from at once, also I like the bonus room. But overall, a lego game should not feel the way this game did. I've played so many lego games when I was younger, but this game was just irritating. The humor isn't witty like the old games. In the old games there were bonus rooms you looked forward to going to because there were special activies you could do, but in this game it almost feels like a drag to go to them because you have to constantly switch to different characters for their abilities...  Overall Rating 7/10",
            "review_score": "-1"
        },
        {
            "review_text": "Everything is awsome",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed many of the early LEGO titles, but not this one. They established a system of controls and gameplay in those early games that worked well. In this one, they changed it using different keys and gameplay, and of course, it is based on the LEGO Movie, which was a letdown in its own right. Especially if you liked the creative storytelling in the early games, you will be let down by this one, best to pass on it.",
            "review_score": "-1"
        },
        {
            "review_text": "Brought this game for 28 Pounds and im just disapointed. The first thing that I CANT stand are the stupid choice of controls. The seccond thing that annoyed me is that it doesn't even teach you the controls because the controls on screen are just xbox buttons. Finally the game has no proper cutscenes just clips from the movie, I am getting this game refunded today because this game was absolute GARBAGE.",
            "review_score": "-1"
        },
        {
            "review_text": "EVERYTHING IS AWESOME! EVERYTHING IS COOL WHEN YOU PLAY THIS GAME!",
            "review_score": "1"
        },
        {
            "review_text": "brought and installed, crashes on start up, everything is not awesome",
            "review_score": "-1"
        },
        {
            "review_text": "the controls are crap. i never got passed the first level because of that. the point of view seems crappy and its mostly cutscenes from the movie. not the top of the line for lego video games.",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay is pretty good, very wierd graphics tho ( I know its Lego, but really... there gotta be a limit lmao )",
            "review_score": "-1"
        },
        {
            "review_text": "I'm astonished to see I'm the only one don't like this game. In general:Go buy Lego Marvel Super Heroes or Lego Lord of the Ring if you want enjoy a great Lego game,and just watch the movie to feel the Lego culture. First of all:NEVER play this game before watch the movie,NEVER.The game is a awful spoiler of the movie,it cut off too many fun part from that. The combat system is backsliding from LMSH(Pretty good,although heavy firepower character like ironman is too OP),You'll find accurately melee enemy without hit air or other object is a hard job.Ah,mysterious locking system. Stage design repeating is one of this series' main problem,and LMV proved this.I have a strange feeling that maybe TT games forget how to reflect every character's difference,all you need is smash some brick and rebuild them with anyone.(Except Emmet,The only main character don't have master builder skill.Poor Emmie.) Collectible is simplified,that's OK.....Consideing I meet a darn bug in both LMSH(a gold brick missed) and LLotR(game said I collect 4 item in dead marsh and don't give me the mithril brick)'s first playthrough,I can't say this is bad.....Atleast I needn't open another save and waste another 30 hour to unlock the 100% achievement.  I really like the movie and the whole series(Sorry to say I play Harry Potter,Star Wars,Indiana Jones and Pirates of the Caribbean with pirate version,I don't have too much free income when I was a student),and my save is 81.6% when writing this(I'll finish it),but I would never suggest my friend to buy this game.In my opinion,It's a game which only recommended for a big fan with a free 30 hours and 30 dollars.  We always say'You can't spell 'ignorant'without 'IGN'',but,this time,IGN and their 6.5 is right.",
            "review_score": "-1"
        },
        {
            "review_text": "so (now) i do reccomend this game, cause it is pretty good. but, it has to many glitches. like, waaaaaaay to many. they all are fixable (that i know of anyway) but they can be pretty darn annoying. other than that, its still a great game. not as good as lego marvel, but better than lego batman 2 in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "the camera angles gave me a headache in the first 10 minutes of gameplay. love the movie, dont love the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game for all ages, see the movie first thou.",
            "review_score": "1"
        },
        {
            "review_text": "As tongue in cheek as the movie, if you like other LEGO games you will feel right at home. Great support for controllers and split screen. Playing coop with significant others or kids is great!",
            "review_score": "1"
        },
        {
            "review_text": "amazing game great if you like lego and have watched the movie i recomend to watch the movie first it makes more sence also a couple glitchs but no many i rate 9/10 fantasic enjoyable and i have convinced people to buy :D",
            "review_score": "1"
        },
        {
            "review_text": "Best LEGO® game in quite some time. 8/10. Short and fun. Watch the movie before you play the game though, or you will get the movie spoiled. But as with every other LEGO® game, do not buy at full price. None of those are worth it. Except LEGO® Island. or LEGO® Rock Raiders.",
            "review_score": "1"
        },
        {
            "review_text": "You can save the world from an 8 foot tall evil mastermind voiced by Will Ferrell as Gandalf and Shakespear along side with a wizard voiced by Morgan Freeman. What more could you want?",
            "review_score": "1"
        },
        {
            "review_text": "One of the most awesomeness games, 9/10 Because the Developers Of this game skipped a few a clips and scenes, But understandable it has good local co-op. It also contains 96 charecters (Not trying to spoil) Some of them were barley even shown on the movie, or video game but are still playable!Lego games that are co-op,adventure and actions are my favorite types, like this one.Also along with lego the hobbit,Marvel Super Heroes,Lord of the rings, Lego batman 1 and 2 and finnaly Lego Harry Potter:Years 1-4 and Years 5-7.This game is pretty funny, you get to wear pants that give you special effects (More Spoils) Like theirs one with a fart effect, (My favorite, must jump for sound effect) a drilling effect,music and those 3 are the only ones im going to say so. BOOHOO TO YOU!Anyway,They also added charecters from Ninjago,Dc Universe and more! (Also Hobbit :3) YOU SHALL NOT PASS!!!! You should know who this guy is if your in a Super Lego FanCLUB like me :3! Also my favorite part, you get to become the villains Like Robots, The Last and final (Powerful) Boss, President Business and LORD Business.Their are also 4 free worlds to explore, including bonus room. (Unlock Bonus Room by completeing games story mode.) So That Means...., Lego Brick Adventures! Their is 20 red bricks......... Sometimes i call them deadpool bricks because i play Lego MARVEL Super heroes to, (I got all of them) Before i go like i said, Overall the game is 9/10 to me, let me hear your thoughts!!!!!!! :_) (Watch the movie first to understand some gameplay or clips) Just a reminder :D",
            "review_score": "1"
        },
        {
            "review_text": "hours and hours of fun.",
            "review_score": "1"
        },
        {
            "review_text": "everything is awesome",
            "review_score": "1"
        },
        {
            "review_text": "A lot of game-breaking glitches. During the course of my gameplay, I had to restart at least 3 missions because of glitches (charachers gets stuck on the ground or begind an object or important scripted events would not trigger). Because of the glitches, do not explore the levels too much by flying and don't try to be wise or take shortcuts. Be sure to do what the game wants you to do. The game is fun otherwise, but clearly rushed and not finished. For this reason, i would not recomment. Maybe try other lego games instead ?",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't expect much from a movie game, but this actually is really good.. considering it is a movie game. I love the fact that all the original voice actors are here, giving the game the authentic experience of the movie. The dialogue gave me some good laughs. I like that there is some replay value in this game after unlocking all characters, by going back to previous levels to find all the secrets. Overall a really nice game!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Even though it crashed on me when I was about to escape the Melting chamber, I think that everyone should download it because..... EVERYTHING IS AWESOME!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Its alright I don't reccomend you buy it. I just bought its coz it was like 5 bucks.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so fun if you have seen the movie and you are a fan of th elego series!",
            "review_score": "1"
        },
        {
            "review_text": "It's a console port through and through... I think they forgot mouse control... but apart from that, really enjoyable game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is just as magical and fulfilling as the movie. Wonderful.",
            "review_score": "1"
        },
        {
            "review_text": "Not like the console version, no open world",
            "review_score": "-1"
        },
        {
            "review_text": "Definately not the best of Lego games, but it's pretty legit.  Cons:  The cutscenes' music is offbeat, and often ruins great scenes from the movie. The melee is pretty bad due to the fact that they are trying to make the minifigs as realistic as possible. EVERTHING IS AWESOME DDR MINIGAME. 100% TRUE.  Pros: The graphics are by far the best I've seen in a Lego game. Pretty good In game music isn't the best, but it's pretty well done. It runs perfectly. It appears that they got actors like Will Ferrell and Chris Pratt to return to act during the game instead of reusing dialogue from the movie. I'm not talking about the cutscenes by the way. It's a Lego game. Emmet has a jackhammer. ;) Nuff said Guns actually kill someone after one shot.  Overall, it's not the best, but certainally not the worst.  8/10 ",
            "review_score": "1"
        },
        {
            "review_text": "emmit is not a master bulder ",
            "review_score": "1"
        },
        {
            "review_text": "Saw the movie. Played the game. 100% 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Got the Lego Movie Videogame on Xbox One so I have played it on that. Good Lego game that follows up to one of my fav kids movies. The new concepts felt great and the cutscenes from the movie blent in seamlessly. I feel like the graphics were slightly downgraded though...  6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "A fun game that follows the plot of the movie. You'll recognize a lot of the characters, and many of the sub-missions feature background characters from the various locations.  That said, this game is *incredibly* buggy. I haven't encountered anything game breaking or that required me to start a new save file, but I have had to restart levels that crashed, find workarounds for broken missions and so on. I'd still recommend it for fans of the LEGO games, just be aware that you might need to get creative and restart levels here and there.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the Lego Movie, and I enjoyed this game. Whilst the gameplay can get slightly repetitive (sometimes it feels like elements have been added just to pad out levels for the sake of it), the joy of playing in the Lego Movie universe usually tides you over. My children are big fans too.",
            "review_score": "1"
        },
        {
            "review_text": "Spectacular game, mind-blowing graphic design, engaging storyline and unique characters.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy this game, however on the level flatbush rooftops after you repair the zipline thingy as emmet only emmet crosses the other two characters become glitched thus resulting in you being unable to advance due to a masterbuild coming up after building destroying the swat latter things, i would like to know why i expierence this glitch because i have been waiting for this game ever since it came out. ",
            "review_score": "1"
        },
        {
            "review_text": "Nice game!, It's a bit better than other games! Because, it's a bit different!",
            "review_score": "1"
        },
        {
            "review_text": "Everything is AWESOME!",
            "review_score": "1"
        },
        {
            "review_text": "Everything is awesome !!!",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game with my 4 year old son with a gamepad. I foun this more fun than I expected. Would recommend for sure.",
            "review_score": "1"
        },
        {
            "review_text": "Basically, it's like an interactive version of the movie, which, quite frankly, is awesome. Also, I just participated in a in-game dance party and earned studs, so...I see no downside. Everything is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun to mess around with, and really goofy dialogue. The playing a bit straitforword and the KraGlaizer mini game is annoying (X action Y tag A jump) but still something I really love.",
            "review_score": "1"
        },
        {
            "review_text": "i'll see this as a feel good game :D. Lots of fun!",
            "review_score": "1"
        },
        {
            "review_text": "You know that really cool film that came out, the one that was intended to motivate anyone to be creative ? Well this game... truly is not... that. I am a big LEGO fan and I have enjiyed multiple LEGO games, and to be honest, this one does not cut it. Maybe if you are younger than 12 and you liked the film, but for anyone older, definetly not the game to get. In this verison of the LEGO movie, you aren't getting the good voices from the film, but slightly similar voices. It does ad new building features, which are typically not included, yet they are better than most. Anyway, I have to say in the end it is pretty boring and felt more like a chore than a game. I enjoyed the film and expected way too much from this game, so as a conclusion, I'd wouldn't reccomend this game unless you are completely blown away by the LEGO movie. Just get LEGO Jurassic World, way better.",
            "review_score": "-1"
        },
        {
            "review_text": "Yea, This is a great game problably better then the others and for once everything is made out of lego, i would totaly recommed this game to my friend if there looking for a good lego game.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, Great Movie, what can I say more?",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely fantastic! I had doubts at first because sometimes Lego Games get a bit repetetive, but this was not the case at all! I would reccommend it for anyone who loves lego and you don't even have to have watched the film, it narrates it all for you as you play along so that everything makes sense.",
            "review_score": "1"
        },
        {
            "review_text": "Everything is awesome!!!  Great LEGO game. Especially like the fact that cutscenes use real LEGO the Movie parts.",
            "review_score": "1"
        },
        {
            "review_text": "Honest Review, This game is really cool! I didn't expect it to be like this, or to be able to run it. This game takes me back to when i played (and still have for the nintendo gamecube) Star Wars II The Original Trilogy. If you played that then i recommend a controller while playing this game. I even played other LEGO games, like for the Xbox 360, Indiana Jones 2 The Adventure Continues, Disney Pirates of the Caribbean The Video Game, and Star Wars III The Clone Wars. So, i do recommend if you loved the movie or didn't even watch the movie, like myself i never watched the movie, and i still get a laugh out of it, I myself recommend this game, i can say, everything is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty Long (in a good way?). Couldn't finish it by myself. Was pretty fun. Going to try and rope my girlfriend into helping me finish it one day.",
            "review_score": "1"
        },
        {
            "review_text": "The LEGO games follow a strict formula: Take a franchise/movie, recreate it in the most amazingly silly way possible, and make the audience replay memorable scenes in beautifully designed set-pieces. Star Wars, Middle Earth, Batman, you name it- in each LEGO game you get what could best be described as an affectionate parody, with MiniFigs and an awful lot of brick.-smashing. And The LEGO Movie Videogame is just the same, with all the good and the bad this brings.  The LMV follows the basic plot of the movie: Normal everyday construction worker Emmet is pulled into an ancient prophecy that claims him to be the only one to save the world from a doomsday weapon called 'The Kragle'. Despite being utterly unqualified for the job he does his best, and hilarity ensues.  If you know the movie (and you should) you'll find it hard not to smile a few minutes into the game. The complete cast is there, the setpieces are amazing and occasionally outshine the movie, the voice acting is pitch perfect and the undiluted charme of giant scenery build out of LEGO is as ever-present as ever. The game looks amazing and pulls a lot of awesome scenes together to form a narrative that is pretty close to the movie.  As per usual, you control a growing cast of characters, each with their own ability set. Emmet can build sturdy objects with the proper instructions, and can smash through special bricks with his drill. Wyldstyle has some extra agility and can jump and climb on certain ledges, Batman gets his ever-useful Batarangs and grappling ropes, and so on. Using and combining these abilities make the bulk of the level's challenge, and the game does a good job of adding layers to the formula as the cast expands.  Controls, also as usual, are nice and tight enough. The keyboard is a bit inferior to a good gamepad, but both work in a pinch. Switching characters and pulling off their moves is easily learned, and the game goes the extra mile to pop up tooltips if you keep missing a hint. Despite the cheerful toy aesthetic children will probably be overwhelmed by the action. There is always somethign going on, there is always something to do, and while death is cheap (you only lose a couple of studs, which are the in-game currency for everything) there is a certain difficulty here, a tad bit too easy for older, experienced players and a tad bit too hard for someone who's just learning the ropes.  With a ton of unlockable characters, mission and freeplay game modes, and downright over-the-top-awesomeness, the LMV should be easy to recommend: It is an awesome game and filled to the brim with charme and action. Still, I need to stress that this game makes not exactly much sense if you do not know the movie. And even IF you know the movie, you'll have a hard time following events, so much that the levels stop being a string of related missions and instead become little self-contained bits connected with (occasionally edited) movie footage.  And this is odd, because the game clearly knows what it is doing. The movie has a bike chase, which is awesome. The game stretches this chase over a whole level, and adds to it, and makes it just twice as awesome because this time, it's you playing that scene. I would have loved to see the team make their own plot, with in-game rendered cutscenes, and maybe explore the LEGO world a bit more.  Still, this is nitpicking. The fun is there, and chasing down all achievements and unlockables will take a while- and this is a game where you abseil into a LEGO chicken, get encased in a rainbow eggshell, have a unicorn-cat smash that eggshell and build a toy-mouse car out of the bricks, which you can then ride, as Batman, all the while grumbling how rainbows are soo corny. Need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "Omg its a robot I had better turn invincibility on. This isn't a broken mechanic at all.",
            "review_score": "1"
        },
        {
            "review_text": "for reference: I've been playing lego games since the knight's kingdom cd-rom on my windows 98 pc, and then played the consle titles from star wars 1 on gamecube and xbox until harry potter 2 and batman 2 on wii.  review:  the lego movie game plays like all the others in most respects. you can switch characters and play a 15 level story mode with free play to get all the collectibles you missed.  a change from previous lego games is that the characters movements are more realistic. true to the movie, the limbs don't bend, and nothing moves in such a way that it couldn't in real life bricks.  as usual, the mechanics are about the same, but with a few twists. the drill is included as a way to break tiles.  combat is relatively easy. just button mash to either shoot or punch.  the game felt short for a short runthrough, but i was used to multiple episode games like star wars complete, harry potter, and batman.  you'll probably end up spending more time than me trying to get the minikits and characters.  the dlc is worth the 74 cents i paid for it, but i just don't use it at all.  there is just too much of that everything is awesome song. it was funny at first as a joke, but now it has gone too far.  levels can sometimes have you sitting there for a bit wondering what to do if you're not paying enough attention.  unikitty is pretty hardcore. i think i heard some growls \\m/  overall, it was worth the 6 bucks, but not much more.  if you like lego games, this one would be on par with other titles, and you'll enjoy it if you liked the movie, as well.",
            "review_score": "1"
        },
        {
            "review_text": "Tired ? Bored ? Sad ? Depressed ? Play this",
            "review_score": "1"
        },
        {
            "review_text": "Everything is awesome!     Especially in this game! :)",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as the other Lego Games, (Indiana Jones, Star Wars, Marvel, etc) But still has its okay moments",
            "review_score": "1"
        },
        {
            "review_text": "Over all it's a great game, it's fun. however, its not properly made for windows, it looks like they just took the XBOX version and quickly made a pc version overnight. since at one point i had to use the XBOX controles instead of the keyboard ones, and sometimes the charaters would get stuck.   AI: 5/10, Your allies wont fight the enemies most of the times, and if theres a single block between you and your ally, then your ally will get stuck.   No graphical options, so you're stuck with 1024x768.  It's got most of the key moments from the movie.  Fun: 8/10 Everything else: 7/10   Overall rating: 7/10",
            "review_score": "1"
        },
        {
            "review_text": "The only LEGO game I bought Why? Because it's LEGO, real LEGO Not like Batman LEGO, LOTR LEGO, Marvel LEGO Anyway, have this thumbs up",
            "review_score": "1"
        },
        {
            "review_text": "You can play as Gandalf wearing Disco Pants.  911/10 would disco again",
            "review_score": "1"
        },
        {
            "review_text": "the villan in this game just needs to sweaten up bye understanding and just needs a hug.",
            "review_score": "1"
        }
    ]
}