{
    "app_id": 267670,
    "name": "Realms of Arkania 1 - Blade of Destiny Classic",
    "release_date": "2014-01-10",
    "developer": [
        "attic Entertainment Software GmbH"
    ],
    "publisher": [
        "United Independent Entertainment GmbH"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Classic",
        "Fantasy"
    ],
    "achievements": 0,
    "positive_ratings": 43,
    "negative_ratings": 23,
    "price": 2.49,
    "description": "Blade of Destiny (1992) is the first part of the glorious Realms of Arkania Trilogy...An Orc army stands ready to attack Arkania's villages and towns. The only hope of saving the land lies in the legendary Blade of Destiny. Can you find this magical weapon in time to stop the siege?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/267670/header.jpg?t=1447359660",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: 1 GHz Processor Memory: 256 MB RAM Graphics: 3D graphics card DirectX: Version 7.0 Storage: 30 MB available space Additional Notes: Running on integrated DOSBox",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I see Blade of Destiny as a preview to the main adventure -second part of the trilogy Star Trail where lots of secrets and suprizes awaits you.Blade of Destiny just shows you some game mechanics , plus you can train and test your heroes in oder to import them to the next part of the trilogy.Still it is a fun game to start on your introduction in the Arkania world.   A bit late , but i reccomend to edit - dosboxrealms1.conf - this file can be found in the game directory, few lines have to be changed: scaler=advmame2x ; cycles=18000 . scaler makes picture a bit softer and 18000 cycles looks like the optimal speed.",
            "review_score": "1"
        },
        {
            "review_text": "It's an old classic game that most oldschool players are familar with and it has no need to be reviewed.",
            "review_score": "1"
        },
        {
            "review_text": "If you wanna spend $4 just to see how poorly the RPG world was back in the early 90s, then this is the game for you. It maps poorly, the interface is all over the place, and the melee combat and spell options are absolutely unusable.  One small example, is you can only fire, attack or cast spells in vertical or horizontal directions; no diagonal options. I found it frustrating and a waste of good money, but you may see things differently and it'll only cost you $4 to find out :-)",
            "review_score": "-1"
        }
    ]
}