{
    "app_id": 267600,
    "name": "Airport Simulator 2014",
    "release_date": "2013-12-19",
    "developer": [
        "United Independent Entertainment GmbH"
    ],
    "publisher": [
        "United Independent Entertainment GmbH"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Management",
        "Singleplayer"
    ],
    "achievements": 0,
    "positive_ratings": 143,
    "negative_ratings": 803,
    "price": 6.99,
    "description": "Booming turbine noise, kerosene smells in the air and constant change and new challenges: The daily life of a large airport is perfectly presented and is a particular challenge in this professional and economic airport simulation.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/267600/header.jpg?t=1447359652",
    "minimum_requirements": "OS: Windows XP / 7 / Vista / 8 Processor: 2,4 GHz Pentium or 100% compatible CPU Memory: 2 GB RAM Graphics: Nvidia Geforce 6800GT, ATI Radeon HD 3650 DirectX: Version 9.0c Storage: 200 MB available space",
    "recommended_requirements": "OS: Windows XP / 7 / Vista / 8 Processor: 3,0 GHz Pentium or 100% compatible CPU Memory: 4 GB RAM Graphics: Nvidia Geforce GTX 560, ATI Radeon HD 6970 DirectX: Version 9.0c Storage: 200 MB available space",
    "reviews": [
        {
            "review_text": "Airport Simulator might be the most tedious and boring game ever released. Heres what you do in this game: 1. Select gate for plane to taxi to. 2. Extend tunnel. If its a passenger plane: 1. Drive stairs to gate. 2. Drive bus to gate. 3. Drive luggage wagon to gate. 4. Drive interior cleaning to gate. 5. Drive exterior cleaning to gate. If its a cargo plane: 1. Drive cargo wagon to gate. 2. Drive exterior cleaning to gate.  Wait 5-10 minutes  1. Drive everything back to the garage.  Thats literallyy it. Theres no management, there is no way to lose you just get money for every task you do. You start with 8 gates even though youre probably never going to use more than half of them at a time. You can hire 'helpers' that drive the vehicles for you. The game is over once everything got an 'helper'. The graphics are bad but you cant really expect good graphics from a 15€ game.  While playing it I got the feeling that devs were never even close to an airport. On what airport do they use tunnels and stairs/buses on the same plane? On what airport does the luggage go to end of the airport and the passangers to the other?   The game is also riddled with bugs. When you save the game all textures and models unload and all you see is the skybox for about 3 minutes. The Tunnels jiggle all the time and get stuck inside the terminal. When i tried to taxi a plane back to the runway the game just crashed.  Not only is this game awful it is also falsly advertised: It clearly says in the description that there are 'Many management and business options for the expansion of terminals and extension of runways' which there are none. Not a single one. It also says its available in german, french and italian which isnt the case either. Steam finally has to hire someone that plays every game for at least an hour before it is made available on the store.  TL;DR Do not under any circumstances buy this game, dont even accept it as a gift.",
            "review_score": "-1"
        },
        {
            "review_text": "This game made me question the purpose of my existence",
            "review_score": "-1"
        },
        {
            "review_text": "Maybe at some point there is more to this game, but for now, it is basically 'Airport Vehicle Simulator'. The best bit of the game is where you get to drive around the truck with the stairs on it, and you can pretend you are in Arrested Development. Otherwise, I have no idea. And I like weird games, but this is just very strange. Going to play it a bit more and see what happens. If I understood the tutorial correctly I believe I have to earn money completing the driving tasks to pay other people to do the driving tasks for me. But the driving is the only thing you do in the game anyway? I guess if you like driving around airport vehices with poor physics and no damage model (that time I bounced off the passenger walkway with a bus full of people going to the terminal was a little scary, but I received no negative feedback), then this is the game for you. Looking forward to seeing a plane land, or something.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad Bad BAD  Crashes alot and even the cursor in-game doesn't wanna work.  0/17",
            "review_score": "-1"
        },
        {
            "review_text": "For when you have absolutely nothing better to do in your life (this includes watching paint dry)",
            "review_score": "-1"
        },
        {
            "review_text": "This was a complete waste of money! :(",
            "review_score": "-1"
        },
        {
            "review_text": "Airport Ground Crew Simulator 2014.",
            "review_score": "-1"
        },
        {
            "review_text": "Way to many Bugs Dont buys it",
            "review_score": "-1"
        },
        {
            "review_text": "Pointless",
            "review_score": "-1"
        },
        {
            "review_text": "This game fundamentally does not match the description :(  I had a better airport simulator 10 years ago. The game is intersting only if you have something else to do while it plays itself.",
            "review_score": "-1"
        },
        {
            "review_text": "This has to be the most tedious, boring game I've ever played. NOT recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "Hey you, yeah you, do you like watching paint dry or grass grow? Then do I have the game for you. Airport Simulator is a game where almost nothing happens in its entirety and I really mean that. This game is so slow that you can grow a beard that is 2 feet long before you complete the first challenge. I mean what else is there to say its so BORING! I have done household chores that are more fun than this game FOR REAL! Another thing is that they are charging $10 for this abomination of what they call a game. Honestly your better off just giving that money to a homeless person because they will be able to find more enjoyment with it. Then there is the sound, dear ♥♥♥♥ing god what were the programers thinking. When you start up the game it sounds like a smoke detecor went off in your house it just drives me crazy. I honestly can't think of anything positive to say about this game and most games that I end up getting that are bad I have at least one positive to them, but not this one. So why did I buy this then? Well have you ever looked for the worst possible game to play just becasue it is bad? I thought that I would get this game because it is literly the worst rated game on steam, its true just how many games are there on steam that have a overwhelmingly negative overall user score almost none. So I bought it expecting that it would be a good laugh, but enjoyable for being so bad like the Tommy Wiseau's The Room is, instead I was crying and wishing that I had never spent my money on this garbage. I bought this before the steam refund ever existed so I was basically stuck with this thing. Overall don't buy this garbage of a game even if it is on sale you will just waste your money and if you think that it would be funny to send to a friend as a gag gift you would be a terrible person because it will basically give them cancer. There are SO many better games that you can get for $10 and even less. Don't infect your hard drive with this disease and I honestly hope that this trend in all these fake simulator games will just die and fade away because they fill up steam promising fantastic experiance, but instead they just ♥♥♥♥ your wallet and waste your time.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely abysmal. The only element to the simulation is driving Ground Support Equipment, and the pace is mind-numbingly low. Read other reviews online, but in general, DO NOT BUY.",
            "review_score": "-1"
        },
        {
            "review_text": "Highly not recommended, boring with bugs",
            "review_score": "-1"
        },
        {
            "review_text": "Do you like airports? Do you like simulations? Well uhh.. Look elsewhere. This game is so buggy it makes me wonder if the developers played more than ten minutes of it. The two biggest faults are that vehicles get stuck all over the place -- even when the game's AI is supposed to be handling them -- and there's no fast-forward button. Some tasks take 9 minutes to complete. That's 9 minutes in REAL TIME that you literally have to sit there and wait. The game leaves a LOT to be desired, and it's a shame, because the overall design/layout for the various tasks and stuff is not entirely awful. With some major overhauls this game could actually be worth it.  That being said, I completed the game to the best of my ability, unlocked all the upgrades for all the gates (took me a solid 24 hours) and even after having everything automated the computer still managed to get vehicles stuck. I've encountered all kinds of wacky, silly bugs in this game, a few of which make the game unplayable and require you to load a save you made before encountering the bug.  I'd love to see this game updated and fixed, but until then, don't even consider spending money on this terrible, terrible game.",
            "review_score": "-1"
        },
        {
            "review_text": "The maximum price I would pay for this game is $0.99. Almost everything people have already said, I can agree with. With one exception. I actually did enjoy the game for the first hour or two. The challenge behind making enough money to automate things was great. However, that quickly dies once you find that you have two major steps in playing the game.   1. You work your butt off driving things and trying your hardest to get planes out on time.  2. Once step one is nearly complete and a number of automation is set up you drive around in a vehicle watching things go. Even then your ground crew isnt the most efficient because they will take much longer to drive to places than you.   Sitting back and watching a painfully slow airport sim (which you have no control over other than driving vehicles) is crap. You may not realize it at first but when it dawns on you the game gets put into the 'junk' category in steam.  ----------------------------- 'Many management and business options for the expansion of terminals and extension of runways'   -This is so bs. You purchase more gates at the terminal. Extension of runways...no. Never happens. Nope. no. ----------------------------- 'Countless missions and tasks that the player has to fulfill in order to guarantee a successful airport' -One mission. Drive. Drive something different...but drive. Drive from the car park. Drive to the plane. Drive into the red box. Drive your vehicle back. Repeat with a different vehicle. This is the game step by step. Where are the missions? Countless tasks? No... ----------------------------- ' coordinating air traffic controllers and technical staff' -Game tells you what to do, what order (forced to do things in this order), and when to do it (once again forced to do it at a certain time and in a certain order.)  ",
            "review_score": "-1"
        },
        {
            "review_text": "Its not worth the money or time.save your money unless you just like throwing money away.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY! This is NOT an 'Airport Simulator', it is at BEST an 'Airport Support Vehicle Simulator'. The entire game consists of driving (very, very slowly) various utility vehicles between airport gates. The whole 'point' of the 'game' is to earn enough cash to buy AI drivers to take the punishment of 'playing' this sim instead of you.  You might think an 'Airport Simulator' would involve scheduling flights, or building/upgrading facilities, or even just managing staffing levels to ensure smooth operation. No, no, and no again -- not with this title.  But hey, if you've always dreamed of driving a baggage cart from the garage to the airplane and back, knock yourself out. :-)",
            "review_score": "-1"
        },
        {
            "review_text": "Boring game simulator 2014. Seriously this game is just going slow (pacing), audio is never working, physics engine is a joke and graphics are outdated. On the other hand, it makes a nice screensaver, too bad it can't run in background / while the mouse isn't in the game.  1/10",
            "review_score": "-1"
        },
        {
            "review_text": "Unlless you like watching timers countdown endlelssly this is a terrible game, I truly hoped for more...",
            "review_score": "-1"
        },
        {
            "review_text": "What an absolute piece of ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "An airport simulator... That was promising. Except that there is no tower control and no management of buildings inside activities. All you have to do is move vehicules around and you have seen it all in half an hour.  On the other hand it cost me less than $2.00...",
            "review_score": "-1"
        },
        {
            "review_text": "NOT A SIMULATION GAME!!!!!  Honestly dont even know what to call this... literally you just drive vehicles to the planes... then sit and watch. No upgrading buildings, hiring personel, managing airline contracts. You just drive, sit.. and watch. The point being this game is a joke and im so ♥♥♥♥♥♥ I excitedly spent 14.99 instead of reading the reviews first...",
            "review_score": "-1"
        },
        {
            "review_text": "Piece of Absolute Crap. Its like going to the carnival and having your wallet stolen. This honestly exposes a weakness in steam that big publishers could exploit. The more of these bombs I purchase. The less likely I will spend money again on this platform.  At least have some quality control...   Oh yea, and to that idiot european developer Sjoren or whatever who was the dev lead.  I cant believe you would even put your name on vandalism like this.  FU  ",
            "review_score": "-1"
        },
        {
            "review_text": "#YACGS  What does that mean? It's quite simple: Yet Another Crappy German Simulator.  I don't know what it is with German developers and their obsession with simulation games, but I understand even less why they think releasing buggy pieces of utter crap like this is fine. Maybe it's because Valve doesn't really care and lets them get away with it.  Airport Simulator 2014 is just plain awful. Everything is so slow, you'd think it's Dear Esther on wheels. The graphics look like they're from the early 2000's, and pop in so slowly after loading a saved game that it takes a minute to show everything... *IF* you end up getting everything shown, that is. During my playtime, half of the assets suddenly disappeared, and reloading a previous save file or restarting the game didn't fix it. All the terminals were gone, leaving only the gates to hang in mid-air. The river in the background dried up mysteriously as well for some reason. Actually, this is helping you because the buildings no longer hide the arrows which tell you where your snails on wheels are supposed to crawl to.  Then there are the bugs. For no apparent reasons, the tunnels suddenly begin to move on their own, rolling back and forth as if they were possessed by ghosts. While it is amusing to watch them slowly clip through the gates, it becomes rather aggravating when you're supposed to deploy them because that's no longer possible then. This, however, is one of the few things which gets fixed with a reload... sometimes, that is.  Everything happens in real-time. When the game tells you that a plane needs to be repaired for 20 minutes, it will indeed take 20 minutes of real time to be done, and it's the same with every task. Thus on average, a plane will take up about 1 hour of your time to be fully handled.  Eventually, you have earned enough money to hire so-called helpers. These move even slower, though, but at least you don't have to babysit them constantly as the pathfinding works surprisingly well. Each time a plane takes off again, you receive a nice bonus which lets you hire more helpers until everything is automated.  And that's the major problem of the game. By the time you have upgraded 4 gates, you won't have anything to do anymore because there's nothing left apart from driving around in a van which has no other function. This would be alright if you were able to advance time, but nope, there's no such option. You are now doomed to sit there and twiddle your thumbs while waiting for the money to roll in.  If you have masochistic tendencies, you might enjoy this game. Everybody else shouldn't bother getting this.  Seriously, when a Simulator is developed by a 'GmbH' (German for 'Gesellschaft mit beschränkter Haftung', which means 'company with limited liability'), stay away from it. I have yet to see a good one.",
            "review_score": "-1"
        },
        {
            "review_text": "9,99€ for a game that basically isn't fun or anything... Or where u can't do anything... Is well waste of money... Got it in a sale... Wasted 3€ and well better bought myself a bread or something with that money... That would 've been more satisfying...",
            "review_score": "-1"
        },
        {
            "review_text": "Absolute ♥♥♥♥ing aids and a waste of 300mb",
            "review_score": "-1"
        },
        {
            "review_text": "You know 50 years ago this would have been the best game ever.............",
            "review_score": "-1"
        },
        {
            "review_text": "To simply put it, it is a masterpiece.  This is the pièce de résistance of gaming.",
            "review_score": "1"
        },
        {
            "review_text": "not worth a penny this game is so poor its unreal would not work all the time stay away",
            "review_score": "-1"
        },
        {
            "review_text": "This is NOT a game. It is a injection of pure boredness. Never buy again from UIG or its people my dear sim lovers.",
            "review_score": "-1"
        },
        {
            "review_text": "NEVER EVER GET THIS GAME 0 of 10 0 Stars Do Not give them your Hard Earned Cash This game is the Sharknado of Games GO AWAY NEVER COME TO THIS GAME AGAIN",
            "review_score": "-1"
        },
        {
            "review_text": "Airport Simulator,  Isn't a game for every one, but it's ideal if you want to play something easy with your small kids. They can try to drive the different vehicles to the designated spots. (Which is basically the only thing you do in this game)  As such it's a nice game.  If you're looking for a more fast paced or micro management game, than this is not really it, because it's rather casual.",
            "review_score": "1"
        },
        {
            "review_text": "The uninstall button worked great! no issue!",
            "review_score": "1"
        },
        {
            "review_text": "I've spent more time in this game than I have some AAA games and that's saying something. Not completely terrible. I can see myself playing it as a sort of idle game like some people play clicker games. For $.99 it's a pretty good game.",
            "review_score": "1"
        },
        {
            "review_text": " Pros:     It's addicting once you get the hang of it.    It's a chilled game   Nice that it has upgrades so once you do upgrade a unit, it will run on auto pilot which is awesome so that you won't have to control them   Time really flies when playing this game    Cons:    As much as i want to go further, I got a game breaking bug.   No clear directions from the start of the game but once you find how the game works you'll loose track time from playing it.  ",
            "review_score": "1"
        },
        {
            "review_text": "this game waste my time,,and ♥♥♥♥♥♥♥♥ a bug",
            "review_score": "1"
        },
        {
            "review_text": "  It's difficult to ever feel completely satisfied with a play session of Airport Simulator 2014. There's always one more pressing quest, one more unexplored tract of land, one more skill to increase, one more butterfly to catch. It's a mesmerizing game that draws you into an finely crafted fictional space packed with content that consistently surprises. The changes made since Airport Simulator 2013 are many, and result in a more focused and sensible style of play, where the effects of every decision are easily seen. Featuring the same kind of thrilling freedom of choice The Airport Simulator series is known for along with beautiful visuals and a stirring soundtrack, playing Airport Simulator 2014 is a rare kind of intensely personal, deeply rewarding experience, and one of the best role-playing games yet produced.  ",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Timescales are totally realistic and overall a good game to play if you want to relax",
            "review_score": "1"
        },
        {
            "review_text": "Here is the thing you are going to see a lot of negative reviews on this title. Truth be told there are some bugs, the worst being the circular jet bridge (tunnel) motion. There are easy work around for these and I enjoyed the game play. Yes, it is simple so if you are looking for action and stress this is not the game for you. But, it was fun to play and kept me engaged for quite a few hours. Buy it on sale, and if you like simulations I don't think you will be dissapointed.",
            "review_score": "1"
        },
        {
            "review_text": "yes yes highly recommended its the best game ever!",
            "review_score": "1"
        },
        {
            "review_text": "I spent 10 minutes staring at the screen trying to figure out what to do. The help is useless. You have no way to speed up time. And even when you think you did something, turns out you wasted time watching a timer count down to screw you over more. Thankfully I was given this game so I didn't waste money on it. Don't waste your money on it either.",
            "review_score": "-1"
        },
        {
            "review_text": "I was ready for some hilariously bad Simulator gameplay and instead I was rushing back and forth to get my planes prepped and oddly calm about the whole thing. Turned off the music since it was like a thirty second clip on repeat and played my own.  Running three gates with one of each type of vehicle was a juggling match to say the least. Finally started to upgrade my gates to automate the process a little bit and got my first plane out to taxi on the runway.  Then I hit my first bug, Plane doesn't take off. Just sits there. Wasted something like an hour just to hit a bug that stopped the whole game. No ez taxi, no ez life.  I knew you weren't going to buy it anyway but still... don't.",
            "review_score": "-1"
        },
        {
            "review_text": "This is in now way an airport management simulator. It is an airport vehical driving game. It is very boring and quite terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely fantasic game about managing massive amount of small trivial tasks that all just happen to be in an airport environment. Requires some clever analysis of the game logic to understand how to avoid the penalties. Really cool game once you understand what its all about. All tasks in themselves are small and boring but have 20 of them going on at the same time, then managing gets tricky and really addictive. For example one of the cornerstone of this sim is the question, how do you fuel three airplanes simultaniously with one fuel truck that can only be at one place at a time without being late anywhere nor busting any deadlines. Yes it is possible and it is intended that you figure this trick out and thats where things get interesting.  Finally DO NOT upgrade all your gates to level 1 because at that moment you have killed the game - you have nothing to do anymore. Instead keep 3-4 gates always to yourself and upgrade the rest. Also avoid level 1 upgrades. The wrkers are unbeliveabely slow. So always upgrade a station to atleast level 2. Once 4-5 gates are all level 3, you can start upgrading the gates you kept for your self. The upgrading of the last gate is however always painfully bodring and slow. However once the final gate hits all level 3, the game ends.",
            "review_score": "1"
        },
        {
            "review_text": " This game is embarassing, boring, and pointless.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is awsome if you want to wase 10 bucks on a terrible game",
            "review_score": "-1"
        },
        {
            "review_text": "This game is by far one of the most boring games I have ever played, the 2014 tag is totally useless. How do they even dare to bring out such a game with 2014 in it's name. The price tag for this thing is way too high.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME. I tried, I really tried. I invested hours into this game and gave it a chance but there are just so many god damn bugs. I found 3 massive ones that make me question whether they even tested this game. For example taxiing the plane to the runway for take off just froze progress completely once, with the counter not moving and unable to progress further. Also, the aim of the game is to hire ai controlled assistants to complete tasks for you, but for me they just glitched all over the place. For example I had an assistant for the fuel truck, but he just glitched, stuck in one spot, which meant the task was never able to be completed, I couldnt even take over control myself to get it done! Waste of time, money and patience. Like I said, DO NOT BUY THIS GAME",
            "review_score": "-1"
        },
        {
            "review_text": "Another appalling game from UIG received in a bundle.Horrifically broken with a never ending stream of bugs, glitches and crashes. Many laughs where had at its expense but if I had payed money for the game they would be tears. Avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not about managing an airport, but handling planes at an airport. You are responsible to drive all required vehicles (maintenance, buses, catering) to and from each arrived plane.  The vehicles seem to be stuck in first gear, they drive tediously slow. Moving vehicles within a certain time limit is the only thing you have to do. Buying upgrades for vehicles with earned money is limited to hire staff, so that you don't have to drive them. Once all vehicles have a hired crew, the game is completed.  There is no challenge, it is extremely boring and no progression. Avoid this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Slow....lost my attention",
            "review_score": "-1"
        },
        {
            "review_text": "do not get it is not worth $15",
            "review_score": "-1"
        },
        {
            "review_text": "Its Boring, time consuming, and missleading when being advertised. The game itself is not worth the price it is listed at. If you are really intrested in this game and enjoy it then go right ahead. I just suggest you wait for it to be on sale for 75% or more.   One of the plus sides is being graphics friendly, and a downside is lowering it to much will make it impossible to play the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I was in a spendy mood. I looked at the pictures, from what I saw, I assumed it was going to be a rollercoaster tycoon type game, where I would manage my airport, buy more things for it, or even move to a bigger place. COMPLETELY WRONG. This game was the worst amount of money I have ever spent. It was my own fault for doing not doing any research on it, but this game is bad. I felt like I should get paid just to play it. I guess I never thought someone would make a game this bad. I've only played it for an hour. An hour I wish I had back.",
            "review_score": "-1"
        },
        {
            "review_text": "Biggest waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "Having played the Airport Tycoon series, I was thrilled to see a new title that promised just as much fun but with updated graphics. After purchasing Airport Simulator 2014 and sinking about 23 hours in it, I felt highly disappointed for the following reasons:  - There is only ONE airport that you can play with, it has 8 gates and when those are filled there's a nice queue of 5 aircraft so you'll never run out. They never start moaning about the waiting times either, keep that in mind for the next point.  - You can drive 12 vehicles around the apron. You only get one of each and many aircraft need the same vehicles at a time. This could get a bit hectic, if it wasn't for the patience of the waiting pilots. Just drive your vehicle from gate 1 to gate 2, and maybe to 3 and 4 as well, just to make your time deadlines, then get back over at gate 1 and do the actual work etc.  - This all gains you small bits of 'money', and a good sum when a processed aircraft takes off, which you can then use to hire drivers for 11 of the vehicles, for each gate specific. Funny, as these drivers come with their own vehicles, so gates don't have to share a single vehicle anymore. Drivers come in three skill levels, you start with the slow ones and go up to the faster ones. (Yet the vehicles still drive at the same pace!) The 12th vehicle is a cargo container loading platform, there is no driver available for that so you have to keep doing this until the end of times.  - After earning enough 'money' to upgrade all your drivers, you get a 'Well done!' message, saying that your drivers are now fully automated and you can either return to the main menu or keep playing to load/unload cargo planes.  - There is no way of expanding your terminals (you only have one, and it disappears after a while!) or extending your runways. It is however advertized as such in the game description in the Steam store. False advertizing!  Conclusion: think I am going to make a couple of screenshots and then use the false advertising as reason to ask for a refund. I strongly suggest you do not buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "DId I just pay for this rubbish?",
            "review_score": "-1"
        },
        {
            "review_text": "Why this game isn't called 'Slow Driving Around an Airpoint with Terrible Music', I do not know.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game thinking i would be able to control aircraft. you cannot do anything that has to do with driving aircraft.    I WANT MY MONEY BACK!!!!!  ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is pretty bad...the entire thing is illogical...and it takes way to long to do the simplest things plus there are way too many bugs...Bought it thinking it might be like the old Airport Tycoon from the early 2000s, but it's terrible and not anywhere near as entertaining",
            "review_score": "-1"
        },
        {
            "review_text": "Totally boring. All you have to do is drive utility vans around the airport. And wait. And wait. And then wait some more.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is terrible it wont start up. i really want a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "worst game ive ever played. worse than windows blue screen of death",
            "review_score": "-1"
        },
        {
            "review_text": "This game is full of bugs get the 2015 version",
            "review_score": "-1"
        },
        {
            "review_text": "CRASHS NEVER ATUALY GOT TO PLAY THE GAME",
            "review_score": "-1"
        },
        {
            "review_text": "the most boring game in existence",
            "review_score": "-1"
        },
        {
            "review_text": "This is a total waste of 7 euros. What a pointless piece of rubbish. Terrible graphics, totally slow gameplay, nothing simulating about it. You drive vans around a deserted airport and every 5 minutes the game crashes.   Avoid this game like the plague!",
            "review_score": "-1"
        }
    ]
}