{
    "app_id": 267610,
    "name": "Woodcutter Simulator 2013",
    "release_date": "2013-12-19",
    "developer": [
        "United Independent Entertainment GmbH"
    ],
    "publisher": [
        "United Independent Entertainment GmbH"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Cloud"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 145,
    "negative_ratings": 386,
    "price": 5.79,
    "description": "Woodcutter Simulator 2013 allows the player to control and operate an entire lumber mill. From clearing woods to the evacuation of the logs, the player has to undertake all arising tasks to complete numerous missions – from cutting trees for demanding customers to producing woodchips for heating purposes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/267610/header.jpg?t=1447359652",
    "minimum_requirements": "OS: Windows XP / 7 / Vista / 8 Processor: 2,4 GHz Pentium or 100% compatible CPU Memory: 2 GB RAM Graphics: Nvidia Geforce 6800GT, ATI Radeon HD 3650 DirectX: Version 9.0c Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows XP / 7 / Vista / 8 Processor: 3,0 GHz Pentium or 100% compatible CPU Memory: 4 GB RAM Graphics: Nvidia Geforce GTX 560, ATI Radeon HD 6970 DirectX: Version 9.0c Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "Give this to someone if you want them to hate you.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever 10/10  Don't listen to what everybody says. These graphics, the gameplay, controls...just...beautiful. The plot twists are amazing. I couldn't believe that one time I cut the log with my axe, AND IT SPLIT IN 3, not in two. This is seriously a master piece. It was hard not to cry at the ending, once I chopped the last pine tree in existance. There was something about flinging that chainsaw through the poor plant's body that just made you feel so many...feels. Once the pine fell on the ground, and I needed to put the individual pieces in the truck was just...horrifying. It was so vivid you know? The graphics of the poor pine being shredded into pieces just was an unforgettable experience.  This is by far one of the best games i've ever played in my life. Totally recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Best Woodcutting simulator in the world, who ever doesn't buy this is mad. Graphics are next gen, the wood sawing action is the best there is and the driving we can't forget the driving. All in all would recommend this game to anyone 100/100",
            "review_score": "1"
        },
        {
            "review_text": "I'll be honest, initially I bought this game as a joke. I mean, how can a game simulating woodcutting be good? Amirite?   But when I loaded up this '♥♥♥♥♥♥' little woodcutting game I immediately felt like Judas was to Jesus. How could I hate and laugh at something so beautiful? The main menu is sublime, the quaint melody and the beautiful scenery made me feel like a child again. I shed a tear, called my family into the room and offered them the greatest pleasure of viewing this masterpiece alongside me. Of course, while initially sceptical they accepted.  Upon choosing the single player option you can choose to play either a tutorial or go straight into the main campaign. As I didn't want to keep my audience waiting I chose to jump right into the fray. It was nothing like I expected, there was no waking up, grabbing a cup of tea and calling the wife before setting out to chop wood. Your one and only goal was to chop wood meaning in a dark souls-esque style you wouldn't be able to prepare for the oncoming mission beforehand due to it's open world nature. I was beginning to feel foolish in front of my family for not choosing the tutorial but to my surprise it was all explained in game anyway! After being issued a mission 'Kill 4 trees' a picture of a tree on the minimap directed me to my goal and I ventured to it on foot.  *30 minutes later*  After reaching the tree marker I was instantly admist a sea of trees larger than those seen during my adventure to the goal. This was the place, the place of do or die. Walking to my first cuttable tree (you can only cut trees with bands around, showing the care for enviornmental safety this game has - a vital feature to stop people imitating the game on any random tree) I pulled out my chainsaw and felt a thrill. This was my first kill. Watching the gruesome yet wonderful animation (lasting approximately 7 minutes) the tree had fell and disappeared but regardless of reasons my objective of killing four trees was marked '1/4'. A wry smile and a strange bloodlust filled me as I continued towards the other trees. '2/4', '3/4', '4/4' and I was done.   I felt like a god returning to base. I held the fate of those marked trees and I could sense the fear within them. I killed a few more to make an example to those who would dare rebel, keeping my people (trees) safe from those anarchists. At that point I decided to turn off the simulator, for if I strike the wood too often my people would live in fear.   The true addiction to this God Simulator lies in the multiplayer. Will the kind, foolish god win the support of the people or will the more assured, logical god win the rise to power? Of course I already know the answer.  I don't want to rate this game as I no longer consider it a game. But to all who purchase it be warned for I am God in this world. Fear me. Loathe me. Envy me.",
            "review_score": "1"
        },
        {
            "review_text": "this game is autism",
            "review_score": "1"
        },
        {
            "review_text": "You play a ghost that is tasked with endlessly cutting down trees. This is why your chainsaw never cuts through trees but instead leaves a red line.  Until you cut your first tree you have no idea you are a ghost, it's all very sixth sense really. But the moment that camera pans back revealing a tree falling with no-one near it you realise the ghastly truth. From that moment on the story really kicks into high gear.  It isn't until the final act of the story that you find out the reason for your ghostly tree cutting. I don't want to spoil it too much, but you'll need the axe from the fifth mission for the good ending as it is the only way to severe mother nature from her roots.",
            "review_score": "1"
        },
        {
            "review_text": "I ♥♥♥♥ing love cutting trees!  The best simulator of woodcutter EVER",
            "review_score": "1"
        },
        {
            "review_text": "the game did not start im usig a windows 7 does it work on windows ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 this game will eat your soul",
            "review_score": "1"
        },
        {
            "review_text": "In this game you can grow your dream GanjaGarden™ and knocc it down. What more are you looking for?",
            "review_score": "1"
        },
        {
            "review_text": "what the hell wont work i want a refund",
            "review_score": "1"
        },
        {
            "review_text": "And so the legends say. The legends say that boxed water is a new race. A breed of water containers so funky, it shouldn't be called a container, but rather a 'canteen'. The day has come where hipsters redefine 5 pages as 50 words. Today is that day. Boxed water is better.",
            "review_score": "1"
        },
        {
            "review_text": "Don't even. Not even as a joke. You'll regret it within a small number of minutes. Possibly less than that. I've heard that wood dust gives you cancer, anyway.",
            "review_score": "-1"
        },
        {
            "review_text": "First In-Game Adventure: You start out as a random guy with a chainsaw standing in front of a house and you see that you are next to three recycle bins. You wonder who you are and how you got there, and why you are standing next to three recycle bins. You see a tree and you decide you want to cut it down. You run up to it in super lag at 1fps and try to stick the chainsaw which you don’t know how you got into the tree. You try to start the chainsaw but it says you are holding the chainsaw in the wrong position. So you give up and decide to explore. But then, all of the sudden, you feel the need that you need to cut down some trees. You have no way of getting this information, you just know in your mind that you must cut down three trees. So you decide to cut down these trees and you realize that you can run faster sideways than you can forwards. You don’t know why, you just do. In your head you visualize a map. You have no way of getting this map, you just picture it (in the top-right corner of your screen). You run to this place where you feel the trees are and you magically stop. You have reached the end of the world. Small world right? Then you turn around and you see a hideous, very scary sight. You see…a mountain that is literally covered in trees!!! Then you see a crane and decide to jump in it so that you don’t have to look at that hideous mountain anymore. You don’t know how you got in it or what you pressed, but you’re magically in the crane. You can’t get out. You’re stuck. The game is over.  Second In-Game Adventure: You start out as a random guy with a chainsaw standing in front of a house and you see that you are next to four recycling bins. You once again wonder who you are and how you got there, and why there are now four recycling bins. Maybe the garbage man came and dropped off another one? These questions remain in your head leaving you in confusion. You see a tree once again and you decide you want to cut it down. You think that maybe this time the chainsaw will actually start…You thought wrong. Once again the chainsaw doesn’t move. You decide that maybe this tree just has problems and doesn’t like you so you decide to run away from this tree that doesn’t seem to like you and you run up a hill. You then remember that you can run faster sideways than you can forwards. You don’t know why, you just do. So you awkwardly run sideways until you come to another tree. You think that this one looks more friendly and will want to be your friend so you can cut it down…You thought wrong. As soon as you get up to the tree and raise your chainsaw, the tree pulls you into it. You don’t know how, since you were standing about 5 ft. away from the tree. How can this be? You are stuck with these puzzling questions waiting to be answered. Anyway, the tree pulls you into it and you go into the tree. You don’t know how, all you know is that you are now inside the tree. But then, things get much more scary. You then fall out of the tree and start falling into a world of whiteness. You look up and you can see that you have fallen out of the world. You can see the bottom of the world fading as you fall farther and farther into the world of whiteness. You look down into the whiteness. It looks very…white. But then, as you start to think that things can’t get any worse…You thought wrong. Black and white lines cover up your screen. Everything fades. The game crashes. You are back at your desktop. Worst simulator game ever…",
            "review_score": "-1"
        },
        {
            "review_text": "When I was given this game as a wonderful suprise gift I was overjoyed with the idea of ushering forth some kind of apocalyptic nightmare to virtual nature. I took on the first mission to stalk my lumber-based prey through the hills and found that I was limited to only slaying designated trees. Fair enough, I thought. However, when I came to the target I discovered that the only interaction this game allows is aligning the apparently incoporeal player in the correct position before hitting space bar to have the game take control and cut down the tree for me. CUT DOWN THE TREE FOR ME. The very least they could do was give me the satisfaction of cutting things in a terrible and ill-thought out way but no, there is only one way to cut trees and that is by allowing the game to cut the trees itself. What is freedom without the freedom to fail miserably and hilariously? It is no freedom at all. I am a prisoner, and Woodcutter Simulator 2013 is my hellish prison.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is terrible. You would think that Trees are an important part of this game, but no. There is no Tree collision detection at all.  The map is hard to read, Trees are finikey to get into to position to cut down and it's just not fun at all.  That said, I spent a good few minutes laughing when I flew directly up into the air after using the chainsaw on a stationary vehicle.   Don't buy this game. The only reason I have it is because it was in a bundle with a different game I wanted, I hope the devs feel ashamed that they submitted such a sub-par game to the steam store, knowing that people would still buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Somewhat unusually I had some hopes for this title. There have been several surprisingly enjoyable games simulating mundane activities as of late. Unfortunately this one didn't join them, but I'll keep it short.  The mouse control is clumsy, movement is awkward and slow.  First person chainsaw action was less like the anticipated Doom and more of a line up pixel perfect and press space bar to let the game do all the cutting.  The tree physics aren't great and ignore branches, trees bounce off each other unconvincingly.  The game apparently expects you to follow roads when walking, causing some frustration with invisible walls in the woods.",
            "review_score": "-1"
        },
        {
            "review_text": "I cut some trees, then I cut some other trees. Then I was about to cut another trees but I clicked on the 'Settings' button that appeared on the HUD next to the chainsaw on the bottom left side (when the tree was falling). Too bad I didn't know that that button will crash the game. I am not going to waste my time to try it again and get some better tools.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh what a gift this was! This was my first Simulator game, and my oh my what a terrible experience it was.  This game is riddled with bugs, which makes me question whether it even went through any quality control what so ever. The first bug I experienced was a lack of control of where the hell my guy was moving, at first I thought my 360 controller fell off my tower again and the analogue stick was wedged forward, but sadly it was not the case. Other bugs which players may encounter are: - Loading a save game and falling through the world. - Just falling through the world in general randomly. - Trees falling through the world after being cut down. - Trees falling on vehicles and knocking them over. - Sprinting into a vehicle can launch the player into the sky (Actually the best part of the game when I got it to work). - Driving through trees! - Random invisible walls when trying to skip across the terrain when the objective is just behind the hill you're trying to get over. - Trees not falling over after cutting them, which means you need to shunt it with a vehicle for it to fall. Otherwise you can't cut down another tree... - Random game crashes Other than the horde of bugs, sorry I mean features, which this game has to offer it lacks a tutorial which informs you how you actually play this game e.g. how and what trees you are allowed to cut down. This was not so obvious at first, this teaches me for not playing the 2012 version eh? Anyway, there are video 'tutorials', but the videos are just soundless with text displayed at the bottom giving you of very little detail, maybe the developers couldn't record them selves talking without laughing hysterically at what they've thrown together. These videos also don't play some times, I had to restart the game a couple of times in order to to watch all of the videos.  The map is fairly big and you have no vehicle to help get you around any quicker. But you know, having vehicles in this game is rather pointless because all you need to do is sprint and move diagonally in order to launch yourself across the map to get to where ever you wanted to go. You don't even need to change 'location' to cut the trees you need, you can stay in the same area for a couple of missions until all the cut-able trees are gone, then you sadly have to move once again across the map to cut that last tree you need to earn that sweet sweet 3,000 something. I have no idea what the currency is in this game, perhaps you're paid in wood for the wood you've just wooded (Sounded a lot better in my head).  I could go on and on about the many delights which this game has to offer, but I will say this...It is a terrible game with no clear goal to start with or to continue with. There is no real involvement in cutting the trees, you just need to position yourself and hit the 'GO' button. This game is not worth the full price, nor is it worth half price. At best this game is a gag game to give your friend on his birthday, or a game to gift some one just to show them how much you loathe them.  Can't wait for Woodcutter Simulator 2014.",
            "review_score": "-1"
        },
        {
            "review_text": "Why the ♥♥♥♥ did I buy this.  ",
            "review_score": "-1"
        },
        {
            "review_text": "So do you like to go to the dentist and get a root canal without any freezing or pain killers? If so this may be the game for you.  OK a bit harsh, but seriously unless your thinking about going to get a job as a tree faller working only in the suburbs there is no reason to look at this game.  Game: You cut things down You walk around going to things to cut down  Pro: It runs on my machine It came free in a bundle It is what it says it is At least there is no steam cards - so I didn't have to play this for 3 hours to get all the cards  Cons: It runs on my machine (and now I have to get a priest in to resanctify the hard drive) It came free in a bundle (and I overpaid for the game) It is what it says it is (and I wish it wasn't) It can with no steam cards (that I could sell to make this game worth my time)  If you want to buy this game, seek help. Only buy it as a gift for somebody you dislike (and you want them to hate you) ",
            "review_score": "-1"
        },
        {
            "review_text": "30 minutes of misery was enough.  MENTAL ANGUISH, BROUGHT TO YOU BY STIHL.  Chopped 8 trees in 30 minutes after figuring out what the heck I was supposed to do because the tutorial videos were completely broken.  Seems like at first you get 6k per mission, which if you buy a van so it doesnt take 20 minutes to run to the next four trees to chop, youd have to do 20 some missions just to get the first piece of machinery. A single tree takes 30 seconds or so to chop with the terrible animations.  So, no thanks.  0/10 Don' even.   I'm noticing a trend from this developer...",
            "review_score": "-1"
        },
        {
            "review_text": "Well Really its not very good :(. Did not play long because of the poor graphics and wired game play(automated chainsaw :().Did not get up to any of the cool equipment so mabey it gets better later on in the game. The missions i did play were easy to understand and complete  Looks like Play Station 1 game. Got board after 10min.",
            "review_score": "-1"
        },
        {
            "review_text": "Basically you run to a tree and hit space and that's the game. Got it in a bundle so I didn't waste more than 24 cents on it. Which even then I ponder if it's worth that much. I love terrible sims and this one is 10/10 terrible so it was worth a few mins of gameplay for my self hating amusment.",
            "review_score": "-1"
        },
        {
            "review_text": "Would like to say I was able to get a good feel for the game but I was never even able to do anything...  As soon as the game loaded up my character was continuously moving backwards with no way for me to stop and attempt to cut down a tree much less experience the rest of the game. :(",
            "review_score": "-1"
        },
        {
            "review_text": "can't cut trees  tree/10",
            "review_score": "-1"
        },
        {
            "review_text": "Absolute garbage. Do not buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Buying this game was the worst error on my life. Hope you´ve enjoy my money United Independent Entertainment GmbH, i didn´t enjoy the game. Even free i would not play it more than 20 minutes. Waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "Gotta say, Best bad game simulator I have ever played. 10/10 would never recommend",
            "review_score": "-1"
        },
        {
            "review_text": "I thought to myself, this can't be real. It isn't. I can't wait for garbage truck simulator.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the worst game I've ever played.",
            "review_score": "-1"
        },
        {
            "review_text": "I wasted $15 on this peice of crap.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a very boring game.   click notebook to take a job,   go to the tree mark on the minimap  get into the right position in front of the tree  press a button to cut, that's all about it.   I thought I can swing chainsaw like a FPS game and cut trees whatever I want.   And when you driving the van on the road it is very lagging because this game is loading the grass on the map.  This game even have a multiplayer mode, lol",
            "review_score": "-1"
        },
        {
            "review_text": "Complete and utter rubbish. I can't believe the amount of money charged for this game. I must remember to read the reviews before buying another game from Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "i want my money back i can not even open the game!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game 3 days ago, I cannot get on the game. I see alot of other people have had this same problem. I have tried alot of different suggestions and nothing is working. Can anyone help? I have windows 7. I have farming simulator disc that works fine. This is my first download on this computer, it is a IBUYPOWER computer. I am sure I am doing something wrong, just don't know what. It says it is downloaded and it is in my library. When I hit play it comes up for a few sec then disapears. and returns to the home screen. It says I have played for 17 min. in 3 days. It says syncinizing for a sec then disapears.. Thanks for any help!",
            "review_score": "-1"
        },
        {
            "review_text": "Why did i buy this? This game is just aweful. who wants to walk around and virtualy cut wood?",
            "review_score": "-1"
        },
        {
            "review_text": "As far as simulation games go this is probably one of the worst I have ever seen. To put a price tag of 14.99€ on this is more than a complete rip-off.  I got this game together with 6 other simulation games at -90% off and that is still too expensive.  The only fun you could possibly get out of this is when you play it with some friends, that is if you actually have friends that own this 'game' and you are able to figure out how to play together. Not like you'll be able to see your friends since there are no character models outside of driving a vehicle. There isnt really a reason to drive a car either since you'll move faster by just running and strafing.  If it wouldnt just crash randomly and glitch out most of the time you might have some fun together, then again you could do more enjoyable things to begin with.",
            "review_score": "-1"
        },
        {
            "review_text": "This Game is now 2 Years old. My PC is not the best one, but it still can run this Game. How ever, i dont really like this Game. The Models are not 'ok' (like what Rammus say). The Hand is like a Cube. The Way how you cut the Tree is very very not realistic af. I wasn't playing this Game long, because it was very close from to get AIDS. lol.  All in one: Do not buy this Game, only you want to be a real Woodcutter!",
            "review_score": "-1"
        },
        {
            "review_text": "This is a very boring game.   click notebook to take a job,   go to the tree mark on the minimap  get into the right position in front of the tree  press a button to cut, that's all about it.   I thought I can swing chainsaw like a FPS game and cut trees whatever I want.   And when you driving the van on the road it is very lagging because this game is loading the grass on the map.  This game even have a multiplayer mode, lol",
            "review_score": "-1"
        },
        {
            "review_text": "Probably the biggest waste of money currently in my steam library",
            "review_score": "-1"
        }
    ]
}