{
    "app_id": 267730,
    "name": "Ground Pounders",
    "release_date": "2014-07-15",
    "developer": [
        "Kerberos Productions Inc."
    ],
    "publisher": [
        "Kerberos Productions Inc."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Turn-Based Strategy"
    ],
    "achievements": 45,
    "positive_ratings": 16,
    "negative_ratings": 23,
    "price": 3.99,
    "description": "Ground Pounders is a turn-based, strategy wargame. Inspired by classic strategy games like Panzer General, and steeped in the lore of the Sword of the Stars universe, Ground Pounders offers a new generation of gamers an updated taste of turn-based strategic warfare.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/267730/header.jpg?t=1447359670",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8 Processor: Core 2 Duo or equivalent Memory: 2 GB RAM Graphics: Memory:512MB Minimum Resolution:1280x800 Storage: 1 GB available space Sound Card: Any Windows compatible sound device, stereo speakers or head phones Additional Notes: Valid email address and Internet connection (broadband not required) required for multiplayer",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Although marketed as a Panzer General-style game, Ground pounders is more similar to modern table-top wargames than it is to Panzer General. Here is what Ground Pounders has:  1.Supply lines.   2.Transport units  3.Replacements  4.Units with 1-5 steps  5.Supply zones and Victory hexes  6.CRT (Combat Results Table)  7.Artillery, AA Guns, Command Units, Scouts, Engineers and of course Tanks, Mobile Infantry etc.   8.Scanning &amp; signatures create a Fog of War. Quiet units are harder to see.   9.Units have lots of stats. Attack, Defence, die pool, range, movement points etc.   10.Terrain effects.  11. ZOC   Sounds a bit like a wargame, doesn’t it?  The main game has two campaigns to play through, Human and Hiver. There is also multiplayer (good luck getting that to work) and skirmish mode. In the campaign your small core will travel from battle to battle, so it is important to try to keep it intact. There are plenty of turns in most missions, so the game rewards tactical play as opposed to charging everything headfirst at the enemy.   Each turn has 3 main phases, Supply &amp; replacements, command, and move/combat. (You also draw cards to replenish your hand at the beginning of the turn). The game is Igo/Ugo so players take turns completing the phases.   The supply phase checks all your units for supply. Units out of supply will lose stats and, if they remain out of supply for a few turns will begin to lose steps. Each scenario has a replacement pool which limits the number of replacement steps you can allocate to damaged units.   The command phase is the most unique phase, which wouldn’t work on a tabletop wargame. You roll a bucket of dice which is determined by the number/quality of your command units. You then pre-assign these dice to your units. If your unit is in combat, instead of rolling a die, you will use the pre-assigned die. Different units can be assigned a different number of dice. When attacking, supporting units and artillery need to expend their own dice (value doesn’t matter, they just need to spend one). This limits the number of attacks an artillery unit can support. You can allocate all or none of your dice manually. There is an option to automatically remaining dice. So if you expect little or no combat, hitting “auto” and skipping this phase is fine. When you have a detailed plan and you want your two “6”s on the right units, you can allocate every die if you wish.   During the move/combat phase the player can move units and attack in whatever order they wish. Once a unit attacks it can no longer be moved. Although units can support and still move. Combat is resolved on a CRT with your die being added and the enemy’s die being subtracted to create the DRM (Die Roll Modifier). Odds are determined by attack:defense ratio. Supporting units add half their attack value, artillery adds its full attack value. A typical combat result is A1D2R. If you’ve played any tabletop wargames, you would read that as “Attacker loses 1 step, defender loses 2 steps and retreats”. Supporting non-artillery can also sometimes lose steps depending on the result. So the result can be A1s0a D3s1r, which would be Attacking unit loses a step and may advance. Defending unit loses a step and retreats, defending supporting non-artillery units also lose a step.   After the player has finished moving and attacking, it is time to assign defensive support. Again, you can click on every unit and select which units will expend dice to support it if is attacked. Or you can just hit “auto” if you don’t have many concerns. Again, how much time you spend is up to you.   One other thing I should mention is the cards. Before battle you can create your deck of 32 cards from your card pool (or use the random one generated). What I have done after a few missions is I’ve built my “best deck suited to my play style” and I just use that one. The initial card pool is random so it will be different for each player. Also you can “win” random cards when victorious in a scenario. If you like the card you win, it is pretty simple to tweak your deck and add the card.   Cards can do a variety of things from adding movement points, +attack value, DRM, odds shift, increase artillery range, isolate enemies, lower signature, add AA to a unit, shorten enemy supply lines etc. I don’t know how many cards there are but there are lots. Almost everything appears to have a card that can affect it. Used cards are replenished back to your hand size (3-5) at the beginning of the turn. I presume it is possible to run out your deck, but it hasn’t happened to me yet.   Cards also have a “Space Superiority” (SS) number on them. At the beginning of the scenario you can discard 1-5 cards (take them out of the game). The highest total determines who has space superiority for the scenario. If you have SS you get additional powerful cards that you can re-use every 2-4 turns. These bonus cards can reduce steps (orbital strike), scan an area, reduce enemy supply range, or increase a units attack/defence for a turn.   And that, in a nutshell, is Ground Pounders!   The Good, The Bad and The Ugly:  The Good:  Two big* campaigns provide plenty of scenarios covering a wide variety of situations. I’m actually quite impressed with the big variety of situations that are offered. Flanking manoeuvres, amphibious landings, head on assaults, fighting withdrawals and protecting fleeing civilians from the advancing horde are just a sampling of the different situations offered. (*Refer The Ugly.)  Tactical play is rewarded. This game requires careful play and is not just a tank rush. This is a real wargame. Most missions take 1-2 hours to complete.   Units gain experience through missions. When they reach a certain level they get a +drm. Also, they can choose a special ability when they reach veteran and elite status. These are little bonuses, such as “urban fighter”, “AA gun attachment”, “extra movement” etc. There are about 6 different choices at each experience level which varies to unit type. A nice little addition and preferable over the random leaders of Panzer General/Corps as you can tailor your units to your own play style.    The Bad:  The tutorial is poor and hardly explains anything. It took me about 3-4 scenarios to finally grok the majority of the game’s mechanics and situations. This game doesn’t have the slow learning curve of more streamline “wargames” but is instead pretty steep. UI isn’t always intuitive and it took me a while just to figure out how to assign Defensive Support.   Don’t be surprised by the “cartoon” sci-fi graphics. Although taking place in the Sword in the Stars setting, this is a real wargame.   The maps are drab, dull and difficult. There are different terrain effects, but it is difficult to tell what terrain each hex is on the washed out colour maps. Just because this is “another planet” doesn’t mean you couldn’t have had distinctively coloured maps with forests, rough, plains etc. clearly identifiable. A consolidated TEC (Terrain Effects Chart) would also be useful. It is very difficult to plan one’s advance when one is unsure how far your units can move across the different terrains. (You can get the information with a few clicks, but this is tedious and not intuitive).   Space Superiority should have been done differently. It becomes a no-brainer to discard 5 cards and hope you get it. The “free” SS cards are very powerful and reusable with a cooldown of a few turns. This affects deck construction a little as I am using some “inferior” cards with a high SS rating. If you lose SS there is the possibility (and temptation) to just forfeit and retry the scenario.   I recommend Ground Pounders. It’s not perfect, but scratches the itch in the right places. A good wargame marred by bugs and lack of support. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has the best AI of any hex based game I've played. I love the maps. The combat taking place on 3 levels is very cool (ground, underground, air). I absolutely love the setting and the lore behind Sword of the Stars (I got SOTS prime at launch). It's very challenging and tactical.   But, there is a major problem with this game. The user interface is terrible. The entire flow of the game and the way it's played is designed around mobile devices. This means that the game play is very very slow and clunky. Things that should take 1 click or 1 left click and 1 right click take 3-5 clicks. The game has several phases for each turn so all of these clicks add up and it gets annoying.   So if you are looking for a deep and challenging hex based war game in a sci-fi setting I recommend this game. Just be aware that the user interface hates PC gamers.",
            "review_score": "1"
        },
        {
            "review_text": "It only took a few minutes to see that none of the normal conventions apply and the learning curve is more than I want to invest .",
            "review_score": "-1"
        }
    ]
}