{
    "app_id": 267980,
    "name": "Hostile Waters: Antaeus Rising",
    "release_date": "2014-01-30",
    "developer": [
        "Rage Software"
    ],
    "publisher": [
        "Funbox Media Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 231,
    "negative_ratings": 84,
    "price": 2.09,
    "description": "In 2032 an Earth that knows only peace is forced to relearn the art of war. Twenty years have passed since the population of Earth did a fine job of destroying nearly everything in one final struggle for power by the politicians and military leaders.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/267980/header.jpg?t=1530529909",
    "minimum_requirements": "Minimale : Système d'exploitation : Windows XP / Windows Vista / Windows 7 / Windows 8 Processeur : 1 GHz Processor Mémoire vive : 1 GB de mémoire Graphiques : 3D graphics card DirectX : Version 9.0 Espace disque : 505 MB d'espace disque disponible",
    "recommended_requirements": "Recommandée : Système d'exploitation : Windows XP / Windows Vista / Windows 7 / Windows 8 Processeur : 1.4 GHz Processor Mémoire vive : 2 GB de mémoire Graphiques : 3D graphics card DirectX : Version 9.0 Espace disque : 505 MB d'espace disque disponible",
    "reviews": [
        {
            "review_text": "This is one of my favourite PC games of all time.  It's pretty much a forgotten gem, which is a great shame. It is a unique game that manages to combine strategy with blowing chunks of metal out of people. It's possible to manually control everything, manually gather resources (like a strategy game), manually shoot at people who would shoot at you (like a dumb tank shooter). Alternatively, you could leave it to the AI and plan your attacks out, just like a strategy game.  This game therefore turns the strategy genre on its head, allowing you to have more direct control over your units. You can have the AI do all the boring stuff, taking land vehicles from the carrier deck to the actual land and then go looking for resources, while you take control of the aircraft taking people out.  As the game goes on, you get cool upgrades, new weapons, armour, different units, all kinds of stuff. You get more AI characters to control your ever growing army, and you'll end up with some intense battles against the hordes of... well, hell if I know. The story is a bit weird. The gameplay is where it's at.  I haven't played a game like this. It's a shame really, this game is really innovative and I would have enjoyed a sequel. Unfortunately, the developers went out of business. Kind of a shame, they started off in my birthplace.  You won't regret buying this game if you like explosions or strategy. Oh, a small bonus since you read this far: hold down the right mouse button when you are in the Antaeus construction room and move your mouse. Ahh, I love random attention to detail!",
            "review_score": "1"
        },
        {
            "review_text": "Good Game, it hard i long game, you need to think tactic you need to plan your strategy, every level you gain something new, new character or Weapon. you can always do it fast or slow the level  ",
            "review_score": "1"
        },
        {
            "review_text": "My childhood right here, played this on a Pentium 4 with some ViA integrated GPU, ran crappy.  Re-played this recently on an i5 with a HD 7750 GPU, still ran crappy, still finished it. And I am picky when it comes to framerate. AI is kinda bad too, especially your AI... most frustrating moments were because my AI screwed up badly.  Someone did tell me that it runs way better in windowed mode but it was too late, already finished it xD  I can't remember if I finished it the first time I played, but I remember it being hard, probably because it ran so crappy.",
            "review_score": "1"
        },
        {
            "review_text": "Other than the graphics and how old this game is, this game is actually great! Unlike new AAA games this is really the whole package",
            "review_score": "1"
        },
        {
            "review_text": "An older game with no multiplayer, but still a lot of fun if you like RTS games. Graphics do look a little dated but are still decent &amp; the interface is very easy to learn &amp; master. The challenge comes from the tactical use of your AI companions which are well coded.  If any game was crying out for a remake into HD with multiplayer, this is it!",
            "review_score": "1"
        },
        {
            "review_text": "It's a bit old, but it's quite unique. You won't find any modern game similar to this one. You have a boat (Main base) that creates automated robots (Units) of all kinds, making it some kind of fusion between strategy and action game. Command your automated forces into the battle and bring destruction to the puny mortals.",
            "review_score": "1"
        },
        {
            "review_text": "Part realtime strategy, part sim, part Carrier Command! And it has a Tom Baker voice over.   Just buy it!",
            "review_score": "1"
        },
        {
            "review_text": "got game free .... ideal master!!",
            "review_score": "1"
        },
        {
            "review_text": "The game not working for me...",
            "review_score": "-1"
        },
        {
            "review_text": "Dumb, overly convoluted interface. Ugly graphics and poor controls. None of the buttons make sense what they do and there are so many different ones it is annoying to try to remember what each random key does. No thanks game.",
            "review_score": "-1"
        },
        {
            "review_text": "Script by Warren Ellis creator of The Authority, Global Frequency, RED and Planetary.  Narrated by the fourth doctor Tom Baker  Performed by Blake's 7 actors Paul Darrow (Avon) and Glynis Barber (Soolin).  Control biochipped crewmembers and defeat an archepeligo stronghold of warmongers.  Warning this game is 15 years old but did try something different and at $0.99 it is a steal.",
            "review_score": "1"
        }
    ]
}