{
    "app_id": 267960,
    "name": "Hyper Fighters",
    "release_date": "2014-01-23",
    "developer": [
        "Team 6 Studios"
    ],
    "publisher": [
        "Funbox Media Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "On-Rails Shooter",
        "Shooter"
    ],
    "achievements": 0,
    "positive_ratings": 96,
    "negative_ratings": 313,
    "price": 2.09,
    "description": "Hyper Fighters brings back the rail shooter as you know it from the arcade: fast, explosive, addictive, and easy to learn: but so hard to beat the number one highscore! Fourteen trigger-happy arcade-fun stages are now available for one or two players: Shoot dozens, hundreds, or even thousands of enemies out of the sky and water with...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/267960/header.jpg?t=1530529911",
    "minimum_requirements": "OS: Windows XP / VISTA / 7 / 8 Processor: CPU 2.0 GHZ or better Memory: 2 GB RAM Graphics: 128MB Videocard, Shader model 2.0, ATI 9600, NVidia 6600 or better DirectX: Version 9.0c Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I generally like to wait until I have a handful of hours in a game before I make any sort of recommendations. But sometimes you don't have to bother waiting when there are glaring problems.  This is easily Top 10 one of the laziest ports ever made. You play this with the keyboard and mouse (arrow keys to move, mouse to aim) and no option to change that those key bindings. I don't know about you but when I'm using the mouse for aiming I'm more comfortable using WASD for movement. But here's the really fun part! You have to use the R key to dodge. Just stop and thing about this for one second. Your left hand is on the arrow keys, your right hand is on the mouse, HOW EXACTLY are you supposed to reach that R key?! And to add insult to injury you can't simply just press R to dodge, you need to R+direction in which you wish to dodge.  So! You take your left hand off the arrow keys and move it to the R button and you take your hand off your mouse and move it over to the arrow keys, and presto you can dodge! For something like an on-rail twitch shooter dodging is an essentially core gameplay mechanic. This is broken, the controls in this game are broken.  I kinda want to like this game, I'll probably play it a few more times, but until they patch this up and let you customize your key bindings I can't help to tell you all to stay away from this. I can see why this went for $0.99 during the sale.  Stay! Away!",
            "review_score": "-1"
        },
        {
            "review_text": "Played the game for 7mins and i couldnt enjoy it, Really starting to believe the developers 'Team 6 Studios ' dont know how to make a great game. Game instantly reminded me of 'ace combat assault horizon' but not in the best way. Did get the game free but i really do hope these developers learn where their issues are at.   pros Rail shooter  Cons controller support graphics option resolution changing key remapping Laser shooting/auto shooting always switched on me while shooting *bug*",
            "review_score": "-1"
        },
        {
            "review_text": "A primitive game with quite low production values. Even if it was freeware I would not play it - just not worth your time.",
            "review_score": "-1"
        },
        {
            "review_text": "Poor arcade port.  Hyper Fighters is 3d 'on the rails' shooter developed by team 6 studios originally on the Wii and ported to PC. As an on the rails type game you have limited control of your jet as you focus on shooting down enemies coming at you. There isn't much of story, but you play as fighter pilot whose task is to save the world from villains accross the world.   Positive - 14 levels - Each levels leaves you facing waves of foes and in most levels there is a boss. - 3 planes - each plane has different stats in three areas: armor,firepower and manouvarability. Planes also carry different amounts of rockets. - 3 difficulty settings - Easy, medium and hard. - Replayability - You can replay levels you won previously with the ability to choose a new plane or new difficulty setting. - Extra lives - You unlock extra lives while playing which allows you to respwan right after death. - Boosts/upgrade - You earn random boosts (i.e invincibility, auto shooting, laser targetting) during game play.   Negative - No control customisation - There are no options to customise controls, so your stuck with using arrow keys to move and  - Poor graphics - The environment looks bad with low detailed textures. Aircraft textures and models don't fair much better either. - No option to change resolution  - Short - Completed it in an hour (on easy) - Repetition - Most of the mission will require you to go through waves of foes before meeting up with the boss aircraft. There are only 2-3 missions where there are no bosses and just simply waves of foes. - No upgrade/boost indicators - when you recieve an upgrade, a word quickly flashes on the screen which tells you what you got. the problem is that the words are too small and appear breifly. Another issue is that you don't now how long the upgrade lasts for as there is no timer or bar to show you. - Poor Audio - Weapon effects don't sound good (passable at best). Background music sometimes appears during level;s but they aren't good either. There is very limited voice acting with the pilot (I think?) saying something forgettable before level, plus before and after a boss fight. - Limited weapons - You only have machine guns and limited rockets, thats it... - Limited planes and no customisation - You can't customise or upgrade your plane at all, you can only choose bewteen 3 planes. - Limited choice - Once you choose your plane you have to continue playing with it in the next level. - Limited foe variety - You face Jets, helicopters, battleships, submarines and giant ships (which serve as bossses). Sounds like alot, but you will see them again and again.   Overall, I suggest you pass on this and look for a better game.",
            "review_score": "-1"
        },
        {
            "review_text": "Just play After Burner.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was about 2 steps away from being great.  There is nothing to indicate that you are about to get hit, so when enemies are offscreen, its a crapshoot.   The game could have also been ;ess repetitivly put together.  Fixing those two things woul have made this a great game. As it stands, it also has some glaring flaws that make it kinda ♥♥♥♥♥♥. I have played worse games (Like Bridge Constructor) but not many. The game seems lazily done. The 'Laser sight' is ltterally just a red line between the ship and the reticule in 2 dimensions. It has no bearing on where your shots go, its just there! There are also some translation issues that, while minor, are obviousl, and a REALLY barebones UI.   The bullets, in a (good) surprise actually have drop though!   I got this game for $0.39 and I consider it a good deal. Don't pay more than a dollar for it, but I do suggest you get it. I have to not recommend simply because it is $10",
            "review_score": "-1"
        },
        {
            "review_text": "Uriel's Chasm in 3D",
            "review_score": "-1"
        },
        {
            "review_text": "Do NOT get this. *shudders*",
            "review_score": "-1"
        },
        {
            "review_text": "This is an interesting game from a certain point of view. I enjoyed playing it, does have a special graphic and great game mechanics, the overall sound is good. Keeps you entertained and satisfied.",
            "review_score": "1"
        },
        {
            "review_text": "Okay where i should start...  First of all i had pretty good time playing this game. The grapics wheren´t amazing and i disliked that the game did 80% of the things in the game (controlling the plane and stuff) but other than that the game is good and pretty relaxing as the game does almost everything for you.  but...BUT why so many bad reviews? Like seriously? how can anyone dislike this game so much? The answer is pretty simple: they are playing wrong genre. Not everyone likes strategy games, it´s like a first person shooter player played a strategy game and said: OMZ COD IS MUCH BETTER 0/10 DIS GAM IS SOE BAD. Note that if you don´t like strategy games don´t buy them in the first place. Srsly everybody who reviews games on steam keep your reviews creative: You are the one who gets those players who just cannot find a game for them (like me) to buy the game and play it. If you don´t like the game tell us whenever it´s a bug, bad gameplay mechanic or you just don´t like the game.  Edit: so as some people clearly see i haven't played very much this game and there is a good reason for it. If your computer can run good AAA game at 60fps and you are playing this what are you doing? Solid 1H of any new game can be worth 5h of playing this game and i agree. Im not trying to say that this is really good game but it isn't as bad as other reviews make it to be...",
            "review_score": "1"
        },
        {
            "review_text": "omg haha, this game, it's crap, it's terrible, and comicaly so, no way in herll i would reccomend this at full price but if you can get it on sale for a buck, like you can right now, it's good for a few laughs and mindless entertainment, the bosses have some interesting design but take this to heart right now: IT'S A 3D GALAGA CLONE! AN ON A RAIL SHOOTER, fun for a few minutes but not ground breaking, that being said, buy at your own risk, if you own bad rats, try this.",
            "review_score": "1"
        },
        {
            "review_text": "Got this game for free. It wasn't worth the time spent downloading it.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game ever 10 dollars wasted ♥♥♥♥♥♥ camera ♥♥♥♥♥♥ options ♥♥♥♥♥♥ voice acting and the graphics are even worse and i put difficulty on normal its like ♥♥♥♥ing hardest thing ever i keep getting one shotted by everything and enemy fighters come out of nowhere this really sucks",
            "review_score": "-1"
        },
        {
            "review_text": "First of all i didn't buy this game, i got it from indiegala for free. Hyper Fighters brought me back memories from the videogames i used to play in my childhood like Space Chicken Invaders.It's original settings can't be changed which is sad because it could have been a really good experience at a resolution that would fit my entire screen. The voice acting is poor, but the story seems interesting(for this genre). Also there are only 3 planes that you can choose from at the beggining of each game. Also there is a leaderboard, but i don't get how i can post my score there(i finished just one mission,so don't judge me). This game should be around 6.5 because it could have potential but the developers didn't care enough about it. I will give it a thumbs up just for this and i hope that the developers will change it....or at least the community.",
            "review_score": "1"
        },
        {
            "review_text": "This ♥♥♥♥, is not worth more than 0.50$",
            "review_score": "-1"
        },
        {
            "review_text": "bad flight battle thingy",
            "review_score": "-1"
        },
        {
            "review_text": "Boring and garphically incompetent game.",
            "review_score": "-1"
        }
    ]
}