{
    "app_id": 26800,
    "name": "Braid",
    "release_date": "2009-04-10",
    "developer": [
        "Number None"
    ],
    "publisher": [
        "Number None"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Puzzle",
        "Platformer",
        "Indie"
    ],
    "achievements": 12,
    "positive_ratings": 6529,
    "negative_ratings": 386,
    "price": 10.99,
    "description": "Braid is a puzzle-platformer, drawn in a painterly style, where you can manipulate the flow of time in strange and unusual ways. From a house in the city, journey to a series of worlds and solve puzzles to rescue an abducted princess.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/26800/header.jpg?t=1515716884",
    "minimum_requirements": "Operating System: Microsoft® Windows® XP / Vista / 7                   Processor: 1.4GHz or faster                     Memory: 768 MB or more                     Hard Disk Space: 200 MB or more                     Video Card: Pixel Shader 2.0                     DirectX® Version: DirectX® 9.0c                     Controller Support: Microsoft Xbox 360 Controller for Windows",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Fantastic, intelligent, brilliant and with a lot of spirit, this has to be, beside Fez, one of the best platformers I have ever played. Highly recommended if you wannt use your brain. :)  Art style is also beautiful, music pleasant.       Graphics:    ★★★★☆     Sound:    ★★★★☆     Gameplay:    ★★★★★     Music:    ★★★★★                  Overall:     ★★★★★    ",
            "review_score": "1"
        },
        {
            "review_text": "  One word for each aspect of this game.",
            "review_score": "1"
        },
        {
            "review_text": "A brilliantly designed game featuring smart puzzles, excellent music, beautiful art and a meaningful narrative executed perfectly within the mechanics of the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game belongs with Portal and Antichamber on any list of the best puzzle games ever made. All the puzzles involve time manipulation in some way and they are all original ideas you won't have seen before. The last level is one of the most clever I've ever seen and the plot is deep and thought-provoking. It's very hard to find anything to complain about here.",
            "review_score": "1"
        },
        {
            "review_text": "My wife and son left town for a week to visit relatives. I took off work to take care of and spend precious time with my 1 and 2 year old daughters. When they were awake, we strolled around the block, went for car rides, played toys, When they were alseep...one word...Braid. Special week. This game messes with your mind in such a good way. It's a difficult physical puzzle game played as a platformer. The story is deeper, albeit slightly hard to follow, than I expected. I had never rewinded time in a video game before Braid. The concept is borderline genius, and Jonathan Blow (creator) runs with it with surprising results. I'll recommend this game to gamers who don't get frustrated easily, who like the satisfaction after a difficult puzzle is solved, and who don't mind thinking before acting in a platformer. If it gets too difficult, there's always the Internet:)",
            "review_score": "1"
        },
        {
            "review_text": "Its like Maplestory...but with time travel...and hints of ♥♥♥♥!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This may be the greatest puzzle platformer ever made. What's so great about it? Firstly, the timetravel-based mechanics make for unconventional and diffult puzzles. Learning to think about yourself in time loops is extremely challenging and rewarding. With each world (or level), the game introduces a new timetravel mechanic that adds another layer of complexity to the puzzles. The puzzles become so hard that at certain points I had headaches and had to stop playing. But that pain is worth the payoff of finally being able to figure out a puzzle after spending an hour steaming at the ears. You feel like a God, until you reach the next puzzle.   But the best payoff of all is the twist at the end of the story. The story is primarily told through books read at the beginning of each world. The writing in this game is extremely contemplative and existential, dealing with topics like memories, identity, and the nature of relationships. The writing beautifully weaves into the timetravel mechanics for each world. The design of the mechanics, their ability to be relevant to the story, and their ability to make the game's puzzles more complex at the same time, is the product of genius. The story, like a poem, doesn't explain itself. It leaves itself open to interpretation. The replayability of this game is in the different meanings that can be thought of upon further playthroughs of the game.  The music of the game fits the aestitic of the art style and reflects the mood of the story very well. The gravity of the twist near the end of the story is helped by the music. The music plays a role in telling the game's story.  In conclusion, this game is the greatest puzzle platformer because it ties the story, gameplay mechanics, and music together SO WELL that I would go back in time to experience the game all over again for the first time (small Braid joke). If you like puzzle platformers and you don't buy this game, WHAT ARE YOU EVEN DOING?",
            "review_score": "1"
        },
        {
            "review_text": "Braid was the first 'big indie' game that I played. Braid was also the first game for me to really do a double-take on the Indie genre. Played as a 2D side scroller with a Mario-esque set-up (save the princess), it turns convention and expection on its head more than once - cleverness.   Many of the puzzles are difficult, but in most cases so cleverly designed that when figured out, you realize how simple they are - cleverness.   Braid is a tremendous argument for the awesomeness that the Indie genre can be. A must play for anyone interested in puzzle-platformers.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty fun but I can't imagine spending too much time with it. Great for people who like puzzles and platforming.",
            "review_score": "1"
        },
        {
            "review_text": "This isn't a bad game, it suffers from being overly hyped. Braid is very nice to look at, but I wouldn't say that everything is very well executed. The fact that certain mechanics are never given a decent explanation (i.e. what the arbitrary limitations are) makes a lot of this game very frustrating personally. I do like puzzles and games based around them, but there are too many times to me where the solutions have seemed 'fiddly', for lack of a better word. You may understand the solution perfectly well, but it may be unnecessarily difficult, often due to the awkward platforming elements. All in all I have some enjoyable moments in the game, but I am very glad I got it on sale because this is simply not worth $10. The visuals are extremely polished, the gameplay could have used more work in my opinion. The underlying story is also boring me to tears.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is truly unique and beautiful. The soundtrack and art is inspiring to behold. Besides all that great stuff the game is very fun as well. The game play involves controlling time forwards and backwards as well as copying yourself in forwards or backward to complete objectives to move forward. Overall an excellent play. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Puzzle platformers tend to be platform games with a few easy puzzles. Braid is a puzzle games with some easy platform elements. The puzzle mechanic is one of the most innovative I have seen. It involves time manipulation and challenges you to think in new ways to predict the consequences of manipulating time in various ways and use this ability to achieve your goals. It starts out easy and the difficulty ramps up at a good pace. Towards the end the game is challenging even for experienced puzzle solvers. The game is also non-linear in that you don't need to solve everything in one part of the game to progress to later parts, if you get stuck on a puzzle you can go somewhere else and come back to tackle that puzzle later. The game has an artistic style that feels completely natural and fits well with the unique style of the gameplay. Graphics and sound contribute further to make the game atmospheric. The story is told in various ways, including texts you can read at the start of each level but also, in a way, through the pictures that you need to assemble to complete a level. All in all this is one of the best puzzle platformers I have played and highly recommended to anyone who likes puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "Braid's become kinda legendary since it's release. It's usually touted as one of the few games that manages to be 'art' or at least it's managed to be considered art outside of the gaming community, which is apparently what people are really shooting for.  But on its own merits, Braid is really a brilliant game.  It's a puzzle-platformer where everything is built around time manipulation mechanics including going back in time, stopping time, speeding up time, etc.  The story and gameplay though is a deconstruction (there's that art game thing coming in) of traditional video game tropes, specifically the old Mario games.  The art and music are beautiful, and there's a lot of subtle hidden themes revealed through writing samples you gain throughout the game.  There's far more secrets as well, some are insanely difficult to find. Just search special ending for braid in youtube and you'll be astounded.  Overall it's definitely recomended. It's fun to play and explore, although some sections are very difficult.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, great puzzles, great meanings.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those artsy indie games. Also one of the first larger successes in the 'public' indie scene. The game itself it a platform puzzle game with elements or references from games like Mario and homages to several other 'old school' NES games. There also is a very interesting mechanic that is important to the core of the gameplay; Rewinding time. This little feature will prove more important than a simple 'save point'-feature in games such as Prince of Persia: SoT. In Braid certain elements are unchained from the time/space continuum - In other words, you can rewind time and unchained elements will stay put, or if you are holding them; Follow you back to where you were.  This entire process is used cleverly in the puzzles you are faced with.  Apart from the puzzles there is a very neat story tucked into the game(as with most artsy indie titles). Without getting into too much detail on that part; It reminds me of a very well known 'Save the captured Princess' scenario... With a twist. I'm not going to spoil it and I'll leave it up to you to figure out the rest.  It's a short but great game - clocking at around 5-6 hours to beat it. For what it is, it's well worth the time spent. ",
            "review_score": "1"
        },
        {
            "review_text": "To play this game your brain wlil require some thinking . Creating a game like Braid requires you to be a genius .",
            "review_score": "1"
        },
        {
            "review_text": "Braid took 6hrs to complete everything, so while this is a short game, it is quite satisfying. The time manipulation puzzles are very rewarding throughout, and are complimented by a nicely written soundtrack and story.",
            "review_score": "1"
        },
        {
            "review_text": "So what do you get when you combine something only understood by those who analyze Shakespear for hours and time travel? Something like Braid.  Braid's best feature is the awesome power of going back in time if you mess something up. What isn't mentioned is what this entitles as well. Going back in time at twice the speed allows you to beat objects unneffected by time travel to their destination, small gold rings create black holes in which time travels at a near stop, and creating copies of yourself by doing something you would do normally and then traveling back in time to do something else. Each world has its own unique time power (even the last) that the game gives only subtle hints about and I went bonkers (in a good way) having to figure that out for myself. That said, the game's short and will probably be finished within three hours if you're looking for all the puzzle pieces. GOOD LUCK WITH THAT. A beautiful game to witness and hear, yet still fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "This game aged well. Still blows my mind with how amazingly good it is.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome time feature, difficult riddles plus beautiful soundtrack and interesting plot - 'must-buy' game for every gamer.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful and haunting story, told in a mind-bogglingly unique way.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Addictive, but some of the levels are very challenging. Worth it if you like any sort of puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most beautiful gaming experiences you will ever have.",
            "review_score": "1"
        },
        {
            "review_text": "The greatest mind♥♥♥♥ you have ever experienced.",
            "review_score": "1"
        },
        {
            "review_text": "Worth playing almost entirely because of how unique it is. The mechanics are clever, the visuals are pretty, and it doesn't take too long. I wasn't a huge fan of the story, mostly because I couldn't make out what the hell was going on, so it mainly came off as a bunch of pretentious '2deep4u' crap. Still fun.",
            "review_score": "1"
        },
        {
            "review_text": "This platformer wears its Super Mario influences on its sleeve but adds the twist of time manipulation. The art direction is great and some of the levels are very challenging. Braid is the embodiment of the Indie Darling.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a very challenging and beautiful game. This game can get very difficult and unfair at time. I give this game a 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is ingenious.   Seriously, my mind felt like it was being thoroughly stretched and distorted by the twisted challenges offered by Braid.   Buy this game. Buy it twice and grind the second copy up, turn it into pill form and be like Bradley Cooper in the movie Limitless.*     *Don't do drugs.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best indie games of all time. I wish all games were braid.",
            "review_score": "1"
        },
        {
            "review_text": "You ready for mind♥♥♥♥? You better be, because this game will steal your brain's virginity like there's no tomorrow, then it'll take a break and have a cigar before it flips you over and comes back for seconds. It requires some thinking to master, so you gotta be smart to play this!",
            "review_score": "1"
        },
        {
            "review_text": "Over rated and convoluted. Much of this game's praise seems to stem from is setting and story rather than mechanics, but I found it to be the other way around. Keeping it short... The time-reversal based puzzles were impeccably creative. They were fun, mostly fair challenges to navigate. The story's attempt to be deep ends up being head-scratchingly vague with many nonsequential nuggets of it delivered throughout. Having time manipulation as your game's theme isn't much of an excuse for just mashing a myriad of vagueries together and expecting people to find it deep and brooding (which apparently lots did.) Even after looking up a detailed story/ending synopsis, the ultimate 'true ending' is hardly tantamount to the work it requires to puzzle it out.  I bought this game expecting a short and sweet but heavily impactful emotional trip like the amazing 'Brothers: A Tale of Two Sons', but was left with just a quaint, fun little indie platformer.  Would reccomend if on sale for a buck or three. Excellent soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "A masterpiece of a puzzle game! A really ingenious piece of work! I loved every second of it! Find all stars if you can!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting, challenging and fun.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful and challenging Puzzle solving game. The Story was superb and everything about this game makes it great till the end. I do advise you to read up about the star pieces before you play this if you think you want to get them (they are not required), otherwise you won't be able to get one of the stars later on if you want to get them.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful experience. Deciphering and mastering the different uses of time in this game is a delight. Somewhat 'pretentious', but the sense of accomplishment as you solve each level can't be denied. A really refreshing change of pace.",
            "review_score": "1"
        },
        {
            "review_text": "Great FPS, would recomend to anyone who is a fan of the 'Badrats' franchise.",
            "review_score": "1"
        },
        {
            "review_text": "fun and novel gameplay, recommended to everyone to try at least once.",
            "review_score": "1"
        },
        {
            "review_text": "Solid unique platformer with an interesting story",
            "review_score": "1"
        },
        {
            "review_text": "i wish this game was life because if it was i could die 500 times",
            "review_score": "1"
        },
        {
            "review_text": "Get killed [Hold Shift]... Try again Jump Mistake [Hold Shift]... Try again Bad timing [Hold Shift]... Try again Like the soundtrack [Hold Shift] Try again Moonwalk [Hold Shift] Try again",
            "review_score": "1"
        },
        {
            "review_text": "09/10",
            "review_score": "1"
        },
        {
            "review_text": "At this point it really isn’t news that if you like indie puzzle games you should play Braid. This game is part of the canon—and for very good reason. Braid is a beautiful piece of craftsmanship.  The core engine of Braid is a simple, 2D platformer reminiscent of Mario. (The resemblance to classic Mario is more than passing, and the creators of Braid overtly nod to it at several points.) But to the simple mechanics of jumping and dodging Braid has added a novel element: the ability to reverse time. At the touch of a button you can rewind your performance of a stage to whatever point you like and then begin again from that point.  That alone would be novel, but not worth much—just an alternative to replaying levels—but Braid makes this mechanic the central tool in the solution of an array of tricky puzzles. At first your control of time is just a way of undoing mistakes, but it quickly takes on other dimensions as you, for example, discover items which are immune to your powers and so keep moving normally while all else rewinds. Solutions to the problems Braid poses are not usually a matter of muddling through, trying things until something works, but instead involve having some insight about the central mechanic and how it affects your surroundings. Like a good riddle there is a moment of dawning insight and suddenly you see things in a new way.  And the surroundings are themselves wonderful. While the mechanics of the game would be worthy regardless (an early version of Braid won a game design award while the graphics were still just place holders) the graphics makes the game into a piece of visual art. Everything in Braid looks hand-made in the best possible sense. The levels have an almost water colored look. And while there are actually fairly few sprites in the game, corresponding to the small number of pieces out of which levels are constructed, the background elements are various and gorgeous. Each group of puzzles has a distinct aesthetic subtly adapted to the content of the gameplay. Beautiful, low key instrumental music compliments all this perfectly. This game is simply pretty, and in a way that makes playing it feel meditative.  The story, provided mostly by textual interludes, is rather impressionistic. I found it difficult to make sense of, and in the end not entirely satisfying. But nonetheless thematic elements intertwine with the gameplay. The most obvious example is that you play as a man troubled by regrets, and this theme of regret resonates in the mechanic of undoing actions you have already performed.  Braid is a piece of art, pure and simple, but as already mentioned it is also a tightly designed puzzle game. This means some stages are rather challenging, as they should be. However, a nice feature is that the puzzles are not locked into strict sequence. If the needed insight simply will not come in one place then it is open to the player to skip ahead and return for the missing bits much later, lessening the potential frustration that’s part of puzzle games.  Braid has taken simple parts, things that have been around since 8-bit consoles, and polished them until they shone. Play it. You’ll be glad you did.",
            "review_score": "1"
        },
        {
            "review_text": "Braid is an intriguing game where you use the power to rewind time to solve a variety of platform puzzles. As you progress through the game, you encounter new and different effects that give each level a unique challenge. Although there is some written plot, the game is driven mostly by player action.  The biggest turnoff I've found for this game is that it was very poorly ported from console. You *can* use a keyboard, but its very uncomfortable and goes against keyboard control standards. And you can't change them. On top of that, you can't change any video settings, not even to go from fullscreen to windowed mode or the resolution. For my multi-monitor setup, that is annoying and distracting.  Overall, I say this game is very much worth playing. However, I strongly advise playing it in its native console form.",
            "review_score": "1"
        },
        {
            "review_text": "Definetly the HARDEST game i've ever play !!  'Come On. This will not be as hard as you said.'  Maybe yes. Braid introduces itself with simple puzzles that even 5 yo girl can finish those. But, in a mid-game you will experience new conditions that surely cause you to fail at first and want to give up already. These damn 'barriers' sometimes so annoying and you will struggle with them until the end of game.  There are many walkthrough videos which uploaded by those smart guys on community hub and you can just follow those instruction to get all the puzzle pieces quite easily. But, will you still getting scared by a horror movie when you're already know when those ghosts will appear? Same goes with BRAID, the real experience come if you try to solve the puzzles by yourself.  Other than that, Braid gives some heavenly soothing atmosphere through good music and nice graphic. These things are what i think the best part of this game. There also will be many references of many old popular games you have played before.  In my conclusion, this game is not for everyone (as others told it too) but for you who likes puzzles and willing to strrugle with them will find yourself immersed in the game and somehow addicted to it. Giving it 8/10 (because it's hard).   ",
            "review_score": "1"
        },
        {
            "review_text": "Definetly the HARDEST game i've ever play !!  'Come On. This will not be as hard as you said.'  Maybe yes. Braid introduces itself with simple puzzles that even 5 yo girl can finish those. But, in a mid-game you will experience new conditions that surely cause you to fail at first and want to give up already. These damn 'barriers' sometimes so annoying and you will struggle with them until the end of game.  There are many walkthrough videos which uploaded by those smart guys on community hub and you can just follow those instruction to get all the puzzle pieces quite easily. But, will you still getting scared by a horror movie when you're already know when those ghosts will appear? Same goes with BRAID, the real experience come if you try to solve the puzzles by yourself.  Other than that, Braid gives some heavenly soothing atmosphere through good music and nice graphic. These things are what i think the best part of this game. There also will be many references of many old popular games you have played before.  In my conclusion, this game is not for everyone (as others told it too) but for you who likes puzzles and willing to strrugle with them will find yourself immersed in the game and somehow addicted to it. Giving it 8/10 (because it's hard).   ",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful puzzle game that involves messing with time. While reversing or speeding up time seems like it wouldn't do anything, there are green objects which are unaffected, which is how you figure out the puzzles, which range from easy to walkthrough-level.level-hguorhtklaw ot ysae morf egnar hcihw ,selzzup eht tuo erugif uoy si hcihw ,detceffanu era hcihw stcejbo neerg era ereht ,gnihtyna od t'ndluow ti ekil smees emit pu gnideeps ro gnisrever elihw .emit htiw gnissem sevlovni taht emag lufrednow A",
            "review_score": "1"
        },
        {
            "review_text": "Great relaxing game. Very difficult puzzles. The game is just overall gorgeous.",
            "review_score": "1"
        },
        {
            "review_text": "Everybody makes mistakes. After all to err is human, but what if we revisit our past, fix the problems we create and come out the better for them? This is the crux of Braid, a game that at it's core, is about someone who has done something very bad and is now doing everything in their power to wind back the clock and make amends. Eloquently penned and highly symbolic it tells a story with a deliberate purpose, the details of which have been picked and scrutinized over. It's meant to be open ended, to inspire discussion, and ultimately to make you sit and ponder the outcome, which speaking purely from my own perspective caught me entirely off guard and was cause enough for me to pause and step away from it to contemplate what it all meant.  Built around the narrative (or perhaps the other way around) are the puzzles which again deal with the manipulation of time. At first it's simply a way out of the inevitable mishaps you get into, but as you progress they evolve into much more elaborate and inventive conundrums, continually changing up the rules while keeping the framework intact. Again and again I was astounded by the simple elegant way everything fit together, much like the jigsaw pieces you collect, each part feeling necessary and fleshed out. This goes a long way in keeping the puzzles challenging and absorbing, and although it is a short experience developer Jonathan Blow makes smart use of his time and doesn't waste yours with filler or sections that fall flat from poor execution.  The rich pastel backdrops that blend effortlessly with the stunningly animated sprites, create a scene that looks like a watercolor painting in motion. It's absolutely beautiful and perfectly matches the tone of the narrative, further complemented by the soundtrack which flows alongside it in time, seemingly telling its own story in the process. It's an artistic masterpiece that captivated and enchanted me the moment I laid eyes upon it, and the organic pacing kept me wholly engrossed throughout.  If you only play one puzzle-platformer in your time, Braid would be very close to the top of my list. It personifies the genre better than almost anything that came before it or after, and did so before the genre was anywhere near as prolific as it is today. If for some reason the story doesn't grab you the brilliant puzzle designs will, and those that look deeper be duly rewarded with what has been placed beneath the surface. I savored my time with it and am now, like our protagonist, wishing I could go back and relive it over again.",
            "review_score": "1"
        },
        {
            "review_text": "I barely wish for a game to have thumb that is neither up or down but just kinda 'meh'. Right there in the middle. On the other side I do not like it to have a 'meh' opinion. DAMN YOU BRAID! :D  Now, I know this game has been praised all up and down for being amazing, and it is. Except for the times when it is not.  To me, the most interesting parts about Braid are the art style and the core gameplay mechanic. While I can't do anything but praise the style of the game as well I will do so. Be praised Art Style! Your rock! The core mechanic, however, is a double edged sword. It basically is all about turning back and replaying time. You can do so manually at all times or sometimes you'll have a special time mechanic on your hands:  In example, when your movement is queued to the entire game world. Walking forward will move you and the time, standing still will freeze it and walking backwards will rewind it.  There are quite a few different time mechanics within Braid, but since I'm not all that evil I won't do spoilers here. Oh yeah you can walk and jump here. That's like the platforming part. It's solid but nothing special without the time travel thingy.  While this makes for an amazingly fresh gameplay experience, some of the puzzles tied to it are ridiculous. You'll spend hours upon hours to solve a single game screen just to get frustrated as hell, turning to a youtube guide if your computer can still play videos after you've tossed it through your entire apartement, out the window and ran it over with a truck. Twice.  Some of the puzzles later on even require the usage of tricks never hinted at, let alone explained wich just seems cheep. There may be the 1% of players who will dedicate their live to solving those puzzles without a guide but there's a 1% of people who try to invent time travel itself in the real world as well without much success. So yeah.   Another interesting thing are the collectables. You can run through almost the entire game, skipping all puzzles. Now it won't do you and good and you'll be done with the Braid within 15 minutes. So don't do it. Embrace the rage! By collecting certain things you'll uncover other certain things wich will uncover 6 very certain things and the games ending. Wich in itself is a thing. So ya. Getting those collectables is the goal of the game.  There are a few more things I wanna praise here to look in the mirror tomorrow morning, hating myself for being mainstream or something.  Yet another great apsect this game does have for it is the music. it's great. I do have the feeling that it is intendet to calm you while the hate about not solving puzzles inside you does grow to an infinite amount of pure rage. Just like the visual part of the game it feels 'real'. As in, all hand made. A warm piano accompanied by a soothing Cello charm your ears while you are afraid of blowing up the house on the other side of the street if your speakers fail to work all of a sudden. Or if you use the time mechanic (wich you have to) for it will rewind the soundtrack as well wich sounds god awful. So basically, the music makes you afraid of solving the game... Soundtrack, you've nailed it! Except for the fact that you make me staring at the screen not doing much at all cause I am afraid of rewinding you.  The story is surprisingly deep for a puzzle platformer. Not deep in the sense of an epic story that will unfold before you but deep as in you'll find yourself thinking about it... in fact, Braid is kinda vague on the story thing with a bunch of diaries as your only lore. But those diaries are, in fact, very well written and thought worthy... You'll (or can... there are those people) squeeze your thoughts in a philosophical attempt, triggered by those diaries in the game... with about 30% of your brain cells while the other 70% will be occupied crafting a pipe bomb you'll stick into your computer, watching it blow up in satisfaction about the running gamescreen fading to black while you'll get caught into the explosion. Story, you are awesome! Kind of.... Kant would like it I suppose.... or Tolstoi. Maybe...  (Dat ending though.... 12/10)  There are more likable aspects about this game (like dropping huge objects on people and jumping on heads) wich do result in the same awesome but not awesome part of the game. In the end, it is indeed a great game wich you should buy but it also sucks ♥♥♥ for it will ruin your day whenever you start it. Wich probably means you shouldn't buy it. So buy it! Or not! I dunno.   You'll have to answer yourself a simple question: Is the massive frustration worth the whole lot of joy you'll get from this game? I do not regret buying it at all but damn! This new computer was expensive!  Yet again... dat ending though! 13/10!   (if there are any typos I DON'T CARE CAUSE I'M RAGING!)    Oh did I meantion the ♥♥♥♥ing impossible to beat speed mode? I didn't? Shame on me!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful artwork, beautiful soundtrack, devious puzzles, and one of the greatest uses of mechanics as metaphor in the game's final moments.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best story driven platformers around. The variations on time in the puzzles are delightful. Absolutely recommend. 11/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that utilizes a concept that's been used before, but takes it to its utmost reaches to deliver the thought of time in a fresh, challenging and engaging way. Kudos.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome indie game! Beautiful music, great puzzles, gorgeous graphics. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the earliest indie games to make a name for itself and still one of the best.",
            "review_score": "1"
        },
        {
            "review_text": "A charming experience which never out-stays it's welcome and always manages to make you feel clever.",
            "review_score": "1"
        },
        {
            "review_text": "'If I could save time in a bottle, The first thing that I'd like to do, Is to save every day till eternity passes away, Just to spend them with you' -Jim Croce ",
            "review_score": "1"
        },
        {
            "review_text": "Probably the most brilliant allegory in gaming history thus far. If you don't complete this game with all stars   and 'get it'  , go back to farmville. Filthy casual.",
            "review_score": "1"
        },
        {
            "review_text": "  Braid is a curious game for a lot of reasons, despite it's impressive art style and legacy it actually isn't as enjoyable as it appears.   As the trailer suggests you are capable of turning back time, thus you never officially die. Despite this the leaning curve is quite steep and not always fair.  If anyone has heard of the Infamous Goat puzzle in Broken Sword this may make a bit more sense. But basically in the point and click adventure game Broken Sword there is a puzzle that requires quick timing. But you the player have never used it before, so what makes it so difficult is your lack of understanding and knowledge of a gaming mechanic. You are unaware that you are even capable of doing what the game expects you to do.  This is how Braid often feels. Although it is a very clever game many of puzzles require you to use your powers in unconventional ways to meet your goal. Although I never cared for tutorials or hand holding, the way it expects you to use your new abilities can often seem ridiculous and are incredibly specific.  As an example there's a part in the game that requires you to let an enemy kill you, by doing this you see that when the enemy kills you it jumps back upward as it falls on top of you. Similarly to how Mario would when killing a goomba.   But lets say you rewind too fast to realize this is something that can happen or you've never had an enemy kill you from above.  Because there's not really an oppuninity in the game dedicated to this very specific mechanic you might not know you're able to do this.   Since you don't know all the mechanics the game can feel as if it's cheating you. It's not that you didn't understand the puzzle but rather you didn't understand a mechanic that was never revealed properly in the first place.  Braid does this multiple times, which is where I find the most difficulty in the game.   As for the story? It's interesting but for lack of better words leaves you feeling empty of confused. Even when you do research into theories or see the ending of the game you just never feel as if you knew the whole experience. And that's not always bad but a lot of games can hold a sense of mystery while satisfying the player. This game just didn't satisfy me with it's conclusion.   Furthermore to complete the game in it's entirety you are required to collect stars. Many of which you as the player would never have even known were in the game. The first star in world 2 takes about an hour and a half to collect by standing on top of a cloud.  Let that sink in, how is the player expected to wait that long at the beginning of the game?   Perhaps later in the game a challenge like that is realistic after the player is aware that there are actual collectables. But for the completing the game it felt unfair. There is a star map at the intro but I was unaware that I could actually collect items for it as well.  Furthermore despite how interesting the story is the creator Johnathan Brow is rather pretentious in his attitude towards those theorizing or reviewing his game.  If you'd like to play it I'd suggest to avoid reading his lengthy interviews as they just leave a sour taste in your mouth and ruin the experience of a decent game.  It's normal for an artist to be protective of his work and to have a specific outlook or belief. Brow often justifies parts of critiques and mistakes as being intentional or experimental. Yet as an artist regardless of if an element is intentional or not that does not make the game improve in quality if it wont translate to the player. A game element needs to make sense not just in the eyes of the creator but the audience.    Furthermore the soundtrack is pretty but incredibly repetitive and many levels don't suit the soundtrack. Plus, a world in the game requires you to listen to the majority of it in slow motion or backwards and trust me when I say it gets irritating quickly.  The enemies feel uncreative, but I'm sure they serve some purpose in terms of appearance besides being a reference to Mario. Although the sound effects for the rabbits and goomba looking enemies are annoying.  So please before purchasing this game for 15 dollars just know that although it isn't a bad game it is overhyped. It might be a enjoyable use of your time but I don't believe it's worth the 15 dollar price tag.",
            "review_score": "-1"
        },
        {
            "review_text": "One of my favourite all time games.",
            "review_score": "1"
        },
        {
            "review_text": "There is nothing like this story telling, this game is an extremely strong example of video games being art. You will left guessing whats going on here well after the end, there are also some cleverly disguised secrets that you will probably not be able to find on your own. Its all like a damn painting. Do buy.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and touching experience.... read texts.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the greatest indies ever made. The witness can't come soon enough!",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, for the longest time I hated this game, but this is actually a brilliant puzzle platformer, one of the earliest of it's kind actually.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Indie with impeccable level design and a story that is opaque but has depth. Every level has it's own gimmick on time and it's flow, that has to be masted to conquer the puzzle. Each level is ingeniously simple yet takes careful thought to progress. One of the best Indie puzzle games ever released.",
            "review_score": "1"
        },
        {
            "review_text": "Braid's puzzles are all solid, the 'storyline' is ok, and the visuals are great. Not hugely replayable, but worth it just the same.",
            "review_score": "1"
        },
        {
            "review_text": "The graphic looks beautiful , i loved it ! also the soundtrack !!   Recommended for you ! :)",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing",
            "review_score": "1"
        },
        {
            "review_text": "The most intelligent, beautiful looking and sounding, thoughtful, profound and rewarding game I think I've ever played on!",
            "review_score": "1"
        },
        {
            "review_text": "The music is awesome and game is overall very enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "This game awesome with its state of the art mechanics! INDIE GAMES!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing and inspiring little game! Maybe not the longest one out there. The story is a little confusing just like the whole game that seems so mysterious. Awesome puzzles that don't have to be solved in order. Each of them is small and focuses mainly on one smart idea. They're constructed in a way that requires quite a bit of effort to figure out, but if you keep messing with it, you should be able to come up with the solution on your own eventually. Managing to solve a puzzle gives amazing satisfaction and makes you feel really smart. Try it! I love it. :)",
            "review_score": "1"
        },
        {
            "review_text": "The best puzzle game I've ever played. Definitely worth $10.",
            "review_score": "1"
        },
        {
            "review_text": "Retroperspectivly i have to call this game genious.  First time i started it I kind of blindly ran through the first two worlds and was like 'well, i still dont know why this is supposed to be so good.' It took me quite a while to get the hang of it. The game plays perfectly with the mechanics it provides. I was repeatedly surprised by the amazing puzzles it has. Then i could not stop to play it till i finished it.  Collecting all the puzzle pieces might not be an easy task but when you succeed, man you feel good.  Can only recommend this game, just give it a bit time if you do not like it from the beginning, you will like it at last!",
            "review_score": "1"
        },
        {
            "review_text": "mind = fked, totally awesome 2d game 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Very imaginative, satisfying platformer. Worth it at full price (unless you do not like puzzles).",
            "review_score": "1"
        },
        {
            "review_text": "Time and matter control mechanics are awesome.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really cool puzzle game that feels very inovative. Really like it. Watch the trailer.",
            "review_score": "1"
        },
        {
            "review_text": "While the graphics are not entirely my style it is still a beautful game. The puzzles are difficult enough to make it a challenge but not too difficult for a rewarding gameplay.  It's not that long, which makes it perfect for one evening of entertainment.",
            "review_score": "1"
        },
        {
            "review_text": "A good choice for both story lovers and puzzle players. Challenging puzzles surround a special story that is nice to experience and leaves a lot of room for interpretations.",
            "review_score": "1"
        },
        {
            "review_text": "I has 2 b smert 2 pley gaem -1/14 iz teribul",
            "review_score": "1"
        },
        {
            "review_text": "At first glance it may look like a hipster version of Mario { something it's not shy about hinting at itself } but at it's core Braid is more of a puzzle game with a platformer interface. It is at times very challenging and fighting the urge to do a search on youtube for the way to clear an area could be tough for many people.  Visually it has a timless art style which keeps it seperate from the graphic spec' fights of contempory titles and as a 2D game it is not overly taxing on the machine it is played on.   The Story, though hidden in a way, is actually quite deep &amp; somber but i'll not spoil it. The length of the game is on the short side but for most people the puzzels will slow them down enough to get a good few gaming sessions out of it. Gameplay wise, it is inventive and surprisingly intuitive. There is little need for any tutorial beyond trying out the variations on the mechanics each world brings.   The real downside is probably the replayabillity once you have collected all of the puzzle-pieces. Speed players may go back to try and beat their time but beyond that not much would bring the player back post completion.   While most games out there lately seem to be either clones of other games or made to be easy to beat, this is refreshingly challenging. It looks good and it plays well. If you like platformers and puzzels, get it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best indie games I've played",
            "review_score": "1"
        },
        {
            "review_text": "This game made me hate bunnies. 11/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "As beautiful as frustrating Braid tells a story through nonverbal communication, clever puzzles and immersive music, a story that is yours to discover. More than that, Braid is an artistic expression. It's a must in your library and an icon in the popculture of indie gaming.",
            "review_score": "1"
        },
        {
            "review_text": "I nominated this game with the 'Test of Time' award. Without any hint of irony.  10/10 still great today.",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to like Braid, but I just don't. The art style is nice and the time warp mechanic is unique, but the game is too frustrating. It's a kind of game where you know exactly what you want to do, but you still take ten tries to do it. And every time you mess it up, you have to hold down that time reverse button again, and again, and again, and again. It's tedious and frustrating. Sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "would melt my brain, then i would unmelt it, then i would melt it again.     ✮✮✮✮½  ",
            "review_score": "1"
        },
        {
            "review_text": "Very good. I watched myself become born. Just kidding, it's not actual time travel.",
            "review_score": "1"
        },
        {
            "review_text": "The best indie game I've ever had the pleasure to play...Breath taking soundtrack and story, creative art and game play. Very moving.",
            "review_score": "1"
        },
        {
            "review_text": "You get to be a hipster AND a stalker! 10/10  Shout out to that one hipster stalker who le downvoted my review!",
            "review_score": "1"
        },
        {
            "review_text": "Nice and great puzzle game! Hurts my brain a bit but worth it!",
            "review_score": "1"
        },
        {
            "review_text": "From the many positive reviews of this game, I was expecting a great puzzle game that used the ability to go back in time as its main puzzle-solving technique. And this game did it pretty well. The main problem I have with the game is that you can pass levels without having to solve the puzzle. It is nice to let players continue the game if they can't solve hard puzzles, but if you can go through most of the levels without trying to solve the puzzles, the game isn't very fun.  So although the game did a good job of utilizing a unique power as the tool of the game, I didn't enjoy playing it.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best games I have ever played and a milestone of indie gaming. The game that most frequently comes to mind on the subject of 'video games as art.' It is both beautiful and immensely fun.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game because of the good reviews it got. I was wrong. I don't like it at all. I just don't understand why this game is said the be so good and gets a very high score on metacritic. It's more a puzzle game than a platformer. I have been playing games (all genres) for almost 30 years and this has to be game that I will remeber as a dissapointment and overrated.  If possible try this before you buy it!",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting concept. Many levels too difficult.",
            "review_score": "-1"
        },
        {
            "review_text": "The best part about this game is the presentation. The graphics and music are beutiful and relaxing. The idea of reversing time is interesting, but I feel they could have done more with it. The game's also very short, you could 100% it in about 5 hours if you know what you're doing. Overall, puzzle lovers may enjoy this, but it didn't really do anything for me. If you want to buy this game, wait until it's on sale, because $15 is WAY too much.",
            "review_score": "-1"
        },
        {
            "review_text": "This started off fun, with reasonably simple puzzles, but by the end you are on the brink of quitting out of frustration- verdict: not fun",
            "review_score": "-1"
        },
        {
            "review_text": "This was kind of fun, but also very irritating. **",
            "review_score": "-1"
        },
        {
            "review_text": "if even soulja boy says this is dumb then you know its dumb",
            "review_score": "-1"
        },
        {
            "review_text": "Personally I found this the most boring and dumbest games ive everyplayed with constant boring-ness and dumbness-ness To sum my review this game sucks....alot  1\\10 - To much water",
            "review_score": "-1"
        },
        {
            "review_text": "I believe this game to be extremely over-hyped. I bought it on sale for about $4 and wish i could get my money back. The controls are rough and the plot is almost non-existant. I managed to play it for about 1/2 hour before i couldnt force myself to play any more. It was a good theory, but they failed in making it (virtual) reality. The only good thing i have to say for this game is that it looks amazing. Now if only they had put some of the effort they put into the looks into the rest of the game, maybe it wouldn't be so terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "I find the time travel mechanic pretty unique, but the game overuses it. I found that all the puzzles were challenging, for me anyway. One of my problems with this game is for those people who aren't really into it for the collecting can sometimes just simply walk right to the exit. I found this games puzzles interesting and creative, using the time travel really well. But some of these are nearly impossible and the fact that i could just walk right past it was really annoying. Take world 2. The ... hedgehogs, I guess, were getting fired out of the cannon and you had to time it perfectley to make it across the gap. I ended up just walking right past it after trying MANY times to make it. And the no dying? Breaks alot of gaming rules. Dying is part of how gaming works. And besides, it's not like it helps you. It takes you back to exactly where you are and for most of it all it helps you with is knowing that you were off by a few seconds. Pretty useless. The game fails to tell you anything about what things do and how they work. I had to figure out how to go back in time which i caught on to at the start of the second world. The story was pretty dull and boring so i really didn't pay attention to the text. The game isn't exciting. The music is bland, the puzzles can be repetitive, the story is boring, the game is confusing, and it's just not that fun.They even started reusing puzzles! I swear, the first world has a parkour to the end level. 2 worlds later, they have the exact same level, but you have to kill all the monsters on your way. Again, the game overuses the time travel. Need to revive, time travel. Kill a boss, time travel. Timed something wrong, time travel. Do anything wrong whatsoever, you guessed it. TIME TRAVEL! To sum it up, this game is probably the worst I currently have on Steam. It's just different for me cause i'm used to sidescrollers to having killing things, platforming, and making to the end of the stage. Not going back in time to solve problems, having optional puzzles on the way, and taking a nice lovely stroll through a bland field and occasionally jumping over a hedgehog. This game gets a 2 out of 5.",
            "review_score": "-1"
        },
        {
            "review_text": "Did not like it, clunky controls, extremely slow paced, and the special powers are not fun at all. Played 18 minutes before giving up.",
            "review_score": "-1"
        },
        {
            "review_text": "You know... I get this game. I really do. I just didn't like it, and I can't put my finger on exactly why. Maybe oldschool side-scroller games just aren't my thing, but I found myself very bored very quickly.",
            "review_score": "-1"
        },
        {
            "review_text": "Hyped, well over hyped. I need not say more.",
            "review_score": "-1"
        },
        {
            "review_text": "Ugly art design, bad soundtrack, boring story, very short. The gameplay mechanics were nice, but that game annoyed me.",
            "review_score": "-1"
        },
        {
            "review_text": "Why the hell does everyone love this game so much?! It's just Mario with terrifying art! ... Oooooooooooooooooooooh. Time travel. Eh, I can still live without it. Maybe it gets better later on, but man, do I not have the patience for puzzles, and man, do I not have the patience for platformers, and MAN, do I not have the patience for both at the same time.",
            "review_score": "-1"
        },
        {
            "review_text": "Do you like pretentious shitfests that are so concerned with what Eurogamer thinks that they put its ♥♥♥-kissing review right there in their Steam Icon? Do you like stupid Yanni music and dumbass Raffi graphics? Are you amazed at a VCR's ability to rewind and fast-forward, and are you ignorant enough to believe this game was the first to offer such a gimmick? Well, then you'll simply ADORE Braid!",
            "review_score": "-1"
        },
        {
            "review_text": "It's creative, but it's more of an exercise in irritation rather than a game. It could be worse.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretentious hipster wank  0/10",
            "review_score": "-1"
        },
        {
            "review_text": "i actually don't like this game at all",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best games I've played in the last decade, Braid is a puzzle platformer about time and motion. Our little hero cannot die, because he can control time forward or backwards, including its speed. This might look like a simple concept, but wait until you see what the devs have made of this. The puzzles are mind-blowing. In each new world, you will have some different powers than on the others. Your main power (the time rewind) will still work as usual, but now it can have some side effects.   For example, in world 4, time forwards when you walk to the right and rewinds when you walk to the left. In world 5, after rewinding, a shadow of yourself does the same thing you did before rewinding.   The graphics and ambient are gorgeous, control is good, time manipulating powers are fun to use, and puzzles are hard enough (but with good progression) to be satisfying to solve.",
            "review_score": "1"
        },
        {
            "review_text": "It's an amazing game with a deeper meaning, if you want to search for it.",
            "review_score": "1"
        },
        {
            "review_text": "Quite an interesting and different game, and very much worth the money! Music is great too, and you may want to listen to it outside the game. Also, very glad that it funs on Linux!",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest indie titles of all time! Very innovative game mechanics with magnificent art. Later levels get very tricky and it feels great to solve them. Highly recommended for everyone!",
            "review_score": "1"
        },
        {
            "review_text": "An oldie but a goodie. Braid is one of the first puzzle games that I've sat down and figured out on my own in a long time. The story is mysterious, but engaging, and the gameplay mechanics consist of a varied blend of time-controls. Some levels felt somewhat obvious at first, but proved themselves to be harder than I had figured. Completing levels in Braid was the first time I've felt genuinely clever while playing a game in quite a while.",
            "review_score": "1"
        },
        {
            "review_text": "An ingenious piece of art that makes you look at life differently. I couldn't get enough of it.",
            "review_score": "1"
        },
        {
            "review_text": "The music is beautiful, and the story is deeper than you might expect. I really enjoy the rewind feature; I haven't seen anything like it in other games, but its importance to solving the puzzles in this game is really just lovely.",
            "review_score": "1"
        },
        {
            "review_text": "Revolutionary. One of the best games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "An absolute classic. Talk about reinventing indie games, platforming, puzzle games, storytelling.  Some might not like it, and that's OK.  But it's one heck of a game. You've got to respect that.  Rating: 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is easily one of the most creative and original games that I've ever played. I loved the soundtrack. Jonathan Blow's decision to license the music--music written by composers for the sake of the art, not because they needed another track for a level--was excellent. The writing and story were superb! I can't say strongly enough how much I enjoyed the story (though to get the full story, you have to get the stars and getting the stars without looking up how is near impossible). The game mechanics were fun, consistent, and well thought out. The puzzle design is by far the stand out feature here. Of course there's the 'respect for the player's time' and 'no filler' points that they make (and fulfill), but for me the excellence of the puzzle design is that each puzzle has a definite, 'low impedance' answer (or answers, could be more than one, but each of them definite as I'll explain). Each solution is singular within the mechanics of the game, without introducing artificial limitations that contradict the rest of the game. There's no randomly twiddling with stuff until you slip past. While some games have some puzzles with no clear reason why the solution works, in Braid, discovering 'why' the solution works comes first, and is the only real requirement to solving the puzzles. If you've never played Braid, I envy the experience you have waiting.",
            "review_score": "1"
        },
        {
            "review_text": "Defiently a masterpice. Check this out if you havn't already.",
            "review_score": "1"
        },
        {
            "review_text": "A platformer with truly unique mechanics and an amazing story to boot. The painted art style is lovely too.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't love this game. Still, the time-shifting concept is neat, especially when new mechanics come up (time-constant objects, backwards-moving events, etc), resulting in very creative puzzles. Consider buying it if it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful artwork, challenging puzzles, and an excellent story.",
            "review_score": "1"
        },
        {
            "review_text": "Braid is the closest I've come to playing a game that is also a work of art. It truely allows you to seep into the story and connect your emotion to the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a lot going for it-- a deep story, pretty graphics, some of the best music, and great gameplay.  The story is not at all forced. There are several books lined up at the start of each world, and you can just run right past them without even reading them if you like. However, if you go deeper, you discover just how thorough the story is. Check the internet if you can't figure it out, because I don't want to spoil it. It'll blow your mind.  The game allows you to rewind time, so even if you fall to your death, you can undo it. It allows you to mess up and know you messed up, but then it doesn't take away the last five minutes of your life by making you redo the level and re-obtain what you got. That's a daring move, but it works for a game like this.  Braid is an experience. There are few games that aren't just fun but also artistic and mind-blowing. Braid is the few.",
            "review_score": "1"
        },
        {
            "review_text": "Beatiful and simple. A must-play for anyone who grew up on the 2D platforming experiences of Super Mario!  8.7",
            "review_score": "1"
        },
        {
            "review_text": "Braid is the game that got me interested in indie games as a whole. Can't rec' enough. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Ugh. I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "A game like no other, Braid is by far the most brilliantly crafted video game I've ever played. This game defines the puzzle-platform genre. It is a masterpiece. In my opinion, it does everything a video game should do: It causes you to think in a unique way. It challenges your mind without frustrating you too much. It combines beautiful art and design with distinctive gameplay to give you a breath-taking experience--Braid is a journey I won't soon forget.",
            "review_score": "1"
        },
        {
            "review_text": "I'm recommending this to get the holiday acheivment. BUT it is a good game all the same.This 2-d Puzzle game takes time controll to the forth dimension with good visuals and an amazing soundtrack. I still have yet to find a freakin' star, which proves how challenging it is.",
            "review_score": "1"
        },
        {
            "review_text": "This game is extremely unique as a puzzle platformer; introducing new elements that have never been brought to the table as well as innovating on its very own originality. I am simply floored with the allegorical depth and beauty of this game. Good looking, Good Game.",
            "review_score": "1"
        },
        {
            "review_text": "Mario had a fling with Prince of Persia. 9 months later, Braid.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most amazing games I've played, if you like puzzles and good plots, this is the game",
            "review_score": "1"
        },
        {
            "review_text": "My rating: 8 / 10  Braid is a thought-provoking, yet short adventure that will puzzle you to the very end.  Pros:  - Beautiful visuals. The game feels like a watercolor painting. - Pretty soundtrack that never feels stale. - Unique puzzles based on time manipulation that are a fun challenge. - Very intelligent, though purposefully ambiguous storyline. - Fun secret areas with some of the game's most difficult puzzles.  Cons: - Some puzzle elements lack explanation (which may be a plus for those who prefer it) and may add unnecessary confusion to a task. - One (optional) secret item in the game requires the player to wait nearly two hours for a simple task.  Braid is a challenging puzzler that requires out-of-the-box thinking and will keep you in a problem-solving state of mind from the title screen all the way to the inspiringly well thought out ending. This indie classic is something that all intelligent gamers should experience at least once.",
            "review_score": "1"
        },
        {
            "review_text": "A more complex game (in terms of messages within the plot) cannot be found. The levels devoted to this game are well played out and keep the player not only entertained, but questioning more about the meaning.   It truly is beatiful, entertaining, and inspiring.",
            "review_score": "1"
        },
        {
            "review_text": "Simply fantastic game! I enjoyed every minute of it, even when I found myself stuck on a level. Great story, great gameplay, it really feels as though Jonathan Blow put all of his effort into this game. In fact, when I first bought the game I could not play it due to an incompatible Graphics Card, but Jon Blow and his team got the game to work! Thank you for your help and this wonderful game.",
            "review_score": "1"
        },
        {
            "review_text": "Frustratingly fantastic time travel puzzle platformer!",
            "review_score": "1"
        },
        {
            "review_text": "Not for the feint of heart! Many hours spent smh and yelling at the TV screen with this one. Fun puzzles and really cool aspects embedded within this game. LOVE the rewind feature and the directional time lapse.",
            "review_score": "1"
        },
        {
            "review_text": "Curious, clever, fun.",
            "review_score": "1"
        },
        {
            "review_text": "Nuclear warfare has never been more adorable ",
            "review_score": "1"
        },
        {
            "review_text": "ingenious, highly rewarding to figure out puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "It probably is the game that started the mess of all these pretentious indie games being released, but it is undoubtedly a solid game. Somewhat short and easy, but entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "Just buy and play this game. It's a piece of art.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic soundtrack, puzzles and artstyle. I could not follow the storyline, however I very much enjoyed the puzzles and would recommend the game on the strength of those alone.  Buy this game. If you like brainteasers, you will not be disappointed!",
            "review_score": "1"
        },
        {
            "review_text": "Easy to learn, difficult to master and beat. A great difficulty balance with a unique concept and art style.",
            "review_score": "1"
        },
        {
            "review_text": "Puzzle and Platforming?! Hells yeah.   The puzzles are just the right amount of challenge.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those artistic games that you have to play. The story, mechanics and art style all blend seamlessly into a bizarre, but wonderful, trip down a questionable path!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game in a cool 2d style. impossible to lose, you can just go back and try again. highly recomened for those logicaly inclined.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, compelling, hard as ♥♥♥♥ and an ending that kicks you square in the balls.",
            "review_score": "1"
        },
        {
            "review_text": "Everything has been said about this game, it's a masterpiece, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I liked it. Cool game mechanics and the finale is super fun and awesome! Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Never before have I played a game so short in theory, but much longer in practice. Each world is challenging, beautiful, and the soundtrack makes the whole thing even crazier. If you have not picked Braid up yet, do it.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game that I'll remember for a long time. You should buy it. It's bordering on being perfect.  5/5",
            "review_score": "1"
        },
        {
            "review_text": "A great puzzle platformer with a great atmosphere, Braid is certainly an indie gem.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing from a puzzle game perspective, but has one of the most interesting, thought provoking endings to a game I've ever played.   9/10",
            "review_score": "1"
        },
        {
            "review_text": "Beutiful artwork and some interesting mechanics...best enjoyed in late night small doses :)",
            "review_score": "1"
        },
        {
            "review_text": "This game will consume you to the point you forget you need to eat or sleep until you finish it.. A dark and satisfying flow of creativity.",
            "review_score": "1"
        },
        {
            "review_text": "It's seems like a good game, but i found it boring,",
            "review_score": "-1"
        },
        {
            "review_text": "So far the game is beautiful, love the music and gameplay. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "What a great game. Some super challenging puzzles mixed with a great story. Loved the art style of the game as well. All in all, pure genius!",
            "review_score": "1"
        },
        {
            "review_text": "I just finally beat it and oh my god... This game was challenging but not too hard once you understand the mechanics put in place for that level.   10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Well, this is artsy. What am I supposed to do? Okay I guess I'll just go into this house. Maybe I'll just go through this door. Okay, so now I'm in the clouds. Typical. This narrative is strange. Who am I in this crazy rigmarole? Well, through another door I go. Well this is pleasant! Aw crap I'm dead. Wait. I CAN REVERSE TIME!?!?!",
            "review_score": "1"
        },
        {
            "review_text": "This game has nice, dream/painting-like graphics and interesting time manipulation puzzles. It's a bit on the short side, clocking at about 5 hours (unless you go after the secret and outrageously hard to get stars), but very well done. In the background is a philosophical and metaphorical story that sounded a bit too pretentious for my taste.  Anyway, highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "It's like playing a piece of art filled with awesome painted-style graphics and an equally awesome soundtrack to match.  The puzzles are amazingly complex yet they always make sense. I smiled at the ingenuity every time I completed one. Every level was thoroughly crafted, every time manipulation concept well-used and executed.  Easily one of the best games of all time. Bought this to give kudos to the developer, because I would really like to see more games of this caliber.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game, I love the extremely difficult puzzles (stars) and very challenging secrets and gameplay mechanics",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game with beautiful artwork and a fun and interesting core mechanic. I've played it through at least two full times, and I've enjoyed all of it. I'd recommend that you give it a shot if you like unique platformers.",
            "review_score": "1"
        },
        {
            "review_text": "An awesome platform/puzzle game. This game will mess with your brain...but in a good way. It's really cheap and worth the price. The puzzles are extreamly difficult at times but if you can beat this game without consulting any walkthroughs it is one of the most satisfying experiences there is in an indie game.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful Game! Great atmosphere and music and gameplay",
            "review_score": "1"
        },
        {
            "review_text": "One of the best combinations of platformer/puzzle games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Smart, thought-provoking and super cool :)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made",
            "review_score": "1"
        },
        {
            "review_text": "It's Braid. I mean, come on. It is the indie puzzle-platformer by which all others are judged.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best puzzle platformers to come out in recent years. Jonathan Blow has done an amazing job on Braid, and it's a game that every person should play&nbsp;— it's accessible but complex, and a great introduction to a great inde developer.",
            "review_score": "1"
        },
        {
            "review_text": "What more can be said? Sweet game, one of the indies that started it all.",
            "review_score": "1"
        },
        {
            "review_text": "It is a great game.",
            "review_score": "1"
        },
        {
            "review_text": "I don't think I've ever played a platforming game that made me think as much as this. Kudos!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, intuitive puzzle design combed with great aesthetics and a sharp narrative about the nature of ideological certainty.",
            "review_score": "1"
        },
        {
            "review_text": "This game changed my life.",
            "review_score": "1"
        },
        {
            "review_text": "this game is absolutely great",
            "review_score": "1"
        },
        {
            "review_text": "Played it when it was first released, hence the lack of game time on my Steam copy. I liked it enough to buy it again after the digital distributor I first bought it from shut down.  10/10, did buy twice.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible experience. One of my favorites of all time.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful game that blends platforming with the ability to control time, it really starts to mess with your head. If Stephen Hawking and Shigeru Miyamoto made a game together this would be their love child.",
            "review_score": "1"
        },
        {
            "review_text": "Such an interesting an fun game. Amazing visuals.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game,i used to play it when i was younger and didn't make much sense...still doesen't :)) but it's really nice and inspires you,it's soundtrack is excellent and the puzzles are really well made.Strongly recommend it.It's a masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "I truly loved playing this classic game, mind demanding puzzels and a lot of eye finger coordination!",
            "review_score": "1"
        },
        {
            "review_text": "Cool, little game with some pretty tough challenges/puzzles to complete. Also has a pretty interesting story and sweet music as well as fun gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Braid it's an indie game which uses time manipulating puzzles, with a story in the background, The story it's kinda easy to miss unless you're really really looking for it, but the game itself it's actually pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "There are so many ways to play Braid (from not thinking about the story and only play with the gamplay in mind to overthinking pretty much everything there is, or isn't exactly, in the game). I don't know which one you should choose, but what I do know is that you should play it!",
            "review_score": "1"
        },
        {
            "review_text": "Game is like viewtible joe meets Mario. Great Art and Music. Main character however is the antithesis of the above games , lonely briiliant and purposeful.  Be sure to spend time researching the games meaning after , really good value.",
            "review_score": "1"
        },
        {
            "review_text": "It is an awesome game, mechanics, graphics &amp; music all fit perfectly. But it's sometimes quite hard, and very rarely straightforward. Also, it screams hipster with every jump and run. But it is unique, without Ray Ban glasses or beard.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game - the puzzles can be maddening, but they are near-novel and certainly challenging.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful story + Time travel 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Reviewing this way late, but...  For 15 dollars and a short puzzle game I would recommend this game due to to great controls and pretty intelegent puzzle design. I love this style of game &amp; hope the devlopers do great things in the future...",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. The experience of playing this is like listening to a great song that suddenly becomes a BRILLIANT song. Feeling my way through the continual revelations of this was an awesome, unique experience. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Mario. But without that all jumping. More with Time mechanics. Actually is more like a puzzle game.  Ps.: An amazing puzzle game that, even though short with about only 4 hours of gameplay, it has an amazing art and music design, smart puzzles and a story that is more then you could imagine. Major plus because of it's ending level.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best endings of any game I've ever played!",
            "review_score": "1"
        },
        {
            "review_text": "I saw this game on Xbox Live about 7 or so years ago before posting this review. It looked interesting when I played it, and I remember always wanting to do a full playthrough. After a long time, I finally did.  This is a puzzle game, and it's a very unique one. Rather than simply going through a maze a certain way or doing things in a certain order, you reverse time and manipulate objects around you. Certain objects have certain characteristics, like some objects *only* move if you move as well, or some objects are unaffected by time reversal.  It's a pretty cool game with a pretty good storyline that's kind of a spin-off of Mario, with you chasing a princess to other castles/fortresses, etc. Maybe not worth $15 if puzzle games aren't your thing, but still worth a playthrough.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best examples of art in video games. My choice for the game that never gets old in the first Steam awards!",
            "review_score": "1"
        },
        {
            "review_text": "It's an amazing game. With beautiful story, very interesting and original gameplay - every level introduces something new, you learn how to play till the very end of the game.  I've finished it on a single breath and want more!",
            "review_score": "1"
        },
        {
            "review_text": "There's not a better puzzle game than this, the artwork, sound and storyline makes it THE complete package. Best game ever handsdown for me.",
            "review_score": "1"
        },
        {
            "review_text": "I will never not reccomend this game. The artwork is incredible, and the music compliments it perfectly.  It is like being inside an art gallery display.  This game is really set apart by the time minpulation puzzle mechanics, and unlike a lot of puzzle games these mechanics do not stack from world to world which keeps the puzzles fresh.  Most importantly is the storytelling within the game, theyre are plenty of manuscripts to read that are beatutifully written. All I can say without giving anything away is that the story is incredible.  Definitely my favourite indie game of all time. ",
            "review_score": "1"
        },
        {
            "review_text": "sorry but princess is in another castle",
            "review_score": "1"
        },
        {
            "review_text": "This has to be my favourite Indie game. Amazing soundtrack, beautiful artwork. The puzzles in this game rely on some really inventive game mechanics that change with every level but all revolve around the same theme.  Perfect game for giving your brain a work out while never being frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "Unique and very fun, the ending will get you good.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a must own! It's worth every single penny!",
            "review_score": "1"
        },
        {
            "review_text": "It was pretty cool when it first came out. Now, I think a lot more indie games have done a better job and more interesting work than this one, like Bastion. I don't think you'll really have an incentive to play it again once you beat it, but the puzzle element of moving time is neat; good work on how they implemented it.  Probably worth your time for a playthrough, but there isn't much more to this game. You'll get exactly your money's worth, and nothing more.",
            "review_score": "1"
        },
        {
            "review_text": "Very good platformer. It looks a bit like Mario, but with time based puzzles. Worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "A very unique and enjoyable game, Braid really is the best indie game I have ever played. Each world adds another twist on the already unique gameplay and keeps you interested until the end.",
            "review_score": "1"
        },
        {
            "review_text": "A truly mindbending puzzler, based on time-travel game mechanics. Think Super Mario meets Prince of Persia, done in a beautiful coloured pastel style. Braid is a game that toys with consequence and responsibility, and like all good games – it has a story that’s only there if you WANT it. 5/5 from me.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for an intense puzzle game which makes you think well after it's over, then be sure to check this out.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most beautiful games I've ever played - and not just because of the graphics",
            "review_score": "1"
        },
        {
            "review_text": "Wholeheartedly recommend. Great game, challenging, beautiful and innovative.",
            "review_score": "1"
        },
        {
            "review_text": "Very relaxing game. The puzzles may seem impossible at times but you'll solve them eventually.",
            "review_score": "1"
        },
        {
            "review_text": "Great art style, challenging puzzles and platforming gameplay. Simultaneously enjoyable and frustrating but rewarding once you finally figure it out. Overall a great game. One of my must-plays.",
            "review_score": "1"
        },
        {
            "review_text": "So many good things have been said about Braid, so let me try to point out something different. There are so many layers of goodness in the design of this game that it took me reading outside information plus a couple playthroughs to go beyond observing the readily apparent aspects and to really appreciate the purposeful choices made in the level design, story and secrets of the game. Not saying its perfect, but that it has the qualities of a great work of art.",
            "review_score": "1"
        },
        {
            "review_text": "Puzzle platformer with a very deep story about time and inner confusion",
            "review_score": "1"
        },
        {
            "review_text": "A god-damn masterpiece. I've played this thru some 12 times and it still kicks in.",
            "review_score": "1"
        },
        {
            "review_text": "The ending was... fascinating, to say the least! The puzzles and the gameplay were incredibly intricate and the music enchanting. Try it now!",
            "review_score": "1"
        },
        {
            "review_text": "[10/10] Braid is a puzzle-platformer with a great story. The puzzles are unique, combining platforming with the ability to rewind, making puzzles difficult, but not unfair. The art style is some of the best I've ever seen in a video game. Its story is something that can only be eperienced through playing it for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Simple story combined with great graphics, awesome music and tricky puzzles. Highly addictive but short playtime.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible game. I heard many incredible things about this game and it more than lived up to the hype (which is rare). Truly a gem of a game.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game.   Better yet, buy the bundle that includes this game so you can get half the games i reccomend on here for like $7.   Also the soundtrack is really good",
            "review_score": "1"
        },
        {
            "review_text": "Games that involve time travel and alteratin of time usually have a lot of potential, but what 'Braid' is showing here is simply mindblowing. You can move time back and fourth anyway you please and in every world, the challenges are getting tougher and tougher as new elements of time sensitive puzzles are introduced, keeping the gameplay exciting from start to finish. The story is told as text at the beginning of each world and slowly unfold things in front of you. It seems simple at first but only at the end, the (shocking) truth is revealed and not only that, if you manage to find the biggest secrets in the game, you can find another ending that is subject to interpretation and shows a far sinister story, taken from our real history. Gameplay, graphics and story are all very good, give the game a try!",
            "review_score": "1"
        },
        {
            "review_text": "A game with a somewhat confusing storyline and interesting puzzles. The levels are really well made and the gameplay is varied, allowing the player to rewind your actions and manipulate time to achieve incredible and really fun results.  That said, it's a game to very pacient players who really like to think. Some puzzles are incredbly complicated, specially if you want to get all the collectables (it gives you a different ending). The stars are painful to get and you don't even know that there are stars to collect to begin with unless you're really, REALLY creative (or read a walkthrough, as I did). I don't have this pacience; I had to watch videos to be able to finish it. But if you're a puzzle fan, this game definitively deserves a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty incredible experience packed into a compact game. The focus, and the reward, is how the story itself is told simultaneously by reading through pages on-screen as well as discovering time-bending gameplay mechanics. You might think 'Oh I've played with rewind features in Prince of Persia', but Braid is at its best when you as the user step back and wonder what it really means to rewind time. Are all thing turned back perfectly, giving you a second chance, or maybe somethings are outside of your control. Perhaps a mere shadow of yourself survives, or are you the shadow of a now future self? Maybe you shouldn't have tried messing with time in the first place.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Where do I start? Much unlike the name implies there is a complete lack of braids. In fact there is only one braid in the entire game! If you're looking for real hair mechanics and braid physics this is not the game. Wish that developers wouldn't be misleading. 3 hairy knees out of 5",
            "review_score": "1"
        },
        {
            "review_text": "This game is brilliant and very original. The soundtrack is great, too.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, But definitly hard I found. Slightly confusing storyline if you dont pay attention. Although the visuals, music, and pace of the game make for a very interesting and compelling story. Decently long (approx. 8hrs for me) Worth checking out!",
            "review_score": "1"
        },
        {
            "review_text": "An incredible gameplay. Full with amazing puzzles with an awesome variety, not letting you get tired of it and not too hard neither too easy to solve them, but still very interesting and catchy. The story, to me, is very complex, but somehow very interesting and catchy too. Personally, I still didn't get it, but I don't know why I'm still thinking and trying to figure it out.  As it's a puzzle game, the gameplay is very slow too, but it's level design is amazing and the art and animations and the interaction of the gameplay with them and with the sounds do a perfect ambientation.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the smartest and well-constructed games I've played, Braid is a puzzle game disguised as a platformer. And don't be fooled by the demo, as there's a lot more to the game than rewinding to avoid death. Like Portal, Braid takes just a few concepts (e.g. rewinding time, enemies immune to time manipulation) and hammers out puzzles that make the most out of only a few mechanics.   Do you suck at puzzles and get easily frustrated? No problem! Braid is designed so that you can skip over tough puzzles and come back to them later. And when you come back and solve a difficult puzzle, the feeling of accomplishment will be great.   And the rewind mechanic is guaranteed to lessen the frustration associated with platforming games. If you mistime your jump, you simply rewind the game and do it right the next time. Trust me, instead of making the game too easy, it makes the game more playable.   This game will make you feel smart. Play it!",
            "review_score": "1"
        },
        {
            "review_text": "Like drinking quicksand from an hourglass, only way more fun and infinitely more frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool game.  The artwork is very nice.  For a platformer with moving and jumping this game is actually really hard to figure out.  I kind of wish the puzzle pieces were required to move on to the next level because really getting past the levels are easy. Its getting the pieces that are hard.  I got the game on sale so If you can pick it you for a few bucks go for it.",
            "review_score": "1"
        },
        {
            "review_text": "Forgetting that I couldn't reverse time in real-life was when I realized the impact this game held for me.  Beautiful, poignant, delightful, and sometimes infuriating. If you're looking for an amazing platformer that playwith your mind, Braid is one of the best.",
            "review_score": "1"
        },
        {
            "review_text": "Cheap and funny game. Only downside... you finish the game within two-three hours.",
            "review_score": "1"
        },
        {
            "review_text": "Overrated but still quality. Music is superb, puzzles are tough and unique, but half of your time is spent actually trying to execute the pixelperfect solutions.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend Braid to people who like action puzzle games like Portal. A platformer, Braid starts with really easy jumping puzzles and then slowly adds more and more mechanics making the puzzles gradually more difficult until they are actually rather hard. The core mechanic introduced right away is the ability to rewind time, and it just gets more interesting from there. Again, if you like puzzle games, you should definitely get Braid.",
            "review_score": "1"
        },
        {
            "review_text": "It took me way too long to buy this game! I am always a little cautious about buying puzzle games, but this one turned out to be amazing. If you like complex and abstract puzzles, you will greatly enjoy this game. many of the puzzles require incredibly out-of-the-box type of thinking. The plot itself, which is often lacking in these types of games, concluded excellently. One of the most satisfying indie games I have played in a long time.   It's only downside is the rather short length. THe price is fairly acceptable, but still a little pricey for the short amount of gameplay. I waited until it was on sale, but if you aren't concerned as much about the money, it is definitely a good buy.",
            "review_score": "1"
        },
        {
            "review_text": "WHO DOESN'T WANNA WARP TIME AND SPACE?!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and interesting game it gets a recommend by me for people who like platformers with a twist, that being the time travel mechanic in this game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have ever played. Artwork, character, music and story are all amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the hardest puzzle game I have ever played. Each world is unique in what happens when you shift time. I am not going to lie, I could only get about 70% of the puzzles on my own, I had to youtube the rest because it was so difficult. If you are looking for a unique, difficult challenge, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzle game, that somewhat resembles mario's games; simple gameplay yet quite entertaining. More importantly, it can make your brain boil to solve some levels. However, the level of difficulty is adequate enough to entertain you.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is nice. The game is short, but had tons of fun with the speedrun mode.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best puzzle game - and maybe the best game - I have played in years. The aesthetic is perfect, the gameplay is superb, and if you at all enjoy puzzles you should play it. It's full of those 'aha' moments like Portal, moments you figure out you could do something you didn't know was possible before. The most elegant game I know of.",
            "review_score": "1"
        },
        {
            "review_text": "This may be the best game I've ever played. The 2D graphics are almost as beautiful as a Monet, the soundtrack is amazing and the gameplay is very challenging.  Oh yeah, the story is awesome too and open to interpretation.  BUY THIS GAME.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, tough puzzler. A good buy when on sale.",
            "review_score": "1"
        },
        {
            "review_text": "7.5/10 Nice game when you have the money to spend on it *cough*onSale*cough* The gameplay and story is what got me into it the most. Controling time to solve puzzles and finding out where the story was going to make sense was a lot of fun. The game might seem short, but I think it was the perfect amount of time for me. Whenever a game drags the story just because it can, I tend to drop it and play something else, so this game was just fine.",
            "review_score": "1"
        },
        {
            "review_text": "A truly beautiful game. Complex and yet, so easy. And the soundtrack, oh the soundtrack. Good work!",
            "review_score": "1"
        },
        {
            "review_text": "The deepest game ever made. This game make all the others games ever made looks extremely superficial. The plot is amazing (and I'm sure nobody will understand it fully, neither me, even after reading all the texts and explanations about it). I'm too astonished to rate it, and It really doesn't need to be rated, because more than a game, this is a truly piece of art.",
            "review_score": "1"
        },
        {
            "review_text": "This game will melt your brain.",
            "review_score": "1"
        },
        {
            "review_text": "The puzzles are quite well done, and there is some definite challenge in the game, but there are some problems.  I am glad I got this game on sale for only 2 bucks.  I did like it, but I beat it, and got all but the speed running acheivement in 3 hours. If I had paid the $10 that is the normal price, I would have been annoyed. For $10 I should get about 10 hours of entertainment from the game.  I only recommend getting this game if it is more than 70% off, otherwise, you just get less than you paid for.",
            "review_score": "1"
        },
        {
            "review_text": "A whole new approach to the platformer genre. Exciting, addictive, mind-blowing.",
            "review_score": "1"
        },
        {
            "review_text": "It's not just one more indie game. Visual and mechanics are just incredible.  Soundtrack is definitely beautiful. Hear it is an awesome experience. You feel motivated at the beginning and immersed in history.  The game guarantees hours of fun and challenges, and you will want more.  Amazing, deep. This is Braid.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game.",
            "review_score": "1"
        },
        {
            "review_text": "Oy,Gevalt the goy knows... ",
            "review_score": "1"
        },
        {
            "review_text": "While the time gimmicks and the puzzles are good, the best thing about the game is it's story. Not only is it poetry like, it's also very suprising and can be understood in multiple ways. Probably the best plot I've ever heard in a video game, and that's saying a lot. I recommend getting this game if you're interested in the story, if it's about the gameplay - you may or may not like it. I personally enjoyed it however I believe there are many better puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant logical 2D jumping game where you can control the time! In (probably) 4 different ways! Brutally original. Difficulty is challenging (but you can defeat it!). You should really play this game!",
            "review_score": "1"
        },
        {
            "review_text": "Have fun manipulating time in this fun, simple, little puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "An absolute must-play. Original and awesome. A 2D sidescroller of puzzles which tells a deep story along the way.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 - One-of-a-kind. A game with heart, brains... and a rewind button.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of all time. A really beautiful game, art-wise, musically, but most importantly, game-play wise. I love how the story resonates with the actual game mechanics for that section of the game. Each puzzle piece requires you to solve cool puzzle that feels really satisfying to finally solve. (You may be frustrated for a while until it clicks though). And every puzzle piece can be solved right away, no back tracking. (Except one, the last one of the first level. So stupid and yet cool at the same time.)",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, great fun, great artwork and soundtrack :) Kind of game that you can finish in a day :)",
            "review_score": "1"
        },
        {
            "review_text": "I've tried to play this game again and again. I still don't get what the fuss is about and just can't get into it.",
            "review_score": "1"
        },
        {
            "review_text": "I can completely understand why it gets 10/10s. It's completely mind blowing! I absolutely loved the story and I'm not going to give you any spoilers, but it's astonishing if you get to the last part of the game. The mechanics that change from chapter to chapter are amazing and really well done as well as being really easy to learn. The puzzles are really well done. They give you an astonishing amount of pleasure by solving them -- a true sense of accomplishment. They may be difficult, but you can do them! I can sincerly say that it's one of the best games I've ever played. If you have the money, buy it!",
            "review_score": "1"
        },
        {
            "review_text": "If Super Mario was also required to shift time at the same time. Thoughtful and hard. awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Braid is an amazing game. The art, the music, the gameplay are all near perfect. It plays like a Super Mario game, where you navigate platforms and bounce of creatures heads, but in each world a new time manipulation mechanic is introduced. It's a relatively short platformer, but it doesn't feel slight. It also contains one of my all time favorite final levels.",
            "review_score": "1"
        },
        {
            "review_text": "Regardless of if you enjoy the story, the puzzles are brainbendingly tough and incredibly rewarding. Time manipulation explored to its fullest.",
            "review_score": "1"
        },
        {
            "review_text": "Memorable story, exceptional mechanics, fitting visuals.",
            "review_score": "1"
        },
        {
            "review_text": "I must say that this game is a real piece of art, the soundtrack it's beautiful and relaxing and the mechanics are really interesting which one you have never seen on a video game before.  The Game tells you a strange love story with really cool mechanics and really challenging puzzles, you must buy it.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game with inspiring graphics",
            "review_score": "1"
        },
        {
            "review_text": "BEST PUZZLE/PLATFORM GAME!!! [9.33/10.00] - M073RF*CK3R!!!",
            "review_score": "1"
        },
        {
            "review_text": "At what point does a game stop being indie? Is indie short for 'independent,' or is it a sort of minimalistic sensibility of design and execution? Either way, Braid instantly becomes a classic puzzle platformer. The gameplay works out your brain and the story engages you and makes you want to stop playing the game to read words. And, I mean, that's gotta count for something.",
            "review_score": "1"
        },
        {
            "review_text": "Basicly mario if the fact that he ends up in the wrong castle was a metaphor for his frustration of never finding a girlfriend. The game had loads of hidden messages which you need to pay attention to to understand. Kinda depressing overall.",
            "review_score": "1"
        },
        {
            "review_text": "Cool puzzles and mechanics. Cool story, which is 95% optional seeing as it's told mostly through texts you find.",
            "review_score": "1"
        },
        {
            "review_text": "the second best game ever created",
            "review_score": "1"
        },
        {
            "review_text": "This is one beautifully unique game. Wow. A lot of love and creativity went int to this game and as a player you feel it imediately. The story, the graphics, the puzzels, the score, and the concept are all amazing. It's easy to widdle away hours and not realize it while playing this game, and there is almost a kind of eupohoric/meditative feeling about it all. Furthermore, I didn't get frustrated with the puzzles even when I couldn't figure them out, but when I did soleve them I felt so proud of myself. For the price, this is certainly something you should pick up. It's only flaw is that it feels too short. Let's hope a sequal is in the works.",
            "review_score": "1"
        },
        {
            "review_text": "It's difficult to describe braid, but in few words it's an awesome platform game. All levels are unique, the same for the gameplay. Really worth a play.",
            "review_score": "1"
        },
        {
            "review_text": "Aesthetically incredible. Gorgeous artwork , a rich soundtrack, and an intriguing yet very cryptic narrative make 'Braid' as much a work of fine art as it is a game. That is not to say, by any means, that the gameplay is sacrificed for the sake of an artsy-fartsy atmosphere. The actual playability is certainly the most compelling component, with an array of very clever time-control mechanics and puzzles. 'Braid' is a game that consumes me everytime I attempt to consume it. A masterpiece and an inspiration.",
            "review_score": "1"
        },
        {
            "review_text": "Simply mind-blowing. This game takes heavy inspiration from Super Mario Bros., yet it's entirely different.  Great artstyle, mind-boggling puzzles, beautiful soundtrack, and a thought-provoking story make this a great game.  I spent about 5 hours beating the game, but one of the game's challenges is to beat it in 45 minutes (for hardcore speedrunners).",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platforming puzzle games that i have played. Time Manipulation is fun :)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, great soundtrack, amazing imagination.",
            "review_score": "1"
        },
        {
            "review_text": "This game's a classic, using time as a game element in varying ways designed to break your mind. Often available as part of the Humble Bundle.",
            "review_score": "1"
        },
        {
            "review_text": "A great little puzzle game that makes you think, then rewards you for your effort. Nice music, visuals and overall feel.",
            "review_score": "1"
        },
        {
            "review_text": "I've heard this game is like a piece of art and I can agree with that. It's very calm, contemplative gameplay mixed with a mysterious taste of a backstory feels like a painting I can't quite grasp the meaning of.",
            "review_score": "1"
        },
        {
            "review_text": "Braid is an incredibly hyped game, and one of the few that I think really deserves it. This game was revolutionary in its time.  Braid is a basic puzzle/platformer with an interesting philosophy: instead of punishing players for making mistakes, reward them for the lessons they learn. You get a variety of time-based powers, the most basic of which is to reverse time, allowing you to undo any bad move. But, this concept is explored very creatively. In one world, time is reversed by moving left and moves forward when you move right. In another, you can slow time down, but only for certain parts of the screen.  Some of the puzzles are very hard. I remember using a walkthrough for one or two of them.  Braid's story is an interesting metaphor that is delivered very well. It starts with a Mario-esque story, but the metaphor's depth is revealed by the end. The art and music are lovely.  Absolutely worth it for $10.",
            "review_score": "1"
        },
        {
            "review_text": "It'll make your brain hurt and want to jump out through your nostrils, but thats what makes it fun!",
            "review_score": "1"
        },
        {
            "review_text": "Most poetic game I've ever played. It was featured on the Humble Indie Bundle #2. The music score is also worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, it's a decent game. It probably doesn't deserve ALL the praise it got, but I definitely appreciate the art and music. I don't really care enough to get all the puzzle pieces though.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing indie platformer with a twist. If Nintendo ever thought like this, there'd be no more competition. Sequel please.",
            "review_score": "1"
        },
        {
            "review_text": "Like Eurogamer said, 'beautiful, entertaining, and inspiring.' I can't help but agree. Have I got to say anymore? REMEMBER IT'S AN INDIE GAME.",
            "review_score": "1"
        },
        {
            "review_text": "Braid is an excellent puzzle platformer with some interesting mechanics. It is quite difficult, however, due to the mind-bending nature of the puzzles. It really takes a lot of thought to make it through the game, and even more to obtain all the collectibles. If you're up for a challenge that isn't frustrating, Braid is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "This is an absolute gem of an independent game. The puzzles and writing will really challenge you- play it!",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic puzzle game. Some of the levels take a while to just to figure out how time is being manipulated before the puzzles can even be attempted to be solved. You're gonna need to put your thinking cap on.",
            "review_score": "1"
        },
        {
            "review_text": "A truly memorable game. It won't warp your sense of reality like Portal, but it'll still leave something to carry with you like a good experience should.",
            "review_score": "1"
        },
        {
            "review_text": "PLAY THIS GAME RIGHT NOW WHY HAVEN'T YOU BOUGHT IT YET OMG",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful, deep, and intriguing game. Simple mechanics are used throughout the game to solve increasingly difficult puzzles in a gorgeous landscape, all while delivering a cryptic, and ultimately thought-provoking story. Who says a simple platforming puzzle game can't have a mind-blowing story?",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful graphics, well-designed puzzles and mechanics, interesting history. One of the best side-scrollers i ever played so far.",
            "review_score": "1"
        },
        {
            "review_text": "Braid is a terrific game with fantastic art direction, superb music, and a really heartfelt story. In an age where indy games are a dime a dozen, Braid stands out as one of the pioneers. Great platforming and puzzles that get pretty challenging into the game, you'll find yourself immersed in trying to get every puzzle piece on every level, if only to catch glimpses of the deeper meaning of the story. Definitely worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, entertaining, and inspiring... not! This game took me 63 minutes to complete, and then I realised Mario World was better. Also, where's Braid 2!? Need to know what happens after I go back in time.",
            "review_score": "-1"
        },
        {
            "review_text": "Simply an amazing game which proves gameplay is king over fancy graphics. The puzzles are fiendishly tricky but are outweighed by the rewards. To be honest the game is worth buying for the soundtrack alone.  Get it! I highly recommned it.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recomended puzzle game with novel game play mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played. Truly a gem in puzzle and platform games alike.",
            "review_score": "1"
        },
        {
            "review_text": "Very intriguing mechanic, and development of that mechanic. Also very interesting experimentation with the storytelling. Puzzles often quite difficult, but there was only one that I needed to get a hint for.",
            "review_score": "1"
        },
        {
            "review_text": "The most masterful platformer since Super Mario World. The moments of 'Ah-Ha!' discoveries are unmatched. This game will drop your jaw.",
            "review_score": "1"
        },
        {
            "review_text": "This game made me a true platform believer, but I have yet to find something that pulls me in as well as Braid did.",
            "review_score": "1"
        },
        {
            "review_text": ". ",
            "review_score": "1"
        },
        {
            "review_text": "didnt play it, but people say it is fantastic so you have my recommend    8,9/10",
            "review_score": "1"
        },
        {
            "review_text": "After completing every single thing this game has to offer I must say: Everyone should play this game, or at least attempt to grasp the concept of manipulating time. Buy this game now!",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful game with wonderful music and unique gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Not going to lie. I'm only doing this to get a badge. But it really is a great game. Short and sweet and wonderful for anyone who enjoys puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "best fun i had sidescrolling in years, real brain teasers!",
            "review_score": "1"
        },
        {
            "review_text": "Quite fun, definitely recommeding.",
            "review_score": "1"
        },
        {
            "review_text": "This is plain amazing from the music, puzziling, graphics, and time travel although it could be longer 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game- makes you think! I got it and forgot about it for the longest time. Just started it recently and it's surprisingly good!",
            "review_score": "1"
        },
        {
            "review_text": "A fun platformer with a unique time-rewind mechanic and hauntingly beautiful music and story.",
            "review_score": "1"
        },
        {
            "review_text": "A 3D game where 3rd dimension is time.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like playing with Time. I do too.  Do you like breaking the necks of tiny mushroom people. I do too. Do you like Puzzle Pieces. I don't.  4/20 - Pewdiepie",
            "review_score": "1"
        },
        {
            "review_text": "This is the perfect example of what an puzzle platformer should be. The puzzles are difficult, the mechanics are interesting, and the textures are damn pretty. This is an indie game you must get, 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, great puzzles, music, and the story...right in the feels.....",
            "review_score": "1"
        },
        {
            "review_text": "absolutely beautiful artwork and soundtrack to start with; the captivating plot comlex challenges make for a fanastic well rounded indie game with 1 designer. Better than watching a movie..",
            "review_score": "1"
        },
        {
            "review_text": "Braid is a masterfully crafted game. Any review will support that. It's only downside is its length, but despite that, still worth playing. If you missed out on this, you've missed out on one of the most thoughtful platformers ever made.",
            "review_score": "1"
        },
        {
            "review_text": "If you have this game, play it til the end, trust me. The music is good, too.",
            "review_score": "1"
        },
        {
            "review_text": "I loved all aspects of this game. 10/10. Played through it multiple times and it has a very solid storyline.",
            "review_score": "1"
        },
        {
            "review_text": "The Good: - The puzzles in this game are remarkably innovative. It is clear that a tremendous amount of condensation was put into designing each puzzle so that nothing felt superfluous or too convoluted.  - The art design can simply be described as beautiful. Beyond the sheer elegance of the art style, the aesthetic managed to brilliantly communicate the emotional subtext of the written narrative.   - The music in Braid was absolutely superb.   The Bad: - (No spoilers) my biggest gripe with Braid was the way in which the final arch of the story was told. Instead of proving context to clarify and give unambiguous meaning to the events of Tim’s journey, the story’s conclusion was muddied by more abstraction. Additionally, if popular interpretations are correct, then the intended story could have been more effectively fleshed out from the onset.   Final Verdict: To me, I relished the journey of Braid, not only due to the art design and puzzles on screen but also in my attempts to decipher the story before its conclusion. Whereas I assumed the curtain would eventually be pulled back, I was disappointed by the unnecessary ambiguity in the final act. Nonetheless, the game is still worth playing, albeit at a discounted price.    ",
            "review_score": "1"
        },
        {
            "review_text": "Flawless game, even if it only has so much. PC version has a map editor too! Supports both keyboard and gamepads like the 360 controller.",
            "review_score": "1"
        },
        {
            "review_text": "An artistic and metaphorical experience from beginning to end, Braid truly challenged me to think differently when solving puzzles, using time mechanics in ways few games ever attempt. The simple approach of control contrasted with an ever-richer storyline is a sight to behold, resulting in hours of enjoyment and satisfaction from finally solving that one ridiculous puzzle or pulling off that one seemingly impossible maneuver. Few words better describe Braid than difficult, thoughtful and rewarding.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much the most amazing indie game I've played. Very minimalist, but very arty, beautiful and diverse. Definitely give it a try...",
            "review_score": "1"
        },
        {
            "review_text": "You have to spend quite a bit of time to figure out some of these puzzles. When you should reverse time, where should you be standing when you're reversing time, how can you get this key, or how can you jump to that platform.  It's not something I can recommend to everyone, but the price tag isn't that bad and it might be worth a shot.",
            "review_score": "1"
        },
        {
            "review_text": "The first puzzle platform I ever gave a chance. To this day I do not regret it.  11/10 would not regret again.",
            "review_score": "1"
        },
        {
            "review_text": "I furtherly enjoyed Braid, and I wouldn't pass it off as just nostalgic either. The combination of platforming, time-control, and collecting works out marvelously together. The art and music are beautiful, the story is intriguing, and the levels increase in difficult at a nice pace. It's a challenging game with a mature tone.  And although it's short, it is worth every cent. This is not a decision you'll want to undo.",
            "review_score": "1"
        },
        {
            "review_text": "Braid is a brilliant game that gives you a rich, satisfying experience. The surface mechanics of the game are very similar to the old Super Mario World, but the twist that makes it fundamentally different is the ability to manipulate the flow of time either forwards or backwards, which makes for some truly ingenious puzzles. In addition to being able to move backwards and forwards through time, each of the five main worlds of Braid introduces a new element to the spacetime manipulation that keeps the puzzles fresh and intriguing. While the storyline has a distinct stream-of-consciousness style and can be hard to follow, the artwork and the soundtrack make for an aesthetically pleasing ride through the game. All in all, one of the best and most memorable games I've yet played.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game with mind bending time mechanic, a classic",
            "review_score": "1"
        },
        {
            "review_text": "Really nice temporal puzzler. But only a masochist would attempt the secret ending. Seriously, go youtube it instead.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun, if you enjoy mind melting 4 dimensional puzzles..",
            "review_score": "1"
        },
        {
            "review_text": "Get this game. Get it, go on. You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "The best girl is in the beginning/ending.",
            "review_score": "1"
        },
        {
            "review_text": "Super Hipster Mario   or   Prince(ss) of Persia",
            "review_score": "1"
        },
        {
            "review_text": "Meh. The main game mechanic is interesting at first but ultimately unsatisfying. Consequently, the puzzles didn't hold me very long. And the mediocre story and art couldn't make up for it.",
            "review_score": "-1"
        },
        {
            "review_text": "challenge more",
            "review_score": "1"
        },
        {
            "review_text": "Maybe the best 61 minutes of life. Maybe not. But still pretty awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "Buy it. It's great.",
            "review_score": "1"
        },
        {
            "review_text": "Braid is fantastic. It controls great, the music rocks, and the story is neat, and best of all the puzzles are designed well. :)",
            "review_score": "1"
        },
        {
            "review_text": "Classic puzzle platformer. Uses very original and interesting mechanics each level. Tells a engaging story at the same time. All of it, made by one guy. Absolutely a must-have.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing puzzle game, a classic. Bit lacking on the options though.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most amazing games I've played. Gorgeous music and art, and a mind-breakingly fantastic story. This is the game that got me into indie games. A must-play for anyone who likes nostalgic sidescrollers.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, but way too short.",
            "review_score": "-1"
        },
        {
            "review_text": "I played the popular puzzle games out there.....but Braid....Braid is probably THE puzzle game!",
            "review_score": "1"
        },
        {
            "review_text": "You can slow down time enough said",
            "review_score": "1"
        },
        {
            "review_text": "I used to play this when my internet went off, so there's no time record or achievements, but it was a nice time-killer.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent example of a story told through the unique video game medium.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and deep game with a very nicely executed concept and great puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a bit tricky at times. And that may be an understatement. If you like puzzle games that makes you work your brain, Braid will probably be well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "puzzles are difficult. could be a long game could be a short game depending on your ability to solve these time based puzzles. love it 9.9/10",
            "review_score": "1"
        },
        {
            "review_text": "Unique platformer/puzzle game with a nice art style, well worth the money",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful artwork, music, and story, challenging gameplay and puzzles, and an ending that really makes you think. Braid is one of the best indie titles I've played. 9.5/10 (If you want to buy the soundtrack, I would recommend getting it on iTunes rather than Steam. It's got two extra tracks.)",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Challenging puzzles are always good, plus there's hidden messages and things.",
            "review_score": "1"
        },
        {
            "review_text": "Braid is a game I've seen a lot about but heard little of in person. The game itself fools you by seeming incredibly basic for a platformer, and quickly discards that when the time aspect comes into the puzzles. I had a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Braid is going to make you frustratingly satisfied. It's a very unique and challenging puzzle game with an interesting and confusing story. A bit short but replayable, especially if you're trying to get everything and uncover the whole story. I highly recommend you to NOT read or watch anything online that spoils either the story or the puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "If you're into platformers, then this is definitely one to try out. The difference between this and most though, is that you can manipulate time in this one. If you've ever had moments before when you're like 'man I wish I could undo that move,' then you're in luck. The whole concept of the game is literally learning from your own mistakes. If you want to undo a move that landed you into an enemy or got you killed in a boss battle, you can. For some puzzles, you even need to use the time manipulation mechanic. All I can say now is to try it and see what I mean.",
            "review_score": "1"
        },
        {
            "review_text": "idk i thought it was good   7/10",
            "review_score": "1"
        },
        {
            "review_text": "The game is a metaphor for obsession.",
            "review_score": "1"
        },
        {
            "review_text": "it aight    8/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game, super ideas.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so amazing. Short, but the puzzles are difficult!",
            "review_score": "1"
        },
        {
            "review_text": "Everyone must play this game. Period. One of the best games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Cool puzzle platformer based around time manipulations, the various worlds each have their own unique time mechanics to help keep things fresh. The puzzles provide a good challenge without being overly difficult, and the art style and story blend together with the gameplay for a very nice experience.",
            "review_score": "1"
        },
        {
            "review_text": "This is the most deep and thought provoking stories I've seen in a game. Also has some great puzzles. It's like H.G. Wells meets Mario.",
            "review_score": "1"
        },
        {
            "review_text": "Enthralling music, satisfactory gameplay, superb art style, and a superb story to boot. 100%'ed this game the moment I bought it. I'd buy it again!",
            "review_score": "1"
        },
        {
            "review_text": "Some of the puzzles used mechanics that were never tutorialized, and almost REQUIRE a guide, but overall this is a great game! Very fun.",
            "review_score": "1"
        },
        {
            "review_text": "There's no denying this game's legacy, it's artistic merit, soothing soundtrack, amazing art style and innovative game design. And believe me when I say that I appreciate all those things and fully acknowledge them.   But I just didn't enjoy my time with this game. I found it to be too hard for my taste and it frustrated me more than it delighted me. I still recommend it however and I encourage everyone to at least try it.",
            "review_score": "1"
        },
        {
            "review_text": "Braid is one of the finest games I have ever experienced and an example of what game design should be,",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. Honestly, for the current price, is a steal.  Pros: + Very interesting and unique puzzles. + You can't die.  Cons:   - It's rather short. You can finish it in 7 or 10 hours. - IMO, the story is great, but the ending has something that doesn't get me.  ",
            "review_score": "1"
        },
        {
            "review_text": "Really creative gameplay with amazing music",
            "review_score": "1"
        },
        {
            "review_text": "Braid should not be missed. The whole experience is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Interactive poetry. Should be played at school.",
            "review_score": "1"
        },
        {
            "review_text": "Cool ideas are to be found in this little game. For instance it's possible (or rather mandatory) to rewind the ingame time to get to platforms (jump'n'run style) that are unreachable otherwise. However, it tends to get boring after a while, nevertheless a good buy for the money it usually costs and what it presents for that.  The graphics are very beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "beautiful,entertaining,and inspiring.",
            "review_score": "1"
        },
        {
            "review_text": "One of the games that left my mind violated in many ways. This is the game i recommend to most of my younger family, but it is good enough so older generations can play it too.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest indie titles, but many don't know about it.",
            "review_score": "1"
        },
        {
            "review_text": "i got lost in the time",
            "review_score": "1"
        },
        {
            "review_text": "You should END this game... and then search for some info about the story. Seriously.",
            "review_score": "1"
        },
        {
            "review_text": "I coulnd't imagine how hard it was to actually code it.",
            "review_score": "1"
        },
        {
            "review_text": "A fair puzzle-platformer with a beautiful presentation.",
            "review_score": "1"
        },
        {
            "review_text": "Surely one of the best indie game, even 7 years after its release. The game never repeat itself with unique gameplay for each world. The graphics and the soundtrack are very good together and both deserve well the level design. The story is always just suggested and leaves you with a few possible interpretations.",
            "review_score": "1"
        },
        {
            "review_text": "Games don't get much better than this. Beautiful, inventive and challenging. Play it!",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy puzzles, platforms and great story telling this is the game for you. this is ony of my favorite platformers of all time.",
            "review_score": "1"
        },
        {
            "review_text": "beautiful,entertaining,and inspiring.",
            "review_score": "1"
        },
        {
            "review_text": "Having first played The Witness (the other game made by Braid's creator--Jonathan Blow), I really should have expected Braid to be exactly what is was. Yet, I was very surprised to see just how similar it is in feeling to The Witness. If you have not played either game, they are both puzzle games with a main concept for solving the puzzles that is built to be more complex as the levels progress. And here's the important thing to know about either game: They're VERY difficult. I wouldn't recommend Braid to everyone, but if you want a challenging puzzle game, then Braid is an excellent choice. It is well designed and polished, and, if you can bear the difficulty, then it is very rewarding to play.",
            "review_score": "1"
        },
        {
            "review_text": "mind blowing",
            "review_score": "1"
        }
    ]
}