{
    "app_id": 268260,
    "name": "Let's Sing",
    "release_date": "2014-02-13",
    "developer": [
        "Voxler Games"
    ],
    "publisher": [
        "Plug In Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Music",
        "Casual",
        "Indie"
    ],
    "achievements": 10,
    "positive_ratings": 63,
    "negative_ratings": 65,
    "price": 12.99,
    "description": "Let’s Sing: The Karaoke for PC. Let’s Sing PC is your chance to bring out your inner-star and pose as Lady Gaga, Maroon 5, Lana Del Rey, Flo Rida, Bruno Mars, Avril Lavigne, LMFAO and many others…Pump up the volume and party in your living-room with friends and family!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/268260/header.jpg?t=1499179746",
    "minimum_requirements": "OS: Windows XP, Vista, Windows 7, Windows 8 Processor: Intel Core 2 Duo 1.8 GHz Memory: 2 GB RAM Graphics: GeForce 8600 or more DirectX: Version 9.0c Storage: 4 GB available space Additional Notes: Works with built-in, USB or mini-jack microphone(s)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is probably one of the only games I think that can stand up to a console game like Singstar. Now with all games when first released, there wil be some bugs that need to be fixed. That's understandable. So I don't mind if the game crashes once every other time we play with it. ME and my friends still enjoy singing through the songs. Some may claim it is too easy, but I think thats what you need with a game like this. So it can include everyone in the family, even the tone deaf ones.   With 40 songs to choose from and promise of DLC packs in the future. I think this is a great game for the price you are paying for. :)",
            "review_score": "1"
        },
        {
            "review_text": "I love to sing on this game. and unlike websites for Karaoke it won't just block my region one day.",
            "review_score": "1"
        },
        {
            "review_text": "very fun game with a company my assessment 8/10",
            "review_score": "1"
        },
        {
            "review_text": "not good at all even when there are no alternatives here on steam. very few songs and still no DLC or anything. do yourself a favor and play Singstar and you will see the difference.",
            "review_score": "-1"
        },
        {
            "review_text": "One sitting, all songs played and 4 or 5 stars. No multi-player just local co-op. Great afternoon of quick fun. No long lasting value. I'm guessing soon a DLC that is more expensive than the game. All in all ... Great idea. BAD Outcome. Songs arn't sinked. Just not what I had hoped. 4 /10 It's barly what it clams to be and only halfassed at that. Shame too I so wanted this to be good.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not very good. The song selection is pretty sparse.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a bad game, I loading in two difernts computers and this can´t runing. I can see that this game is a beta, a bad beta.",
            "review_score": "-1"
        },
        {
            "review_text": "This game should come with a mic. I don't have one so the game won't work! Also, need more metal songs in it.   0/10 ",
            "review_score": "-1"
        }
    ]
}