{
    "app_id": 268200,
    "name": "Antisquad",
    "release_date": "2014-05-22",
    "developer": [
        "InsGames"
    ],
    "publisher": [
        "INSGAMES LIMITED"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Turn-Based",
        "Action"
    ],
    "achievements": 178,
    "positive_ratings": 149,
    "negative_ratings": 122,
    "price": 4.99,
    "description": "Widely known in small circles as AntiSquad, they are a military tactical response unit. These hardened military professionals, tired of bureaucracy, politics and serving the armed forces, have established a private paramilitary formation located in south United States.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/268200/header.jpg?t=1447359717",
    "minimum_requirements": "OS: Windows 7 Processor: Core 2 Duo Memory: 2 GB RAM Graphics: Direct3D9 compatable DirectX: Version 9.0 Storage: 1 GB available space Sound Card: SB16 compatible",
    "recommended_requirements": "OS: Windows 7 or higher Processor: Core i5 Memory: 4 GB RAM Graphics: Direct3D9 compatable DirectX: Version 9.0 Storage: 1 GB available space Sound Card: SB16 compatible",
    "reviews": [
        {
            "review_text": "Some very nice things in this game but ONE major flaw.   The content is very small, i did finish half the campaign in like 2hours. But the game can be very long actually because if you want to finish it you need some good gear.   To reach this, you need a lot of money and when i say a lot, i think a huge amount of monney. Only one way to get it, redo and redo again the same missions. Count like 10 times each (just a guess, from how much upgrades cost in shop and how much you gain from one mission)  I cant see a cheapest way to make a game 'long'.  Anyway i gave up after 4 hours of grinding on the same exact mission again and again. It wasnt fun.  But if you think 5 euros is fair for a couple hours of original gameplay, you can try it.",
            "review_score": "-1"
        },
        {
            "review_text": "Grinding the same missions isn't very fun.",
            "review_score": "-1"
        },
        {
            "review_text": "A strategy/tactics game with nice graphics, decent story, and somewhat stereotypical characters and situations representing various countries. If you're not willing to grind out old maps for gold, then this game isn't for you because replaying maps for gold is pretty much mandatory to make later enemies easier. If you're not good at tactics games or don't like taking things slowly, this game isn't for you because there are enemies that can easily kill your characters if you aren't prepared because they have enough Action Points to move large distances and shoot many times.  Right now I'm up to the third campaign, Morning Star (if you include the first tutorial campaign).  The english in the beginning is pretty awkward and poorly translated, but it gets a lot better later on. There are still some mistakes/oddities ('Eliminate the elite forces. None of the squad should not perish.' and 'Above the rate of fire!'), but the dialogue between characters is acceptable.  After the tutorial maps, losing a map after clearing some enemies nets you ~3-10k gold, while clearing a map gives ~25-40k. The costlier upgrades cost ~27k-40k and opening the tier 2 reward boxes requires ~15k each. You will probably want to clear Normal stages first and ignore higher difficulties until you upgrade your characters enough. Since you don't get much gold, try to concentrate your gold on upgrading a couple core characters that you use (upgrading Teddy's Guard Ability to grant 2 shields is pretty useful). Buying items can save your run, but they cost a lot of gold which (in the long run) is better spent on permanent upgrades. You have to take things slowly and carefully, use Guard right before an encounter to absorb any fire they get in, and try to disable anyone you can't finish off.  ---  Edit: Beat all stages I own in the Antisquad Original on hardest difficulty and cleared all stages I own in Antisquad Tactics. All the missions I had in Tactics were tutorial-like, so you might as well play through those before playing the original game. It plays pretty much the same but everything is cheaper, characters have less upgrade tiers, and the stages are a lot easier (at least on normal difficulty). The two versions don't share anything (gold, items, etc.).  In Original, I found a small stage that gave decent gold that I could clear quickly and easily. I ground that level for gold for key upgrades until I could beat it on higher difficulty levels (it gave ~60k normal, ~130k highest difficulty). After that, levels were mostly a cakewalk. You unlock new weapons and armor to buy when you upgrade your character's stats enough to increase their rank. It can be very effective to increase damage through a better weapon and start with more armor from a better outfit.",
            "review_score": "1"
        },
        {
            "review_text": "Brutally punitive in every aspect of its design. Upgrades are too expensive, resources too hard to come by, enemy loadouts are vast. It's effectively a puzzle game where you have to guess the One Approved approach to a given fight, making the ostensible flexibility of team choice purely illusory. A shame, too, because the graphic design is lovely and the iconography clever. Recommended only for fans of puzzle games and crushing difficulty.",
            "review_score": "-1"
        },
        {
            "review_text": "Tremendously sloppy port of a mobile game that I got in some bundle a while ago. I have absolutely no patience for this because the controls are basically ♥♥♥♥ing broken (certain buttons on the interface just don't work because they're waiting for a literal finger tap instead of a mouse click). On top of that, the absolute first thing you see when the game starts is a screen showing you that you don't have any of the DLC installed and maybe you should think about buying some of the DLC because how can you possibly enjoy a game without buying its DLC before you even play the game for the first time.  I think it's a turn based squad tactics type of game like Jagged Alliance or X-Com or whatever, but I'll be damned if I'm going to struggle through controls that don't respond to my inputs. And if I was so inclined to play a turn based tactics game along the lines of those games, I'd just play those games because they actually function as intended on a PC. I'm annoyed that I even bothered to waste the bandwidth to install this garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "Pay to play port, that wasn't changed to reflect the fact that you can't actually buy coins.",
            "review_score": "-1"
        },
        {
            "review_text": "Simple, cheap and stylised. Good for a filler game when you want to just switch off. Unfortunately grindy as a side-effect of its mobile roots, and there are some language issues. Still worth the time.",
            "review_score": "1"
        },
        {
            "review_text": "-Worth Playing- -I bought it in a Steambundle!-",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! Unique customizable characters, simple gameplay, and it doesn't feel as repetitive as most tactical turn based games",
            "review_score": "1"
        },
        {
            "review_text": "Simply - NOOOOOO",
            "review_score": "-1"
        },
        {
            "review_text": "I am over 12 years old, so I really couldn't get into this.  It's basically electronic G.I.Joe action figures mixed with the plot of every action movie from the 1980s. You couldn't find anything more generic outside of a Post It Note factory.  Economy straight out of every Facebook game. Oh who are we kidding, the whole thing will probably end up copied by Zynga at some point.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        }
    ]
}