{
    "app_id": 268220,
    "name": "Meltdown",
    "release_date": "2014-06-05",
    "developer": [
        "Phenomenon Games"
    ],
    "publisher": [
        "Phenomenon Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "VR Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Arcade"
    ],
    "achievements": 28,
    "positive_ratings": 637,
    "negative_ratings": 105,
    "price": 3.49,
    "description": "Meltdown is a tactical arcade shooter featuring both singleplayer and intense online multiplayer. Become the most skilled soldier, choose your weapons, get the best upgrades, buckle up and start your mission. Be careful, each enemy has it’s own combat style, special AI and gear. Adapt to them to survive!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/268220/header.jpg?t=1476870614",
    "minimum_requirements": "OS: Windows XP Processor: 2.0 GHz Dual Core Processor Memory: 1 GB RAM Graphics: Integrated Graphics (256MB) DirectX: Version 9.0 Storage: 250 MB available space",
    "recommended_requirements": "OS: Windows 7 / Windows 8 Processor: 3.0GHz i5 Dual Core or equivalent Memory: 4 GB RAM Graphics: Nvidia GeForce GTX 650 Radeon HD 3600 (1GB) DirectX: Version 9.0 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "Meltdown is a fun, pick up and play, isometric shooter that lets you level up, buy new equipment, play with other people and upgrade. It has a lot of things going for it, great look, easy controls, great enemy diversity, randomly generated maps for each mission, drop in cooperative play and accessories that affect your stats. If you want to play alone, there is a quick setting for that, but I think it adds a lot of fun having some random stranger drop into my game. It breaks up me vs everyone. Enemies get increased stats when people enter your game, otherwise it would just be easy and robbing you of fun and challenge. There is an easy list of games to see, so you can drop in on someone else.  The controls are easy and combat is fun. A roll to dodge or move quick. A melee button that will get you more experience for close kills. Change between two different equipped guns and of course a trigger to shoot. Your character automatically aims at the nearest target, which for the most part is exactly how it should be. You can't miss.  You have a shield and health. Your shield regenerates, but your health doesn't. When you're dying, you feel it the screen gets more difficult to see as you go all woozy. There are also random objects to use for cover. If you walk up to cover and just rest without shooting, you're hidden as long as nothing flanks you. When you shoot or melee, then you're standing so enemies can shoot you. Its an easy to use mechanic that has a lot of use further in the game where the sheer amount of damage. Some cover objects can get destroyed, but they are pretty rare. There are even walls that move up and down to take away your cover. Humanoid enemies will also use cover to hide behind. To get over cover, just get up next to it and hit the roll button to vault over. Jumping over cover into an enemy can hurt them, just as they can hurt you. Its such a nice system.  As you kill enemies, you're rewarded with coins, upgrade parts, the occasional mystery box and power ups like double damage or nuke'em that hurts all active enemies. After every completed mission, you'll open all the collected mystery boxes which can contain coins, extra experience, nothing, upgrade parts or even the rare extra life. These extra lives are hard to come by. When you die on a mission, you can use an extra life, but once you're dead, you either restart the mission or quit. One and done with this game, so you need to pick where you use your extra lives to get thrown back into the action where you died.  There are 30 missions, but there is plenty to do even if you don't take on an official mission. There is a death match where you compete against other players. A quick play that generates a map just for you based on your current level and because you're special! A wave battle, where you just keep fighting wave after wave until you die. I usually get bored playing other horde modes, but this is one of the rare times where I kept having fun time and time again. What makes Meltdown interesting is that everything is randomly generated. Even if its your tenth time playing the same mission, it will always be different.  When you're not playing the game, you're upgrading. You have items and the abilities. Items unlock as you level up, but you still need to buy them. There is a selection of five guns (shotgun, flame thrower, SMG, pistol and grenade launcher) that can get upgraded with 9 improvements out of 6 slots in 3 different tiers. Once you get to the 9th or 10th upgrade it unlocks better version of the gun. So you can equip both the shotgun and its better counterpart the spread gun. There are different melee weapons to buy, but it only amounts to more damage. Then equip your four different accessories from armors, headgear, shoulder gear and face wear. Its not just cosmetic differences, but things that change combat stats. Such as a cowboy hat that improve shotgun damage. Armor that regenerates ammunition or a ninja mask that improves move speed and dodge speed. Its all up to you. All the wearable items can get upgraded too!  Every time you level up, you get an ability to use. Each of the several tiers has three different abilities to unlock. Health, melee and guns. Each slot can get upgraded 3 times before it lets you go up a tier. The abilities are subtle, but do a lot, especially the health. They make enemies have a chance to drop shield charges or health. You can get an ability that lets you regenerate health if your shields are full. I would say stick to the health, but you'll have everything maxed out by the end of 30 missions. When you do have everything maxed out, you can chose to rank up your prestige which gives you more health.... but resets your character and missions. A game this good, I enjoy that extra replay value. It also unlocks new items.  With the need to upgrade, level up and buy things, this might sound like a grind of a game. You can grind, but I never did except for the rare times that I wanted lives from mystery boxes. I didn't have to make this a job to level up.  The game feels like it has limited map assets and rarely changes its blue metallic look. As the missions progress, blue and green are thrown into the mix, but its all the same. Since everything is randomly generated, the areas get remixed and while everything all looks the same, it doesn't feel familiar outside of the boss battles. A few times there are cars here and there, parked on platforms that seem crazy to have cars, but whatever. The sad part is that you can't make the vehicles explode. The music is techno or dub step and it seems to fit the game, even if I'm not a fan of the music, its still great game music in this case.  Since the levels rarely change the look, its the enemies that stand. There is a wide array of enemies, tactics and weapons they use. It starts with simple bomb spiders that come to you and explode. Then goes up to small cannon tanks. Stationary sentries that come in a wide variety: fire, machine guns, cannons and even walking electricity sentries that can zap you through cover. Red light hover pods will shoot at you, blue ones will electrocute you exposing you up from cover.  Then come the androids. Easy wrench melee droids that run at you, machine gunners that find cover and shoot, shot gunners that won't just kill you close range, but dash to stab you, grenaders that hide and extra deadly snipers. As the missions progress, some of the robots like the machine gunners and snipers will roll to find cover. If you jump over anyone's cover they'll find cover elsewhere. The enemy intelligence is really nice and every weapon from every enemy seems effective to kill you. Grenades knock you down, electricity stuns you, melee enemies break through your cover so the others can advance closer. They all have their limitations though. Snipers fire one at a time and after a few shots need to reload. Machine gunners are slow to follow your movements, but the number of bullets will melt your health. Cannons do bigger damage, but fire much slower.  Most missions offer some unique gimmick where at some point of the map, the game locks you in an area and forces you to defeat either a giant pink boss version of a normal enemy, a unique boss, a wall or a simple wave battle. The wave battles are the easiest. The unique bosses are pretty difficult and you can tell, because they're the levels that everyone joins you to play. The walls are far more difficult. There are 3 plungers that regenerate their health, 1 wall and 3 sections of force field. Damage the plunger will remove a section of wall for you to take out the sentries behind the section. Why is it difficult? Because you're always aimed at the nearest target. So even if you want to shoot the two machine gun sentries about to annihilate you, your character turns to take out a different plunger.  With all this said, I highly recommend this cheap game. Even if the scenery doesn't change much, the combat is excellent.ThanksRybcka!",
            "review_score": "1"
        },
        {
            "review_text": "Since I'm one (broken) achievement shy of completing this game, I figured that I might as well review it.  This is an isometric shooter. It is composed of thirty stages along with wave-attack, level-attack, and deathmatch modes. You blast robots with a variety of unlockable and upgradeable weapons, and level up to acquire numerous abilities. This game supports up to four players locally or online.  Well..that was an exciting +1 to my review count wasn't it?  What? Not good enough? Sheesh. Alright then.  Meltdown is the kinda game you play, when you want to free your mind of pesky questions such as: 'What should I wear to work tomorrow?' and 'Should I go to work tomorrow?' and even 'Will I get fired because I didn't show up for work today?' It's addictive, and there are enough hooks in place to keep you on the hamster wheel for quite awhile.   The enemy robots are decently varied, and it's important to adopt a play-style that suits your loadout. Sure you could commando your way through everything with rockets and grenades, but extended fire-fights will require that you take cover. Expect to do a lot of rolling as well. Equipment introduces other variables such as bonuses to specific weapons, better shields/HP, or speedier movement. It's not totally in-depth, but that's probably why I appreciate it. You get an idea of what works and what doesn't immediately.  The stages are standard fare, with a few boss-fights, arenas, and shielded walls to mix things up. It's a bit on the padded side, but they go by pretty quickly. It can get frustrating sometimes with cheap enemy spawns. There have been more than a couple occasions, where two shotgun-bots spawned next to me and immediately fired. Also the last couple stages are a slog, because of all the freakin' snipers. That could be on me though for using underpowered weapons.   Everything is better with a partner and this game is no different. It's rare to see online co-op so well-implemented. It's almost as good as if you were playing an arcade machine and somebody walked up next to you to join in. Joining an online game is very fast and smooth, and connection drops are fairly rare (even with my overpriced crapfest Roadrunner internet). Admittedly, most of my co-op time was spent in wave-attack (easiest to grind for exp/money/upgrade-chips). Running the regular stages with partners tends to make them a bit too easy. There is damage-scaling depending on how many people are playing, but it's not nearly enough due to the overwhelming weapons, knockdown effects that keep robots inactive, and so on. Plus, even if you die you can just use a 1up to get right back in the fight(unlike arcade games, these aren't rare at all).  So there it is, a more fleshed-out review of the perfectly serviceable Meltdown. Play it until you unlock everything, play it until you get bored, but give it a shot. I think it's decent enough, even if it's a bit too safe.  For a potential sequel I'd suggest:  -Higher enemy counts (especially in co-op) -More varied builds (Classes? Maybe hand out some unique abilities) -Limit the number of available lives -Better stage variety (Plenty of classic arcade shooters to pull ideas from)",
            "review_score": "1"
        },
        {
            "review_text": "I had never heard of this game before getting it, so it came as some surprise to find just how fun a shooter it is. The game is fairly straightforward in an arcade fashion, and as such is pretty repetitive. However, I've found the best part of the game is the 'wave mission' where you get enemies in waves and see how long you can last (though 1ups feel a bit like cheating in that spirit). I feel this probably works best in a quick pick-up game fashion. So far the two biggest gripes I have are on standard missions you can get unfair mechanics such as a sniper spawning in front of you and a rocket launcher behind you so you're pretty much dead, and that the game seems to freeze and stop responding when I try to quit to desktop.  So, if you're looking for a simple, fun shooter I would recommend the game. Depth and story are not present, so if you need those this isn't your game.",
            "review_score": "1"
        },
        {
            "review_text": "Small and simple maps is the only downside to this awesome game. Lots of guns, armors, skills to enhance. Brings back fond memories of the games Expendable and Alien Swarm.",
            "review_score": "1"
        },
        {
            "review_text": "This game has potential but its gameplay is decent at best. My biggest issue with the game is:  -Too much grinding involve  -The levels start to feel repetitive, same enemies and environment  -Using the covering system doesn't really help or go well with the pace of the game  I still recommend it but only if theres a discount for it.",
            "review_score": "1"
        },
        {
            "review_text": "You know by the pictures if you want to play it an it deliver on what you see",
            "review_score": "1"
        },
        {
            "review_text": "Very good Arcade-Style shooter with simple, easy-to-learn gameplay, an amazing soundtrack, and a complex item system. This game is extremely entertaining and I recommend it as one of the best of its genre.",
            "review_score": "1"
        },
        {
            "review_text": "Gotta say. Its the best $2.00 ive ever spent. It is worth more than what i payed. honestly it is a fantastic game. It has loads of room for improvment to come for sure!   It is a great patrty/ co-op game as well.   my only gripe is the later helmets interfear with wearing accesories. Would like something around this to be fixed.   But from the selection of early acess games. This is by far the best.     Completed the game With sometimes Co-op sometimes single player. Max presteige Lvl 55 acheived everything but two acheivments.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun casual action game.  Pros:   The multiplayer co-op works well, people can jump in and leave during your missions seamlessly (as can you).   Despite the repetitive missions, the game stays fun for a quick game now and then.   After you've leveled up fully, you can reset to level 1 but with additional perks.   Varied guns and levels, lots of upgrading.   Cons:   The level design is fairly boring   There are a number of bugs that can get annoying from time to time   Upgrade/lives system doesn't make much sense. Presumably a remnant from the mobile design   Unimaginative achievements     ",
            "review_score": "1"
        },
        {
            "review_text": "Ok. Let's talk about Meltdown. First thing: this is a grinding game done right! It is my new favorite 'pew-pew-pew' type of game. More of an arena shoot 'em up type of game than plot driven shooter. I won't be talking about variety of enemies and gear - you REALLY should check them yourself. All items in game give some bonuses. No cosmetics. The most fun thing in game is the upgrade section. You got limited upgrade slots for each weapon. And this means... You can customize each gun just the way YOU want to use it. Want a short ranged heavy machine gun that pierces enemies? Sure, why not? Want a ranged flamethrower that ignites bots from afar rather than a classic variant? Take one, please. The char skill system is neat too. You will spend hours of shooting things with joy and anger to collect everything. Also, the music. Cheers!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing indie action game , it's coop , cheap and the amount of fun is amazing !   The only things i don't like is the fact that you level up really too fast and the environments are always the same, i wish you could have like a forest or city environments for exemple , oh and the fact that when you join a game and it finish the server end up automaticely so you have to wait another game to show up.   The optimization is really good for a port of a mobile game ( yes the game was on smartphone before) you can play with a old computer without problem , exemple i run the game with my laptop in 'high' settings 60 fps all the way",
            "review_score": "1"
        },
        {
            "review_text": "Very nice music, pleasant graphics, fun twin-stick shooter gameplay.   Clear levels, use level up points to upgrade your skill, money to purchase equipment, chips and money to upgrade equipment. There's a Quick Play mode for random levels (populated with enemies the game decides are suitable to your character level), and an endless wave Survival mode which you need to level up enough to unlock.   Once you get to max level 55 you can enter the newgame+ish Prestiege mode - you lose all your equipment, levels and map progression in exchange for some minor health and shield boost, access to restricted equipment (which you still need to meet level requirements for buying), and 'leveled up' enemies. You keep your current money &amp; chips though, so it might make sense to grind a bit to give your level 1 Prestiege character a head start :)  Because there's never enough money to buy what you want....  Anyway, that's about it. There's really not much depth to this game, just some quick fun robot shooting action.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Cool soundtrack! Just needs MORE CONTENT and this game would be perfect! As is 7/10 , with more content id score this 8.5/10!",
            "review_score": "1"
        },
        {
            "review_text": "It's engaging and fun. A good way to let off some steam.",
            "review_score": "1"
        },
        {
            "review_text": "Over all this game is an enjoyable run &amp; gun, but there's not a lot to it. It's VERY grindy. There is a lot of cool equipment to unlock. The visuals are pretty. The audio is well done. All of the achievements now work. The multiplayer is not amazing, but functional. The boss battles are frustrating, but fun. The problem again is it's a grind-fest once you find a stage that will just keep spawning enemies. There is not much incentive to move on.  I enjoyed my time with this game &amp; for that reason I recommend it. It's not a great game, but it's fun for a while.",
            "review_score": "1"
        },
        {
            "review_text": "for a small game this game has a lot to offer grab a friend and start melting robots faces off lol",
            "review_score": "1"
        },
        {
            "review_text": "Works very good on the DK2. Very fun arcade shooter. Definitely worth the couple of dollars.",
            "review_score": "1"
        },
        {
            "review_text": "It's time to shoot robots!  So let's bring our   Irreverend Opinions   as we hunt them through  Meltdown .   ---    The Blurb",
            "review_score": "1"
        },
        {
            "review_text": "Good game, love the look, style and gameplay but it has some small issues.   Economy can be abit harsh, equip cash drop, box drop and play online with others (think everyones % increase stacks) and you should be ok, if you're planning to prestige save as much cash and chips to carry over.  Starts by trying to sell itself as a cover shooter in the tutorial but is no such thing its a random level jobby so sometimes it's incredibly easy but mostly the worst mapping you can imagine. Enemies spawn out of thin air so alot of insta death for no apparent reason as enemies spawn in weird combos, like multiple sucide explosion enemies spawning right next to you.",
            "review_score": "1"
        },
        {
            "review_text": "Just want a quick game? A quick round of tactics and run&amp;gun? Well this game is worth it, but I got it for around 3$.  Pretty much worth the 3$! It's fun, but it's not a 'Full' game, it's an arcade game like pacman. Where the story doesn't matter, but the gameplay does! Some money laying around? Let this game be 'that' treat.",
            "review_score": "1"
        },
        {
            "review_text": "Meltdown is a great little action game that is best played with friends. It's probably the best choice for playing cross-platform with friends who are on mobile devices (it's free on android). A downside though is that as you level up and unlock /upgrade items, you can become many times more powerful than a brand new player, which makes it hard to keep up with friends at times.",
            "review_score": "1"
        },
        {
            "review_text": "Good game but i have not played it for that long and i have already done pretty much everything",
            "review_score": "1"
        },
        {
            "review_text": "Cheap and fun game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a nice compromise for me with most of the features I would want in a game like this. It has genuinely fun gameplay, nice graphics, and even basic multiplayer.  Where it wins: The short missions make it perfect when I'm just killing some time. I can pick a mission based on anticipated time to complete if I have something I need to do soon. It's also nice to see that the Steam version is a complete game, unlike the mobile version. The gamepad setup is nice, and the aim assist makes it easy to work with. Multiplayer is fun to play as well. Well worth the $1.74 I paid when it was on sale.  Where it fails: It is made for mobile and there are some nonfunctional remnants left over from that, namely the leaderboard buttons. The multiplayer doesn't let a set or group of players to follow eachother through missions. It also said that if you are having trouble on a level, play multiplayer to make it easier, but when additional players are in a mission, there are more bots that can take much more damage, making it more than twice as difficult, so it more than negates the concept of getting help. The aim assist, while being handy, can also hinder your play. It automatically targets things for you. When there are power nodes, it's difficult to get back on target with bots, or the bots you actually want to target.  Overall, it's worth playing, if you catch it while it's on sale, but I sure hope the devs are planning on making some improvements, especially with the aim assist, multiplayer, and benifits of being Prestige 3 Level 55. I'd also kind of like to see a good way to reset the data to restart from scratch.",
            "review_score": "1"
        },
        {
            "review_text": "I feel like this game isn't well known. If it was, it would be a hell of a lot more popular. It's a great way to pass the time.",
            "review_score": "1"
        },
        {
            "review_text": "Rarely write reviews but this game really struck me as worth the time. Totally easy to jump in and out of multiplayer, Lots of different builds and ways to play.  If this game had a larger pickup radius, more varied enemy and terrain types, and more character customization (think colors and no silly headband) I think it would be the best game ever.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game, it is so arcadey and addictive. I can't say anything different than wow and buy this game if you like arcade shooters that you can play in short burst. The only cons I maybe can think of are:  - that you sometimes feel a little overwhelmed  - and that it sometimes takes a little while to be able to buy a upgrade (a little too long)  but those are (in my opinion) only minor cons.  P.S. Sorry if my English isn't the best, it is not my native language (i'm from The Netherlands).",
            "review_score": "1"
        },
        {
            "review_text": "Rarely write reviews but this game really struck me as worth the time. Totally easy to jump in and out of multiplayer, Lots of different builds and ways to play.  If this game had a larger pickup radius, more varied enemy and terrain types, and more character customization (think colors and no silly headband) I think it would be the best game ever.",
            "review_score": "1"
        },
        {
            "review_text": "Good game but i have not played it for that long and i have already done pretty much everything",
            "review_score": "1"
        },
        {
            "review_text": "Fun story- I won a raffle for Escape Goat 2 on a Twitch stream, but the key was accidentally pasted into chat and claimed by someone else. I brought it up (in private) with the caster, and was sent a key for Meltdown, instead... this one time, I'm actually rather grateful for the internet being the internet. :P  I'd never heard of this game, so I had very little in the way of expectations going in. And I have to say, I've had way more fun than I was expecting.  The progression kinda feels like the free Flash games I played several years ago. There's a sense of grinding for the necessary coins or chips to purchase or upgrade the things you want. But- unlike those old Flash games- the music and general sense of fun keep the grind from feeling too much like a chore.  I've yet to try the multiplayer, so I cannot attest to connectivity or lag issues. But I still give Meltdown a solid recommendation even as a casual single-player game. :3  Pros: - Music is wubby (a con, if that's not to your taste) - Cover mechanic adds a bit of strategy - Weapons feel nice (I've only unlocked a few... more on that in cons)  Cons: - Music may not be everyone's cuppa tea - Gear Progression can sometimes feel a bit grindy... - Especially when it comes to initially unlocking weapons/accessories, as they require increasingly larger amounts of coin (Multiplayer would likely help in this case, but as stated previously, I've only played solo thus far.)",
            "review_score": "1"
        },
        {
            "review_text": "Cheap and fun game.",
            "review_score": "1"
        },
        {
            "review_text": "A remarkably cute-looking time sink. Upgrades feel a bit grindy at times since you unlock items faster than you get money to actually buy them but since you can replay previous levels again to get some cash that's fine.  The tactical part really isn't as big as claimed, however for some enemy types it's indeed helpful to cover and get the timing right (Sniper Bot!). For most other moving enemies a combo of circling and retreat seems to be just enough.  The multiplayer system is quite nice and even enabled by default so any singleplayer mission may become a multiplayer mission at any time.",
            "review_score": "1"
        },
        {
            "review_text": "Pure action game with no story. Just run around through the similar levels blasting away at all the robot henchmen you see. All the weapons and armor are upgradeable, and there is a limited prestige system to increase your character slightly if you reset a couple of times at max level.  There are 3 main boss levels that are different, and a few miniboss levels in small arenas. The music is great, but the levels look almost all the same.  You get to play a rambo-like character in an arcade game setting. On each mission, your weapons and armor can be customized to your playstyle (SMG, Shotgun, Rocket, Melee, Xbow). All the ranged weapons and armors are upgradeable 3 times , and have distinct graphic appearance.  Reccomend getting the 4-pack and playing with friends for a cheap fun time.  The developer is active, and adds new features and fixes bugs.",
            "review_score": "1"
        },
        {
            "review_text": "I love this arcade style, fast paced little game. Good upgrade abilites and options for 'end game' play. I always return to this game if I have little time to play. :-) Recommend it, if you like arcade stile sci-fi games!",
            "review_score": "1"
        },
        {
            "review_text": "Game looked really cool at first, but has the same level and different enemy spawns, got bored within 30 minutes. If only it had fresh new levels it'd be amazing.",
            "review_score": "-1"
        },
        {
            "review_text": "'Meltdown' is what you get from playing this game.   Pros:   It looks nice the first hour you play it.  Wave mode is sometimes fun.   Cons:   Upgrade and level system in general. I mean, what is the point of upgrading your weapons and completing missions just to have it all reset when you prestige? I can understand resetting the skill tree (that's the point of prestige), but this is just blatant padding. Besides, what do you get from prestige? A whopping +5 health and +5 shield and the ability to upgrade your weapons one level higher! Oh, and a golden nickname of course, because everybody wants to be special! And you have to do it three effing times, btw.  Enemies. They lack in variety and some of them are just a pain in the аss, like the bot that will chase you down and if you ever stop mashing the spacebar or run into something, you get immobilized, and then the other bots come and rip you into shreds.  Game mechanics. I get that only humans can trigger the mines, but why explosions don't affect the bots? Your grenade launcher damages them and the mines don't. Also the bot that throws literally the same grenades at you and nobody takes damage (except you, that is).  Oh, and about mashing the spacebar. If you don't care about drops, you can complete some of the levels just by infinitely dodging the enemies straight to the end.  Overall, don't bother buying it if you don't have a group of friends that can play with you and contain your frustration.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is a mobile port, and it shows.  If the developers took the time to redo the menus and add industry standard systems, like chat etc, it would work out better. But it doesn't cut it. Not even for a buck.",
            "review_score": "-1"
        },
        {
            "review_text": "Why exactly is it so hard to find a friend in multiplayer? Devs please do something this is runining the whole freakin game",
            "review_score": "-1"
        },
        {
            "review_text": "Booooring. It becomes a grindfest fast. There is not actual customization. Yeah you get a choice on where to spend talent points, but eventually you're getting all of them anyway, so what's the point?",
            "review_score": "-1"
        },
        {
            "review_text": "This is yet another VR game that has zero Vive support. That's okay actually, I'm not a big fan of this one and my loss of $7 is no big deal.",
            "review_score": "-1"
        },
        {
            "review_text": "It's perfectly functional, but the all-too-red and also weird looking graphics and the way the game controls are not too good. Gameplay itself is a little bit of shooting and slashing, buying weapons and armor - nothing new to be found here. If this isn't in a bundle I can't possibly recommend it. Otherwise, if you want something mind-numbing and it's available for particularly cheap you can waste 30 minutes on this.",
            "review_score": "-1"
        }
    ]
}