{
    "app_id": 268420,
    "name": "Aura Kingdom",
    "release_date": "2014-07-01",
    "developer": [
        "X-Legend"
    ],
    "publisher": [
        "Aeria Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "MMO",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Anime",
        "Free to Play",
        "MMORPG"
    ],
    "achievements": 0,
    "positive_ratings": 5666,
    "negative_ratings": 1533,
    "price": 0.0,
    "description": "Aura Kingdom is a free-to-play Anime MMORPG featuring strong PVE elements, a uniquely detailed world, and an engaging, well-crafted story. Aura Kingdom empowers players as Envoys of Gaia, gifted individuals that take the role of one of the thirteen classes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/268420/header.jpg?t=1448470594",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7 (32bit/64bit), Windows 8 Processor: Intel Pentium4 2.8 GHz or better; AMD K8 2600 or better Memory: 4 GB RAM Graphics: nVidia GeForce 6600 or better; ATI Redeon X1600 or better DirectX: Version 9.0c Storage: 6 GB available space",
    "recommended_requirements": "OS: Windows XP, Windows Vista, Windows 7 (32bit/64bit), Windows 8 Processor: Intel Core2 Duo 2.66 GHz or equivalent; AMD Athlon 64 X2 6000 or equivalent Memory: 4 GB RAM Graphics: nVidia GeForce 9500 or equivalent; ATI Radeon HD2600 or equivalent DirectX: Version 9.0c Storage: 6 GB available space",
    "reviews": [
        {
            "review_text": "super easy MMO that lets you become the loli princess of your dreams",
            "review_score": "1"
        },
        {
            "review_text": "Best anime &amp; free MMORPG everything is just perfect about this game but there is a problem currently there are lots of bots called the Red Army going around doing quest why nobody knows (Red Army might have been fixed)  9/10 SAO fans will love it!",
            "review_score": "1"
        },
        {
            "review_text": "only played for a couple hours but is a good game",
            "review_score": "1"
        },
        {
            "review_text": "Cute anime girls = life.",
            "review_score": "1"
        },
        {
            "review_text": "I've played tis game since beta through the aeria ignite.  so my steam game record time isn't much Server Hydra, Now Phoenix.  Be warned, tis game is extremely laggy even if you have a godly spec pc the game itself is broken, everyday on the 5am daily ranking update ( also the centurion sched ) there will be a massive server delay that will last from 3 - 15 minutes and another warning is for the random account banning that aeria does originally intended for bots but now they just ban anyone with no reason.  The game was good before the invasion of bot army started,  now 6 out of 10 people you would meet in game are basically bots,  added to that whatever's left of the original community are a bunch of elitist that won't accept under leveled newbies in high lvl dungeon runs ( lvl 70+ dungeon raids ) and people nowadays are mostly leeches that asks to be carried ( though if you plan to invest a lot of effort in the game and be able to overpower dungeons, people will instead flock to you like little maggots pretending to be friends ^o^ )  In terms of PVP forget it, if you're a newbie just starting out and has gotten curious about it chances are the moment you enter arena you will be used as a farming mob by veteran players who will tab away from fully geared players ( especially cancer types ) and will continually aim for undergeared low level enemies. 95% of arena fanatics are like that and the remaining 5% are those who are truely skilled in making build ups and are always noted as quit on sight. ( Quit the match they will eat you alive )   Well, If you do however manage to find a nice welcoming guild with senpai's who are willing to help you out, you will find that this game is really wonderful to play, the anime style graphics that allows you to peek at your own toons pantsu... oops i mean the fast pace style of the game will surely keep you coming back for more, despite that some people had stated that the repetitive grinding is one of the biggest turn down, i would like to differ by saying as a warbow i loved the way on how i was able to kite so many mobs, running while shooting them with movement speed of 200 same could be said in playing wizards and gunslingers. i love kiting.  Overall despite a bot army and terrible human community plus insane server lag, i would still recommend Aura Kingdom  ( purely because of the loli's and waifu's ) for it has a fun and fulfilling style of gameplay.  Hey, it's free so why not try it out. I'd still give it a 6 out of 10 score. 6 / 10  P.S i hate fishing , digging , cooking",
            "review_score": "1"
        },
        {
            "review_text": "Died 20 times trying to get out of the first town 10/10 would get poisoned again",
            "review_score": "1"
        },
        {
            "review_text": "AnimeMMORPG. 11/10 would definitely bang again.",
            "review_score": "1"
        },
        {
            "review_text": "The game is awsome so far as I have played.to me it's something to play when you dnt have anything to play then you will fully enjoy the game",
            "review_score": "1"
        },
        {
            "review_text": "I've only been playing this game for a small time now, but from the moment I actually got into the game I noticed a few things that I want to note about this game. Of course this is a limited view as of right now, and I'll probably right more on this game in the future, but there are just things from a new player that I'd like to discuss that are appealing and absolutely not.  1. CAMERA DIRECTION. The camera is fixed, and not on the direction that your character is running, which is common in practically 99% of RPG games you and I could probably think of off the top of our heads. You have to hold down the right mouse button and manually steer around where your view is. This can be considered an infuriating experience at first. It also completely ruins the flow of the game, adventure, and just kinda sticks it more into your head that this is a program instead of your own cool anime adventure.   Even when it feels like I've gotten used to it, I end up in situations where this absolute design flaw sticks out like a sore thumb.  2. QUESTS OBJECTIVE TRACKING. While we're on the topic of that feeling of adventure that a lot of people would consider crucial for an RPG, myself included, the game has a function that can completely destroy the sense of adventure and exploration in quests. How? Well I'll start off by saying that any good RPG has a way to track the general destination or area that you have to go to for your quest, through just a little symbol that appears on the map or a symbol that appears generally on the top of the screen that points you where to go (note: in some games this can be executed poorly, however there are also games that can do this while still giving a lot of sense of adventure, Skyrim is a good example).   This game, however, has a pop-up screen that displays the goals of the quest, and if you click on the sentences of these obective (e.g you have to kill 5 of a certain enemy), the game will not only lay out a sparkly trail on the ground that not only leads to your goal, but also automatically starts taking you there. If you needed to find people that you can tell are supposed to be hard to find, you can just click this and you'll just be taken to them. More hidden resources that needed to be found? No worry, you'll be taken to it instantly.   For some, this is quite the positive, since a lot of people would find having to always look for the quest's objectives manually each time tedious and tiring; and it's a completely optional too. Honestly it's a pretty convenient function for people that just wanna blast through to get to the higher levels.   Although the bad thing I'll have to say about it is that the icon on the mini-map in the top right-hand of the screen the icons were absolutely confusing. There is a lot going on, and the icon that displays the direction of the quest does not stand out as much as the other symbols. The good thing is, however, that if you go into the regional map there is a list of icons on the side that not only tell you what each is for, but also has an option to not display them! Very handy.   I'd say these functions are honestly up to interpretation for whether they're good or bad. Personally, I find that it's very hard and not as clear as other RPG games in the showing of a more general direction and in frustration, can push you more to the option of just letting the game take you everywhere. I'm all about immersion and for me, even having that option takes away from the potential of the experience of adventure.   3. THE DESIGNS AND ITEMS. My god, everything is cool in this game. As an artist, aesthetics and the way colours and design catch the eye are very important to me for just about everything; especially in anything that's definitely more visual-based like games. But I've caught myself thinking quite a few times that it's overwhelming in this game, and even a bit 'too cool'.   Generally when we start to play a new fantasy MMORPG we start off with these kinda mediocre and mundane gear. In some you can see how it's kinda cool, but it's definitely not awe-inspiring. Especially compared to high-level players that you see running around mounted on something crazy like a lion with a fire mane, and gear on them that is radiating with some awesome aura, with wings coming out the ♥♥♥♥♥♥♥ back. We look to these players and start to idolize them in a sense for looking so rad. And when you start to reach up closer to the top, and start to collect your own cooler items, you definitely start to get a sense of pride and accomplishment in the hard work you've put into developing your character so much, especially if you paid money for it.   This game off the bat gives you awesome items. For exmaple I choose the Scythe class for my first character, at a very early level I can summon not one, but THREE beautifully designed demons to accompany me; and the choice is out of six demons in total. Even if you didn't choose the Scythe class, under level 10 you are given a mount, which personally I've never witnessed in a fantasy MMORPG before.  And to top it all off, the game itself is actually based around the lore of it's world that there are these people chosen by destiny, that are given little creature companions (which is a very stereotypical thing to see in anime) that help you fight with their special abilities. While in character creation you get to choose out of four which one you want.   This trait in the game is also really up to interpretation just like the last one, too. On one hand, it's very rad that we all can have so many magnificent items, and can just look so fine. But on the other hand, it personally gives me less of an urgent want to progress fastly to be able to look good since I already am satisfied with my gear. Also on the more negative side, town centers were lots of players congregate can look completely ridiculous; like a hub for really over the top, overpowered original characters from deviantArt. And despite actually loving all the designs in this game, I still feel more neutral about it all.   4. LAG. The bane of all gamers out there, the insufferable force which destroys the natural flow and order in your gaming session - yes, ladies, gentlemen, and honoured guests - this game has so, so much lag. I don't believe I have to go into such extensive detail for this section, but it's so much that it DOES need to be noted. It's not so bad that it crashes my game or makes me lag for more then 10 seconds, but I do have a good laptop and internet.   Why so much lag though? Honestly, blame the dirty weabs. All there for the designs, I swear.   5. POP-UP CONVERSATION SCENES. In this game when you talk to anyone that isn't a background character a pop-up screen with your character's and the npc's top half of the body show up. Dialogue, actions each character makes shown in text, intervention from not only your first mount, but also your little companion that's always given to you... it's all just like a visual novel. And it's very appealing, and even refreshing and unique to see in a fantasy MMORGP.   It wouldn't be too much of a stretch that they put this in to appeal to those that are loyal anime fans, seeing as a lot of very popular games in Japan have these kinds of cut scenes that are very iconic in visual novels. They even give your character very over-exaggerated reactions that intergrate into the 'weaboo sub-popculture'.   I can imagine some people would find this cringe-worthy, but I doubt anyone that would see it like that would be interested in a blantantly obvious anime-inspired game in the first place.   6. CLASSES. I was going to write about this extensively, but I ran out of space, so here's the basics. There are a wide range of classes, up to 13 classes in total.   I'd recommend this game since most features that I see as note-worthy are more postive or up to interpretation, and therefore, worth giving a go and seeing if it's for yourself!",
            "review_score": "1"
        },
        {
            "review_text": "I'm in it for the fishing. C: Oh and the characters are adorable.",
            "review_score": "1"
        },
        {
            "review_text": "Man this has to be the best anime MMO i ever played. Its not like tradicional anime MMO were the worlds you visit have an anime themed but it looks more like a normal game , no cartoonish feel. But with this every city i go have... hmm cant describe it.. but it feels like im in an anime series (no joke). About the combat system , i found only one problem and its that since there is no ''power'' or ''mana'' for your skills u can spam like 10 in 5seconds and that for PvP its abit too much. Overhaul if u like anime MMOs u should really play this one.",
            "review_score": "1"
        },
        {
            "review_text": "I was in Aura Kingdom from 1st CBT. And I'm still there. People who will write the game is 'boring' are the ones that most of the times leaves the game because the boss 1 hit them in dungeons. So let's start with   PROS:  - Cute to the core ( And by that...I mean it, the official screenshot shows only like 10% of game cuteness) - PANTSU! ( Yes that also goes in pros &gt;:) ALOT of pantsu in this game!) - Huge world with loads of zones and beautiful landscape you never seen in any mmorpg before - Music... soundtracks are pretty into the feeling of the world and dungeons - ALIVE game world ( This is not a game where you will see few players running around and all NPC's are standing in place. Game world is really alive, Npc's are walking around, talking to each others and doing stuff) - Rich playerbase, there are loads of players there in this game. Wherever you are, there will be someone near you most of the times - Really much to do: Main storyline quests (to the lvl 60 atm but they will exceed it soon), loads of sidequests that gives achivements, daily quests, Dungeons you can play Solo, in party or hell mode that is kinda hardcore, after lvl 60 you can register and enter Sky Tower (100 floors? dungeon) on weekends and do Otherworld dungeons in what you can find really rare and expensive gears or items - Eidolons... Pets that will heal you, deal damage and bring you stuff if you link them. There is ALOT of them to collect. Catch them all! :D - Blacksmiting and Alchemy, one word, Crafting - Paragon Table, like lootery with rich prizes - FREE 2 PLAY! And it is! Whoever will tell you game is P2W or P2P is an noob. You can basicaly get ANYTHING for ingame currency or for Loyalty Points. Loyalty points shop is like Item Mall (Item mall is for Cash only), but you get Loyalty points in game while doing sidequests and stuff... - Players can set up Stalls ( It's like players market stuff) and sell their loot that way, or they can deposit items in Auction - Level capacity is 75 and leveling becomes intense after lvl 50 ( I was thinking should i put this on Pros or Cons.. And i decided to put it in pros since when you reach max lvl... Well you should discover yourself why) - Rich character progression, Evony path, stats lvls, masteries and more - For paying players thwere is Tiered spender with rare and most expensive rewards - Guild levels, guilds have their own cities (guild halls) where their guild members can meet up. Guild system is made way better than in other mmo's - Costumes and acessories gives you stats boosts - You can recolor your custom costumes with loads of colors - Nice character customization So... thoose are PROS, I might have more of them but I can't remember all of them :D And now on  CONS:  - Bots... Oh yes~ The game is populated with thoose guys too. But they don't affect so much of your gameplay. Just running around...minding their own - Lag... This one is not much noticable but sometimes, if you're having slow internet you will feel it. It might result in disconnections sometimes and in damage delay that might result death of your char in fights. - PvP is really gear, class and armor and weapon fortification relied. Yes, If you are level 40 or 50 and thinking about going into PvP instances...Forget it. You will die by 1 hit from lvl 60 or higher players who are fully geared and their armors and weapons are fortificated. If you wanna be PvPer here, you will at least need to spend some time getting thoose gears and fortify armor that matches your class.  Also there could be more CONS, you might like and dislike something and our oppinions might be different but remember, You are a new player and this is a review of someone who is in the game for a long time :) Long enough that can see why this game is actually 100% worth to play ^^ But make sure you go little over minimum system requirements because game will really test your PC hardcore :)",
            "review_score": "1"
        },
        {
            "review_text": "Honestly my favorite PC game, definitely worth giving a try! Seeing the screenshots, I didn't think I'd enjoy it. But I am now dependant on this game. XD",
            "review_score": "1"
        },
        {
            "review_text": "It looks like a childish, easy, stupid, simple mmorpg at first glance, but you get into and you notice how complex it is. there are more classes than almost any game of its kind, each with totally different play styles. the eidolons, pets that help you fight, seem pointless at first but can be used very strategically. overall, it is a very addictive mmorpg, with very good class balancing and diversity.  8.5/10 (10/10 when the few, minor bugs are fixed)",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥ love this game to pieces such quality for a free mmorpg and not even p2w :3",
            "review_score": "1"
        },
        {
            "review_text": "Hit a sleeping Lumberjack with a giant wooden hammer. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Glad this is finally on Steam. It really is a fun MMO, love the classes in this game and the general idea of Eidolons. Isn't overly as difficult as other MMOs I've played, but it still is pretty fun, especially the higher level you are. If you're looking for a more simple yet fun MMO with action, I suggest you play Aura Kingdom. :D  Add me if you want, on Hydra server and IGN is Varshmat. c:",
            "review_score": "1"
        },
        {
            "review_text": "Good game, one of the truly Free to play MMO's out there. The overall design reminds me of IRIS onlinbe which I absolutely loved. The eidolons are a neat Idea, and so is chaining two classes together. It is kind of an ARPG in that you shoul dodge and jump out of AOEs but not really, as you can only jump or run out of the way. There is a lot to do every day, so it is diffcult to get bored.  The downsides to this game though is that and this is my biggest one, is that every class, EVERY class is OP, especially if you get dual blades, or shield and sword then you break the game. Which this kind of takes a good chunk of fun out of it, when you can solo field bosses with zero difficulty.   I reccomend it but if your looking for something more challenging, youll get bored quick.",
            "review_score": "1"
        },
        {
            "review_text": "Not much skill needed in this game because there is no aiming, there are just a couple of abilitys that you can dash with or dodge. Its very lagy which doesnt make me so happy. Even dou my negative feelings about this game, there is something that makes this game fun, its kind of the most similar game to sword arts online, there are a lot of calsses to pick from, and there are A LOT of things to do in it to aquire strenght. This game has fishing, card dueling even archeologyc searching add it in it !!! and for those people who think this things are usleass, guess what, the higher level in card dueling / fishing / archeology you get more bonus stats, from the level range of 1 - 10. While the curent maximum level is level 85.  The PVP isnt that much evolved because, as I already said, not much skill needed only good items.  Even dou my negative coments nothing in my review maters except my personal enjoyment, and I realy do enjoy playing this game.  OH ~~~ and ~~~ the kinda main thing in this game is to collect pokemons and level em up XD (eidelons)",
            "review_score": "1"
        },
        {
            "review_text": "6/10 just because that cute graphics and class diffirences. Just for that. As a mmo, definately bad game. It want too many time, maybe 2x then the others. And pay to win ofc. But still yes, I suggesting to anime lovers.",
            "review_score": "1"
        },
        {
            "review_text": "Great story line, beautiful visual effects and scenery, friendly socail community!",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful, it's got great anime style graphics and an amazing set of armour and clothing choices.  10/10 for graphics.  8/10 for game optimization 5/10 for difficulty and 10/10 for gameplay.  This game in a whole is worth playing, it's fun in short. It's a /Extremely/ easy game for all to play. I played it for 11 hours and got from level 1 - level 42, I had a create time conversing with the commuinity of the game and fighting my way through the typical sort of mmo questing sysetem. The dungeons are probably the best bit of this game, especially the bits of seen for hell-mode. The dungeons are insane, so much colours and things going on at once you really feel like you're controlling some sort of really OP anime character.  Pro's-  -F2P and a very good F2P model at that. -Beautiful world to explore.  -A great anime style; probably the best yet. -Fun gameplay. -A lot of the quests are completely opptional it won't /make/ you pay for anything to get along in the game. -Easy, this could be good or bad depending on your opinion.  Con's-  This is going to be the biggest thing I'm going to raise, because it's what made me stop playing. -The AP store, the place where you use real money to buy in game things, not important things that give you an advantage over anyone else, just mounts, costumes, random things...AND THE F**KING SUBCLASS CHANGE. That's right, being a 'Noob' to this game I had know idea that you're supposed to take a certain subclass taht went well with the first class you had, it would be fine if this change costed in game currency or a small amount of loyalty points. BUT NO. it costs  !!!£20!!! For something that small but still something so drastic and needed for the gameplay, for this single thing the developers get!  0/10! EA STATUS.  -The game is your typical mmo. Kill 9 of these, then hand in the quest. It's normally okay though since it's masked by the beautiful gameplay. -The music was ♥♥♥♥, sorry people but yes. The same soundtrack...Over &amp; over...Just...ugh. -PvP is completely one sided, it's no wonder barley anyone does it, Gunslingers rule the battlefield. -Not much end game content. The extent of what you do is farm to get the best mounts and costumes.  In short, this game is great. Just be careful of the choices you make sometimes...Because the developers are gonna make you pay big.  This game get's 7/10",
            "review_score": "1"
        },
        {
            "review_text": "this game is so cool if you are anime fan you should play this cause all of the character are cool and pretty",
            "review_score": "1"
        },
        {
            "review_text": "This MMO has a lot of flaws, but for some reason I find it's crude nature appealing. It gives you a lot more freedom to discover things for yourself, not so cookie cutter as other MMO's. The community is suprisingly pretty nice, and the anime style is appealing to me. I'm going to continue to play it, all in all I would give it a 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Good Gameplay, great storyline, and easy-to-learn controls! This game truly expresses the basics needed for an awesome MMORPG!",
            "review_score": "1"
        },
        {
            "review_text": "Typical MMORPG for weeaboos. Lovely!",
            "review_score": "1"
        },
        {
            "review_text": "It's not a bad MMORPG. It's open-world, which is what I've been looking for in a while and there's a lot to do. Plus, you don't have to pay to win or buy stuff to look decent.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, Its kinda dead now. The game has been out for 2 years now but you'll still find people on pvp or out questing about. Game has alot of grind but that isn't always horrible. If you want a fun MMO to play with friends this is a good one!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Although at around level 40 the game starts to make you grind for exp. Lots of 'Kill this' quests, and 'Collect this' quests. Killing monsters doesnt give enough exp, as around level 40 the only reliable source of exp is doing quests. Let me tell you, there arent many quests in the higher levels. I have a level 49 character and I still enjoy the game, as PVP gets quite intense sometimes :P. Pets or 'Eidolons' as they are called in this game, are quite unique, and are a key part of the game's story. Overall, if you're looking for a game to kill time, chat with the very welcoming community, and look awesome, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best anime mmos out there. A variety of classes make it a must play for all jrpg players. the graphics are amazing even on low settings and almost any computer can run it if mine can.",
            "review_score": "1"
        },
        {
            "review_text": "So i got this game 3/11/2015 and on 3/13/2015 i had 24 hours in the game 2x12=24 so in 2 days i have played 24 hours 12 hours each day amazing game",
            "review_score": "1"
        },
        {
            "review_text": "It's like waiting for your wife to put on her make-up and you're at the front door all ready waiting for her to finish in the next 15 minutes.       (i'm talking about the lag)",
            "review_score": "1"
        },
        {
            "review_text": "Well I have been playing this game for 4 hours and I can tell that this game is beginning to grow on me and I really like the game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, It's a good Anime MMO and for sure worth checking out(it's free so you have nothing to lose). Not to complicated yet not to simple either.  If you like anime and MMOs, give it a try, you just might like it.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed Eden Eternal (another game by Aeria Games). Aura Kingdomes is the inproved version of that game. It is stroy driven and you cna play it solo for the most part. It has a cooldown system, meaning there is no mana involved, which is a huge + for me, because i allways forget to pop the mana pots. The combat is fluid, fast and nice to watch. And all bosses and even some normal mobs have AOE moves that you can dodge by actually walking out of them. You can also fly at any time. You get upgraded mounts as the game progreses. You also get costumes that all look different every 5-10 levels (as quest items). In daily quests you get costumes aswell and they last foerever and aren't 3-day costumes (you can get those too tho).  Overall i recommend the game and since i used to play mmo's a lot in the past this one is refreshing to play, because it's simply a blast to play.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Play it, now!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much Sword Art Online with amazing backgrounds",
            "review_score": "1"
        },
        {
            "review_text": "I was riding a Giraffe bird, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "From the beginning, I loved this game. The music and the art are both very beautiful. I've never really gotten into MMO's, but I'm addicted. It's a beautiful world full of unique characters and stories. I recomend!!",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Lively communittee Good plot A lot of side quests  Cons: Items too expensive Lagging a lot",
            "review_score": "1"
        },
        {
            "review_text": "Roses Are Red Violets Are Blue Don't Let Your Older Sibling Make Fun Of You For Playing.... you get the point just go play this game and you will be happy.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed it whilst it lasted, besides some things just arent clear at all, like some useless quests which seem pointless to whatever is goig on at the time. although i really enjoyed playing it and sometimes the pointless uests were a nice break from the usual ones that you will come across. Highly reccomend to anime lovers.",
            "review_score": "1"
        },
        {
            "review_text": "Overall fun game to play and is not very difficult to get into. Most the time your character will be auto walking to the next main objective, which is nice if you're out to play casually. I have yet to make it end game as i am lvl 44 and this review will be edited until then.   Pros:   -Class system that involves class combos with special skills as the result of it -Simple rewards system for doing sidequests which can give you some nice gear -Cash shop seems to be mostly cosmetic  -Crafting your own consumables for dungeons!  Cons:  -Not all classes can be mixed, only certain class combos get special skills out of it which makes it feel like you would have to follow this combo only. Although it is somewhat understandable.  -Cash shop points from buying seem to be really low...im kinda surprised at how much a character slot expansion costs.  -Starts to get very repititive, after a while it just gets kinda boring auto walking. The quests range from 'kill these guys' to 'kill these guys to get a certain item'   Conclusion: Like any other game it is definitely not perfect but it is fun to try out and i would recommend this game for someone who plays to play a laidback game. Playing with friends would make the experience a bit more enjoyable since most people you will run into will not be very chatty or you might just get recruited to a guild instead. I hope to give a full review once i reach endgame or if i dont then i will leave it here and give it another edit.",
            "review_score": "1"
        },
        {
            "review_text": "Love this MMORPG... xD I was looking for anime MMORPG for whole time, and i Finally found it..  Aura Kingdom has beautiful grahpic, navigation quest for helping newbie for me xD  And the most I like is that I can customize my desire character :D ",
            "review_score": "1"
        },
        {
            "review_text": "I thought I'd put in my imput on this game. First off, when looking for an MMO with Anime Graphics and free-roam style... this is so far the only game that has hit the spot. I fell in love and I now have been playing it non-stop for three days, just short of 40 hours now.  TRUE - Players are not overly friendly and do not go out of their way to say Hello or RolePlay (I come from World of Warcraft) so players NOT roleplaying was a little different. FALSE - Players only seek to use you. I've met some very nice people and have joined a guild that is actually reasonably social. Good players are out there, they are just hidden. Hah. TRUE - The Quests are mostly gathering and killing - basic MMO stuff. Still, I love them because if you listen to the story behind them, they actually make sense. In WoW - they say go get some candles. No explanation for why... just go get me some freaking candles. So you do. In this game, your goal is clear and everyone's quests are to help them help you. It makes sense why you go gather mushrooms or kill beetles. TRUE - The AI and BOT models are VERRRRRY overused, but I don't mind it much. As for player models, I haven't seen any close look-alikes and the character creation gives just enough imput.  Other Things I Love? I love classifying in two specializations. So i can use guns and swords, etc. It's very cool and something I was sad they started taking away from World of Warcraft (its basically nonexistant). I love the dungeon system. Dungeons are completely solo-able or you can join up and do a party-version. This makes it easy for SOLO players (like myself) to get everything in the game accomplished without searching for people I don't even want to talk too. The game is easy. Not in the sense that it offers no thrill or excitement, but its not overly complicated. Everything is explained in words first and then (for visual people like myself), most everything has a little video to also explain how each element works. Using Gems is explained, creating armor and gear, and even fishing. Fishing is FUN. Its also one of the easiest places to get Gold (WInk WINk). I Love the Companions - they are fun and sooo helpful. I especially Love Merilee!! Costumes are great - no mismatched ugly gear while you're leveling. The best ones must be bought however (SIGH)  What I Don't Like? No open world RolePlay - but thats ok. Hey, if you want to Look Me Up. I love Roleplay Not a whole lot of servers. Can only create 9 characters, but there are 12 classes [This isn't overly important since they have duel-classification at level 40, so you can make up for lost classes then.] Gold Farming is Slow. And I do mean SLOOOW. I've farmed gold for weeks in several games but I've never had so much difficulty as in this one. In-Game Real Money:: I've always had a problem with this in games. It bothers me that I can't buy nice things with Gold. They have implemented another Currency to get most of these Real Money items, but its a lot of work (almost too much). Still - despite adding this it is in no way PAY to WIN. You don't have to spend any money to be freaking amazing in this game.  I don't if my review helped. But these are some things that I looked at, disliked, loved, and enjoyed.  Overall. Get this Game. If you like RPGs with a GOOD Storyline (who doesnt?), Anime Graphics, and MMO, get this game. People say a lot of crap. But this game has been completely worth it for me. :) ",
            "review_score": "1"
        },
        {
            "review_text": "a great game, love to play it even since its not on steam yet but now its on steam now i love to play it even more :D",
            "review_score": "1"
        },
        {
            "review_text": "Though I kinda agree with the few reviewers that AERIA indeed has quite slow and awful customer support. I would still recommend you to play this game. Although Aura Kingdom is kinda old and may not have the player base that it used to have. The game is still fun overall, it takes your mind off things should you play it. There are tons of things that you can do. From Archaeology all the way up to designing your House's interior ( which is a new implementation btw). And lets not forget about the fact, that Aura has a very friendly community.   PS: I too came out from inactivity, their replies did indeed took quite a while, and even worse is that, if you try to reply them on email after they answered your ticket, your reply won't reach them. So, I recommend that you continue answering their questions through their website. And another thing, if you too, came out from the tempory ban due to inactivity and was required to answer a few questions. Some of your answers doesn't have to be that specific. I mean, no one actually remembers everything anyway. The few most important things that they actually need from you is the original email, a character name, and a server. And if you ever purchased AP, then a transaction #. And yes, I too did find it quite bothering that I would have to go through all of it. But if you really want to play it again, just be a little patient, it's not like you're gonna die from waiting anyway. ",
            "review_score": "1"
        },
        {
            "review_text": "It is a good way to spend some free / extra time, but compared to previous Aeria games releases that is basically it.",
            "review_score": "1"
        },
        {
            "review_text": "I wish, i can go back to this game. Playing with my old friends from guild..",
            "review_score": "1"
        },
        {
            "review_text": "10/10 short skirts and its always windy...",
            "review_score": "1"
        },
        {
            "review_text": "I suppose writing a review for this game is in order.  *Ahem*  Aura Kingdom is a free to play (mmo) game licensed by Aeria Games. During my first week into the game, I was greeted with the traditional anime esc story about how you are the main character and the world revolves around you. Now this being an MMO I grew tired of reading through everyones dialouge and skipped most of the story until I found myself in Navea. Navea is the main hub for players to sell their items, fight players, window shop, etc. Having made my way to lvl 20 and viewing everyone elses cool costumes and items, I found myself looking through the Auction House. I will say this right now... DO NOT spend any money on this game. Every item can be obtained by completing quests or dungeon running, although it will take far longer your wallet will be thanking you in the end.  Now that the fancy costumes are out of the way, we can begin talking about the combat system. Combat in Aura Kingdom is very... spammy? Without knowing any better, you will soon be allocating all your combat points into speed which will reduce the cooldown on all of your abilities. Now with infinite ability spamming, the bosses in this game are a lot easier and reduce the amount of time you spend in dungeons. All in all, the combat system is nice but very broken with the cooldown on all of your abilities... especially the bard class.   Would I recommend the game? Yes. Aura Kingdom is a free to play game with a lot potential but is wasted on broken builds and abilities. However, the world is very fruity and with new patches being released every month or so it makes up for the mistakes that it clearly made.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game... It is a toned down verison of other MMORPG's but it is great for a busy mom and will be a great game to get my oldest son started on.",
            "review_score": "1"
        },
        {
            "review_text": "  Looking for a game close enought ot SAO?  Well you've come to the right place, cause Aura Kingdom is only one of those anime themed MMORPGs that is as close to SAO...  Grindy, but worth it. Lots of players (Especially on channel 1 of your chosen server) and a very active community. Weapons are very stylish, but the costume is hard to come by without advancing to get at least a decent Forest Ambassador outfit. There is a currency called Loyalty Points (Accumulated by doing certain daily quests, returning monster bounties, or in valuable chests) and if you continuously do these quests, getting a costume without abiding to microtransaction's tempting offers for the best looking costumes, can be pretty satisfying, include the mounts too which are kinda affordable. Eidolons, the pets which is already registered in your account and can be used by multiple characters depending if they are active on the other character, is very convenient as you won't be grinding hard again if you decide to create a 2nd character, but instead the keys 9which are used to summon them) can be saved to do an evolution for your eidolon. And lastly, I would like to commend the very interesting and versatile sub skill system. In lvl 40, you will be given a quest where you can pick your sub, but worry not, as your sub can be replaced for free!  Overall, I would recommend this to anyone who likes MMORPGs with anime theme and an active community and fun to play dungeons.",
            "review_score": "1"
        },
        {
            "review_text": "It's cute!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty nice fishing simulator, including a special equipment and consumables crafting. Besides of ecpecially fishing, have some more other activity, for example: monster hunting and arena fighting. But who care about this, if you have fishing?  10 'greeneyed mandarine fish' / from 10.",
            "review_score": "1"
        },
        {
            "review_text": "it wont play.... why ?",
            "review_score": "1"
        },
        {
            "review_text": "Played only alittle while, but deffo seems like it could be fun. Deffo colourful and bright gameplay either way, and its F2P !!",
            "review_score": "1"
        },
        {
            "review_text": "This is a very nice MMORPG, you have lots of skills and the option to get a second class further in the game makes it even more interesting. You also have companions which are called Eidolons that help you in your fights The kawaii anime design is great, the fishing system is actually fun, and ther is an interesting and not too hard crafting system.  But the quests sometimes can be boring (slay monsters, get drops, talk to someone) and I don`t think the story is deep or anything, doesn`t look like that is the goal of the game Nevertheless I positively recommend this game, if you like the genre it`s really enjoyable and good source of fun, be you casual or hardcore Ps: Note that I don`t play PvP so I have no opinion on the game being unbalanced or pay to win",
            "review_score": "1"
        },
        {
            "review_text": "Trash game",
            "review_score": "1"
        },
        {
            "review_text": "Great game! A bit slow to start but once you slog throughit its great! i would reccomend playing with friends as it can be a bit lonely.... Yo uhave a fun friend and a great leveling system. its a bit slow to start, and i had a problem with my computer's resolution that was pesky, but it worked out.",
            "review_score": "1"
        },
        {
            "review_text": "this coeg",
            "review_score": "1"
        },
        {
            "review_text": "  Looking for a game close enought ot SAO?  Well you've come to the right place, cause Aura Kingdom is only one of those anime themed MMORPGs that is as close to SAO...  Grindy, but worth it. Lots of players (Especially on channel 1 of your chosen server) and a very active community. Weapons are very stylish, but the costume is hard to come by without advancing to get at least a decent Forest Ambassador outfit. There is a currency called Loyalty Points (Accumulated by doing certain daily quests, returning monster bounties, or in valuable chests) and if you continuously do these quests, getting a costume without abiding to microtransaction's tempting offers for the best looking costumes, can be pretty satisfying, include the mounts too which are kinda affordable. Eidolons, the pets which is already registered in your account and can be used by multiple characters depending if they are active on the other character, is very convenient as you won't be grinding hard again if you decide to create a 2nd character, but instead the keys 9which are used to summon them) can be saved to do an evolution for your eidolon. And lastly, I would like to commend the very interesting and versatile sub skill system. In lvl 40, you will be given a quest where you can pick your sub, but worry not, as your sub can be replaced for free!  Overall, I would recommend this to anyone who likes MMORPGs with anime theme and an active community and fun to play dungeons.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty nice fishing simulator, including a special equipment and consumables crafting. Besides of ecpecially fishing, have some more other activity, for example: monster hunting and arena fighting. But who care about this, if you have fishing?  10 'greeneyed mandarine fish' / from 10.",
            "review_score": "1"
        },
        {
            "review_text": "Played the game about 4 months and I stoped playing about 1 1/2 month due to last year's AK pay2win  After that I decided to play AK again and I was very happy lots of stuff in trading system and in Aunction Sytem went  cheap and very affordable      ~Solo Player",
            "review_score": "1"
        },
        {
            "review_text": "New to mmorpgs and don't know where to start? HIghly recommend this to any one who is new to this genre, endless amounts of fun and has very friendly community 100/10.",
            "review_score": "1"
        },
        {
            "review_text": "bots everywhere, in my server you can see 10 bots in your screen ( especially grenadier ) at specific farm spot with same eidolon, same outfit , default look, and that's the fact.   the chain of aura kingdom ( most of mmorpg actually )  when you have reached level 60 , you need gold to buy stuffs , i heard a lot about dungeon grinding, but the drop rate really not good, then i tried WB-ing at VV and BB, i saw many lv ??/80 people with their party and their guild. so if you want to WB-ing ( paragon table to get gold ) you have to join guild with good people , at least lv80, the problem is those guilds don't want to accept people like me ( newbie 60 ) with green set , and they only want to accept highly geared member. evil chain.  pardon my english, and my hours on record , sry i download it on steam just want to review it, i don't play it on steam.  but at last, i recommend this game because you know, it's aura kingdom ( with glitches and lag ofc ) good game with great system, gliding is fun ( i don't need 90% movespeed mount for show off in navea because you know i have glide boost my MSPD to 255% , show off is not good brother! )",
            "review_score": "1"
        },
        {
            "review_text": "Normally I won't recommend this game for people that don't really like anime, but even than I would recommend it this game deserves more players than it has at the moment, just listen to me once people, it's a free to play MMO, most of the MMO's are not free and this one is free AND it's fun to play here is my list of what I like and what I don't like of the game:  What I like: The combat animation is fun to see and enjoyable to look at (even better then World of warcraft) the combat is not bored at all and quests give you XP It's a F2P game You have guilds Raids Dungeons (not sure about the last 2)  What I don't like: The Soundtrack is not that amazing You keep your gear to long and if you want a new customized gear you need to buy it in the shop. (But you can earn loyalties for it)   That's it for what I have seen so far, I just let people know, that his game is more fun then you think!",
            "review_score": "1"
        },
        {
            "review_text": "u click on stuff 7/10",
            "review_score": "1"
        },
        {
            "review_text": "This was one of my first MMORPGs, aside from Mabinogi, which was unique and different from other MMOs. And, of course, my newest computer had a sucky graphics card which couldn't - and still can't - run Mabinogi properly. So, I decided to search around and I found this game.  It's fun as hell.  I've gotten to lvl 21 in the timespan of five hours. Very fun times.  The quests are the usual 'Search for X and give it to Y' or 'Kill X amount of Y', but I honestly don't mind that. To me, those kinds of things don't bug me much. The storyline is the major portion of the game for me. And, from what I've seen so far, this storyline isn't half bad. The Eidolons are pretty kickass too.  The classes are unique and cool in their different ways - you have no idea how much I struggled to find the proper one that I really wanted to use. They all have different strengths and weaknesses and they provide the players with different playing styles a chance to succeed as well.  TL;DR - A pretty good MMORPG that I would recommend to my friends. Nothing too out of the ordinary, but still unique in it's own way.",
            "review_score": "1"
        },
        {
            "review_text": "I played some, pretty good I guess.",
            "review_score": "1"
        },
        {
            "review_text": "I'm still not sure if I'd say YES or NO for this game and it makes me wish that there's a MAYBE option for the reviews...  Why I'd say YES is that the game nas a good story to it, nice mechanics and partly uses the old 'find the NPC you need' system. Sadly though, the story quests are fixed NPCs and you can walk there with auto-path (I even tried the game while knowing the feature is there).  I'd say NO because the animations are very clunky and the game lags like hell. Though lag might also be caused for the servers to be located on the US West-coast while I play from Europe, I would certainly play more if it wasn't such an issue.  Last but not least, the cash shop. I'm too low in the game to be able to judge Pay2Win or not, but it does look like it's Pay2Win. This while there's a lot of fluff cosmetic, mounts and eidalons (not sure how severe P2W those are) in it as well.  In general said YES because I think the game is fun to play...",
            "review_score": "1"
        },
        {
            "review_text": "Spent 69 hours of grind for a badAss costume. I think losing my social life because of this game... 69/69 would waste my life for loyalties",
            "review_score": "1"
        },
        {
            "review_text": "its good",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive, bashing up your enemies with skill combo's is fun (only tried the Grenadier and Holy Sword classes so far), but tends to get repetitive as most other MMORPG's. As a  socially awkward  solo player, at the least. Aiming for the level cap, yay much woot!",
            "review_score": "1"
        },
        {
            "review_text": "So far against other MMORPG games like this. Aura Kingdom is above average. But the sad thing is.. if youre not a paying user. Well, get ready to be beat up by premium users. over and over again. haha",
            "review_score": "1"
        },
        {
            "review_text": "Aura Kingdom is the best in the history of, um. umm... RPG GAMES! ((I knew that))",
            "review_score": "1"
        },
        {
            "review_text": "  Pay-to-win Kingdom.",
            "review_score": "1"
        },
        {
            "review_text": "i cant get any cards so i had to buy them -_-",
            "review_score": "1"
        },
        {
            "review_text": "i cant get any cards so i had to buy them -_-",
            "review_score": "1"
        },
        {
            "review_text": "fun game with over the top attacks, good varitey and fun gameplay. the bad part story which had me skipping A LOT of worthless text. i find pvp to be the most fun thing to do if your bored. flying looks so derpy but is so fun. overall great game",
            "review_score": "1"
        },
        {
            "review_text": " General Gameplay",
            "review_score": "1"
        },
        {
            "review_text": "They have kirito costume from sword art online",
            "review_score": "1"
        },
        {
            "review_text": "fun combat system ,great visuals , good community , really feels like i'm in a anime the story is good ^,^ also the game reminds me alot of other games i played as a child like 'zelda' when yer fishing in the game and you get a fish it makes a victory sound and you hold up the fish lol reminds me alot of link when hes holding up a fish thats 10x bigger than him in voctory =p and they game also reminds me of digimon world for the ps1 you have these pets that are called 'eidlons' and they gives you stat buffs as well as a special attack and they talk to you &gt;,&lt; witch can be annoying at times but hey ^,^ over all i give this game 6/6 .......~''",
            "review_score": "1"
        },
        {
            "review_text": "Not bad but not best 8/10",
            "review_score": "1"
        },
        {
            "review_text": "  Nice game story...",
            "review_score": "1"
        },
        {
            "review_text": "sexy character 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This games is fun for the first 1hr then it becomes your life as you become addicted to the story line of the anime themed world.",
            "review_score": "1"
        },
        {
            "review_text": "its a good game but... the community isnt the best at the low levels at least no one help or even chat",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty good I guess you pick a class and get little spirits. To be honest the missions get repetitive and a lot of the better items you have to buy with real money. Has great characters and a amazing story and artwork. The combat is kind of lacking especially for classes like gunslinger where you just kind of spam, and grenadiers seems to be the bot class as you'll see a lot of grenadiers with all the starter stuff almost any zone. The further you progress the leveling goes from a stroll in the park to satins ♥♥♥♥♥♥♥, once you hit level 60 or so the zones you go in are filled with unnecicarilly hard enemies. Anyways I give this on the scale of Fritos to Doritos a Sour Cream and Onion.",
            "review_score": "1"
        },
        {
            "review_text": "Its a good game, just not for any hardcore mmo players:   I have played This before it came out on steam so here are some things that i think should be noted Pros:  No mana for an MMORPG  Coolown is fast and you have a lot of skills at a low level  wont feel the urge of buying anything until finishing the main quests/ lvl 30 up  good for Casual players starting to get in to MMORPG's  It's a free game  Cute Dresses and costumes, yes this is a pro  you can mount a unicorn, ostrich, dragon, Cindirella's pumpkin wagon etc etc  you get free pets and you get a free pet at the start ( Although you cant use it until lvl 10+)  combat system is fairly simple to understand  IN THE MIDDLE (CAN BE PROS OR CONS)  Art style, I enjoy anime, but im not sure with everyone else  lolis are abundant in the game  you CAN solo most of the quests except for the ones that are mandatory to have a team mate up until lvl 45+, not sure about the quests above that  There is a system in the game that automatically puts you in a route to a selected quest.  CONS;  Although the combat system is simple, and the cooldown are fast, i often see myself using the same skills over and over again  Pretty grindy after you reach lvl 20+, there are grind quests on levels lower than 20, but you will start to feel the repetativeness in lvl 20  although there is a currency that the game gives away, the bulk of the cash grab is on things that upgrade armor and weapons.  About that mount thing, most of those you'll need to buy, that includes the unicorn, but not the ostrich, you get a free ostrich. ",
            "review_score": "1"
        },
        {
            "review_text": "Fun and simple. Recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Write a review for Aura Kingdom Please describe what you liked or disliked about this game and whether you recommend it to others. Please remember to be polite and follow the Rules and Guidelines.nes.",
            "review_score": "1"
        },
        {
            "review_text": "Overall this is an awesome game!   It has a slight learning curve with some of the aspects of the game, but once you get it down it's a lot of fun. You're able to create some cute and colorful characters, the one fall-back with the character creation is the lack of variety. You can pick between 9 faces and 10 hairstyles 12 hair colors and 4 skin tones. This is not really a SMALL amount, until you're in game and notice how many other characters that your same hair style. But the combos they have are very nice and very well done. I would love to see them expand on this in the future.  It is one of those games that you click on the quest and your character starts running to it, making getting to and from your quest spots a breeze, almost too easy. But the combat system is really impressive and has some great animation work. You should put thought into how you're going to build up your character before you start adding attruibute points here or there. You can do a google search on some of the classes and get builds and guides on how to create and lvl your characters. Failure to fo this way will make you find yourself spending a lot of in game currency to reset your stats.  In short, just download the game and jump in feet first....",
            "review_score": "1"
        },
        {
            "review_text": "i will rate it 10/10 for the best anime MMORPG for 2014  best graphics and best skills to work with and also there is the auto location to locate your quest so you will not go wonder about the world map just to find your quest .",
            "review_score": "1"
        },
        {
            "review_text": "Aura Kingdom isn't bad, I'd say it's the best of its kind honestly (Anime MMORPG), but there are far better F2P MMORPGS out there. That being said, if you realize that and you still want to play AK, it's suprisingly a decent game that can keep you entertained for hours if you're into the anime setting.",
            "review_score": "1"
        },
        {
            "review_text": "I can only recommend this game, it's great!",
            "review_score": "1"
        },
        {
            "review_text": "It's fun at start, but the more you play it, the more boring it gets +Not pay2win +Good style and beautiful landscape +Characters are cute, good for ppl who loves anime style -Grinding quest all the time -Repeated dungeon -Gets boring so easy -Not so immersive",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a cute JRPG. Easy to advance through, lovely to play, offers satisfaction when leveling through, and killing Elite mobs on your own.  Would play again 10\\5",
            "review_score": "1"
        },
        {
            "review_text": "Plenty of stuff to do, and doesn't feel like a WoW clone. And even though you can buy stuff with realmoney, it doesn't feel like a facebook game.",
            "review_score": "1"
        },
        {
            "review_text": "LOTS OF POTENTIAL GREAT IDEAS BUT THE PATCHES FOR THE ALPHA ARE SLOW COMING OUT I THINK WHEN FINISHED THIS WILL BE A GREAT GAME.",
            "review_score": "1"
        },
        {
            "review_text": "tHIS GAME ARE OKAY, BUT A BIT BORING TO PLAY",
            "review_score": "1"
        },
        {
            "review_text": "An alright game, if you enjoy killing cute things. ^.^  Overall the MMO experience is that overwhelming at the most, compared to others. But a good game.",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░░░░▄▀▀████████▀██████▄▄▄▄▄▄░░░░░░ ░░░░░░▄▀░▄▀░░▄▄▄▄▄░▀▄▄▄▄▄▄▀▀▀▄▄░▀▄░░░░ ░░░░▄▀░░▀░▄▄▀░░░░░▀█▄░░░▄▀▀▀▀▄▀▀░░█░░░ ░░░▄▀░░░░▄▀░▄███▀▀▄░▀░░█░▄▄▄▄▄░░▄▄█▄░░ ░▄▀░░▄▀▀▄░░▀▀░▄▀▀▀██░░░██▀▀▀░▀▀░▀▀▀██▄ █░░▄▀░▄▄░▀▀░▀▀░░▄░▄▄░░░░█▄░░▄▄▀▀▀█▄░██ █░░█░▀█░▀█▄▄▄▄▄▀░█░▄▄▄░░░▀██▄░░░▄░░▄██ █░░░▀░░█▄▄█░░▀▀▀█▄▄░░▀░▀▀▀▀░░▄▄▀▀█░█▀░ ░▀▄░░░░░▀▄▀█▀█▄▄█▄░▀▀█▀▀█▀▀▀█░▄████▀░░ ░░▀▄░░░░░▄▀█▄░▀████████████████████░░░ ░░░░▀▄▄░░░▀▄▀▀▄█░░░░░█░░█░░█░█░▄▀░█▄░░ ░░░░░░░▀▄░░░▀▄▄░▀▀▄▄█▀▀▀▀▀▀▀▀▀▀▄░░░█▄░ ░░░░░░░░░▀▀▄▄░░▀▀▄▄░░░▄▄▄▄▄▄▄░▀▄▄░░░█░ ░░░░░░░░░░░░░▀▀▀▄▄▄▀▀▀▀▀▀▀▀▀▀▀▀▀░░▄▀░░ ░░░░░░░░░░░░░░░░░░░▀▀▄▄▄▄▄▄▄▄▄▄▄▄▀░░░░ ▄▄▄░░▄▄▄▄░░░▄▄▄░░▄▄▄▄░░▄▄░░░▄▄▄░▄▄░░░▄ █░██░██░██░██░██░██▄█▀░██░░░██▄░███▄██ █▀▀░░██▀█▄░██░██░██░██░██░░░██▀░██▀█▀█ █░░░░██░██░▀█▄█▀░████▀░████░███░██░░░█ ░░░░░░░░░░░░░░░░░░░▄▄▄▄░░░░░░░░░░░░░░░ ░░░░░░░░░░░░░░░░▄███▀▀▀██▄░░░░░░░░░░░░ ░░░░░░░░░░░░░░░░███░░░░░███░░░░░░░░░░░ ░░░░░░░░░░░░░░░░░░░░▄▄▄██▀░░░░░░░░░░░░ ░░░░░░░░░░░░░░░░░░░██▀▀░░░░░░░░░░░░░░░ ░░░░░░░░░░░░░░░░░░░██░░░░░░░░░░░░░░░░░ ░░░░░░░░░░░░░░░░░░░▄▄░░░░░░░░░░░░░░░░░ ░░░░░░░░░░░░░░░░░░░▀▀░░░░░░░░░░░░░░░░░",
            "review_score": "1"
        },
        {
            "review_text": "it pretty kewl yo-",
            "review_score": "1"
        },
        {
            "review_text": "Why did i waste my time on this, when theres blade&amp;souls?  Still.. it was funny :D:",
            "review_score": "1"
        },
        {
            "review_text": "Me and my buddy started playing this and we playe World of Warcaft for years together and weve grown tired of it with all its changes within just an hour or so we are already level 16 and have explored so much content and map of the game and theres so much more to come were both equally excited for this game i found this game while looking at Rose Online which i had played for at least 7years i grew up playing that game it was so fun i loved the anime style it had but of course that game got very boring after the economy got so bad because of the item mall items im just hoping in this game i wont have to use the item mall to have nice things so far i absolutely love this game i would and will recommend it to my friends",
            "review_score": "1"
        },
        {
            "review_text": "tHIS GAME ARE OKAY, BUT A BIT BORING TO PLAY",
            "review_score": "1"
        },
        {
            "review_text": "^_^",
            "review_score": "1"
        },
        {
            "review_text": "After over 2000+ hours on this game (Steam Launcher), making it well over 5000+ hours overall.. I must say.. It's 'okay'. o/",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Has a lot of cool ideas. I'd recommend this to anyone who wants to scratch their MMO itch with a free but fair game.",
            "review_score": "1"
        },
        {
            "review_text": "i can do date quest's with my senpai ! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "nice and easy to jack off to",
            "review_score": "1"
        },
        {
            "review_text": "best executed anime mmo ever",
            "review_score": "1"
        },
        {
            "review_text": "Why wouldn't it get out of the main menu? any help?",
            "review_score": "1"
        },
        {
            "review_text": "Great MMO and its ANIME Designed!!!",
            "review_score": "1"
        },
        {
            "review_text": "A lot of guys in the reviews say that the devs are horrible for their support. I was tempted to not play this jewel. However, one guy, and I forget his username, wrote a review of the true reason for some of the devs responses. First of all, they will shut down your account if you are inactive for too long. However, you can get it back by msging the team. The reason for doing this is to prevent your account from being hacked thus protecting your real money purchases or anything you own. They did this with me and I contacted them and not even a day later they responded and gave my account back. The list goes on. For the gameplay, it is fun although it can get a little repetitive. Over all it is a great game with great potential and I recommend you grab some friends and play this! My one complaint is that they don't have a marriage system...that would be pretty cool.",
            "review_score": "1"
        },
        {
            "review_text": "i remember i didnt know the controls for the game and accidentally saw the panties.  Best mistake of my life",
            "review_score": "1"
        },
        {
            "review_text": "its a cuties game if you play it with Friend, don't play it alone you will delete THe game play it with friends ^^",
            "review_score": "1"
        },
        {
            "review_text": "ful of animemes  an anime mmo that is good  waht  11/10",
            "review_score": "1"
        },
        {
            "review_text": "great game love it",
            "review_score": "1"
        },
        {
            "review_text": "It's ok.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best f2p MMO's I've laid my hands on. Easy to understand unlike some other where you get to a certain point when literally everything is confusing.   + Awesome artwork + Good Dialogues + Everything  Cons:  - None",
            "review_score": "1"
        },
        {
            "review_text": " This game has all the basic elements that make up an MMORPG. Fetch This, Kill This, Deliver This, Talk to This, name such quests.  Combat is point and click. There's no mana. You'll just have to manage your skills' cooldowns.  Which kinda made it boring in the long run.  But, yeah. If you want a light MMO to play. Play this.  If you're one like me who's fed up in generic MMORPGs. Don't even bother downloading this.",
            "review_score": "1"
        },
        {
            "review_text": "Oh how i love MMOs, especially this one, easy controls, good graphics, and ANIME!",
            "review_score": "1"
        },
        {
            "review_text": "its RPG with stories, and uh you can make a very cute female chara thoo XD battle system was good and somehow ballance for every clasases. The story stoped once you finish the main quest, maybe its because the system still not updated yet. and if there is something that annoy me was the glitch (or not) in your chara lvl once it reach lvl 66++, it becomes '??' maybe the dev should updated it asap :D  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Can become pedobear (with so many form of loli charaters) and have an Unicorn pet. Highly Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I can make my character my waifu, while kissing fat japanese men. 13/10",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is easy for beginners of RPGs, the battling is fairly enjoyable to watch and the anime-style is perfect for weeaboos",
            "review_score": "1"
        },
        {
            "review_text": "This is an OKAY GAME for me.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game i instantly fell in love with it with all the classes and awesome community  10/10",
            "review_score": "1"
        },
        {
            "review_text": "kinda nice lol... hahah love the gameplay... ",
            "review_score": "1"
        },
        {
            "review_text": "Love this game already. super addictive!",
            "review_score": "1"
        },
        {
            "review_text": "Ostritch is life.",
            "review_score": "1"
        },
        {
            "review_text": "Quests: 8/10 PVE: 9/10 Fun, High amounts of damage. PVP: Haven't tried it yet but saw some videos online. Customization 8/10 Graphics 9/10 The game is able to stand toe to toe with other MMORPGS and win in certain areas. The most fun part I like is the fact that you are doing 10,000 points of damage in mid levels. Just refreshing to see such big numbers in a game.  Difficulty/Diversity: The game can be easy , medium, hard, impossible. Depending on which dungeon you enter. For the most part PVE is so easy a child can do it, but dungeons can rapidly get tough and some dungeons require multiple players or else its just not doable. Fair enough since that brings people together.  I wish they (and every MMORPG) implemented the market system of atlantica online. Limited inventory and storage slots but you can share warehouse with other heroes so you can 'MULE' alternate characters The game basically succeeded in making GRINDING , entertaining/amusing/fun. But still, grinding is grinding and after your 1,000th kill, you might fall asleep on the keyboard, such is the problem with every MMORPG with grind. But at least the game will make you move through different places and wont allow you to stay too long in one spot due to quest progression so it all works out. Droprates are somehow bad 4/10, hard to farm specific items for crafting etc. Some players suggested that crafting was only for the rich and not for everyone who tries it. Sad since in most games people craft to make the gold.   Overall this game is addicting and the $ Cash Shop isn't as bad. You can move through the game without being limited by it. That is what I have seen so far since I'm level 44. Max level 75 I hear.   They already installed gliding, they should have included FLYING. ... Some things need to be simplified. Seems one more step to becoming one of those chinese clutterfest browser mmorpgs.  I suggest you try it to level 10 and see for yourself. (shouldn't take an hour) Overall I would say this game is 8/10. Atlantica Online is still my 9/10 while Anarchy Online would be 7.5/10 in comparison. A 10/10? I'm still waiting for it.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game!!!!!! It's so much fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "I suppose it's love at first sight :)",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play if you love anime-style MMORPGs.... Enough to be said",
            "review_score": "1"
        },
        {
            "review_text": "pretty good but its so laggy hehe",
            "review_score": "1"
        },
        {
            "review_text": "A really easy game, so its a good choice to start with this one. Sadly the story isn't really strong, overall I give it a 6/10",
            "review_score": "1"
        },
        {
            "review_text": "grate rpg i love the grapics i recommed",
            "review_score": "1"
        },
        {
            "review_text": "Everything is basically perfect for an Anime MMORPG, but the only thing I dislike is finding location of/for mission is easy as a click. It would automatically take you to the location where you can complete the mission.",
            "review_score": "1"
        },
        {
            "review_text": "With only a little over an hour into the game, I can say that it is a pretty solid game and probably one of the better duo games out there for you and a friend :)",
            "review_score": "1"
        },
        {
            "review_text": "The moment i drop my 'WoW' and 'MMO' standard  this games britty gud  r u britty gud?",
            "review_score": "1"
        },
        {
            "review_text": "7/10 it's alright. The graphics are nice and colourful, especially when you have them maxed out, I like that you can glide to get around easily, and the click-to-go-to-quest-goal system removes a lot of the boring grind. It's one of those games that I would keep playing if I had friends to play with.",
            "review_score": "1"
        },
        {
            "review_text": "nice MMO RPG, 2 weapon at one char, solo dungeon nice :)",
            "review_score": "1"
        },
        {
            "review_text": "i am done with the bots i wont play until you take care of it meaning... never lol o.o   i have over 1000 hours on the aeria ignite´s.  this game is fun, has lots os customisation, has nice pvp and pve, gets better every update!",
            "review_score": "1"
        },
        {
            "review_text": "good game overall, but the controls do take a little getting used to. The camera needs a 'follow' option where it locks behind the players head, and can be zoomed in and out from there. sadly, i have had issues launching the game recently. the screen on the launcher gets a 404, a 504, or a 500 error and stays white, and after clicking 'start game' i am introduced with a new window that is straight white. from there it progresses to another error number. not sure if other people are having the same issue, or if its just me. any help is welcome! ",
            "review_score": "1"
        },
        {
            "review_text": "idk why i realy love this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty boring early but as you pass level 65 and join an awesome guild things really start taking off. It has since been adding more content into the game and there is still a lot more to come the game itself is well made and crafted although it suffers from intense bots case and unstable servers of late i'd recommend giving it a chance the story if you go through it without skipping is pretty neat too.",
            "review_score": "1"
        },
        {
            "review_text": "Definately fun to play.Must try!Controls are abit hard and you need sometime to get used to it.Graphics are not Bad at all!Many Character to chose from and Outfits?Damn very Sexy.I like the Casual looking though but i like them to be combine huehue...",
            "review_score": "1"
        },
        {
            "review_text": "This game is like what Ragnarok 2 should have been. Though the combat is point and click, what makes up for it is the flasky skills that you get ingame. The samurai class in the game has this charge up move that if charged all the way does this crazy flashy attack where you throw blue glowing slashes at your enemy and thats a skill you get a lvl 1! This game also does a good job of visually appealing towards anime lovers. So if you like anime and mmorpgs PLAY THIS GAME!",
            "review_score": "1"
        },
        {
            "review_text": "the best mmorpg game i have ever played its graphics are good but servers lag and and also it hugely reminds me mof sword art online with the skills and stuff and also there is so many fun quests and 3 servers with a bunch of server channels on each server so the active or crowded ones means there is a B U T T load of people so i give this game a 900000/10    So i Highly recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Oh how i love MMOs, especially this one, easy controls, good graphics, and ANIME!",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game once I started playing it c: I couldn't stop playing it xD I love the art style and how people are able to create the character that they want :3",
            "review_score": "1"
        },
        {
            "review_text": "When i see Aura Kingdom for the first time, i think this is a bored game.. When i play this, i was incorrect to review this is a bored game..  This game have:  - Nice grapichs - Nice skill animation - etc.. play this, to see other..",
            "review_score": "1"
        },
        {
            "review_text": "KAWAII!!! It's a nice distraction from WoW (as my sub ran out). It has got an awesome anime art style and its particle effects are flashy and cool. The quests are a ok as kill quests only take a minute and fetch quests are made fun with the games dandy gliding system (best idea ever!!!). I also like the classes, they are varied and pretty creative (in my opinion). Like most mmo there are dungeons and mounts (omg mounts FTW!!!) but its a worth while game to get for free. Of course you can buy that OP looking mount with real cash (like any mmo). Overall, great game and you should try it!",
            "review_score": "1"
        },
        {
            "review_text": "I can zoom underneath my character and see her panties 10/10 would zoom again (different costume, different panties)",
            "review_score": "1"
        },
        {
            "review_text": "best f2p mmo out there!",
            "review_score": "1"
        },
        {
            "review_text": "Not a full length review but one thing to say this game is really great :)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome anime style mmorpg game, it reminds me of SAO and its really similar to it",
            "review_score": "1"
        },
        {
            "review_text": "its good",
            "review_score": "1"
        },
        {
            "review_text": "Played for 10 minutes, fell in love with the game and story. Graphics are beautiful even on low settings and combat is fun and easy to control.",
            "review_score": "1"
        },
        {
            "review_text": "nice MMO RPG, 2 weapon at one char, solo dungeon nice :)",
            "review_score": "1"
        },
        {
            "review_text": "having lots of fun!!!   &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play when you're into anime.",
            "review_score": "1"
        },
        {
            "review_text": "The quick and dirty:  It's a basic but fun free MMO that I find to be very relaxing to play. The visuals won't tax your video card, but the art is colorful and well crafted, and the environments look great. It also has some very smart features that I haven't seen in any other MMO myself, such as the ability to click a quest step to initiate auto-run to its location.",
            "review_score": "1"
        },
        {
            "review_text": "It's not bad. Legit servers are Pay2Win though, to the point that there's literally no point playing unless you're going to throw $100's at the game. My advice, play on a private server.   As far as the game is concerned it's a generic MMORPG with Korean grindy themes and a Ragnarok Online-style Anime skin. The gameplay is mostly 'mash spacebar' which automatically runs you towards your next objective, followed by 'mash all the F-keys until it dies. Great if you want a brainless slash-em-up for after work but if you wanted something that required more than half a brain then I'd say look elsewhere.   5/10, would be more if there were less bots, less p2w and better gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "one of the most awesome MMORPG i've everplayed This year would rate it 10/10   i recommend this game for those who willingly wants to play or finding some MMO's",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Consider this the bible of Aura Kingdom:  Pros:  -Awesome anime-ish graphics -Fast moving real time combat -Awesome looking attack spells -Fully customizable talent tree -A huge array of summons to choose from -Cool character costumes -Easy, but fast fun moving quests -Free mount right at the start of the game -You can que up dungeons from anywhere in the world -Guilds can earn their own castle, where you can do your shopping, crafting, fishing, and various other duties without dealing with the lag of the main town or bots spam. Its actually really cool  Summary: Honestly youll be addicted right at the start. The beginning of the game is loaded to the brim with content and rewards just for even playing the game. Theres even 2 cut scenes that are pretty dope. Easy quests level you super fast and fast beautiful attack spells will have you enthralled just to play your character. Some of the monsters are adorable, and the characters look pretty badass.   Cons  -Way too many bots everywhere. Anytime you enter the main town, your inbox is spammed with gold sellers -Quests offer no challenge. Way too easy. Most times this is fine, but having a challenge once in awhile would be nice. There are literally quests where they ask you to talk to an object right next to the quest giver and then reward you with like 20-50% of your level in exp. Because of this, you level psychotically fast in the beginning  -PVP is the worst of any game I've ever played. Too many rich players with nothing better to do than twink out low level characters and camp low level pvp harassing new/poor players endlessly. It makes pvp not fun at all. You literally cant do anything because they just camp the spawn point and kill you in 1 hit. Theres no challenge or fun here. Just instant death with no gameplay in between. Absolutely stupid. Its so bad that the majority of the community ends up quitting out of frustration or bordom since PVP is the only thing there is to do at high levels -Theres only 1 raid dungeon and youre only allowed to go in it at the most inconvenient time possible: Saturday night (when most people are out having a life). Honestly its the dumbest raiding system ever created imo. It does not take into account that players are on different time zones or anything -Rich players dominate the raids and wont even allow poor players to join. You literally have to beg or find someone nice enough to let you join them on their raid if you ever want a shot -There are no high level quests, yet the level cap is 80. Quests stopped around 55-60 and youre just supposed to grind dungeons nonstop after that for exp because they turn off monster exp to stop bots. -Updates come horrifically slow like most asia ported mmorpgs. In fact its quite stupid, because they ported the game with no end game content, so basically the level cap is higher than the game content available (as i mentioned before).  -Some classes are completely useless and offer no competitive gameplay or real use  -End game is too gear dependant and rewards rich players for spending real money way too much -Many of the eidelons in the game are unatainable to normal players unwilling to spend money on cash shop -Eidelons (summons) are insanely hard to get. Like ridiculously luck dependant. You have to farm them endlessly with a small small chance of getting them as a pet. After months of play i never even got one from just pure horrible luck. Luckily, you can buy a few of them with dungeon points (ALOT of points) -Many costumes are unatainable unless willing to spend on cash shop -End game is terrible. Just plain terrible and will leave you so bored you just want to make a new char to have fun again  Summary: This game is frustrating. There are simple things that could be fixed to completely 180 the game to a better place, but they refuse to fix them. Such as PVP. I am an avid pvper in games, and the fact that I cant pvp because of rich people 1 shotting ungeared players turns me off to this game. Its not just a matter of farming for gear. You have to use the upgrade system and spend countless money to get gear good enough to survive and do damage. Unfortunately the amounts required, require having a maxed out character and spending real life cash on the cash shop, or farming like a bot for months to save. It sucks. End game is trash. Theres only 1 raid dungeon and youre dependant on overgeared players letting you run with them on 1 night a week. yes, its only open once. Also, the quests stop around level 55, so you have to grind like an idiot in dungeons the rest of the way until they port more content over. I actually quit playing last year because of this and only recently started up again because they started finally bringing the higher level quests",
            "review_score": "1"
        },
        {
            "review_text": "Seriously Awesome! lots of classes to choose from, easy gameplay and sweet anime graphics. you can make male or female of any class and there seems to be loads of different skill to choose from as you level up.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting way of bringing friends into the world of anime and a good way to kill spare time. It's a great game for people who want to try PC gaming and love MMO RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "Great game but extremly repetitive",
            "review_score": "1"
        },
        {
            "review_text": "Love it! Beautiful setting, really enjoyable gameplay and a great MMORPG overall. Recommended. Totally.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice Game! With nice people and nice animations. It's easy to level-up and the other players are always here to help!",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game and cant wait for the Scythe class with my Tachi class, best anime game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A mouse is definitley reccomended to play",
            "review_score": "1"
        },
        {
            "review_text": "I still remember the first I downloaded this game, I couldn't take my eyes off my laptop and riched level 27 in less than a week. This game is very addictive and I love everything about it: I love the soundtracks, the characters are good looking, the classes too are really nice. It's worth the download :D",
            "review_score": "1"
        },
        {
            "review_text": "great until you hit level 20. then theres a steep drop off where i felt it went from linear and gave you direction, to open and... i dunno... just kinda got bleh after that. they hold your hand so much in the begining that when they leave you to do more exploring i just dont know what to do....",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to get flocked by murderous little bunnies wearing only your underwear? Wanted to go fishing wearing only your underwear? Wanted to dig up ancient artefacts wearing only your underwear? Wanted to punch a skeleton wearing only your underwear? Wanted to punch a fallen angel thing wearing only your underwear? Wanted to run through a town wearing only your underwear? Wanted to run through SEVERAL towns wearing only your underwear? Wanted to run through a battlefield wearing only your underwear? Wanted to ride an ostrich wearing only your underwear? Create a harem? Wearing only your underwear? This is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "I love the looks and gameplay of this but for some reason it doesn't work after the entire load sequence a small white tab stays on my screen and doesn't change :( Is there a particular reason for this?   Sorry for the complaining bye...  But anyway the game looks good and is getting alot of good reviews so that must mean its a good game :)",
            "review_score": "1"
        },
        {
            "review_text": "Played for 4 hours. community in the beginning is terrible because the first part of thr game is basically a giant tutorial so nobody says anything and just follows the quests. left the tutorial and made a 3 man party. realized grinding takes forever and that quests are more efficient. no one in my party talked and i met 1 troll. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "♥ An amazing anime styled rpg mmo in th begin its a bit hard to understand but you should give it at least 10 hours and after that decide if you like it or not. ♥",
            "review_score": "1"
        },
        {
            "review_text": "this is dammit good XD ",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing here are some pro's and Con's  Pro's: Great Gameplay Lot's of MAGICKS MMO!!! Con's After an Hour of loading you are greeted with MORE LOADING! I still highly recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Very Fun I really enjoy this game ",
            "review_score": "1"
        },
        {
            "review_text": "I cancel plans to play this game... that says enough",
            "review_score": "1"
        },
        {
            "review_text": "nice game ^_^ keep up the good work ^_^ this is the game i've been looking for.. Thanks Steam ^_^",
            "review_score": "1"
        },
        {
            "review_text": "out of all evil money machine aeriagames' games, this is their best.",
            "review_score": "1"
        },
        {
            "review_text": "this is good game in mmorpg genre.. you should try guys, because this is amazing game... i never sleep if i play this game..",
            "review_score": "1"
        },
        {
            "review_text": "The game has its potencial,the combat is great ,levels are fine . The anime based characters add much to the game i personaly think that if you love anime you shoud play Aura Kingdom. ",
            "review_score": "1"
        },
        {
            "review_text": "I recommed this game for Anime fans. I watched Sword Art Online and loved Sinon. When i joined the game i made my person look just like her. Also insted of 4 or 5 classes like Wizard 101 and Pirate 101, you have 11 clases to chose from. Wich is really cool so you dont have the same classes walking around the place, you see alot of differnt classes. It is really cool. If you wach them in battle you can see all their cool techniqes ( sorry i cant really spell ) I am just saying, you should give this game a try. For now every time i clear a quest, it surpises me bc of the story.",
            "review_score": "1"
        },
        {
            "review_text": "Aura Kingdom is a dang good game. ;) I used to play a lot of MMO's back is the day but this game has got me thinking on how good I remember them even if a lot of the MMO's now a days are pay to play or just bad in general this one is pretty dang good.",
            "review_score": "1"
        },
        {
            "review_text": "i am having some trouble.wih the game,for some reason it does not go full screen.when i do,the game is in some sort of box.the middle of the screen is the entire game,and the sides are nothing but black blanks.is it my pc,or the game?pz help.i wanna paly but,i cant with the screen like that.",
            "review_score": "1"
        },
        {
            "review_text": "I love to play Aura Kingdom everyday, because this kind of game is really fun to play. But I was satisfied with the server, Is it because I'm far from the source? Im from PH, I just wanna play without problem. Thank you. :D",
            "review_score": "1"
        },
        {
            "review_text": "7/10",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "Although it is a grind-heavy game, It still has variety and runs very well on a standard P.C. Overall a great game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is perfect for people that love anime!",
            "review_score": "1"
        },
        {
            "review_text": "An epic anime mmorpg! recommend to play, it's free to play",
            "review_score": "1"
        },
        {
            "review_text": "Free to play, but like almost F2P games you'll have to end up using your credit if you dont want to spend 70 weeks upgrading your gear and getting all you need.  From level 1 to 55-60 is pretty boring, just clicking quests, auto-routes. Almost everything is automatic.  Almost every item you get by quests, daily boxes, and reweards are Non-Tradable, that is not good if you want to make money on Auctioneer.    I vote yes because i still like the game, the community is nice, i also like the fishing system and there is a mini game where you can duel cards with other people (rol cards style).   ",
            "review_score": "1"
        },
        {
            "review_text": "0/10 can't figure out how to get rabbit ears  In all seriousness, it's great!",
            "review_score": "1"
        },
        {
            "review_text": "fun game all in all, yes it falls into the usual mmo type quests but the game is still good. definitely could use a port to mac",
            "review_score": "1"
        },
        {
            "review_text": "I played already about 100h in this game before steam release, so I'd like to share some impressions:  -QUESTS (which game doesn't have them?): the main source of exp. Personally before playing Aura Kingdom I wasn't a real fan of this kind of stuff. The quests' requirements in other mmos where pretty long to achieve (kill 100 mobs, collect 60 quest items) with not that great profit; in AK the numbers are greatly reduced so you can end quests faster, you gain usually a great amount of exp and most important for me you have more a filling of making 'progress'. Also this means more quests to do (before getting bored) = more exp.  -GRINDING: you need something? go, take it. One of the most usefull things in this game, is that you can see the complete list of stuff that a mob can possibly drop, and those who are 'grinding addicted' like me, won't spend too much time to find what they need. The problem is that some items (key fragments specially) drops from unique mobs that also have a very low drop rate. About items there's something to specify: most of the items binds when equipped, so take a moment to think if you want to keep it or you want to sell it. If you tend to buy items, like usually happens in other mmos selling becomes Indispensable. Other thing is that a lot of stuff is untradeable, and if it have a tradeable version, the price will be Veeeeery high.  -PARTY: need a party for a quest or a dungeon? no problem. The party finder works like a lobby in a FPS game. P.S.: if you are a bard sometimes you even don't have to look for a party that people will ask you to join. P.P.S.: if you are a gunslinger (like me) most of the time you will be kicked without a word at least 'till lvl 45-50. ('_') . . . ..bye...(&gt;'_'),(&gt;'_'),(&gt;'_')  -PVP ARENA: 10vs10= turret defence, 50vs50= wars, and more. Every day at specific hours pvp arena opens. You can join wherever you are but be fast 'cause the queue fills up quickly. When you understand how your character works, you can start to be competitive pretty early starting from lvl 45. Most important thing to me is that, if you want to become a great pvp player, it depends only on your efforts in game. There's no Over-Powered Cash Shop weapons or armors. Cash Shop is mainly for aesthetics, and in any case they can be found in game with some effort. You can also buy in the cash shop spending Loyalty Points. LPs are awarded in game by completing quests or winning prices in pvp arena.  -DUNGEONS: kill,kill,kill,kill,KILL. Essentially those are straightline-runs where you annihilate everything you encounter with more and more bosses to defeat with the game progression. You can clean them with your skills and fill like a badass or make things harder by joining a party and transform your run in a slaughterhouse apocalypse. Here you will find more drops, more unique, more exp than normal grinding, money and stronger and stronger and stronger bosses.  This is the main stuff, the rest is up to you :)",
            "review_score": "1"
        },
        {
            "review_text": "Every good 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Its..Well. Its not bad. Its not perfect either but, its been entertaining. I played for a bit off of steam too.  Most people dont really talk when they play the game using in game chat mainly because its kinda flooded by Global 'server-wide' chats. which are basically just people 'WTF DUNGEON LVL 80+ Etc etc' or trades and stuff.  Regardless  Every single class is something unique and interesting. my favorite being the tachi :3 There are a lot of 'Fetch' quests. 'Go find this and bring it back. then goto this location adn come back' but i mean, the world is so beaityifully done its like wawowowowowowowowoowwowowooww. luv this game luv this game alot   oh, its kinda P2W. not really but like, higher level pvp, if you spend money then ofc ull have an advantage bu its not too bad",
            "review_score": "1"
        },
        {
            "review_text": "I have to say I wasn't exited to play this game when my friend recommended it, but after watching sword art online I loved this game, and I would say it's the closest game to the SAO until today, besides that the people are very friendly, the gameplay is realy good and the graphics are awsome.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game alot, but then i forgot my password to sign in (annoying mechanic) and tried to recover my password and wasnt able to for reasons i can't remember, but i still like this game, which makes me more annoyed that i cant log in =/ 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I was amazed by this. only a few hours in and I'm already immersed. It's what you would expect of an rpg without having to worry about trolls and pking. Simply marvelous!!! What makes it all the better is that it's free. 100/10 Would play.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is awesome",
            "review_score": "1"
        },
        {
            "review_text": "Good idea and game play, but annoying to navigate and hard to find npcs to complete quests",
            "review_score": "1"
        },
        {
            "review_text": "Game is exetremly good. They have ten classes already and I can gurantee you'll like atleast one. The combat is so swift, unlike other mmo's. Also the game is actually quite challenging. I reccomend tis to everyone on steam.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. I really love that it's simple and cute, though the screen clutter nearly turned me away from the game. It takes quite a bit of editting to make it semi decent.",
            "review_score": "1"
        },
        {
            "review_text": "after the newest update the game will continue to crash after i select the option to connect to a server im not sure why it is doing that but it really needs to be fixed...",
            "review_score": "1"
        },
        {
            "review_text": "Good game,but boring without friends.",
            "review_score": "1"
        },
        {
            "review_text": "pretty good game. too much activity in the towns for me as usual though -_- i don't like games that go under 30fps. which is not often to see on my machine.",
            "review_score": "1"
        },
        {
            "review_text": "This game also know as Innocent World(Japan) and Fantasy Frontier. Developed by X-Legend, Taiwan.   Pros  -Anime graphics which attractive enough.  -Girl costumes are good. However, still not so many costumes compare to Japanese versions, which have anime costume like Date A Live.  -And can dye them, made them look difference.  -Easy to play, good for wasting time without stress from the head shot in CS:GO.    Cons  -A lots of bots run around on low level maps.  -Gold selling and spamming on the in-game mail box.  -Boring grinding system with timing constrains.  -Some disconnected problem, occurred when change maps, especially to Navea.  -Auto run and stuck.    More information.  This game is a short-life game if compare to those of Guild War 2.  I mean the developer will leave this game and go to develop a new game which similar to this (Astral Realm), and this game shall die...  However, they still add more achievement, Eidolon (pokemon), weapon upgrade systems, etc. to the game.    In summary, better wait for Astral Realm.",
            "review_score": "1"
        },
        {
            "review_text": "This is a funny and enjoynable game but...it is ...hmm...to easy...",
            "review_score": "1"
        },
        {
            "review_text": "the pros is the graphic is nice,the gliding stuff is fun XD,and i like the gameplay the cons is so hard to leveling when you reach 60,and too many annoying people who use bot  but i recommend this game 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Aura Kingdom level 1-30 (A review of the first ten hours,considering most players will not go beyond that)  Pros -Charm: Charm is often the deciding factor between a good and bad game, as it is charm is what causes you to adore the characters and the world and want to come back for more, something i feel Aura kingdom posseses.  -Stunning graphics/art style- the game looks bright and beautiful on my lowish- end pc, and the charming cartoony art style is one thing that makes the game. (better than the average mmo and vastly better than most of theese next gen titles with there 'realistic' graphics/style - an art style i feel is incredibly overused and am getting very sick of) -Nice Soundtrack (slightly cheap instrument presets but it is well composed) -Charming Story with resonable variety. Sure, most of the time its not exactly a emotional rollercoaster, but i enjoy its diversity and charm. Theres supply missions, Combat missions, instances,sneak missions and missions to play as other characters. Hidden quests and board quests are actually rewarding unlike many mmos as you can get cool costume items and rare misc items that cost quite a bit from the loyalty shop. -A resonable Free 2 Play Model, everything can be bought through in game currency and there seems to be few restrictions on area and quest access, unlike most f2p mmos. Of course paying real money gets you the cool stuff quick but they gotta make money somehow. -lots of cool little features unique to this mmo such as being able to glide and jump really high from the start, custom guild logos, cinematic finisher moves, hidden quests and so on. -No grinding up levels to complete the main quest (at least in the first 10 hours) which is a nice change from some mmos where you can have to level up 10 levels just to continue the main story. -the variety of costumes and hats, though hard to get, make customization fun. -The decision to opt for text based dialogue is actually a plus for me because i much prefer it to the terrible voice acting i have heard in other mmos such as WildStar. -Game is around a year old and still updated -There are a couple of big servers which have nice populations, which a nice change from the many mmos that are now like ghost towns such as LOTRO. -Steam Trading cards - reminds many players including me of our favorite fantasy animes such as Sword art online (though it is still very different to most of these)  Cons -really cheesy romance system where you can go round kissing random people on the server and giving them chocolate -Lots of unnecesary ♥♥♥♥♥♥ clothing, along with characters and companions designed to attract horny male teenagers which are completely unnecesary, and some really cringy loading screens and npcs which seem to almost promote Paedophilia. -Newer updates have led to significant latency issues even with a good internet connection and fastish pc -Awkard camera and silly control system (luckily the control system can be changed but the camera still irritates me) -Huge array of graphical and general glitches aka getting stuck in walls, missing dialogue from conversations, blurry faces, Characters who you cannot speak to and so on (hopefully they will be fixed in time) -A huge array of irritating trade bots which jam up chat. -And my biggest criticism of the game: The same character models for human npcs are used over and over again. Most mmos manage to vary vary the colour of the clothes, the hair and so on and the different combinations mean few npcs who arent enemies are replicas, yet Aura kingdom seems to have this at a minimum, meaning that sometimes when you go into a different town you just feel like your speaking to the same people again. -minimal pvp options -many features are locked untill lvl 30 -Aeria games have a reputation for ruining good games, however they have not ruined Aura Kingdom so far.  So overall i would strongly recommend downloading Aura kingdom and playing it for at least a couple of hours, and if you dont like it, well no money has been wasted. Sure its flawed, but in my opinion the charm and great content shines through it. This is the first 2014/2015 game which hasnt been a dissapointement to me.  8.8/10 Great.",
            "review_score": "1"
        },
        {
            "review_text": "8/10 Stars  I try to be unbiased when writing reviews for games around here in STEAM especially because this is where I can tell people if the game is great or not. Well, in my opinion this game is worth the check. The game has a lot of places to explore and a fairly large player base of RPGMMO players who love the game. When I started out I had no clue what to do or what to expect. So I kindly asked around for help and guidance and man did I get the best community treatment Ive had yet. The players welcomed me with open arms and attended to my needs. When I had problems with quests or overall the game itself the people were kind enough to join my party and help out in my quest even though they had better things to do. The player base in this game is really amazing and kind from my experience and Ive got to give them credit for that, because if a game like this has a kind player base that tends to help other players who just started out then sign me up! It sure beats the Xbox Live community of 8 year olds screaming '360 NO SCOPE!!!' at the top of their lungs whenever I hit a trickshot and then calls me a hacker -_-  So you might be wondering about the overall gameplay mechanics and core gameplay right? Well here is my initial reaction to it. For the gameplay I found the settings to be 'Tweakable' this means that you can basically move things like the move counters, character health bar, Quest Box, Item Box, ETC in a way so that it wont hinder you or stop you from seeing the amazing scenery that this anime-ish MMORPG successfully shows you. Moving on to the core gameplay I found that the experience is what you would find in any MMORPGs nowadays. I admit its pretty generic due to the fact that you are called a 'Hero' and you must find your true purpose is kind of already played out since about a million other people have been told the same, but lets move on with our lives and forget the fact that you arent special in this game. The maps are well designed and the monster AI is intuitive at most. In fact I can say that the monsters or enemies in this game are pretty well balanced and are reactive to the players attacks. Therefore this game brings out what it promised at most which is a anime-ish MMORPG aimed at people like me who want to play something that resembles a JRPG but without all the complicated add ons that World Of Warcraft has. Plus, this game is literally FREE so yeah...I gave my wallet some relief there.  BUT! we all know there is a flaw for every game ever made. For Aura Kingdom I think its pretty clear that the pros of this game is pretty visible. It has the fancy graphics, textures, and plot to draw any anime fan or a RPG fan in the mix while maintaining a simple and easy to use interface that almost everyone can use. However, the flaws in my opinion is the latency issues that occur when you havent logged on for a while or if you have a weak connection. When having a weak connection you get a lot of un-rendered textures and areas in the map that doesnt even show up. Also, I should point out that even if this game has a large player base that is supportive and tending to others there is also a majority of people who are not too kind and are almost annoying to deal with. Not only that sometimes quests can be a hassle because sometimes there is no one willing to join your party due to the fact that they have problems of their own, this being due to the fact that there are literally a ton of people who are above the level of a beginner so the beginners have to seek other beginners in order to form parties and complete quests. And finally, the social interface. I think it should be approved upon due to it being a hassle to add people you meet, be it they joined your party or they want you to join theirs. The fact that you have to type in someone's name in order to even send them a request is but an annoyance and a waste of game time. Would you really want to type out 'xXMLGquickscoper420blazeXx' to your search bar and then click 'Send Friend Request' everytime you want to add a new player to your ever growing list of companions and pals online! HELL NO! That is the thing that annoys me the most in this game....the overly complicated social interface...They got everything right on simple gameplay mechanics and amazing design of the game overall but the social comms are all way to messed up and complicated.   Anyways I hope you guys enjoyed this review and if you wouldnt mind please check out my profile for a youtube link for my channel where I do game reviews but with the use of my voice, I also do cosplay(occasionallty), and overall gaming content. Hope you guys have a fun time in Aura Kingdom and I wish you all good luck and happy fortune!",
            "review_score": "1"
        },
        {
            "review_text": "Its Fun!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good, many classes to choose from each with their own different playstyle, and Customisation of these classes makes infinite Possibilities",
            "review_score": "1"
        },
        {
            "review_text": "One of the best free to play mmo's on steam but it is only on PC 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Love this game!!!!!! It's so much fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "Really Good anime MMO...",
            "review_score": "1"
        },
        {
            "review_text": "really sad that they cater to the ♥♥♥♥IN BOTS  they dont do ♥♥♥♥ against botting, GM needs to monitor zones a lot better  pain in the ♥♥♥ to quest when there are botters taking every kill   first time buyres honest people purchase ap and have to ♥♥♥♥ing wait to for ap to be loaded  developers need to pull their heads out of their asses and fix the gold seller issue, and cater more to the honest people  ",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game because you can customize in an epic way. It's easy to level up, and they have tons of quests. however as a first time buyer i was dissapointed because i spent 1000AP for a weapon and a few clothes, but i only got the weapon and the clothes were nowhere to be found.I clicked the items in the cart then everything went on the inventory, then i right-clicked the item knowing i would wear them but to my dissapoinment and shock, it was gone :( please help me. Someone please explain. I already sent a mail in AG. it's been 2 days. please consider this message.   This game is highly recommended even though I am encountering this problem. I hope AG fix this. please :))",
            "review_score": "1"
        },
        {
            "review_text": "Played this game before it came to Steam, it was a really good MMORPG game if you don't mind the game was a little bit too easy (Just click and it will be done). ",
            "review_score": "1"
        },
        {
            "review_text": "All those cute outfits are making me have bad equipment couse i'm broke 24/7 in this game.... 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Really nice Game! With nice people and nice animations. It's easy to level-up and the other players are always here to help!",
            "review_score": "1"
        },
        {
            "review_text": "You Should Be Play This Game Wahahaha!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "World of Warcraft + Dragon Nest + Ragnarok = Aura Kingdom :3  It's Cool, :3 Play and Have fun",
            "review_score": "1"
        },
        {
            "review_text": "I am some how addicted to this game. The colors and style of the game is very nice.   I have played this game for many hours now, and it does not seem to be a pay to win game so far in my experience. Alot of grinding , but you get that with these types of games.  ",
            "review_score": "1"
        },
        {
            "review_text": "Aura kingdom is a great MMORPG that is full of adventures. The games variety of classes, bosses and characters make it a great gamewith lots of choices to be made. The game focuses over story and quests more than grinding your way to high levels and good stats.  The major down side of this game, in my opinion, would be that there is no way you, and your friend, can venture through this massive world, limiting you to only being a loner in a giant world.  However the game is still brilliant, with lots of fun to have!",
            "review_score": "1"
        },
        {
            "review_text": "A mouse is definitley reccomended to play",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty exemplary as far as anime mmorpgs go. If you are a fan of the genre previously, this will likely click with you write away. The UI is intelligent, there are some well thought out features. It has both an auto potion drinking system, and pathing. You can glide after level 10 and fly around. Lastly the stats/skills are extremely simple so you spend less time worrying about your toon and more time in gratifying flashy combat. Worth a try!",
            "review_score": "1"
        },
        {
            "review_text": "Aura Kingdom is a game that lives up to its expectations very well. Myself beong a gamer that really enjoys RPG's such as games like this i found it quite an enjoyable experience. The game has alot of different aspects to make it an enjoyable game such as beautiful open world and environments, an absolutely huge variety of quests, an enthralling combat system and alot of re-playability because of the number of classes you are able to choose from. The classes are all very detailed and each have their own set of interesting skills for example my first two playthroughs i used the dual-weild and grimoire ( mage ) classes and found huge differences in the melee and ranged combat and both work perfectly together and on their own. In all this is one of the best RPG's I have found on steam to date. If you ever find yourself looking for an MMORPG this is at the top of my list of reccomendations  ",
            "review_score": "1"
        },
        {
            "review_text": "If you like anime and video games then just play it, this game does the combat really well and it can be enjoyable as long as you haven't seen everything.",
            "review_score": "1"
        },
        {
            "review_text": "totaly ♥♥♥♥t upp game butt fun",
            "review_score": "1"
        },
        {
            "review_text": "Lovely anime art style, though not terribly challenging gameplay. Great for people new to MMORPG's.",
            "review_score": "1"
        },
        {
            "review_text": "it is ok..not to bad but the graphic is quite decent.",
            "review_score": "1"
        },
        {
            "review_text": "Very good mmorpg, Simple enough with a good level/skill tree aswel, Only problem is its quite hard to actually get into the game ie. Join the correct server as your friends are in, make a character (There are many classes, but not great descriptions for each) ",
            "review_score": "1"
        },
        {
            "review_text": "this game on mac. it would be great :)",
            "review_score": "1"
        },
        {
            "review_text": "good game for anime lover",
            "review_score": "1"
        },
        {
            "review_text": "Best game I have ever played recommed 10/10 5/5 9/11",
            "review_score": "1"
        },
        {
            "review_text": "nice game and very cool",
            "review_score": "1"
        },
        {
            "review_text": "I cant describe this game in mere words so get in there and experience it for yourself!",
            "review_score": "1"
        },
        {
            "review_text": "to be honest aura kingdom was pretty good but now i wanna kill a turtle because i cant reset my secondary password (which is there because?) I gotta make a transaction and im a poorfag so that aint happening ufguhdfugidhfugi aeria why? 10/10 GOOD GAME THO  animu makes me hapi",
            "review_score": "1"
        },
        {
            "review_text": "very fun game time consuming but thats what a mmorpg is for luck based on the gear just like other mmos lots of diffrent classes i highly recommend the game",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, and similar to the Ragnarok Online 2 MMO IMO. ^.^",
            "review_score": "1"
        },
        {
            "review_text": "hmm.. just play :D",
            "review_score": "1"
        },
        {
            "review_text": "totaly ♥♥♥♥t upp game butt fun",
            "review_score": "1"
        },
        {
            "review_text": "Review made 11/29/2015  Very generic anime themepark MMORPG. Just the way I liked it, but so sad that this game is dying. I'll just recommend this game even though the playerbase is steadilly depleting. Lemme give some pros and cons.  pros - Anime theme (it really appeals to a lot of ppl) - Generic MMO Gameplay (because this makes the game idiot proof and easy to just get hooked) - The game is quite easy. (this is a pro to me. Not everyone has time to learn all the little complexities of a game) - Not a 100% Pay2Win. Non cash charging players just need more luck and time.  cons - Generic MMO Gameplay (because people are also looking for something unique) - Grindfest (cuz that's how generic asian MMO's are) - Swarmed with bots ( god damn gold farmers man) - Very much gear based. - Laggy servers (wasn't like this back then) - Dying playerbase - Dated Graphics - etc.  The cons outweighs the pros, but I personally enjoyed it. Do I really recommend this game at its current state? No. Why did I still recommend it? Because I believe a good game that's dying is still worth giving a chance even just a little bit.",
            "review_score": "1"
        },
        {
            "review_text": "Dont Play Weed MMO'S",
            "review_score": "1"
        },
        {
            "review_text": "Great game   --But to many bots i dont understand why they didnt resolve it ,   for example you can add some chapta for 15 mnt / 10 mnt / 5 mnt like aura kingdom private do   well maybe they need to make some arregment with Devloper in Taiwan  --Broken economic   like weapon bealdor first realese it have price 40KG-50KG but after month it drop until 20k    But i dont know why i love this game and i playing private to just search this game and add .to in the end",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Heres some prod and cons: +good story +good graphics +many classes +good Eidilon system +can make combos and look cool +many hidden quests +many systems to manage ( could be a bad thing, I personally like it ) +big expansive map, many things to interact with +Npc players who look like real players but are not, they just fight in the forest and stuff, but help you as well. +reminds me of tales of +cute girls :3 +fun coop style +guild and stuff like that +relatively cheap items, dont need like 100000 hours of farm +quest tracker, it guide you so you wont get lost  Cons: -introduction does not include how the item mall works -costumes in ap are overpriced and 399 ap gets u one OUT of a set, some dosent even include the costume -camera. -controls very inconvinient, hard to play properly unless used to it -does not support mouse keys (mb4,5,6,etc) -not good for those with bad and low graphics coms -many bugs ( yes, they will fix it, but not yet ) -no voice acting ( i know, if everyone had a voice it would be too expensive, but the main chars at least? -farming dosent give much exp, only quests -melee champions attacking at ranged??? -abit confusing at start -slow reacting server, or it's just my internet ( 500mbps ) -bit wonky combat system, but its definitely still good and playable -not many updates, cos the company had other projects, but still, there are Overall, good game, an improvement over their last one, but definitely not their best. Gave me many hours of gameplay on my other acc and u can GET NEKOS gg 69/420 ",
            "review_score": "1"
        },
        {
            "review_text": "Great game   --But to many bots i dont understand why they didnt resolve it ,   for example you can add some chapta for 15 mnt / 10 mnt / 5 mnt like aura kingdom private do   well maybe they need to make some arregment with Devloper in Taiwan  --Broken economic   like weapon bealdor first realese it have price 40KG-50KG but after month it drop until 20k    But i dont know why i love this game and i playing private to just search this game and add .to in the end",
            "review_score": "1"
        },
        {
            "review_text": "Great game to be honest with you :) it's like sword art online, but you can't log out in SAO, here you can't log in at times x)   The PvE is great and also the PvP but pretty much a pay2win game, which can be clearly seen on PvP.",
            "review_score": "1"
        },
        {
            "review_text": "Not my prefered game style but i've been enjoying every second of this game so far! The animation part is AWESOME and very well made The missions are good and don't increase in dificulty/level very fast The Fighting is more interesting than other mmorpg games (in my opinion) Just an over all well made game to enjoy! :)",
            "review_score": "1"
        },
        {
            "review_text": "kinda laggy but maybe its just my computer, good game tho",
            "review_score": "1"
        },
        {
            "review_text": "It's probably one of the best free to play MMO's i've played in awhile, I wish the eidolons were easier to obtain, but it doesn't really force you to pay to advance like i've seen many MMO's have done. It's also very pretty. But I will admit bot have been a problem, but my last few times playing the problem doesn't seem quite as bad.",
            "review_score": "1"
        },
        {
            "review_text": "8/10 It is a grind, an easy grind, just able to button smash and land your way into victory. Honestly I just had to stop playing this game, 3 hours I felt like I was a slave to a virtual world doing nothing truly rewarding with no satisfaction.  Was looking for something fun to play with the fiance` but we didn't even have fun with it at all.  Solid game otherwise, pretty laggy though even with a good computer.",
            "review_score": "1"
        },
        {
            "review_text": "Fun but unless grinding until lv60 then you can have fun playing in the skytower. The vanities needs to be played or else need to wait till lv60 to get the drops which is really cancer. Gets boring when reaching lv40.",
            "review_score": "1"
        },
        {
            "review_text": "Great game and pvp",
            "review_score": "1"
        },
        {
            "review_text": "Nice little anime rpg that's like Sword Art Online. The game has alot of classes and you can even make a subclass for your character, you also get this companion called a Eidolon's and they all have different abilities from buffs to attacks.  10/10 I can make my own Sword Art Online character! ^-^",
            "review_score": "1"
        },
        {
            "review_text": "This game is epic and just awesome!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! #TOOMUCHEXCLAMATIONMARKS ",
            "review_score": "1"
        },
        {
            "review_text": "Seems like a decent enough free 2 play RPG. Interface is a little annoying and the controls can suck a fat one but all in all not too bad. You could certainly do worse (Cabal Online)",
            "review_score": "1"
        },
        {
            "review_text": "Reasons to give this game a try:  &gt; Interesting storyline.. (as long as you read the quests xD) &gt; Easy to understand UI &gt; Tutorials for beginners  &gt; Great community! You'll meet plenty of fun people there~ &gt; Not so much of a p2w game :D &gt; Have both Kawaii and Cool looking characters &gt; An enjoyable game be it playing with friend or going solo!  Have fun :)",
            "review_score": "1"
        },
        {
            "review_text": "The game is awesome you can find many friendly players, great guilds. I have 500-600+ hours in the game not only in steam but i had to stop playing because i got to addicted. In the game i met awesome people and had a great time this game forever will have a place in my heart. The only problem is the bots it's filled with them if you ignore that you can have a great time.",
            "review_score": "1"
        },
        {
            "review_text": "  This game surprised me. It's much better than I thought it would be. If you enjoy anime style games don't hesitate to play this game. Don't let the Aeria name fool you, it's quite good.  Pros:   Totally F2P. No requirements Lots of classes Graphics are unique and really nice. Colorful anime world If you like the Final Fantasy theme then you will like this game Lively action combat system No shortage of things to do in the game Nice quest system  Cons:   Would rather it be open world (personal preference) Needs voice acting Anime may be a turn off for some ",
            "review_score": "1"
        },
        {
            "review_text": "I played this game. Then it came on Steam, that made me lose all my ♥♥♥♥, still a good game though. I 100% recommend this!",
            "review_score": "1"
        },
        {
            "review_text": "its a nice game",
            "review_score": "1"
        },
        {
            "review_text": "this game so awesome",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting game... I gotta admit, even if you play alone, its not boring... 10/10 will solo player again in my next character... also 10/10 will kirito again... (Im a trash xD)",
            "review_score": "1"
        },
        {
            "review_text": "its nice",
            "review_score": "1"
        },
        {
            "review_text": "I was really into this game when I first got it, as it has the least pay to win i've seen in a free MMORPG, and sure the quests can get stale, but most of the quests are more for optional grinding purposes anyways. The classes and such are fun to use, and you really feel like you're accomplishing something when you level up and get new skills. Keep in mind when playing that this game is a casual MMO, so don't go into it with a very competetive mindset or you'll get kinda blown out, it's a nice game to pass the time, and record your online progress.",
            "review_score": "1"
        },
        {
            "review_text": "  It would be a great game ya know if i wouldn't stop getting a pop up of a blonde girl with a blank text box that i can type in that has a send button. I'm sure it's the help box but I CAN'T TYPE ANYTHING IF I DON'T KNOW WHAT THE ERROR IS.",
            "review_score": "1"
        },
        {
            "review_text": "I noticed a few reviews claimed accounts were deleted for inactivity. I just wanted to point out that I hadn't played since the game came out but decided to give it a go again. I ended up having to contact support because I couldn't remember my secondary password. They contacted me in six hours and reset the password as well as informed me all my characters were still present after all this time. Maybe other players experience is different but for well over a year I hadn't even touched the game and my account was still entirely intact.",
            "review_score": "1"
        },
        {
            "review_text": "nice game ^_^ keep up the good work ^_^ this is the game i've been looking for.. Thanks Steam ^_^",
            "review_score": "1"
        },
        {
            "review_text": "i Truly had fun playing this one.....give it a try =)",
            "review_score": "1"
        },
        {
            "review_text": "This game is really cool and i love it a lot.",
            "review_score": "1"
        },
        {
            "review_text": "a game worth playing and pass your time!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, fun to play. highly recommend giving it a chance.",
            "review_score": "1"
        },
        {
            "review_text": "I personally enjoy this game.  Yes, I enjoyed it as it locked me out of my very high level character.  Yes, I adored it when I had to grind all over again.  And yep, I still love it even when I literally have to start all over again.  10/10.  Just... Try not to lock me out this time, k? I like grinding, but this is just ridiculous amounts of grinding.",
            "review_score": "1"
        },
        {
            "review_text": "Got permanently banned for nothing. These developers are scum, even after providing all the account recovery information they wouldn't help me. There is a special place in Dante's Inferno for people like these.   I loved the game and will officially never support another Aeria game, period.",
            "review_score": "-1"
        },
        {
            "review_text": "I got banned for no reason. I played for a while and then I got to occupied to play. I tried to log back in and saw my account was blocked. Even my aeria games account is blocked (which I have had for years) making it imposable to try and fix the problem. And making a support ticket was no good because I was stonewalled. It was a good game but the publisher has done F'ed up and I see I'm not the only one. Being banned for no reason this is a first and against the user contract we all agreed to.",
            "review_score": "-1"
        },
        {
            "review_text": "This was a fantastic game when my Friend and I started playing it. After a while the missions become 'Be level X to do this' Four mission later 'Be level X to do this' It's great fun for the beginning but then you realize that you're just doing the same thing over and over again.",
            "review_score": "-1"
        },
        {
            "review_text": "So i went to logh in after not having played in months and what do i find? I cant even use my password to log in. No, i have to use some number based secondary password. Of course i dont remember it and click i forgot. Where does it take me? Not to a reset password page like any other normal user friendly game. No. It takes me to the main website, so i had to search around and eventually had to even google where to reset it. Where was that? Submit a ticket and wait up to 48 hours for a response. No kidding. So after wasting my time downloading it i couldnt even log in. I told them to delete my account, its not even a good game hence why i had only played for a half hour previously anyways. So much for second chances",
            "review_score": "-1"
        },
        {
            "review_text": " How Kujo Not Recommend 'Aura Kingdom'?  --  (My playthrough consisted of solely the bard class)  It's only fun for so long. The combat's servicable enough except there's no strategy in regards positioning in any class not focused with ranged attacks. When executing an ability it locks you in place (or into the animation) until it's finished, with only being able to auto-attack while moving. Many of the quests you'll be doing consist of clicking on the objective to set a path you can auto-follow to just talk to NPCs, which is where more than half of your experience comes from, instead of quests oriented with combat. In a bizzare mechanic about the game I noted, gliding to objectives was actually faster than using mounts, even though it's not automatic. When you hit Level 35, which will take roughly 15 hours, and have access to trading there's no real incentive to truding to higher levels aside from the class progression.  The soundtrack has one or two songs that stand out whilst the other's fufill their purpose, and the game fairs well enough graphically. The community's rather friendly and the customer support was relatively quickly when I needed my pass code to be reset, but I've had no experience with the paid aspect of the game. I suggest a title like Dragon's Nest instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Edited for 2016  I received an e-mail about losing my character if I don't log in 11 days ago and saw it 5 days ago. The message said that my inactive characters will be deleted on 1st of September if I don't log in and ask support to restore my hidden characters (just imagine not being able to read an 'offer' categoried gmail like this in 5 days).  I contacted support and asked them to unhide both of my characters, but they only managed to restore the one with less progress overall. I thought it was fine because of the character being somewhat low level so I decided to try and continue playing the game.  I noticed that every time the game loaded something, I'd get this 'choppy' lag with every setting even though my computer is capable of running the game with highest settings (and could do so before this update). Now I can't play the game without choppy lag, so I'm uninstalling it.          YouTube™ Video:  Aura kingdom FPS lag&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "My account was banned for some ungodly reason yet they still felt it was okay to take money for a game I could no longer play. This is absolutely inexcusable and totally ridiculous. Where do you get off as a publisher thinking this is okay? Aeria games, you are a disgrace to honest game publishers and developers everywhere. It's disgusting that publishers like you still exist in these modern times that still exploit players and then shed a blanket of ignorance over yourselves. These are YOUR games, these are YOUR responsibility! If something happens with an account do you not think it would be wise to notify the player of the problem, and then maybe I don't know, STOP taking their money? Where does it make sense to decide that you no longer want a player in your community but it's still okay for said player to continue making payments to your asinine company and you continue to profit? What service are you exactly providing to that individual? Or are you just so godly that you think you deserve recompense for some imagined slight? You are disgusting and I will make sure to notify everyone and anyone of your underhanded tactics and exploitations of your playerbase. Thank you Aeria Games for being a shining example of everything wrong with the gaming world and FTP companies today. Thank you for setting back the evolution of the FTP model, and not progressing towards a more streamlined and player friendly model. May god have mercy on your despicable souls...  I'm out. Jayce  PS: Your welcome for all the free money.",
            "review_score": "-1"
        },
        {
            "review_text": "Aeria Games and this model of doing business is not even P2W anymore, it's simply put a fraud.",
            "review_score": "-1"
        },
        {
            "review_text": "Best game pay to win ever. I just came back 3/4 days ago and now i saw a event i think: *Redeem code for Welcome back.*  I never got the code and i just downloaded this Aura kingdom from steam for the dlc winter pack and to get the title of 'Aura kingdom' in steam.   So, just check. This game has a event and is not f2p. it just buy to get it.  That is the event.   so now. Every sh*t so super expansive into the game. in-game I don't know how to get gold and the story is great but ends at lv60. The game updated to lv80 and experience rate sucks.  I have almost 9 month with lv60 and now i do not know how the hell get more exp / gold without buy AP I pass more than 6 hours only fishing, I don't have a loooot of gold cuz the rate sux a lot.   I'm starting to hate this game.    I'm just killing time and waiting for Blade &amp; Soul European/North American that come in this Fall.       I hate Aeria in general, that company sucks ♥♥♥♥.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Played until 52 Guardian, and i cannot recommend it...  Level 1-40 is easy they want to make the game look fun so you spend money you can do that levels within 5-6 hours if you really want it, after leve 40 it will take you 1 or 2 hours per level from now on, the bard is so powerful in that game that in dungeons there is no tank required ust for information if you try, and bards are pretty rare.  Once you hit level 50 you can do 'pvp' and whatever you see on youtube according to pvp is not like it is now maybe pvp was fun at release time but ppl now have so uber gear that you have no chance you die before you can cast 1 skill if you survive 5 Seconds youre pro but as a guard with all defense skills which make me invulnerable in pve im still a onehit, with upgradet gear im still a onehit its not fun. Ive seen really BAD pvp but this is the worst concept ever, if you still want to do it you have to farm for weeks some coins to get pvp equip that will reduce the player dmg for about 25% well, its your choice if you want to waste your time here. greets",
            "review_score": "-1"
        },
        {
            "review_text": "Take this as a neutral recommendation just wavering on the no side. This game will ruin your life. But it's still good so ♥♥♥♥ it.",
            "review_score": "-1"
        },
        {
            "review_text": "I almost became a weeb so i had to uninstall",
            "review_score": "-1"
        },
        {
            "review_text": "After waiting almost an hour for this game to finish installing. I was faced with this 2nd password BS were the numbers switch each time you enter your password after using the forgot password button it led me to there website which led me to a link to reset my password. it then said access denied. after googleing for answers, there was no solution. I then calmed myself down and grabbed a muller corner. but on the positive side, the uninstall worked fine. 11/10 would waste my time again.",
            "review_score": "-1"
        },
        {
            "review_text": "Well my playtime says it all..... Literally after a level up a couple times, I stand there idle so I can use the bathroom or get some food and then my computer bluescreens. Only when I play this game. Doesn't happen with anything else... just this one. I only have one character and I am level 5.... If this game can't be trusted on my computer, I do not recommend it to anyone else.",
            "review_score": "-1"
        },
        {
            "review_text": "It's absolutely NO!",
            "review_score": "-1"
        },
        {
            "review_text": "Quest Bar Simulator 2014 - Alright game, didn't really do much at all. Everything was done for me due to massive babysitting syndrome by the game.  I rate 9/11.",
            "review_score": "-1"
        },
        {
            "review_text": "Took me 15 minutes to get the options adjusted. especially that the sound started out muted, so had to exit game and restart, as the options are only accessable from the launcher?  Once in game, there was only one race available (despite the cutscene shortly after intro quest showing other nonhuman races. Though there were many classes, there was no showcasing of their roles beyond a 3-star rating of things like attack, defense, single target, area damage, healing, &amp; support. The intro is one that's been done before in a lot of games i've played were you get a few battles with your class at an absurd power level. SAdly in this game, it's just beefed up numbers, you don't get to play with advanced skills or anything, just the 2 starting abilities for the class i picked.  Oh yeah, it's also packed with horridly obnoxious tutorial overlays that don't go away until you actually DO the thing they tell you to... and then they show up again to remind you to do that thing that way even after you've gotten rid of them once. and they flash too. This intro only BARELY covers game mechanics too.  I'd rather play a game that throws you into it with no turorial, or a tutorial that's a full on hand-hold through ALL the game mechanics.  The UI is horrendously clunky, and i didn't get the feelgin that character would stand out. Walking aroudn the starting town, i was presented with both quests and 'eavesdropping' spots. Where normalyl quests and their turnin places are yellow or gold or such, in this the actual quest indicators are silver, and the 'stand here and see NPCs talking' parts are gold.  i know every MMO out there is all about the 'endgame content' though, and that means they all suffer from the start of the stories and game getting little to no attention.",
            "review_score": "-1"
        },
        {
            "review_text": "dont freakin play this lmao",
            "review_score": "-1"
        },
        {
            "review_text": "Good luck with those buggy quests",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible, its boring looks bad and i just cant stand it. Only good thing is the high fps, haha.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a bit iffy on this one, to be honest. Overall, it's a nice enough little game - the graphics are pretty (particularly once you figure out how to get them scaled back from 640x480 pixels) and the story, while linear as all get-out, is pretty easy to follow. The community, such as I could see of it (bearing in mind I'm an Australian in time zone GMT+8, so I'm effectively about 8 hours out of synch with most of the English-speaking world) seemed friendly enough. It's an MMO you can just as easily play solo - while there are some parts where you need to be part of a group, they're not compulsory.   All that said, it has one big problem - botting. If you go into the game, you will see a lot of characters who look remarkably similar - all male, all wearing the first face, first hairstyle, and first hair colour (in other words, short purple hair) and all Grenadiers. They'll all have the same guardian spirit (usually Sigrun, after about level 25) and they'll turn up at certain spots  en masse . Their names will be random strings of characters, because they're bots. If you happen to be trying to level in a spot which has been botted, you're going to find yourself struggling to find the mob you're supposed to be killing, or the item you're supposed to be looking for, or the character you're supposed to be escorting, because the bots are there knee deep, and all you can do is wait for them to move on, and hope everything re-spawns before the next bot wave comes through.  The game also suffers from what appears to be a common problem to many MMO games - a single spawn point, a single storyline, and as a result the whole thing gets incredibly boring when you're running through the whole thing again in order to try out a different character class (really, though, the only MMOs I've run across which don't have this problem are World of Warcraft, and to a lesser extent, Dark Age of Camelot and City of Heroes). This is only exacerbated by the highly linear storyline, which doesn't have many side quests available.  Plus, of course, there's the standard anime problem of what the female characters are almost wearing. One day a game design company is going to realise approximately 50% of the world's population isn't overwhelmingly interested in looking at characters with improbably bouncy breasts (either because breasts just don't do it for them, or because they have a set of breasts themselves, or both) and they're going to realise there's an un-tapped market for eye-candy just waiting to be exploited. The designers of this game have got part of the way there - the male character models are very pretty, very bishie, and very cute to look at. But quite frankly, when the female version of an outfit regularly comes to a packet of dental floss, three sequins and a cork (you figure out where each goes) while the male version of the same outfit covers the character from chin to toes, it gets a bit annoying. Speak to the designers at Square Enix, for crying out loud - they at least accept there are more people playing games out there than just heterosexual men, and they provide some eye candy for the gay men and heterosexual women as well!  Really, it isn't a bad game. But then again, it doesn't really stand out in my mind as particularly good either. If Steam had an option for 'eeeehhhh...' I'd probably choose that. But as it stands, it's getting approximately 4.99/10, and voted down.",
            "review_score": "-1"
        },
        {
            "review_text": "the game lack's story and is a bit full of standart story cliche's the UI is just generaly confusing, and the game also set's and exampel and mood that it would be okay, to harm 'inocent' critter's and fairytale creature's for no better reason then these being anoying,  the grappic's look good but asside from appearance im not sure there is much els in this game that we havent had or seen before whit so manny other's",
            "review_score": "-1"
        },
        {
            "review_text": "can't log in just like some of the other games steam as to offer",
            "review_score": "-1"
        },
        {
            "review_text": "Pros~ -Nice community -Very Animuu -Double jumps &lt;3 -Flying/Gliding &lt;3 &lt;3  -Veriii unique designs -Combat animation was amazing -Them anime hairstyles -Cool classes  Cons~ -Gets very boring very quickly -The story was very weird and it wasn't intriguing at all -The controls are weird -Very limited customization -Bad grafics -It lagged sometimes &gt;.&lt;  The cons are too great in this one, not ever the double jumps/flying could save this one ;-; I wouldn't recommend it too anyone  ",
            "review_score": "-1"
        },
        {
            "review_text": "Was instantly bored. Game seems colorful but not my thing. More races and customization options would have likely kept me playing longer than 15 min.",
            "review_score": "-1"
        },
        {
            "review_text": "Combat is Clunky and slow, not a reall action MMO",
            "review_score": "-1"
        },
        {
            "review_text": "pretty good 3/5",
            "review_score": "-1"
        },
        {
            "review_text": "&gt;F2P &gt;One of the main Quests wants you to buy an item from the cash shop &gt;notf2p.png &gt;Logs off Aura Kingdom &gt;Downloads TERA &gt;Profit",
            "review_score": "-1"
        },
        {
            "review_text": "The graphics are strange.",
            "review_score": "-1"
        },
        {
            "review_text": "I click the quest to have the game go there. I click an enemy and mash the number keys to have the game fight enemies. I listen to awful dialogue and then have the game collect stuff/kill stuff.  In this game, you click things and then watch stuff happen. It gets boring almost instantly and I urge you to do something better with your life. Like stare at a wall. Or sleep. Or literally anything else.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not bother with this game if you are not going to play it on a regular basis! Areia Games will block your account for no reason and never let you play again! You have been warned!  These idiots have introduced an ingame password that was not part of the game when I signed up, so I do not have a password to use in the game. Thus making playing the game with any of my current chars impossible. If you do decide to play make sure you get this ingame password, write it down somewhere safe, you will need it!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Thought the idea of the game was great and the animations of the special abilities is amazing but alas i found the screen was too cluttered with popups like inventory and quest which the windows where way too big.",
            "review_score": "-1"
        },
        {
            "review_text": "Well This Is odd 123/456",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunately, this game does not run.  And yes, I've tried reinstalling the game -- twice.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is great...uhum was great because of one mission i stuck i cant do anything now i hope you see this make things better",
            "review_score": "-1"
        },
        {
            "review_text": "-Started the Game -Played the Tutorial -Got Confused -Deleted the Game  10/10 would Delete again",
            "review_score": "-1"
        },
        {
            "review_text": "The game is OK but the servers are laggy. I stopped playing because I couldn't get a quest to finish. It was a main quest. I relogged to try to get it to work and it still wouldn't trigger. It would have probably worked eventually but at this point I say forget it. They just did server maintenance too so you would think this wouldn't happen. Also there is a slight lag when jumping. Not a major problem but still it is noticable.",
            "review_score": "-1"
        },
        {
            "review_text": "So the game just threw you into a fight and was like, UGH CONTROLS SUCK! Eff where your character is facing, YOU CONTROL THE CAMERA, cuz you know, pro gamers control cameras. And then like your characters armor/clothing is far beyond impractical, like they were looking at Final Fantasy and was like...Psh....yeah well...we can do that too! And so I'm running around, my char is quiet as a ninja, no footsteps, indications on screen suck, and this NPC says to equip my gun, by clicking on my backpack THERE IS NO BACKPACK ICON. So after clicking on EVERYTHING, I somehow equipped the weapon and im like how the fudge!? WHERE was the gun icon I dragged onto a weapons box to equip!? AND THEN they're like 'Btw you should meet this dude named Andre so you can immediately mess stuff up!' and I'm like 'Serious? You call this a tutorial?' So I talk to the guy, run up to a monster, capped him like itss a drive by and like it dies....easily...and the sound effects suck. no variation, no flame sounds where theres fire..no Batmans screamin 'WHERES RACHELS!?' and I'm like wow..totally..non immersive experience",
            "review_score": "-1"
        },
        {
            "review_text": "My kids love this game however DO NOT USE STEAM TO PURCHASE AP. What a mess, just wanted a cute mount for my duaghter and days of going back and forth with Aeria support on my AP/Account being suspended. What a pain to support a game that my kids like. Guess it is time to move on to another game.  ",
            "review_score": "-1"
        },
        {
            "review_text": "AROUND LVL 15-18 YOU CANT COMPLETE THE QUEST. YOU LTERALLY JUST STUCK THERE WITH A NEVER ENDING STUCK QUEST! STEAM NEEDS TO KNOW, IF THE ♥♥♥♥ DONT WORK. THAT IT OUT.",
            "review_score": "-1"
        },
        {
            "review_text": "10 seconds into the game and it already feels clunky and meh. Like seriously, how do you manage to screw up jumping?",
            "review_score": "-1"
        },
        {
            "review_text": "No, Just no....Knock off RPG. but its free so not to much complaining can be done.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game until level 40. Super boring repetive questing, and I'm level 46 and feel no urge to make it past this wall of crap to go to end game. Combat is super RNG. Even if your the most OP character with the highest dps, and best gear you could get ♥♥♥♥ on by an equal level by pure RNG of you missing your big move, or there class having simply more CC.",
            "review_score": "-1"
        },
        {
            "review_text": "tried to log into the game the first day i downloaded it.... 5 days later servers are still down. after that still can't log in. asked gm's for advice on their 'Facebook page' whiich is their main 'site of operations' and nothing. by the way the site doesnt update untill 24 hours later. after you have practacally deleted everything you can to try and get the game to start... terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "AROUND LVL 15-18 YOU CANT COMPLETE THE QUEST. YOU LTERALLY JUST STUCK THERE WITH A NEVER ENDING STUCK QUEST! STEAM NEEDS TO KNOW, IF THE ♥♥♥♥ DONT WORK. THAT IT OUT.",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes all the time... cannot get full screen to work no matter what options I changed or how many times I redownload it. Looks like a fun game, but I'm done with it.",
            "review_score": "-1"
        },
        {
            "review_text": "very common type of game",
            "review_score": "-1"
        },
        {
            "review_text": "fix the server plssssssssss",
            "review_score": "-1"
        },
        {
            "review_text": "One of the worst games I played, It is not worth paying for. I almost spend alot of money on this game but i recieve useless items on random packs. If you dont want to be broke, dont play this game",
            "review_score": "-1"
        },
        {
            "review_text": "  its bad man",
            "review_score": "-1"
        },
        {
            "review_text": "Game is fun for awhile but would be better if they had voice overs and a better story.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: Allowed me to name my character Saddam Hussein  Cons: Didn't let me give him a mustache Coding is sloppy  Get Hatoful Boyfriend instead.",
            "review_score": "-1"
        },
        {
            "review_text": "The worst MMORPG game in the world",
            "review_score": "-1"
        },
        {
            "review_text": "So hard to login",
            "review_score": "-1"
        },
        {
            "review_text": "BANNED FOR NO REASON, ANDI'VE SPEND A LOT OF MONEY INTO THIS GAME. SAD LIFE AMATEUR GM.",
            "review_score": "-1"
        },
        {
            "review_text": "Ive just played this game.   Skill cost NO MANA?  And ive no idea where to push the cart.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is damn boring, graphics are ok, skills are ok, but gameplay is so damn boring - all you do is run from one npc to another, kill x mobs with zero challange and run back. If anyone is interested in storyline may be it is more fun, as im not i just skipped all cinematics and bla bla bla every npc offered and there was nothing interesting left.  One thing I have learned about games, if its not fun and challenging in first 10 minutes it will not be fun after 10hours",
            "review_score": "-1"
        },
        {
            "review_text": "hi guys, i have been playing Aura Kindom for a Week now and reached level 60, the time fraom levleing from level 1 to 60 was really fun but after that the games becomes boring und hard to play, the only choice you have to level over 60 ist du Grint with a Bot or he Fish all day long, since i dont want that i startet to stop playing Aura Kindom. Positive : I must say that it is a very cool and Beautiful game! Negative: Grinding and the Cash Shop is to expensive and I hate this lucky boxes.  I would recommand it for casual player, but for Hardcore players who wants to spend allot of Money, go for it!",
            "review_score": "-1"
        },
        {
            "review_text": "I used to play this on aeria games years ago. I tried to relogin my level 50 Wizard/Sorcerer (what was it called again?) then I forgot the secondary password, bummer! Anyway I tried to create a new account with a rather hassle method. Tested a new class (Scythe) and wow, they have improved the game a lot in a way.  As for a point and click RPG it was okay. I mean, you can evade your enemy attack. There is no MP/Mana/Stamina/Energy to use the magic/skills but there is cooldown, cooldown everywhere.  TL;DR if you're into an anime MMO, mindless grinding, have a lot of luck, have a lot of money to spend for this game, then this one is just right for you. If you want a balance PvP, no just no! If this game was 5 years ago, I probably say yes to everything. Today? just no, no, and no.",
            "review_score": "-1"
        },
        {
            "review_text": "lack of party system online games feels like offline games no socialize features even dungeon must be entered alone recommended for those who love do things by yourself in MMORPG",
            "review_score": "-1"
        },
        {
            "review_text": "It was fun for a week, but eventually you get to a point where you have no more quests to do, and are forced to either grind dungeons , which have daily limits, or get carried by higher level players to progress.",
            "review_score": "-1"
        },
        {
            "review_text": "The darn lolis.",
            "review_score": "-1"
        },
        {
            "review_text": "Despite having good graphical design, the game mechanics is too flawed to be played. I r8 it egg out of eight.",
            "review_score": "-1"
        },
        {
            "review_text": "This game have a good sense of anime and interesting class system in which in lvl 40 you can choose secondary class and the leveling is quick. The complaint I have is that poor dungeon system, late game is booring and lack of character customasation.  Overall I woud give this game a score of 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "- Start game - Play a few days - Notice delay in every action - Checked connection, no probs - Asked around in-game, only people from europe had delay - Sent them an e-mail asking where the servers were located (Country) - 'We cannot share information regarding the location of our servers, however we can inform you that all the servers are located in one place.' - U wot m8? - Send them 2nd e-mail asking location (Continent) - 'We cannot share information regarding the location of our servers, however we can inform you that all the servers are located in one place.' - U gotta be kidding me? - Ask some veterans in their forum chat, and found out they were in Canada - Alt+F4 the game - Uninstall from steam - 2/10, maybe someone from Canada will like it",
            "review_score": "-1"
        },
        {
            "review_text": "I get character model errors and other types of errors when it loads up and the game itself won't respond. I need help.",
            "review_score": "-1"
        },
        {
            "review_text": "Not reccommended for weaker computers. Framerates under 1 are common. Lots of input lag.",
            "review_score": "-1"
        },
        {
            "review_text": "the popups...",
            "review_score": "-1"
        },
        {
            "review_text": "Uninstalled. Unplayable blackscreen with audio only. Certain files refused to download correctly on its launcher. I don't know why it needs to download more 1 hour to download stuff off its launcher after downloading on steam. Worst launcher downloader ever. Errors Errors! How many times this game gonna tell me 40 files failed to vaildate? Was never able to play.",
            "review_score": "-1"
        },
        {
            "review_text": "I sincerely HATE the complicated login process, with password, secondary pin numer with randomized button placements that you HAVE TO click on with your mouse.  Steam forces me to select yes or no, so I give it a no but keep in min this 'no' doesn't mean a lot. I haven't played the game, this 'no' only means no if you too find things like this aggrivating.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't even play, what the heck s going on, its just a blank white screen! Two hours to download for nothing....",
            "review_score": "-1"
        },
        {
            "review_text": "dafuq is wrong with this game....launcher keeps crashing, i need to download again and again... i cant play shieeeet",
            "review_score": "-1"
        },
        {
            "review_text": "Missing some of the most fundamental setting options such as camera speed which renders the game unplayable for some people.",
            "review_score": "-1"
        },
        {
            "review_text": "i installed this game and there came some virus with it. dont download it!",
            "review_score": "-1"
        },
        {
            "review_text": "This is a bad mmo its quest consist of go here kill this 20 times come back and go here talk to him/her and come back its just that its an import game and it atracts webs who watched sao but mmos arent like that there grind fest and you work hard for the ♥♥♥♥ rewards not to put them down i luv them but people are to exited for such a bad game",
            "review_score": "-1"
        },
        {
            "review_text": "I used to play this game alot two years ago back before the server merge, i all ready know that my privious account was lost because i lost my ussername and password so i created a new account on steam, then the ♥♥♥♥ ♥♥♥♥ery got real. it was trying to use my old account and (which btw does not exit because of the server merge) and askes me to use my old password, so after fighting with it for a couple of hours i decided not to contuinue. I am not saying arua kingdom is bad in fact it's a great game but with the custermer support and everything i think is why anyone should avoid this game",
            "review_score": "-1"
        },
        {
            "review_text": "Aura Kindom is very kill everything king of game, and very easy quest heavy, I would not recommend people who wants to emerse themselfes in to the game. Not very good role play. You charater has set dialouges. This is good for time killing but not really good.",
            "review_score": "-1"
        },
        {
            "review_text": "Personally I found the game boring. Lots of classes but the game is pretty much set to auto play.",
            "review_score": "-1"
        },
        {
            "review_text": "Not good. Gameplay is sub-par in the way of FTP-MMOs go.",
            "review_score": "-1"
        },
        {
            "review_text": "#WorldofWarcraft trash",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to get back playing the game but... As what the negative reviews all about, I'm already banned and cant access my account. Now, I can't recommend this anymore because yeah, it's not pay to win kind of game but the developers are greedy ♥♥♥♥s for money and from what I have read, they are deleting inactive accounts on their server. Not like Dragon Nest in which for 2 years I haven't played but my character is still there but for this game. Nope, they delete your character and that's it.",
            "review_score": "-1"
        },
        {
            "review_text": "After playing this game for quite a few hours around level 54 I just lost interest. Its a cool looking game but thats about all the good things I can say about it. They really didn't put much effort into giving these quest any varity at all. Its literally the same generic quests. I really couldn't tell you what the storey is about cause you hardly care to even listen to it. I would honestly just pass over this one and try out another mmorpg your way better off.",
            "review_score": "-1"
        },
        {
            "review_text": "sooooooo many quest, and others are too repeatative, and this game is for rich :v",
            "review_score": "-1"
        },
        {
            "review_text": "long update and takes a lot of money to get something well at least it has a cute eidolon and stuff",
            "review_score": "-1"
        },
        {
            "review_text": "Don't play this game if u are not active or u would get banned like me just bcz of inactive ???? wtf is this. just 16 days cuz i study . u want me everyday keep play this game and ignore the life fk no! yeah this game are too op but the management are the worst i ever play! w8 another company or other server to c8 this game and i would play it if have free time  Warning  Play everyday or banned if want play on this server!",
            "review_score": "-1"
        }
    ]
}