{
    "app_id": 268520,
    "name": "Orc Attack: Flatulent Rebellion",
    "release_date": "2014-05-15",
    "developer": [
        "Casual Brothers"
    ],
    "publisher": [
        "Reverb"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 14,
    "positive_ratings": 29,
    "negative_ratings": 32,
    "price": 6.99,
    "description": "Orcs have become victims of brutal Human expansion, as they are carelessly poisoning the environment. Now, four trained Orc heroes are retaliating with a Not-So-Silent yet very deadly plan.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/268520/header.jpg?t=1447359738",
    "minimum_requirements": "OS: Windows XP SP3 Processor: 1.8 Ghz Intel Core 2 Duo or equivalent Memory: 2 GB RAM Graphics: Nvidia 8600 GT 256 MB or equivalent DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: 2.2 Ghz Intel Core 2 Duo or equivalent Memory: 2 MB RAM Graphics: Nvidia 275 GT 512 MB or equivalent DirectX: Version 9.0c Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "It's not bad for what it is. Co-op play is OK. With some gamepads and a decent sized screen. Game is initially humerous and graphics are decent but tires quickly. Sound effects and awkward camera become very annoying.",
            "review_score": "1"
        },
        {
            "review_text": "good little game, awesome local-multiplayer combats",
            "review_score": "1"
        },
        {
            "review_text": "Press R on the keyboard and the enemies reset starting position. Press Alt and the game hangs. Press arrow keys to control character. Press nothing to control camera, cause you can't. Feels like someone sold me this game with debug settings ON.  No in-depth video settings, frame-rate is terrible.   It's a port. Still better port then Dark-Souls: Prepare To Lag Edition, but only in 2nd place....which is fkn terrible.  On the PC this is not a finished game. Should have been flat out illegal to sell.  Perhaps it works as it should on the console, considering you can't change controls and all the how-to-play and control schemes are for a console controller.",
            "review_score": "-1"
        }
    ]
}