{
    "app_id": 268810,
    "name": "Paranormal State: Poison Spring",
    "release_date": "2014-04-09",
    "developer": [
        "Teyon"
    ],
    "publisher": [
        "Legacy Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Hidden Object",
        "Adventure"
    ],
    "achievements": 20,
    "positive_ratings": 206,
    "negative_ratings": 66,
    "price": 6.99,
    "description": "Thrills abound as the ghost-hunters from the hit TV show “Paranormal State” race to solve a terrifying Civil War haunting!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/268810/header.jpg?t=1447359751",
    "minimum_requirements": "OS: Windows XP Service Pack 2 Processor: 1.6 GHz Memory: 1 GB RAM Graphics: OpenGL 1.2+ or compatible graphics card DirectX: Version 9.0 Storage: 786 MB available space",
    "recommended_requirements": "OS: Windows 7 Processor: 2 GHz Memory: 2 GB RAM Graphics: OpenGL 1.2+ or compatible graphics card DirectX: Version 9.0 Storage: 786 MB available space",
    "reviews": [
        {
            "review_text": "This game is not just a HOG (hidden object game), it also has the elements of a point and click adventure. This is my first time playing a HOG that is both a HOG and a Point and Click adventure game, and let me tell you, it is a lot of fun. When I played other HOGs I got bored of doing nothing but hidden object scenes non-stop, and I often would not even finish the game. This game, I see myself finishing and maybe even coming back to play again a 2nd time. The game is that much fun and it is never boring. In between doing hidden objects, you got plenty of mini-games and puzzles to solve. I highly recommend that nobody who plays this game, use the skip button on any mini-game. The fun of this game is solving the mini-games and puzzles. If you skip them, then you are losing out on a lot of the fun.   One of the things that makes this game great is that the hidden object scenes 'fit'. In other HOG games, the hidden object scenes would not fit. Like a cemetery scene that was so cluttered that it didn't even look like a real cemetery. In this game, every hidden object scene feels like it is part of the world. I would say the scenes fit into the world about 95% of the way in this game, and that is pretty good. Every HOG game has a lot of hidden objects that don't belong in a certain place, so no scene will fit 100% but fitting about 95% is pretty good.   One of the things that makes this game both unique and great, is that there are interactive objects in the hidden object scenes. For example, you may have to cut something open. So you first need to find the right item that is able to cut the thing open, and then you need to do it. I ran into some interesting interactive objects during my time playing so far, such as the spider web. I don't want to give away any spoilers so I won't say anymore about the spider web. But I will say, it makes this a unique game in having these interactive objects. Having them in the game also makes it more interesting and fun.  Another thing that makes this game great, is you feel motivated to continue playing the game until you finish it. Other HOG games, I got bored with, but not with this game. This game, I feel motivated to play. I just started playing the game today, and I played for almost 3 hours in one day. I will finish the game in the next few days. What keeps me motivated is that every time you finish a hidden object scene, you get rewarded with an object that you can use in the point and click adventure part of the game. Also as I said earlier in the review, it is not nothing but hidden object scenes, so you have variety in this game. The variety keeps me interested and motivated. I plan to solve every mini-game and puzzle in the game, without using a walkthrough. Even if that means taking a little longer then other people to finish the game. I will get more fun out of the game that way.  I highly recommend this game for people who enjoy HOGs, especially if you like a HOG with point and click adventure elements in it.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. It is a hidden object game with creepy theme. Kinda easy but addictive. It takes about 7 hours to beat it fully with the special chapter.  Un juego bastante entretenido en el cual debes buscar objetos ocultos, realizar algunos puzzles, etc, para poder avanzar en la historia. No es un super juego pero al menos yo lo disfruté. No me quedé atascado en ningún puzzle por lo cual lo considero facilito, pero a la vez me resultó bastante adictivo. 7 horas tardé en pasármelo, incluyendo el capítulo extra.",
            "review_score": "1"
        },
        {
            "review_text": "What the others said: bad voices, bad characters graphics, terrible 'Hot spot' in some scenes where clicking becomes awful, ridiculous teen story filled with clichés, the other characters that do... nothing. I'll add bad sfx to the list, way too much backtracking, some bad translations for the objects lists (still acceptable though) and you're often wondering where to go next since walking back &amp; forth is the main gameplay; it leaves you dizzy lol. Didn't like the 'find the wolf' thing as it's badly done: a tiny puppy statue seems really silly, I'm still missing 2 wolves and there's a statue that only gives me a text 'That's a wolf statue!' instead of validating the find...  What I liked though are the HOG scenes graphics and the actions to do in it, quite original and IMO all logical, the occasional WTF was solved with the hint button. The problem came from the clicking zones, quite fiddly. The locations graphics are also gorgeous.  TLDR Summary: Badly done, it feels unfinished. They should have tested it out more.",
            "review_score": "-1"
        },
        {
            "review_text": "An Investigation Discovery case: Haunted museum in the forest! Wooha, creepy meepy isn't it? Do not scream, the horror-o-meter is low.  I don't know if ghosts do exist or not, but I think this is somewhat similar when two children are talking about games, future kid says that he have 200 games on Steam account and the kid from the past asks can I see em? So future (rather present) kid answers like, sorry, they physically do not exist. So I think most of the things can be answered by science. Either way, there is one thing I am sure, lots of people can make a living from the paranormal and esoteric business. (Not the game devs of course).   So, a small team of professional people decided to face the haunting past, their adventure is fairly exceptional. Great puzzles with logic, no nonsense pairings and such riddles, unlike in the similar point and click games. 5-6 hours of gameplay, good graphics, interesting story - good buy I say.",
            "review_score": "1"
        },
        {
            "review_text": "Nice H.O.G game,I am a BIg fan of H.O.G. games ,And this one is very good,The music is amazing, atmosphere amazing also.The BEST part is the story is just so very good and fan.For now i can't find any problem whit the game . 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Paranormal State: Poison Spring is a paranormal point &amp; click game with lots of hidden object minigames and puzzles. The game takes around 3-4 hours to beat and it has no replayability at all.  I'm really on the edge between a positive or a negative experience with this game. The graphics are very good but the animations and soundtracks are meh. The story had it's good moments but... In the end it's not really satisfying. Some of the puzzles made no sense or were just plain annoying, but I really enjoyed some of them. Also the jump scares were pretty lame.  I've only came across one bug while playing the game and i'm not even sure it was a bug... After getting a certain item I couldn't find what to next so I used the Hint button and it just wouldn't work. Other than that, the game had no other bugs.  It isn't a bad game... But $10 for a 3-4 hour long game that doesn't leave me really satisfied is not something i will recommend to my friends. I'm pretty sure there's a good number of superior point &amp; click games on Steam that you should buy before this one; Though, if you ever see this game on sale or you are interested in playing it, don't feel bad for buying it, it's still a good game.",
            "review_score": "-1"
        },
        {
            "review_text": "It is a good game and not boring if you know what you do. You can get trading cards. And you can do all achievements because that is not so hard, but if you want to do all don't make the game becuase if you do this you have to start again the game to do achievement. That is bad in this game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best HOG",
            "review_score": "1"
        },
        {
            "review_text": "Boring story and it doesn't always make sense. The tasks you need to accomplish don't always make sense. The hidden object portions are not quite balanced right.",
            "review_score": "-1"
        },
        {
            "review_text": "loved the game but was hard to click on some parts...",
            "review_score": "1"
        },
        {
            "review_text": "It's cringe-worthy, nothing like the show and is laugh out loud funny unintentionally.  The look on Ryan Buell's face everytime you play?  Totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know a thing about this show but I liked the game well enough. Definitely enough that I finished the game, and it wasn't a struggle to play it. I thought it was a bit cheesy that each character had...like each character said really dorky things about whatever their specialty was, in an over-the-top way. You'll see what I'm trying to say if you play the game. But Poison Springs is a real place, that's cool. It wasn't boring, I actually enjoyed playing it even when I couldn't figure out what to do. I play a lot of HOG, and this is a good one. It can be enjoyed by more than the Paranormal State fans.",
            "review_score": "1"
        },
        {
            "review_text": "Super Fun worth every penny during the sale.",
            "review_score": "1"
        }
    ]
}