{
    "app_id": 268890,
    "name": "Masters of the World - Geopolitical Simulator 3",
    "release_date": "2014-02-05",
    "developer": [
        "Eversim"
    ],
    "publisher": [
        "Eversim"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Strategy",
        "Politics"
    ],
    "achievements": 0,
    "positive_ratings": 222,
    "negative_ratings": 284,
    "price": 26.99,
    "description": "Discover the industry standard for geopolitical simulation of today’s world!In Masters of the World, the third incarnation of Geopolitical Simulator, play as the head of state of one or more countries and expand your influence across the globe.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/268890/header.jpg?t=1517285197",
    "minimum_requirements": "OS: Windows 10, 8, 7, Vista, Xp Processor: 1.6 Ghz Memory: 4 GB RAM DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 10, 8, 7, Vista, Xp Processor: 2.4 Ghz Memory: 4 GB RAM Graphics: Nvidia or AMD with 512Mb RAM DirectX: Version 9.0c Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "I highly recommend this game for anyone who is a political geek.   The game is extremely in-depth. It goes from well-known laws like freedom of speech/demonstration/religion to tiny aspects you'd never see in a geopolitical simulator; blood toxicity level, driving age, maximum age for school, and speed limits on trunk roads, city roads, and highways. It also has a very realistic atmosphere to it. Setting aside the fact the map and characters look like 90s era games, it gives the game a feel no other geopolitical simulator has given me; realism. It goes from setting meetings with political figures and world leaders, to having small talk and influencing well-known figures in your country to vote for you or support your bill publicly. When a law doesn't pass through, a reform can be made. Adding laws into this reform that is bipartisan will increase the chances of it being passed. More features include asking nations for authorization to build a pipeline through their territory, building pipelines for oil or gas, detailed trade agreements that allow you to set the price, quantity, and duration of the agreement (Example: Russia's Natural Gas Agreement with China that will last for 20 years), the game also allows the construction of various buildings or transportations like oil and gas pipelines, high-speed trains, nuclear power plants, oil rigs, gas and oil fields, and even increasing the number of hospitals, homes, schools, or solar fields. The game also has a very complicated economic system. I have been having trouble with it, but I did have some success as Jordan earlier. Continuing on, the game is very recent. It isn't like SuperPower 2 where it was created just before the NATO expansion or the break-up of Serbia and Montenegro, but it was released in 2013, meaning it has the world's youngest country, South Sudan. The game features terrorist groups in every country, ranging from the Mafia to Total Jihad groups (Al-Quaeda). You have the options to infiltrate the groups if they live in your territory, to funding them with weapons, money, and 2 semi-trucks with rockets and explosives if they are in other countries to help them take down that country's government. But if you do this, you have the chance to be caught red-handed. And this will transfer into the news, and Parliment will impeach you. I suffered that while playing as Russia and funding New Zealand terrorists. The game offers so much detail to their options, like adding more medical staff and adding more police staff. You can also investigate politicians and well-known citizens to reveal a scandal to use against them, to spying on heads-of-state or countries to find evidence that will gain the approval of the United Nations Security Council and allow military action against the country. Which brings me to the Organizations of the game.   The game has made Organizations possible, which bring various or all world organizations into the game including the North Atlantic Treaty Organization, Shanghai Cooperation Organization, Organization of Petroleum Exporting Countries, European Union, and North American Free Trade Agreement. It then gives you the option to create your own Organization, allowing an Economic Market (NAFTA), Producing Countries (OPEC), Monetary Union (EU), and Political-Military Organization (NATO). This then allows you to choose members states, the budget, the voting system, the secretary general's holding of the seat, and who the secretary general is. You can then meet to set the prices of the product, make changes, etc. Like with OPEC, you can propose to change the average oil price. You can also launch reelection campaigns, even visiting the Olympics, military barracks, and universities. Instead of a SuperPower 2 style diplomatic relations, there are two types of relations. First is economic. Just because the country does not favor you does not affect trade relations. Second is military, allowing certian permissions like allowing air, ground, and naval bases in your/their country while considering the amount, allowing you to edit this at any time via meetings with head-of-state. Diplomatic relations come with various things, like managing embassies, allowing nationals to enter or leave, and forcing ethnic Israeli's living in Lebanon to return. Lastly, the game makes it perfectly with this.  As all military and geopolitical games have, the feature nuclear weapons. Naturally, this game has them. But for the first time, you need to go through politics when proceeding with a nuclear attack. First, you must authorize the use of nuclear weapons. Second, you must make a meeting with the Chief of the Army. Third, you must ask him to authorize the use of nuclear weapons. Forth, you must ask him for the code for the nuclear weapons. And the game never remembers it, You actually need to write it down. Lastly, enter your code when firing nuclear missiles. But in this game, it features something never seen in any game I have played - Chemical and bacteriological weapons. You can actually use the weapons hated internationally. Though it is almost difficult to use them, you need to have a high standing with the chief of the army. Authorize the use of chemical and bacteriological weapons, ask him to authorize their use, and if he allows it, you can freely launch chemical attacks against anyone. Beware - Using nuclear, chemical, and bacteriological weapons are EXTREMELY frowned upon domestically and internationally. If used, you will be thrown out of office, and if not that, the UNSC will send a resolution to authorize military intervention.  Overall, the game is very fun. So far, I have not run into any major bugs like crashes or gameplay interventions. Only bug I have notices was on the Newspaper where it was supposed to say the President of Russia's name, but showed random lettering or coding. I rate it 8/10. If you love geo-political games and have major interests in politics, this game is perfect. Besides the 90s looking interface, no game has ever gone so in-depth. Many offical reviews say the same.",
            "review_score": "1"
        },
        {
            "review_text": "Such a great game. Don't listen to the idiots who played for 10 minutes and then judged it, it's worth the money. Just takes some getting used to. The wargame is in-depth and exceptional, you can play as any country you wish (With a few exceptions including city-states such as the Vatican and Monaco) You can play a multitude of scenarios ranging from World War 3 to Chilean Tourism, the gameplay is astoundingly realistic, ranging from issues about social mores to the military. The only thing I can say I don't like about the game is interacting with other countries, which is quite limited. The game does not include things such as Sanctions, and the AI is pretty trigger happy with the 'Attack Country' button if you provoke them. In contrast to today, where economic sanctions can send a clear message to back down. Over all, a very great game. I would recommend this any day.   NOTICE: This isn't some Paradox grand strategy game, this is a Geo-Political Simulator. Know the difference.",
            "review_score": "1"
        },
        {
            "review_text": "if you are deciding whether or not to purchase this game you may want to read this review.... personally I love this game, it is really fun because of the endless ways to run your nation. (also endless ways for your nation to end) It takes into account many of real world limiting factors. for example, you can't just take full control over your people(unless you get the 2014 add on). the senate and parliment will most likley try to stop you, also your people will revolt and you will most likely get killed be forced to leave or have your own military go against you. All I'm trying to say is if you want to feel what it's like to run a country for real or if you want to reign supreme and conquor your enemies and want a challenge while doing it then get this game. however if you aren't looking for a challenge and you just want to conquor the world, it is possible. However if you don't know how to get out of tricky situations then you might not want to get it. I would Definitly recommend this game if you meet the above categories.",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent game with superb depth into geopolitics. I have yet to come across any bugs, so I guess they have been fixed in different patches.  While the game looks like it was from 2005, if you like the genre of politics, this will surely satisfy you.",
            "review_score": "1"
        },
        {
            "review_text": "At least it's not Justin Beiber.   11/10.",
            "review_score": "1"
        },
        {
            "review_text": "Personally, I think it's a god damn awesome game for those who have the patience for the style of the game and the bugs that come with it.",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't work. Access Violation on startup. Hope I can get a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok, first things first, this game is fun. Since political simulation games are a rare species, and this is one of the few of them, I normaly would recommend it to everyone who likes this type of games. You really have to work to have your plans work out, no matter if it's economic grow, demographics or military expansion. Especially the latter is hard to achieve, since you have to fight bad publicity both internationaly and intern. The gameplay is very deep and it's very challenging to achieve your goals.  The graphics are decent. Not good, not bad, but still enough for this type of game. As for sound, that's ok too. I dunno if it's a bug, but I hear the music of other games while playing this one (Distant Worlds).  The only reason why I don't recommend it is the simple fact that it has DRM. So you're not only limited to buy it on Steam here, but also have limited activations and... hell, I just hate DRM. Way to go, thank you Eversim. Unfortunatly I haven't read it, else I wouldn't have thought about buying it.  So, summerized:  Decent Game, a little buggy, but fun. I'll give it a 7/10, because I like the genre and since this game is a rare specimen... and subtract 7 points for the DRM. That's 0/10 for you, until the DRM is patched out. As soon as that is done, I'll make a recommention.",
            "review_score": "-1"
        },
        {
            "review_text": "At first, Masters of the World looks like a deep, engaging and thrilling simulator of worldwide politics. If you made the same mistake that I did by purchasing the $70 bundle with the game, updated content, and the modding tool, you'd better hurry and refund that. If you really want to see what this game has to offer then you should just buy the base game.  Unfortunately, the problems with MotW appear immediately. Right off the bat, the tutorial was unable to figure out that I had successfully changed some spending priorities as it had instructed me to, preventing me from progressing further. Armed only with the knowledge of how to navigate the map and modify the budget, I tried to start a new game. It was extremely difficult selecting a leader that wasn't of the same party as the current leader, turning the start-up process into a mess as I accidentally changed unrelated settings attempting to figure out how to change the leader. I eventually figured it out - though I can't even remember how I did - and entered the game.  Immediately, the game became campy and even amusing. To communicate to the player even basic messages, an ugly and poorly-rendered person takes over your screen to talk to you about how well you're doing. The voice acting was so robotic and unnatural, the first 7 hours I played I was certain it was just a text-to-speech software. These messages quickly become repetitive: whenever there is a terrorist cell in a foreign country, someone will come on the screen and deliver a useless, rambling explanation of the 'Brown model' without giving you any real information (they'll mention percentages and numbers that sound important, but turn out to be repetitive filler that doesn't change situation to situation). Afterwords the game will give you a static text box telling you the real information: where the cell is, what it does and how to contact them. You can skip these messages (and thankfully by doing so you're not actually missing anything), but the fact that Eversim put so much effort into something so unnecessary - and in fact something that hinders the gameplay experience - shows where their priorities are.   The rest of the game's graphics do not fare well, either. The game has extreme and severe lag somehow, even when countries are basically trees, lakes, and geometrically simple cities that consist of about a dozen buildings. As mentioned earlier, the character models look horrendous, but the developers seem to enjoy showing off. The interface is a problem (which is not uncommon for an Eversim game), with the developers trying to make fancy-looking infographics hidden behind dozens of menus and tabs.  If these problems weren't major enough, the game is buggy, crashes very often, and Eversim has completely given up on it. Eversim has a history of spending about 6 months on a political game, updating it rarely for a 6-month period, and then disappearing to work on a sequel. Their sequel to this game is coming out soon (the release date has already passed with no announcement) and judging by the trailers, it preserves the terrible graphics and confusing interface. If Eversim settled on a game, kept updating it, used a reasonable price, and actually made a working tutorial, they wouldn't have a 42% positive score on Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "I've played previous Geoploitical Sim Games and enjoyed them. They've always had their problems and this is no exception. Like in previous games the economic effect of policies seems well modeled but the reaction of the voters is utterly unpredictable. Riots in the streets over minor policy changes makes the game unplayable if you're trying to be a moderate. The war system UI is also utterly unusable making it very difficult to play even as a war game.  I love what they're trying to do and hope that their next release does a better job but I doubt I'll play this again.  ",
            "review_score": "-1"
        },
        {
            "review_text": "To much content. Way to much content. There are just to many feeble things to worry about that distracts from the overall goal of what you, the player, is trying to accomplish. Ruling parties don't really change or swing at all despite your approval rating and the way you conduct your government. While the game intially seemed very appealing and intriguing, it now just sits in the Library bin collecting digital dust. There are so many taxes and options for the taxes it can be easy to spend most of your time at the nickel-and-diming concept and micromanaging the beejesus out of things that for a 'Master of the World' would seem trivial. Overall a fantastic concept, but just abolutely drawfs the player with options that don't seem relevant to the 'Master of the World.' What ever happened to delegation...?",
            "review_score": "-1"
        },
        {
            "review_text": "Game sucks, it wont work. I have audio but not visual. No support from game maker to fix..steam says its not their fault. What a waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "Unpolished and full of bugs, totally not worth the price. This comes from a guy who loves these types of strategy games. Feel ripped off.",
            "review_score": "-1"
        },
        {
            "review_text": "I've tried being a fan becuase it is a cool concept but the company doesn't do anything to fix their games and correct bugs making the game completely unejoyable.",
            "review_score": "-1"
        },
        {
            "review_text": "OH HELL NO!!!!   DONT BUY THIS GAME...... DONT!!  IT DOESNT WORK AT ALL!  im not even going on about DRM, thats not the problem.... the problem is the fact that this game doesnt even let you play or start a new ♥♥♥♥ing game!!!!   you will get to menu, you will select new game and set one up, you will get load screen.... then BAM you will get violation error message and be kicked out of game..... you will then try tart game again and again for ages and it will never ♥♥♥♥ing work!  this game doesnt work, and from what i see everyone has this problem and everyones asking for refunds!  the devs arnt even on steam and WONT HELP AT ALL!!!  screw this, for this price i at least expect a game i can play..... now i need to try get my money back, if i cant ive been scammed!  EDIT: if the devs can fix the game and make it playable i will be able to write a review based on gameplay and the game, otherwise this is my experience of the game so far and will also still have a effect on review even when fixed",
            "review_score": "-1"
        },
        {
            "review_text": "iT FREAKING CRASHES EVERY TIME NOT WORTH 50 BUCKS, for now",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of money!!!",
            "review_score": "-1"
        },
        {
            "review_text": "The Game was good probably the best political game, and then it just crashes every time. It needs removing!",
            "review_score": "-1"
        },
        {
            "review_text": "I spent hours getting to know the game mechanics. Played Saudi Arabia, had 100% popularity, surplus economics, good military, lower taxes and pretty much everyone in the cabinet was 70-100% approval...then to get a phone call firing me. No explanation...just game over. The game has a serious flaw. When I confronted the company, they asked me what game cheat I was using. I replied, NONE. They asked again, what game cheats...again, none! Their response, well then read the newspaper, you must have ♥♥♥♥♥♥ someone off...rather than look more closely. Blah...they have a bug and simply won't look at it. Flush this game...might as well roll dice vs strategic/tactical reasoned approach to winning. Save your money and buy something else.",
            "review_score": "-1"
        },
        {
            "review_text": "game is garbage, would get more entertainment burning a $50 bill, even with opening every single port on my computer in both tcp and udp and then spending hours confirming each port the game still refuses to allow multiplayer play...totally garbage",
            "review_score": "-1"
        },
        {
            "review_text": "game keeps on crashing",
            "review_score": "-1"
        }
    ]
}