{
    "app_id": 269150,
    "name": "Luxuria Superbia",
    "release_date": "2014-01-28",
    "developer": [
        "Tale of Tales"
    ],
    "publisher": [
        "Tale of Tales"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Full controller support",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 167,
    "negative_ratings": 62,
    "price": 4.99,
    "description": "A simple game of touch, pleasure and joy.Luxuria Superbia is a colorful, musical journey made to fill you with joy. Exciting designs explode from your touch as you glide through playful stylized flowers. It’s all about the experience and the interaction.There’s twelve flower-like tunnels and a garden with a temple.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/269150/header.jpg?t=1447359758",
    "minimum_requirements": "OS: XP Processor: 1 Ghz Memory: 500 MB RAM Storage: 250 MB available space",
    "recommended_requirements": "OS: 7 Processor: 2 Ghz Memory: 2 GB RAM Graphics: Geforce or Radeon Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "I think I just had sex with my computer. It thanked me afterwards.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥ ♥♥♥♥♥♥♥ ♥♥♥♥♥♥♥ ♥♥♥♥ ♥♥♥♥♥♥ ♥♥♥♥♥ ♥♥♥♥♥♥ Simulator 2014.",
            "review_score": "1"
        },
        {
            "review_text": "Luxuria Superbia is an acid trip the likes of which I have never seen before. It is an incredibly simple game about... I don't know what, but it's really fun. All the player does is use their mouse to create color by clicking on certain parts of the screen. It's fun comes from the fact that we were all once five years old. It feels like a step back into childhood with it's vibrant colors and simplicity. I've only played for a short time, but this is a fantastic game.  On the OTHER hand, the game has on mechanic that kind of ruins the immersion. The flowers. The game has you going through tunnels wich are describing as being flowers. That concept is easy to understand, except the player appears to be doing... something to the flowers. If the player creates enough color (Or, as the game describes it, 'create joy'), the flower begins to talk, saying somewhat creepy things like, 'Grip my petals' and 'Oh yes, yes'. I'm not into ****ing a flower am I?  That portion of the game DOES contribute to the feel of the game, since the creator so obviously intended that. The game is playable by both children and adults, for the simple reason that children who don't understand what the flowers are getting at won't care, and the children who do are likely doing something age-inappropriate anyways, and still don't care.  Overall, creepy, but fun. 9/10 because I feel like I just gave a flower a handjob. I'm going to see if my shower can burn away the dirtiness I feel afer playing this. Then I'm going to play it again. Why? Because ♥♥♥♥ it, I like pretty colors.",
            "review_score": "1"
        },
        {
            "review_text": "Did I just have sex with this game? I.. I think I just ♥♥♥♥ed a game. I don't know how to feel, but uh.. yeah. I'd bang it again",
            "review_score": "1"
        },
        {
            "review_text": "I think I was blushing more than the flowers.",
            "review_score": "1"
        },
        {
            "review_text": "A game you have to play slowly. Contains sexual metaphors.  Funny.",
            "review_score": "1"
        },
        {
            "review_text": "Um...I dont know what to say. This game is weird as ♥♥♥♥. Please, someone explain the meaning of this game to me!!!  Anyways, it was work 1.00 on the Humble Bundle for this week. Buy it. It will wirelessly dismantle yor brain's neurons.",
            "review_score": "1"
        },
        {
            "review_text": "You've never played anything like this, think of it like a rythme game mixed with LSD, and a lot of... innuendo?",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥ic.  No, literally, you're giving flowers ♥♥♥♥♥♥s.  Since Steam censors that word, let's just call it 'pollination.'",
            "review_score": "1"
        },
        {
            "review_text": "If you've ever wanted to know what it's like to have sex with a flower get this game.  If that's not your cup of tea then pass.",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite amazing. It is sexual and spiritual at the same time.",
            "review_score": "1"
        },
        {
            "review_text": "I don't get this game at all. I still had to visit certain streaming video websites just so I could finish too. Then again I'm getting laid every hour on the hour and last 59 minutes every single time! I'm totally F'N this fine hunny I met at the gym on leg day while I type this on my bad ♥♥♥ tablet. Those girls in my avatar? They my cousins, but yeah, I F them in the A anyways cus that's how I roll.  I would recommend it if on sale or bundled which is how I got it. But I wouldn't pay the normal price for it.  ",
            "review_score": "1"
        },
        {
            "review_text": "this game is kind of sexual, putting it mildly. but it does it in a beautiful way. every flower is a different experience. the music is beautiful and the visuals are quite nice as well. I got it in a bundle and while I might not suggest buying it at full price, it is definitely a fun game if you are into experiences and something different.",
            "review_score": "1"
        },
        {
            "review_text": "Trigger Warning: if you've been sexually abused as a flower this might be offensive to you.  So in this game the objective is to bang a flower and not sprout your pollen too early, so right here we can already see the unrealistic demands and daunting difficulty this game provides.  The flower, that we all enjoy and love, is a sexual nympho that is out to bang all of us and then complain when we don't satisfy it after we even bought it's service for 6 euros.  The game is a perfect 'horrible flower escort service' -simulator.  10/10; abandon all hope for video games future.",
            "review_score": "-1"
        },
        {
            "review_text": "This 'game' made me feel really uncomfortable playing. The music is unsettling, the actual game is unsettling, it's sexual in an unpleasant way.   I tend to like experimental indie stuff, but this is beyond me. Though I believe there is a market for everything (and it's true, considering the positive reviews). ",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I guess it's okay if you're into plant erotica   2/10",
            "review_score": "-1"
        },
        {
            "review_text": "I've played with better screensavers...",
            "review_score": "-1"
        },
        {
            "review_text": "I created a special category in my library just for this game called 'Worst Games'.",
            "review_score": "-1"
        }
    ]
}