{
    "app_id": 269290,
    "name": "liteCam Game: 100 FPS Game Capture",
    "release_date": "2014-02-24",
    "developer": [
        "Rsupport Inc."
    ],
    "publisher": [
        "Rsupport Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Utilities",
        "Video Production"
    ],
    "tags": [
        "Software",
        "Video Production",
        "Utilities"
    ],
    "achievements": 0,
    "positive_ratings": 281,
    "negative_ratings": 266,
    "price": 10.99,
    "description": "Discover the ultimate game recorder, ‘liteCam Game: 100FPS Game Capture’.‘liteCam Game: 100FPS Game Capture’ is a recorder with easy and simplified interface that captures game play with HD quality output with audio and no lagging. Capture game play with high Frame rates with both game sound and audio commentary Today!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/269290/header.jpg?t=1447359761",
    "minimum_requirements": "OS: Windows XP, Vista, 7 and 8. Processor: 2GHz Dual-Core CPU or Better. Memory: 2 GB RAM Graphics: 512MB video memory or more. And A graphic card supporting DirectX 9 and WDDM driver. DirectX: Version 7.0 Sound Card: A sound card that supports full-duplexing required. Additional Notes: Windows 2000 is not supported.",
    "recommended_requirements": "OS: Windows 7 and 8. Processor: Intel Core i5/i7 Memory: 4 GB RAM Graphics: 1GB video memory or more. DirectX: Version 7.0 Sound Card: A sound card that supports full-duplexing required. Additional Notes: It might drop frames when recording if your computer becomes overburdened or the game play limit FPS less than 100FPS.",
    "reviews": [
        {
            "review_text": "Bought didn't record at 100fps still like it Then it updated Cool right? No.  It crashes everytime I start it So do not buy but I still try to run it crash crash crash crash crash 10/10 would crash again.",
            "review_score": "-1"
        },
        {
            "review_text": "Read the Reviews, but tried it anyways. Needs major Udate to fix many issues from sound to crashing not only itself but the game you are playing.",
            "review_score": "-1"
        },
        {
            "review_text": "I saw a lot of people say this was a good product, as well as I saw many people say this was not a good product. I gave it the benefit of the doubt but regret it deeply. It will not record, webcam doesn't turn on, and it won't widen recording territory. My hard-earned money spend poorly. I am dissapointed in this product.",
            "review_score": "-1"
        },
        {
            "review_text": "Negative! As long as this situation is not going to change so will my 'recommendation' remain! First try out the available free vesion before rushing into this purchase!  This software may record beautiful video &amp; crystalclear/synchronized sound indeed but however I do not appreciate to sacrifice invaluable Frames-per-seconds. 30 FPS in Killing Floor &amp; Garry's Mod. Seriously? RSUPPORT listen here: You have to work on it! Not everybody has the absolute expensive Hi-End hardware to deal with liteCam 100 FPS Game Capture. I have tried different methods multiple times such as lowering bitrate, lowering settings, changing video codec. Whatever was available did not help. FPS were always +/- 30.  I have already sent a message to RSUPPORT about this issue. I see they were patching their software somewhat in the past. RSUPPORT you have to focus on getting decent 60 FPS on decent computers. My hardware is capable of managing giant programming. FRAPS &amp; Hypercam 2 never had a problem with FPS. FPS is the main troublesome issue here. My drivers are all already up to date! Double checked!  Motherboard: ASUS M4N78 Pro CPU: AMD Phenom II X4 945 (4x3 GHz) RAM: 2x2 GB @ 800 Mhz GPU: Gigabyte Geforce 670 GTX 2GB WF3 PSU: 920W MS-Tech Monitor: Packard Bell Maestro 235DL (1920x1080 @ 60Hz) OS: Windows 7 Professional 64-Bit Virusfree, clean and well-operating machine.  What are the benefits of liteCam Game: 100 FPS Game Capture? - First of all it was on a fair discount here on Steam, which has attracted my attention. I grabbed it while I still could. - Customizeable video capturing very easy: from videosettings trough audiosettings you can choose whatever you wish. - Recorded videos unlike FRAPS do not chew up gigabytes for minutes. - Easy-to-use - Wish to record activities on desktop? No problem! This mode is available with 100% sharpness &amp; customizations for the mouse. - Record Stereo Mix (a.k.a. What u hear) and Microphone simultaneously (without seperate audiorecordings). - For some inexperienced comes up an integrated feature to add titles, logos and some other stuff to their video.  What does liteCam Game: 100 FPS Game Capture lack off?: -  (Main reason)  Even on good machines you will get - unlike FRAPS - lesser FPS while recording, which will follow in the review of your freshly recorded video. This has been in Killing Floor and Garry's mod tested by me.  SO YEAH! AFTER ALL I STILL HAVE TO STICK WITH THE GIGABYTE-CONSUMING FRAPS. FRAPS WONT AT LEAST DROP DOWN PRECIOUS FPS AS HORRIBLE AS LITECAM DOES, SO I STILL HAVE GOT NO BLOODY CHOICE. I learned my lesson the hard way. I admit this is the first time, that I feel like I got robbed for good-for-nothing trashware (YET TODAY!). I never before realized, that a free version of liteCam was available for testing. I was into the purchase rush because of the nice discount and somewhat attracting provided content. I was wrong! They are wrong yet today (unless a better update is coming out to beat the capabilities of FRAPS truly)!  The other top-rated negative reviews said nothing realy more than 'This software is a piece of $hiet...'. These were however not helpful to prove, that liteCam is not worth buying for their incapabilities. Here I am the first one, who warns crystal-clearly you fellow readers. Avoid this program. Unless it is going to be updated properly with TRUE capabilities of taking TRUE 100(60) FPS. Until then I will edit this review!  RSUPPORT! LISTEN HERE! FIX IT! WORK ON IT!",
            "review_score": "-1"
        },
        {
            "review_text": "It was hell when I first got it, crashing ALL THE FREAKING TIME, but now it works (kinda still slows my computer). Then i tried recording different games other than TF2, but it was HORRIBLE. When i tried to record Portal 2 with my friend, it was corrupted so badly i couldnt use it. when i recorded Garry's mod, it wouldnt record at all. and finally, when i tried to record Overwatch, it CRASHED MY COMPUTER, caused incredible lag, and whenever i tried to shut it down, it crashed, making me restart my computer, AGAIN, and AGAIN, AND AGAIN! DO NOT GET THIS! i am still waiting for my $15 dollar refund and this was NOT a thing worth the money.",
            "review_score": "-1"
        },
        {
            "review_text": "'no'  Thats the best way to describe litecam. Dont get it, for the love of god dont. You cant record both computer and mic at the same time easily and the 'converter' will compress your files to hell even if you select HD. Get OBS, it does everything litecam can but better and its Free, hell Bandicam does it too. Even fraps!  Main Problems with Litecam:  Confusing to use. Crashes certain games. Crashes if a game closes sometimes. A bit over priced. Converter compresses to hard on any setting. You can only select one recording input. Mic or Computer* (From what i can tell)  Good things about litecam:  Looks good. Easy to use (CTRL+F8/F10). Converter comes with it! (The converter is horrible, i mean HORRIBLE.)   All in all dont get litecam. As much as i want it to thrive it is horrible.",
            "review_score": "-1"
        },
        {
            "review_text": "The option are very bad and you can't record what people say on teamspeak but the quality of the video is good.",
            "review_score": "-1"
        },
        {
            "review_text": "Doesnt actually record in 1920x1080, it says it does, but believe me, IT DOES NOT. I've set it to record in 1080p and when i play back the capture, it looks like 720p at best. this is the worst game capture software I've ever seen",
            "review_score": "-1"
        },
        {
            "review_text": "It's even better than advertised. I recorded seven minutes of MWO on high graphics settings at 720p/50fps. No issues, no lag, no fps reductions; wouldn't be able to do that with Fraps or anything else.  I even liked it so much that I took the time to write this review.",
            "review_score": "1"
        },
        {
            "review_text": "Hey i would rec this product t anyone with a decent computer and if you have any problems message me and i will try 2 help ",
            "review_score": "1"
        },
        {
            "review_text": "This recording software is really good at least i think so  i dont see the problem it does what it does and im happy with  it",
            "review_score": "1"
        },
        {
            "review_text": "it's a pretty decent program only sad that you need a beastly pc for it :c if that would be fixed it would maybe be as good as fraps",
            "review_score": "1"
        },
        {
            "review_text": "YES T WAS FIXED LVOE IT NOW 10/10",
            "review_score": "1"
        },
        {
            "review_text": "not working well with AMD processor...drops my fps about 20-30 than normal. just not liking this program..wish i could get money back.",
            "review_score": "-1"
        },
        {
            "review_text": "Best recording programe evaaaaaa!!!! Has everything I wanted in a recorder. Stuff for face cam, screen recorders that is able to be resize for happy wheels, amazing options to record everything and more at the same time and its only $25.00. Best purchase I have ever bought. 10 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Complete waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "This software is good but for a decent - Good gaming PC like mine then you might need to settle with slight glitches inbetween videos, but overall its 6/10 so yeah",
            "review_score": "1"
        },
        {
            "review_text": "Why i tried the trial, it was great i reached FPS about 90 and i would use these again if i got the chance.",
            "review_score": "1"
        },
        {
            "review_text": "So far, here has been my experience:  I recorded a half hour game of League of Legends and told the program to cap at 50 FPS. It seemed to handle that just fine, the file came out at 4.8 gigs though.  What I noticed however, was that the video file itself (in playback) is prone to random freezes, and then trying furiously to catch back up to itself.  I tried converting the file to WMV, and that seemed to go ok, but the random time glitch seems present still.  This was before they reqired another update. Now I can't get my program to update, and this is entirely moot. Hoping it is fixed shortly so I can play around with it more.  UPDATE: The program runs now, but the video converter seems borked. I can't get it to recognize that I've selected an original file to convert. Hoping this is remedied soon.",
            "review_score": "1"
        },
        {
            "review_text": "i recomend this very good for people not looking to spend alot i bought this on sale for 13 dollars but dont spend 30$ for that you can get fraps which in my opion is a little better ",
            "review_score": "1"
        },
        {
            "review_text": "Great piece of software just one thing is that I can't turn on my game audio for some reason.",
            "review_score": "1"
        },
        {
            "review_text": "this freaking soft ware is good but does f**k sh*t where you cant use it for ever athere is no method to fix it so unless you want to buy a software that freezes,stop working,and will glitch so much that you cant even open it be my guess",
            "review_score": "1"
        },
        {
            "review_text": "Amazing recording software, I personally havnt seen any less performance depending recording software. I highly recommend using this product.",
            "review_score": "1"
        },
        {
            "review_text": "Wait for a 90% discount and grab it. It's full of bugs and crashes, but once you get the hang of it, it's possible to record your gameplays.  Or use Fraps instead, because it always works.",
            "review_score": "-1"
        },
        {
            "review_text": "Well I've seen alot of people record, and wanted to try it so i got this product :D I'm in early learning :P But anywho back to review!  I think there's really nothing wrong with it :), got it when it was on sale which is a bonus! It records pretty smooth, and i'd suggest getting it :D  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a great recording software and I would recomend it for most people starting a youtube channel on games! The only troble I have with this gam--software is that you can not turn down the game volume on the software--but none the less I recomend this software!",
            "review_score": "1"
        },
        {
            "review_text": "The short version: It doesn't work. Do not buy this it is a waste of money and you CANNOT get a refund. Period end of sentence.  The longer version: It is very, very buggy. Prior to writing this review I e-mailed back and forth with the company multiple times to try and troubleshoot my myriad problems. I don't like to post anything negative unless I absolutely truly feel that way, and this program is beyond fixable. I also went so far as to attempt to get a refund because again, my issue is not that I don't like it, it's that the product is plain flat out not functional. I kid you not when I eventualy e-mailed the company to ask for a refund as well as to troubleshoot some additonal problems they actualy ignored my question about the refund. They responded to my e-mail but plain flat out ignored the question until I asked it again. Don't find yourself in a bad situation get FRAPS, Action!, or anything other than this. You will be glad you did.",
            "review_score": "-1"
        },
        {
            "review_text": "Can I have my make back? lol ill never use this software again. FRAPs is better i wish someone told me about it before hand.",
            "review_score": "-1"
        },
        {
            "review_text": "100 FPS Game Capture is a marvellous software, and it competes closely with Fraps. It's controls and settings are easy to understand and use, captured footage is sharp, smooth, and overall quite nice. It can record both game and microphone sound, saving time in post editing.  However, these qualities are matched by the large file sizes, but if you'd want to upload these videos onto websites such as YouTube, compressing is recommended. That is actually one of the only complaints besides the price, it's best to buy this on sales.",
            "review_score": "1"
        },
        {
            "review_text": "Pro's : Can't freaking find any  Cons: Crashes a lot Sometimes The recording bugs When you record your full screen it records its own sidebar If i hear 'Recording available' one more time ill kill myself You can't change webcam size, it always takes up 1/4 of the screen. You can only change it while you are recording Audio bugs a lot Game Audio doesnt record all the time  I payed to much money for a recording program that is faulty , buggy as ♥♥♥♥. If i am right it is illegal to give us a product that is not in beta/alpha that is buggy and doesnt work properly, this program needs to go off the market and needs to refund us all! I would NOT recommend this program because you won't have a great time with it!  ",
            "review_score": "-1"
        },
        {
            "review_text": "I would highly recommend this software, it has alot of customization tools to get the perfect recording, and unlike most screen cap programs this one is built in with a facecam option. if youre looking to start up a gaming channel i highly recommend litecam.",
            "review_score": "1"
        },
        {
            "review_text": "NOT GOOD, DO NOT BUY CRASHES EVERY TIME I OPEN IT.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice product, but needs another recording for sound ",
            "review_score": "1"
        },
        {
            "review_text": "Very easy to use.",
            "review_score": "1"
        },
        {
            "review_text": "all i've got to say is.... Meh",
            "review_score": "-1"
        },
        {
            "review_text": "I find it runs really well and is a really good software for the price. But if your game does lag i find it will slow the video down and will exaggerate the lag.",
            "review_score": "1"
        },
        {
            "review_text": "this is just a waste of money fraps is way better",
            "review_score": "-1"
        },
        {
            "review_text": "Having problems with PIP, it does recognize the webcam, but keeps saying it is being used by another program",
            "review_score": "-1"
        },
        {
            "review_text": "I have been using this program for a while. Do NOT get it. Use Action! And don't buy Action! on here. It's the commercial version. If you google Action! recording, you will get the homepage and can buy the home version for $30, which is not only the same price as this software BUT it records sooooooooooooooo much better.  Lite cam gave me so many issues later on. It wouldn't record properly, it barely picked up my microphone, and it would stop responding all the time.  Lite cam does work once in a while, and is easy to use, but Action! is easier to use, automatically lets you output to .mp4 instead of .avi (which is a huge difference in file size I might add) and it sounds GREAT.  That is my review. Take it or leave it. Just don't come crying back to me when you pay $30 for this piece of crap program, then spend another $30 on the program you should have bought.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a basic game capture program but it does what it says it will.",
            "review_score": "1"
        },
        {
            "review_text": "Update from last time: Lite cam is working a lot better. It still crashes aftet every session, but it does it a little more smoothly, I guess thats the word. It doesn't crash and stop me from doing anything else, I can stay in steam and not have to restart it. It works better now. And with fixes like this, it should get better real quick.",
            "review_score": "1"
        },
        {
            "review_text": "The Video Converter does not work and there is no option for mp4 recording.",
            "review_score": "-1"
        },
        {
            "review_text": "It works when it wants to. I try to record but it just records audio now, and when it crashes, it takes whatever game I'm playing with it...very annoying...1/10   Graphics suck too...",
            "review_score": "-1"
        },
        {
            "review_text": "I put the adminstartor and nothing helps",
            "review_score": "1"
        },
        {
            "review_text": "Its great beacause it work",
            "review_score": "1"
        }
    ]
}