{
    "app_id": 269330,
    "name": "Chronology",
    "release_date": "2014-05-12",
    "developer": [
        "Bedtime Digital Games"
    ],
    "publisher": [
        "Bedtime Digital Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Platformer"
    ],
    "achievements": 0,
    "positive_ratings": 412,
    "negative_ratings": 59,
    "price": 3.99,
    "description": "A platform-adventure game about time travelling, puzzle solving and a friendship between an Old Inventor and a Snail.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/269330/header.jpg?t=1536831347",
    "minimum_requirements": "OS: Windows 7 or 8 Processor: 1.8 GHz Memory: 2 GB RAM Graphics: 4/5th Generation Intel HD Graphics (4000/5000) or AMD HD Graphics 7th series DirectX: Version 9.0c Storage: 900 MB available space Sound Card: OpenAL compatible Additional Notes: Controller Support: Microsoft Xbox 360 Controller for Windows",
    "recommended_requirements": "OS: Windows 7 or 8 Processor: 2 GHz or faster Memory: 4 GB RAM Graphics: Dedicated GPU (NVidia or ATI) with at least 1 GB of VRAM DirectX: Version 9.0c Storage: 900 MB available space Sound Card: OpenAL compatible Additional Notes: Controller Support: Microsoft Xbox 360 Controller for Windows",
    "reviews": [
        {
            "review_text": "Chronology is a fairly short but fairly fun puzzle platformer that will has a delightful story and uses gameplay mechanics similar to Giana Sisters without the brutal difficulty. The story is about an old scientist who wakes up in a devastated post apocalyptic world and finds an item he can use to go back to the past. He uses this power to go back and confront his mentor who is the cause for destroying the future. Along the way he meets a genetically engineered snail with the power to freeze time.   I found the characters heartwarming especially the snail. The old man had a bit of a crotchety disposition but it's understandable if your mentor plotted behind your back and used your research to destroy the world. Who wouldn't be a bit crotchety about that? Overall I found the story fun, the puzzles were well done and I only looked to a guide to figure out one of them. So to sum it up, this is a nice little family friendly game. Featuring solid controls and puzzle mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "It's as timey wimey as it gets. My favorite part of this little game is when I break old geezer's leg in his childhood. Meh, he's a minor character anyway and sacrifice was needed in order to save the world. I can't help but compare Chronology to The Silent Age (another timey wimey game), and in my mind a game like that shouldn't be too easy like The Silent Age. Chronology has everything: good puzzles, rememberable characters, sacrfices, anti-hero and a deadbeat villain.",
            "review_score": "1"
        },
        {
            "review_text": "A couple of thoughts about:  Chronology",
            "review_score": "1"
        },
        {
            "review_text": "Fun game with some very interesting mechanics :) Really like the audio and visuals.  If your into puzzles this is a great game.",
            "review_score": "1"
        },
        {
            "review_text": "There is some charm, but it just feels like it could have been better.",
            "review_score": "1"
        },
        {
            "review_text": "...catapults me in a happy mood and relaxation  while helping our two cute ''heroes''  on their way to .... Fun, tricky little puzzle-solving-sidescroller  : ))",
            "review_score": "1"
        },
        {
            "review_text": "🌟🌟🌟🌟",
            "review_score": "1"
        },
        {
            "review_text": "I liked that this game kept it simple, short and sweet.   Good puzzles, a bit easy for the most part -but it also made for good pacing without dragging on and overdoing new gimmicks like many other puzzle platformers.  ",
            "review_score": "1"
        },
        {
            "review_text": "Nice puzzle game. I liked to travel between past and present to solve the puzzles. Nice graphics. I didn't like that I finished the game too quickly, because I found it a bit too easy. Bago games mentioned that this was a mix between LIMBO and Braid, however those games provided me with a more interesting and longer gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Good puzzles, graphics and musics!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and wise game.. Love it!",
            "review_score": "1"
        },
        {
            "review_text": "No matter how short it is, it's actually a fun puzzle platformer with unique mechanic worth to try. Some people say it's childish, maybe they're right, still, it has enough challange to anyone for a relaxing gaming. Also i didn't expected an end credit song like this from a game like this, i liked it.",
            "review_score": "1"
        },
        {
            "review_text": "Being a lover of Platformers, Time Travel, and Indie games, I knew that I had to pick this one up when I finally discovered it. It's a simple platform game but the puzzles involved make very challenging at times. I have to say what I loved the most about this game was the art. I found it beautiful and I loved how detailed everything is for a 2d game. The soundtrack was a nice background to the whole game. I really liked the song they used during the credits. I think the only downside to this game is how short it is. I would have loved to continue playing, I had a lot of fun and there were quite a few chuckles to be had over the commentary between the two characters.  All in all it's a decent price but if you can get it on sale like I did, then it is a game I highly recommend you pick up.",
            "review_score": "1"
        }
    ]
}