{
    "app_id": 269490,
    "name": "Bardbarian",
    "release_date": "2014-04-01",
    "developer": [
        "TreeFortress Games"
    ],
    "publisher": [
        "TreeFortress Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Strategy",
        "Tower Defense"
    ],
    "achievements": 22,
    "positive_ratings": 1232,
    "negative_ratings": 159,
    "price": 5.59,
    "description": "You play as Brad the barbarian, who is awoken to the sounds of his town under siege. Today is different though; Brad has grown tired of fighting all the time. The usual grind for XP has grown dull, and he has decided to pursue his dreams of making music instead of shedding blood.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/269490/header.jpg?t=1469579820",
    "minimum_requirements": "OS: Microsoft® Windows® XP, Windows Server 2008, Windows Vista® Home Premium, Business, Ultimate, or Enterprise (including 64 bit editions) with Service Pack 2, Windows 7, or Windows 8 Classic Processor: 2.33GHz or faster x86-compatible processor, or Intel Atom™ 1.6GHz or faster processor for netbook class devices Memory: 1024 MB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Bardbarian 'is a mixture of Tower Defense, RPG &amp; RTS with some 'Shmup and Snake elements'. I have no clue where the RTS element is.  It's essentially a game about defending your town crystal from incoming waves of enemies. How do you defend it? You summon party members with different abilities, and you run around dodging bullets and buffing your party (you do not control your attacks, that's all done automatically).  When I saw this game, I thought it looked interesting enough to give it a go. The reviews were surprisingly positive, so... why not?  I'll just say that I was extremely disappointed with this game, and the reviews are unbelievable. I honestly don't know why people think this is a good game of PC! Here's a more lengthy analysis.   First off,  presentation . The  graphics  look a bit average to me, but they're fine. What you see is what you get (from the screenshots). One problem with it, is that it's highly repetitive, even visually, since you have only one map for the campaign. And it doesn't really change its look. Other modes have different maps, but nothing beautiful or interesting.  They're  fine . That's all I can say about it.  The  music  was actually not bad. It's almost neo-classical metal, instrumental only. Unfortunately, there's only one song on the campaign. The song loops the entire time, which can (and does) get repetitive after listening to it hours on end. The song loops pretty seemlessly, so that's good (from what I could tell). It was just background music, didn't really add to the experience.  There were no volume sliders either. Only music/sound-effects on/off.  Very limited  overall. A bit more effort and it could have been much more enjoyable, but playing the same track over and over and over... not good.  The  interface  was fine. The mouse support works fine on the menus. I played the game with a Gamepad and it worked well as well, so good job on that. Unfortunately, the concept of an Options Meny seems to be very foreign to the developer. There's barely anything, which is really annoying. But hey, at least it had rebindable keys! It's.. again, fine. Nothing noteworthy here, it's missing a bunch of options, but it didn't really prove to be a problem, in my experience.    So, how's  gameplay ? Well, it's a grindfest. Almost a waiting game... As I said, you don't actually attack. So, your whole job is to summon party members, and run around the map, getting close enough for your party to attack. You can also boost the party with +Attack, +Speed, +Defense, or a special Stun ability. If your party member dies, you'll have to summon them again, at a cost. If you Bard dies, or your Crystal is destroyed, you lose. Simple enough.   To summon units and use buffs, you'll need to gather 'Notes'. You gain a few over time, and you get some more from enemy drops, sometimes. And that's pretty much it, as gameplay.  Enemy variety was pretty good. They'll shoot at you, with some of them being faster, some firing multiple shots, in multiple directions, etc. It felt inspired by The Binding of Isaac (in a good way). That's not to say that the enemy variety is even remotely closer. Not at all. There are about 10 different enemies, and some of them are fairly similar.   So, all you have to do is literally run around, for the most part. And it gets very old, very fast. It's clearly designed as an iOS game... And a lazy one. It does have some bullet hell elements. And those could have saved the game! But, there's a huge problem with that. As I mentioned, you have units. These run around you. Which means that your hitbox is huge, and very inconsistent. You simply can't do those awesome dodges you would in a bullet hell. There's no way.  There's an upgrade on the shop for the party to stick closer together, but it barely helps... Everytime you move, they'll stay a bit behind, which would be fine, but it provides nothing of worth! It simply inutilizes most of the dodging. Which means that you'll always play safe, run around, not feeling like a badass. That's all the gameplay is. Running around.  The Boss fights were significantly better, but still not very good. A few simple patterns, but they at least felt more refreshing.  The second part of this game, is the upgrading system. The game is structured with 4 times of the day, each with 5 levels (a Boss Fight in the 5th). Once you beat a Boss, you can't start from that point after you die, or you can go back to the beginning. This could have been fine, but it isn't. The upgrades are absolutely necessary. It's literally impossible to make any progress without upgrading everything. And that's usually how games go, but this is different. Your progress is 95% affected by your upgrades. There's no skill involved. It's a question of either having enough damage, or not having it. Even if you're a good player, you'll simply be overun by enemies that will rush you crystal. Once you die, there you go upgrade some more, and then beat it easily. And that's the whole game. The upgrades aren't at all interesting.   They're just that, upgrades. More damage, more health, more speed, more money, more notes, etc.  This makes for a very, very stale game. You're always doing the same thing! Running around, collecting gold so that you can buy more upgrades, until you reach the end. There are no deep mechanics to learn or master, no strategy, no anything.   The only glimpse of strategy, is choosing your units. You'll unlock different units throughout the game, with different abilities. There's a huge problem with it, though. First off, some of them are pretty much useless. They're not helpful at all, so there's no point in even existing. The other problem, is unit upgrades.  You can upgrade them too (see it as levels, basically. higher level=better version of the unit, simply that). BUT, if you want to test a unit, and see if they're any good, you'll have to upgrade them to the same level that your other units are. Otherwise, you can't compare them very well, can you? But, to upgrade them, you'll waste gold, that you only want to use in a unit that you know will be useful. And this is where the system falls apart.   To try the unit, you'll have to waste gold already, otherwise, there's no point, as they'll be incredibly underpowered. This makes it a waste of gold (which equals to a waste of time, as your play time is simply to collect enough gold to make progress!).  It's broken and pointless . This leads to a very limited cast of characters. I stuck around with most of the initial ones because of it. And I've done fine. Different characters could interact differently, but when the gameplay is literally just running around, it makes almost no difference! You don't play with the characters, they play themselves.    To its credit, there are 2 other game modes. One is just survival, in which you get a random unit spawn that you must collect, and sometimes food (healing). There are bosses, from time to time, and the enemies will try to kill you (no crystal this time). The other one is an infinite runner mode, you a few stationary enemies (pretty much towers), and randomly spawned obstacles. Both of these modes unlock 2 cross-over characters, so you are encouraged to try them out. The achievements were... meh. Barely anything to encourage you different (and interesting) character combinations, which is a really big miss. They're mostly for beating each Boss, unlocking characters, upgrades, etc. Nothing interesting. And that's unfortunate.    Conclusion  This game is literally a waste of time. You'll collect gold to buy upgrades and progress in the game. You'll not learn how to master the mechanics the more you play. You won't feel any kind of rewarding sensation whenever you beat a Boss.  The game has potential, but ends up feeling like a lazy iOS game. You'll be entertained for 1-2 hours. Not more.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a bard, it's a barbarian. No, it's Bardbarian! Castle defense never felt so...musical? There's actually a fair amount of fun gameplay running around and killing waves of monsters and bosses. Plus the decent amount of unit types makes for a lot of different play styles. Definitely worth whatever bargain price you pay for it.",
            "review_score": "1"
        },
        {
            "review_text": "Decent tower defense. Feels a little too much like a mobile game for my true liking.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game on sale and I barely payed a dollar for this game. This game is a creative tower defense and it seems like it'd be a fun app but its more then an app for your phone because I dont regret buying this. It is addictive and you can just read any other reviews and the majority agree with me. This is a very fun Game and i am loving it so far and It seems short but its longer then some games ive played. Infact the game goes on for ever there is always something to do and you can challenge your friends to be better then you or beat your score on certain gamemodes. I recommend this game while its on sale and while its not. Worth buying 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Tower Defense Game.   Even if im more of like 'modern gamer' I enjoy playing this game. Theres trading cards , its cheap , controller support , what can be better ? I really enjoy getting to next levels. Though its really hard to get alot of money and get passed the levels and get acviements. But well , I love this game.   Right now this is my FAVOURITE tower defense game.  I think they should add multiplayer or co-op in the game though. That would be awesome. If you could play in co-op with 2 controllers or 1 keyboard and controller and in multiplayer mode with your friends , online ! That would be epic !   The cartoon style in this game brings that enjoyment. Its really nice looking and totaly worth your money and time. I recommend this game to everyone , every gamer. Modern or old style.",
            "review_score": "1"
        },
        {
            "review_text": " A decent 'tower defense' game where you play, get gold, die, buy upgrades, and repeat until you're finally able to fend off all the advancing hordes.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite indie games of all time. Very easy to pick up and play, very addictive and never unfair. Get it at full price.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little defense game. Definitely worth a few sessions. Kinda feels like a light version of Orcs Must Die. Basically you play until you get beat, then you use all the money you earned during your attempt to upgrade your guys to make it a little further the next time you try. I recommend an Xbox controller, but totally playable with a keyboard too.",
            "review_score": "1"
        },
        {
            "review_text": "it's a bullet hell X tower defense. the art style is nice and the music adapts to when you use boosts (which is a nice touch)  strangely compelling",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. I like games where you can grind gold and other stuff and then upgrade your units, hero, town... . It is short but good, just like games should be. In the game itself you have to protect your town crystal and try to not die. You have to fight the incoming waves of always getting stronger enemies. What I also like is that you can fairly achieve all of the achievements to get the 100%. I strongly recommend this game, especially because it is not that fame.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine Plants Vs. Zombies if the plants had legs and you'd get a fairly close representation of this game.  Pros: - Solid controls - Nice art - Fun gameplay - You really feel a sense of progression as you replay the levels with stronger guys. - Multiple difficulty levels and game modes. - Lots of replayability (to a point)  Cons: - It can feel really grindy. The best way to get money is to start from Wave 1, but by the time you're comfortably passing wave 6 or 7 the earlier levels just stop being interesting. - The song is nice for the first 2 hours. Then you're over it. - Using the controller, there will sometimes be a bug where you can't use any of your powerups (special songs). This is basically game-breaking on insane mode. - The extra game modes (survival, distance) are a little lame. It's neat they're there, but they're not very interesting. - A few weird art decisions/errors. Some of the boss animations bug out upon defeat, and there's a few characters with poor/weird art choices (the zombies are in the style of Paper Mario, for example).  It's awesome fun. Pick it up on sale and you won't be dissapointed. 12 hours to 100% completion. Probably around 3 to play through the inital game once.",
            "review_score": "1"
        },
        {
            "review_text": "Bought in humble store at less than 1$, this game gived me lot of fun !   Who knows controlling a metal bard playing with his golden axe, summoning fellows like Isaac on Meat Boy's back and helped by a ratoon, in order to kill devil monsters who want to destroy the crystal village could be so addictive ?  On my way to the last achievement ! Finishing insane mode is challenging ;)  Skill &amp; Controller recommanded, and have fun :) Worth the money !",
            "review_score": "1"
        },
        {
            "review_text": "Bardbarian, is simply a game that mixes Tower Defense with RTS elements. As an advocate for strategy games, this game has a unique flavour which contributes to the atmosphere of both the genre and the game.",
            "review_score": "1"
        },
        {
            "review_text": "Bardbarian is a great game. You fight to survive against waves of enemies while also defending your town. You don't directly attack enemies. Rather, you play as a Bardbarian who shreds on his axe (this 'axe' being an actual axe, not a guitar), summoning other classes to aide you. There are quite a few classes to unlock, each with its own uses. You can level up these classes, and you can even level yourself up in the process. You can even employ the help of the townspeople, even the town drunk.  I highly recommend this game. It's tower defense done right, and I'd argue that even people who don't tend to enjoy tower defense games should give it a shot. It's that good.",
            "review_score": "1"
        },
        {
            "review_text": "This game was a positive surprise for me. The game is about a former barbarian who was sick of fighting with weapons and decided to turn his axe into a lute. With his lute he summons different warriors by his side to attacktheir enemies. The game is a basically a tower defense game but you can only place towers next to your character, and then you run around the field protecting the village crystal. It's a common concept with it's on twist, and the music is really good. Charming graphics and nice controls makes this a fine game. You also have 2 other game modes except the story. Survival which is one big screen, lots of enemies, and you running in circles to survive. Then we have Escape mode, which is screen scrolling mode, where you simply try to escape the darkness coming in from the left. In total the game has many hours of gameplay, and lots to give. 7.6/10",
            "review_score": "1"
        },
        {
            "review_text": "Cool game! Excellent mix of Tower Defense, Rogue-like games, RPG. Despite graphics (Flash) and simple game mechanics, it's highly addictive and can keep you sit tight for more than 2 hours at one time. Highly recommended for all users!",
            "review_score": "1"
        },
        {
            "review_text": "Overall, a good reccomend even for PC. A must grab on sale! Exteremely smooth and cute time-sink.    TowerDefense where you walk around with your towers to gaurd you, and kill stuff.   Major Grindfest, but overall extremely cute and addictive. Interesting level progressing, nice indie tie ins. Octodad reference, SuperMeatBoy, the usual.",
            "review_score": "1"
        },
        {
            "review_text": "This was a weird one. Bought it because it was $1.99, I think. Could not stop playing it. Goofy and fun gameplay that gets right under your skin and scratches an itch you didn't know you had. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Really fun tower defense game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty awesome in its simpleness.  This game is for the gamer who doesn't like to learn a ton of stuff only to be able to play the game propperly. Sometimes reffered to as the 'casual gamer'.   Everyone has his moments when you're hungover, sick or just lazy and want to play a game, but don't want to read books about the fluffin' story. This game is just that. Fun, upgrades, simple and original.  The graphics are okay and it's absolutely worth the money.  Get it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game, a fun game, but as of right now, the achievements are bugged. If this is a relatively important thing to do I would be highly advised before buying this title. If not, have at it. Its fun.",
            "review_score": "1"
        },
        {
            "review_text": "Good little time waster. Nothing special. If its cheap and you like a different take on the tower defense genre try it.  Considering it was $2 when i got it 75/100",
            "review_score": "1"
        },
        {
            "review_text": "This is a cool game the controls are simple and cool :D first time i played it and given it 3 hours :P Totaly recomment it if you like games of its style ^.^  ps. awesome art and referances :D",
            "review_score": "1"
        },
        {
            "review_text": "One of the best tower defence games i have ever played. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "great game will get 10+ hours out of it if it gets updated more then will prob be my favorite game of this year",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! For me, it was a surprise hit when I first bought more than 6 months ago. I recently picked it again. It's just as awesome as I remember it. I even decided to make it my flagship game for starting my YouTube channel, The Gaming Dwiz. I highly recommend it to all types of players. Enjoy it and recommend it even further!",
            "review_score": "1"
        },
        {
            "review_text": "This is a super fun, addictive game! Recommend playing with controller for best experience. Run and gun style tower defence that provides tons of entertainment.",
            "review_score": "1"
        },
        {
            "review_text": "I did not know what to expect when i bought this on sale. Thought maybe i'll play it one hour until i get bored...  Game is highly addictive and i highly recommend it. wont regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Buddy bought it as a joke, turned out to be an awesome game. It's cheap, just buy it, I've been playing it alllllll day!",
            "review_score": "1"
        },
        {
            "review_text": "It's hard without a controller, but it's quite original and fun.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the time I spent playing this game. There was still more for me to do when I gave it up (abilities to unlock, companions to upgrade), but once I beat the 4th boss in story mode, I'd had my fill. After a couple of hours, I turned off the background music and listened to podcasts while playing…",
            "review_score": "1"
        },
        {
            "review_text": "A cute little game with the addictive qualities of both tower defense and bullet-hell games. =-=-=-=-=  ADORATION: Great Price,  Excellent Replay Value,  Leaderboards kept on Steam,  Charming and colorful,  Plenty of gameplay time for my $8.  'Tower Defense' rather cleverly combined with 'Bullet Hell' tactics.  CRITICISM: I know its also a bullet-hell game, but the tower defense bit is badly balanced. I was juggling the toughest enemies in the game with push-backs and stun before it was even close to over. Waves 1-18 are child's play, and then 19 and 20 will kick your ♥♥♥ if you don't have a balanced party of stuns, slows, and push-backs at your desposal. I felt too powerful most of the time in Normal Mode, making it feel kind'a grindy.   TIPS TO THE UNWARY: -Skip normal mode and play on insane. You'll do less gold-grinding that way, and the game is actually better balanced. You also won't have to play the game twice to get all the achievements. (I got all but one)  -Don't forget to SCROLL DOWN in the unlockables and permenant upgrades screens. I didn't get the 'double your gold' item until almost the very end, and felt very much the fool for it.  -The wizard's pushback/stun is the most potent thing in the game. Upgrade him early and JUGGLE all your enemies!   TDLR:  Definitely recommended! :D",
            "review_score": "1"
        },
        {
            "review_text": "very fun!   you are Brad, a barbarian in charge of defending the town, who got bored of midless brawling and decided to become a bard. so you into this arena and have to defend the town against waves of monsters. the goal is prevent them to destroy a big diamond (kinda like the emperium in WoE, if you've played ragnarok online). to do that, you summon some fighters by playing solos with your axe-like-guitar. you can also play solos to buff yourparty, one for attack, one for defence and one for speed. there is also a stun solo, which you can use after playing a few songs (5 in a row if i'm not mistaken); this stun solo does literally what it says, leaves all foes inside a certain radius paralyzed. to perform your songs you spend musical notes, which generate with time (faster when you stand still) or when it drops. monsters also drop gold, which you can use to buy upgrades (buffing summons, buffing songs, increasing your life and many others).   there are also two other game modes: survival and i forgot the name of the other one. but i haven't played them yet.   in my oponion, only two problems:   1) every 30 minutes there is a bug that doesn't allow me to play the solos anymore. i have to restart the game so it starts working again. the first two times, you think that's ok, but it gets very annoying when it keeps happening.  2) the soundtrack is cool, but mind-numbing repetitive. even the solos and the summoning songs are cool at first, but get boring once you've heard them for the 100th time.  other than these two issues (which are frustrating) i think this is a very cool game!",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun little tower defense game.  The only downside is that it gets repetitive and grindy once you made some progress, at least if you want to unlock all achievements.",
            "review_score": "1"
        },
        {
            "review_text": "Shredded on an axe while a turtle with a machine gun on its back shot goblins throwing rocks 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty fun from what I have played and I love the other game references in it (Octo-dad, The Binding of Isaac and I don't know what that turtle character is from)",
            "review_score": "1"
        },
        {
            "review_text": "Fun for a few hours after stressing out on other hardcore games",
            "review_score": "1"
        },
        {
            "review_text": "Great game for spending a few hours on when you have some spare time, definitely worth a try for the price.",
            "review_score": "1"
        },
        {
            "review_text": "Best Bullethell Tower Defence Rogue-Lite Left-Thumb workout RPG I've ever played :D Tons of unlocks and unit combos",
            "review_score": "1"
        },
        {
            "review_text": "While this game is fun for a short while, it get's pretty repetitive. It also has quite some bugs and an uncompleted localization with no option to change the language. Overall it feels more like a beta then a polished product. Conclusion: The game itself is enjoyable for a short period of time, but if you are bored fast, don't like guitar music, are easily annoyed by bugs or genereally are low on money, don't get it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is simply perfect",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy playing this game with my Xbox controller chilling on my couch… 1 Healer rest Ninjas for lyfe :3 You gotta love the raccon that is collecting all the loot&lt;3",
            "review_score": "1"
        },
        {
            "review_text": "A certainly silly game. I suggest it to anyone who wants some laughs and some goofy artstyles.",
            "review_score": "1"
        },
        {
            "review_text": "So you take a classic game like Snake, then add a pinch of Plants Vs. Zombies, a dash of Danmaku style shooter, and wrap it all up with a power metal soundtrack and what you get is Bardbarian. You seriously need to experience this insane and awesome genre mash-up for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Filler game. Grindy indie game where you collect powerups for your rock-music fuelled viking to fend off evil hordes. Not memorable.",
            "review_score": "-1"
        },
        {
            "review_text": "Entretaining.",
            "review_score": "1"
        },
        {
            "review_text": "Tedious, boring and non-inspired. Seriously, go to Kongregate or similar sites and play games like this for free.   I'm not sure how this game got very positive, since it really does not do anything innovative but neither are the base mechanics fun.   Spend your time and money elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "I cannot stop playing this game. So much awesome.",
            "review_score": "1"
        },
        {
            "review_text": "I am very disappointed. Altough the game looks good, has nice graphics, interesting RPG elements, it is absolutely unplayable for me. I am running Mac OS X 10.8.5 and the average framerate is 5. Please optimize the performance of this game. I just wasted 5 Euros.",
            "review_score": "-1"
        },
        {
            "review_text": "not bad, i enjoy it's game play",
            "review_score": "1"
        },
        {
            "review_text": "This game has the potential of being fun. Unfortunately, I use the aroow keys to move, and there is no place to change the key bindings. Using the keyboard letters for everything, slows me down.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is absoulutely amazing! See what i did there? ",
            "review_score": "1"
        },
        {
            "review_text": "Tower defence without towers, but you got to play a cringeworthy stereotypical rock themed dude playing the guitar to do anything... bad gameplay, stay away",
            "review_score": "-1"
        },
        {
            "review_text": "Wast of money",
            "review_score": "-1"
        },
        {
            "review_text": "This is a pure gem for every beard and metal fan. It feels like a tower defense and the upgrades really make it rewarding. The survival mode and the run-away mode are fantastic if you've had enough of the story mode. 11/10, would pay again for it!",
            "review_score": "1"
        },
        {
            "review_text": "Way too much grinding needed just to get to the next wave.",
            "review_score": "-1"
        },
        {
            "review_text": "i like it so far i did not expect a lute axe thing as a weapon that summons allies to help you fight its just a good game",
            "review_score": "1"
        },
        {
            "review_text": "This is the spin that the tower defense genre needed in order to actually be enjoyable. The game has an excellent sense of humor. Absolutely worth your money even if it's not on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, stupid, hilarious and addictive, grabbed it cheap but would pay full price. Lots of different units to try out and find a group that fits how you play. Love the final boss!",
            "review_score": "1"
        },
        {
            "review_text": "Ranging from its multiple character classes to its gala of easter eggs, this game screams fun. Creating different parties adds a tactical element to the game, allowing for many play-throughs. The upgrades provide a sense of accomplishment and the survival and escape modes offer more for one who completes the main game. Overall, while it can be classified as a standard iOS port, this defense game breathes a sense of enjoyment.",
            "review_score": "1"
        },
        {
            "review_text": "Its a mobile game ported to PC without much addition from what I can tell. Youre playing one map over and over with very slow progression (unless you play one insane mode apparently.) It starts out pretty fun but quickly becomes repetative and boring. Youre going to have to replay the same bit over and over and over to upgrade your units to advance.  There isn't much skill involved. Its mostly just a level your guys higher than what you are fighting and you win.  I would have liked to see different parts of the town for each section to help vary it up a bit. It would have also been nice to have something for the player character to do as youll just be running around letting the npcs do all the work.  The soundtrack is good but its just that. A track. As in singular. It plays on repeat the whole game and gets old pretty quick.  All in all I dont feel the game really belongs on PC with the minimal effort put in to the port. It wears its welcome out realy quick. However, I would imagine it would be alright in short 10 minute bursts on the toilet. So if your pc is in the water closet then go for it I guess?",
            "review_score": "-1"
        },
        {
            "review_text": "'tis silly, but good.   Cute time waster, recommended.",
            "review_score": "1"
        },
        {
            "review_text": "do not play this game waist of my money",
            "review_score": "-1"
        },
        {
            "review_text": "Bardbarian is a cute casual wave survival game.  The story doesn't exist, so check that off. The graphics look cartoony and nice. It's pleasing to the eye for sure.  It runs well. The achievements are easy to get and the soundtrack is really good. After writing this review, I'll find a way to get it.  You can play the game on either normal or hardcore, but all achievement hunters should want to play on hardcore.  After that you have the main survival mode, runner mode and a Day 2 mode that unlocks after the game's been beaten. It's all good and fun. It works and that's what matters.  Overall, I'd recommend this game if you want a casual experience. 5/10  (All games start off at a 5/10 and the grade raises and lowers for every pro and con present)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun tower defense game with free-roam Plants vs. Zombies style and Rogue Legacy-like upgrades in between. It has a slow, seemingly casual start but ends up having quite a bit more upgrades and challenge you might expect.",
            "review_score": "1"
        },
        {
            "review_text": "A fun take on a Tower Defense game. I never played the mobile version of it, but it controlled easy enough with keyboard/mouse combo.   Wasn't terribly challenged, and managed to get full achievements in roughly 8 hours.   ",
            "review_score": "1"
        },
        {
            "review_text": "Fun little game. It's better than it initially appears.",
            "review_score": "1"
        },
        {
            "review_text": "This game is somewhat buggy right now, sometimes the cursor disappears and I had a few instances of the game not being able to close, making me force close steam.  That being said, this game is a solid fun game that is Plants vs Zombies/Raiden Fighters + RPG elements Since I enjoy both of those games, I definitely enjoy Bardbarian. The controls are simple and straightforward, with nice variation between units. If you prefer to play an attacking, speed, or defensive playstyle, you can change the song to adapt to your needs. The game is tough enough to be challenging and the enemies are varied enough to be interesting/not super repetitive.  Lots of variation/unlockables and gotta love the MeatBoy crossover. If they can clean up the bugs I would wholeheartedly recommend, as of now its a yes with precaution.",
            "review_score": "1"
        },
        {
            "review_text": "What a fun, innovative and fresh game! Bardbarian combines elements of TD (such as waves of enemies) and Hack 'n' Slash (you control the main character and can cast spells at command). The learning curve is quite flat, as the controls are easy and promptly explained, but you will need to spent quite some time to unlock everything there is and trully finish the game. Make no mistake, this is not a 'just a couple of minutes' game. Without noticing, you will spend the whole day jamming your way out of those hordes. Bard on!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, but a bit repetitive in nature. A great twist on tower defense.",
            "review_score": "1"
        },
        {
            "review_text": "This is the kind of game that you play after after a long day. it's easy but not too easy. I stayed up all night just to get 98% of the achievements :P Worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "A very nice spin on tower defence.   You spend whole game dodging projectiles while spawning units and using special abilities. Visual style is very nice and appealing.   Definitely one of the better mobile ports on the market if you don't mind it's somewhat grindy nature.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly enjoyable game to play for a few hours. The waves are becoming more difficult each era (morning, noon, evening, night), but after using the upgrades the first waves become tedious, and only a means to gain coins for new upgrades. Furthermore, the game's challanges are really nicely constructed, but sometimes a bit frustrating, because of the lack of adjustments to the point of view. TL;DR play this game, it is a lot of fun!",
            "review_score": "1"
        },
        {
            "review_text": "UPDATE: New version seems to have fixed the issue with left trigger. Changing my review to recommend even though there is a sound glitch where the music stops playing and you cannot do any buffs. Not being able to buff is not as bad as not being able to summon followers.  Fun game with serious control glitches. I wish I could give this a thumbs up, but the control glitches are very severe and require you to restart the application. I use a wired Xbox360 controller to play the game. The left stick is movement, which works all the time. The right stick allows you to rotate melee or defense followers to face the enemy. This sometimes glitches, but not game-breaking. The buttons lets you jam out buffs or summon new followers. You toggle between the 2 modes by using the left trigger. This part glitches CONSTANTLY. Every single time I've fired up Bardbarian, I have run into that glitch. Here are the types of glitches I've run into so far. 1) The stun skill cannot be cast at all. 2) I cannot summon followers or cast buffs. 3) I can only summon followers. 4) I can only jam out buffs but not summon followers. Most of these glitches are game-breaking. The only fix I know is to quit completely and restart. If the developers really fix this issue (they tried a fix, it didn't work), I would definitely recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great to kill some time, especially when you get bored at the phone. Really funny and nice soundtrack!",
            "review_score": "1"
        },
        {
            "review_text": "A clever take on tower defence, with a concept and aesthetic which has a degree of charm. Although content is a little limited, the gradual unlocking of characters and ability to purchase upgrades between runs gives plenty of incentive to keep trying.",
            "review_score": "1"
        },
        {
            "review_text": " Bardbarian  is an evade-'em-up game. You play an overmuscled Conan figure who has decided that he's sick of hacking foes to death and only wants to play music, which might be a more noble attitude if his village wasn't presently under siege by the usual forces of darkness. Thankfully, your music (plus money, earned by killing enemies) can inspire less-squeamish types to follow you around and do the dirty work for you. Strategy revolves around getting close enough to enemies for your followers to attack them, but still avoiding enemy fire, and recruiting and upgrading an effective mix of followers.  This game doesn't have much depth, it isn't all that compelling, and probably won't hold your interest very long, but it's just different enough from typical games to make it a good short-term casual game. If your expectations are modest, it will meet them -- that's about all it's fair to ask from a casual game like this.",
            "review_score": "1"
        },
        {
            "review_text": "one of the most and best epic casual game i ever played so addciting also has alot of tactics plus the music is so epic if you like nice music , strategy games and builds is a must buy",
            "review_score": "1"
        },
        {
            "review_text": "Love the game .. want a sequel ..",
            "review_score": "1"
        }
    ]
}