{
    "app_id": 269890,
    "name": "AR-K",
    "release_date": "2014-07-21",
    "developer": [
        "GATO STUDIO"
    ],
    "publisher": [
        "GATO STUDIO"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Female Protagonist"
    ],
    "achievements": 12,
    "positive_ratings": 250,
    "negative_ratings": 177,
    "price": 5.79,
    "description": "Filled with mystery, humor, and suspense, and brought to life in rich 3D-animation, AR-K is a point-and-click story game with a twist",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/269890/header.jpg?t=1538650366",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Atom Memory: 1 GB RAM Storage: 3300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "IMPORTANT - This game is half finished. Literally - only two of four episodes are done. The only reference I've seen to this is in other user reviews, so... yeah. Be aware of this.  In brief: An very patchy game with potential, and it's hard to argue with the price, but ultimately not recommended due to poor puzzle design and interface issues.  In boxers: Another Kickstarter project, AR-K scrapped past its $100,000 goal by promising to be an episodic sci-fi point-and-click adventure 'with an updated twist'. Sadly, that twist seems to be how unfinished the game feels - which hopefully will be fixed down the line.  You are in control of Alicia, former cop-in-training who was forced out of the academy when accused of stealing a mysterious golden sphere that she finds in her locker. Now in training as a journalist, she must uncover the great conspiracy surrounding the sphere and yadda yadda yadda. After she dresses and gets to class, of course, since she was up all night partying.  ...the sad part? That synopsis does a better job of establishing things than the ACTUAL GAME. The introductory cutscene feels like it was cobbled together at the last minute, and the haphazard way Alicia's backstory is rammed down our throats in another cutscene some 30 seconds later doesn't help matters either. We're given no real introduction to this world or anyone in it before we're asked to care about some partygoing chick, and it takes quite a while for us to warm up to her... which really isn't ideal in an adventure game  The graphics aren't exactly amazing either. I know this isn't the biggest sin in the world - I've always said gameplay is the most important aspect of a game - but there's just something slightly off about the art style and it's incredibly hard to put my finger on. Maybe it's the character's proportions? I dunno. Have a skim through the game's screenshots and see for yourself.  Another nitpick is the interface, which I don't feel is particularly well explained. All you get is two screenshots with arrows pointing stuff out, but that's hardly going to sink in when you first see it, especially when it takes a good 10 minutes for you to start actually needing to use the information provided. A slightly more in-depth tutorial at the start of the game would have worked much better here... as would being able to access these 'how to play' images during the actual game rather than having to quit to the main menu every time you want to see them.  Speaking of the interface, there are things which are never explained that you need to use, and things that ARE explained which you can't use. For example: you'll need to use your dog to solve several puzzles, but it's never once made clear that you can actually select or use the dog for anything.  Also, there's supposedly a 'narrator' that can give you hints if you get stuck... but I couldn't find any trace of him in the first episode, despite his presence being mentioned in the tutorial. And that's a real shame, because you'll NEED hints - there are some very random puzzles in this game (like using the cola with the sewer? Where did THAT come from?) that make it far harder than it should be.  On the more positive side, the voicework is really good. The main character in particular is great, but everyone is generally of a higher calibre than I would expect for a game made by such a small team. The music, when it kicks in, is quite nice, and the story, once it gets going, is pretty entertaining. It's just such a shame you'll struggle to get to it, since it only really gets going about two-thirds through the first episode.  This is a game that, at the end of the day, still needs a lot of work. There's a lot of potential there, but the problems I've mentioned are big ones, and they really do get in the way of what I hope will eventually be a pretty decent game. It's hard to really recommend at the moment - but at least you won't have to pay a fortune to see what it's like for yourself.  *UPDATE* - This game has receive several updates since I wrote my original review, and will no doubt receive more - or at least, I hope it will. I'll try and update this review with each update.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought these 2 chapters on sale. It was less than a dollar so I can't complain that I got what I paid for for chapter one at least.   Chapter 1 feels like it was a broken game. The How To menu was kinda broken and there also this fetch quest that initially asks for 4 items but when you ask the npc again, he ony describes 3 to you so I forgot completely about the fourth. Also, some items have descriptions, some items just have names, and some don't have any at all other than an image in your inventory.   Chapter 2 starts out with an introduction of a new character that directly says its function to clear up the confusion of the first. This chapter breaks a lot of the fourth wall and I guess that's appealing, but I would much rather they go back and fix what was wrong with the previous chapter rather than make this one about mocking their old mistakes. Chapter 2 wasn't bad. It functions the way a point-and-click should with concistent interface and the right amount of hints.   The only reason why I don't recommend this is because chapter 1 was bad. I see other reviews comment on the story, but I say the story is okay. If you don't mind struggling through a bad beginning to get to good part, be my guest.",
            "review_score": "-1"
        },
        {
            "review_text": "As a puzzle game, some puzzles are unclear, even random, i feel like doing random combination rather than having a smart clue from the game. Even i finally got it, it wasn't - 'aha!, why didn't i think about this before.' it was like - 'who would ever think of this'  The dialog was good, some of them are very funny.  The game all in all is too short, not worth paying $11 to get it.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Poorly written and designed Point &amp; Click game.    *Many plot holes *Bad voice acting *Terrible humour *Subtitles contains spelling errors *Badly made puzzles *Bad animations *No tutorial on how to use the UI",
            "review_score": "-1"
        },
        {
            "review_text": "This honestly was a nice little game. It forces you to use your brain not only to figure out how to solve a puzzle but also kinda think about what you may have to do later on to go further on. I am not gonna lie, some of the puzzles and questioning that you do to some of the characters can be dificult at some times. Missing one little clue or not seeing one little thing can mean you being stuck for hours :P (im joking about that) You can get stuck on what to do and sometimes the hint isnt always there so it makes it that much more challenging for a point and click.   I would indeed reccomend this game again if you are a great thinker and like to investigate or use your mind a lot more than youd think for a normal game. Another thing that made it interesting was the dialogue. It has its funny parts and can definitely make things seem a lot more fun in the game.   Over all I'd gave this game an 8 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "This game feels a bit like it came out some time around 2003 - and if it had, some of its flaws might be acceptable. The graphics would be alright, the terrible UI could be overlooked - but for a recent game - a Kickstarted game, mind you, that had plenty of funding - it's unforgivable.  As a point-and-click adventure, it's pretty atrocious. The tasks you have to perform to progress generally make no sense at all, not to mention that the inventory/topics-of-conversation screen is terribly managed. Partway through the first chapter, the game resorts to breaking the fourth wall to avoid having to explain itself, and by the second chapter, there's practically no fourth wall at all (there's some sort of omnipresent narrator who the main character just accepts as totally normal) because the developers apparently realized that the game was hopeless on its own. It's still pretty hopeless, and the handwaving of plot holes that happens as a result doesn't feel great. Which is also worth mentioning - some of the reviews argue that the miserable gameplay is worth it because of the story, and I'll agree that some of the dialogue is pretty good (the grammar falls apart pretty badly near the end of the second episode, though) and there's a decent amount of interesting worldbuilding (if you ignore that the leader is literally named Bossman and most of the characters are caricatures). The story, though, the story itself? It's plot hole after deus ex machina after inexplicable coincidence after plot hole after terrible plot gimmick (especially anything to do with the never-explained teleporter terminals that appear in episode two) after I-just-gave-the-alien-barkeeper-a-giant-wrench-and-apparently-this-causes-him-to-act-on-some-plan-that-was-never-mentioned. It's a mess. It's a slog. It's not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Recommended, with some errors but nothing serious. Waiting for a new chapter.",
            "review_score": "1"
        },
        {
            "review_text": "Pro: Story Acting Steam cards  Steam achieves  Con: Episodic (I dislike this format) Not consistent on quality of writing / story   Push: Graphics are OK UI needs to be redone, but it's good enough.   Overall: 8/10 (-1 for episodic) = 7/10",
            "review_score": "1"
        },
        {
            "review_text": "The graphics is too old, like 20 years ago. Alicia’s character. She is so sassy and snarky that she almost cracks the monitor. She also likes to shove her sexuality (and her gigantic boobs) in everyone’s face.  The plot. It takes us a whole episode to even learn where this story is taking place. And by the end of Episode 2 all we have is a McGuffin, but no clue on what this story is supposed to be about. The puzzles. Partly because the interface is horrid, partly because the tame adventure game logic escalates to Gabriel Knight 3 levels of insanity.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game, interesting argument. Will have a good future.",
            "review_score": "1"
        },
        {
            "review_text": "Episode two is okay. Skip episode 1, it is incomprehensible.",
            "review_score": "-1"
        },
        {
            "review_text": "AR-K tries really hard to be edgy with its snarky, hipster female lead, but the script and the voice acting are hokey. I know that might sound unfair, since this is a point/click with limited NPC interactions, and I like Greg Rucka's comics, but I think maybe this isn't his medium. Every time the main character curses, she sounds like when your ten-year-old little sister tries it out to sound cool around the older kids, but it sounds really unnatural. Frankie's 'accent' is terrible.  Worse, it's a puzzle game in which too many of the puzzles don't make sense even in hindsight, and you're just combining things with other things at random to get something to happen. Episode 2 was worse than the first in this regard, which is likely why they gave you a 'narrator' that you can drag things to for hints. Ultimately, I don't care why she has the sphere, which is why I probably won't play episode 3. It seems like it's supposed to be a focal point of the story, but the intrigue never really develops. 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Glitchy, buggy mess. Translation is poor - sometimes words are missing. Puzzles usually don't work. Game-breaking bugs frequent. Not worth your time (not even for $1 on the current HumbleBundle).",
            "review_score": "-1"
        },
        {
            "review_text": "+Ultra s3xy Protagonist +Very nice Humor +2 Chapters aviable (3rd to unlock) * A 'Click&amp;Point'-Advancer with Items-puzzles. Not for everyone unless you like example 'D3p0n1a' * A bit slowly gameplay (long distances and/or She walk slow. Like most of this games) * Screenshots aren't aviable (that function isn't broke for any game)   quick summary",
            "review_score": "1"
        },
        {
            "review_text": "Review only about game graphic style not game play. I'm very disappointed graphics while I expected pixar style real-time rendering. AR-K is old-fashioned graphic style. Pre-rendered movies or just some images for story. Game playing is not 3d rendering. Akward character animation sprites with pre-redenred background. It might be not a problem for other players. But I'm too disappointed to play following.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, some things could be improved. Anyway good addition to the genre.",
            "review_score": "1"
        },
        {
            "review_text": "I nice throwback to old adventure games. Complete with subtle references to the Indiana Jones games and more (loving the TK-421 train label)",
            "review_score": "1"
        },
        {
            "review_text": "It is pretty hard and sometimes unclear what to do, but the story is fun and if you have a guide that you use whenever you get stuck for too long it is a fun game.",
            "review_score": "1"
        }
    ]
}