{
    "app_id": 27000,
    "name": "The Path",
    "release_date": "2009-03-18",
    "developer": [
        "Tale of Tales"
    ],
    "publisher": [
        "Tale of Tales"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Walking Simulator",
        "Indie",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 502,
    "negative_ratings": 177,
    "price": 6.99,
    "description": "There is one rule in the game. And it needs to be broken. There is one goal. And when you attain it, you die.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/27000/header.jpg?t=1447351736",
    "minimum_requirements": "Operating System: Microsoft® Windows® XP/Vista                     Processor: 2 Ghz                     Memory: 1 GB RAM                     Hard Disk Space: 500 MB                     Video Card: Recent Geforce® or Radeon® x6xxx 256 MB (no integrated graphics)                     Sound Card: Any Sound Card                     DirectX® Version: DirectX® 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is my favourite game. It's slow and there is no 'action' at all, it's more like an interactive story, but I always find it fascinating and have done since it came out when I was about 15. Five years later and I still think it's beautiful and kind of sad. But you have to go into it knowing that it's less like a game and more like a story. I view it as being all about the loss of innocence and how we lose it in different ways, some of the endings seem simple and suburban, but some suggest horrible, traumatic things happen. While I understand how people can't get into it or don't like it, to me it's beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "'Two roads diverge in a wood, and I- I took the one less traveled, and it has made all the difference.' -Robert Frost, The Road Not Taken  Well, this was a different game to say the least. I enjoyed it myself, so I'll give it a recommendation on that part, but I can see why people hate on it as well.  So, talking about what people might not like about it first to get that out of the way. The game is very slow and often feels as if it doesn't have a set goal, until you find out what the set goal is that is. And up until then you have no real purpose in the game, and for all purposes up until the point when you realize what's happening in the game, it's just an exploration collectathon game.  Now onto what I did like about.  People keep on bringing up Five Nights at Freddy's when ever they talk about good hidden stories. I want those people to spend a few extra dollars on this game as it is a lot less waiting and a lot more gameplay than FIve Nights at Freddy's. The story is hidden is such a way that you have to complete the game %100, meaning collecting every memory, to get the full thing, otherwise the game can honestly be quite confusing to be honest. But if you put enough effort into finding everything in game the it's worth it in my opinion.   Going onto the music in this game. It's like they took a page right out of 'Silent Hill' and crossed it with 'The Binding of Issac'. Needless to say, I loved the music in this game. It provides a good amount of atmosphere while also allowing you to feel the safety you should while safely in Grandmother's House, assuming you did like I did and just walked down the path on your first playthrough. The music is eerie when it needs to be and calming during the majority of exploration, with sound effects mixed in to keep you on your toes.  Now for the characters. Having the old story of Little Red Riding Hood protrayed in this sense was really interesting to see. Even though only one character even slightly resembles the fairy tale character (Robin), it still allows for each character to have the same story of misplaced trust and betrayal, which was what the original Grimm fairy tale was about. This is another aspect of the game that you can't experience in it's whole unless you play the game to 100% completetion. It adds replayablity for somebody like me and adds to the overall charm of the characters. Also adding a different walk cycle for each character to further drive their personality was another good idea that we don't often see in games today, as most games, even triple a games, only have a single walk cycle for every character.  What would I rate this game on ERSB? T for sexual content, Blood, tabacco use, frightening content, and mature themes.  My overall rating of the game: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Precursor to games like Dear Esther, it still gives me the creeps when you find each girl's 'wolf'.",
            "review_score": "1"
        },
        {
            "review_text": "As an experience, this game is is a must however gameplay is quite simplistic. At most you will be exploring and collecting items. If you want something a little more complicated in terms of gameplay, I can't promise you will love this.   This game's atmosphere is hauntingly beautiful and to no small credit to the music that plays you through your exploration through the seemingly endless, dark wood. That is, if you choose to stray off of the path. The best part of the game is the look, the sound, and theorizing about the things you will see and do as each of the girls. If that's something that appeals to you, you gotta check this one out.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very hard game to quantify into a catagory, genre group or ranking. Not truely a game, but not enough of an indie classic to be called 'art'; to me it stands on its own as a psychological examination of life and what it means to mature from childhood to adulthood for the six sisters of this thriller/horror interactive piece.  You have one objective: get to grandma's and do not leave the path. But you have no choice but to leave the path to truely experience this game.  This is NOT a game for people who do not have patience. There is a hell of a lot of backtracking and blind searching as you uncover the clues of the characters, their habits, personalities and innocence. A completionist run for a single character can easily take away three hours while you listen to the same eerie music over and over, challenging your mental memory and the occassional flashes of the trail you've left behind while getting hopelessly lost in the forest.  Compared to a similar indie 'art' game, To The Moon, this interactive title is certainly very similar in the amount of love that the development team put into this piece. But unfortunately the message isn't as clear as it could have been without being a completionist or cheating and hitting GameFAQs for a plot synapsis.  As an art deco title, it's a game that must be played at least once in your life. English Literature and Psychology Majors will get a real kick out of this title, as well people with an interest in slow-paced thriller and horror games. But other than that recommendation, think really hard before you purchase this title if it isn't on sale: it is a difficult one to recommend to casual and mainstream gamers.  I lean on the said of 'yes' because I really appreciate these types of games. But then I'm a student of psychology.",
            "review_score": "1"
        },
        {
            "review_text": "If you are tired of shooting up people or your average other game then you might want to check out this game. Some people might call it 'pretentious' but I'd say its just another way to experience a story.   Just dont bother collecting all 144 flowers cause thats not doing anything.",
            "review_score": "1"
        },
        {
            "review_text": "This game will take you down a path. You know when they say, sometimes the journey is better than the destination? In this case, the journey will rip out your eyes and devour your soul. Oh, and the destination will kill you. Every time.",
            "review_score": "1"
        },
        {
            "review_text": "the most mysterious of jogos.",
            "review_score": "1"
        },
        {
            "review_text": "Disconcerting in the extreme.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the most unique retelling of the classic tale, The Path is a strangely eerie walk through the woods.",
            "review_score": "1"
        },
        {
            "review_text": "More like walking through a thought provoking painting than playing a game. very enjoyable",
            "review_score": "1"
        },
        {
            "review_text": "A very unique game. If you're into abstract horror and stories that are open to interpretation, this game is for you; nothing is handed to you and to this day people are still discussing the themes of the game. If you prefer more linear, conventional stories, you probably won't like this at all.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable experience that is dark and whimsical at the same time. I really enjoyed the different experiences each character had. Not everyone will enjoy this. There is no fights, guns, experience points, etc. This is a story driven game and nothing more. It is short, so look for it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "A very atomospheric and creepy game. Nice graphics and no problems with controlling the characters or any major bugs,the gameplay is very smooth. The soundtrack is utterly amazing and really brings it all together. The meaing behind the items and the endings leave you with a lot to think about. Definitely fun to play and i would recommend this to anyone and everyone,and I would highly recommed playing it alone in the dark for the best experience.",
            "review_score": "1"
        },
        {
            "review_text": "One of the creepiest games on PC.",
            "review_score": "1"
        },
        {
            "review_text": "People die. It's hard to imagine for a kid like me. They die and we put them in the ground. Like flowers.",
            "review_score": "1"
        },
        {
            "review_text": "Creepy and beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "This game is dark. Like 'Mans inhumanity against man' style dark. Parts of this game oddly remind me of the visceral experience of watching Requiem for a Dream for the first time where I just shut off the lights and sat in a corner for 40 minutes. Don't start off with the gothy looking girl like I did. That's all I can say without spoilers. This reminds me of Silent Hill 2 in a lot of ways so, do reccomend! No jumpscares just a constant feeling of dread deep down inside. I'm a huge Silent Hill fan and it did not dissapoint and I just played through the first girl. Took me 22 minutes for one, with 5 girls to go and I'm already freaked the hell out. Totally worth 10 dorrar if you're into truly creepy atmospheric games and not just a zombie jumping out of a trashcan style horror. I'm actually disturbed, if that's not what you're looking for look elsewhere. If you're looking for a fun game and not a WTF is actually happening? What is this dark magic that's making me feel like shooting myself? Style game like Silent Hill 2. Don't play this. If you want to play a game that makes you feel actual emotions, mainly dread and paranoia, certainly play this game! Many people have said it and it's true. This isn't so much a game, it's art! It elicited an emotional response from me in about twenty minutes. Some of the details are pretty screwed up and subtle as hell which keeps your imagination running in a really messed up way. Okay one spoiler..... SPOILER ALERT! I guess.      The gothy looking chicks 'Wolf' Apparently is a murderer as you see him dragging a corpse off in an abandoned playground, then he shares a smoke with you before the very much implied errr 'Unwanted sexual advance' on your character, You wake up back on 'The Path' where you can no longer run. So ya show up to Grandma's barely able to move what with being recently 'Unwanted sexually advanced' to more craziness. To Grandmothers house we go! Yeah this game is DARK! They never show anything, but the implications are pretty obvious, which at least in my oppinion makes it a whole hell of a lot more effective in disturbing the ♥♥♥♥ out of you! It's subtle about it but you're also left with a sense of 'Holy sheeit did that really just happen?'",
            "review_score": "1"
        },
        {
            "review_text": "The epitome of an artsy game. it's an interesting narrative experience which tackles some fascinating themes, however apart from that it fails in almost every aspect. The controls and gameplay are simply atrocious. But it deserves to be experienced, it's like The Company of Wolves: The Game.  2,5/ 5",
            "review_score": "1"
        },
        {
            "review_text": "While you could essentially watch a Youtube video of this game and see everything it has to offer, the dark presentation is rather unsettling, and playing it yourself exacerbates this- it's *you* directing these characters to their fates. Definitely one of the better attempts at the 'games for art' movement, regardless of one's stance on the issue.",
            "review_score": "1"
        },
        {
            "review_text": "A very interesting retelling of the 'Red Riding Hood' story.  You play the part of one of several young girls who are going to visit their grandma. But there's more to it than that. You have the option, if you so choose, to go wandering off into the woods. There, you can meet various people or objects from your childhood.  I think this is a game about loss of innocence and people being forced to grow up. It's certainly open to interpretation.  'The Path' is not intended as a game in the traditional sense, but the creators have thrown in a couple of optional 'gamey' elements to pacify people, such as a map, or the option to collect flowers in the woods. There is also the option to try and find all the relevant objects for each girl. But there are no rewards for doing so, as that is not the point of the game.  Unfortunately as this game was made by an outside studio, the creators have no way to compile it for Linux, which is a great shame.",
            "review_score": "1"
        },
        {
            "review_text": "Like Evangelion without the mecha.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game which isn't played, but rather experienced. There are no puzzles, no weapons, no fighting, no boss battles. There is only a girl (well, ok, several girls - but you can only play them one at a time), a path, the woods, Grandma's house, and a wolf.   Simply put, your goal is to explore and collect things. There is only one way to 'lose' the game and that way is to obey the rules.   The Path is 10 years old and it's every bit as enjoyable now as it was when I first bought it nearly 5 years ago.   Highly recommended. 4 paws up. :)",
            "review_score": "1"
        },
        {
            "review_text": "As an art game, this game truly excels. Its very beautiful and has a lot of charm to it.  The best moments in the game for me were my first playthrough with the little girl. There's something to be said about running headlong into a forest as an innocent little girl. I came across a couple random objects and curios throughout my sprint into the unknown. Then I met the girl with the white dress, chased after her for a bit, then hand-in-hand we went through the forest, until she brought me back to the road. I then went to grandma's, and she was there in her bed. To my surprise, nothing 'bad' happened. It was an interesting experience.  The worst moments in the game were mainly technical issues. In certain areas the character you control cannot run, making progress annoyingly slow. The camera will also get stuck on occasion, or just have a bad angle. I once passed through the door of a shack, and got stuck inside it, forcing me to quit. The game is also heavily cryptic, making it very hard to understand whats going on. I eventually got bored of the forest, not finding enough to keep me invested, and quit. When you do find something, all you get is a quip from your character. Not really worth the time.  All in all, its certainly worth it to try this totally unique experience, but its will strain anyone's patience soon enough.",
            "review_score": "1"
        },
        {
            "review_text": "you know my sister bought this game a long time ago and she loved it she told me its beutful lovly and i never saw it i was young i watch her play it when i was 8 and i felt like i could connect with it then when i got older i forgot it then today i just rememberd it and now i under stand what it means and its somthing more special its like a glass heart and you dont want it to break im glad i got older and i feel this way to this game i missed it like i miss my sister LOVE YOU SIS&lt;3   Please buy and try this game yes its odd at first but all games are you just need to play it and get a feel of it its a recommend game to play",
            "review_score": "1"
        },
        {
            "review_text": "One reviewer said of this game (paraphrase): The Path is not a game, it is art.  This is not entirely untrue. It was a fun game that came bundled with something else. I played through it, and although I enjoyed it, its not a game I would have bought for myself. Its very high-art but in a horror setting... based on the *original* story of Little Red Riding Hood (LRRH) with some interesting inferences to Catcher in the Rye (CiTR) this game is &lt;&lt;NOT FOR CHILDREN&gt;&gt;.  If you're familiar with LRRH or CiTR - and if you are okay with a game with SLOW progression and a subjective scoring method... and if you're the kind of person that can fill in the gaps and analyze into a story - this game is for you.  In retrospect Its been YEARS since I read LRRH or CiTR so I had to borrow someone else's notes online about this game. Recommended for the right ADULT.",
            "review_score": "1"
        },
        {
            "review_text": "This game is underrated but I really liked it. The characters were good and the visuals were scary. A little simplistic but still really good!",
            "review_score": "1"
        },
        {
            "review_text": "Very refreshing game. I liked most of the characters, and the gameplay is entertaining. Some people might not like it, since it's not very action centered, and it's not very scary. But it's full of poetry, and I really like how the chara-design. You can clearly see the differences between the sisters, just by looking at them. The soundtrack is perfect. I also loved how each sister has her own way of walking. This game looks like a treasure hunting.",
            "review_score": "1"
        },
        {
            "review_text": "The only game I've ever played which made me feel like I've been violated.",
            "review_score": "1"
        },
        {
            "review_text": "No game is more art, so much so that it's only barely a game. This is a Red Riding Hood game, the story of... well, it's so symbolic that's hard to say! The central theme is female adolescence. That much I'm sure of.  I CANNOT RECOMMEND THIS GAME MORE.",
            "review_score": "1"
        },
        {
            "review_text": "Endless, incredibly beautiful forest full of secret wishes...",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing and it is extremly beautiful visually and i loved the story too.",
            "review_score": "1"
        },
        {
            "review_text": "+++",
            "review_score": "1"
        },
        {
            "review_text": "Weird artsy game, when you come down to the mechanics its just another pretentious indie walking simulator, having said that I must say that i loved the atmosphere of the woods and the visual design, if you dont mind these kinds of games and the images of the game pick your interest then I recommend you give it a try, on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to like it. I watched a friend play through one of the girl's story line, and I thought Id love it since Im a sucker for a game with a story with a message. There isnt much 'game' to it though. You play as one of a bunch of girls, wandering in a forest until you meet her 'wolf'/how she loses innocence. The game only tells you to stay on the path, which of course, you can do, or you can wander off. The game doesnt explain that the real goal is to collect flowers and find objects that trigger memories of the girl you are currently playing, so my first playthrough, I just ran through until I found the 'wolf', and was then disappointed with how shallow the event seemed, and confused why the character I was playing was so effected by the event (the theater story comes to mind, and I still have no idea why it effected her or why I should care, as cruel as that sounds).  The controls are pretty basic. W and shift to run, or use your mouse. But if you play in windowed, the mouse isnt locked to the screen and gets annoying very quickly. Music is repetitive, but isnt bad. Graphics are pretty nice and I liked the aesthetic of the game quite a bit.  My real problem with this game, and why I cant recommend it though, is that it lacks clarity of your goal. If you dont go find flowers or hunt for objects, you wont trigger memories and you wont learn anything about the character you are playing. Its very hard to feel much of anything for a character when you have no context of that character. And if you arent very attached to the characters, then the message the developer is trying to convey gets lost beyond a very basic 'lost innocence' concept.   Someone in another review suggested that this game be called 'interactive digital art', and I would have to agree. If you go into this looking at it as a piece of interactive art, Im sure most people would enjoy it, but if you go into this looking for a game, you are probably going to be disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "VERY slow-paced (and I usually don't like most fast games), makes no sense, not immersing. Instructions are a mess.  People compared it to David Lynch's movie in some review. I love his movies because they make sense somewhere, when you look hard enough. This is pure Dadaism and not enjoyable in any sense. I'm pretty sure people rate this up because they're used to mainstream stuff and are amazed because 'it's so artsy!'. But it's not. It's dumb.  Just beautiful graphics, and that's it. I'd watch a video with this theme, but it's terrible to 'play', if you can call it that,  The game said I found a wolf, but I didn't.  Argh. No. NO! NOOOO! Don't trust the trailers! Watch an uncut gameplay video to make sure you're up to the tedious task.  If you got it from a bundle, get the cards and then get away from it.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible, self indulgent, extremely slow paced, cryptic. If you think CRYPTIC = DEEP then you may enjoy this application. Otherwise, I'd much rather just not play anything than interact with this.",
            "review_score": "-1"
        },
        {
            "review_text": "WARNING: This is not a game.  Not worth the price of admission by a long shot. If you are a game developer looking for inspiration I'd recommend picking this up just to see a few unique things they attempted, however for a regular game player I'd stear clear. It's more of a short experiment than a game. For a similar experience without spending any $$ I'd recommend playing through the flash game 'Every day the same dream'. Pretty much the same 'breaking out of the norm' concept they try to portray here.",
            "review_score": "-1"
        },
        {
            "review_text": "Impossibly grim indie-core psych-horror presents the journey into adulthood as a series of deaths, a Burton-ish blurry innocence undercut by, and inevitably leading into, the morbid.",
            "review_score": "-1"
        },
        {
            "review_text": "Do you like spending several minutes walking slowly through a forest between mildly interesting set-pieces? Then this is for you.  This isn't a game. In fact, the creators are on record specifically saying they're anti-games and want to destroy the entire industry. This is art.",
            "review_score": "-1"
        },
        {
            "review_text": "Whatever interesting, open-ended narrative there is in The Path is impeded by obtuse, confusing design. Part of the blame lies on a limited budget and resources, but the devs seemed to spend all their effort on story beats and neglected to strengthen the core experience (being lost in the woods, which is an aimless, frustrating experience).",
            "review_score": "-1"
        },
        {
            "review_text": "Ridiculously bad. Boring, hardly interactive and no fun.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is terrible. DO NOT BUY.",
            "review_score": "-1"
        },
        {
            "review_text": "Crap like this should be free. It has no gameplay, no plot, it's not pretty and not deep. Art? Maybe. But a shallow and uninspired one.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't recommend The Path, but I will say that I've never played anything else like it and the story and the characters did stick with me after I completed it. It's interesting, but it's definitely not worth $10. Catch if it goes on sale for a dollar or two if it interests you.   The problem is that there is hardly enough actual gameplay to qualify it as a game. The only thing you can do in The Path is walk or run. The video makes it look like you're interacting with items, while you're actually just watching the characters do the interacting. Seriously, the way you pick up an object is by releasing the 'walk' key and standing still so the girl can go on to interact with whatever you've stopped her near.   I get that Tale of Tales was trying to tell us a story in an original way, but they don't seem to have an understanding of the importance of immersion. I probably would have loved the game if I actually felt like I was controlling the characters and discovering the secrets of the forest with them, but instead the game just left me feeling disconnected. When you finally do reach grandmother's house, your 'reward' is an agonizingly slow walk and some flickering, jumpy cutscenes. Some of the sisters endings didn't even make sense, even with 100% level completion. People may try to gloss that over by saying it's 'artsy' or 'deep,' but in reality it's just bad writing and poor design.",
            "review_score": "-1"
        },
        {
            "review_text": "they were ra  ped",
            "review_score": "-1"
        },
        {
            "review_text": "Weird, strange, scary, and concerning. The words match the gameplay and its developers as well. Don't buy it. 30/100",
            "review_score": "-1"
        }
    ]
}