{
    "app_id": 270070,
    "name": "The Girl and the Robot",
    "release_date": "2016-08-17",
    "developer": [
        "Flying Carpets Games"
    ],
    "publisher": [
        "Flying Carpets Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Indie"
    ],
    "achievements": 10,
    "positive_ratings": 37,
    "negative_ratings": 15,
    "price": 6.99,
    "description": "The Girl and the Robot is a third person action/adventure game set in a fairy tale world where you take on the role of a young girl trying to escape from a castle ruled by an evil queen.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/270070/header.jpg?t=1478610696",
    "minimum_requirements": "OS: Windows XP SP3 Processor: Intel Core 2 Duo Memory: 4 GB RAM Graphics: Direct 9 compatible card DirectX: Version 9.0 Storage: 4 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A fun little game with a lot of charm. I quite liked the soundtrack and the enviromental puzzles. The combat works but its not the game strongest point by far, the puzzles and the switching between the two characters are fun. The Robot can fight and push heavy stuff while the girl can maneuver the environment with ease and heal her trusty robot guardian after he takes damage. The game has fun and intresting ideas and the two boss fights where fun. Studio Ghibli is a strong influence on the game , in particular their classic work 'Laputa Castle in the Sky', and I loved that.  With that said, the game ends rather abruptly in a pivotal moment in the story which I felt that made the game incomplete for me. Nonetheless, the game ended with ' To be continued ' which would be alright if there is an expected date for when we will expect the continuation to be released. I encountered two glitches but nothing game breaking, the framerate is not very stable at times and the controls sometimes feels unresponsive. Nonetheless , none of these ruined my experince an I loved the game and would get the continuation provided they don't take too long to the point I lose interest.   I recommend the game for anyone who is a fan of Studio Ghibli and like enviromental puzzles games and do not mind a weak combat system.",
            "review_score": "1"
        },
        {
            "review_text": "i cant play it without the controller because i am using a mac laptop and my dell is not working if u have a mac then i DO NOT RECOMMEND THIS GAME",
            "review_score": "-1"
        }
    ]
}