{
    "app_id": 270210,
    "name": "Melody's Escape",
    "release_date": "2016-05-20",
    "developer": [
        "Icetesy SPRL"
    ],
    "publisher": [
        "Icetesy SPRL"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Music",
        "Rhythm",
        "Indie"
    ],
    "achievements": 8,
    "positive_ratings": 4187,
    "negative_ratings": 292,
    "price": 6.99,
    "description": "Run, jump and slide to the rhythm of your own music library! In Melody's Escape, advanced audio detection algorithms transcribe the energy that you feel when listening to music into a synchronized gameplay experience, with a captivating and dynamic obstacle course.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/270210/header.jpg?t=1527183980",
    "minimum_requirements": "OS: Windows® XP, Vista, 7, 8 Processor: 1.8Ghz Intel® Core 2 Duo or equivalent Memory: 1 GB RAM Graphics: Intel® HD3000. DirectX 9.0c compatible with shader Model 2.0 support DirectX: Version 9.0c Storage: 200 MB available space Sound Card: DirectX 9.0c compatible sound cards Additional Notes: Supports XInput compatible controllers only",
    "recommended_requirements": "OS: Windows® 7 or 8 for iTunes® music support Processor: 2.66Ghz Intel® Core 2 Duo or equivalent Memory: 2 GB RAM Graphics: NVIDIA® GeForce 8800GTS or ATI® Radeon HD 4830 or better DirectX: Version 9.0c Storage: 1 GB available space Sound Card: DirectX 9.0c compatible sound cards Additional Notes: Supports XInput compatible controllers only",
    "reviews": [
        {
            "review_text": "I played the game long enough for me to write this honest review. When this game was released in Steam Store, I was very happy that it made it past Steam Greenlight after waiting for months to be fully developed. Icetesy delievered it very well and done with several updates and fixes to make this game 100% complete.  This game achieved three major elements for making this game look unique: Originality, Style, and Asthetics.   It reminds me of a combination of DDR and Audio Surf, with the additional of parkour moves. Remember the time when you were in a long road trip as a kid and you imagine there was an imaginary person running alongside with you, doging obstacles? I guess that's how the developers got that inspiration from. That idea made this game came to life.  With the Steam Workshop added for the game, you can customize your fabulous runner girl and the background color scheme you prefer to keep the game decorative and appealing.  I enjoy the option of playing your own music from your desktop library, and it is great game to discover and explore music that you like to hear more. I'm already a fan of techno/EDM music before, and now, I'm listening more and more songs of all kinds of music such as Trance, House, Retro-synthwave, or anything electronic bascially. The songs I tried out with this game works fantastic, and the pacing of the songs stays in sync with the intesity of the game speed along with the beat and sound.  $10 is totally worth buying at a high price. I would recommend to anyone who is fan of rhythm games, and the option to play whatever music they have in their computer.",
            "review_score": "1"
        },
        {
            "review_text": " Best rhythm based game on steam in my opinion",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  - Most songs work well with this- even though 4/4 tempo beats are not detected.  - Addictive  Cons:  -Some songs don't work well and you'll have moments where you cannot fully rely on the beat of the song when inputting.  Would recommend this game on sale.  ",
            "review_score": "1"
        },
        {
            "review_text": "Fun as hell, but higher difficulties get pretty difficult depending on the song.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive and well done music game with linux support of which I can say I  regret  not having bought it earlier. I do hope the workshop editor will see other-than-windows support in the future!",
            "review_score": "1"
        },
        {
            "review_text": "Another rhythm game that I personally enjoy. Quite frankly, it's the only rhythm game in my experience (that I've bought) that doesn't tilt me.  *cough* osu! *cough*  Graphics are nice, the mechanics are simple (at least, for medium difficulty), and it's definitely fun. The game stands at a simple 60 FPS, and I don't see any lag in my frames. But, if you're really competitive, or just want correct timing, I suggest calibrating and turning off VSync.  It's also very versatile, letting you be able to play your own music AND have comfortable mapping.  It goes either off the song's BPM or its 'energy peaks', where it goes to the beat. Props to that.   The Steam workshop cosmetics also look very nice for a new game, it's interesting to play as either Asuna or Miku as you're playing a rhythm game. It's innovative, I'll give it that.  Overall, if you're looking for a casual game just to kill time, this is a great game. I suggest buying it while it's still on sale.",
            "review_score": "1"
        },
        {
            "review_text": "For all you Rhythm Game junkies, I also highly recommend MELODY'S ESCAPE!   At first, watching the videos made me feel meh, coz of the seemingly limited number of moves Melody has. Then when my daughter started playing the easiest difficulty, that fear slowly crept in. But when we started MEDIUM difficulty, EVERYTHING changed. The seemingly limited moves helped fuel the struggle to complete the variety of commands being thrown at you. It became HIGHLY entertaining AND addicting. Though I agree with some reviews that certain songs- especially in higher difficulties - do not synch well with the game engine.  The controls (using a wireless XBOX360 controller) were great. You can choose to use a combination of the analog sticks, d-pad, or face buttons. You can even choose just one set of controls (like the face buttons, or just the D-pad). I used both analog sticks, and my daughter used the D-pad + face buttons combo.  There are already a ton of Workshop mods out there, including Hatsune Miku, or even Black Rock Shooter.  Make sure to check SYSTEM REQUIREMENTS and some reviews. The game requires a solid 60FPS for best synchronization. I had no issues running it with v-sync, but some may need to turn on some sort of Adaptive V-sync if frames drop below 60.  Let the beat flow! :)",
            "review_score": "1"
        },
        {
            "review_text": "  Do 'Let's dance' by David Bowie.",
            "review_score": "1"
        },
        {
            "review_text": "The definition of 'just one more song'.  This game delivers exactly what it promises to do and wraps it all up in a very pretty package. The audio detection -while not perfect- is definitely better than a lot of other rhythm games can offer, and the controls are smooth and responsive. The art style is simple but pretty with some nice crisp animations for Melody, whose appearance you can change so she can look extra cool while she's jumping and rolling and generally cavorting all over the place.  And of course, the music is absolutely perfect, since it's your own! :P   One more thing I'd like to note is that while the game looks pretty casual (and there's indeed the option to play on relaxing easy mode) it can actually become impressively difficult if you prefer more of a challenge. Plus you can customize certain aspects of the gameplay (things like movng speed, timing window, input method, etc etc) so you can have the exact level of difficulty you personally like, which is very much appreciated.  So basically if you're a fan of pressing buttons to the music then you're guaranteed to enjoy this. I know I'm certainly going to be obsessed with this for the foreseeable future! ",
            "review_score": "1"
        },
        {
            "review_text": "Very simplistic game, but cery addictive and fun. Only had to play a couple of songs before getting hooked.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. While it indeed isn't perfect when it comes to the beat detection, personally I am satisfied. Also the variety of difficulties is very nice, ranging from very easy (which I find good for practising timing) to a very difficult one before which you should master the Intense difficulty, which already requires that you can use both your hands quickly (unless you change the controls to make it something that requires only one hand, of course), but the most difficult one, Overload, requires both of the hands at the same time, while Intense requires using your hands one after another.   PS. It's rather funny how the game talks about needing 60 FPS. I put the game on full screen, highest settings possible (V-sync off though) and the resolution to 1920x1080. I was always over 200 FPS and without screen tearing (V-Sync caps my FPS to 60 FPS btw). Sure, this game doesn't need much from a graphics card and I have Nvidia GTX 960M. Figures.",
            "review_score": "1"
        },
        {
            "review_text": "This game is gorgeous. My friend had bought me this as a gift for me on Steam, and It's very, very creative and well done. I haven't found any cons yet, so there are only pros. Hooray!!!  Pros: You get to listen to music as you play.  The game literally runs to the beat of the music and it feels like it's going with it.  Graphics are beautiful.  Play Reconstructing More Science with a Chell skin from the workshop and the game feels incredible.  This game is amazing! I love the features and the graphics. This is a must get from anyone, and especially when it's on sale!    ",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. with a single problem that could maby be fixed. the problem is simply because of the way the game seems to generate the levels to match the music is programed to generate levels based on 4:4 timing (i dont know how to type that the correct way) so if you have something that is in a different time like 3:4 then your may not get a good level, the game does inform you if its not comfident in the timing. granted this may not seem like a major problem but i think if it was fixed it would allow more songs to be played well, and possibly making more people happy with the product. but i give the game 7/10 and if this could be fixed/coded into the game then it would get a 10/10 from me np.  PS i know my Grammer is something terribal.",
            "review_score": "1"
        },
        {
            "review_text": "I can't really handle pressure well. It can get really hectic when notes start spewing at you and you will panic. However after playing this game multiple times, I am starting to get better at handling pressure.  I believe that one day I would be able to live in the pressure cooker. One day...",
            "review_score": "1"
        },
        {
            "review_text": "It's been a while since I've played a casual game like this that is just fun; no story or convoluted controls to get wrapped up in and I can listen to my favorite music. This is a great game to unwind to, and it actually does pretty well with syncing up to my music library (which has pretty much every genre except kids' and acid metal). A few of my favorite songs actually match up perfectly. It took me a while to get the timing down, as the different speeds can sometimes switch suddenly, but that's a personal problem and actually made me like the game more-- I felt a huge sense of accomplishment once I learned that skill.  My only problem is sometimes I'll wonder where it's getting the beats, and then I listen closer and realize it's getting it from a backing track that might be hard to hear. Most of the time I notice the backbeats of songs so it's really not much of a problem.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game. Like the idea that you can pick the songs that you want to use and change the skins via workshop and don't have to buy them! Getting the hang of it took me a couple of games and then I was finally able to play it without thought. Worth the money I spent it on - definitely not a waste of disc space. It's a little rage inducing for me, though...   P.S. This is also a really good reflex warmup prior to playing CS:GO or any shooter game that includes aim and reflex.",
            "review_score": "1"
        },
        {
            "review_text": "The game is simple yet fun. Every player can get what he wants from the multiple levels of difficulty.  Importing your own tracks is ofc an awesome feature, though sometimes, the games level generator feels a bit off... .. ... .... This game gets quite addicting.",
            "review_score": "1"
        },
        {
            "review_text": "First impressions: Beat detection is a little bit screwy. But it's still heaps of fun nonetheless.  Also one of the few rhythm games which is more fun with rock/metal than with EDM/dance.",
            "review_score": "1"
        },
        {
            "review_text": "I suck at this game T.T A very fun and entertaining game for it's price.",
            "review_score": "1"
        },
        {
            "review_text": "Hey thats pretty good",
            "review_score": "1"
        },
        {
            "review_text": "i've always wished a world like this ,with electronics music (deadmau5 is my favorite) dominating the chart.   thank you so much for this incredible game.10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, the idea of it is pure genius, not only will you never get bored of playing it but it never ends, literally every new song that comes your way makes a new sequence in the game, the more complex the the song the more challenging the game. it is my dream game combining two things i love, games and music. listening to a song just got a whole more interseting.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first game I've ever felt inclined to write a review for... I hope that says something. It's simple, polished, beautiful, and correctly priced; its become my preferred game whenever I want to relax or just kill some time.  It's surprisingly difficult at first, until your brain masters the translation from color/symbol to button press. After that point. however, the game is pure bliss. It produces flow very easily, and my mind often wanders as I'm playing... only snapping back to attention when I miss one. It's incredibly cathartic.  I will say that enjoyment of the game depends a lot on what kind of music you like listening to. When the game parses a song, it'll tell you how well it was able to track the music, either giving you the tempo (along with the game's confidence in that tempo) or simply reporting 'energy peaks'. I've found this rating to be fairly accurate in predicting the song's playability, and songs with high irregularity or 'noise' (lots of background instruments, lots of different harmonies at once, etc) don't tend to be well suited for the game's algorithm (in my opinion).  Examples of music that works very well:  the entire Shatter OST  Pendulum - The Island Pt. 1  Pet Shop Boys - Axis  The Glitch Mob - Head Full of Shadows  I can't recommend this game enough!",
            "review_score": "1"
        },
        {
            "review_text": "  Game is really fun rythem, you should get it as you can use your own music with it and use arrow keys to play the notes.  not much else to say i rank this game 9.8/10 wish you could play harder songs even overload is not hard enough for me.  personnaly im an osu player so pressing keys really fast is for me. please add more harder difficulty like goddesslike and impossible",
            "review_score": "1"
        },
        {
            "review_text": "This game really doesn\\'t offer much.. i mean every level is pretty much the same and it only has 8 diffent button prompts..   Oh wait.. i\\'ve put a dozen hours into this already?!",
            "review_score": "1"
        },
        {
            "review_text": "Nice music rhytm game, main thoughts from 8h of gameplay: -Simple mechanics but very addicting. -Good custom music conversion to game-levels, those converted with tempo method are accurate, though energy peaks is not, as it's not consistent to music rhytm =&gt; harder to play. -Good learning curve with 4 difficulties, they seems hard at first but when you adapt, you can move on, -Increasing BPM rate 2x at low tempo @intense difficulty is probably not good way to fix difficulty of slow songs, as it makes them even harder than fast ones, -It would be nice to have 4/5-heart completition achievements for higher difficulties.  Never played similar games before, and this one is only one that caught my attention from previews. With this small problem, i can definitely recommend this game, 9/10 ",
            "review_score": "1"
        },
        {
            "review_text": "This game is just so fun, so addicting. It reminds me of AudioSurf ( which I loved ) but in a way more unique and fun style.  I can play this for days.",
            "review_score": "1"
        },
        {
            "review_text": "Addicted to this game!!",
            "review_score": "1"
        },
        {
            "review_text": "The only major flaw for me with this game WAS that the color pallet was confusing because I have trouble distinguishing certain colors but I downloaded a mod for that from the workshop so now I can't think of any major flaws. About the worst thing I can say is that the gap between the last 2 difficulties is incredibly excessive so you might eventually reach a point where the next to last difficulty becomes too easy for you while the last is too hard/unfair for you but I played the game for almost 150 obsessive hours before I ran into that problem so I can't be very upset about it.",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun Game to play your music with, i recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "9/10   For now, it only got 100% excellent sync with pop/techno/dubstep genre. I would say 10/10 if it got 100% excellent sync with Rock genre!",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't even start it, it doesnt launch.  on forums says it needs to reset the whole .Net framework, but tried it many times over and it will simply not launch. 0/100",
            "review_score": "-1"
        },
        {
            "review_text": "Great music game . You can play with your own song that the game will auto generating a map from that song bpm  The game is worth for who loving rhythm game &amp; has a lot of songs",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would rate again",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't feel very well on very fast and energeti music, as the description says the game focuses more on long vocals and held notes. But overall everything is very nice.",
            "review_score": "1"
        },
        {
            "review_text": "Its a good game have music and a lot of action and some part hard if you pick some hard music. But its not rly for PC this game its better for mobile device not for PC-LEPTOP-CONSOL its more for Phone and Tablet.",
            "review_score": "1"
        },
        {
            "review_text": "Useless game for people who have color vision defiency.",
            "review_score": "-1"
        },
        {
            "review_text": "Melody's Escape just left Early Access and I luckily got it at the sale price. I played it before with someone else at an internet cafe when it was in early access. It was quite buggy then BUT its an amazing game. Its one I would HIGHLY recommend. I will not hate you for not believeing reviews. I actually was like many people. I saw the trailer but didn't seem all too convinced it was good. I was really wrong. Its a game that may always be easier or difficult-er. I do think that you should play the relaxing difficutly for your first time. I tried all other difficulties and it just goes to hell from Medium.   My Current PC w/ Melody's Escape: GeForce 210 Core 2 Duo 160GB HDD Playing at: Custom Settings (DISABLED, DISABLED, ENABLED) Resolution: 1280x760 - Windowed FPS 40-150  I think there should be a fully customizable advanced settings area like how games have Texture Quality, Details. All that glitz and glamour. But I think there should be a certain few settings for lights.  I also think that there should be a feature where the game tracks your preformance with the bundled songs and recommends difficulties. It'd really be nice to have the game track statistics.  EDIT V2: I GOT MY FIRST PERFECT RUN (on relaxing difficulty, I'm a noob)!  UNDERTALE OST Track 34 - Memory  Score: 15449  Max Chain 61 Timing: Perfect x61 Good x0 OK x0 Missed x0  Difficulty: Relaxing",
            "review_score": "1"
        },
        {
            "review_text": "Really love the visuals on this game.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game, it is a quality rhythm game and i can sync it to my own music library? That is a win win!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game fun to play with my Pad",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game! Pretty nice art, simplistic and colorful, the modding for Melody's skins is cool, but the best is the music auto-converter! So cool, now I can run through an obstacle course that follows the beat of Still Alive with a chell skin!",
            "review_score": "1"
        },
        {
            "review_text": "This is a really awesome game, very addictive! I've tried playing many different songs from different genres and some fit the game more than others (this might be about personal taste in music rather than what suit the game). If you're thinking about buying this game: Do it! :)",
            "review_score": "1"
        },
        {
            "review_text": "Hard. Music. Beatiful. Indie.  You cannot not love this game.",
            "review_score": "1"
        },
        {
            "review_text": "it is awsome i highly recemend it. EVERY WON SHOULD PLAY IT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! ",
            "review_score": "1"
        },
        {
            "review_text": "I am not a rhythm game person. I have never been good at them, not even remotely. All the same, I picked this game up, liking the visuals. I'm glad I did.   First note, this game has VERY FEW of its own tracks - it generates the rhythm and inputs based on the music you choose, and allows you to use music you have downloaded on your computer. If most of your music is on YouTube, convert that ♥♥♥♥ to MP3 files. Just do it. Not all genres will work well for this game, since it's primarily designed for techno/electronic, but it's adaptable and can generally put together something for any song so long as it has a consistent beat for most of the song. If it's unable to sync with the song's beat, it syncs with the song's 'energy,' IE how active/loud the song is, and generates input based on that instead.   Second note, this game works surprisingly well with 90% of the Undertale soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Straight up, just playing for such a 'short time', I'm seriously enjoying this game. Really fun as well as engaging and I suck at it",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would recommend.  Not the best 'advanced algorithm' on the planet, but certainly amongst the top ones. It's insanely fun and great to relax. The platformer is great. The slow-mo parts are epic. Worth the buy.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game with YV's theme. It really emphasized the point that YV doesn't need (no) bread.  10/10 Would emphasize agian.",
            "review_score": "1"
        },
        {
            "review_text": "Being a dancer this can be frustrating at times due to parts of the song you feel a slightly different groove However it is highly addictive all the same.  Colours a bright and contrasted well against the background, making it easy to read The engine picks up on the rhythm/beat pretty well in most songs, and places the patterns in reasonable proximity to it. Would love to see this integrate with Spotify or Google Play Music, to give players a wider option of songs  For those looking for a challenge, I recommend trying some Zouk/Kizomba remixes (notable artists Calado, DJ Kakah, Nelson Freitas) ",
            "review_score": "1"
        },
        {
            "review_text": "much music. very rhythm. wow. WOW.",
            "review_score": "1"
        },
        {
            "review_text": "This game is alot of fun to play and to add your own music is awesome i can tell i will be spending alot of my time on this game and it's at a really good price if you enjoy music rythem games then this is one for you",
            "review_score": "1"
        },
        {
            "review_text": "Melody's Escape is a really creative idea for a game. If you haven't seen gameplay or the trailer the game has an engine that creates a level to your very own music. The game comes with about 8 songs of it's own from Shiroban, a really great artist. AS you read other reviews you will see coments on the inaccuracy of the level creator to the beat of the music. I personally have only faced that with songs that don't have a (very) audiable beat/ bass. Otherwise when I played songs by Zedd, Mystery Skulls, Daft Punk, etc. they were all 100% on beat with the 'wisps' you hit in-game. The fact that you can mess up and continue (unlike the impossible game or geometry dash) allows you to relax to your very own music librarey while playing a game which is an amazing combo to have.  P.S. If you're a fan of classical or anything of the sort you probably shouldn't get this game since the game won't pick up on it as well as other songs.  P.P.S. Most Rock is read accurately by the game.",
            "review_score": "1"
        },
        {
            "review_text": "Really good rhythm game that wonderful animation and colours as well as adapting rather well to your own music. With a mod studio aand instructions included in the game's folder it's easy to see how the steam workshop for this game is filled with amazing skins that allow you to run as some of your favourite characters hopefully.  Got rather good at the game on intense difficulty, so thought I'd try overload......seems I forgot my ladder to over the huge difficulty step there :P Luckily I'm currently using the custom difficulty tool to make the difficulty increase a bit more manageable.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game, it is a quality rhythm game and i can sync it to my own music library? That is a win win!!",
            "review_score": "1"
        },
        {
            "review_text": "As some other people have mentioned, this game's algorithms only detect 4/4 time signature songs with fairly steady tempos. So any song that has changing tempos or odd time signitures (and I'm a prog rock fan... *sigh*) tends to get rather loose and screwy. However, even with that said, this game has a style and a groove that keeps you playing. Even on some of my experimental music pieces, the 'course designer' has functioned well enough, producing something that was vagely like the 'shape' of the song, although the fact that I knew the music meant I anticipated some of the beats as the game quantized the locations to another time. However, it was still a fun ride. I'm still having quite a bit of difficulty handling a well known 4/4 piece on hardcore, so the difficulty can be there, but just cruising on medium feels very relaxing and almost medatative.  I intend to keep playing, and heartily recommend it to any fan of AudioSurf 1 or 2.",
            "review_score": "1"
        },
        {
            "review_text": "Its like the cheaper awesome version of audiosurf, and you can play any downloaded song you want!!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game is you have some music downloaded to your computer and you need something to pass the time!",
            "review_score": "1"
        },
        {
            "review_text": "A pretty cool idea: an infinite runner that procedurally generates a level based on your own music library. Actually works pretty well - I find myself doing much better on levels generated from songs I know well. Nice that it has many different difficulty settings (as well as a customizable one or a 'the game plays itself' visualization mode). Lots of visual mods for it as well as being easy to mod, itself (includes a mod tool to make it very easy to make your own characters and color themes). Very full-featured, slick and relaxing. And the game has as many levels as you have music in your library! Definitely recommended!",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy rhythm games and have a decent-sized music library on your system, I'd highly recommend that you give this game a chance. In some ways it's even therapeutic in my opinion. Loving the color scheme, too!",
            "review_score": "1"
        },
        {
            "review_text": " Melody's Escape Review",
            "review_score": "1"
        },
        {
            "review_text": "Being a dancer this can be frustrating at times due to parts of the song you feel a slightly different groove However it is highly addictive all the same.  Colours a bright and contrasted well against the background, making it easy to read The engine picks up on the rhythm/beat pretty well in most songs, and places the patterns in reasonable proximity to it. Would love to see this integrate with Spotify or Google Play Music, to give players a wider option of songs  For those looking for a challenge, I recommend trying some Zouk/Kizomba remixes (notable artists Calado, DJ Kakah, Nelson Freitas) ",
            "review_score": "1"
        },
        {
            "review_text": "Melody’s Escape is a great game for relaxing and unwinding. It’s not a game that you can play for hours straight usually, for it would get boring then, but I would highly recommend it because of how calming it is. You can even choose how hard/easy to make the game, and different modes are better for your different moods.  The game allows you to listen to any song you have saved on your computer and create a specialized obstacle course based upon the game’s analysis of that song. It is like Guitar Hero except that you can choose any song you want. Sometimes the analysis of the song is not perfect and the beats are not perfectly coordinated, but there have been other times that the created “obstacle course” fits the song amazingly well. A song that changes tempo will have the runner Melody speed up and slow down. You will push buttons that coordinate with the main beats of the song or the notes of the melody. How Melody navigates her obstacles may change when the song transitions to a new section that has a different tempo, intensity, or mood. Sometimes you might hold down the buttons for long notes. It’s really quite cool when the game gets it down cold and you feel like you’re watching a music video of yourself playing.  (The best song I’ve ever seen in Melody’s Escape thus far is XOXO by Secret and Whisper. WOW).  Even when Melody’s Escape does not get the rhythm down completely correctly (and it’s a hard algorithm to do… I’ve seen my professional music composition software programs fail on this front) (and frankly Melody’s Escape does PRETTY WELL), it’s always visually stunning. The game is beautiful. The design is artistic and engaging. However, I do warn people who have challenges with fast motion or flashing lights that this might be too visually intense for you. That is the only visual negative of this game that I can think of.  For people who like to unwind listening to music but want a little extra to do with their hands, Melody’s Escape is perfect.",
            "review_score": "1"
        },
        {
            "review_text": "I'm so in love with this game. I love how the music sychronizing with the background and movement of the character matching the music feels so great. Very addictive and hope more awesome additions to this game. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "I don't usually jump right out and review a game.  If you don't own '2112', buy '2112' (seriously, great album, just do it.)  Then play '2112' with this game.  That was enough for me.",
            "review_score": "1"
        },
        {
            "review_text": "That's a very fine piece of software!   Sometimes the music interpreter get a bit lost, but I guess its very hard on some musics.  The best music outcome I had was with: Cherry Lips by Garbage.  Edit:  Another fine music: Sobakasu, from Rurouni Kenshin",
            "review_score": "1"
        },
        {
            "review_text": "Melody's Escape just left Early Access and I luckily got it at the sale price. I played it before with someone else at an internet cafe when it was in early access. It was quite buggy then BUT its an amazing game. Its one I would HIGHLY recommend. I will not hate you for not believeing reviews. I actually was like many people. I saw the trailer but didn't seem all too convinced it was good. I was really wrong. Its a game that may always be easier or difficult-er. I do think that you should play the relaxing difficutly for your first time. I tried all other difficulties and it just goes to hell from Medium.   My Current PC w/ Melody's Escape: GeForce 210 Core 2 Duo 160GB HDD Playing at: Custom Settings (DISABLED, DISABLED, ENABLED) Resolution: 1280x760 - Windowed FPS 40-150  I think there should be a fully customizable advanced settings area like how games have Texture Quality, Details. All that glitz and glamour. But I think there should be a certain few settings for lights.  I also think that there should be a feature where the game tracks your preformance with the bundled songs and recommends difficulties. It'd really be nice to have the game track statistics.  EDIT V2: I GOT MY FIRST PERFECT RUN (on relaxing difficulty, I'm a noob)!  UNDERTALE OST Track 34 - Memory  Score: 15449  Max Chain 61 Timing: Perfect x61 Good x0 OK x0 Missed x0  Difficulty: Relaxing",
            "review_score": "1"
        },
        {
            "review_text": "A rather nice rythym game on the vein of DDR or Crypt of the Necrodancer. Varying difficulty levels for those with better reflexes than I, or those that just wish to be a completionist.  One good mark about it is that you can even play your own personal MP3s and MP4s for it, just as long as it's not a video.  And it does a very good job of detecting the rhythm of the song you're playing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so cool! You can drag any song into it from your desktop and it will make a level for it. Music from any game on steam works on it too.",
            "review_score": "1"
        },
        {
            "review_text": "great game, had lots of fun putting in random songs into and running the levels, can create levels that fit rather well with the soundtrac, especially with tempo. Would love more interesting visuals though currently is very nice and undistracting.",
            "review_score": "1"
        },
        {
            "review_text": "Now THIS is something I can get addicted to.",
            "review_score": "1"
        },
        {
            "review_text": "Melody's Escape is a really good Procedurally generated rhythm game, especially for those looking for a challenge. my only complain is that it is nearly unplayable if your pc is unable to run it, granted thats how i feel most rhythm games should be.",
            "review_score": "1"
        },
        {
            "review_text": "A Challenging rhytm game that plays your own music. Character and theme customization are simple and good.",
            "review_score": "1"
        },
        {
            "review_text": "Melody's Escape worth to buy if u looking for rhythm game, simple to play, nice music pack. U also can add ur own music, and there's workshop too if u got bored with default skin",
            "review_score": "1"
        },
        {
            "review_text": "Very addicting and is perfect for getting lost into your music. If you enjoy rythem games at all, you would be a fool to pass this one up.",
            "review_score": "1"
        },
        {
            "review_text": "If you love Music,Running,Little bit action...I think you should buy this game.  ",
            "review_score": "1"
        },
        {
            "review_text": "Game runs well (ba dum tss), simple concept yet challenging at higher difficulties. Loving it, esp. for short play sessions, perfect for lunch breaks :D",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "One of the best music-based rythm games I have EVER played. It's definitely worth buying. I recommend this to anyone who loves music &amp; a little challenge at the same time. ;) Nothing more satisfying than sliding, jumping, and flying to the rythm of your favorite songs or tapping the arrow keys to the beat!",
            "review_score": "1"
        },
        {
            "review_text": "So, The concept behind this game a great, and original. A game that generates a course based on the rhythm of your music? Awesome!  However, I feel like it only works well with certain songs. Sometimes the speed and complexity of the course changed with the songs rhythm, while with other songs the course was the same speed and complexity the whole time.  So, Great idea, but needs to be improved upon.",
            "review_score": "1"
        },
        {
            "review_text": "This is beautiful! Exactly the kind of game i need when want to take my mind of things. 12/10.",
            "review_score": "1"
        }
    ]
}