{
    "app_id": 270330,
    "name": "Ku: Shroud of the Morrigan",
    "release_date": "2014-03-17",
    "developer": [
        "bitSmith Games"
    ],
    "publisher": [
        "bitSmith Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Action"
    ],
    "achievements": 21,
    "positive_ratings": 24,
    "negative_ratings": 60,
    "price": 3.99,
    "description": "A Celt-punk action-adventure set in a future Ireland ravaged by technomagical war and economic collapse, humanity clings on by using the remnants of technology that survive. Our hero must venture into lands unexplored, twisted by strange and mythical powers.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/270330/header.jpg?t=1447359789",
    "minimum_requirements": "OS: Windows XP, Vista 7, 8 Processor: 1.7 GHz Dual Core or Greater Memory: 2048 MB RAM Graphics: 256 MB DirectX 9.0c compatible graphics card (shader model 2) DirectX: Version 9.0c Storage: 1000 MB available space Sound Card: DirectX 9.0c compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "K:SotM is an incredibly short game. It took me under an hour &amp; a half to complete, and I ran around searching every corner of each map.  It says it all that the length is my lasting impression of this game. It doesn't really have all that much going for it besides the visuals. The general look of the game reminded me a little of Bastion, but K:SotM does have its own unique look. The game presents itself as a top-down action game with a very distinct art style almost like each moving part of a character model is a separate cut-out drawing. This is rather pleasing on the eye, although some models have clearly had less attention than others. The screen is also too focused on the player, so you cannot see very far in any direction. I also had to use Task Manager to close the game at one point in the story, as an image that covers over almost the entire screenspace would not go away and the menu was unresponsive.  The game control scheme includes gamepad usage, however I could not get my official 360 wired control to work (and Steam forums are littered with others having issues with different controls). Instead, I had to use my mouse to play the game where left clicking moves your character &amp; attacks, right-click performs a dodge roll, and space bar fires your projectile. The input of what I pressed on my mouse was frequently ignored by the game, causing me to stop moving at crucial moments, or for it to not use the correct weapon. The combat felt very clunky because of this. Also, there is only 1 melee weapon, and 1 projectile weapon. The lack of variety, no abilities, and only 1 melee combo attack mean that combat gets very stale regardless of the enemies. There also is not a huge range of enemies in the short campaign, although there are more variants of these enemies in the combat arena mode which adds a little extra lifespan to the game.  The audio is rather bland. There is not much of a soundtrack, none of the characters are voiced, and there are only a few sound effects in the game.  So to summarise: I do not recommend K:SotM, even if you have spare money to burn and it is on a heavy discount. There simply is not enough content here, and even if there was the gameplay is too repetitive and glitchy. To top it all off, the game ends on a humongous cliff-hanger that cannot really be justified when the game is so short.",
            "review_score": "-1"
        },
        {
            "review_text": "I really like this style of Action RPG.  I see so many people complaining about things I personally feel are nitpickings.  The sound effects remind me of older games, some SNES favorites came to mind (Secret of Evermore, Zelda) The graphics aren't the highest quality, but I don't ever really care, I grew up on grids of colored squares, this is fine. I like hand drawn games, and this genre is probably my favorite.  The game progresses quickly, and I do not mind that at all. I enjoy a game I don't have to invest half a year to beat. I also look for titles that will play on even my lowest systems, I own alot of various computers, and it is not often that the game I am currently working on will play on a majority of the lesser endowed machines.  It is a decent game, short but decent. For games on the $5 tab, it does pretty well IMO. Budget games have their drawbacks, this is at least playable and nice to look at (and they aren't wasting your time with the length)  I am not calling it GoTY, but it does not deserve this BS low rating.",
            "review_score": "1"
        },
        {
            "review_text": "In this game, developed by bitSmith Games out of Dublin, you will be playing the part of Ku a very undersized individual of a village that is in serious trouble. It turns out that someone has made off with the power ring that helped power the village, and now without it the village is in grave danger. You decide that you are the only one that can do the job so you are sent on an adventure to the outside world, a place that no one really knows about, and is said to be full of danger.  Graphically the game looks like it was hand drawn by a very skilled artist. Unfortunately some of the effect of the art is ruined by the fact that the background layering on the screen mixed with your character's position is a bit all over the place. What I mean by that is that there are times where your character might accidentally lose his head, graphically, because of something that is supposedly behind the character but is being rendered in a layer in front of him. Overall, though, the enemies, other characters, and environments look amazing.  The music fits the game nicely and I could definitely listen to it even with the game not on. My one issue is that the settings for sound and music levels do not save from play session to play session. So if you have that perfect balance that you want in the game, you are going to have to either take a screenshot, to make sure you get it back the way that it was, or you are in for a rude awakening if you play the game a second time.  The controls are probably the thing that doom this game the most. I do not know what happened with the controls, but I can tell you that it was not good. I started off playing with the mouse, and apparently you should be able to play the whole game with just the mouse, but it turns out that my middle mouse button, or the wheel, did not register in the game, and you need for it to work to get you out of some situations, or to solve a puzzle. Thankfully the spacebar works as a substitute. Then I got to the flying portion of the game and found that no matter what buttons I pushed, including the left mouse button, which was shown on the screen to me, there was no key registering in the game, and I crashed and burned each time. Now that caused me to have to break up my gaming sessions because I needed to then find a controller to test the game with. When I plugged in the 360 controller I found that the mouse button now worked, but as I had plugged in the controller, I wanted to play the rest of the game with the controller. Sadly this was not a permanent solution for playing the game. Several times during my second play session I had to revert back to using the mouse because I could never get the precision, or the comfort of playing with the controller during battles. It was completely hit or miss.  Alright so lets get into the actual game play. First off whomever wrote the script really should have read over it as there were some very odd choice of words used. I felt like they were trying to show how smart they could be by using seldomly used big words, instead of using language that would help the player better understand what was going on. There were also some glaring issues that drive an OCD person crazy. When entering a cutscene, if you were using the mouse chances were that you could be locked into a perpetual state of running during it, and since there were no voices to what was going on, all you could hear while you read the dialogue was the sound of your character running. Speaking of which, if you accidentally over-run the point in the level where you are about to face off against the fire bolg, it will kill you during the cutscene, literally every time. Oh and speaking of that beast, if you are stuck in a state of running when you finally have to face off against him, which you really don't get to do, you will see the cliff give way and your character will run FOREVER in the sky, and you can't advance the game. The final quick thing I have to say about this game is that it is an hour and a half game, with a to be continued slapped on the end. With that short of a playthrough, the developers should have added the to be continued on to this game.  Now there was one thing that I think the game got right and that was the use of the power glove that your character had that allowed him to lift objects in the level and position them where you would like. Speaking of the levels, I think a map could have been nice in the game, and also if the game is supposed to be linear, point a to point b, type of game, they need to make entrances to different parts of the level disappear, block it, close a door on it, something because gamers will want to backtrack if they think they might have missed something. Alright, one last thing, the random load screens that have nice drawings on them, but don't really do anything for the game, except will not disappear until you have clicked on the button, or pressed the B key if you are using the controller, it feels like the artist had some more ideas that weren't put into the game and so this is how they displayed them. It would have been nice if the game just incorporated those into cutscenes.  Alright so here's the deal folks, this could potentially be a good game, but they should have tested this game to its full extent, and also work out some of the obvious kinks in the game. I wish I could give this game a score based on potential, but that would be unfair, so I've got to say avoid this game, at least for now, and I give it a 3.7 out of 10.",
            "review_score": "-1"
        },
        {
            "review_text": "Better than anything Digital Homicide has ever produced.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game in a bundle and I still feel ripped off.  There are several Problems within the game. 1. Sound design Why the hell is my character constantly tapdancing, its so incredibly annoying to constantly hear his 'TAP TAP TAP' with every freaking step, if you decide to make stepping sounds, do so without wanting the palyer to rip his ears out. The same thing goes for every other sound, the swordhit is laughable, the shooting sounds weird, only the music sometimes manages to fit sometimes.  2. Combat The combat is case sensetive, meaning your character only swings his sword, whenever he feels like it, that lead me to hammering my controllerbutton, till he finally swinged his sword and even better I got stuck in one room, because an enemy, that I needed to kill, was hidden behind some texture, as you can't kill anything with your shot I was forced to quit the game all together, as there is no way to 'reload' the room with entering and exiting, you just run into pure blackness, when you go towards the 'entrance'. Furthermore the combat is void of any strategy, I actually tried to play the game like you normaly would, dodge incoming attacks and hit and run, turns out its much better to just keep on beating on normal enemys and just avoid boss enemys, because just attacking the small guys leads to quickly finishing them off with the combos and makes them more likely to drop health items  3.Bugs There are several obvious bugs, for example in the end i had 10/8 stones in my overview, several achievments did not unlock and of course the game ending bug for me was that I could not kill the guy blocked by scenery, which wouldn't be a problem, if either my range attack would do more than stun, funny enough you would think that constantly shortciruiting a roboter will kill it after some time, or if the swordswing would not be depending on the enemy, as i'm sure I would have hit his hitbox otherwise   In the end the game is lacking in many things, its rather short, as I'm sure I was just about to finish the game before the bug hit, its very bug ridden, the combat is bad, the sound is annoying and that all is a shame because the world itself seems atleast interresting, even if you get to know next to nothing about it..which is also a shame.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste your money- about the only redeeming feature of this game is the art. The rest is a buggy, broken mess in a world full of empty spaces.",
            "review_score": "-1"
        },
        {
            "review_text": "Bugs... Artworks are.... =='",
            "review_score": "-1"
        }
    ]
}