{
    "app_id": 270310,
    "name": "Dominique Pamplemousse",
    "release_date": "2014-03-11",
    "developer": [
        "Squinkifer Productions"
    ],
    "publisher": [
        "Squinkifer Productions"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Captions available"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 261,
    "negative_ratings": 96,
    "price": 0.79,
    "description": "Dominique Pamplemousse in “It’s All Over Once The Fat Lady Sings!” is a unique and offbeat stop motion animated detective adventure game about gender and the economy. Also, all the characters frequently burst into song.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/270310/header.jpg?t=1478023213",
    "minimum_requirements": "Minimale : Système d'exploitation : Microsoft® Windows® XP or later. Processeur : 2.33GHz or faster x86-compatible processor, or Intel® Atom™ 1.6GHz or faster processor for netbooks. Mémoire vive : 1 GB de mémoire Graphiques : 128MB of graphics memory. Espace disque : 60 MB d'espace disque disponible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I really tried to like this but by the time the 15th off-key singing verse was used to reveal even the smallest bit of useless info, I just couldn't take it anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't in good conscience consider this a good game I can recommend, but it was interesting watching it fail at what it's trying to do, and at least it's an original concept.  The only way I can describe it is as a stop motion musical in a point &amp; click framework. It mostly fails at all these three things, mainly by looking, sounding and playing as the work of an amateur. The art style is distinct, but the stop motion isn't all that good. Still, it's charming. The music and highschool-musical-theater singing are also kinda charming, at least once you realize that the singing is off key and rather bad 'on purpose', but you still can't call them good. The point &amp; click elements are barely there, with no real choices and no real puzzles, just serving to move you forward in the story.  I think what really tipped this over to no for me was the story. It's very much on the nose. It's got some points to make, and instead of building them organically into its storytelling, it just repeats them over and over. We are never really allowed to empathize with the characters: Instead of watching them deal with the world and its problems we are being told what their problems are and are expected to feel something from that. Good storytelling doesn't really work that way. So if one of the goals of the game was to make us think about gender and the economy, it very much falls flat. Instead of sounding humorous and lighthearted as it seems to attempt to, it feels awkward and preachy.  So an interesting little amateur experiment, the first commercial game of a single developer working on their own, trying out a relatively novel idea. I didn't regret the cup of coffee I paid for it with the discount, because the aesthetic is charming and because it didn't overstay its welcome, but that doesn't mean it's a good game.",
            "review_score": "-1"
        },
        {
            "review_text": "The reviews seem to be love or hate, but I'm set on 'generally charmed'. Dominique Pamplemousse is a game that oozes hipster indie style, and that's not my interest. But the game is short and sweet enough that I'm happy with it as a bonus to a Humble Bundle. Check out some clips to see if you have any interest.  The game is flawed but charming, short but a complete tale. I normally hate on Flash designs, but the game is short enough to complete in one sitting (30-60 minutes) so save-loss doesn't hurt so much. The game reminds me of the 90's; the modern environment would never fund the quirky games developed then. Gameplay is simple point-click adventure, but nothing is really clunky or poor. The singing can be annoying but never bothered me enough to stop it. The story was odd but generally worked.  My main irritation:   Why frame Dominique to be removed from the scene? The easier alternative was to not hire that detective in the first place. Dominique already resigned to losing the research years ago.    I enjoyed the game, more than others which I've gotten for free or in a bundle. I'll admit, the game should probably be fully free but there are free methods to enjoy the game if you really need. The game could be polished and improved, but I would be interested in a sequel. It's odd and campy, but I found it entertaining for an evening. I'd recommend a sale, but the game is unique enough that you should determine how much you're willing to pay yourself, no discount target from me this time.",
            "review_score": "1"
        },
        {
            "review_text": "Best horrorgame I've ever played. Was an horrificlly grotesque hour of gameplay!  Was so grotesque in fact that I even started a second playtrough.  I rate 9 out of 11",
            "review_score": "1"
        },
        {
            "review_text": "Knocked out an officer while playing the bagpipes. Scared them so they tripped and slipped on water.  10/10 I should really use bagpipes more often.",
            "review_score": "1"
        },
        {
            "review_text": "Hard to call it a game, rather a musical. All you have to do is to click the text, and listen how NPC sings the answers, go to the next location and do the same. It can be finished in 2-3 hours, and that is because you can't just skip the dialouges. At least you can get the trading cards, and that's the only good thing in this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought this would have been a cool game - the premise had me at 'hello', after all. Instead, I found it ugly, grotesque, badly produced and grating, and not in that fun, bewitching John Waters way either. 0/10, heartily DO NOT RECOMMEND.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is the best $5.00 meme I've ever bought  Pros: Dank ♥♥♥♥ing Meme   Cons: It sucked out my soul in under a half hour   Score: 9/11  Casey Bingham's voice give me an erection",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this game. Picked it up off the Humble Bundle, and glad I didn't buy it.  This game has the worst voice acting ever. Whether it's on purpose, I can't tell, but it sounds terrible. You click on something, and the guy says 'Oh look. A stack of bills I havn't payed' *pause* And then you're like, oh good its over, I can get back to playing. But no. The main character 'sings' at you for another 10 seconds. The graphics are kind of ok I guess, but that doesn't justify buying it. The music might be satirical, but I honestly don't see it being anything more than a thing to suffer through to get to the next point in the story.  I would not recommend this game to anyone that likes good graphics, good singing, and has a limited sense of (very) hidden satire. But you know. Each to their own",
            "review_score": "-1"
        },
        {
            "review_text": "This is a polarizing game. If you hate musicals you may want to skip it because you will find it too annoying to complete. All in all I loved it. It brightened my day. When Casey came out and starting 'singing' it was absolutely hysterical. This is a satirical commentary on the sad state of electronically altered pop music and a throwback to classic musical theater. Brilliantly done.",
            "review_score": "1"
        },
        {
            "review_text": "Dominique Pimplemoose is a video game. Most people who play video games regularly would probably not find Dominique Poopypants to be a good video game. Dominique Preppyplotz is driven by the most basic of point-n-click mechanics; don't let the haters convince you otherwise: Dominique Pamplemousse is a game that is worth playing.  Soon's I started the game, I was assaulted by grating talk-singing and laughable animations. The premise was somewhat intriguing and the environments were actually &gt;adequate. I kept playing to see where the game would lead; I discovered more of the same, but grew to enjoy even the worst aspect (except having to call the Officer   to the cell   over and over - not really a big deal either, though).   This is truly one of those games that is 'so bad it's good.'  This is actually a game that took skill to make and was intentionally made (')poorly('). I wouldn't say it's on par with the level of incredibly talented portrayal of being talentless like Spinal Tap, but I enjoyed Do'mousse very much. The ending made me feel weird though: There are   two   endings. The   one I picked didn't really amount to much  ...  'The economy' is referenced several times throughout 'nique'Pample (pronounced 'kneecap-Lantern'); having the apparently far-fetched opinion that I do - that Dominique Pamplemousse is worth your time - I'm hesitant to suggest that the entirety of the game might be (among other things) a commentary on the economy... but... yeah... That is not meant to excuse any sort of criticism that could be laid on the game - neither is the relatively cheap asking price - it is simply an, er, evaluation of the game.  I liked it - some won't - some will - Nyeh.  Gameplay: You click on people, hear conversations.  You click on things, hear commentary.  You click on notes, hear summaries.  You click on items, you listen to those interactions (would say watch, but there's not much to).   You play a simple game of detective. You marvel at Determined Parachute, whether in a good or bad light.   I recommend this game to the certain few who can dig something different.   Oh and (a voice that sounds like)   Zimos from Saints Row   is in the game. So. And there's a    bagpipe. And Twilight gets made fun of.  ",
            "review_score": "1"
        },
        {
            "review_text": "Whilst this basic game's simple clay animation graphics may attract some strange people, no matter how odd and lonely you are, do not buy this. However, this game makes an excellent present for that one friend who you wish was not your friend.  From as far as I have got, there is little important story, and the game has a bug in it, which prevents me from progressing any further, and thank god it wont let me  Do not wish this pain upon anyone who you enjoy the company of, it is literally worse that herpes",
            "review_score": "-1"
        },
        {
            "review_text": "art games!!!!!!! very good if you want to buy something to fit a demographic that rewards a lack of effort.",
            "review_score": "-1"
        },
        {
            "review_text": "This must be the worst game I have ever played.",
            "review_score": "-1"
        },
        {
            "review_text": "Managed to literally scare the crap out of people with the bagpipes  11/10",
            "review_score": "1"
        },
        {
            "review_text": "It hurts to live.",
            "review_score": "-1"
        },
        {
            "review_text": "Black and white play-doh point and click about a non-gendered sentient claymation detective that sings off-beat most of the time. Strange, yet satisfying. Get it when on sale for a dollar due to it's shortness.",
            "review_score": "1"
        },
        {
            "review_text": "A short little adventure game with an interesting animation style. The gameplay is a standard point and click, with most of the gameplay consisting of clicking dialogue options and listening to the characters sing. It's not for everyone, but pick this up if you want to play something short and memorable.",
            "review_score": "1"
        },
        {
            "review_text": "I love it. It's quirky and amusing, and short and sweet. Dominique Pamplemousse is not for everybody, but that's not necessarily a bad thing.",
            "review_score": "1"
        },
        {
            "review_text": "Don't listen to the 'top' reviews (which are the only negative one, by the way), this is a really nice game ! You have to realize this was basically done by one person with the help of a few others. I really admire the developer, she put that game together by herself and it must have taken a lot of time and dedication ! It's truly amazing to me. I really don't have anything negative to say about this game. I think the singing is funny and charming, In fact, the whole game is funny and charming ! It's a bit short, yes, but it's definitely not outrageously so. What do people expect of a game made by one person and that costs $5 ?  I think you should definitely try it if you don't take yourself or games too seriously and if you want to support the work of hard-working independant developers ! Have fun !",
            "review_score": "1"
        },
        {
            "review_text": "A short and sweet little point &amp; click musical. Well written, and sung with charming enthusiasm. The puzzles are quite easy (except for a single confusing pixel hunt) and the music may not be to everyone's taste, but it's clearly a labor of love.",
            "review_score": "1"
        },
        {
            "review_text": "Stop motion animation, Adventure games, and musicals are three of my favorite things.   So, what happens when you throw them all in a blender? Magic, right? Well, kinda.  Dominique Pamplemousse in “It’s All Over Once The Fat Lady Sings!” is a combination of all those things. Using real clay characters, animated in the stop motion style, Pamplemousse tells the story of wealth inequality, gender politics, and detective work, while having the characters break out into song.  At times, this makes the game transcend all media I have seen, while you and your angry landlord have a singing fight while you run around the apartment looking for money, while at times, it hits the wrong note, sometimes quite literally.  The voices, including the singing ones are all done by one person, and all are 'in character' when they sing, which unfortunately makes encounters with characters unbearable, as the teenager predictably has voice cracks, pops, and is generally off key quite a bit.  There's evidence in the game to support the theory that the unprofessional singing, and out of key songs is intentional, but it still is incredibly off putting when it rears it's head.  The art style is unique to say the least. This isn't the first time an adventure game, or any game for that matter has been stop motion animated, but each puppet is stylized as if it was made in pre-school, and the rest of the game tries to follow suit. Compared to the serious model quality of Aardmann (Wallace and Gromit) or Laika (Coraline), it's a refreshing take on the way stop motion models are made and animated, each character only having a few key frames of animation they run through.   The gameplay is less adventure game than I would have hoped. There are objects in the few environments that the game throws at you, that you can click on and interact with, and there are 2 light puzzles that shouldn't be too hard to get past. The rest of the game is carried out through dialogue boxes, where you interrogate people with the evidence you have found so far, occasionally causing a character or 2 to break out in song, singing about their feelings on a topic.   Dominique Pamplemousse is nominated for 4 IGF awards including the grand prize, and it's easy to see why: its fresh, clever, and thoughtful. However at times, it falls short of being astonishing, and ends up being mostly OK, with a few really great parts thrown in.  If you like strange, experimental games, you should probably give Pamplemousse a shot, its out there, clever, occasionally funny, and presents an interesting idea to the table: a musical video game. If it looks too strange for you, it probably is. It's quirky and weird, and that just may be it's downfall.",
            "review_score": "1"
        },
        {
            "review_text": "A game that addresses gender identity needs to be recommended.  Other than that, I bought the game on a whim...and I can't stand musicals. If you could skip the singing like you can do with spoken dialogue it would have made the experience far more enjoyable. For a game priced at just under 4 quid for it definitely had more humour, bizarreness and creativity to be well worth the price.   My ears hurt.",
            "review_score": "1"
        },
        {
            "review_text": "I've only just begun playing this but I know if I could define myself through a game this would be that game. It's actually perfection. If you love terrible opera and stop motion and something that so barely resembles a game it's laughable (and I do mean laughable) you should get this. So you should definitely get it.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly thought this was a cute little game, and it did it's job of keeping me occupied for over an hour.   Most of the dialogue is sung (horribly tbh) which is kinda humorous and it has a neat story. Obviously I wouldn't recommend this game to an intense gamer, but it's a nice little casual game which is what I typically enjoy more.",
            "review_score": "1"
        },
        {
            "review_text": "This is an odd one..  Are there really interesting puzzles? Hmm cute but nothing that stands out. Are there a lot of locations? Nope. You see almost all of them up there in the screenshots. Will it occupy a significant chunk of time? A bit over an hour after start I was done, watching both ends and credits.  So WHY am I recommending this anyway ??  It is a good example of the whole being better than the sum of the parts. It is just so darn charming. I've played countless adventure games of all size and styles, and this one was still a fun little rump to go through. Half of it is sung and I usually HATE musicals -- I was singing along at times because it was funny and fun.  I recently passed 600 titles in my Steam library, and this is a little that stands on its own, playing by its own rules and I like it for that. Who does a noir+b&amp;w claymation musical adventure game anyway ?? I want more of that kind of weird mashup :)  If you prefer CoD type killfests or have ever left a post saying 'this sux' about ANYTHING ever, just go on elsewhere and have fun, I'm guessing this perticular project won't be your cup of tea.",
            "review_score": "1"
        },
        {
            "review_text": "The rhymes are a bit trying at times, but the adventure has neat little twists. Wholeheartedly recommended to point'n'click entusiasts.",
            "review_score": "1"
        },
        {
            "review_text": "A Short, musical, sweet adventure game",
            "review_score": "1"
        },
        {
            "review_text": "Ok, so, this game is like, ya know, cute n' stuff? Also one of the best games I have ever played",
            "review_score": "1"
        },
        {
            "review_text": "Please make more things, this is a delight.",
            "review_score": "1"
        }
    ]
}