{
    "app_id": 270450,
    "name": "Robot Roller-Derby Disco Dodgeball",
    "release_date": "2015-02-19",
    "developer": [
        "Erik Asmussen"
    ],
    "publisher": [
        "82 Apps"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Sports"
    ],
    "tags": [
        "Multiplayer",
        "FPS",
        "Fast-Paced"
    ],
    "achievements": 76,
    "positive_ratings": 3155,
    "negative_ratings": 259,
    "price": 6.99,
    "description": "A futuresport FPS where you race around a skate park / dance club and nail each other with dodgeball trick shots. Singleplayer + Local Multiplayer + Online Multiplayer with 27 different objective-based game modes...or create your own!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/270450/header.jpg?t=1532311458",
    "minimum_requirements": "OS: Windows XP (Vista not supported) Memory: 2 GB RAM Graphics: Video card supporting shader model 3.0 Storage: 400 MB available space",
    "recommended_requirements": "OS: Win 7, Win 8 Memory: 4 GB RAM Graphics: Video card supporting shader model 3.0 Network: Broadband Internet connection Storage: 400 MB available space",
    "reviews": [
        {
            "review_text": " Pros:  - Great Multiplayer Component with countless gamemodes. - Great Singleplayer Component with gamemodes such as horde, arcade and more. - Fun gameplay. - Strong replayability. - Good amount of customization. - Upbeat and fun soundtrack. - Nice colorful graphics. - Developer is super cool, dedicated, and listens to feedback. - Bots are pretty strong.   Cons:  - None   Final Verdict:  This has to be one of the best games to come out of Steam Greenlight and Early Access! Everything about the game is fantastic. If you enjoy multiplayer you'll love this game, if you enjoy high replayability singleplayer games you'll enjoy the game aswell. This game is well worth more then the $15, for a indie game this game surpasses most multiplayer FPS games. Overall I cannot recommend this game more. Well worth the money.  10/10.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have ever played. Would recommend to anyone who doesn't have epilepsy.",
            "review_score": "1"
        },
        {
            "review_text": "This is another hidden gem on steam that would give Ricochet a run for it's money. Robot Roller Dodgeball is dodgeball that knows no boundaries and puts everyone playing at risk. Such an extremely simple 'FPS' game made with care and precision.  In Robot Roller-Derby Disco Dodgeball, you control one robot whose face you can customize. The controls are relatively simple and require precision aiming more than anything. Think of CS : GO type of game-play movement and that's essentially what you get. The catch? Your robot is on one wheel always rolling around somewhere. There are primarily nine directions you can direct your robot in, all in which will move it at a constant speed. This clonky directional movement can be interrupted and perfected thanks to the mouse. To shake-up the game and to keep it away from being bland they added a jump feature (which you can hold down longer for a bigger jump) and a boost feature, in which both are extremely handy. The game has more game modes than I have fingers on one and possibly two hands. My favorite game feature is their incorporation of basketball or 'hoops' as they call it. The player can hit other players with the dodge ball, but there is one golden ball that needs to be used to score a point. To do so, the player has to throw the ball on one side of a square floating in mid air by the other teams spawn point. There is also a free for all setting for the mode. Other game modes feature (team) deathmatch, score battle (first team/person/robot to x amount of points), elimination where one by one team members get knocked out and wait for the next round, super ball where players have to keep hold of a certain ball to accumulate points, grand prix where players have to race around a map, horde (single player) where you face up against one robot (then two, then three etc...), and finally training. Any game willing to add variation deserves some credit, and disco dodgeball definitely deserves a high five or two.   Besides game modes, players can pick up random power-ups found spread out throughout the map. Some power ups include larger ball, fire/laser ball where it can't be stopped, jet pack to stay in the air longer, boomerang balls, and even a super boost that replenishes boost a lot quicker. How do you pick up a dodgeball? You'll find them laying around everywhere after people start throwing them. They are pretty hard to miss as white globes on the floor will glow brightly. They've also put in a feature where you can CATCH a dodgeball. It's a hard skill to master as you have to point at the ball but results in an opponents quick death. Throwing power can be modified the longer the mouse button is held down. This is useful if you'd like to ricochet your ball off a wall to hit someone on the other side of it.    Graphics  themselves are a nice twist and keep everything simplistic. There is nothing wrong with being simple as it keeps the focus towards the game. If you are sensitive to a bunch of different lights going on and off you might want to take some precaution.  Sounds  themselves are neat, subtle and sort of quiet, but neat. The music is what protrudes the most at all times. One thing I noticed graphically was when hitting an opponent with a ball, instead of the opponent blowing up or the ball stopping in it's tracks, there's a little recoil when hitting an opponent, then they blow up. This is a tiny feature that makes hitting an opponent with a ball that much more rewarding.   The price is a bit steep I must say but if a sale comes around, I'd say pick it up! Also, for the wary, the servers are sort of empty at times but there are bots to keep it interesting. You will find some stragglers once in a while playing.     RATING : 7.25/10         Gameplay   B     Story / Campaign   N/A     Visuals / User Interface   B-     Sounds / Music   B-     Replay-ability   B-     Overall    B-       ScreenShots :",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those simple and ridiculous party games that you play late at night when you're depressed and bored. It's an utterly stupid concept with ridiculous physics and incredibly satisftying gunplay that needs more players, so go ahead and buy it. Very uplifting and exciting.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game and throw dodgeballs at your friends.  Does it need more of a review than that? Not really.",
            "review_score": "1"
        },
        {
            "review_text": "I felt like rewriting my original review because I think it isn't in-depth enough so here's a longer one.  Robot Roller-Derby Disco Dodgebal  I cannot recommend this game enough. I got it yesterday during on sale for 9 bucks. Right from the start I was having a blast with it. I was having so much fun in fact I had to buy my buddy a copy so he could jump in as well.  The game plays more like a classic arena FPS than a modern FPS but instead of turning other players into giblets you're throwing dodgeballs at them. There are many unusual mechanics that add to the game a lot. For instance sprinting is called 'boost' and after you use boost you have to let it recharge back to %100. Jumping doesn't just require taping the spacebar but also holding it. The longer you hold it the higher (or farther) you jump, it also has a 100% meter so you have to let it charge to use it again. Once you have a dodgeball in your hand you can throw it by holding and releasing the right mouse button. Charging it up to 100% makes the shot as strong as it can be. The left mouse button is used to power slide (think drifting). To power slide you hold forward, lmb, and turn towards a certain angle so you can't power slide just by moving forward. While power sliding your boost meter charges up quicker and you can even overcharge it giving you a faster boost. Besides throwing the dodgeball you can also catch, catching it automatically eliminates the person who threw it like in real dodgeball.  Moving around is also quit different from other shooters. Since your not a bipedal human but a single wheel robot you can strafe as fast as you can walk forward and backwards but once you press w,s,a, or d you will move in that direction till you press another movement key or press the brakes button (e is default key). So basically if you press forward you will continue moving forward until you stop or move elsewhere.  Just like a classic arena FPS you have an announcer announcing crazy kill combo you just had (double kill, multikill, ramapge). Besides getting extra points for racking up kills you also get extra points for doing trick shots and the announcer would say it as well. These include ricochet (hit a guy indirectly) dunk (hitting a guy underneath you midair) and long shot (the farther the range the more points you get) and plenty more.  There are self improving upgrades in the game that can help you out during a match. The power ups are placed around the levels so if you're quick enough you can get one at the very beginning of the match. You can't know what power up you're getting because its random so you can't always get what you want. Some of the power ups include fireball (a blazing dodgeball that can't be caught so its best to avoid it), pogostick (lets you jump higher than normal) and jet pack (lets you hover with the jump button until your jumping gauge is 0% or until all your fuel is depleted). There are many more that I can't name at the top of my head.  The electronic dance music also adds a lot to the game. Shooters these days try to present themselves as rough and serious since hearing your enemies footsteps is vital, I totally understand that this a valid reason but I miss the classic multiplayer soundtracks from past shooters (Foregone Destruction anyone?). Having EDM music in the background makes it more... I dunno... soothing? Like I haven't raged quit it this game even in matches where I go 3 and 15. I don't take it to so serious and its ok because I'm still having a blast. Sometimes I even bop to the beat and try to aim my shots when the bass drops or whatever lol but that's just weird ol' me. Multiplayer modes include:  Deathmatch: Self explanatory. Score points by getting kills, the more kills the more points.  Score Batte: Which ever team scores the most points wins. To get a lot of points its best to do trick shots.  Elimination: Just like in real dodgeball, once you're hit you're out. If your teammate catches a ball you can come back in.  Hoops: throw dodgeball through enemy hoops to score points, who ever scores the most wins.  Super Ball: Hold the 'super ball' for as long as you can to score points for your team. If a teammate has it you have to defend him. If a enemy has it you have to take it away from them.  Grand Prix: you have to race around an arena to get to checkpoints. Leaders earn double points so his effort is vital. Also boost+drifting is key here.  If you don't feel like playing multiplayer the single player aspect of the game is also super fun. Modes include:  Training: pretty self explanitory, if your a newbie definitely give it a try.  Arcade: Beat a group of bots (at the end of three waves or so you have to fight a boss), collect cash, buy upgrades with that cash, and keep playing till you hit game over. You start off with 4 lives but you can gain more later with upgrades. once you deplete all your lives you die.  Challenge: Challenge isn't one mode but about 4-5 different modes. I haven't payed them yet but I'll check them out later.  Bot match: If you feel like playing an offline match with bots then you can.  I haven't let this game go since I bought it yesterday and Its because I've been having so much damn fun with it. My go to FPS is still BF4 right now but unlike BF4 in RRDDD not every match has to be super focus, intense and/or strategic. I feel like a child playing this game because its just simple fast pace fun. I dunno if its nostalgia but playing this game recaptures that same feeling I had when playing UT99 for the very first time and I love it.  TL;DR Super fun fast paced Arena FPS Dodgeball game with neon lights and catchy music. Definitely give it a try.     Original Review:  So I just bought the game and holy crap this is one of the most funnest FPS (if you would call it that) that I've ever played. Let me preface this by saying I play tons of shooters, my main one right now is BF4. Even though I love that game to death there are plenty of frustrating moments with it (getting sniped by some dedicated camper across the map, dying for stupid reasons, admins ruining the momentum of the game when they have to balance things out, etc). This game on the other hand no matter how pro the enemy players are I'm always having fun jumping around and trying to get some hits while at the same time avoid getting hit. Only reason I would put this game down its if I get tired after playing it for hours, I haven't rage quit at all and believe me I tend to rage quit often. I'm loving this game so much I bought one for my buddy as a gift so we can play together. Really if you want to have a super fun time try this game out you will love it!",
            "review_score": "1"
        },
        {
            "review_text": "360 Helicopter shots included, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Only game that can help me rid my Dota addiction.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing i found myself playing for hours leveling up my robot and getting many sunglasses and faces. ",
            "review_score": "1"
        },
        {
            "review_text": "You will simply have to purchase and play this to understand how amazingly awesome it is.  Probably the most skill-based shooter I've seen in 5 years.  Beautifully simple arenas ; Player customization ;Too many game modes.   Too much fun .  You will enjoy this game. You have my word.   If you'd like to dig a little deeper, check out the blog I have dedicated to RRdDD:  Robotrollerderby.blogspot.com ",
            "review_score": "1"
        },
        {
            "review_text": "This is by far the best fps I have ever played with STUNNING graphics. Lets give a round of applause to Erik for making this game. Jolly good show.",
            "review_score": "1"
        },
        {
            "review_text": "A hidden Gem!  RRDDD is shortly put: a dodgeball themed arena shooter in a disco-ish environment, that is highly addictive and made by just 1 Person!  The Game has many Modes to choose: from the basic deathmatch and captures, over basketball-ish hoops to racing and teamwork where you can only score by passing to other Teammates and those KOing the Enemy. And the Best? if you get bored by those Modes, you can just create your own match and go completely nuts with around 100 Settings to choose! want a really tough and challenging game? go for it! in for pure Mayhem? just do it!    I made a match with basically every mode put into it with max bots and balls, if that's not chaotic, what is? :P     The Game seams pretty simplistic but is so suprisingly fun, it REALLY deserves more attraction and a higher playerbase (it has a good amount of players, but more never hurts). and the fact the dev is continously supporting this great game and is helping the community wherever possible is something waaaay too rarely seen nowadays.    Quick Pros and Cons:",
            "review_score": "1"
        },
        {
            "review_text": "Good and very fun indie title where the Dev isnt going to take a run for your money  To describe it i would have to say its everyone running around with a nade launcher and your in a flashy club with EDM/House music playin non stop. Interesting mechanics put into the game, but hit reg can be a tad wonky (As of now, when you throw a ball at an opponent it bounces off them, THEN the enemy explodes) I'd definelty recommend it",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Concept  Amazing Fun  Amazing Satisfaction  Amazing Soundtrack  Amazing Levels  Amazing Community  Amazing Developer  Amazing Game  10/10",
            "review_score": "1"
        },
        {
            "review_text": "it's fast, it's shiny, it's a ton of fun if played with other people using teamspeak or skype bought it for me and a friend instantly. AWESOME :D",
            "review_score": "1"
        },
        {
            "review_text": "The only way I could ever be good at dodgeball.  Much better than the real thing. 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "Pros +Easy to learn. Hard to master +Extremely vibrant and colorful +Great soundtrack +Casual when you want it to be, competitive when you want it to be as well +Low system requirements +Dev is still actively supporting the game  Cons -There are no cons.  Buy this game. Friends are not required but are definitely welcomed. GG - my favorite game off the winter 2015 sale.  ",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING! It's got a Quake feeling, pumping beat, fast paced action, lots of game types. It is incredible. Price is more than worth the enjoyment i have already gotten from it.",
            "review_score": "1"
        },
        {
            "review_text": "Lightning fast paced game that is clearly best as a multiplayer arena fest. It's lightweight fare but close to being a must-buy at its tiny price point especially given that it frequently appears in bundles such as the excellent Indie Legends 5 on bundlestars. A pick up and drop game to fill short spaces of time, it has plenty of single player options and you can set up any number of bot matches if you don't have many friends that have it or just aren't that into competitive multiplayer. It can also be greatly improved by several mods on the steam workshop. I'm not a fan of the music but that's just a personal, and minor, downpoint.",
            "review_score": "1"
        },
        {
            "review_text": "Been playing this game since June, and it's definitely one of the best games I've ever played.  Always loved disco parties and dodgeball games. Mixing them together is like the recipe for awesomeness.  Rating: 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Re-writing this review now that it's out of Early Access, and I've had time to come back to it to see what's changed.  What is it? It's a simple arena shooter with one-shot projectile kills.  Pros?  +Great soundtrack +Well designed AI +Simplistic, well implimented art style +Decent level design +Fun, especially with friends +Good visual options +So much potential for satisfying trickshots +Great announcer +Decent single player modes  Neutral?  +Small but dedicated online community +Lan support exists, but is super finicky +Steam inventory support is there, but adds nothing to the experience +Cosmetics exist but add nothing +Custom soundtrack support exists, but is only for .wav and .ogg files (No MP3) +Workshop support exists, adds nothing to the experience  Cons? +Terrible netcode, no west coast servers +Impossible to make competitive worthwhile +Bad visual optimization  Overall still a good time, new updates are still coming out too, so the server problem may be fixed.",
            "review_score": "1"
        },
        {
            "review_text": "Praise lord Gaben as he has let this game on steam. This game is just MMM, its just MMM, MMM I say MMM! Just to give you a taste of this game I'll list some pros. Pros:   Great soundtrack   Great models   Smooth even on old Computers   Very Colorful   Great time waster   Fast paced   TONS of customization   Plenty of modes   Tons of achievements for a simple game!   Multiplayer AND singleplayer (Both have team modes)  of course there are still cons, It's not a game if its perfect. If there was something as a perfect video game I'd probably say it was a dream. Cons:   Hard at first   Not able to stop instantly (Well... You are a robot)   Can be TOO colorful. (Don't play if you have epilepsy)   It's really sensitive and you might say thats good but even at 20 sensitiveity it is STILL senitive.   Some pretty good players and a little hard for starters.   Not big community   Hard to get exactly what you want on multiplayer without making a server  You should definitely get this game! For all the content it has it is an EXTREMELY good deal, and it has both singleplayer and multiplayer capabilities. This game also has a level up system but you can level up in both singleplayer and multiplayer. Beware though if you get too good at this game you will be called a hacker (Like me) Byt I dont beleive anyone has been banned from this game. But I honestly do beleive you should get this game. You will get TONS of time out of it. and I'm STILL gonna play it even after 5.9 hours. Thats just this week! This game is very addicting and I belive you should get this game.",
            "review_score": "1"
        },
        {
            "review_text": "just the name made it an 8/8",
            "review_score": "1"
        },
        {
            "review_text": "This is the beautiful game you dreamed of after watching Tron, except for some reason everyone's got moustaches.",
            "review_score": "1"
        },
        {
            "review_text": "one of the oddiest game i have in my steam libraray that isn't just there for shiggles  but this game is legitness not only is it fun with friends but playing bot matches are almost as good  10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely great and funny game, lot's of fun #maplesuxatit #maplesux I AM BETTER THAN MAPLE AND HE HAS BEATEN MY ONCE I AM GOING TO SH*T MY PANTS",
            "review_score": "1"
        },
        {
            "review_text": "this is a first look review of this game so far it is really good and fun me and my freinds have been having a blast it is definently worhth the amount of money it costed. 9/10  it is fun but has some bugs",
            "review_score": "1"
        },
        {
            "review_text": "It's not like 'Oh, a dodgeball game!'... It's like 'Woah! A dodgeball game with robot jumping here and there at disco music and light rhythm!'  Buy it and play it at any cost.",
            "review_score": "1"
        },
        {
            "review_text": "The music alone is worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love the game. i bought it before it was on steam. sadly ever since they started updating on steam it made it impossible for me to play at all. :/ ",
            "review_score": "1"
        },
        {
            "review_text": "It is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "It is an awesome game all the way around!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game! Me and my coworkers played this on a LAN, after desperately looking for a multiplayergame with room for all of us. I highly recommend playing this with your friends, You won't regret it. Time well spent!",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Throw things Hit things with thrown things loud music flashy lights 10/10, fulfills all requirements for awesome  Cons: Favor The Shooter sometimes means dodging doesn't work, or catches are too easy. No issue in solo play. Limited number of maps and powerups. Number of flashy lights has gone down (or something's wrong with my copy.) You don't currently own this. SOLVE THIS PROBLEM!  update: i nominated this",
            "review_score": "1"
        },
        {
            "review_text": "  much lighting many color  wow",
            "review_score": "1"
        },
        {
            "review_text": "Fire multiplayer ♥♥♥♥ show, and the single player arcade mode is great for when you realize how ♥♥♥♥♥♥ you are online.",
            "review_score": "1"
        },
        {
            "review_text": "This ♥♥♥♥ fun as ♥♥♥♥ with 10 friends playing ",
            "review_score": "1"
        },
        {
            "review_text": "absolutely ridiculous, but in a good way.",
            "review_score": "1"
        },
        {
            "review_text": "This game is addictive. Like, really really addictive. Gameplay consists of controlling a robot that you can customize and going into a disco skate park and throwing dodgeballs at other robots or completing the objectives of the other game modes. The basic mechanics are just like dodgeball itself.  -Go find a ball.  -Catch one thrown at you.  -Dude who throws it is out and/or(I dont play the team modes alot) a teammate comes back in.  -Another ball thrown at you.  -Block it.  -Throw it at dude.  -Miss because you keep thinking you have a gun instead.  -Realize you play too much Doom.  -Rinse, repeat.   Normally when it comes to multiplayer only games like this I get bored very quickly. But a few things keep me coming back. Some of the levels have a great design with multiple levels allowing attacks from above or a well place shot from below. And with physics coming into play you can find yourself easily flying in the air and throwing a ball at a faraway target and scoring an awesome kill prompting the announcer to yell 'mid-air' or 'top-gun'. Everytime you get a kill through a trick-shot, the announcer says the name and not gonna lie, picking up a ball then immediately throwing it at a guy with 'quick-draw' popping up feels pretty badass. And to top it all off the music is just plain awesome, getting your adrenaline pumping for some awesome dodgeball action. However their are only around 10 tracks in the game so I recommend getting a few more from the workshop.  Their are about 10 multiplayer modes with most being able to switch from free for all to teams. There is also an arcade mode for singleplayer where you play increasingly difficult levels, buying upgrades and fighting bosses until you become president of the galaxy. If you lose all your lives however, you start all over. Along with that, their are 4 challenge modes that have tasks such as a basic survival mode and a mode where you are invincible and need to rack up as many points as possible. There are also offline bot matches to play which is where I've racked up a majority of my 10 hours playtime. Online is also pretty good. Even with my ♥♥♥♥ internet surprisingly. The netcode I had read about before must have been patched or something because I was able to pull off trick shots online just as well.  Pros -Fun Skill-based gameplay -Multi-leveled arenas are awesome -Awesome Quake inspired announcer -Trickshots feel awesome to do -Music -Music...again -Not a grey and brown shooter...or loadouts(sorry I had to rip on modern shooters) -Moustaches  Cons -I sometimes get caught for a second on walls or rails -A kill cam might be good to see some pro-strat kills -The flatter maps are a little meh. Their great at first but levels like Temple are awesome -The hats area of customization is empty at first...I really want a top hat and monacle  Misc -There are modifiers. But I only use the big head mode. The rest I feel would just kinda ruin it. Like low grav. Don't do it. But meh they don't detract from the overall product  Conclusion: Buy it. Lose your life. Worried about purchasing without liking it? Get the demo. Review not funny enough? Well fuddle duddle look at my icon. Smile.   Moustaches",
            "review_score": "1"
        },
        {
            "review_text": "This game is like crack but for children. If you are a adult do not buy this game. Peace to the middle east.",
            "review_score": "1"
        },
        {
            "review_text": "really stupid game to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good, I hated it at first because it kept crashing, but then I figured it out. I like it",
            "review_score": "1"
        },
        {
            "review_text": "This skill based arena shooter is ludicrous fun! I'd recommend you play this with your friends for an absolute blast!",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely amazing game, with sweet music fitting.  The only downside is that NOBODY is playing, it's only against bots which is annoying  I 99% recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "You want a detailed review?  Look elsewhere. I'm just here to give a thumbs up. And that's all you need to know.",
            "review_score": "1"
        },
        {
            "review_text": "My life came to a screeching hault. Me team was down 0 to 4 out of 5 matches. This loss out of many others could have destroyed the inside of me which carries my very soule. After many years of playing dogball since my elementary school age, I told myself, 'No, my team and I will not lose another round of dodgeball.'  The game started. Quickly, my team and I reached for the closest balls and charged toward the enemy team. I, using my next level strats, decided that I shall not charge with the others; I decided the best strategy would be to wait and try to catch a ball coming towards me. As this strategy came into play, I saw my team fall before my very eyes. First George, the friend who carried me through thick and thin through my depressing childhood, blew up into a million pieces and his remaines were too small to recognize. Next Jeremy, The man who I never knew well enough. It was just me left. As the enemy team came rolling towards me, I almost felt my last defeat that would cost me my life. but than, something happened. As the enemy threw a ball at me, I was able to do the semingly impossible. I left clicked. The enemy exploded into incomprehensable pieces at my feat. However, this would not spell victory for my team and me as there were still to enemy teammates charging for me. but than, As the ball was about to be thrown at me, George, who I presumed to be dead beond comprehension hit the foe with the ball. The second enemy imploded. Through my amazment, I didn't see the ball coming from the last enemy. i was hit by the ball, Soon following was George. Our team has lost another misserable game.  dis game gud. would left click again. why cant we explode in real life when we get hit with a ball or left click? that would make life more interesting. ",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Fast-paced FPS fun. It's dodgeball in a disco, with robots. I mean... I don't really know what else to say.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ING YES! YESSSSSS. If you like raging about ♥♥♥♥♥♥♥t shots and ♥♥♥♥♥♥♥ robots then this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this title on and off ever since it first appeared on Steam, the simplistic controls and movement shouldn't be mistaken as this game can get very rage inducing, in a good way. The Arcade mode is something you can play for hours on end without even thinking about going to play multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Plays and feels exactly like the trailer looks. More fun than it has any right to be.",
            "review_score": "1"
        },
        {
            "review_text": "This Quake-esque shooter is just concentrated fun. Tight controls, fun gamemodes, lots of customization, AMAZING soundtrack, and lot's of replay value. What more can I say? Grab a couple of friends, and dunk the ♥♥♥♥♥ out of them.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;sees the intresting game name &gt;watches trailer and nothing else &gt;is sold",
            "review_score": "1"
        },
        {
            "review_text": "i have wasted so much money",
            "review_score": "1"
        },
        {
            "review_text": "I've played RRDDD for a little over 100 hours. I got it the week it came out. No matter what you say about it, you can't deny that it has improved a lot.  Graphics: There exactly the right amount of detail on each map. Most of the graphics are on the walls, which is good. There's lights that flash to the music and every surface is textured. There are nice-looking particle effects and the graphics are all-round polished. There isn't an extraordinary amount of detail but I feel anything more wouldn't help the game at all and would end up being distracting.  Audio: The music is great. Its techno tunes from a bunch of different artists. You can even add your own songs to the playlist and listen to those, or grab some from the workshop. The sound effects are great too. They’re all present and sound right.  Gameplay: There are probably people better suited to review this. In my personal opinion, it’s really fun and engaging. There are a bunch of maps with a bunch of gamemodes. Gameplay is mostly skill based and competitive. I did of course find myself getting a bit frustrated sometimes, but that’s the case with any game.  Features: -Good singleplayer and bots -Workshop support -Drops and crafting system -Cards and achievements  Negatives: -lag. A lot.",
            "review_score": "1"
        },
        {
            "review_text": "It's what you wish you could do when you play real dodgeball.",
            "review_score": "1"
        },
        {
            "review_text": "Game is very nice but there is a problem with online servers. There is only two servers in 'Search'. And in these two servers, there isn't any person. So, there is no online player. Please do something for it. No one playing online, and I have bought this game for sometimes play Singleplayer, sometime play Online. I will say 'No' for it. Because of the online.",
            "review_score": "-1"
        },
        {
            "review_text": "i spend most of my time whilst playing this game digging my eyes out with a rusty spoon coevred in liquid meth it hurts to play but its addicting",
            "review_score": "1"
        },
        {
            "review_text": "If the title sounds awesome to you, get it. It's a great little arena shooter that at it's heart feels like Quake Live on LSD.",
            "review_score": "1"
        },
        {
            "review_text": "The first Helicopter shot you get will always be fun. 10/10 would ♥♥♥♥ up someones day with a 360 no-scope again.",
            "review_score": "1"
        },
        {
            "review_text": "Fun as hell.",
            "review_score": "1"
        },
        {
            "review_text": "I had an epileptic seizure and got cancer in under 5min. The jumping made me want to kill myself and the music made me wish I had been born deaf.   11/10  Note: playing while high doesn't make it better.",
            "review_score": "1"
        },
        {
            "review_text": "This game might look crazy AND IT IS!  This is an FPS shooter on speed! Get together with your friends and wreck their faces with a massive rubber ball.",
            "review_score": "1"
        },
        {
            "review_text": "This is damn fun. I've only played a little, but I laughed and it was great.",
            "review_score": "1"
        },
        {
            "review_text": "pure fun and better than you might expect.",
            "review_score": "1"
        },
        {
            "review_text": "A fast paced intense game that will test your skills without getting you angry.",
            "review_score": "1"
        },
        {
            "review_text": "Read the title....then do what any reasonable person would do and buy it, you wont regret",
            "review_score": "1"
        },
        {
            "review_text": "This game is great fun, but ONLY with friends. It has a nice atmosphere about it in game. Fast paced, exciting, and fun is what comes to mind. I can see it being worth the $10, but I suggest you wait for it to go on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Unreal Tournament in the guise of something you'd see in a mid-90s sci-fi movie.",
            "review_score": "1"
        },
        {
            "review_text": "Bots destroyed me after 5 levels in arcade. Didn't get a chance to play against anyone because the community is too small. High skill cap game. I suck at jumping. Did I mention the music is frigging amazing?",
            "review_score": "1"
        },
        {
            "review_text": "The only problem i have with it is it is hard to say, and not really much music.... but that's ok kinda",
            "review_score": "1"
        },
        {
            "review_text": "-First time starting it up -Raged at BS AI and Wonky controller support -Banged knee with controller...  10/10 would bang knee with controller again! ",
            "review_score": "1"
        },
        {
            "review_text": "this ♥♥♥♥ is so freaking fun i cant put it in words xD",
            "review_score": "1"
        },
        {
            "review_text": "Weeee ma ma look at me Im flying. ma ma look a ball is coming straight at me :).",
            "review_score": "1"
        },
        {
            "review_text": "Very fun with playing with a group of funs.. The online settings need some work but enjoyment out of the game makes it worth it!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite a fun title to pick up, highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "So many colors and lasers to give a blind kid epilepsy Would spaz out again  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Pick it up in sale or not, its gonna be worth your money!",
            "review_score": "1"
        },
        {
            "review_text": "Saw this game on sale for a cheap two bucks and thought to myself 'what's the worst that could happen?'. Apparently not very much because this game is simply amazing. Robot Roller-Derby Disco Dodgeball is a crazy name for a crazy game that's crazy fun!   Pros:",
            "review_score": "1"
        },
        {
            "review_text": "Robot Roller-Derby Disco Dodgeball Review  PROS +Graphics +Good SinglePlayer Modes +Amazing Concept +Excecuted Well +FLYING SQUIRREL!!  CONS -Multiplayer -Multiplayer -Multiplayer -Multiplayer  9/10 - Fix Multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "So funny, addictive, and competitive game. I am enjoying it a lot. Totally recommended, play Dodgeball!",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the best 'I half 20 minutes to kill, what am I gonna do?' game that I have in my library.  You're a robot. that rolls. in a (derby)disco. with a dodgeball.   WHAT MORE DO YOU WANT",
            "review_score": "1"
        },
        {
            "review_text": "I love this Game!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Don't believe me? PLAY THE DEMO.  Dodgeball shouldn't be this much fun! Oh but it is. The game mechanics are a lot of fun, the gazillion game modes and maps are very nice, the trick shots are a joy to pull off, the announcer is a joy to listen to, the electronic soundtrack sounds great, the visuals are futuristic and colorful, and.... it's just damn FUN.  I've been playing since early access and it's great that it's finally officially out so there'll be lots of people to play it with. WOOOOO",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Boring after a few rounds even with friends.",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game because it was out on my birthday.",
            "review_score": "1"
        },
        {
            "review_text": "Dodgeball version of Ricochet",
            "review_score": "1"
        },
        {
            "review_text": "As with Super Acrobatic Rocket Powered Battle Cars, the game had a lot of potential but was poorly executed, only difference is that Psyonix picked up their ♥♥♥♥ and made Rocket League.   What I am saying is that the games idea is a orginal and could captivate a lot of people but a few things need to be added:  -Shorter name  For the same reason I didn't get SARPBC the name is annoyingly long which turned a lot of people away from the game  - Better UI and HUD  The UI and HUD (are they the same thing) give off a bad feel, making it more silky and fancy would really add to the game  -More music  After a while, It gets repetitive  - Ranked   I know damn well I wouldn't be playing Rocket League or Csgo as much if they didn't have ranked the casual feel doesn't sell very well for me  Add that to a new game and you got yourself a seller like Rocket League (I use Rocket League commonley as an example because it also had a game before it that's name was super long so no one bought it but it had potential)    Bonus potential names for the game:  Disco Dodgeball (I am not as creative as i thought) ",
            "review_score": "-1"
        },
        {
            "review_text": "So here's the deal, I sold a couple CS:GO skins cause this game was in the featured list on Steam's main page. Bought this game after reading a TON of great reviews and watching a few notable Youtubers review this game positively as well.  Let me tell you, this game is VERY FUN, and I can see myself dumping quite a bit of time into it. However, NOBODY PLAYS IT. Across the entire planet, there were only 2 servers online at all. Each server had about 3 players in it total including myself.   Yes throwing and catching the dodgeballs in this game is quite a lot of fun, and mechanically sound. It's just a ghost town of a game, and who wants to play an arena shooter game like this with NOBODY.... Well, the answer is nobody.  If this was a free game I would say Download it for sure, but honestly there is not a single reason for dropping $15 + Tax on this, even if the game could be a gem.  Honestly I wish I could get a refund, it's too bad.  +1 for a great soundtrack +1 for fun gameplay +1 for relatively well programmed BOTS  -15 for being wayyy overpriced for what it offers -1,000,000 for having no players",
            "review_score": "-1"
        },
        {
            "review_text": "When i got this game i didn't know anything about it and when i play it felt like the person got it for me was insulting me with this horrible game. would play again percent-0%. Would never go back to it percent-100%.",
            "review_score": "-1"
        },
        {
            "review_text": "Game needs more polish. I could see this being fun, even in its current form... but the controls are a little off, the graphics are a little poor, the movement isn't really polished, the lobby is a bit antiquated feeling, etc. Everything just feels like you'd expect from a small indie team trying to do a first person shooter arena game.",
            "review_score": "-1"
        },
        {
            "review_text": "high spec gaming laptop and this game runs terrible on it.",
            "review_score": "-1"
        },
        {
            "review_text": "It's just one of those games where you say 'Meh'",
            "review_score": "-1"
        },
        {
            "review_text": "Worth more like 99 cents. This game is not very good and not worth your money.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the biggest piece of garbage game that ever was and will be.",
            "review_score": "-1"
        },
        {
            "review_text": "don get this game it is so laggy ",
            "review_score": "-1"
        },
        {
            "review_text": "The game is almost as good as the title.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, great music, great style, create gamemodes, great maps...I think you can see where this is going. This game is AMAZING!",
            "review_score": "1"
        },
        {
            "review_text": "The only thing wrong with this game is that it's not popular enough.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun. An excellent purchase for its price bracket.",
            "review_score": "1"
        },
        {
            "review_text": "Everything about this game is amazing!!",
            "review_score": "1"
        },
        {
            "review_text": "Its real good. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "the game is fun but gets boring at few hours.its cool game and i like it but didnt get what i expected.",
            "review_score": "1"
        },
        {
            "review_text": "What is there not to love? Fun multiplayer gameplay, great music, and the robots have moustaches! I instantly loved this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely amazing. It's simple, super fun, and the music is really catchy.  Randomizing which team you're on is great. One game you'll be trash-talking your friend and next game you'll be paired with them going 'Yeah! We got this!'  Highly recommend, especially with a group of people as opposed to just against the computer.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, fast paced, mupltiplayer action",
            "review_score": "1"
        },
        {
            "review_text": "I started playing this game today, and it is very fun but it is also very laggy at the same time.",
            "review_score": "1"
        },
        {
            "review_text": "Robot Roller-Derby Disco Dodgeball is a beautiful game in which one must hit other robots, whether NPC or real players, with dodgeballs, while trying to get skillshots such as ricochet or 'top gun.' The disco part of the title is reflected by the colors, shapes, and music for the levels, and brings the whole game together along with the fast-paced, yet fun, gameplay. It is a very satisfying game and I would reccoment this game to everyone.",
            "review_score": "1"
        },
        {
            "review_text": "While this game's name might be overly long and a bit of a tounge twister, I have really enjoyed it so far. Sure, it takes some of my favorite things linke robots, electronic music and flashy lights and combines them into a fun fast pace sports game, but I don't think I am being too biased when I say it's lots of fun. There are various game modes to play, weather it be as multiplayer, or single player with bots, it can be lots of fun too. Can choose if you want to 1v1 someone, or go full chaos and have 6v6 matches.  11/10 wonderfull, would definatly disco derby again anytime.",
            "review_score": "1"
        },
        {
            "review_text": "Just fantastic",
            "review_score": "1"
        },
        {
            "review_text": "This game... is everything the title says it is. Glorious arena FPS-style gameplay with cool techno music and colorful one-wheeled robots. Great by yourself, but awesome with friends.",
            "review_score": "1"
        },
        {
            "review_text": "If Unreal and 5th Grade and SWEET RAVE PARTY had a child, I would very much like to see that. Oh....the game, yeah tha.....that's good too.",
            "review_score": "1"
        },
        {
            "review_text": "Omg This Game Is Amazing Its A Shame Hardly Anyone Plays Such An Awesome Game!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is the perfect party game for a LAN. It's so much fun.",
            "review_score": "1"
        },
        {
            "review_text": "Needs more peeps playing this game! It's freakin fun! Simply better than instagib!",
            "review_score": "1"
        },
        {
            "review_text": "Disco Dodgeball takes dodgeball to whole new level with amazingly catchy music and really easy to pick up play! The game is a arena based FPS where the dodgeball are your weapons with all hits being one-hit-kills. Kills can be either achieved by hitting an enemy or catching an enemy's ball.  Pros -Simple concept, but very addictive -Various gamemodes, to keep it fresh -Great Singleplayer modes (Arcade, Challenge, Bot Match etc) -Amazing music -Customisation of your bot -Easy to pick and play -Fast-paced -Not graphic intensitive  Cons -None, expect it being very addictive!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game if you want to seize over and get hit in the robo face with a ball.",
            "review_score": "1"
        },
        {
            "review_text": "The title says it all.",
            "review_score": "1"
        },
        {
            "review_text": "It's a game about hitting robots in the face with dodgeballs in an arena shooter style. Is rly gd. Really, you should play it, there's a whole bunch of gameplay and modes and stuff so it's totally worth the money.  8/10: Like skyrim, but with dodging, dipping, ducking, diving, and dodging.",
            "review_score": "1"
        },
        {
            "review_text": "my mother refunded this game 10/10 would tell my mom dont do that ♥♥♥♥ again",
            "review_score": "1"
        },
        {
            "review_text": "I bought it on a sale and my computer sucks 3 fps, so I can't play it. I've seen gameplay and it looks good so buy it if you want :/",
            "review_score": "1"
        },
        {
            "review_text": "Pick this game up and play with friends, It's loads of fun. The soundtrack is amazing. Getting killed by Scott bot has never been funner.  Arcade mode makes single player worth playing IMO. You go through levels, beating waves of increasingly difficult bots. You get money for scoring KO's (more money for doing getting special kills like bouncing the ball off a wall onto them) and spend the money on upgrades. Some bots have special upgrades themselves, and bosses can even come out.",
            "review_score": "1"
        },
        {
            "review_text": "My PC turns colors n' shiz. (AlienFX compatible with in game lights)  11/9 -IGN",
            "review_score": "1"
        },
        {
            "review_text": "A fun game if it crashes on the start then go check out the fourm because they have a way to fix that and if you dont ahve a fast computer then go and bring the settings down some to play",
            "review_score": "1"
        },
        {
            "review_text": "Friends got me to buy this game last night. After 45 minutes of playing it with them, I can say this...  It's pretty good 10/10 would miss 90% of all throws again.",
            "review_score": "1"
        },
        {
            "review_text": "`",
            "review_score": "1"
        },
        {
            "review_text": "Wow, this game is amazing. Not only do I look shnazzy in my robotic moustache, the music overrides my body and I explode. 11/10 would blast soundtrack again. :)",
            "review_score": "1"
        },
        {
            "review_text": "Electronica, robutts and a solid control scheme. Does more need to be said?",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, one of the best games to play with a group of friends and just go nuts!",
            "review_score": "1"
        },
        {
            "review_text": "This game is truly a hidden gem on Steam. It's hilarious fun, has an amazing soundtrack that doesn't ever really get old, looks great, and caters to nearly all skill levels. I am so incredibly bad at this game it's actually pitiful, but even playing against bots on easy is good fun. If you ever get bored with normal gameplay, there are many different gamemodes you can try, as well as powerups that increase the stupid fun with jetpacks and other OP powerups.   Pros: Great game overall Looks great Fast-paced Stupid fun You can look badass to your friends by hiding the fact that you have homing dodgeballs Awesome soundtrack  Cons: Movement system is kinda weird and takes a while to get used to Catching is somewhat difficult (maybe just because i suck) I can't get my friends to buy it The price is a little high, so probably wait for a sale Intense flashing lights can cause minor headaches after awhile FRIGGIN LUKE BOT ALWAYS CAMPS  Rating: 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun Fast Paced And Simple",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun to play with friends and to just screw around with. Nominated!",
            "review_score": "1"
        },
        {
            "review_text": "  Really fun dodgeball game. Arcade mode is great and there's online multiplayer, so you can play with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly fun, and harder than expected.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely stunning game, I cannot recommend this enough. I got it as part of a Humble Bundle a while back and for some reason stunning robots with balls is a great way for me to relieve stress!  A few notable things I want to add:    The continuing free updates to the game really do help and expand the game. Not just new maps, but workshop support, local multiplayer etc. really are good.    The soundtrack is great and really helps the mood. And if it's not your thing you can load up your own music into the game!    Extra props for including a 'Photosensitive' options preset, so if you are prone to seizures this is a great option that more games should have. I dealt with epilepsy when I was younger and it was an absolute pain (luckily for me, it wasn't photosensitive but sleep-related).    The bots are pretty capable which is good, as unfortunately the player base is pretty small, and lag really messes with the fast pace of the game so using a different continent's server may not work out for you. You do get to see a few familiar faces every now and then however which is great.   Get a few friends to join you for a few matches and you'll be set for hours (or until your eyes hurt).",
            "review_score": "1"
        },
        {
            "review_text": "Totally the best sports game i've ever played!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "When I just want to have pure fun there are two games I now turn to, this game and Rocket League. I would say they are both equally as fun. I will say that Rocket League has more of an online community now, but damnit man..... If you get into this game it is so much fun. I just play it every now and then because I picked it up somewhat late in its life cycle, but everytime this game goes on sale you will see me on here as new people come onto this game. Please buy this game everyone!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, just need it to go on sale so i can buy the four pack for friends",
            "review_score": "1"
        },
        {
            "review_text": "This game awakens a lust, a fury, a longing for battle that I have not experienced before or since. Also Hoops is ♥♥♥♥ing awesome.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me feel so mlg. Like, I wanna go buy doritos and montain dew right now. That's how mlg this game makes you feel.",
            "review_score": "1"
        },
        {
            "review_text": "Despite my very low play time, I've already fallen in love with this game. It's surprisingly great, despite how it looks before you buy it. I'm generally not a fan of most FPS games, but this one is something special. Can't reccomend enough.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Games do not let people fool you this game is def worth every penny who ever says otherwise is stupid. ",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me a lot of Quake 3. It's enjoyable in short bursts, basically a fast-pased FPS but with a twist due to the physics of rolling and projectile curvature. Super fun though the physics are a bit hard to get the hang of. Also the music kicks ♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "This game is exactly what it sets out to be. Robots rolling around in a disco arena playing dodgeball. At first the controls may feel a little 'weird' if you're used to other FPS games, but after just a minute or two you should be able to sink straight into them. While this game does support a controller, you definitely want to play it with a keyboard and mouse for that added twitch factor. It's fast paced, fun that's quick and easy to get into. Highly recommend this game for both single and multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. It has great music, gameplay, and graphics. It is like the games of old where you queue up and just play some PVP... but has many ties to new age style and graphics. This is a great game to have on your HD. It will either fill in the gaps when you need breaks from other games or very well can hold its own as a main game. Check it out you will not be let down. The only downside is that Controller funtionality is a little blah. Sometimes when i open the game on my PC it does not recognize that I have an xbox 360 controller connected. It takes multiple restarts to get the game to recognize the controller. The though is an often experienced occurence from many games that say they have controller functionality... So I do not feel it is grounds to not recommend the game and for sure is a fixable issue. So please to check out the game I really enjoyed every second of played game time and think you will too! Happy Gaming!",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game. Being able to use your own music really makes the game that much more enjoyable. There are plenty of gametypes if by chance you get bored of one... And there are different things satisfying the type of intensity you want. For me, playing the Challenge Horde mode is actually at least as gripping if not more intense and panic-trash-talk-inducing than DEPTH, a game where you fight SHARKS, or playing as sharks, hunt the humans. Ok? This game is wonderful, I am so glad I bought this game. If you like dodgeball, and music, get this game.",
            "review_score": "1"
        },
        {
            "review_text": "A really silly FPS(?) game. You can play with bots or online (although there aren't many people online) and there are several different game modes, all of which are fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "i bought the game and it doesnt work. it keeps on stop working and i cant play the full version but i would recommend this game since i played the demo and it was really fun and the best dodgeball game i seen so far!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most satisfying 'shooters' i have played. Unfortunately the community is pretty much dead, with usually no more than 10 people online at a time.   If you like the idea of the game it's still worth picking up at around £3 as the Bots are decent and the arcade mode is solid, with plenty of interesting upgrades.",
            "review_score": "1"
        },
        {
            "review_text": "Step one - buy this game.  Step two - add me.  Step three - profit.  But seriously it is a good game done well. The sale price is reasonable and I'd recommend getting it while it's cheap.  The gameplay is amazing. It looks basic but trust me, every throw feels important, the arc the ball takes and the need to charge for a harder throw is satisfying and tricky enough to be interesting, as well as power ups and many different wel made game modes.  In the trailer I wansn't sure about the lights and music, but it only adds to the pace of play and helps with the immersion.  There are a few players online at any time but occasionally it can be quiet. I have three friends who play too so if you do want to add me feel free, we can get a game or two on the go.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine fun and loud dubstep like music and that is this game",
            "review_score": "1"
        },
        {
            "review_text": "dont play this when you're high",
            "review_score": "1"
        },
        {
            "review_text": "Laggy, unpolished, horrific UI and glitchy hit detection. Just avoid it!",
            "review_score": "-1"
        },
        {
            "review_text": "I got this for $4. And it was the most fun ive had in a long time.",
            "review_score": "1"
        },
        {
            "review_text": "looks fun, will try out",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly good",
            "review_score": "1"
        },
        {
            "review_text": "it is a good game for me only a time passer i would recomend for some but for most i reccomend a different fps",
            "review_score": "1"
        },
        {
            "review_text": "'Robot Roller-Derby Disco Dodgeball' is incredibly fun. Controlling and throwing feel tight and satisfying, but not as satisfying as juking your opponent only to dunk on him or her from behind seconds later. RDD instantly puts you into a flow state, where you don't have time to think or you'll be hit. As, if not more, exciting and fast-paced than 'Rocket League', the community is friendly and teaching, and proud to share the game they play.  RDD truly is a gem, and I plan to play much more of it soon. It has taken the FPS and distilled down into a highly rewarding and addicting experience. I fully recommend you pick up and PLAY this title.",
            "review_score": "1"
        },
        {
            "review_text": "Pros +Fun +Good Multiplayer +Good Customization +Community is Nice +AI/Bots +Solo +Gamemodes +Music +Making a Room/Server is Easy +Controls +Updates  Cons -Gets Repetitive  -Small Amount of players -Maps feel the same  7/10  Would give it a 8 instead if it would make me want more. ",
            "review_score": "1"
        },
        {
            "review_text": "It's ♥♥♥♥in sick bro, throw dodge balls at robots, jump around maybe, boost on ramps, listen to those eeee dee ehm music so the youngsters all like, look at colors. Now that I think about it, i think this is what gamers in the 90s have wanted for years. Welp, here it is.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game! Deffinetly worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Only downside is the community is kind of inactive.",
            "review_score": "1"
        },
        {
            "review_text": "RRDDD is a really fun game that is awesome when you're playing against other people. The bot matches are a little rough at times, and arcade can be frustrating, but it's the kind of frustrating that makes you want to get better at the game. Only real complaint that I have is that I hate the amount of paid DLC that the game has. While it isn't a major gripe, I just wish that some of the customization options that the game offers came throughout progression in levels rather than paying for that shiny bumper sticker. Regardless, if you have a few friends online that you want to bash their heads in grade-school style, then get this game and have a blast!",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing this game non-stop since I've got the game. (VERY ADDICTING) I would recommend this game! 10/10 DEFINETELY!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! The music is enticing! Simple fun = Best fun!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, barely played it for 10 minutes and it's already great. Soundtrack is fun to listen to, and if you don't like any open servers you can create your own with your friend and wait for people to join in a 2v2 type of thing.   Would recommend buying.",
            "review_score": "1"
        },
        {
            "review_text": "It's an awesome game, very fun, but if you are here for multiplayer I would not reccommend it even though singleplayer is very good.",
            "review_score": "1"
        },
        {
            "review_text": "This is everything a 3$ game should be and more. It is fun. It is a time-killer. The matchmaking is fast. The mechanics are easy, but also leave room to perfect. ",
            "review_score": "1"
        },
        {
            "review_text": "fast paced discotec techo dodgeball for something i thought wasn't probably even worth installing when i got it in humble bundle, it's a 9.8/10 only downside to the game is latency issues and bots having a hitbox for you the size of a small country.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game..  Although I cannot really play it since it do not live in europe or US i still find it fun to play.  If you like some competition try this game out..",
            "review_score": "1"
        },
        {
            "review_text": "joined a quick match immediatly was kicked 'banned from room' Then tried to join another only to find out i'm banned from quickmatch for the next 24 hours.  developer has since corrected the votekick. now big thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "A great game to play with friends but don't expect to find many online players. Going solo against bots is pretty fun too but even the hardest difficulty becomes pretty easy after a few hours.  Basically, this is a perfect game for late-night gaming with the crew but not so much for solo play. Overall 8/10 game",
            "review_score": "1"
        },
        {
            "review_text": "Title is a tounge twister",
            "review_score": "1"
        },
        {
            "review_text": "  All gamemodes are allot of fun and you have several, just shooting each other, capture objectives, shooting hoops...  Very competitive and everytime you go pick up a ball, you hope that noone shoots you from behind. Very stressy :D  Timing and aim are crucial.   I got this game for free at a lan party, but you rzeally should buy, it's awesome!  Last but not least,  THE MUSIC IS SO GREAT!!! Like for real, I would listen it all day!!",
            "review_score": "1"
        },
        {
            "review_text": "I love robots, roller-derbies, disco and dodgeball makes me feel young. i approve this",
            "review_score": "1"
        },
        {
            "review_text": "great game for multiplayer so fun but if you want to get this game to play singleplayer its still fun but not as fun as multiplayer i would give this game 95/100",
            "review_score": "1"
        },
        {
            "review_text": "Want to stare at some paint drying? Or would you rather murder robots with your balls in a disco LSD infested murder death-rave?",
            "review_score": "1"
        },
        {
            "review_text": "Great game, fun and fast-paced with cool music",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, totally worth the 2 euro`s on sale ;)",
            "review_score": "1"
        },
        {
            "review_text": "You can't play this game without jumping along to the music",
            "review_score": "1"
        },
        {
            "review_text": "Idea is unique (in my opinion). It's fun and it works. Definitely to be played with a buddy, makes double the laughs. 5/5 would play again. + Great music and I like how the maps go with the beats!",
            "review_score": "1"
        },
        {
            "review_text": "great game, with only 0.5 hours i can say the hit detection is rubbish &amp; if your buying from australia, just know that the AU servers are pretty lonesome.. ",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended! Great for casual play or competitive play. The game runs smoothly and the mechanics work well. Even playing against the computer in single player, the bots have rather impressive AIs, and the multiplayer feature is great as well. The ability to creat your own games is genius! Buy this game! I can't imagine someone not getting enjoyment out of at least some part of it!",
            "review_score": "1"
        },
        {
            "review_text": "as a music producer this is a pretty fun way to listen to my stuff first hand while playing a game. Nice, love it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so funky!!! If only the lag compensation worked better, and the soundtrack wasn't so terrible. Thankfully I have a bunch of sweet disco tunes to jam out to. Super funky.",
            "review_score": "1"
        }
    ]
}