{
    "app_id": 27050,
    "name": "Fatale",
    "release_date": "2009-11-04",
    "developer": [
        "Tale of Tales"
    ],
    "publisher": [
        "Tale of Tales"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 53,
    "negative_ratings": 44,
    "price": 4.99,
    "description": "&quot;Salomé, Salomé, dance for me. I pray thee dance for me. I am sad to-night. Yes, I am passing sad to-night. When I came hither I slipped in blood, which is an evil omen; and I heard, I am sure I heard in the air a beating of wings, a beating of giant wings. I cannot tell what they mean .... I am sad to-night. Therefore dance for me.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/27050/header.jpg?t=1447352658",
    "minimum_requirements": "OS: Windows XP/Vista/7                     Graphics: Recent Radeon or GeForce card                     DirectX®: DirectX 9.0c                     Hard Drive: 225MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Another interesting explorable art piece from Tale of Tales.  Worth spending time with as something different, but unfortunately not justifiable as a recommendation based on the current price ($7 USD).  Instead I recommend the following, also by Tale of Tales:  The Path .  - Skinny from the Fat B*stard  (curator link) ",
            "review_score": "-1"
        },
        {
            "review_text": "I saw a link that said, 'None of your friends have played this game. Tell them why they should'. My answer to that is they shouldn't. I can think of better wastes of money, and seriously, if you wanna see the boobs in this game that badly, you can look at them for free on the FATALE Steam forum homepage because, ironically enough, every person who has played this game and claims it's 'SOOO DEEP OMG YOU C4n'T UNDERsTAnD' have considerately taken it upon themselves to post pictures of said deep boobs from every single angle imaginable within the game.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what I played. If you like lighting candles and looking at boobs, then you're in luck because this game totally has both boobs AND candles!",
            "review_score": "-1"
        },
        {
            "review_text": "Oh man. After checking out The Graveyard, I expected another fail program. And it delivered! I'm not sure what message I'm supposed to take from this. The message I got was 'Women are evil, kill them all.' I nominate Tale of Tales for worst developer...EVER.",
            "review_score": "-1"
        },
        {
            "review_text": "10 minutes of stuck in a room with poor controls, 20 minutes floating around clicking on lights while listening to whispering before the screen goes white, giving you only one option: quit. Start the game again, watch a dance for 5 minutes, then the options present themselves to restart or quit.  Do I recommend it? The visuals are odd, very much an 'art project' in an artsy-fartsy kind of way. In that sense, I give it a 'sure, why not.'",
            "review_score": "1"
        },
        {
            "review_text": "This was a very weird experience despite it being short. It's an interactive exploratory hub if I would describe it accurately. I can't call it a game since it is like a piece of art to be examined from different angles and you'd see something that would mean something to you... Or doesn't mean anything at all. I'm glad I got it on sale though. I would not recommend it on full price.",
            "review_score": "1"
        },
        {
            "review_text": "If you love RPGs with deep and complex stories, with many heavy and thoughtful moral choices, then Fatale by the masters from Tale of Tales is the game for you. With hours of engrossing combat and dialogue, as well as numerous sidequests that feel just as weighty and important as the main quest itself.  My only complaint is that the companions you pick up during your travels can feel lifeless and forgotten; I would suggest perhaps adding the companion wheel from Fallout: New Vegas, as well as more dialogue options once you've recruited them. But that's just a minor complaint that in no way detracts from the main game itself. You will find yourself losing hours and hours to this game.",
            "review_score": "1"
        }
    ]
}