{
    "app_id": 270590,
    "name": "Long Night",
    "release_date": "2014-07-07",
    "developer": [
        "Trickster Face"
    ],
    "publisher": [
        "Trickster Face"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Horror",
        "Indie",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 39,
    "negative_ratings": 38,
    "price": 3.99,
    "description": "In this third person survival horror, play as David, a teenage boy during a summer night, who will have to escape his unconscious fears, taking many forms. In the same time, he will have to save his friends from their own scary projections.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/270590/header.jpg?t=1447359799",
    "minimum_requirements": "OS: Windows XP 32 Bit Processor: 2 GHz Dual Core Memory: 2 GB RAM Graphics: nVidia GeForce 8600 GT, ATI Radeon HD 2600 XT DirectX: Version 9.0c Storage: 1 GB available space Sound Card: DirectX 9.0c Compatible Sound Card with Latest Drivers",
    "recommended_requirements": "OS: Windows Vista SP2, Windows 7 SP1, Windows 8 (32/64 bits versions) Processor: 2.4 GHz Quad Core CPU Memory: 2 GB RAM Graphics: NVIDIA GeForce GTX 275, ATI Radeon 4770 Series or higher DirectX: Version 9.0c Storage: 1 GB available space Sound Card: DirectX 9.0c Compatible Sound Card with Latest Drivers",
    "reviews": [
        {
            "review_text": "Hm, this is hard to rate ... but all at all I simply cannot recommend the game with everything that was going on behind locked doors.  First of all - Long Night was a (with about 12k $) succesfully fundet Kickstarter Project, which I backed. First of all, im not sure, if either the Developers lied to the backers: they said, that the game would be 50% completed. They never said, that Long Night was going to get an episodic release until the fourth last update and two updates later they already told us, that they went bankruipt. Or perhaps they simply completely miscalculated their situation with the game ? Noone will ever really know, because theyr statement was a bad joke. Just stating, that the sales on Steam went pretty bad and an investor jumped off. So ... the biggest problem with this game is: it will never be finished.   If you don´t have a problem with that - the whole game is somewhat half-baked: the atmosphere is decent and the graphics are okay - but the controls are terrible. It feels somewhat spongy. Im okay with the point, that you can´t fight the banshee chick in the beginning BUT im not okay, that I cant find a way to either avoid the confrontation with her nor survive it, by simply running away because your staminia or whatever it is, is so low that she´ll catch up with you eventually. Storywise this game is a disaster. You´ll get chunks of something that might have become a story in later chapters. But until now ... nothing.   So - as a small resumé: Am I angry with the developers ? Actually - no ! Kickstarter was my risk, and come on - 15$ wont kill me. For me, it was actually wort a shot and giving the developers the chance to try it. BUT would I back another of their projects, or a project of any person involved in this ? Nope ... I fear not. If they were more open from the beginning, telling us 'Okay, with the 10k we want - were going to release a first chapter and look how things are going further on' I´d still had backed it. But things feel somewhat different and give you some sort of bitter taste, when they post an update saying 'Yep, we´ll release the game (that was 50% done btw) now as a series of 3 parts, ain´t that groovy ?' (And no, thats no joke they really tried to sell the chapter form as a good idea to the backers) and two updates later they already tell you 'K folks, thats all - we´re broke'   And can I recommend the game ? Hell no ! Why should I recommend a title that will, most likely never be completed ? Keep your hands away !",
            "review_score": "-1"
        },
        {
            "review_text": "EDIT: Changing this review to negative now that the studio has come out and said they ran out of money and the game will never be completed.   Basically it's an indie Silent Hill meets Obscure without any combat. The graphics look halfway between a PS1 and PS2 game and there's a slight unpolished feel to things. Controls are weird (WASD to move, spacebar to sprint?) and cannot be changed. I would say a gamepad is almost mandatory.  That said I would still recommend it. The atmosphere is creepy. For most of the time there is only one enemy but it's creepy as hell and you never know where it's going to pop up and send you into a panic attack trying to get away. While the graphics are primative and performance unpolished, it has that unique art design most Frech games have and it works. At less than $5 it's worth the price if you're into survival horror games.  One gameplay complaint I have is they never explain to you how health or dying works. You have a 'mental state' that seems like health but I never noticed it do anything when it got low. When the enemy catches you, sometimes it's an instant death, sometimes it's harmless. I played through this episode twice and I still have no clue about either. 'Health' doesn't seem connected to the enemy killing you and your mental state sometimes degrades on its own. The game tells you to use inhalers to restore your mental state but there's a VERY limited amount and you are never given any clue when or why you need to use them because you never notice mental state affecting anything. There's still more episode to go so hopefully they'll fix that.  One STORY complaint I have is you coming across a document related to the central plot that is such a blatant X-Files reference (right down to one of the people having the exact same name!) that it breaks the immersion a bit.",
            "review_score": "-1"
        },
        {
            "review_text": "I am legitimately SHOCKED at the positive reviews this game is receiving. I played 105 minutes or so, mostly because of the infuriating and deliberately clunky 'running puzzles' that compose the last HALF of this title. I sincerely wish I could have my $4.99 back, because I wouldn't spend more than $1 on this game or any subsequent chapters. The only thing I can think of is that people who backed the game feel overly fond of it, or the friends of the developers are being very outspoken here.   To elaborate...  THE PROS: *Great cut-scene graphics, very Gone Home meets Telltale games. A pity they flash so fast that you can't read the text, though.  *Retro-style nostalgia in abundance, even the year it takes place in.  *A fairly interesting storyline.  *A 'creepy, scary' villian type that is pretty unnerving.  *Decent cliffhanger ending. I feel sincerely intrigued by what happens in the rest of the story, but...   THE CONS: *Horrible controls. I understand the Retro static camera, but the poor controls paired with the 'running puzzles' and the fact the main character has asthma simply make the game 100x more frustrating than fun.  *Short -- If the clunky running mechanics hadn't have doubled my time, I'd have finished this in 35-45mins. Tops. Totally not worth $4.99 in my book!  *No audio controls -- not to disable the music, nor slider-bar it down. The music isn't -bad- it's just loud compared to the other sounds, and it somehow makes my head want to explode when getting frustrated with the running puzzles.  *Poor Storytelling 'plot devices.' I'm all for foreshadowing, or having a plot arch that spans the entire series of episodes. However, when you present a LOT of story elements that the player can't unravel and decipher until they purchase the later episodes, it just feels weak.   ...and that's just what I can think of, off the top of my head. If the other episodes were included FREE with this $4.99 purchase, I -might- be able to recommend it. Maybe. But probably not, because this game just left me insanely frustrated and completely confused as to why the reviews are so overwhelmingly positive thus far.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is good, but I dont recommend it since the dev didnt complete it ): 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "Long Night is a wonderful new game that recaptures the style of the Playstation era horror games. Along with that style, it has many of the quirks and gameplay flaws that are expected. Overall it is a very enjoyable experience, it is erie, the story is interesting, and the characters are likeable. There are however some huge flaws in the game, and I hope that the developers listen to the fans before releasing Episode 2. Major Flaw #1: The speed of enemies. I am just fine with having fixed camera angles that sometime interfere with the controls, it's the style of the game, and frankly I enjoy it. The only problem is that enemies move as such a ridiculous speed, that when a camera angle change occurs it can completely screw you up. It no longer becomes a frightening pursuit, and instead becomes a series of trial and error.  Major Flaw #2: Without spoiling too much, there is some bad puzzle design at the end of the game, specifically one that requires no brains, and merely trial and error (it involves a stain glass floor). Really that whole last scene was just trial and error, I hope we don't see more of that in Episode 2.   Final verdict: It's a great retro-style game, and if you enjoyed PS era horror you shouldn't miss Long Night, in spite of its flaws.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game on a whim during the French Indie sale.   From the first minute onwards the game does a great job of giving back the atmosphere of the classic survival horror games from the late 90's, while sporting graphics that don't make the connection seem forced. Just like in Clock Tower combat is not possible, the only option is to run and hide. There are only three hide spots in the entire game though, and I didn't have to visit them very often. The puzzles were fun, but pretty few, which I guess is because of the episode formatting. Also the entire plot becomes known within the first 15 minutes of play time, which could have been a bit more stretched. Maybe there will be some twists left.   All in all the game was extremely fascinating to play, but fell a little short. I'm definitely getting episode 2 on release. ",
            "review_score": "1"
        }
    ]
}