{
    "app_id": 270570,
    "name": "Reversion - The Escape (1st Chapter)",
    "release_date": "2014-06-10",
    "developer": [
        "3f Interactive"
    ],
    "publisher": [
        "3f Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Indie"
    ],
    "achievements": 16,
    "positive_ratings": 1134,
    "negative_ratings": 335,
    "price": 0.79,
    "description": "It’s 2035 in Buenos Aires, or where Buenos Aires used to be. You’ve just woken up in a hospital, and you can’t remember anything. All you know is you have to escape and find out what happened to the city. And how to save it.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/270570/header.jpg?t=1536697677",
    "minimum_requirements": "OS: Windows XP or later Processor: Intel Core™ Duo or better Memory: 2 GB RAM Graphics: DirectX 9 compliant video card Storage: 400 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I played A LOT of point and click adventures back in their glory days and even play some now and then. This game is bad. I know is free, but it is really bad.  I can't stand the voice acting, is so terrible I had to mute to keep playing.  The game is too slow one can get bored after the first couple of minutes, and the gameplay, inventory handling and plot didn't help at all. The game is short, but I'm glad it is, really.  I think the developer should remove the voices, really, just remove it. They should also use a 'run' feature to help speed the gameplay a bit and improve the gameplay mechanics.  I can't recommend this game, but maybe will play episode 2 if they improve it.",
            "review_score": "-1"
        },
        {
            "review_text": "First of all the game is free. It is a point &amp; click game. Relaxing game, no stress (except if you are going for the achievments, some of them can be tricky) Graphics are cool, the game has its own style of characters and art.  The only thing that I would like to say is that when you try to 'use' an item or go to your inventory and then do something with the items can sometimes be a little hard to figure out. Its not a big problem though. You will get easily used to it. There are 16 achievments in total. All of them are relatively easy to obtain. I wouldnt say that its 'too hidden'. Some can ofcourse be tricky, but they are pretty cool and clever as well. Like I said earlier: It is Free to Play, and in my opinion the game is fun just like 77% of the other steam reviews posted. It is definitely one of the better Point &amp; Click games out there. Dont hesitate, go download it, grab a soda or whatever you prefer and play.",
            "review_score": "1"
        },
        {
            "review_text": "Reversion - The Escape isn't a bad little point 'n' click adventure game but it's just as well it's free since you can finish the 'game' below than 1 hours. For a free game, it has decent graphics, decent voice acting, and I can't really complain about its 1-2 hour length since it's just a part of what's supposed to be a larger game. If you really like adventure games then it may be worthwhile for you to check this out, if not the only other people who should even bother are achievement hunters.  Game : 5.5/10 Graphic : 6.5/10   100% Achievement :   Easy  | Medium | Hard | Very Hard  100% Achievement Guide :   Click Here    Missable Achievement Guide :  1. Funny Man - Read all the jokes (3) on the left side of the  Toilet Cabin  2. Lady Killer - Speak to the girl in the  Hospital Room  and choose every option 3. Big Stick - After tie up the guard with the duct tape, take his weapon which is on the floor 4. The Piper - Talk with the rat under the cupboard in the  Locked Room  5. Marathon Runner - Finish the game in less than 4 hours 6. The Riddle - Finish the game without using the hint system 7. The perfect escapist - Finish the game for a second time",
            "review_score": "1"
        },
        {
            "review_text": "Primitive 1 hour quest which has began the trilogy. Just an easy way to unlock 100%. 5/10",
            "review_score": "1"
        },
        {
            "review_text": "eh its a good point and click puzzle sort of game but its really short, cant wait till the next chapter comes out",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the worse point &amp; click games I have ever played it has terrible voice acting, the characters are uninspired, the main character complains too much &amp; overall everything is a bore so if your looking for a good adventure your not going to find it in this game. (I know I only played the game for a few minutes but ♥♥♥♥ the voice actors they suck ♥♥♥)",
            "review_score": "-1"
        },
        {
            "review_text": "It's a good game if you like solving puzzle without time limits.",
            "review_score": "1"
        },
        {
            "review_text": "it was fun trying to figure out were the oil was",
            "review_score": "1"
        },
        {
            "review_text": "i hope reversion chapter 2 - the meeting is free to play on steam,buti enjoy this game ;D",
            "review_score": "1"
        },
        {
            "review_text": "Reversion- The Escape is a rather short but pleasant Point &amp; Click adventure. With some good puzzles and an interesting cliff-hanger story (since it's just the first chapter), it is a game worth playing, even more taking into account that it's free to play. It is also a simple game to complete 100 %.",
            "review_score": "1"
        },
        {
            "review_text": "A nice point and click game. The game took me less than an hour to beat, most of the things you gotta do are common sense and are things anyone would do if you were in the guys situation. For a free to play short game the game was well worth my time and i was able to get easy achievements!",
            "review_score": "1"
        },
        {
            "review_text": "I don't reccomend buying this but if you get it for free, like one episode of it is now, go for it, it's not exactly fun, but you get a couple of achievements, and that's nice. Because even if you don't like it, you get those from it so it doesn't feel like you've wasted the whole time you were playing it. The voice acting is grating, but you can get around it by turning off the sound and putting on some subtitles. One other annoying thing was that there were so many interactable objects that did nothing (the broken window on the ground, etc.) that I thought could be used to actually do something. I mean, in point and click games, usually if you have the option to use something, it's because you need to use it, but there were a lot of things it implied you could more than look at but never could do anything with (or the cables in the toilet stall). That and having to wait for a hint made me feel like I was playing a facebook game. Also the hints don't recharge if you've switched tabs, which again is annoying. I'm pretty rubbish at point and click games so it might just be me that needed all those hints anyway. Which meant a lot of the time I was just clicking randomly, trying to kill time while I waited for the next hint to become available. Also if you're re-playing it for an achievement, you're gonna wish the text was skipable faster. ",
            "review_score": "1"
        },
        {
            "review_text": "If AIDS and the plague had a baby, it's excrement would be less horrible than this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I was like Sherlock Holmes.",
            "review_score": "1"
        },
        {
            "review_text": "i really like this game and i recommend it",
            "review_score": "1"
        },
        {
            "review_text": "If I had to rate this out of five stars.. it'd get about a 1.5, maybe a 2.   It's not horrible in the sense that there is no story; however, the voice acting is robotic, the game isn't challenging at all, it's short, and the achievements are too easy to get (I'm one of those achievement hunters, so I was disappointed throughout).  The game is aesthetically pleasing for the most part, if you can ignore the glitches where your character ends up floating above someone's head if you double-click to get the options instead of holding the left click.   This would be an okay game for a child between the ages 5-9, but if you're looking for a game that is fun to play then you should probably look elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "really boring i play it i always needs hints i wait like forever",
            "review_score": "-1"
        },
        {
            "review_text": "Great, quick, free start to a game, by this i mean you have to buy the other parts to the game",
            "review_score": "1"
        },
        {
            "review_text": "Fun entertainer for FREE.  +acheivements are easy.  8/10 for what it is, looking forward to the next chapter.",
            "review_score": "1"
        },
        {
            "review_text": "Plain point &amp; click adventure game. Really good if you want to waste your time. It's short and introduction to the main story.. yep this is eps 1. I'm hoping for the rest episode and the story to be interesting.  Lastly, It's FREE so DON'T COMPLAIN!",
            "review_score": "1"
        },
        {
            "review_text": "What happened to Chapter 2?",
            "review_score": "1"
        },
        {
            "review_text": "I was looking through Free to Play and found Reversion. A point and click game that reminded me of a very old game were you are stranded and have no idea whats up, there is a hint system if you are lost, as I was. And there are small bits here and there that tell me these devs put some thought into exploration. It seems like there will be more episodes in the same story, and with the way it (story) is told, there are too many untied knots to stop here. It is short and this was good for me, it was free! The animation seems a bit makeshift, remember this is not crysis 4 or the next-gen game by EA, which arent that good anyways and cost much money. If you are looking to take your mind off the real world and solve a puzzle, this is it.",
            "review_score": "1"
        },
        {
            "review_text": "dis game is the best game ever ",
            "review_score": "1"
        },
        {
            "review_text": "It's a okay game I think it is sometime challenging but every once in a while don't you want a challenge.   7.2/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this game but i would love it if the next part was also available on the store",
            "review_score": "1"
        },
        {
            "review_text": "I'd rather shove a pineapple up my ♥♥♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game. I finished it in 2 hours. Pretty interesting. Works on Windows XP. Fun, and not bad for anime game. I reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice Point and click, and it is an easy 100% !!!",
            "review_score": "1"
        },
        {
            "review_text": "this game has a interesting plot to it you basically start out as a guy who fells nothing and then wonders what happens play for yourself and find out what else happens   8/10",
            "review_score": "1"
        },
        {
            "review_text": "Took me 45 min to finish it, kinda easy. (3 Hints :( ) Bad voice Acting Some of the Achievements didn't pop. BUT i recommend it. it's free, fun, short. Just don't expect much.",
            "review_score": "1"
        },
        {
            "review_text": "this game sucsk  ",
            "review_score": "-1"
        },
        {
            "review_text": "8/10 ",
            "review_score": "1"
        },
        {
            "review_text": "I do not like this game cuz it's something like flash game and it's so boring to walk around and ask people for something.",
            "review_score": "-1"
        },
        {
            "review_text": "It is a pretty good point and click i completed it in like 1.2 hours?  A good time waster if your bored like i was :P  And a very short download time total 7 minutes so i reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Nice storyline. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Game sucks, too slow, terrible voice acting. Screen has to be manually adjusted, puzzles are not challenging and to complete it you have to buy the episodes. 2/10  Not even th storyline is interesting.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was fun. The voices were very computerized and monotone sounding, you could deal with them though they werent that terrible. It is definitely a short game you can play through in a couple hours. It doesnt leave you on a cliff hanger where you had to buy the second episode, you can be content just playing the first. Overall its a simple FREE point and click you get what you pay for, its good for the price.",
            "review_score": "1"
        },
        {
            "review_text": "Don't even waste your time with this game. This is honestly some of the worst voice acting I've ever heard. I only played episode 1 and that'll be all that I will be playing out of this series. It's boring and super short. Worst 'point-and-click' games I've ever played.",
            "review_score": "-1"
        },
        {
            "review_text": "Okay this game looked interesting and since I like to play point&amp;click games, I thought why not give a try. Boy am I glad that I did not pay a cent for this game because it would've been a huge waste of money if I'm to be truthful. You start in a broken down, war torn, old hospital as a man who has lost his memory of the passed 25 years and wakes up in the year 2035. There is little insight as to what has happened other than that this war broke out in Buenos Aires and a group of people took over. From there, you must go through a series of challenging but boring tasks to escape the hospital before the General can 'interrogate' you. However, once you escape the hospital with your fellow patient Victoria....the game ends. That's it. There's no detail as to when the next episode will be out and no new details as to what the heck is even going on in the storyline itself. After playing through the first time, I played through it a second time having known what to do, and found that it took my under five minutes. Quite frankly, I don't even care when the next episode comes out because if this one was any indication as to what the next one will be like, I don't even want to play it. If you're looking for an indepth point&amp;click game with an addicting storyline and beautiful graphics, this game definitely isn't for you. Play at your own risk.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is quite hard to get as your just thrown into everything but the quailty is good and the mechanics of the game are good i enjoyed the story so far and im looking foward to epsiode 2!",
            "review_score": "1"
        },
        {
            "review_text": "cool ",
            "review_score": "1"
        },
        {
            "review_text": "This point and click game is free perhaps because it's advertising it's sequel, but it's a decent short adventure and it even has achievements for collect. But the English voice acting is bad.",
            "review_score": "1"
        },
        {
            "review_text": "If the goal of a first chapter is to get the player interested in buying the rest, then this one has failed.   - Every adventure game has at least one obscure puzzle, but there's usually some kind of hint if you think about it long enough. The hint system is a good idea (as is it's time delay), but it seems like it's made the designer reduce the in-game prompting as to what to do next.  - There's a few animation glitches where the character ends up on the ceiling. The double click fast travel was a good idea, but I couldn't get it to work reliably. - Hitting the same option 7 times to progress the story is bad design. At least change what the character says so we know we're on the right track.  - Context dependant pick ups aren't a bad idea (the medicine was a good one) but when a nessecary item is next to something that we're literally told is useless (like a pile of trash) it's frustrating. - The voices and english are a little off. Since this wasn't originally in English, this isn't something worth marking the game down for, but I think I'd find it better with text only if I played the next part.   Lastly, there just isn't enough information on the setting to pique my interest. Something about an explosion and a coup? Everyone seems to avoid telling you things, presumably for the sake of a reveal later on, but the purpose of amnesia characters are to justify the big exposition dumps needed to catch the player up. There just isn't enough there for me to put money in and find out.",
            "review_score": "-1"
        },
        {
            "review_text": "it is a very entertaining game, to the point that i wish i had the second chapter:3",
            "review_score": "1"
        },
        {
            "review_text": "bad voice acting,terrible graphic,annoing . anyone who like this is stupid",
            "review_score": "-1"
        },
        {
            "review_text": "This game was a little bit confusing although it also made you think very hard. Very short game though.",
            "review_score": "1"
        },
        {
            "review_text": "I feel like a jerk writing a bad review for a game that alot of work was probably put into, but the puzzles were only moderate, the voice acting was terrible, there are just so many things that don't fit the mood in this game. Since you are waking up to a broken world, you'd think it would be more serious, but it's laid out just like a child's game.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun and addicting i will be looking foward for the next chapters",
            "review_score": "1"
        },
        {
            "review_text": "Basically your typical point'n'click. Its only strong point is being set in Buenos-Aires, it doesn't happen very often.",
            "review_score": "-1"
        },
        {
            "review_text": "Too short even for a free game, the story is not engaging either, after playing this game , I really don't want to play the 2nd chapter.Play this game only to get a perfect achievement, you can get it all maybe about an hour of gameplay or so.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game not to easy and not to difficult",
            "review_score": "1"
        },
        {
            "review_text": "nice little game  pros decent graphics even if they look like a comic book  vo's are understandable and clear music idk i had mine down ambiance...not much  cons very short game can complete it through 2x in under 2 hrs   7/10",
            "review_score": "1"
        },
        {
            "review_text": "Challenging game during the first playthrough, but if you like puzzles this is a good way to kill some time. I enjoyed it. Try playing with someone and race to see who finishes first. Makes it more fun.",
            "review_score": "1"
        },
        {
            "review_text": "this game is way to simple even a BABY can beat the game",
            "review_score": "-1"
        },
        {
            "review_text": "Really great game love it.",
            "review_score": "1"
        },
        {
            "review_text": "2d graphic cg is good. But music is simple and repeat.",
            "review_score": "1"
        },
        {
            "review_text": "i like the game,but when the next chapter will come:D i cant wait",
            "review_score": "1"
        },
        {
            "review_text": "A great way to kill a few hours. Other than the voice acting, which is terrible per se, the game itself was alright and it certainly isn't lacking in mystery and puzzle department. Looking forward to the next chapter!",
            "review_score": "1"
        },
        {
            "review_text": "it broke on the 2# play some more badabing badabung and Escape and it's short   oh and Spanish",
            "review_score": "1"
        },
        {
            "review_text": "It was tricky at times, but all in all I give it a 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "cant wait for chapter 2!",
            "review_score": "1"
        },
        {
            "review_text": "Eh... It was a cute game but super cheesy...",
            "review_score": "-1"
        },
        {
            "review_text": "As an avid point-and-click adventure gamer from back in the day, there's a fine line that a developer should not cross. It's obviously to me Reversion - The Escape's language is not primarily english and it was translated, albeit poorly. The logic in the game is hardly intuitive and the puzzles are boring. The game will not run full-screen in a Intel 4400 mobile chipset without ridiculous flickering constantly so it has to be played windowed. The voice acting is absolutely horrible, how did you get a monotone news reporter to play the doctor? It pains me to say this but after struggling to comprehend this poor game for the past half hour, it's going to be deleted and not finished. Why would anyone want to pay money for Part 2 if Part 1 isn't worth finishing?",
            "review_score": "-1"
        },
        {
            "review_text": "Reversion is a point-and-click 'escape' game (as indicated by the sub-title). If you were around in the dark ages of the internet you're probably more than familiar with these, being the go-to 'hello world' genre of choice for flash developers.   OK, awkwardly phrased intro done, let's get onto the real review. This game is horrible for a veritable smorgasbord of reasons.   We'll start with the plot. You play as 'Straight White Male' (hereafter referred to as SWM), a character completely devoid of personality who wakes up in a hospital room with amnesia. Yes, apparently we're still doing amnesia. After establishing SWM's amnesia we go on to learn that a civil war has broken out and that it is 20 years later than SWM thought it was. Apparently he's a time traveller too or something stupid like that. There's also a doctor, a love interest (sorry, 'woman') called 'Victoria' and a soldier, though everyone seems to be avoiding the word 'soldier'.   Since I got bored of the game very early on, I'm just going to guess the rest of the plot.     SWM and Victoria escape the hospital and join up with 'The Resistance'. Through a series of misadventures they work hard to bring down whatever the other faction is, as Victoria's heart warms to SWM (possibly due to his charismatic blandness), Eventually they kill Hitler or whatever and fall in love.    The voice acting. Oh god, the voice acting. Everything is flat and emotionless, the doctor being the worst offender. The pacing of the lines is horrible as well, there's no pause in between them so everything has this weird rushed feel, despite the lines themselves being slowly paced.  The dialogue itself is pretty horrendous as well. It's fairly obvious that it wasn't written natively in English : not in itself a bad thing but the translation has been done poorly. There are odd quirks in the subject matter as well, where it is painfully obvious that the characters are speaking around the plot in order to hide information from the player, so that they can find it out later on and be surprised.  As far as gameplay goes: it's a traditional point/click escape game. The puzzles don't make any sense so you have to just wander around all the areas at a painfully slow pace, clicking everything and combining everything with everything else. So in that respect it's pretty faithful to the genre.  In conclusion, don't.  Despite being free, I'd still advise you to spend your money elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "It was fun but short. The second installment is not free yet",
            "review_score": "1"
        },
        {
            "review_text": "Fun and small file Recomended",
            "review_score": "1"
        },
        {
            "review_text": "its very short but very enjoyable game if you can pay pay and buy 2nd chapter u will like it and enjoy",
            "review_score": "1"
        },
        {
            "review_text": "This game....ugh...well all I can say the intro is quite annoying how you have to figure out how to get a good view. I only played little of it but I can tell this game is very bad. First off hints are basically not really 'hints' just telling you what to do. Some of these hints are useless and they don't really tell much. The intro will take you almost literally forever. The dialog is stupid, the fact it takes place in the future makes no sense. The controls they tell you in the beginning don't tell you much of anything other then click. It doesn't tell you how to walk, talk, interact, etc. and etc. :/. The story seems literally pointless because if you've played games before you would know how it would go. All of this crap makes chapter 2 not worth buying because it might be bull crap.",
            "review_score": "-1"
        },
        {
            "review_text": "Why we need to pay 2st chapter :(",
            "review_score": "1"
        },
        {
            "review_text": "'its not as good as tell tales games but its still good for an indie game 7.5/10'",
            "review_score": "1"
        },
        {
            "review_text": "At first, looks as very lame and confusing adventure. As you progress it gets a little bit better, but still not much. Double clicking to do actions can sometime be pain in the ♥♥♥, single click would be better solution. Voice acting is very lame, as it seems author didn't do much effort for that matter. Only positive thing i find in this game is mistery about what lies beyond further in story. Maybe hint system can be find helpful sometime, although removes the challange of beating game proper way. Play this game only for achievements!",
            "review_score": "-1"
        },
        {
            "review_text": "A fun and small point and click game  10/10 for creativity 5/10 for gameplay 5/10 for music",
            "review_score": "1"
        },
        {
            "review_text": "Will the 2nd chapter ever EVER come out?",
            "review_score": "-1"
        }
    ]
}