{
    "app_id": 270760,
    "name": "Realms of Arkania 3 - Shadows over Riva Classic",
    "release_date": "2014-01-10",
    "developer": [
        "attic Entertainment Software GmbH"
    ],
    "publisher": [
        "United Independent Entertainment GmbH"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Fantasy",
        "Classic"
    ],
    "achievements": 0,
    "positive_ratings": 33,
    "negative_ratings": 6,
    "price": 2.49,
    "description": "Shadows over Riva (1997) is the third part of the glorious Realms of Arkania Trilogy...Something sinister lurks in the seaside town of Riva. An evil force has subverted the city's leaders, and evil things lurk in the town's sewers. Explore the huge city, dungeons and even underwater regions in stunningly detailed 3D.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/270760/header.jpg?t=1447359814",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: 1 GHz Processor Memory: 256 MB RAM Graphics: 3D graphics card DirectX: Version 7.0 Storage: 650 MB available space Additional Notes: Running on integrated DOSBox",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Here we go, third part of the Arkania tales.Your party of heroes arrived in a big city, Riva , from the first steps you will be pulled in the great adventure, the darkest mystery hides here and now only you can drop light upon it.No more miles of traveling, surviving in dry deserts or cold mountains, it is only city and surroundings, but dont think that crossing a street is easier then crossing a raging stream. If your heroes ready for new adventure Riva is open for you.   A bit late , but i reccomend to edit - dosboxrealms3.conf - this file can be found in the game directory, few lines have to be changed: scaler=advmame2x ; cycles=18000 . scaler makes picture a bit softer and 18000 cycles looks like the optimal speed.",
            "review_score": "1"
        },
        {
            "review_text": "DON'T BUY FOR MAC!! A Bug makes the game almost unplayable, because entering a house takes about half a minute to go to the next screen, it's crippling. Very unfortunate, would have loved to play this game.",
            "review_score": "-1"
        }
    ]
}