{
    "app_id": 270790,
    "name": "Etherlords II",
    "release_date": "2014-02-13",
    "developer": [
        "Nival"
    ],
    "publisher": [
        "Nival"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Card Game",
        "Turn-Based Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 190,
    "negative_ratings": 46,
    "price": 3.99,
    "description": "The saga continues! Etherlords II takes you back to the world of Ether and into a whole new realm of fantastic possibilities. Lead your hero on an unforgettable journey through lands filled with unsurpassed beauty and danger to unlock the ultimate mystery.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/270790/header.jpg?t=1447359817",
    "minimum_requirements": "OS: Windows Processor: Pentium III 600 MHz Memory: 128 MB RAM Graphics: 3D-accelerator AGP with 16 Mb RAM DirectX: Version 7.0 Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows Processor: Pentium III 1.0 GHz Memory: 256 MB RAM Graphics: 3D-accelerator AGP with 32 Mb RAM DirectX: Version 7.0 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "Do you know anything about Heartstone? Is it that it's kind of a ripoff of Magic The Gathering? Well, Blizzard were not the first ones to rip those damn cards. Etherlords did it first, and I personally think this game still holds up to Heartstone, if what you're looking is a singleplayer experience. As usual I'll start talking about the things the game doesn't do right:  The game has a story on it, a story that seems somewhat deep for a card-based game... However, it never got hooked to it. Seriously, it's quite boring. It also doesn't help the story that most characters have less than average voice-acting to them.  Another issue I have with it is the difficulty. Most of the enemies in the game are okay, offer a good challenge, and being defeated usually means that you should look at your deck and change your cards, as there's probably a better way to deal with this sh#t. However, one of the races on the game seems to have some balance issues: the Pale race. These guys don't f#ck arround. Some of their monsters are hilariously broken, as they're insultingly hard to kill (they usually just go hollow when you kill them, becoming a ghost but being able to return to life in exchange of mana or other stuff), and some of them deal insane amounts of damage, while also draining your HP. Seriously, build yourself the most broken and lame deck against those ♥♥♥♥♥♥♥s.  The last thing is that the multiplayer is long dead. Now there are ways to play with people, even while the servers died years ago by using third-party software... But there's barely anyone who has the game. I HAD IT YEARS AGO WHEN IT RELEASED AND EVEN THEN IT WAS HARD TO PLAY WITH SOMEONE! This game did not get any attention during it's life-time, and it shows.  However, is the game good? Holy crap, it is.  The gameplay is a real good challenge, an entertaining strategy game were you're always trying to build your deck to get better, but also a game were defeat is usually just the perfect chance to get better. Something like that is hard to pull off.  The amount of different cards, races and monsters is also quite great. There are tons of different strategies you can build to yourself, along with the tons of different enchantments, traps, artifacts and other crap you can get your hands on.  The level system is also interesting, and I liked it a lot. As you level up, you can select extra passive skills such as regenerating some HP each X turns, getting an extra card each X turns and so on. They really make you feel like your deck and character is unique.  Do I recommend this game? Yeah, IF you're a fan of this kind of strategy games. If you like Magic The Gathering, Yu-gi-oh, Heartstone and all of those other weird card based games, you'll like it a lot. If you're not a fan of those but you like strategy games, it might also interest you. If you're neither of those, you should turn arround.  Oh, and ♥♥♥♥ Exile. I f#cking hate that spell. It can go f#ck a d#ck sideways on the shadow realm.  TL:DR Edition: Old card based game that ripped off Magic The Gathering, mostly singleplayer because of dead multiplayer. If you like Heartstone and other card games, give it a try on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Thank you for making the game avaliable here, this was one of my first ever strategy games, and I have to say, it's still awesome as it was :D.  Sweet childhood!",
            "review_score": "1"
        },
        {
            "review_text": "The voice acting is goofy, the plot is silly, the overworld controls are clunky, but the actual 'card' game is fantastic. Loads and loads of fun to be had finding and breaking the gameplay engine, then using those tactics against your unwitting friends.",
            "review_score": "1"
        },
        {
            "review_text": "great game. i'm not a fan of magin-like card games but this one it's really great! I absolutely suggest it!",
            "review_score": "1"
        },
        {
            "review_text": "Game of my childhood! Best card game ever!",
            "review_score": "1"
        },
        {
            "review_text": "Just play Duel of the Planeswalkers, this game has nothing to offer that traditional Magic doesn't do 600% better and you won't be dealing with horrible voice acting, a bad interface, bad graphics, and a generally uninspired and unoriginal fantasy world. I would rather eat sawdust than boot this game up again and spend the next two hours summoning rats.",
            "review_score": "-1"
        },
        {
            "review_text": "Totally ridiculous waste of time. Don't even play it if it's free and you are bored out of your mind. Being bored is better!",
            "review_score": "-1"
        }
    ]
}