{
    "app_id": 271240,
    "name": "Offworld Trading Company - Free Multiplayer",
    "release_date": "2016-04-28",
    "developer": [
        "Mohawk Games"
    ],
    "publisher": [
        "Stardock Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Co-op",
        "Online Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Includes level editor"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Economy",
        "RTS"
    ],
    "achievements": 256,
    "positive_ratings": 2810,
    "negative_ratings": 966,
    "price": 0.0,
    "description": "Mars has been colonized, and Earth's corporate titans fight to dominate this new market. Competition is fierce in this fast-paced economic RTS from Civilization IV Lead Designer, Soren Johnson.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/271240/header.jpg?t=1554297125",
    "minimum_requirements": "OS: Windows 10 / 8.1 / 7 Processor: 1.8 GHz Intel Core 2 Duo / 2.0 GHz AMD Athlon X2 64 Memory: 2 GB RAM Graphics: Nvidia GeForce 8800 GT / ATI Radeon HD 3870 / Intel HD Graphics 4600 DirectX: Version 11 Network: Broadband Internet connection Storage: 2 GB available space Sound Card:",
    "recommended_requirements": "OS: Windows 10 / 8.1 / 7 Processor: 3 GHz Intel Quad-Core Processor / 3.2 GHz AMD Six-Core Processor Memory: 4 GB RAM Graphics: Nvidia GeForce GTX 460 / AMD Radeon HD 7850 DirectX: Version 11 Network: Broadband Internet connection Storage: 2 GB available space Sound Card:",
    "reviews": [
        {
            "review_text": "I built a great company, some of the greatest assets in the solar system. Millions and millions of dollars. I get along with everybody, I get along with the robots. I love robots, great people. Robots are killing us in trade. Look at what the robots are doing, devaluating their water. They take our jobs, they take our money. We're not winning any more. We need smart competent leadership. Right now we have leaders. They don't know what theyr'e doing. We're going to Make Mars Great Again.   Believe me.",
            "review_score": "1"
        },
        {
            "review_text": "Other reviews have covered the excellent sound, graphics, and market-driven gameplay. I will just add this: rarely have I played an RTS where the AI was so hard to beat. On Manager (where neither side has an advantage) I have only managed to win once out of about 8-10 games. You can play on an easier difficulty setting, of course; but it is refreshing for me to have an AI that provides such a challenge. (Playing online with friends has been great as well.)  Oh, and from my experience (and what I have read/seen on streams) it is absolultely not true that the game lacks depth. When playing on a proper difficulty, a combination of terrain, faction, and the behavior of your opponents will force hard choices that do not play out the same every time.   Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "There is a really strong caveat in recommending this, which is that the tags on the store page are extremely deceptive. This is not an economic game, this is not a simulation game, this is not a trading game, and this is not a base building game. This is a very fast paced, micro-intensive RTS.  Its an interesting take on the RTS genre, because you don't have any units to control. But make no mistake, this game plays very similarly to one of the micro practice maps for SC2, and uses essentially the same skillset. Its just that instead of microing units around a map, you're constantly scanning the map, spamming abilities, and hitting the buy/sell button. I know it may sound like this is fundamentally different from microing units around, but in practice its not.   If you're someone who likes the micro game in SC2, you'll like this game. If you're a more casual RTS player then this probably isn't the game for you.   There's nothing wrong with that, and the game itself is quite well done, but the game is definitely targetted towards a relatively small niche and the store page/reviews in no way reflect that.",
            "review_score": "1"
        },
        {
            "review_text": "I've always thought that one of the problems with modern games is that they are a bit too obvious in thier attempt to make you feel good by - in essence - letting you win which is why the demanding difficulty of Offworld Trading Company is so very enjoyable.  As I pass the twenty five hour mark on Offworld I'm also playing The Witcher 3 which allows me to perform some very heroic slashes that seem far beyond the mashing of left mouse I am doing. It is very pretty but it seems to remove me from the mix. The Witcher 3 is great but sometimes I feel like I'm a distraction to it, rather than the other way around.  Offworld Trading Company is the opposite. Go disengaged in a minute of playing Offworld and you lose. Make bad decision in Offworld and you lose. Play well but not as well as someone else (including the impressive AI) and you lose. Every defeat one can imagine a cause for an consider how to fix it. The moment I realised that not mining a resource because it could be bought dirty cheap was a viable strategy was a revelation made better because it was not hinted at, or revealed in a tutorial, or given to me in any way other than through experience.  The result is a game where one feels an authorship over victory (or defeat) that creates a more compelling narrative than many a game that sell themselves on their narratives. An irony of sorts there.",
            "review_score": "1"
        },
        {
            "review_text": "This title hits a lot of my buttons... It's super polished, has a great soundtrack, and does a great job of developing complex gameplay from simple precepts. I like the different faction perks.  I want to comment again on the level of polish. Everything happens instantly when you click buttons. The controls are intuitive and simple. Good balance between keyboard and mouse. Nice graphics, fun animations without looking gimmicky. It feels like someone with severe crippling OCD spent 2000 hours fine-tuning the UI. I appreciate that.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting and enjoyable take on the RTS genre. Nothing to add to the various positive reviews already available, but worth pointing out that the almanac (DLC) delves into various skills/tactics needed to tackle the higher difficulty AI. Alternatively or as a complement to this, would suggest checking out the videos published by Zultar on youtube or twitch (which are either tutorials and multiplayer games with commentary).",
            "review_score": "1"
        },
        {
            "review_text": "I should mention first that RTS games are the games I dislike the most. I really don't like the whole idea behind going down a memorized checklist for the best builds as quickly as possible. I just don't have the time or patience for that. That said, this game isn't bad so far. I've only played offline because of the above reasons and I don't think this game will change my mind on RTS as a genre. But, there is something about this game that is keeping me hooked where other major titles haven't (Starcraft, Warcraft, CoH, etc). Maybe it's the complete lack of combat or the unique focus on economics. Or that the skirmishes themselves are very short.   It probably helps to have some background knowledge of economics going in, but it's not required. The tutorials do a good job of explaining the basics. And, while I do find myself pausing a lot (and kinda wish there was a turn-based mode as a result), I haven't felt overwhelmed yet. And I appreciate the developers giving options for turning off the black market. If it does end up turning into the typical RTS “build order checklist”, that will be disappointing and I'll update my review accordingly. But, for now, I'd say it's worth the $13.59 price tag. The AI has been competent and the individual games, and approaches as a player, have been fairly unique.",
            "review_score": "1"
        },
        {
            "review_text": "I've only got about four hours into the game and so far it is an ever changing, fast paced, economy game. I played through the tutorial and did a few games against the computer, and lost, but I am starting to get the hang of it.  Pros: Fast paced Orginal idea   Cons: So much orange on Mars Fast paced Music gets annoying after a while Steap learning curve Computers will gang up on you early if you pull ahead fast  Don't let the cons change your mind, at the current price point of $40 for the delux version it's worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't seen so much ruthlessness on Mars since DOOM.  Pros: +Tutorial and Practice Games are well done +Several different paths to victory +Campaign mode forces you to use different strategies +Winning is always satisfying  Cons: -Campaign could use some more backstory / diversity -You can get screwed by RNG sometimes -More corporations with more unique abilities would be a plus  Worth purchasing during a sale - 7/10",
            "review_score": "1"
        },
        {
            "review_text": "I simply cannot recommend this game. I was in the mood for some trading and had been eyeing this game since prior to launch.  But now that I bought it, I deeply regret it.   This game is incredibly simple. It's dumbed down and gets repetitive easily. There is no real market, you buy and sell to the game with some simulated market prices, and that's what your competition does too. If a colony says it requires food, you won't be selling food to them, the game will simulate it and make the price go up a bit. But you just won't trade with anyone specifically. There is only a 'sell' button for each good and that's it.  You can hack Mars information systems (somehow) to simulate a shortage and make the price of your goods go up, but in late game each time, all the goods prices will be going up and becoming hella expensive. Right, real market right there. You can also make prices go down but that doesn't have much impact late game against AIs.  The game is just too simple. I am greatly disappointed and sad and missing my money.  I haven't tried multiplayer and won't review it.",
            "review_score": "-1"
        },
        {
            "review_text": "Highest recommendation. The last games I played more than 50 hours were (not coincidentally) Civ IV and Starcraft 2. This game is completely different and yet reminds me of Civ IV in some way I can't identify. Basically, the implication in the game's blurb is dead on: if you loved Civ IV, you'll probably love this.  I believe you will also love this game if you are a more macro-oriented RTS player.  There are 3 changes which would further improve it. These are serious, but their specificity should signal to anyone on the fence about buying it how damn good and deep the game is to begin with :  (1) Precise 'colony' demand function. If for instance you pause the game, buy a block of 100 of a resource, then sell them back one at a time, you'll wind up with less money than you started with (was previously more but seems to have been changed). There's some kind of error with the demand function, likely due to rounding/approximation of price, quantities or both. It's a bit frustrating to know that you've lost some money if you buy something and change your mind or are on autosell for a good and decide to buy back.  (2) AI behavior. Generally, the AI is too aggressive against the player (or perhaps only to the player most 'ahead'), cutting off its nose to spite its face.   (a) Hacks. An AI player will create a surplus in something you are producing/mining very profitably even when the AI is also heavily producing/mining this as well. This may even be their most profitable or most commonly produced good.  (b) Blackmarket. In the campaign, near the end of the last day, the AI will still spend an exorbitant amount of money to slow down your production, well exceeding their direct benefit from lowering your stock price a small amount.  (c) The AI seems to always know you've attacked them when you do despite anonymity. Further, if you retaliate to an initial attack of theirs they will re-retailiate, leading to a kind of 'arm's race.'    In short, each AI should be maximizing their own individual benefit instead of minimizing yours. These are identical if it is 1v1, but I'm often 'ganged up on' to an excessive extent when ahead in a game playing with several AI players. It is an excessive extent not because I dislike it or feel it is 'unfair,' but because it is to our mutual detriment.  (3) The UI. I generally play against the AI primarily and very slowly, with pausing, an efficient UI is a lower priority for me. However, in the few multiplayer games I've played, I've been overwhelmed by the amount of mouse movement/clicking necessary (unlike, say, the macro components of Starcraft or better yet Supreme Commander).  Ideally, I should be able to create one set of hotkeys to select construction, patents, optimizations, hacks, launches, and blackmarket (e.g., numbers 1-6), and then, conditional on one having been selected, hotkeys for each option (e.g., research teleportation = 'T', so researching teleportation could be done by pressing '2' then 'T'). The fact that such a complicated system of hotkeys is necessary is actually a good thing, as it's due to the vast number of decisions the player can and must make at any time.  Lastly, a mini-map roughly indicating resources and opponent claim ownership (not simply completed structures you can see by tabbing) would make acquiring the information necessary for your decisions far, far more efficient.  Let me reiterate that this is one of the best games I've ever played. If you even suspect you may be the type of person who would enjoy it, invest the $40 or less for what may be hundreds of hours of rewarding gameplay. ",
            "review_score": "1"
        },
        {
            "review_text": "Overall, this RTS game is a refreshing take on a familiar concept: Corporate Warfare as Alien Colonization RTS. I've been playing it now for three days, and overall - I really like this game. My only issue is that it seems the devs really took a few shortcuts that seem to show, the sort that you might not see in a release from one of the more established publishers.   First, typos - you'll see them in the game and referred to in discussions. Seriously, guys - if you can develop a game you can spell check. Just lazy IMO.  Second, balance - the game does not seem balanced between the difffering factions nor with the AI. So far it seems to be either very easy to win, or impossible to win. There are a lot of 'moving parts' in this game - i.e. a lot of resources, upgrades, and attack options via the 'black market' and hacker array to contend with, and no matter what you do the AI will make all the necessary calculations much faster than a human to determine the best strategy to win. Devs have said this isn't true in discussion, but with respect they understand the game differently than a new user and they should listen to the criticisms.  Third, font/resource icon size - there are many instances when the fonts are honestly nearly too small to read. Anyone who might need reading glasses (not just middle-aged gamers like me) will find it hard to read numbers, which is pretty important given this is a game of corporate warfare and espionage. Seriously, make the fonts/resource icons like 10-15% bigger and it's much more playable.  Fourth - there seem to be issues with multi-player, but I cannot speak to that specific complaint because I've not yet attempted to get into a MP game, but read the discussions if you want to learn more on MP bugs.  That said, I'm confident that future relases and patches will address these issues, and one of the best features in my opinion is the lean and effective use of code. I was THRILLED to see that it only took up a little over 2G on my MacBook AIR. I'd strongly consider this title if you're a fan of any of the Civ games, as well as C&amp;C or other RTS titles.  ",
            "review_score": "1"
        },
        {
            "review_text": "I played through the tutorials, which took me over 2 hours to finish, so I was past the refund time. Game modes unlock as you finish the tutorials. Since I knew I had to keep the game, I made sure to play it for what it was worth. Turns out that was about a week of fun before the charm ran out.  I expected the game to have some of the dynamism of Civ 4, with more economics, since Soren Johnson was the lead on the game. It turns out to be a fast, pausable real-time game where you mine, buy, sell and turn into about 3 products. Matches run about 15-30 minutes depending on game type (campaign, skirmish, multiplayer), or end more quickly if you make an oversight in your production. Your AI opponents are trying to get the upper hand on the market and drive you out of business. Both the player and AI can corner the market on resources and production, and play dirity tricks to steal from or knock the competition's production offline. You can also upgrade production techniques and patent methods to give you an edge in making your products. The winner buys out all of the competition, forcing them to become subsidiaries.  Graphics wise the game uses sharp, simple graphics with a bright, almost neon palette. It is easy enough to see what is going on once you get used to watching ships shoot across the map carrying cargo. Outliners for sales, resources, and production are visible and easy to use. There are a number of voiceovers to events in the game, such as a company losing stock, a disaster, or industrial accident. Most of them use a pretentious tone, and they sound off regularly to inform you of the happenings of the map. The voices do not seem consistent to the AI personalities, and I got tired of hearing 'Screw with us, and we'll screw with you' and its ilk after about the 20th time I heard it in a match.  Since I didn't like the game enough, I never tried multiplayer. If you were hoping for a deep simulation and a wide sprawling market where you plan and plot over time, this isn't your game. Its a short, well-designed game that plays at the pace of a casual title. Campaign mode can be fun, because it lets you acquire and keep upgrades between matches. Skirmish mode is a place to practice and find out how not to lose. It took me about 8 hours to understand the flow of the game and how to win. Just remember the tutorials take a lot of time, so if you don't like it in the first hour, you may want to seek a refund. I may get bored enough to return to the game one day, but the frenetic pace and short playtime just does satisfy as much as winning or losing in another game of thoughtful planning.  Pros: The AI is smart and know how to play the game well on standard difficulty Sharp, if cartoonish graphics Robber-barons on Mars  Cons: Short playtime Annoying, inconsistent voiceovers Lots of critical thinking, QUICKLY!",
            "review_score": "-1"
        },
        {
            "review_text": "Okay, so I'm far from the best to write a review on this game and that is because:  1: I only have about 8.6 hours in game at the time of writting the review  2: I'm not a big RTS player  So with that in mind, I can give out my opininion about the game  The concept of the game is great, the fact that you have to focus on trading more than fighting to claim victory is interesting. It brings a new kind of experience to the genre wich is a good thing. The whole mechanic of the game is based arround collecting and selling ressources to turn a profit and stack up capital, wich is then used to build more or buy stocks in opposing companies in order to buy them out. Great concept in general.  So the concept is great, but what about the gameplay? Well that too is pretty good, now if I could I would make some interactions less troublesome but since I haven't taken the time to go bind my keys I can't blame the game for not having something it might have. Other than a few annoying things the gameplay is all you could ask for, it is slow paced but that is normal from the very nature of the game.  So concept and gameplay are good, but is it worth the price? I personnaly bought it when it was in early access so I got ~16 CDN$ worth of DLC for free, now that includes the Soundtrack DLC and the Real Mars Map Pack DLC, but with that aside i'm only reviewing the game itself, not the DLC. I can say I'll have enough fun to make it worth the 39.99 USD$ I payed for it when steam didn't have the CDN$ shop. Current retail price in CDN$ is 43.99 and I can say I would gladly have payed this price aswell. Now, the campaign has it's own share of goodies but it isn't a story based campaign like Star Craft and War Craft had, it's more like a few skirmish rounds on different maps with different objectives. I am in the middle of my first one so i can't tell you all about it but it gives you different ways to play the game wich in the end adds to the value. The standard skirmish is great and is the most fun for me. I can already assure you that it was worth my money in those almost nine hours.  [EDIT] I just finished the campaing and it was incredibly satisfying. Definitely doing a few others soon!  So my final verdict, if you already play RTS games and love them then go give it a try! The whole economic twist will make you play something you never played before. If you are new to RTS games in general this isn't a bad palce to start. You'll find the more military based ones just as good when you get to them, plus if you are having trouble starting there is a 91 pages almanac to help you get the hang of the game.  My rating? 9/10, 90/100, 18/20, 4.5/5  Hope this review was useful to you! If so, please let me and steam know right below in the: Was this review helpful corner.  If you are looking for a good match jsut add me up and I'll buy you out anytime!  With all of this said I'll end it here and let you all go:   save humanity, turn a profit, preferably both.  CmD0_ out",
            "review_score": "1"
        },
        {
            "review_text": "This is a really good game. It is an RTS but with really no units to speak of. It is an economic sim like Anno but with greatly streamlined gameplay. It is a multiplayer game with an incredibly strong single-player campaign with progressive unlocks.  It is by the lead designer of Civ4, and it shows. It is all about fun with incredible depth beneath it on every facet. Also the music is incredible. It's by Christopher Tin. You know that awesome song in Civilization 4 (Babu Yetu, which is Swahili for Out Father)? He did that. He does it again here. It feels somber as you enter in. It is tense as the game roles with his music. It ties together nicely.  I played it under early access, but it is so, so much better now.",
            "review_score": "1"
        },
        {
            "review_text": "It's the typical mechanics of most resource managing games, but with a limited number of resources and resource correlations. It's ok for quick games, but it didn't make me want to play for more than a few hours in total",
            "review_score": "-1"
        },
        {
            "review_text": "great game, great passage of time and competitive however the difficulty in learning mode gets twofold tough from assistant level. Practise a lot before you go online. This game will never get dull. But i do hope some advances are made in the faction advantages, some factions are made op compared to others.",
            "review_score": "1"
        },
        {
            "review_text": "A tight, engaging game. The AI is very challenging without having to cheat, which is a big plus for me. Manipulating the market and trying to anticipate how each resource price will vary over the course of the game keeps me engaged. Yes, this isn't like Civ where you're building an empire, which is good because it strips out a lot of the tedious 'build a library and granary in every city' stuff. In 30 minutes I can complete a memorable game.  The campaign is also excellent. Changing the rules in each scenario just enough to force you to try new strategies to win. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Offworld Trading Company is an excellent game. Simply put, it strikes the perfect balance between heavily detailed strategy and intuitive gameplay. This allows you to begin enjoying the game from the off, but also to continue honing your skills for hours afterward. Some negative reviews indicate that OTC gets repetitive quickly. I disagree. Although the main idea of the game remains the same, there are numerous factors that make every match entertaining in its own way. Personally, I find it no more monotonous than turn-based strategy games like Age of Wonders or Civilization.  In summation, Offworld Trading Company is a wonderful multiplayer or singleplayer game that I reccomend to anyone who enjoys RTS games.  Overall: 9.2/10",
            "review_score": "1"
        },
        {
            "review_text": "I like hexes and supply lines; this has hexes and supply lines. Only kept me interested for one weekend though. The story is nonexistent, and the game has a steep learning curve (playing is easy, but you can get crushed by an opponent and not have a clear picture why.)  I'm going back to playing 1401 instead.",
            "review_score": "-1"
        },
        {
            "review_text": " This game was definitely worth my time",
            "review_score": "1"
        },
        {
            "review_text": " A thoroughly enjoyable and unexpectedly fast-paced trading and strategy game",
            "review_score": "1"
        },
        {
            "review_text": "This game is very good but difficult. This is one game you will WANT to do the training missions to get you up to speed. Even so you will have difficulty passing those as well.   The thing that really makes this game interesting is that it's an RTS with out direct control of units and combat. You can use force against other players but its more like subversion.  ",
            "review_score": "1"
        },
        {
            "review_text": "It's fun with literally any number of players except 3.  It's in the same vein as other economic hostile-takeover games like TTD but it's much faster-paced, so instead of a game taking days to complete, it's over in 20-30 minutes. This is a good thing. The time between 'It's obvious who the winner is' and 'The winner is declared' is very short. Games don't last very long after the first buyout, so if you're playing multiple rounds with friends, you won't have to sit out long.  The basic premise is to acquire resources and sell them to get money to repeat the process. Resource prices change accordingly every time something is bought or sold, and there are various market manipulations that can be done. There's plenty of ways to mess with your opponent there, and you can buy usable-once-only sabotages for further shenanigans.  It has its problems - the first buyout practically doubles your stock price, so in a 3-player game the first buyout determines the winner; the remaining player has a 0% chance of catching up and should just concede immediately. The Offworld Market is a necessary evil on Mars (as otherwise all resource prices drop to 1, but whoever has them is basically guaranteed to win) and utterly useless on Ceres (as all resource prices eventually become 1000). The AI is WAY too good at the game, as it makes no attempts to hide that it can and will react instantly to situations, inputting commands faster than any human possibly could.  Overall though, it's an excellent strategy game that doesn't take nearly as long to play a round of compared to others in the genre. A good game to grab if you like economic games or quick strategies.",
            "review_score": "1"
        },
        {
            "review_text": "If the idea of an almost purely economical RTS 'battle' appeals to you, then this is a game you definitely should own. However I feel like the 40 dollar price tag is too steep for what it is.  First off, where this game really shines is multiplayer. Small battles, even just 1v1 with a friend, are really fun. Everything is about speed. The game is different from most traditional city builders. There's not a whole lot of 'city building' going on. That is to say, the way that you decide to lay out your 'town' is not overly important to the game. You can get certain bonuses for having some buildings next to others. For instance, placing any building next to another of the same type gives you a production bonus that is stackable, and buildings touching your HQ don't need fuel for transporting goods. Other than that, city design isn't a prominent aspect. Instead, the gameplay is all about speed. Claim territory, make money, and claim more territory as fast as possible.  More often than not, the person who manages to claim the best territory the fastest will end up winning. Because of this, games can often be decided in the first 5-10 minutes. They also usually don't last more than 20-30 minutes. That is part of what makes the game so cool. If you're looking for a quick multiplayer session with a friend, it can become a natural choice if you're both good at it. Skirmishes are very fast paced and don't last long so you can squeeze games in whenever you feel like it. However it's also one of the game's hindrances.  I think it could do with a good deal more content. Games almost feel  too  fast. You rush to figure out what the key resources on the map are and acquire them, rush to build some factories, rush to research some technology to give you advantages, always keeping an eye on the fluctuating prices of various commodities and having to deal with your opponents sabotaging your production through various 'black market' means. There's so much to keep track of that games can flip around on you in an instant. One second you can be on top, well ahead of the game, next thing you know WHAM game over you just got bought. It can often leave you going 'what the hell just happened?'  This is part of what makes it so fun and deadly, but at times it can feel somewhat lacking. So much of the game is just looking at numbers on the sidebar, constantly guaging prices, resources, buying, and selling. The actual graphics are very nice, but the funny thing is you don't actually spend a lot of time looking at the graphics, because winning is all about crunching numbers quickly. In my opinion the game would be better if there were some more layers of strategy that involved the actual graphical, planet of mars, city building related stuff. That would make this game a 9/10 for me at least. Alas, it does not, but if the devs keep developing it as they are it will get better.  If you get it on sale, it's definitely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I like RTS type games and I also like tycoon type games...and this is a good mix of both!  After playing thru tutorials and understanding game a bit better it gets more enjoyable with every game played. while it may look a little daunting at first, it is actually a very good UI and easy to figure out what everything does as there are plenty of tool tips and guidance in game.  I waited till it was on sale for $11.99 and well worth the buy!",
            "review_score": "1"
        },
        {
            "review_text": "Not worth over $30 considering all the content that's only accessible by buying the DLC. The options to select the content are built into the game menus but can only be picked if you pay an extra $30. I recently paid $20 for DLC for a free-to-play game with as much value and playability as OTC and felt like every dollar was worth it. These guys should include all that 'DLC' for the price they charge for the game.   OTC is a fun game for all skill levels. It has polished graphics and a dynamic economy. As mentioned elsewhere though, the games end far too quickly because opponents can buy each other out early. All of the game modes feel like this in some way. Whoever gets the early lead is likely to win while everyone else continues to play without a chance. That kills the fun a bit...  Also the game uses long lessons instead of in-game prompts to teach you to play, so don't expect to turn it on an start playing right away.  Now that the workshop is open, I'm sure a lot of cool mods are going to come out!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. It is incredibly hard to figure out on your own so I highly recommend watching a Twitch tutorial. You also want to learn with the pause button (space bar) pretty much constantly on. Good players can crush it in a couple of minutes so consider yourself warned.  I love that every choice can hurt you or help you in a logical way. If you build a dozen farms it will drive up the price on water to keep them going. If you sell goods cheaply they only get cheaper, so it is time to make something else. If you can see the impact of your actions you can manipulate the market in cool ways (e.g. using a robotics company that requires no water to create a water shortage can cripple your fleshy foes).   The AI is pretty good and it rarely makes outright terrible errors. This means that even the tutorials can be punishingly hard if you are not paying attention. The music is beautiful and the tempo builds as the match progresses giving you a real rush at the end.  Play it.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, not much content, but its the people you play with. I haven't bought the DLC yet So i dont know if there is much content in those either. I really recommend buying this game on sale, because $40 for this is way overpriced.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love this game... Growing up with MULE - this game fits the bill in a more modern tone.  I can see some ongoing game tweaks from the team to balance the play out, and address the negatives other players have voiced. Great game! I recommend this one.",
            "review_score": "1"
        },
        {
            "review_text": "Plenty of other reviewers have shared their two cents. I'll keep my review on the leaner side.  If you enjoy fluid, real time, dynamic strategy games you should consider Offworld Trading Company. There are no invading forces, no armies, no tanks. It's a about cunning and guile. Trying to read the market, trying to manage your company while discerning your opponents strategy. Skirmish games can be over relatively quickly (under an hour) and usually leave you wanting more. This is a nice change of pace from a game like Civilization where even on the shorter end of the spectrum games will last 2-3 hours. That said, I do love the Civilization series, which is part of the reason why I purchased this game.  In terms of learning curve - the game is easy to pick up, difficult to master. I say give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "Its a competive game where you rush to the victory.  For its price of 40 Euros its way overpriced.    ",
            "review_score": "-1"
        },
        {
            "review_text": "The graphics are excellent and the gameplay is great (so long as you like frantic and short), and replayability is the whole point. The soundtrack is neither bad nor inspiring.   So why the 'Not Recommended'?  What there is of this game is good, but I can't help but to think that other developers must be looking at it and thinking, 'Wait, people will review a game this well even though it's basically one scenario, without a campaign, over and over again, as long as that one scenario is *really* well polished?'   There just isn't enough game here to warrant a recommendation, especially not for $40. I think I paid $20 for it. It would be a good game a $9.99.   The game is not even very deep, contrary to what others have said. You get whatever your specific group needs to grow, and then you get whatever is rare, and you win. That's every single playthrough, each of which takes maybe 20 minutes. There is no story, no campaign, no reason to play any more than a few matches as each faction, which I have already done in a whopping 17 hours (according to Steam). This is technically a strategy game, but, since each playthrough starts from nothing, plays frantically, and ends quickly, it plays almost more like a board game with good graphics. It feels more like a mini-game from a AAA title than a game in and of itself.   On the plus side, I swear that's Jeffrey Combs (Weyoun from Star Trek Deep Space Nine, among other things) doing the various announcements, so there is that.",
            "review_score": "-1"
        },
        {
            "review_text": "This is an excellent little competitive multiplayer game. If you like thins like starcraft, civilization and grand strategy games, you're gonna love this one. The community is also incredibly friendly and responsive.",
            "review_score": "1"
        },
        {
            "review_text": "Fun strategy game - you can play clean or dirty if you choose. I am a big fan of the old game MULE from Ozark Sofware. This game is not really like it, but you can see the inspiration. (Not too mention - I bought a MULE from the black market and saw a reference to Dr. Bunten in the game - nice!) There is a market for goods, a black market, and different playable factions with different bonuses (and negatives I suppose). The commodity market is fun - my favorite was when the computer hacked a water shortage when I had a huge surplus. Oops :) If you like strategy games, give it a try. The games seem to last about 30-45 minutes each. I have only played the computer opponent. I will work my way up to humans (and probably get destroyed).",
            "review_score": "1"
        },
        {
            "review_text": "  A fantastic game. Great for people who enjoy taking an economic route to victory. Games have options to win with fighting or with other means, but this game lets you compete for who can win the more economic ways! A easy game to understand the basics and great for people whow ant to learn more. I am impressed at the single player mode and it is quite impressive and enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "unique gameplay, fresh and engaging but...  what's with the flawed music loop/dynamics? you guys are a COMPANY, right?",
            "review_score": "1"
        },
        {
            "review_text": "If you like: - using your brain  - sarcasm - tongue in cheek humour  - RTS  Thought it would be hard to learn, but the tutorials were very well done. Can't wait to play more.  Your conscience may hate you a little.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, hope they keep building on it, some more starting 'races' and more routes to victory would be nice",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't quite what I expected. I found the pacing to be uncomfortable to play at leisurely, and the economics very forced. Too much focus on playing the game 'right' instead of just being able to play for enjoyment. Good if you're a 'play to win how the game wants you to win' type. I expected more of a dynamic gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "It's like having a morphine addiction in space. You. Can't. Stop. Playing.",
            "review_score": "1"
        },
        {
            "review_text": "Basic RTS game except you can only build buildings. After dropping an HQ building down you can then put down resource collection and/or processing buildings. Once you build something you're stuck with that tile, so if you later decide you want to build something else you can't move to construct to another tile.    Like simcity the game features random events, most of the time they are beneficial like a solar flare increases the power production of solar panels. Other times resource shortages or excesses cause price fluctuations. some events don't make sense like the random auction for a tile no one has built on.      Game play basically boils down to finding the rarest resource on the map before anyone else, while tring to not get screwed by the overpowered almost infinite blackmarket attacks from the AI.",
            "review_score": "-1"
        },
        {
            "review_text": "Resource manager. As usual, the video makes it look cooler than it actually is. Graphics arent that good, gameplay is ok, but gets stale quickly. Not worth 40 bucks.",
            "review_score": "-1"
        },
        {
            "review_text": "I put in my time with this game and really enjoyed the tutorial missions. However, once you try against bots higher than 'newbie' level, the game becomes impossible.   This game also fails to be about economic competition, really. You are very handicapped in the information available to you so you can't really read the markets or predict other player's stances. The most powerful competitive edge given players in this game are special attacks you purchase from the black market. With these you can freeze their structures, blow them up, take them over, etc. That's where the most manipulation comes in. The game is really about breaking even then using sabotage to get the advantage.   I wanted to like this game but now I despise it. There also should be a turn based mode to remove the 'i can micro better than you' element that so many RTS games have. There's no reason why this couldn't be a fun turn based game it's set up perfectly for it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is deep, complex, and rewarding.  An RTS without weapons!*  This competitive, cut-throat economic battleground is a real gem. Gather resources, then refine them into more lucrative products, or sell the raw materials. Pick a strategy who's goal is to out-earn your competitors.  Grow, and expand, in order to buy out your competition.   * Traditional weapons... morality is subjective in this off-world capitalist simulator.",
            "review_score": "1"
        },
        {
            "review_text": "Innovative and fun. If you like RTS and management games, BUY THIS!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, super addictive",
            "review_score": "1"
        },
        {
            "review_text": "Not much depth to the game.  I've done my best to enjoy it, but its novelty wore out after 2hrs",
            "review_score": "-1"
        },
        {
            "review_text": "Very good game. Extremly challeging. I managed the campagne and the Manager level, but it is still difficulty. The Daily Challenge is very quick game. You are not ably to pauze it for a moment. So you have to be aware of your strategy and very fast with teh buttons. I played for hours but the game still triggers me.",
            "review_score": "1"
        },
        {
            "review_text": "Just completed the tutorial and got an honorary degree in economics.   10/10. would make Mars great again, again.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! The mechanics just work and it's a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game with clever mechanics that are somewhat new to RTS genre. I am still learning the ins and outs of it, but so far have been very impressed.",
            "review_score": "1"
        },
        {
            "review_text": "very very nice game",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game with clever mechanics that are somewhat new to RTS genre. I am still learning the ins and outs of it, but so far have been very impressed.",
            "review_score": "1"
        },
        {
            "review_text": "Waste of 60$.  Bought it thinking I'd get a good trading game, got a very clicky game that's annoying as hell to use - you determine production early on and then it's an annoying race to click sell everything or go into space to mass sell to miners (note: both very annoying things). Changing your claims is also very annoying.  Funny thing is, the MULE reference made me want to go and boot up my copy of that game and play that instead.",
            "review_score": "-1"
        },
        {
            "review_text": "I like it. Some really fun gameplay mechanics. I haven't seen many games like this before. 7.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "  I ♥♥♥♥ING LOVE THIS GAME AHHHHHHH",
            "review_score": "1"
        },
        {
            "review_text": "Great rethinking of a management game. Brings the economy aspect from big corporates into the genre in an interesting way. A must grab for strat/tycoon players.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and Really real!",
            "review_score": "1"
        },
        {
            "review_text": "While sure very interesting concept, not sure that it is worth the gigantic price. The game is very simple and I wouldn't say rewarding. It present the capitalism in all it's brutality and I am not sure if that is very entertaining.",
            "review_score": "-1"
        },
        {
            "review_text": "Not much replayability tbh.. Gets rather boring after a bit.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is wawy too expensive for what it brings. It is definetely a good game, that I would recommend for half the price, but currently there is not enough to justify buying it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks. Its just a space stock market game. Sure build alittle here and there.",
            "review_score": "-1"
        },
        {
            "review_text": "The AI is way too hard and does not scale well, if at all.",
            "review_score": "-1"
        },
        {
            "review_text": "Polished game with quality game mechanics, but I am disappointed in the use of Trump inspired quotes ('you'll get tired of winning', 'build a wall', etc.) is nauseating as he is dangerous to the world and should not be used to provide levity, or treated as if his statements or actions are appropriate in civilized society. Some younger gamers will play this and think his antics are playful and the source of mirth and jokes, without understanding the damages we will suffer from his policies and the lives that will be lost due to his actions.",
            "review_score": "1"
        },
        {
            "review_text": "I was looking forward to this game.  Call me cheap but I don't often spend more than $15 on a game, I wait till the bugs have been ironed out and usually till games I like go on sale or I can at least check out a demo.  Other than the GFX to me the essence of this game feels like a mobile game - I'm watching numbers on the left side of the screen and timing my plays accordingly.  I have not mastered this game, not even close. I can't see any patterns to the movement of the market and cannot successfully complete all of the Tutorial game missions (I've completed the tutorial).  I'm disappointed with this game. I expected some form of data analyisis to assist me in my decision making - I played Eve Online for a LONG time and played the markets successfully there, so I'm not an idiot.  I wish it was a deeper game that I could get into .. it's likely going into my 'games collecting dust' folder. :(",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth the price. A pretty simple game with not many products that can be created... Graphics are pretty bad too.",
            "review_score": "-1"
        },
        {
            "review_text": "Not much depth...just clicking and building, no real production chains...maybe will give it another try later.",
            "review_score": "-1"
        },
        {
            "review_text": "Should be more fun than it actually is. As usual, the developer 'thinks they knows best' when it xomes to determining how you are supposed to enjoy playing the game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a great Jewish take on Dune 2000!",
            "review_score": "1"
        },
        {
            "review_text": "i play this type of game often and never write reviews but this game was pretty bad. i hope that helps you in your decision on whether or not to buy it",
            "review_score": "-1"
        },
        {
            "review_text": "Very clever and entertaining space colony builder with an economic emphasis.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like managing resurces? Do you like being up to your eyeballs in paralysing debt? Like, you owe $5 and cannot take any steps towards changing that? Despite some promises made in the tutorial? Do you love never having enough of everything you need?  BUY THIS GAME.  I'm terrible at resource management.  10/10 would again sell absolutly everything at the last second to purchase a competetor who's about to purchase me.",
            "review_score": "1"
        },
        {
            "review_text": "I have enjoyed playing this game. There are a lot of complicated economic factors that require constant adjustment plus the use of subterfuge to increase your advantage. If you like the economics of RTS, but not the war, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "  I've come back to this game once I finally had some free time to figure out the rules.  It has the same sort of intricacies and complexity that I love about in Civilization except this game focuses more on victory&amp;domination by economical means rather than brute force. For that reason, I highly recommend this game to others.  As for multiplayer, it worked flawlessly when playing several games with a friend. Didn't have any issues with lag or latency.  I hope this game gets discovered by more players in the future and builds a solid community for the online component.",
            "review_score": "1"
        },
        {
            "review_text": "The game is unplayable currently for me. It's like that for many, according to the forums.   But not for everybody: My friend had bought it and showed it to me; It was running very well for him.   It's very well designed, but the FPS will be so low on some computers you will have to wait for your mouse cursor to move. Even some great gaming rigs are said not to run it fine.   You might want to just try it, and if your computer can't run it, use the refund immediatly.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. It is a Economic RTS that is similar to the U.S capitalism system. I love to learn about Finace and Business in the real world and this game is great for a time killer that fufills my interestes.  I love to pretend I am gordon gekko when I play as expansive.  A little pricy, so I got it on sale and I'd say it's worth $20.  I am trying to buy the dlc, but steam support won't let me :(       ",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this game if you have ♥♥♥♥ to do, because it will become your life.  Very detailed and high-quality RTS micromanagement economy game. Very fun. Has some very easy modes in case you're a newbie for RTS games like me.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun. I have not played it quite enough to get the full experience out of it yet but the first few hours are a good time. I can see how it could become repetitive and boring but if the developers add new (free) DLC content or content patches it could become a great game. The price is a bit high for its current amount of content however.",
            "review_score": "1"
        },
        {
            "review_text": "Played for hours, is an amazing game once you get the hang of it.",
            "review_score": "1"
        },
        {
            "review_text": "As a business major with four minors in accounting, economics, finance, and marketing you can imagine my excitement to find a game not only based in a futuristic sci-fi environment but also one of which where I get to use the spear of capitalism to pillage my competitors into the subsidiaries they were meant to be!! ...Anyway, excellent game, great detail when it oems to how markets actually function, if you are worried when reading the reviews saying it gets too tough and there is too much going on, those are the people that skipped the tutorial and went straight for the largest game mode possible. The game takes practice, skill, luck, and yet again, practice. This game obviously becomes more vastly complicated when playing against 7 other players and it rightly should be. My best advice to you, play the tutorial all the way through, and don't get discouraged when this game isn't a mindless clicker 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. My favorite game genre has always been RTS, but I've never played one quite like this. Truly an economic RTS.   The game is fun and every match will be a bit the same, although completely different as far as how the market shakes out.   I do wish there were a few big events or some kind of things that might add more variety from game to game. But still excellent.   ",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and intuitive, OTC is truly a successful and memorable take on the far too underexplored sub-genre of non-violent RTS.",
            "review_score": "1"
        },
        {
            "review_text": "A clever and addictive game!  This game is one of the most original strategy title I've seen in a very long while. It's like an Anno game on cocaine.   The single-player is fun, and the game has an amazing multiplayer potential!  Also, the soundtrack is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. Anyone who thinks there's not much to this game has clearly given up before uncovering the many nuances and variety of strategies. This is a thinking person's rts - which for me makes it one of the best rts games ever, because it doesn't come down to who can click faster - this game is about tactical and strategic decisions. I'm glad I didn't listen to the nay-sayers - this game is pure genius.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing since Early Access, and, despite a few issues the game had in the past, I liked it.  Now, after the final release, I can say I like the game more than ever before!  Its a fun little market simulator (buy low sell high kind of simulator), with some 'battle' elements (you 'fight' using dirty black market tricks, like hiring pirates, bribing people into giving you more land, making your stock price go up ect). The game is small but highly replayable.  There is a single player mode, consisting of: - campaign (special mode, consisting of several games) - single-map skirmish vs AI (you can configure it as you please, including AI difficulty, number of players, size of the map ect) - daily challenge (play vs AI under fixed conditions, there is a leader board, faster win - higher place)  And there's multiplayer mode which I never tried, but I believe its lots of fun. And very punishing to newbies, I believe, since this game is quite technical - you need to make right decisions fast.  Overall, I'd give this game 4/5 stars. Its nice little fun game to play, innovative in some ways. I like it.  I'm a big fan of economy sims in general, and there hasn't been many interesting games of this genre lately. Offworld Trading Company fits my tastes well, if a little sore on the difficulty side (AI gets on my nerves fast when it suddenly wins 3 games in a row). I still like it the way it is, though - if you play your cards right, you win.",
            "review_score": "1"
        },
        {
            "review_text": "Love them nice and short sessions of capitalism.",
            "review_score": "1"
        },
        {
            "review_text": "Neat game with interesting mechanics. It is prone to a heavy snowball effect, where if you get ahead early on it becomes easy to win on the difficulty I played at.  It was fun but I am done with it after one campaign playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "Novel game. Not too hard to pick up, although I'd recommend the tutorials, but will be very difficult to master from what I've seen so far. The games are short, which is nice, because I engage in capitalism IRL.   Seriously though, good concept, crisp, fast. When I first saw it, I thought, 'That looks like fun, but I don't want to sink another 10,000 hours into a Civ clone.' It's a RTS (which it is tagged as) but is unique. There is a lot to do and a great deal of strategy that goes into a win. Haven't tried multiplayer yet, but I have a feeling I'm not that good even though I crush the AI. I've played many, many RTS and turn-based strategy games and, after playing this one for a bit, can definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun but the learning curve is extremely steep.",
            "review_score": "1"
        },
        {
            "review_text": "A very good game to learn financial and micro/ macro economic knowledge. M&amp;A strategy too.",
            "review_score": "1"
        },
        {
            "review_text": "Update: New UI and other updates let me successfully play an entire game. I love it so far.   I love the premise and the start of this game (it does have a learning curve) but it keeps blue-screening my computer mid-game due to high CPU usage, so I can't experience the whole game. This results in a negative review.  I will update this if they fix their terrible CPU programming.",
            "review_score": "1"
        },
        {
            "review_text": "Though quite expensive, this game is very enjoyable. At first, I thought this wouldn't be that hard.  I've never been so wrong in my life.   This is one of the most strategic games I've ever played. I goal is to basically 'buy out' other players' companies, whilst expanding your own. Multiple resources need to be managed, you can sabotage players in different ways, and you can choose your desired company.  Overall, I would say this game is worth the money. You can play with your friends, too, which makes it even better!   I don't have friends.  ",
            "review_score": "1"
        },
        {
            "review_text": "The game is what i would call a 'Small MasterPiece'  Its a rare game to be honest. Its a bit diferent from other games as well.  You build your own Company and start building factories that bring in Resources so you can sell them, but you have to watch the market prices all the time since they go up and down.  Something Important that not even i knew when i first baught the game.  This game isnt a continues build company. Like for example you start a game (Single Player) and you build and build and create more and more. At least thats what i though in the begining. No.  This game is a PvP sort of game. You join a lobby wait for players to join in and then you start the game. What you have to do is build correctly your business, bring in necesary resources so you can upgrade your HQ so you can build more. Buy stock of other players which a player has 10 slots of stock. Buy 5 slots of stock and then you can buy all his company and throw him out of the game. Build what sells more. Watch your money rise. Be the last man standing and win.  Basically every match lasts a maximum 20 minutes. Its not a continues game and has no story. So if you are a person who wants a calm relaxing game that asks you to build a company by going around gatherind Resources to build and grow then you are at the wrong place.  I give the game as a game (9/10*) But since it has very little players and all you do mostly is play with AI Skyrmish im giving it an (8/10*) If it had more people for sure i would give it (9.5/10*) ",
            "review_score": "1"
        }
    ]
}