{
    "app_id": 271640,
    "name": "Humanity Asset",
    "release_date": "2014-02-20",
    "developer": [
        "Browny Application"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 38,
    "positive_ratings": 148,
    "negative_ratings": 314,
    "price": 1.69,
    "description": "Humanity Asset is a Metroid-style 3D platformer that pays homage to the traditional retro classic shoot ‘em up genre. Aliens have invaded Earth to strip the planet of its resources, to save their own dying planet. As in all classic shoot 'em ups, only you can save the day - now there’s a surprise!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/271640/header.jpg?t=1447359996",
    "minimum_requirements": "OS: Windows XP/7/8 Processor: Core 2 Duo E4300 1.8GHz Memory: 512 MB RAM Graphics: GeForce 6600 DirectX: Version 9.0c Storage: 1 GB available space Sound Card: DirectX Compatible Sound Card Additional Notes: Shader model 2.0",
    "recommended_requirements": "OS: Windows XP/7/8 Processor: Core 2 Duo E4700 2.6GHz Memory: 1 GB RAM Graphics: GeForce 7800 GT DirectX: Version 9.0c Storage: 1 GB available space Sound Card: DirectX Compatible Sound Card Additional Notes: Shader model 2.0",
    "reviews": [
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting game from a certain point of view. I enjoyed playing it, does have a special graphic and great game mechanics, the overall sound is good. Keeps you entertained and satisfied.",
            "review_score": "1"
        },
        {
            "review_text": "[WARNING: DO NOT READ OTHER REVIEWS. THEY DO NOT KNOW WHAT THEY ARE TALKING ABOUT]   Humanity Asset   A game where you can fully explore a vast 2-D landscape as an   Orange Alien   trying to take over   Earth  . Now I don't really want to get  too  into the game since there would be alot of spoilers. You have a vast arsenal of weapons: Miniguns, Lasers, Shotguns, Machineguns, and even a little cute A.I. that follows you around. With great A.I. and the graphics that are astounding( For a 10$ game of course! ), its a good, even great attempt at a  metroid-vania game!   Pros  -Gameplay: Astounding. Shooting polygons felt so right as the massive weaponry I could use made it one of my all time favourite game. Even a classic!  -Soundtrack: So good that it's even my ringtone!          YouTube™ Video:  Humanity Asset OST Stage 0&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I was already seriously underwhelmed by the time I got out of the ship and when I went for the first level of actual gameplay.... oh boy it's total garbage guys.... definitely not worth a buy, a play or a look.  GTFO and play something better, like pretty much any other game on steam. It blows that hard.",
            "review_score": "-1"
        },
        {
            "review_text": "This is game is so bad that i wish i can delete it from my steam account!. At least it was free on indiegala but indie developers please stop doing ♥♥♥♥ games on steam. I don't get it...",
            "review_score": "-1"
        },
        {
            "review_text": "Got it for free in a giveaway A very mediocre metroidvania Not reccomended because this game isn't worth money",
            "review_score": "-1"
        },
        {
            "review_text": "This game is completely bad. Level design, music and gameplay are ruined. More than that it's buggy. Just avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "Humanity Asset is one of the greatest games of all times. In fact, it is like Skyrim, but more Sci-Fi looking and bringing back the 2D nostalgia. Wait, you didn't have a 2D nostalgia? No worries, because you're still going to have one if you stop playing this game for a while. It has super cool graphics that is better than even the latest Call of Duty. . .what was it again? I don't know, they release many Call of Duty titles lately. And even the 2D graphics are so polished and the HUD is so clean, it will make Team Fortress 2 HUD mods nothing compared to it!!! Hmm, anyways. . .the gameplay is amazing! You totally need to check that out! Walk around and adventure in multiplayer without having to hear raging people mocking you and with the endless possibilities of: 1. Shooting 2. Shooting 3. Shooting 5. Shooting WHAT MORE COULD YOU WANT? This game gives you so much freedom, but it also chooses to FOCUS ON MORE STUFF. IT TEACHES YOU LIFE!!! You ever wondered why Hitler commited suicide? This game will tell you why (and will probably make you commit suicide yourself)! And oh boy, it teached me the greatest lesson of all time:  TO NEVER F*CKIN' PLAY THIS GAME. EVER.",
            "review_score": "-1"
        },
        {
            "review_text": "Might be one of the ugliest games I've ever played. The UV mapping of assets makes me think they too pre-UV'd boxes and just distorted them without unfolding afterwards. The character design, animations, gameplay are uninspired. It's like the developer learned the engine but was unwilling to learn the tools needed to make assets. The level design sucks too.  Sad, because the game somewhat has potential.",
            "review_score": "-1"
        },
        {
            "review_text": "What. The. Hell. Is. That.  Strange looking menu, animations, strange music. When i ran it for first time, i had no idea what to do. When i found a weapon lying on the ground, i was unable to switch to it - didn't know how. Oh, and that inventory? Never seen anything more unlogical than this. I might get back to it in the future, if i decide to torture myself.",
            "review_score": "-1"
        },
        {
            "review_text": "Sucks. What everyone has been saying is true. Some of worst graphics I have ever seen. Nonexistant story. Every gun shot looks the exact same and trouble telling the difference. The crafting/weapon part swapping system doesn't work and is worthless and confusing. The levels are boring and uninspired and the worst part of the game. You run around these giant levels with 20 different branching paths with no direction trying to find keys to run back to a prior part open a gate. Some sort of direction or information would prevent the backtracking and getting lost. The open-ness doesn't actually help and something more linear and less backtracking/confusing would be good. Also the enemies are pretty uninteresting. 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Not in this reality. Not for this cost. Not in this century. No. no.... nooooo...",
            "review_score": "-1"
        },
        {
            "review_text": "What a suck ♥♥♥ of a game. Its awesome name is the only good thing about it.",
            "review_score": "-1"
        },
        {
            "review_text": "How does a game that looks this bad have such a terrible framerate. Like yeesh. Even if you could get past that the gameplay is incredibly floaty and there are tons of bugs. Waste of your time.",
            "review_score": "-1"
        }
    ]
}