{
    "app_id": 271860,
    "name": "Super Killer Hornet: Resurrection",
    "release_date": "2014-02-05",
    "developer": [
        "Flump Studios"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Shoot 'Em Up",
        "Bullet Hell"
    ],
    "achievements": 0,
    "positive_ratings": 508,
    "negative_ratings": 278,
    "price": 3.99,
    "description": "'Things will explode, things will die, you will dodge, you will do maths...Yes maths!' Super Killer Hornet Resurrection is an intense vertical shooter with a brain train twist. Through the chaos and explosion try to answer the falling math problems to increase your multiplier and power up your ship.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/271860/header.jpg?t=1447360014",
    "minimum_requirements": "OS: Windows XP Processor: 1.2 Ghz Memory: 512 MB RAM Graphics: Shader Model 1.1 compatible graphics card DirectX: Version 9.0c Storage: 200 MB available space Sound Card: Windows media player must be installed to run game",
    "recommended_requirements": "OS: Windows 7 Processor: 3 Ghz Memory: 1 GB RAM Graphics: Shader Model 2.0 compatible graphics card Storage: 200 MB available space Sound Card: Windows media player must be installed to run game",
    "reviews": [
        {
            "review_text": "Cheap, fun and works with my hori rap vx sa stick. The simple math angle is interesting especially after a few beers. Also I like the music tracks, they are long and help you get in the zone.",
            "review_score": "1"
        },
        {
            "review_text": "SKH:R is a fantasiticly simple retro-style bullet hell game. While it may lack the polish of other games of this genre it still has a style that is reminiscent of the classics such as Raptor:Call of the Shadows. Would defintly reccomend for anyone who is interested.",
            "review_score": "1"
        },
        {
            "review_text": "Super Killer Hornet Resurrection is a fun and simple shoot em up arcade style game suitable for all ages. Your ship's attack power is based on how many maths equations you solve correctly. To solve them, you have to collect numbers whilst trying not to get hit and hitting other space ships with your gun.  This game is very simple indeed and the graphics are decent for it's 20th century arcade style system. The graphics can be optimized but there are very few options for them however, the game does not need optimization as everything looks fun and runs fine. Graphics: 8/10  This game has a total of 5 soundtracks and of those, the first one being a very hardcore rock song that makes you wanna blow some aliens up! You can change the song soundtrakcs by pressing T which is very relieving becuase as you go further and deeper in the levels, the song gets really repetitive and boring. All the songs are half pop-raps by some British guy. The shooting sound is very basic and sounds like what a normal Arcade shoot em up game in the 20th century sounds like. Sound: 7/10  Super Killer Hornet Resurrection is a super simple game and does not have a lot of development into it. Although each level has new mobs, spaceships and animation, it is still quite undevelopped. The levels are progressed too quickly and that leads to a problem when you start seeing old mobs and spaceships you have seen in the previous levels and the boss killing tactics are the same. A shootemup game needs to be quite developed and the levelling system needs to be alot more advanced that this. Development, levelling, gameplay: 6.5/10  Overall, this game is quite a fun game but really not worth its' price. There was not enough thought put into the game and once you have tried out all 3 different spaceships, heard all 5 sound tracks and played through repetitive levels, it gets extremely boring. This game should be at least $1.00 USD and not what it currently is. I enjoyed playing this game for the first few hours but after that, it was just plain. If you want to shoot up some stress, try another game like Metal Slug becuase i just don't feel this game.  Rating: 6.5/10 Tadlicated ",
            "review_score": "1"
        },
        {
            "review_text": "-Great shmup -Great music -Great gameplay  This is like Dodonpachi and Blue Wish, a true bullet hell shooter with a nice twist of math mixed in wich upgrades your weapons. It also has a 1cc mode without the math mixed in so just raw bullet hell game with one credit for the hardcore shmuppers. Different screen modes horizontal and vertical and you can manipulate the screen length and width manually and change the music track on the fly. This game works perfect with arcade stick or controller and is very responsive.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a interesting SHUMP. You fly vertically shooting enemies with two different attack modes whilst avoiding attacks that are like bullet hell games but there are not enough to be classified as that. Sounds like your usual game but to get upgrades for your weapons you have to solve maths problems. Every so often two numbers will fly down and then three answers will appear and you have to select the right one. If you choose the wrong one it will penalise your score when you finish the level.  The only problems I have with the game is its 640x480 game resolution and the music is trash to listen to after a while, not to mention it doesn't loop properly.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun.  It is a good game.  You better be quick with your math.  The soundtrack is awesome.    ",
            "review_score": "1"
        },
        {
            "review_text": "DonPachi and Math Blaster having an affair? I think Norman Lear had a mid 90's sitcom about this. It only lasted a few episodes. The game adaptation isn't bad though, better than the show.   Hell of a coup getting the creepy robot girl from Small Wonder to do the math quiz voice.",
            "review_score": "1"
        },
        {
            "review_text": "For 50 cents this game is great,i've played a lot of bullet hells and this one is ok.The music is music thats all i can say about it,as for the game cool bosses good control and a nice retro feel to it.",
            "review_score": "1"
        },
        {
            "review_text": "Nice and simple SHMUP until MATHS. As you're playing you build up maths questions, answering them correctly increases your firepower. Nutty concept and it works great. Tickles the brain. 10/10 would shop again A++++",
            "review_score": "1"
        },
        {
            "review_text": "Fun, also good retro looking game!  Imagine Space Invaders, but more modern and harder!",
            "review_score": "1"
        },
        {
            "review_text": "Good game to play :)",
            "review_score": "1"
        },
        {
            "review_text": "Bullet hell space-ship orientated game with a very loud soundtrack. Not terribly bad ",
            "review_score": "1"
        },
        {
            "review_text": "A very interesting and weird game. As you fly along, you solve math problems by picking up numbers and the outcome of the equivalation created with those numbers. It sounds crazy, and it feels like it, but it is fun. The game remininds be oon older games i used to play on my calculator, little spaceship arcade shooters. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Got this game for free, got cards, thats fine for me. To be honest, I've been playing this game for 10 minutes. This game is a way too traditional shmup, no particularities, and way too hard. I wont say anything really trash on the game, because I'd feel really bad for the developers. I dont know who they are but, instead of realeasing a crap game like this, im sure an additional 500 hours of work would make the game really good. Missing features:  -great graphics, more fonts, arial is a bit cheap -options menu -a resolution that goes higher than 800x600 -a decent checkpoints system -mouse support for the menu -an actual tutorial -badass sound effects -particles With all of this, this game could go ok  For now... well lets just say I'm not rating it bad because I didnt pay it.",
            "review_score": "1"
        },
        {
            "review_text": "cool game for shooting like arcade games",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad 'bullet hell' game at all, even has some decent music. Wanna play a shooter while doing first grade math? this is your game.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game because its just awesome and freaking hard, and hard is my option! and its just fun in my opinion! and some people say it is boring but think about a long time ago what people had in the older days, kind of like this. and its just a very fun entertaining game to me, and it does not have anything with math anymore only with the bonus pack! And i recommend buying this! but i would not say this is the best game so i would say 11/12 game  but still even though its not the best game its still a fun, it is not a waste a money and you should buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "NIce Soundtrack and wait for Trading Card 10/10 would hear soundtrack :D",
            "review_score": "1"
        },
        {
            "review_text": "Well, this game turns your lifetime experience upside down, you'll never be the same. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I expected a poorly made Dodonpachi clone and I have no idea what i got.  There's some obscure doujin games made to troll people like Kiwami Shooting that are far more polished than this game.  Not only the controls are awful (there's some crazy inertia/input lag going on here), but the presentation and gameplay are terrible.  The only redeemable factor about the game is that you power up by collecting flying numbers and then you solve a very simple math question with them... But there's so much stuff going on the screen that i doubt any kid would get any enjoyment from playing this specially as a math learning tool/game.  I have no idea what the devs were trying to do with this, but you shouldn't waste your time. I know the .99 cent price tag that this game gets on steam every week might seem pretty tempting (Aside from it being on 300 indie game bundles per month) but it's not worth it... Actually maybe if you're really drunk or high you could get some fun out of this, who knows.",
            "review_score": "-1"
        },
        {
            "review_text": "Not sure if the person who gifted me this was simply being generous or if he’s actually a sadist.",
            "review_score": "-1"
        },
        {
            "review_text": "Shovelware that only runs with WMP enabled.",
            "review_score": "-1"
        },
        {
            "review_text": "'Windows media player must be installed to run game' Got errors even with WMP installed.",
            "review_score": "-1"
        },
        {
            "review_text": "Buying this game is like throwing you're money in the water. Seriously modern mobile games are much MUCH more better than this game. Don't waste your time and money on this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Maxed out in ~2h. Go play Jamestown instead.",
            "review_score": "-1"
        },
        {
            "review_text": "  ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "MATH + SHOOTING..........  Funny, but not GOOD.",
            "review_score": "-1"
        },
        {
            "review_text": "3 Words : Worst Game Evar",
            "review_score": "-1"
        },
        {
            "review_text": "If you don't have a calculator close to you while playing this game you are doomed.  A cheap DoDonPachi with a cheap design and gameplay. We are in 2014, shoot'em up genre has evolved and this one is still in the prehistoric age. I find the movements too slow, the environment too homogenic, some monsters are really ugly designed with mspaint and the songs are unappropriated. So if you played DoDonPachi or any amazing japanese shmup game before, just go far away from this one.  Just when you know that bonuses give you math problems. Digits fall from monsters you're shooting at and give you a math problem you will need to answer correctly to increase your shooting rate but if you fail, you will be discounted by 2000 on your final score. *facepalm*  Plus, I don't know if it only happened to me but it seems that the game has a screen saver mode. After 10 minutes of gameplay the screen just shrinks and leaves you to a beautiful black screen.",
            "review_score": "-1"
        },
        {
            "review_text": "You do math and get exploded a lot.  .....I don't know what else to say.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't really like this game.  I won't say its a bad game, but I also won't say its a good one. Just a normal game. The thing I don't really like about it is the price; the game costs about $4.99, wich is pretty much if you know you can get games as YAZD (Yet Another Zombie Defense) or I, Zombie for only $1.99, and I think they are even better.  Conclusion: The game is OK, not bad, not super. But pretty expensive.",
            "review_score": "-1"
        }
    ]
}