{
    "app_id": 271820,
    "name": "Card City Nights",
    "release_date": "2014-02-14",
    "developer": [
        "Ludosity"
    ],
    "publisher": [
        "Ludosity"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Card Game",
        "Indie",
        "Trading Card Game"
    ],
    "achievements": 8,
    "positive_ratings": 744,
    "negative_ratings": 81,
    "price": 3.99,
    "description": "Card City Nights is not a traditional card-trading game. It's an adventure game with zany characters to meet and weird locations to explore. In the center is our new card battle system that breaks away from the fantasy TCG mold with connecting cards to form combos.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/271820/header.jpg?t=1478536856",
    "minimum_requirements": "OS: Windows XP Processor: 2 GHz Memory: 1 GB RAM Graphics: Shader Model 2",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Nice plot, funny jokes, interesting strategies, awesome characters and various cards remind me of Yu-Gi-Oh! Absolutely recommendable!",
            "review_score": "1"
        },
        {
            "review_text": "This game based on simple rules, so it easy to learn and hard to pro at the same time. I'm the biggest fan of Yu-Gi-Oh and I can tell you that if you enjoy with Yu-Gi-Oh, you'll enjoy with this game too.",
            "review_score": "1"
        },
        {
            "review_text": "Decent card mechanics framed in a comedy setting. If you like other TCG/CCGs this game might be too basic for you, but it still offers good entertainment for the low, affordable price :)  However. There are more than one way to win in this game, it offers a few different strategies and how you play it out can change quickly, which makes it an interesting game!  You get into the gameplay quite easily &amp; quickly, the tutorial was short but covered everything I needed to know about the basics of the game.  Eventually new cards are introduced with more 'advanced' abilities, but the core mechanics/gameplay remains the same and doesn't change the game that much as a whole.  The game features deck building with up to 6 custom decks, as in other TCG/CCGs you have a library of cards that you earn from battles or purchase from the in-game shop. You get to choose from these cards to form decks that you bring into battles later on. The lack of filters in the library is a bit annoying, but there's not too many cards so it's acceptable.  Unfortunately it doesn't seem to be possible to purchase booster packs, depriving you of the suspension &amp; kick that it is to rip open a new booster ;)  It seems to be a mobile game that has been ported to PC (Unity3D) which is obvious in some of the UI choices, this is probably related to the input lag as well as UI lag that occurs frequently.",
            "review_score": "1"
        },
        {
            "review_text": " Card City Nights  is a deck-building game somewhere between classic trading card games and Final Fantasy VIII's Triple Triad.  While the basic rules are fairly simple, the combo system adds some depth and planning. Mechanics like rotation, combo procs and multiple winning conditions let you build varied decks with wildly different strategies.   Tons of familiar card motifs and cameos are a bonus for fans of Ittle Dew, Iji, MURI and other Ludosity-related games.  The AI is fairly bad at reacting to the player, but the story enemies' decks and basic strategies are good enough to pose a challenge. Multiplayer is on the way.",
            "review_score": "1"
        },
        {
            "review_text": "I picked this game up because I love trading card games. I've played a lot of YU-GI-OH back in the day and quite a lot of Magic the gathering and I'm familiar with a few other TCG's like Pokémon and Duelmonsters and this game is really cheap. I'll admit right away that I didn't really like the game because this card game is not my cup of tea but I can imagine there are a lot of TCG fans out there that will like it.  The game pretty much is a card game, you battle opponents, gain boosterpacks to change your deck and earn money to buy cards so you can take on stronger opponents. The game does have a storyline, all I know about it is that you have to collect the 8 legendary cards by defeating the holders of those cards so you can take on the champion of the game, but it's a card game so no need for a fancy story there anyway.  Its kinda hard to explain how the card game works so it might be better looking up some gameplay videos but I'm gonna try anyway. Both players start with 7 shields (hp). You win the game if your opponent drops to 0 shields or if he can't play anymore cards. The playingfield consists of 3 by 3 spaces where you can play your cards, the goal is to create a combo of 3 cards and that will trigger a certain effect based on the types of the cards used in the combo which I'll explain later on. You must play one card a turn and you cannot remove any of the cards on the playingfield so if you donnot make combinations you'll run out of spaces and lose the game.  There are 4 types of cards: defensive, offensive, revive and neutral. If you make a combination using 3 defensive cards you gain 3 shields, if you make a combination using 3 offensive cards you can deal 3 damage to the shields of your opponent or disable one of his cards on the playingfield, if a card is disabled it cannot be used for combinations and it just stays on the playingfield. Use a combination of 3 revive cards and you can re-enable a disabled card and neutral cards don't have any effect and are just used for making combinations. The way combinations are made is rather interesting. You can combine all 4 types of cards in the combinations, for example you can use 2 offensive cards and 1 defensive card in a combination, but ony one effect can happen based on the most cards of a single type within the combination so that means this combo does damage but does not give you additional shields and because there are only 2 offensive cards in the combo it only does 2 damage. The position of the cards on the playingfield also plays a role, the playingfield consists of 3 by 3 spaces and there are arrows on every card indicating in what directions they can make combo's, for example you place a card in the centre of the playingfield and it has 2 arrows, 1 pointing up and 1 pointing left. That means it can only make a combination with cards placed above or on the left of this card if however that card also has an arrow pointing towards it. I hope that kind of explained how the game works.  The reason why I give the game a recomendation is because the card game is solid and I cannot deny that. Because it wasn't my cup of tea doesn't mean I cannot recomend it to others especially because it's cheap and solid. I won't give it a rating though because I would give it a low rating because there wasn't much fun to be had for me personally and I rate games based on the fun factor. If you like TCG's you should definitely try it because there is a fair chance you will like it and it's only 4 bucks (if not on sale). They're practicly giving it away.",
            "review_score": "1"
        },
        {
            "review_text": "Great little game, reasonably short but has a surprisingly large amount of depth in the card play. Coming from a MTG background some of the mechanics are really interesting and you can customize your decks to do wacky and crazy things. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Seems similar to the Triple Triad card game in Final Fantasy 8 with Magic The Gathering style deck building",
            "review_score": "1"
        },
        {
            "review_text": "Video Review here:         YouTube™ Video:  TWT - Card City Nights Review&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "OK, I'm digging this little game. Cute graphics, fun &amp; simple game mechanic (plus plenty to suit any collector fetish), and the music is funky, but where this really shines is the writing. Make sure to exhaust every character's dialogue! I can think of nothing to complain about, at this price it's a steal, I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game, if a bit unbalanced. It starts quite difficult when you have to face opponents with well-built decks following established strategies, while your deck is made of whatever trash cards you could get. But when you can customize your deck, it gets easier and easier, and once you get the legendary card 'Ittle Dew DX' you've pretty much finished the game.  The balance isn't that deep. I started with a balanced attack/defense game, but it's much more effective to go all-out attack (fun) or defense to stall until the opponent doesn't have any cards left (lame and tedious). Not much replayability, but I had 5 fun hours and they were worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "First i want to say that i am not a fan of the genre and i bought this game because it was cheap. But i can't say that i was disappointed. I don`t know if i can recommend this game to hardcore card gamers, but if you`re a casual like me i think you may give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "It's a very simple card game: Lay and link 3 cards in your 3x3 grid to do damage, bring up your defense, or revive cards disabled by your opponent, with the goal of bringing your opponent down to 0 defense or eliminating their ability to play a card. All the usual tricks and tropes of collectible card games appear within a new construct for the dueling players format. Fans of popular indie games will enjoy all the references the story and cards have, especially those familiar with Ittle Dew. Purely single-player for the moment, and the AI is on the easy side for those looking a challenge, but the game itself is relaxing, refreshing, and straightforward. Definitely worth picking up for card game fans and newbies.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, but a bit too casual. I only lost 2 matches, because the starting deck can only take you so far (I went about half way through the game with it.) But, once you make you own decks, with a consistant theme, it's a cake walk.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game that reminds me a lot of 'Triple Triad' from Final Fantasy 8. Each card has a couple arrows on it, and you need to match at least 3 arrows to connect to create a combo, and the first to do 7 damage wins. Simple, yet enjoyable. Definitely worth the $2 it is right now, but would probably still be worth full price.",
            "review_score": "1"
        },
        {
            "review_text": "very smart card game. definitly worth the price if you are wondering about it.  Check it out",
            "review_score": "1"
        },
        {
            "review_text": "Bought while on sale. Highest value $2 I've spent in a long time. Simple enough to be pick-up-and-play, but not so simple that it's trivial. The main storyline will get you about 4-6 hours of gameplay, and the postgame looks like it'll be another 1-2 hours. It's short, but at the price of $4 standard, it's well worth the cost of entry.",
            "review_score": "1"
        },
        {
            "review_text": "Casual card game, I love the humor side in it... simple and so much fun.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little card game, great mechanics :) definitely worth giving a go!",
            "review_score": "1"
        },
        {
            "review_text": "Card City Nights is a lighthearted and simple card game. It reminds me a bit of the Final Fantasy 8 card mini-game. You and your opponent place cards on a 3x3 grid. You link your cards together via connecting arrows and, depending on the card effects and icons, can either attack your opponent''s health, disable their cards, increase your own health, or revive your own cards (for the most part.) You build your own card deck and unlock new cards as you go. The AI is pretty mediocre. It's enjoyable enough, but really would need another couple game mechanics and a better AI to really shine.  (Minor spoiler) The biggest negative I have against the game comes at the very end - the final boss is deliberately unfair. They even say straight up that they don't have to follow the same rules as you do. Just because the game's AI is ♥♥♥♥ doesn't mean that it's fair to balance it by straight up cheating.",
            "review_score": "1"
        },
        {
            "review_text": "A remarkably fun card game that simply oozes character. The card game itself is fun and quite varied if you explore the different cards and their uses. Perhaps the final battle is a tiny bit too ramped up in difficulty, but otherwise a nice diversion if you're looking for something laid back and charming.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun card game despite the fact that you cannot play with another person. It is a game based on card placement and usage of space. It's puzzle-like qualities yet aggressive nature remind me of tetris attack from the SNES in a lot of ways. If you are interested in a card game that plays very differently than most, then I highly reccoment this game. Heck, I highly reccomend this game in general, I really enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "so great just so great and beauty",
            "review_score": "1"
        },
        {
            "review_text": "very nice card game for the price (no multiplayer, but I dont play computer TGC's online anyways! LOL) Think of it like magic the gathering but with ludicity characters (not really like MTG, it is a whole new play style).",
            "review_score": "1"
        },
        {
            "review_text": "A really nicely done card game that I picked up during the Humble Bundle. The initial mechanics sorta remind me of Final Fantasy 8's side card game, but there's a lot of strategy and detail under the surface here. Going after your opponents health versus going after your opponents field is a key factor into this: each strategy is viable and you may have to change it depending on the opponent. Each opponent feels unique enough, and it does feel like a real mind game against them. Those who love strategy will love this game.  For more first impressions and gameplay footage:         YouTube™ Video:  Let's Try: Card City Nights: Card Shenigans&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Very overlooked game IMO, does well for a card game, would play again....maybe....probably will",
            "review_score": "1"
        },
        {
            "review_text": "A good casual card game. Highly addictive. The AI is tough and has better cards. Once you get the hang of it, you'll spend hours playing it. The music is funky too.",
            "review_score": "1"
        },
        {
            "review_text": "Pokemon TCG for gameboy advance and cheap too!",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Under appreciated",
            "review_score": "1"
        },
        {
            "review_text": "This was a great Triad style game.  Thank you for the Linux version!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting little game.   I beat it in about 4 hours with no losses. I like the story, the characters and game itself is pretty cool.   It is not extremely difficult to learn but there is a learning curve and multiple ways to win or lose.   Nice job on it guys, I will be looking out for the next one. For $2.00 (less than a booster of actual cards) it is tons of fun.",
            "review_score": "1"
        },
        {
            "review_text": "There are a few games out there that have you roam an area, fighting all the card game player dudes you come across and winning their money and stuff. This is one of them, and it does the genre well.",
            "review_score": "1"
        },
        {
            "review_text": "As a fan of card games, I found myself pleasantly surprised by how much I enjoyed this game. It has a pretty interesting concept and although incredibly easy to win in the beginning, the difficulty does increase over time, which made the game more fun overall. The game itself is very simple with how it works, so if you are a fan of complex card games that require a lot of thinking, then you might not enjoy this game, but if you are looking for a simple and enjoyable card game that does not require a lot of thought, then this might be a good game for you to try out.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun little game ... I like the way the combos are done",
            "review_score": "1"
        },
        {
            "review_text": "Easy but enjoyable overall. If you like TCG's you'll enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "Very awesome game. Reminds me of one of my top 10 favorite games of all time: Pokemon Trading Card Game for Gameboy. Man, this brings back all that nostalgia of fine-tuning your deck as you face trainers who give you booster packs after beating them. So much fun!!",
            "review_score": "1"
        },
        {
            "review_text": "About 1 hour into the game while writing this review but I can honestly say I was quite surprised by how good this game actually is. The card mechanics are different from any card game I have ever played. As far as storyline and graphics are concerned, there isn't much to say but that isn't really why you come to playa digital card game. My chin is beginning to vibrate as I've spent too much time writing this review and I am clearly going through withdrawal from not playing Card City Nights. R8 8/8 M8",
            "review_score": "1"
        },
        {
            "review_text": "Easy but enjoyable overall. If you like TCG's you'll enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "If you like card games or board games, this is a fun quirky single player entry that has great deck building. It would never work as a multipler game, but finding ways to do broken things against the computer and using the multiple ways to win each match was a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Always looking for card battling games. At first i thought this was going to be a poor game because of the art work, but the game totally grows on you and turns out rather entertaining",
            "review_score": "1"
        },
        {
            "review_text": "A fast-paced, fun game at a reasonable price. Highly recommended! ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game with a unique spin on card battling. What might tick people off is the fact that there is no voice acting at all, which gives it a Visual Novel kind of vibe. But over-all, if you want a nice casual card game with some cool mechanics, you cant go wrong with this game. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. I play too much Dota2 and wanted to try something a bit more casual for once. This is by far the most charming, funny written, living world with engaging ♥♥♥♥ I've played in a looong time.  Try it out. Definitely worth if you like CCG:s and just want to fiddle.  Wish it had multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of my favorites. If you're a fan of Yu-Gi-Oh or Pokemon you might find this game a level higher than addicting. Even if you don't play the game I highly reccomend you listen to the soundtrack, there where times mid-music where I couldn't help but click along with the beat. The gameplay is near perfect while the cards that you use arn't broken and fairly balanced for the most part. There where some parts toward the end of the game where you had to really think about what kind of decks you where using, but I still enjoyed it through and through. The cards do get buffed/nerfed every few months and this is also a plus. You can also tell the developers of this game have a very clear perspective of what consumers want. Definetly one to buy when you've got a spare few bucks.",
            "review_score": "1"
        },
        {
            "review_text": "It's cute, has a goofy and self-aware sense of humor, and under it all lies a fairly deep and fun card battle game! Might be even more fun if they added the ability to play a game with your friends (even just local!), but just going through the story, trying to collect all the cards, works fine for me too. Anyone looking for a turn-based strategy game with a sense of humor and reasonably tough gameplay hidden under a shell of cute should give this a look.",
            "review_score": "1"
        },
        {
            "review_text": "I just bought this game yesterday, and already I've played it for 7 hours so far! So yes, I have to recommend this game for those who like casual puzzle games, solitaire games, or trading card games. I've never played 'Magic: The Gathering' or similar collectible card game, but 'Card City Nights' has a unique card-linking mechanic that appears to set this game apart from the other games.   The game has very pleasant cartoon-style imagery and pleasant-enough music and sound. The interface is easy to come to grips with, and the tutorial mode is reasonably effective in teaching you the basic gameplay mechanics. The story is pleasant and involving enough, providing the motivation to keep playing further.  If you’ve noticed, the key word I’m using to describe “Card City Nights” is “pleasant.” The basic card-game mechanic is challenging and fun, and I’m motivated to keep playing until I beat the game.   If you like “casual” games like “Bejewelled” or “Solitaire” or other such games, I think you’ll like this one, although it’s a bit more complicated due to the “card collecting” motif. “Card City Nights” is certainly a worthy game for anyone who likes casual games or “collectible card” games.",
            "review_score": "1"
        },
        {
            "review_text": "Brings me back to the old days of Final Fantasy 8 and the all popular card game and brings it into the new age of gaming! Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Brings me back to the old days of Final Fantasy 8 and the all popular card game and brings it into the new age of gaming! Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Card City Nights is a card collecting and battling game where you build a deck to defeat enemies, collect randomized card boosters, and improve your deck to take on tougher enemies. This genre of game is one of my favorites, as were Magic: the Gathering: Shandalar and Pokemon Trading Card Game for Game Boy Color. So few of these games are made nowadays that really, I'll take whatever I can get, so when I saw this game on sale for $2, I jumped on it.  In the card game, you place cards on a 3x3 grid. Link arrows on the cards to make combos, which can lock down your opponents cards, release your own, boost your life total, or hurt your opponent. You win by reducing your opponent to 0 or by making them unable to play by filling up their grid or depleting their deck. The nice thing is that the game is fairly elegant, and most of the game's strategies involve using relatively simple cards. The strategy in deck building comes from putting together a good theme and making sure you can get the arrows to line up properly. There are a lot of card with powerful abilities that are rendered near useless because they only have one arrow.  As for the rest of the game, it's clear that this game was meant to celebrate this developer's previous titles. The only one of those games I had played (or heard of) previously was the fairly good Zelda clone, Ittle Dew, so I got a few of the self-referential jokes. Even if you're not in on the references, though, and I doubt you will be, this game has a lot of goofy humor, between the bizarre characters and funny backgrounds. I thought the music in this game was fine, with the exception of one or two tracks thay annoyed me. The art style is very cartoony and drawn in very thick lines, and I think the graphics work well enough. I would have liked a few more choices for your avatar, though.  Overall, Card City Nights is a pretty solid card game and an amazing bargain at $4. If you enjoy collectible card games, then this is definitely worth picking up and playing for a few hours.  ",
            "review_score": "1"
        },
        {
            "review_text": "While not nearly as deep as more fleshed-out TCG, Card City Nights is still moderately inventive and plenty enjoyable - which is, frankly, more than enough, considering it will run you less than the cost of a booster pack of any actual printed card game.  Basically, if you liked the YGO portable card games, or any similar structure, CCN is worth it to check out and no hit to your wallet to do so.",
            "review_score": "1"
        },
        {
            "review_text": "A fun card game with an adventure mode that plays like the card game from Knights of the Old Republic and starres a very funny cartoon gang of characters. A very good game that is worth more than what their devs are asking for it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth more than the little money gold it costs you. (That's a promise!) It's easy to pick up and feels terrific. The gameplay flows, the sound design is neat, the music is beyond words, the effects let you deduce what's happening easily. All the characters are ones you may know from various games Ludosity made before in a completely different situation. (Most of those are free! Clicking 'more info' on a card will show you what game's characters it's based on.)  I got so many hours out of this even after the game and postgame were done, just from the sheer joy it brings me.",
            "review_score": "1"
        },
        {
            "review_text": "From start to finish you're only looking at a game that lasts 20 hours or so and that's with some grinding included. The good news is those twenty hours are exceptionally enjoyable. I'm not sure how much staying power this game will have but I can see playing it again to try to go for a 0 loss game with all the cards as a thing.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this is one of my favorite games of the year right here (I just found out about it this year so that's why). As someone who loved Yu-Gi-Oh! and dabbled in Magic The Gathering, I thought I'd give this a shot since it was only $2. When you start the game, you're thrown into a tutorial and it teaches you the unique way to battle. The way this game is different in how you battle is that not only do the cards matter, but where you place them matters even more. Each card has its own unique layout of arrows that you have to connect with other arrows on other cards, as well as matching the different card types (Attack, Defense, and Neutral). Using this, you go through the town and battle different unique and quirky people and work your way to the top.  The only thing I'm not that fond of in this game is there's really only one dominant strategy, and it's offense offense offense. I wish there were different ways to beat enemies, like milling or a defense-type thing. But even then, there is strategy in building your deck on how you should be offensive.  But all in all, the battle system is unique and the characters are fun to talk to and battle. Seriously, buy this game. Buy it for full price, because it's worth it. And if it's on sale, that's even more reason to buy it!  P.S. If you go on the 'Dollar per Hour of Gameplay' motto, I got it for $2 and it took me 8 to beat the game once and an additional 2 to do some of the post-game stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Funny game, low requisites Basically is like the final fantasy viii cards game, the worst part is that still there is no multiplayer and the ia may seem weak once you make a great great deck. Music deserves to be noted as good, you may hear the ost in the net. It really worths a shot.",
            "review_score": "1"
        },
        {
            "review_text": "A cool little card game. Unlike most games of it's genre, this one focuses on creating combos by putting the cards strategically through the 3x3 board. It has 190 cards, 3 types of combos, and different types of decks. You can try various strategies, but in the end you'll stick to the most effective. It has a good cast of NPC's, and the gameplay is kinda solid. Not great, but good. There's also some replay value, trying to collect all cards. It's a good game for it's asking price.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like to watch videos, read books or do other things when you play games? Then this is for you. Doesn't take too much time to put together a theme deck and when you play you only have to pay the minimum amount of attention. But if you want to put some extra effort together for something neat with your cards, you can do that.  The aesthetics are nice, the number of decks and characters are acceptable, and the plot is simple and digestible.",
            "review_score": "1"
        },
        {
            "review_text": "I'd say for 4 bucks it's a good game. Certain battles are challenging, the last one is massively frustrating. Overall I had fun.",
            "review_score": "1"
        },
        {
            "review_text": "Bit repetitive after a while but nevertheless good time waster with slight bit of strategy needed in deck creation.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly addictive.  This is one of those rare games where I knew I wanted to get 100% completion rate on it.  For those of you familiar with the Final Fantasies of the early 2000s, this game is a lot like the card mini game tetra master from FF8, FF9, or FF11.  If you've played Ittle Dew, you'll see some familiar characters here.  Basically gameplay takes place on 2 grids, one for you and one for your opponent, where you place the various cards you've collected. Each card has a set of directional arrows, and making a combo of at least 3 cards by connecting the arrows scores some points against the opponent.  There are offensive, defensive, and healing card types, as well as neutral card types which usually have some sort of ability when you place them in combo chains.  The goal is to reduce your opponent's points to 0 before they do the same for yours. Either that or force your opponent to fill up all 9 spaces on their grid and they won't be able to place any more cards and will lose.  It's a simple premise, but quite addicting trying to collect all the cards and win as many matches as you can with the decks you build.  Recommended if you enjoy some good casual strategery.",
            "review_score": "1"
        },
        {
            "review_text": "Ludosity has probably one of the most unique if overlooked voices in the independent gaming community, and Card City Nights is a hallmark of their own brand of weird on a classic trope; trading cards. Be it combat with an executive turnip person or duelings with a ghost or three, there are few digital card games that outright wants to have fun, in both execution and style. It never had me laughing out loud but the cartoonish surrealism and genuinely well crafted card play brought me back again and again.   The card play itself has more of a boardgame feel to it, with a 3x3 board both you and your opponent have free reign of placing down cards on. These opposing boards basically demand that you have preplanned combos in your deck, as the only person that really can determine if you're going to have the upper hand or not is you. While the decks are randomized, luck isn't really as much of a factor as it is a gameplan, which you'll probably have to change up often as you go into new battles with different variety of foes. 'Matching' cards is done through connecting the arrows each card possesses. There are eight points of contact in all; the angles and the sides. The majority of cards you collect will only have two or three arrows each, where special silver, gold, or platinum cards can vary from all 8 to just 1. Having cards that line up with each other is crucial, and demands a certain kind of forethought that you will build over the course of the game. It's far more complex than it sounds, and a variety of special abilities and different ways you can win makes the game an utterly fascinating breakaway from the usual fare.  Is there bull**** moves that even the computer abuses? Yes. Yes there are. Matches can go on forever, and when it follows a 2/3 game style, not knowing if your hardfought victory is going to happen twice is a horrible feeling, especially when what you fear comes true. While this does garuntee that even the easiest matches still demand some thought, the over all repetition can eat away at you near the end like it did me. I do love this game for what it is, but at the end the final couple fights feel downright unfair, and that's where the 2/3 deal often works at its worst. The experience as a whole was absolutely worth it, but who knows, you may grasp the rules better and stand a greater chance by the end of it.  While I haven't checked out Little Dew yet, I'm probably going to have to make that as one of my next stops. For the insanely cheap asking price of two bucks, CCN is of such insane quality that anyone would be hard pressed not to pick this bad boy up. Also, the soundtrack is wonderfully funky and fits the game perfectly. Don't miss out on this one if you can, and if you ever see this on sale? You have no excuse. Absolutely worth the buy.",
            "review_score": "1"
        },
        {
            "review_text": "Genre: Single-player collectible card-battling campaign Campaign length: 10 hours Game length: &lt; 10 minutes Length of campaign: ~ 100 games Difficulty level - normal (only difficulty) Complexity: Ages 10+  Card City Nights is an altered version of the 9-square mini-game from Final Fantasy VIII, except that in Card City Nights, it's the entire core of the game. Childish humor fills the game, as the main character goes on a quest to collect all 8 legendary cards from a variety of card masters. Defeating associates and assistants to the card masters in best of 3 or best of 5 collectible card matches, you collect enough cards by winning battles until you have an almost unbeatable deck. Cash dropped by these thugs give you money to buy more cards and more 9-square boards, until you have enough rare cards to absolutely mow these people down.   The mechanics of this game design are well thought-out. Excess cards can be recycled into card packs, preventing the player from collecting 10-20 of each common card in a never-ending quest to collect enough rares (cough Pokemon TCG for Nintendo's Gameboy cough.) In addition, there's a minor alchemy system to process cards that may not be affordable from the game's card store in the mall.   All an all, a moderate-speed economy system gets this game going. The delightful humor prevents the game from getting dull, and this is a must-play for card genre fanatics or older children. 5/5 stars.",
            "review_score": "1"
        },
        {
            "review_text": "A very innovative card game. I've seen nothing like it. 99% of the trading card games out there all share the same mechanics like the play area, card costs, attacks phases, etc. Card City Nights is unique in this respect in that its mechanics require a lot of thought into dueling and deck building, even when using the most basic of cards. Synergy is the only key in this game. A deck full of powerful cards that don't synergize is pretty much unplayable.  Absolutely worth it for its price.",
            "review_score": "1"
        },
        {
            "review_text": "+1",
            "review_score": "1"
        },
        {
            "review_text": "This game has cards that are strictly better than other cards. At some point in the game, you get into a situation where you need to grind for better cards by continuously re-battling opponents. If the card game felt super-awesomely fun, this would be perfectly acceptable, but it tends to feel more frustrating and anti-fun than I'd expect in a game. Some battles are best of three or even best of five, which is normal for how card games work, but just feels like kind of a repetitive slog.   This would be more fun as a mobile game (and it IS available on mobile platforms) where you're not sitting down and expecting a game to provide you with an evening of entertainment. As a desktop game, it's kind of lacking in the entertainment department when you look at all the other games you could be playing on PC that you can't play on a mobile device.  I'm not a big fan of most turn-based games for the PC, though (but I prefer it for mobile games). Usually, it's because they lack the level of excitement that you get from time constraints and developing reflexes and hand-eye coordination. This game certainly doesn't go the extra mile to buck that trend and provide a sense of excitement and engagement.  I like the art style, writing, and music. I just don't much care for sitting at my computer playing what feels like a mobile game. Also, I find the mechanics of the card game and the game in general to be frustrating, especially with cards that have random abilities, cards being strictly better than other cards, and having to grind to get better cards.",
            "review_score": "-1"
        },
        {
            "review_text": "Too few cards, poor AI, booooooring...",
            "review_score": "-1"
        },
        {
            "review_text": "I have changed my mind about this game, at first i thought that it was quite enjoyable and well worth the price but after playing it for over 3 hours i feel now that the game does get rather boring as later in the game instead of just having to face an opponent once to progress and get a booster pack you sometimes have to beat them 3 times which just gets rather boring.",
            "review_score": "-1"
        },
        {
            "review_text": "A poor game, with a simple and uninteresting game mechanic as its only claim to fame. I found there to be no motivation to progress through the game. Rather than sucking you in and making you want to find better cards like most *free* online card games, this game lost me in less than an hour.",
            "review_score": "-1"
        },
        {
            "review_text": "A competent but very flawed CCG that takes too many missteps for me to recommend it.  The core mechanic of stringing together combos is undercut by several cards like bombs, potions, and barriers that, in a single turn, can invalidate three or more turns' worth of effort. These broken cards are pointed out in a Community Guide.  As a result, few strategies appear to be meaningfully better than simply spamming disables to your opponent's cards and filling their board, so that they can't play a card. Because the game is single-player, there's no 'meta' as such, and this strategy works for &gt;95% of the game's opponents.  The lack of real strategy involved makes for a game that is occasionally amusing or satisfying, but largely dull.",
            "review_score": "-1"
        },
        {
            "review_text": "its trash only good for the cards this is as good as digital homicides games..",
            "review_score": "-1"
        }
    ]
}