{
    "app_id": 2720,
    "name": "ThreadSpace: Hyperbol",
    "release_date": "2007-07-12",
    "developer": [
        "Iocaine Studios"
    ],
    "publisher": [
        "Atari"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 31,
    "negative_ratings": 9,
    "price": 3.99,
    "description": "ThreadSpace: Hyperbol is an action-strategy game set in the distant future. Players battle each other on roads in space as they pilot massive ships capable of firing a wide variety of weapons. Create defenses, coordinate with your team, and launch an assault against your opponents to achieve victory!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/2720/header.jpg?t=1447351073",
    "minimum_requirements": "Windows 2000/XP/Vista, DirectX9.0c or higher, Graphics Accelerator with 32-bit color support (DirectX9-Supported Accelerator recommended), 1.0GHz or faster processor, 256MB of RAM, 400MB of hard disk space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I havn't played this game to it's full extent yet but even though I was only able to play skirmish mode (due to lack of players being online), I still love this game.  I wish I played it back in it's heydey because the concept behind this is awesome. Multiple players on the same team are able to have different vehicles. Each vehicle has a moving/shooting/guarding sort of system. You can upgrade these systems accordingly right at the beginning or throughout the game. Careful though, when you do die you do have to upgrade your system again. Right click enables the aim, left click shoots, and space engages the weapon/defense at your will. You can move as you shoot, however moving is done in increments and there is a 'slow refill gas' gauge indicating after moving that a certain amount of time is needed to recover and move again. Shooting is made easier by pressing the number 1 to scroll quicker through the weapons.   If this game is on sale BUY IT! This is a game I'd hate to see be called a graveyard as it isn't because there is a lot here.   PM me if you have this game and want to play!  (Also join the group)!    Rating : 7.5/10       Gameplay   B+     Story / Campaign   N/A     Visuals / User Interface   B-     Sounds / Music   C+     Replay-ability   B-     Overall    B-       ScreenShots :",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played this game but I think it is ♥♥♥♥♥♥. 1/10",
            "review_score": "1"
        },
        {
            "review_text": "I was an early supporter of this game and paid a thick price, but its community died pretty quickly. There's no real single player content here, and the AI is pretty bad. It's sad, because it's a very original game, well made, has a great soundtrack, and the online play was perfect. Think tanks in space, on a huge air hockey table. That might get you halfway to a proper idea of what the game is about. If you could get some friends to play with you online or over LAN, you'll have fun. Otherwise, unfortunately, pass.",
            "review_score": "-1"
        }
    ]
}