{
    "app_id": 272470,
    "name": "The Incredible Adventures of Van Helsing II",
    "release_date": "2014-06-13",
    "developer": [
        "NeocoreGames"
    ],
    "publisher": [
        "NeocoreGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "Adventure"
    ],
    "achievements": 63,
    "positive_ratings": 1233,
    "negative_ratings": 611,
    "price": 10.99,
    "description": "In the second part of the unfolding saga that could also be enjoyed independently, you can explore new corners of this unique world and experience the mix of old-school gothic and mad science, with more action, powerful foes and plenty of stunning places to visit.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/272470/header.jpg?t=1507544217",
    "minimum_requirements": "OS: Windows XP SP3, Windows 7, Windows 8 Processor: Dual Core CPU 2.0 GHz Memory: 2 GB RAM Graphics: GeForce 8800, Radeon HD4000, Intel HD4000 (min. 512 MB VRAM) DirectX: Version 9.0c Network: Broadband Internet connection Storage: 20 GB available space Sound Card: DirectX 9.0c compatible sound card",
    "recommended_requirements": "OS: Windows 7 (64 bit), Windows 8 (64 bit) Processor: Quad Core CPU 2.5 GHz Memory: 4 GB RAM Graphics: GeForce 560 or Radeon HD5800 DirectX: Version 11 Network: Broadband Internet connection Storage: 20 GB available space Sound Card: DirectX 9.0c compatible sound card",
    "reviews": [
        {
            "review_text": "After trying the beta, I am rather impressed and excited to play the official release later in May.  Soooo many new additional enchancements, skills and lots of (enjoyable and humourus) references...  Definitely worth purchasing this VH2 if you really enjoyed VH1.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG games ever. Pretty nostalgic since it reminds me Diablo. Great story, boss fights, variety of heroes and talent/skill builds, amazing environment, graphics, items and sets, healing and mana potions, awesome in every single way. And all the Easter Eggs you can find will make you smile. This is one of those must have games. Easy to beat once, but can you do it again with different hero and on hardest difficulty? Play and master it!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent follow up game to Part 1. Worth a 10 spot if you liked the first game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and a nice change from diablo. Doesnt take itself very seriously and has a few good laughs... Play it. You will like it.",
            "review_score": "1"
        },
        {
            "review_text": "Personal rating 8/10   A little fun game, a lot like diablo but it's way more friendly. I strongly recommend getting this if you enjoy diablo type of games. It has improved from the very first game on every aspect of the game. This game has a great value for the money.  Pros: Cracking jokes, references from other games or movies (such as batman sign in the sky or half life sign on the wall,star wars, alien and so on...you have to look out for those well worth it.) Good story took me 20 hours to beat the game, i wasn't rushing tho.  Simple controls, variaty of items to satisfy your builds. Visually looks very appealing for such a small game, it looks even better than diablo 3 in my opinion.   Cons: had a few crashes, that's the main reason why i didn't give this game a higher rating than 8/10.  Improvements? set items could get a small boost to the drop rate, fairly difficult to obtain a full set.",
            "review_score": "1"
        },
        {
            "review_text": "The second installment of Van Helsing's series has nothing more to offer than the first one. It still has all the requirement to fit every stereotype of the hack'n'slash: poor graphics, chaotic, slightly boring, flat protagonist, no real dialogue, repetitive to death. Clearly it is not genre I like that much. So, why am I playing it, and recommending it on top of that? Two main reasons, which are what really set Van Helsing apart from all the other games of its genre: the amazing atmosphere of its world, a charismatic mix of steampunk and gothic fantasy you cannot find anywhere else; and secondly, the quirky humour, filled with references to other famous brands. Honestly, in which other game can you loot a dead Grey Wizard, wielding a sword and a staff, lying in front of a broken bridge, in an underground cave?",
            "review_score": "1"
        },
        {
            "review_text": "If you love dungen crawlers. youll love this game. Not only do you slash monsters left and right. you look f**ken bad ♥♥♥ doing it. it has a good story and after playing this game, i feel like i have to buy the others. I love this game",
            "review_score": "1"
        },
        {
            "review_text": "Cool references. Can recommend it if you like pop-culture and Lovecraft references.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG ive played. Humor is good. Van Helsing 1 was pretty darn good. This is way better!",
            "review_score": "1"
        },
        {
            "review_text": "good game. i wanna continue.",
            "review_score": "1"
        },
        {
            "review_text": "i picked this up because it was one of the few on steam i didnt have in the action apg. let me start by saying it looks good game play is good. it has the right feel and alot of good things. the one big issue is this. they dont change the look of your player with the armor or cape. the skills are mostly passive , i liked that, boosts and other changing buffs. the story is ok not great, voice acting is good. skills are nice to look at but they dont seem to have that yes that hit feeling when you used them. you have active buffs that have no animation. its a mixed bag. no d2 or torchlight but worth the money mostly. it needs a few fixes to show changes to what your wearing or actively useing. the sounds for skills need to be changed some and load times need to be inproved. the load times may be my system. my only real problem is that the fact that the armor and skills dont show when changed. it bugs the hell out of me and makes me feel like im playing a game from 15 years ago in spite of the rest of the good things. if d2 could show this there is no reason of any game like it made after it shoule not .",
            "review_score": "1"
        },
        {
            "review_text": "Not nearly as cheeky and clever as the first game, but the gameplay is modestly improved. Some fun coop monster flood, well worth the purchase price on steam sale.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly i really like this game. I have played them all from Diablo 2-3 to PoE to Torchlight to anything else you can think off. This game sticks out more then any of those games and has alot of unique stuff to it that i am still discovering and has alot to offer to people who like build variety and loot.   Out of the 32 games i own on Steam this is my favorite. I am defintely supporting this game from now on.",
            "review_score": "1"
        },
        {
            "review_text": "Not only continues the storyline but adds some cool new features to an already great game.",
            "review_score": "1"
        },
        {
            "review_text": "I actually loved this game. I'd read all the bad reviews and wondered if I would, but playing it on my macbook I had very few issues. Sometimes it crashed Steam on startup, but the next time it'd would perfectly. It started to lag in the final scenes, but I turned some of the flashy stuff down and it worked perfectly. I was surprised I managed so long on my Macbook without having to.  Not having played the first game, I was a little confused at being thrown into a city scene at the beginning and have to figure out what was going on, but I managed. I played through it from level 1 and there were just so many options even once I clocked the game and reached level 32 there were so many more options I had not even got near to trying.   I started the game again on the higher level but got bored, same same just things are more difficult. So I ended it there. I look forward to going back and playing number 1 and then number 3.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome, most complain about the story but I never pay attention. I like the colors and action scenes just as good as the 1st one. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! - Reminecent of Diablo 3!",
            "review_score": "1"
        },
        {
            "review_text": "Best arpg since Diablo 2.",
            "review_score": "1"
        },
        {
            "review_text": "as good as the first one if not better. enjoyed the 1st so liking this one aswell. i like these sort of rpg games ie diablo, torchlight so forth. so no brainer for me bought it.",
            "review_score": "1"
        },
        {
            "review_text": "Just like the first version of Van Helsing this is one epic game and if not the best then at least one of the best co-op games made. It's sad that such a great game is crippled by network issues, would think they had learned from the first version by now and sorted it.  Solo score: 6/6 Multiplayer score: Currently not working good enough to rate!",
            "review_score": "1"
        },
        {
            "review_text": "Played the hell out of the first game. Loving this one even more. THe only thing I wish they would add is controlelr support. It may just be me, but I really liked playin the first game with my gamepad.",
            "review_score": "1"
        },
        {
            "review_text": "Better than the first one, and the first one was Awesome",
            "review_score": "1"
        },
        {
            "review_text": "This game has done everything right (great job Devs)! Everything Blizzard ♥♥♥♥ed up with Diablo 3 is better here. Van Helsing 2 is best thing that happened since Diablo 2, this game has humor, all stats you distribute are usefull (in diablo only 2 for each character matters...) and You spend points on your own. From start, you have a companion which you can easly set to be a tank or ranged dd, if you dont want a companion you set her to a ghostly ghost - so shes not fighting but insteed you gain some stats) Quests are fun to do, graphics are nice, dialogs are good... And the best part is - this game is 'player skill oriented' not 'item oriented (Diablo3)', so if you move arround you can dodge attacks, AoE damage and so on, there is no 'farm to move on' (anyone going for the 100th time act 1 diablo on inferno.. will know) And for end:  Story line is great. ",
            "review_score": "1"
        },
        {
            "review_text": "Just like the first version of Van Helsing this is one epic game and if not the best then at least one of the best co-op games made. It's sad that such a great game is crippled by network issues, would think they had learned from the first version by now and sorted it.  Solo score: 6/6 Multiplayer score: Currently not working good enough to rate!",
            "review_score": "1"
        },
        {
            "review_text": "A great sequal to the Van Helsing series!! This time more weapons, more monsters, more skills, level cap increased to 60, Lots and lots of quests and achievements!!! The story it self is really in depth, you are part of the resistance and you command an entire army!!! Long Live Le Resistance!! :D Haha Great game two thumbs up!! Must play the first all the way through to understand the story, but i really recommend this one!! If you love the first this one is BETTER!!! XD",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! - Reminecent of Diablo 3!",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "As good as other games of the series",
            "review_score": "1"
        },
        {
            "review_text": "very nice game",
            "review_score": "1"
        },
        {
            "review_text": "Another Awesome game, great graphics, great gameplay.!!  Well worth the money, and would recommend it to anyone.!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing story line and astonishing game play!",
            "review_score": "1"
        },
        {
            "review_text": "when I was playing this it was buggy it had the weapon upgrade system unfuctional it was a mess not been back since but wile was playing it even with its big probs couldn't help but like it the plot wile somewhat predictable was fun the setting did the job well the home base I hear anoyed some people but I realy liked it especaly sending out your minions and matching there skills with the job needs made you feel like you were in charge always nice note to self go back and complete first game if you like diablo stile games definatly worth checking out oh and the geek references come thick and fast and the humor I enjoyed",
            "review_score": "1"
        },
        {
            "review_text": "What a Wonderful game! If you at all like this type of game, you will love Vam Helsing. It is a fun little adventure with a great dumb story and fun charaters. I would recommend this game to everyone because it is just plain fun.",
            "review_score": "1"
        },
        {
            "review_text": "always been a good game best single action rpg at good price",
            "review_score": "1"
        },
        {
            "review_text": "how do you play the normal mode that start at level 1",
            "review_score": "1"
        },
        {
            "review_text": "Very good RPG game but low graphic main in spell and fighting...",
            "review_score": "1"
        },
        {
            "review_text": "Very good, underestimated, wisely rounded top-down RPG.  *Spoiler-Alert!* You are not only going to meet R2D2 with a message from Princess Leia, you can also encounter the mystical Jack The Ripper and send him to hell.  You will fight against a machinery out of Soldiers, Giant Mutants, Robotspiders (!damn you robotic spiders!), Giant Tarantulas and more..  As a lover of TopDown RPG Worlds like Titan Quest: IT, this was (like some british doodes would say) 'a good pennyworth.' I brougt the complete pack with the discount of 66%. And thanks to the frontline, that I've encountered this masterpiece!  Btw. you can also send your own soldiers to battles and let them handle the sidequests or you defend the tunnels in a minigame like TOWERDEFENSE. (Awesome btw. so i will add some !!! here)  All in All: Its worth every Penny I've spend on this game.   + Graphics + Camerashake and Explosions + Skilltree + Gimmix / Secrets (Like Batmansign :) + Tons of enemy's + Multiple way's to die and kill + Landscape + Minigames  - Story  Yes, the only Point is within the Story. Its .. pretty short. Within 20h of insane Gameplay would beat the Storyline   ( ) For the future I would like to see something like the involving of Steam Workshop and an extended Storyline. Or DLC ... or the third game ^^  Regards",
            "review_score": "1"
        },
        {
            "review_text": "great game and controller friendly",
            "review_score": "1"
        },
        {
            "review_text": "A decent evolution of the previous game - same great visuals and soundtrack. Still not quite up to par with the other more popular ARPG's in the economy/loot department, but fun to play nonetheless and packed with cool references to various films and games. The chimaera pet system and improved tower defence elements helped it find some uniquity.",
            "review_score": "1"
        },
        {
            "review_text": "This game quickly became one of my favorite guilty pleasures. As I play more, I laugh more and become more intrigued. This game is not short on references from the fantasy world and will leave you reminising the good times had. All in all its a well made game with a well written story with little bits and pieces of ectasy thrown in for good measure. A strongly recommended buy.",
            "review_score": "1"
        },
        {
            "review_text": "good game ,well played !",
            "review_score": "1"
        },
        {
            "review_text": "great game! love it....",
            "review_score": "1"
        },
        {
            "review_text": "74%",
            "review_score": "1"
        },
        {
            "review_text": "When I first heard of the Van Helsing ARPG I resisted buying it because I feared it was just going to be a lame movie tie-in game. After reading reviews, I decided to give the first game a shot. Surprisingly to me it turned out to be one of the better ARPG's released in the last several years.   This game continues where the last one left off. The gameplay is largely the same. The action is very good, the graphics and effects are high quality, and the writing is good, filled with amusing banter from Van Helsing and his ghostly companion, along with plenty of Easter Eggs and offbeat quests.   If you like Arpg's this one and its predecessor are both very good games. Frankly I like them both better than the new Diablo. In fact the only arpg's released in the last several years that I think are better are: Dragon Age Inquisition, Witcher 3, Path of Exile, Dark Souls II. I'd say this game is on a par with Diablo III or Torchlight II. Maybe not as massive as Torchlight II, but with better writing and story.   8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I liked the predecessor and I like this game. The basic skeleton of van Helsing 1 and 2 are remarkably similar and work well in both games. Also, I think they've kept the quirky humor and atmostphere pretty much intact. Most of the new additions I think add variety and a freshness to the experience. The so-called 'Tower Defense' missions work better this time, I think. The towers are more varied and pack a punch and combine in various interesting ways. Sending the generals on missions was fun too, though not very dramatic.  Pros: * Better graphics than the first and lots of much more interesting spell visuals * More varied due to lair upgrades * The chimera is useful * Loot optimized GUI: both I and II need to be complimented on the GUI. It allows in almost all circumstances the kinds of comparisons you need to do. For instance, it's just great to be able to shop, then open Helsing's character tab to check up on DPS or whatever. All the panels that open are clearly optimized and always show just the right information (very few exceptions - it's impossible to get the details with crittical hit chance, mana regen, etc. while shopping. * Nice new inventions in loot. Like the charged items, Ring of Guidance, etc.   Cons: * Short'ish game (but good replay nevertheless due to the different classes and builds possible) * Somewhat weak ending, but at least they're consistent as van Helsing 1 was like that too * Chimera needs to stop clawing at the invincible cat in the Lair (noisy, annoying) * The nice new inventions could've been polished off a bit. Like ... can I recharge an item? (dunno) * Just couldn't make Rune Crafting work. Seems I miss some essense capacity thingy ... no ideas how to buy or make one. Never inserted a rune in anything. Strange, since most of the game is so intuitive and simple * Forging. Yet another feature I never found any use for in either game. * ... and you don't even get to meet Vlados (like WTF)  Given the decent price it's a good buy, and if you like the genre and liked van Helsing 1 then this is a game worth buying. There's just enough new inventions to give it a familiar yet fresh feel. So it's a kind of 'polished van Helsing 1'. I think it'll fly this time, but the next installment should definitely do something extra to keep the attention of the fan base. For instance adding in some more choices and have those affect the story considerably (guys, it's not like you need to go all Witcher 2 on us, just throw us a bone relic...)",
            "review_score": "1"
        },
        {
            "review_text": "Finished in 7 houts. Missed many secret contents, while beating the game. But still quite fun.",
            "review_score": "1"
        },
        {
            "review_text": "Great Co-op game! :)",
            "review_score": "1"
        },
        {
            "review_text": "If you played Torchlight II or the first Van Helsing game, you should definitely play this.",
            "review_score": "1"
        },
        {
            "review_text": "Worth playing, kill monsters and get loot with some fun jokes here and there.  Be aware that the 64 bit client is buggy, either check the block in settings for run in 32 bit or rename the 32 bit client to the 64 bit exe.  I enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "I was positively surprised by the depth, novelty and quality of this game. I can actually say that this is the best rpg of this genre I've played until now, technically and gameplay wise better than diablo 3. Its main campaign lenght is relatively short though, but it has a generous amount of dlc to compensate. Great replayability. Awesome skill tree. Lots and lots of enemies at once. Formidable game. No actual shortcomings I can think of.",
            "review_score": "1"
        },
        {
            "review_text": "Van Helsing 2 continues and expands on the gameplay of its predecessor in predictable, but satisfying ways. Beginning with the ability to import a saved character from the first game, II delivers an additional thirty levels of experience, new items, skills, quests, tower defense levels, enemies, quests, and sarcastic retorts from the ghostly Lady Katerina. It is more linear then the first game, with fewer sidequests overall but more tower defense levels, and additional side mechanics that allow you to send out NPC captains to perform offscreen missions, rewarding you with additional gold and items, and an additional pet with customizable abilities. The equipment-modding obsessed can now alter their equipment in an additional way, via stat-increasing runes. While Van Helsing II treads ground already heavily traveled, it is nonetheless an excellent Diablolike and arguably a better singleplayer experience then many other titles in the genre, due in no small part to Van Helsing's both varied and powerful skillset. My hunter-class Van Helsing was capable of dealing extrordinary damage both to single targets and in an area, but was also very survivable thanks to a lot of lifesteal. The game is significantly easier on its normal difficulty then other titles in the genre, including the first Van Helsing, but offers two additional difficulty levels beyond that along with repeatable, randomized, high-level dungeons for the discerning munchkin. I will be proceeding directly to Van Helsing III and what I hope is a thrilling conclusion to the trilogy, and I will look forward greatly to Neocore's recently announced Warhammer 40,000 ARPG, Inquisitor - Martyr.",
            "review_score": "1"
        },
        {
            "review_text": "Cracking game, great fun, variety of character classes to replay as, adjustable difficulty. great fun great value!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Diablo clones ever developed. The second title changed a lot of gameplay and lost lots of love from fans for it. I still think it's worth to be played.",
            "review_score": "1"
        },
        {
            "review_text": "Grate fun game! Would recommend to anyone!",
            "review_score": "1"
        },
        {
            "review_text": "The design still beautiful and the music still well done. the story is more complex than the first game and some of the character are back. the introduction of new character made the game even better because they are very interest and complex in personality. the game play is still beautiful and you can tranfer your character from the previous game or make a new one. there are new skills and power up to try out and this make this game very playable.",
            "review_score": "1"
        },
        {
            "review_text": "When I first bought VH2, I had many of the same problems other people have mentioned with various glitches in the game, crashing to desktop repeatedly, etc. I left for a few months and came back, and it is now much more stable than earlier in the year. However, I still haven't enjoyed it. The wild spikes in difficulty were pretty frustrating. I would find myself going into a new area and having to constantly run while I heal up, after only being hit a few times. Aside from the weird jumps in difficulty, the gameplay on the whole just didn't really grab my attention. I wish I could be more constructive, but it's not anything I can put my finger on. I've thoroughly enjoyed the Diablo games, Torchlight, Dungeon Siege, but VH2 just felt very dry and wasn't for me.",
            "review_score": "-1"
        },
        {
            "review_text": "I reallly liked VH1. This is very much like the first one, but with a lot more BUGS. Game feels rushed. Co-op is a mess. Trading, zoning, even just inspecting in multiplayer has caused crashes.  The co-op connecting sometimes just decides to stop working with all the associated ports opened. I found a work-around is to set the password to just '1'.  The game is fun most of the time, but the bugs are close to game-breaking, escpecially in multiplayer mode. I can't recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is fun but I've crashed or my girlfriend has lagged out wayyyy too many times for even an indie game. I like the game but I'm not even sure we can finish it, because all it brings is frustration.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is advertised as featuring multiplayer.  It does not. Freezing, crashing, and afterimages of allies are the norm. Level-up intervals are incredibly short, requiring you stop and adjust abilities and attributes for the player and ghost pet far too frequently, and the additional reputation system merely adds to these breaks from play. The game is also incredibly RAM-intensive without particularly impressive graphics.",
            "review_score": "-1"
        },
        {
            "review_text": "This game would be so much fun, if the developers would fix the bugs, that are known for over a year. These bugs are not just minor, but also lead to a dead end that forces the player to quit playing the game. I played the first part, which was also full of bugs, but still playable and I was really looking forward to play this one, cause it's fun to play. But not like this. It's really a shame, that instead of fixing major bugs, the developers rather decided to make a third part.",
            "review_score": "-1"
        },
        {
            "review_text": "the game is to short for the price , u can complete the whole game and search every corner in like 4 hours ,  gameplay is nice",
            "review_score": "-1"
        },
        {
            "review_text": "Many bug, much annoyance, very headache.",
            "review_score": "-1"
        },
        {
            "review_text": "this game lags awfull, never had any troubles with the first version, but this version is just bad :(",
            "review_score": "-1"
        },
        {
            "review_text": "This game has some of the worst crashes that I have come across. Lengthy boss battles become incredibly frustrating for all the wrong reasons, you are constantly hoping to defeat whatever you are fighting to be able to save your progress before the game crashes.   Remember, it could be a beautiful table, but if one of the legs is shorter than the other, it's still a broken product, and no one would buy it in the store or recommend it. kinda pointless to discuss the merit of this game if it's still broken at its core.",
            "review_score": "-1"
        },
        {
            "review_text": "Its full of bugs. Crashes. Garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is full of bad design decisions, tedious bosses, clanky movement, few core mechanics poorly executed/completely useless, load times are frequent and needlessly long, the game looks decent but is poorly optimized and has a mediocre story with predictable twists. Only thing I'd recommend this game for is it's cheap price and funny references/secrets.",
            "review_score": "-1"
        },
        {
            "review_text": "this game sucks ♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Just like the last one buggy as hell, hope you have a mint pc if you get this -_- or maybe one with the right specs for this game &lt;_&lt; I'd recommend researching before your purchase.",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't think it was possible, but they made this game worse than the first one. Highly, HIGHLY overpiced. See my review of the first game... it's exactly the same.  Dear Developers,   FINISH THE GAME BEFORE YOU RELEASE IT. You have 3 games now and haven't fixed the first one... I hate you.",
            "review_score": "-1"
        },
        {
            "review_text": "It makes you realise how slick Diablo really is!",
            "review_score": "-1"
        },
        {
            "review_text": "Alright, but the game takes a couple hours to really pick up. The game has a couple good points, like the item crafting systems, and it is much better balanced than Torchlight 2, but it crashes every hour or two on my computer and there's no way to manually save, so the game involved a lot of repeating the same 30 minute segments.",
            "review_score": "-1"
        },
        {
            "review_text": "I want my money back/10",
            "review_score": "-1"
        },
        {
            "review_text": "Every time I start the game it crashes DO NOT BUY!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": ". . .",
            "review_score": "-1"
        },
        {
            "review_text": "Game is not optimized, with severe FPS and stuttering issues. It's a common issue reported by a lot of people, even those boasting mid-top rigs. Skimming the message boards, the developers insist they've fixed it, however it's kindof ridiculous that the problem keeps getting reported and nothing is being done. The common solution offered by most is to enter the install folder and start changing the files around, which doesn't work. Sorry, but it seems like another situation where a developer pumped out an 80% completed product, took the money, and ran.",
            "review_score": "-1"
        },
        {
            "review_text": "don't waste your time and money !! i think this game isn't good enough  - Very slow when loading (Just a small map) - Animation is not smooth - Special effect is normal  in my opinion Torchlight ,Path of Exile or Diablo is Better than this game anyway you can try by your own risk! :P",
            "review_score": "-1"
        },
        {
            "review_text": "Best to keep away from this game. It's too buggy and support is non-existant. I am at one point of the game where no matter what I do, the game crashes. I am unable to finish the game. Contacted Neocore Games and they did very little to try to help me then just ignored my follow-up e-mails.",
            "review_score": "-1"
        },
        {
            "review_text": "More like the buggy adventures of some guy I don't care about. Was this Diablo ripoff really made in 2014? Looks more like 2004. With a lack of character customization that I would expect from the GameCube era of video games.",
            "review_score": "-1"
        },
        {
            "review_text": "The game's graphics are beautiful, are similar to the first.  Not so easy to equip the character at the beginning of the game, it's hard to find weapons and equipment, the first half hour of the game is quite disastrous, plenty of action for those who are just starting the game. Who has not played Van Helsing 1, stay completely lost and frustrated.  In Van Helsing 1 was very uncomfortable with the scenes with extreme appeal of death, murder and lots of black magic involved, a lot of voodoo.  That seconde game is not difference, Van Helsing is required to interact with the voodoo to get ahead in your career.  Voodoo practices that are applied in our real world, it left me extremely disappointed with the game, because I have a spiritual life and these events are completely contrary to the teachings I follow.  I have an open mind for the game and life itself, but if you are a Christian as Im, will feel uncomfortable too.",
            "review_score": "-1"
        },
        {
            "review_text": "Those crashes are a pain. :-(((",
            "review_score": "-1"
        },
        {
            "review_text": "Coop is terrible, all bugs, nothing working. Waste of time",
            "review_score": "-1"
        },
        {
            "review_text": "I very much enjoy this game and the original. Both have a light-hearted and engaging gothic story.   I bought all DLC for both without second thought because of my enjoyment of them.  However issues arrose after the update wherein permanent ADVERTISEMENTS for an upcoming title were added to Van Helsing 2 and my Gamepad was no longer able to select skill upgrades for any skills more than halfway down the page. Also sometimes when using a gamepad the highlighted cursor would dissapear when upgrading or interacting with Katarina.  I posted about this issue on the technical support forum for the game on steam and received a response but nothing definitive or helpful. It has been many months since this update and I have attempted to replace my gamepad and it's drivers several times since them in order to see if it could somehow be on my end. In all situations the problem remains identical and only for this game.  Gamepad support is my primary reason for buying any game and I invested fully in this company because I believed that they would bring excellent gamepad support to this title. Instead they started with passable gamepad support and stripped it with a patch that added permanent advertisements.  I love this company and their games and have done everything in my power to find a solution that did not put this issue in their hands. Now I have no choice but to recommend that no one buy this game if they wish to use a gamepad.",
            "review_score": "-1"
        },
        {
            "review_text": "Buggy gameplay with constant crashes........I belive combat wouldn't be so slow-paced if there were any people playing.......multiplayer is deserted. That's a game I regret buying.",
            "review_score": "-1"
        },
        {
            "review_text": "Like I said in my review of the prequel, 'unplayable'. It may not crash when I let the cutscenes play like the previous game did (at least, not for the early ones), but it still crashes when I try to load it or exist out of it. And if it's not crashing, it's lagging or misinterpreting my clicks (just like the previous game). Just don't play it.",
            "review_score": "-1"
        },
        {
            "review_text": "Everything in this game takes too long , even the NPC takes way too long to talk , clearing maps takes way too long , the skill tree Boring ,I glad that I didnt bought this game through steam . the price of this game in steam overpriced for such a boring game espesically when you are trying to play it alone .",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed VH - it wasn't without flaws but I'd hoped the worst of them (difficulty spikes, poor upgrade tree, limited workable builds) would be solved here.  Sadly they're not - in fact in some ways this game is WORSE - there are more options and yet it feels like less of them are viable and the difficulty is the same rollercoaster of random nonsense.  Worse still, the design of the opening of the game (after the intro) is confusing and horrible. I was left with NO idea what was going-on and whilst replaying it kinda helped, it's not a great way to start.  Add that the game seems a bit slower to load (VH wasn't quick) and a bit more prone to crash and it's hard to recommend this game really.  If you liked the first - this doesn't nothing better and may in places be worse If you DIDN'T like the first - it's really, really unlikely this will change your mind :(",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes on startup unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "Those crashes are a pain. :-(((",
            "review_score": "-1"
        },
        {
            "review_text": "First of all, I have played Van Helsing 1 together with my friend and the bugs in the game wasn't too overwhelming to bring down my excitement. I completed VH1 right after I receive VH2 from Humble Bundle. To my surprise, it is totally unplayable. Game crashes a lot and there are moments where you get stuck in the game with no route to continue questing. The auras in the game are also a major disappointment. It won't work in a multiplayer game because if there are 2 players in the game, the player who enters the map first will override the other player.",
            "review_score": "-1"
        },
        {
            "review_text": "Very berry terrible game. I was so happy to see that there's a game dedicated to Van Helsing in a hack'n'slash style. But Co-Op does not work AT ALL. Like some other rewievs already say - broken beyond repair. And then those little ducks - that call themselves gamedevelopers release the third game.. I tried it - same ♥♥♥♥, different day. Lags, a lot of things don't work at all. skill tree looks almost identical.. and they want to charge 30 Euros you for it. Finish the work you started, please.   0/10. Will not buy from these DEVs anything every again.",
            "review_score": "-1"
        },
        {
            "review_text": " Pros:  - Graphics - Voice acting - Soundtrack   Cons:  - Everything else   Long version:  I was a great fan of the first game but unfortunately can't recommend this one. Not because it's more of the same (which it is, with some minor changes rather than improvements), that's what I expected. It's because even at casual difficulty the game is ridiculously hard from some point on due to an ever increasing number of over-powerful, infinitely-breeding enemies and there is nothing else in the game that would make it even slightly interesting. I believe that even an ARPG game should have at least a trivial story to it (like the first game did), but here there is basically no story at all. The merest scraps of some would-be-storytelling are hopelessly drowned in a constant flood of enemies. So the whole game boils down to just mad clicking, watching graphical effects and doing the same things over and over again. And to listening to dialogues between Van Helsing and Lady Katarina, of course, but even those begin to be a bit worn out after a while because there is simply nothing to reasonably talk about.  Where the first game excelled this one does a very poor job while adding nothing new. Not even the 'Prisoner Seven' character can save it for he is not as much mysterious as he is hollow.  I gave it a good chance, since I loved the first game, but after 4 hours of non-stop playing it didn't manage to impress me in the slightest. It 'tastes like a 10 times infused tea'.  The graphics are still great, so is the soundtrack and voice acting is just superb, but there's been plenty of that in the first game so not even this makes the game worth a purchase.  If you liked the first game, you'll do better to play it again and save your money.  If you can get this at sale price, you can give it a shot but don't expect much.",
            "review_score": "-1"
        }
    ]
}