{
    "app_id": 272600,
    "name": "Detective Grimoire",
    "release_date": "2014-08-18",
    "developer": [
        "SFB Games"
    ],
    "publisher": [
        "SFB Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Detective",
        "Indie"
    ],
    "achievements": 9,
    "positive_ratings": 1123,
    "negative_ratings": 62,
    "price": 5.19,
    "description": "Detective Grimoire has been called to investigate a murder. The owner of a small tourist attraction, found deep within the heart of the marshes, seemingly killed by the very mythical creature his attraction is based around...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/272600/header.jpg?t=1478693579",
    "minimum_requirements": "OS: Windows XP Processor: 2.33GHz or faster x86-compatible processor, or Intel Atom™ 1.6GHz or faster processor for netbook class devices Memory: 512 MB RAM Graphics: On-board graphics Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A very enjoyable point-and-click adventure in which you play the role of a detective investigating a murder case. The story is exciting and it simply keeps you captivated throughout the 2-3h of gameplay.  All the characters are well designed, interesting and full of surprises. Some of the dialogues are funny and witty, adding an extra flavor to this already nice game.  The few puzzles that you need to solve in order to progress through the story are rather basic (each can be solved in less than 1 minute), but the cute cartoonish graphics and the decent voice acting easily compensate for this.   More reviews on the  Lilly's Corner Curator page  ",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun point and click detective adventure. It is aimed at a younger audience but is fun for adults as well. The characters are cute and the storyline is engaging. The achievements are not too challenging and I was able to beat the game with 100% completion in 3 hours or so. This would also be a great game for those who speak English as a second language since it uses fairly basic English to tell the story and in its puzzles. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "A really nice point-and-click where you have to impersonate detective Grimoire, who has to solve an enigmatic murder in a quite mysterious and full of secrets swamp. The atmosphere is magical and fairytale-like, the stereotyped characters can be funny but also shady, the music is lovely; gameplay is simple: ask questions, show evidences, obtain informations, sign them as suspicious/not suspicious and finally deduce. Very recommended.",
            "review_score": "1"
        },
        {
            "review_text": "A delightful casual adventure game, very similar to Phoenix Wright. The game features good writing, funny characters, excellent voice acting and gorgeous background art, making it a very polished murder mystery.  Don't expect much challenge from this one, though : the puzzles solve themselves.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic little point and click detective game with charming art and music along with characters and locations you just cant help but want to find out about. It's well designed and written it's simply a joy to play through. The achievements are also incredibly easy to get if that is a selling point for some.  Overall a fantastic little game and a great way to spend 2-3 hours.",
            "review_score": "1"
        },
        {
            "review_text": "This captivatingly written 'basically just a flash game' detective adventure is well worth one play-through, which depending on your completionism obsession should take between an hour and half and an hour more. There's no reason to replay it.  Jolly, but don't pay anywhere near full price.",
            "review_score": "1"
        },
        {
            "review_text": "Detective Grimoire is a type of game I haven't played in a while: a mystery title and this one is excellent. The visual style and animation brings this generally small cast of characters to life and, along with the excellent voice acting, this game is very enjoyable for the entire 2.5 hour run I spent in it. The story is actually engaging and the setting is weird and mysterious, which is perfect for this mystery genre. I'm hoping to see more in this series and hopefully soon! Buy this game if you are looking for a great mystery title or story-based game to play for a few hours!",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic play! I've long been a fan of the Nancy Drew game series- point-and-click puzzle mysteries. I was so pleased to find another game that fit that description with equally great gameplay. The characters were such fun (I ship Sally + Grimoire and I'm not sorry) and the art was so lovely and unique. The voice acting was top-notch and the writing was excellent. Very happy with this purchase, especially at sale price.  I would suggest more difficult puzzles in the future, however. :)",
            "review_score": "1"
        },
        {
            "review_text": "A charming, little murder mystery game. It was fun, well-paced, and cute. It's quite odd to think of a murder mystery as being 'cute,' but the art style and overall design of the game was just too pleasant for it to be anything less.",
            "review_score": "1"
        },
        {
            "review_text": "Great adventure game. I got it cheap and it's definitely worth it. You can buy the game when it's on sale and I think you wouldn't regret it. At least I don't.   Also, there will be a sequel I think? If so I'd love to buy it when it's on Steam. ^^  ",
            "review_score": "1"
        },
        {
            "review_text": "Short Review:  A nice investigation 'point &amp; click' game with high quality voice acting behind it and very detail animations, with a very unique style that reminds of Professor Layton, Zelda Windwaker, and old-style cartoons of the 50s. If anything, the game lacks depth and it's rather too short, and the final part of the game is very disappointing since it does everything for you. Worth a check, considering the low price point.  Long Review:  Detective Grimoire is technically the second game of the series, with the first being released as a free flash game on their site (which is still pretty good in my opinion! Give it a check!). However, with this game they did a HUGE leap of quality, adding a ton of stuff that the original game didn't have, such as voice acting (A LOT of voice acting) better animation, different art style and more complex puzzles (but not as complex as they should be really).  Initially released for portables such as iPads and what not, I was anticipating this game for a long time, as I loved the original DG for being quite interesting, and the character is actually very likeable and very funny; what we have here is basically a port that didn't suffer from it and still maintains its core mechanics, such as the 'theory-maker' thingie.  If anything, the resolution cannot be changed, and the volume is at max by default: little nitpicks, so nothing to worry about.  The game itself is splendidly made: dialogues are fun to follow and don't drag too much, as they flow very fast and I rarely skipped the dialogues, since they were very interesting and very funny (especially Grimoire: he really tells a lot of stupid things. Oh, and they made the hat joke again!). The puzzles are ok, but just too easy to follow: the real challenge at times is the Theory-making part, since at times you'll put the wrong statement...but at the same time, it's a lot of fun to mess up those, making him say the dumbest thing ever. The game is fluid and has also animated cutscenes as well, and the characters are...okay, for the most part.  However, there are some issues in my opinion: for one, the story is good, but the last part is a joke: you do nothing at all when you catch the culprit, and that's a huge disappointment considering that the first game, a flash game, had a far more complicated part where you EVEN have to guess who did it. In here, he picks it up for you. The game is also too easy: you really can't fail anything at all, and as soon as you get your clues you can just spam them to the suspects and see their reaction...and Grimoire even tells you 'when it's time to go'. They also gave you the possibility to see if something is suspect or not on a culprit, but it's completely useless and serves no purpose: it's just there for letting you check your progress to catch the culprit. And let's face it, you'll guess who it is pretty soon.  I honestly hoped the game to be more intriguing: the art is amazing and the game is very fun, but the story behind is disappointing and lacks to be intriguing, which is a huge problem for me.  Still, I do recommend this game, because it's always good to have nice adventure games and the game is still VERY well done.  Avoid it if you don't care about investigation, reading, or point and click adventures in general.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game a lot! Not too long, just a couple of hours, but a pretty great point-and-click mystery. I wish it had been longer and perhaps a bit more involved, but overall worth the small amount of money spent.",
            "review_score": "1"
        },
        {
            "review_text": "A very charming point-and-click 'mystery' game.  Over the course of the game you learn about nine potential suspects (including the deceased) and meet a few helpful characters besides. The dialogue is succinct, humorous and well voice-acted -- I loved every voice in the game. The jokes are well-timed and the characters do not miss a boat. Beat.  The detective (Grimoire) keeps ample notes on objects, places, and items (with only the occasional misspelling), so that you do not spend time trying to find out about something you already know. Characters also (helpfully!) remember what you have asked them about -- greying out those choices so you do not find yourself repeating the same questions over and over. (Of course you CAN ask those questions again if you wish).  There are a few exceedingly simple puzzles scattered throughout the game. I do not think they add much, but they also do not detract much.   The mystery itself is ho-hum, but the journey of exploring and talking to the loveable cast of characters makes this game worth a look. I found myself smiling and laughing as I played, and I do not regret the purchase. Great for an evening's entertainment.",
            "review_score": "1"
        },
        {
            "review_text": "This is what a mystery solving game should be like. Collecting clues, solving puzzles, and using everything you've discovered to uncover the killer.  Granted, the game was a bit short, (beat the game and got all the achievements in under 4 hours) But I love everything about it; the animations are great, voices are perfect, and the soundtrack is enjoyable to listen to. Something I'd replay several times for sure, even if I do know all the answers.",
            "review_score": "1"
        },
        {
            "review_text": "I am new to this series and I must say I am enjoying it :) This game was quite fun and all the characters were so quirky ! It is a good buy :3 ",
            "review_score": "1"
        },
        {
            "review_text": "A good game overall.  Cons - Fairly short. 100% the game in about 3 hrs. Not as much mystery as I'd hoped Ends rather abruptly Story arc is shallow with no real climax Minigames seem infantile  Pros -  Voice acting is decent Interface is approachable Art style reminds me of Samurai Jack Characters are quirky Has a casual ambience.  Overall it's not the usual Point'n'Click. It's entertaining and has it's moments, but it doesn't offer the same kind of drama you'd expect from a murder mystery. I appreciated the value for what I payed, but would have been dissapointed if it was at it's regular price.",
            "review_score": "1"
        },
        {
            "review_text": "An undoubtedly entertaining and impressive point &amp; click mystery game! (Oh, I already miss the fun and adventure.)  The smart gameplay with tons of humor, leading-edge puzzles, gut-busting kind of narration with nifty voicing quality makes this game super-awesome (two thumbs up here!!!). All the characters are so adorable and the soundtracks are perfect especially for those lovers of mystification (whooaah!).  What I love the most about this game is that you’re playing as a detective (Detective Grimoire) who’s very keen in solving a murder case by a weird green creature (Boggy). The characters are like those in cartoon network due to its flamboyant style, environment, art, and graphics. Excellent interface! The puzzles are not that staggering and can be unlocked through common sense and comprehension as the game is progressing.   I would say that you should try this flashy game! As you meet various characters through playing the conundrum, clues and evidences will also be unveiled which will bring you up together the pieces and linking it with all that you’ve discovered to formulate judgment or conclusion. Sounds interesting, right? (Hehe!)  The only thing that I felt disappointed about is that the game was too short. I was expecting of a more story rich game especially with its great quality (waaaahh).  Overall, beautifully presented! I would surely RECOMMEND this game. It’s worth the play! Still waiting and hoping for its sequel and I might as well find and marry this indie developer (guy?! haha!). Seriously, one of my favorites!",
            "review_score": "1"
        },
        {
            "review_text": "Great style, puzzle, graphics. Great adventure game.",
            "review_score": "1"
        },
        {
            "review_text": "Short and simple, but very well crafted adventure game. Unpredictable and entertaining story line. Great fun for one evening.",
            "review_score": "1"
        },
        {
            "review_text": "It was perfect. Just sayin'. Finished it all in one sitting even; my only regret being that it seemed... a bit short. Worth every penny nonetheless; everything from the soundtrack and voice acting to the art and design was captivating and just amazing overall...  10/10, 11/10 if it was longer.",
            "review_score": "1"
        },
        {
            "review_text": "Short and entertaining. Light on adventure and detective elements but still fun and satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "A while back, I played the original 'Detective Grimoire' on Armor Games, which was amazing. I was also a fan of SFB's other games, like 'Haunt the House'. They were great games. Recently during the steam sale, I noticed this and Haunt the House: Terrortown and I bought them on the spot. About Detective Grimoire, I'd give it an 8/10.  Artwork: Amazing. Great style Gameplay: Great mechanics, some of which aren't really utilized by the player Story: Eh. I kind of liked it, kind of didn't. The murderer's motives were kind of bland. I prefered the flash game's story Length: I beat it in two hours. Pretty short.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game! once I started playing it I couldn't stop until I fininished!!  ",
            "review_score": "1"
        },
        {
            "review_text": "Very immersive, entertaining, Pheonix-Wrightish experience. Talk to people, find clues, present evidence, and find the culprit!. Short but fun game. I look forward to the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game at a great price(at either the sale or full price) the art style is great and i can't wait for the next one",
            "review_score": "1"
        },
        {
            "review_text": "Detective Grimoire is a well-polished point-and-click mystery adventure game, short enough to finish in a single session but packed with interesting characters, humorous dialogue, appealing cartoonish graphics, and terrific voice acting. The puzzles are simple, but the scenario was quirky enough to hold my interest for the couple of hours it took me to play through the game. I was particularly impressed by the production value of this game. It has all the little touches that make point-and-click adventures more enjoyable: map navigation to eliminate the tedium of backtracking; well-organized dossiers of the clues, suspects, and locations you've encountered; and (great for completionists) the ability to go back after you've completed the storyline to finish up your achievements. If you're looking for a fun and casual adventure, one where you don't have to worry about bugs or taking irreversible actions, give Detective Grimoire a shot.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game. This is a standard point and click adventure. It has a unique art style, good voice acting, and a rasonable plot. Not much more you could ask for, aside from making it loner.",
            "review_score": "1"
        },
        {
            "review_text": "A cute game with a great artstyle and excellent voice acting",
            "review_score": "1"
        },
        {
            "review_text": "Nice little mystery point-n-click puzzler. Well polished, good writing, cute characters, good story that keeps you thinking who is the culprit! Playtime about 2-3 hours!",
            "review_score": "1"
        },
        {
            "review_text": "Short but very pleasing little game. I hope there will be more.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, nice plot, excelent voiceacting. Fun game though it isnt a long one:)",
            "review_score": "1"
        },
        {
            "review_text": "Charming little detective adventure that does a lot of things right. You're Detective Grimoire, a laidback, mildly sarcastic sleuth sent to investigate a death on a secluded swamp getaway. The gameplay area consists of less than twenty different locations around the bayou, but is stuffed full of memorable characters to converse with and lots of clues to discover.  Detective Grimoire has obviously been designed for tablets, but the game transcends its origins simply by not dumbing down stuff needlessly. Sure, the game is not terribly hard since its designed for people of all ages to enjoy, but you do need to use your brain to actually make conclusions based on the evidence you're presented with. For the most part, it feels like you're doing real detective work instead of just solving random puzzles.  Production values are high as well, with fitting music, good writing, marvelous voicework and a rather unique, painterly graphics style that reminds me a bit of Day of the Tentacle. Overall, everything fits together really well, and it's maybe even a bit hard to fully appreciate the game because of how completely slick it is. If you have even a slight interest in adventure games, check this one out - You'll probably walk away with a warm fuzzy feeling after a couple of hours.",
            "review_score": "1"
        },
        {
            "review_text": "Although it is short and fairly easy, this game is one of my all time favourites. Everything about it was fun, from the unique characters to the mysterious plot, its gameplay is very intriguing and the whole point and click adventure side of it is perfect.",
            "review_score": "1"
        },
        {
            "review_text": "A child-like Point&amp;Click adventure game. Sure none of the puzzles are challenging, but it has a nice story, and sleuthing you can enjoy while cruising through in 2-3 hours. The art work, voice acting, scripts, dialogue puzzles and etc: it's all good.  The question is thus: do you want a simple fun puzzle story game?",
            "review_score": "1"
        },
        {
            "review_text": "I thought this game was fine. There were elements that I really liked - the art style, music, and general layout of the screen. Unfortunately, the puzzles were a bit simplistic and the game became more of a grind to ask everyone everything.",
            "review_score": "-1"
        },
        {
            "review_text": "Game for kids up to 12 years.  Wouldnt recommend it if you are looking for puzzles. Exept that - good music, voice acting, art.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely perfect. I can't recommend it enough. It's cheap, it's well made and it stars Arin 'Grump' 'Egoraptor' Hanson. Must buy.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful artwork, witty and comedic responses, gripping storyline; certainly a piece of artwork in itself. Looking back at this game's pseudo-prequel. flash game a few years back, I was honestly not expecting to see the developers come this far. Waiting for the upcoming sequel to this; which I believe will be just as, or even more better than this one.",
            "review_score": "1"
        },
        {
            "review_text": "Forgettable story, childish art style, simplistic 'puzzles' that 5 year olds can solve and pretty short (about 3h). I don't understand the 'overwhelmingly positive' rating on this one, as it really doesn't stand out amongst other adventures. Rather the opposite.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like this game. I really, really did. I saw all the great reviews and I'm a fan of point and click mystery games. I thought it would be awesome.  It WOULD be awesome. If I was under the age of twelve.  Pros: + Stylized Art. Pretty and painterly + Doesn't entirely give away the 'bad guy' -- you still have to guess at the end + Voice acting is nice. Some characters more than others + Everyone has a slight motive  Cons: - Puzzles can be too easy - Some puzzles require pixel-hunting - Dialogues can be repeated endlessly. There's no real consequences or difficulty. - The map is difficult to naviagte - The voice acting can be horrible at times, and sometimes poorly compressed.  The characters are quirky. But that's it. There's no depth, and you don't really care at all about them as people. They're just quirky, one-note characters.  I actually finished 90% of the game without meeting one of the MAIN suspects (and, turns out, the actual perpetrator.) I was probably supposed to meet said person before this point, but the game did not lead me to this person at all. I was using the map to travel, and jumped right past them. I could not figure out what I was doing wrong, everything was at 100% except a big BLANK spot. Ended up having to look up a guide.  The rest of the game was just...made for a kid. It's not that difficult, and some of the 'puzzles' are so easy I questioned if I had this game on a weirdly low difficulty level.  Recommend this for your kid's first point-and-click puzzle if they're around 7~12 years old.",
            "review_score": "-1"
        },
        {
            "review_text": "Really nice game - I loved it !!",
            "review_score": "1"
        },
        {
            "review_text": "Most likely this would have been a decent game if it didn't feel like a really bad port from Android (which I'm guessing it is.)",
            "review_score": "-1"
        },
        {
            "review_text": "A simple, but well made mostly light-hearted adventure game.  There's really very little skill or puzzling involved, and the game is very short (I finished it in less time than it took for all of the trading cards to drop), but it's a nice little story with interesting characters. The game is very polished, the interface is slick and functional, and the voice acting is pretty good. It should provide between one and two hours of fun to most adventure gamers.  I definitely recommend the game if you can pick it up on sale, but full price is a little steep for the amount of content on offer.  Bear in mind that the game is also available for Android, and seems to work equally well on phone and tablet as on PC. ",
            "review_score": "1"
        },
        {
            "review_text": "The game is good amount of fun, intresting mystery, good sound track, and good art design. The length of the game is a bit short but still worth the cost to me.",
            "review_score": "1"
        },
        {
            "review_text": "holds your hand incessantly &amp; thinks its funnier than it actually is",
            "review_score": "-1"
        },
        {
            "review_text": "It's a good game....if you are between 10 and 14. Otherwhise look for something else.",
            "review_score": "1"
        },
        {
            "review_text": "Cute little mystery point-and-click. The audio was excellent and I really liked the art style and humor. Only cons were that is was pretty short and the plot/ mystery could have been more of a challenge. Get it on sale if you can :)",
            "review_score": "1"
        },
        {
            "review_text": "I would buy this game for the look alone - so cool. This game is VERY short. I beat it in something like three hours. You can probably do it in under that. This might be a good one to try and get on sale. It was a GREAT little game though. Witty little sense of humor and fun little mystery to solve. If they do another game with this character I know I will be purchasing.",
            "review_score": "1"
        },
        {
            "review_text": "Well. Then. THAT FREAKING LITTLE GIRL IS LIKE A GHOST. POPS UP EVERYWHERE! Besides having the SCARIEST LITTLE CHILD EVER this game is really fun, and you'll enjoy it. Get on that sequel Super-Flash-Bros!",
            "review_score": "1"
        },
        {
            "review_text": "A light adventure puzzle game about a murder mystery. Short but fun and a decent story to carry it.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game. I played it on IOS and its good here too.  ",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game; however, this game had a few issues. Firstly it is not a long game, it took me about 3 hours to 100% this game. Secondly, this game's difficultly is quite low. I found that this games 'shiny hints' were pretty much 'click here for a clue', at least the first two maps that I had it on. Also, this did not allow you to lose, if you wanted to you could present every clue to every character without consequence. That said, I enjoyed this game, the artwork was cute and the voice acting was pretty good, as well. I will play the next one :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a really nice game. I actually feel like I'm doing something, most detective games I just feel like I'm there to click on what they tell me to click on. The music and sounds are great. The the graphics and art are high quality. The story is interesting, and makes me want to know more.  I hope this series continues.",
            "review_score": "1"
        },
        {
            "review_text": "Only complaints are that it's pretty short and the puzzles are really easy, but I seriously LOVE games like this. Really well done. MOAR!",
            "review_score": "1"
        },
        {
            "review_text": "A nice little indie detective game, much like Ace Attorney or Professor Layton. The art style and animation is gorgeous (even though I wish that the cutscenes were higher resolution than they are, although that probably stems from the fact the game was originally designed for mobile devices), and the voice acting is really good as well, featuring some well-known people such as Joshua 'Jaxamoto' Tomar and Arin 'Egoraptor' Hanson. It's about 2 hours in length, so you might want to wait for a sale, although I would say that it is still worth it's £5 price tag :)",
            "review_score": "1"
        },
        {
            "review_text": "This game was a lot of fun. Very well written and animated and voiced.",
            "review_score": "1"
        },
        {
            "review_text": "As long time fan of the Point&amp;Click genre, I purchased this game with little to no expectations given it was dirt cheap (less than 2€). And given that I finished it with 100% in under three hours, I'd say it was worth it.  The game is simple is to describe and analyze. It's a cartoon-animated, detective style point &amp; click adventure with a focus on humorous yet dated jokes, puzzles that are way too easy to be worthy of the name and surprisingly good voice acting. There's not combining item+item or item+environment in order to MacGyver your way out of trouble. There's a bit of exploration and dialogue. If you click on all the right places, you'll get a puzzle that will move the story forward. Like I said... Simple. However, despite the aformentioned features, the creator does a good job in creating a narrative that makes you want to see the game through. The characters are well thought out and the story (even thought predictable at some points) is captivating.  If you're looking for a simple yet entertaining couple of hours to pass time on a plane/trip, or if you'd like an inexpensive gift for your young gamer son/nephew, I recommended it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, especially for the price I bought it for ($1.74)  Short but fun!  It was fun cluing everything together. The clues were not absurdly hard by any means. In fact, I think they were too easy, but I feel that didn't make the game boring. The voice acting is good, and I love the art style. I was able to finish this in one sitting, and plan to play again for 100% completion.  The main con I have is that if you got it at full price, it would definitely feel way too short. Otherwise I recommend it. ",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun and rather quirky game. Some of the character dialogues are quite funny as well. The puzzles aren't difficult and you do not need to be a genius to solve the crime. I enjoyed this.",
            "review_score": "1"
        },
        {
            "review_text": "8/10  Story was enjoyable, voice acting was great and the animated cut scenes pretty to look at! Relatively short to 100% it, took me about 3 hours. Definitely worth the money, and interested in a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Though on a shorter side, it has a nice mistery, feel and overall it's a really well put together game.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable game. A little on the short side, so I'd try to catch it on sale. It's a fun little point &amp; click adventure. Sets up a series and I will be picking up the sequels.",
            "review_score": "1"
        },
        {
            "review_text": "Quite an in depth investigation with engaging puzzle mechanics and great acting! The only downside is that it doesn't last long, fully completed it 100% in the space of one evening. The developers deserve the support and it's a good game, but I'm not sure it's long enough to be worth the price they're asking.",
            "review_score": "1"
        },
        {
            "review_text": "Funny detective game with some interesting puzzles.Awesome way to spend some time.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, the plot is a little obvious but the engaging puzzle mechanics, characters, animation and voice actors make for an incredibly enthralling game!",
            "review_score": "1"
        },
        {
            "review_text": "6.5/10  Interesting game, very quick to complete and straight line. This isn't a typical adventure point and click, so if you're looking for an Monkey Island, Broken Sword or Runaway alternative, you probably wont be impressed. Anyway, if you're looking for a simple adventure (and by simple i mean that you're probably not going to visit every location more than twice) very cartoonish, with some well animated and well voiced charaters, then Detective Grimoire is a good choice to spend 3 hours of play.  Detective Grimoire is also on IOS, where i personally think has a better interface, and touch controls that gives it something more in fun and gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. It was fairly simple, so I wouldn't put it down as something to get if you want to spend days on a game, but I thought it was good fun and the characters were interesting. I would definitely get another game in the series if it were forthcoming.",
            "review_score": "1"
        },
        {
            "review_text": "3-4 hours short point &amp; click detective game. It doesn't present a real challenge but is enjoyable and the whole work is nice and stylish. I think it should appeal more to tweens or teens. I found it too straight forward for my taste, but I did appreciate the click here hints so I didn't had to go on a senseless pixel hunt. I really have mixed feelings about whether I should recommend it or not, it is very short, but it depends on wether you like a color full story more than subtle challenge. Your choice detective.",
            "review_score": "1"
        },
        {
            "review_text": "Being a great fan of the Voice Actors involved in the game, I was very exited to play this game, but ended up putting it off for one reason or another until forgetting about the game until being reminded about it again and reapeating the same process, but I digress.  The game is very simple, but manages to present a wholefully enjoyable story told by characters with rich personalities and some great humor. It's a game that can and likely will be played in a single session, as the simplistic gameplay never becomes overwhelming and the player always find new interesting story details that will encurage them to press on just a little further.  The story starts as improbable as it gets: Detective Grimoire is send on a murder case that may have been commited by an elusive creature that is the main attaction of a tourist attaction somewhere in the middle of a remote swamp. Strangely enough, Grimoire appears to be the only one confused how such a place can turn any kind of profit and thus begins our strange hunt for clues to unravel this mystery one piece at a time...  You might be best advised to see this game more along the lines of a visual novel, with a few simple puzzles mixed in to keep your brain running. The only flaw the story has in my opinion is that depending on the order you find the clues and how your brain works, you can make a very sure-fire guess who the culpirt is about half the way into the game. Thankfully, the story surrounding the case is much larger than the game first hints at, kepping you invested the full time it takes to find the last missing piece of evidence to cement the case or to figure out the full story surrounding Boggy's Bog.",
            "review_score": "1"
        },
        {
            "review_text": "a good and short story about detective on swamp you wont disappointed",
            "review_score": "1"
        },
        {
            "review_text": "This was a very cute game! Easy enough for a younger gamer or someone new to point-and-click games, but still engaging for adults and those with experience playing the genre.  Gameplay is easy to pick up, and you can turn hints on and off. The art is great, the soundtrack is amazing, and the voice acting is excellent. I'm looking forward to more games in the series!",
            "review_score": "1"
        },
        {
            "review_text": "This was a really fun game! I love point-and-click detective games, and this one had a specific charm to it that kept me interested. The character designs were nice to look at, and the dialogue was funny.  It's very short (only took me two hours), which I suppose is good for how casual the game is, but it would have been nice to see more cases at least, with increasing difficulty. Hopefully, there will be more in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and easy, kid-friendly, but can also be used to relieve some stress in an adult. Playes best with touch interface. I got it in a bundle",
            "review_score": "1"
        },
        {
            "review_text": "waiting for a sequel...",
            "review_score": "1"
        },
        {
            "review_text": "A cute point and click mystery game. I would recommend this more for a younger audience or for someone just looking for a more casual game. Definitely worth buying on sale for either of those reasons-- due to the length of the game I'm not entirely convinced its worth full price.   I wish they had more puzzles or deductions, or even maybe a penalty for showing too many unrelated things to people lol. Overall though, it wasn't bad. The art was interesting, music wasn't bad. It was easy to track my progress + if you miss any achievements you can go back to the save point before the final scene and finish everything you missed without having to restart from the beginning.",
            "review_score": "1"
        },
        {
            "review_text": "A short-but-sweet causal point &amp; click game.   Loved the art style, storyline, voice acting, and humor. This game will leave you with a smile!",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. It's not particularly challenging, but at least it doesn't expect you to come up with weird combos of items that you'd never think of normally, which is a pitfall of many similar games. The art style is lovely and it's pretty funny, too.",
            "review_score": "1"
        },
        {
            "review_text": "A short and charming little game. Beautiful art direction, a lovely soundtrack, and surprisingly good voice acting (except for the little girl, who sounds... off).  Some faults I had with the game personally: - It's easy to deduce the culprit pretty early in the story - The puzzles are way too easy, perhaps meant for very young children - Solving the mystery ultimately didn't feel... super rewarding... only a little bit.  Overall, I would recommend this game, and its flaws can be overlooked for a cute little experience. (8/10)",
            "review_score": "1"
        },
        {
            "review_text": "Let's put it this way. I finished the game, and was disappointed that it was over, and that another installment doesn't exist yet. It's a simple, entertaining game with fun voice acting, nice art style, non-frustrating puzzles and a nice little mystery to solve. I just wish there were more of it!",
            "review_score": "1"
        },
        {
            "review_text": "It's a casual but fun point and click adventure. It's designed to be suitable for younger players, for example puzzles are very easy and the game tries to make sure players will follow the game's pace and make the right conclusions after finding every clues. but besides that, the characters, music, story, nice artstyle and other things have made this game a good one. The game is short too (2 to 3 hours) but the price is right and it's absolutely cheap on sales. so if you want a short but nice, warm and cartoonish detective journey on a night like holloween, this game is a great choice.",
            "review_score": "1"
        },
        {
            "review_text": "Though fun, this is one for the younger generations - the puzzles are very simple. It's also a very short game, but for the low price this is acceptable. The story is intriguing and mysterious, the characters are well voice-acted and the whole game runs quite smoothly thanks to the screen layout. Overall, this is a fun game to play which has a charming animation style and a pleasant soundtrack which is somewhat reminiscent of The Nightmare Before Christmas.  Recommended for under-12s and families.",
            "review_score": "1"
        },
        {
            "review_text": "not bad, not great. would recommend for casual point and click or for kids.",
            "review_score": "1"
        },
        {
            "review_text": "Simple puzzles, but the voice acting, art and animation is absolutely wonderful. Would definetely reccomend if you're looking for something light to play, maybe on a trip or something.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting characters. Good voice acting. Funny writing. Light hearted mystery. Great soundtrack. 3-4 hours length. Very easy puzzles. Well worth the price. ",
            "review_score": "1"
        },
        {
            "review_text": "God this game is just so compelling and wonderfully written. Great voice acting and characters. I want more.",
            "review_score": "1"
        },
        {
            "review_text": "Love the characters, the graphics and the development. Very much recommended.",
            "review_score": "1"
        },
        {
            "review_text": "The art was nice and it was a cute story. You know howe it is going to end but there is a little bit more going on then what you think. overall it is a quick little cute game you can play.",
            "review_score": "1"
        }
    ]
}