{
    "app_id": 272890,
    "name": "Vertiginous Golf",
    "release_date": "2015-05-06",
    "developer": [
        "Kinelco & Lone Elk Creative"
    ],
    "publisher": [
        "Fellow Traveller"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Golf",
        "Indie"
    ],
    "achievements": 45,
    "positive_ratings": 595,
    "negative_ratings": 409,
    "price": 7.19,
    "description": "Vertiginous Golf is a dystopian steam punk mini golf adventure game set in the skies above an alternate world where life on the ground is enveloped in permanent smog, constant darkness and never-ending rain.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/272890/header.jpg?t=1532352001",
    "minimum_requirements": "OS: XP SP3 and above Processor: 2.0GHz CPU Memory: 512 MB RAM Graphics: 512MB graphics card Storage: 2 GB available space Additional Notes: 3GB RAM",
    "recommended_requirements": "OS: XP SP3 and above Processor: 2.0GHz CPU Memory: 512 MB RAM Graphics: 512MB graphics card Storage: 2 GB available space Additional Notes: 3GB RAM",
    "reviews": [
        {
            "review_text": "This is an okay game. It can get quite confusing at sometimes though. The tracks are way to complex and hard to figure out. But all up it's still pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "This game is unlike anything you'll ever play. I think it is brilliant! It left Early Access and Version 1.0 was released on May 6th, 2015.   Don't expect it to be easy to put the ball in the hole and don't expect it to be stress free. This game is hard core and can be frustrating at first, but with a little in game experience, you'll see your scores getting better. The graphics are really nice too.... Fun game! Buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun with friends or just anyone from your family to play with. Its a child friendly game :)",
            "review_score": "1"
        },
        {
            "review_text": "Surprised about the bad reviews. The game is legit pretty fun with friends  Its got a weird bioshock-esqe inspired theme.   The game works well, isnt buggy or broken, its not even that difficult. If you can get it on sale or you got a free copy from a friend, its worth getting together and playing.  You can play golf and attack each other.  Point system is a bit broken, but other than that, pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "What an amazing game! Not only is the game fun to play, but the children getting electrocuted makes it even better. I would recommend everyone to play this game. It will blow your ♥♥♥♥ off.",
            "review_score": "1"
        },
        {
            "review_text": "Weird game. The sounds are weird, its like a mechanical machine concept/nightmare. I cant discribe it better than that.  Gamplay is cool   Its for hardcore mini putting lovers. I liked it, its fu.king hard but diffrent. Have a music playlist ready tho, the piano is nice and all but dam.........",
            "review_score": "1"
        },
        {
            "review_text": "fun game my golf game is so bad but nonetheless good",
            "review_score": "1"
        },
        {
            "review_text": "Can a golf game be creepy? Yes, it can, just try the story mode!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely Reccomend This Game You dont have to be good at it, just take your time and work through the story mode Very relaxing game, apart from the occasional audio cue.",
            "review_score": "1"
        },
        {
            "review_text": "I understand that this golf game is supposed to take place in a steampunk setting and the overall presentation does lend itself to that aim. The problem is that this premise also gets in the way (for me) of enjoying a golf experience that is very much flawed in every aspect. Playing Vertiginous Golf hardly feels like I'm playing a golf game. While the physics engine is serviceable, the holes and their gimmicks simply get in the way of what golf or mini golf are supposed to feel like. Traversing each hole is cumbersome and awkward. The alternative-style (steampunk?) obstacles scattered throughout each hole just aren't interesting, nor do they add anything new and worthwhile to the golfing experience. There's also very little content and each hole is very similar to the next. Yes, there is the opportunity to create your own holes and to play through holes created by the community but they honestly all look, feel and play the same. This is a less than ambitious golf game with little to no variety. I would rather play PGA Tour Golf for DOS, which was released in 1990.  Vertiginous Golf is mediocre.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is really a good game. People say it's bad because they can't run it but it is great fun.",
            "review_score": "1"
        },
        {
            "review_text": "I downloaded the game due to some reviews claiming glitchiness and poor controls. After playing, I can confirm no such poor controls exist- I was consistently failing on my own lack of skill. Ball physics are much improved from what I was expecting from these reviews. Pretty good minigolf game.",
            "review_score": "1"
        },
        {
            "review_text": "I have played 36 mins of this game so far.......  who know golf and Steampunk revolution went so well together!                                             Send HElp",
            "review_score": "1"
        },
        {
            "review_text": "That game can make the time you spend playing it fun and pretty interesting. That was a unique experience playing that game. I liked it, the game has a fine graphic and good gameplay, the soundtrack is cool.",
            "review_score": "1"
        },
        {
            "review_text": "Played with 5 friends. So fun.... 10/10 would search 30min for my friends lobby!",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't fun, don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "  Plays game with friends, checks clock, 2 hours later... GG webernet",
            "review_score": "1"
        },
        {
            "review_text": "Pretty nice game, if you like the steampunk world and it's machineries... oh yeah, and golf. You need to like that also...",
            "review_score": "1"
        },
        {
            "review_text": "fun simple casual game when you need to take a break from life",
            "review_score": "1"
        },
        {
            "review_text": "Thank you for supporting Linux!",
            "review_score": "1"
        },
        {
            "review_text": "Addicting with my bald head",
            "review_score": "1"
        },
        {
            "review_text": "  I got this game for free and..... it still sucks",
            "review_score": "-1"
        },
        {
            "review_text": "An interesting steam-punk take on a mini golf game but a golf game should be easy and relaxing to play and this game is neither. In this game the graphics are busy, blurry and hard on the eyes. I had to lower graphic effects to make it somewhat comfortable viewing. The sound and music are dull. The ball physics aren't great and the ball doesn't stay in the hole so that removes any satisfaction of puttting the ball. When you do complete a hole there's an annoying steam machine bouncing in your view. I only played a few holes but the courses got complicated quickly with wind machines, ramps and conveyors. It was not enjoyable and quickly became a stressful gameplay experience than a relaxing one so unlikely I will return to play any more of it.",
            "review_score": "-1"
        },
        {
            "review_text": "This Minigolf game is atrocious, vile, and simply 'Unfun'.  The game's overall style is victorian or steampunk clashed with minigolf based somewhere in the clouds. It's as if Bioshock Infinite's Columbia had a really really terrible minigolf course. The game starts you outside of 2 buildings, one being the minigolf room and the other a clothing store, the rest of the buildings are off in the distance and look very low rez and there are invisible walls. Inside the minigolf room there are rows of chairs and a terminal at the end, kinda looks like a barber shop. Once you select your course from the terminal you sit in a chair and get electrocuted or something. Then you load into the course.  The music is very repeative, the mouse controls are flipped for some reason, left mouse is aim right is fire. The corse design is punishing, even in the first few levels. I consider myself decent skilled at most minigolf games and while i scored 3 under par on the first course, including a hole in one, the second course had me already at 2 over par for very very thoughlessly designed courses.  Overall, I would give this game a pass.",
            "review_score": "-1"
        },
        {
            "review_text": "whant to test you pc uninstaller ?get this load of bs ",
            "review_score": "1"
        },
        {
            "review_text": "Got this with humble bundle so I am not so bumbed that I have this game...either way this was one of the weirdest games I have ever played, and not in a good way. Also the ball physics is trash, the controls are worse and from the sound of tyhings the story is so bad I didn't even need to play 1/2 an hour before my brain cells started committing suicide. I got this ♥♥♥♥ for free and I still want a refund (atl least the time I put into this steaming pile of crap...?).",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly, it's a fun game. And if you want a mini-golf game to ♥♥♥♥ around in, this is pretty fantastic.  That being said, I can't play multiplayer. I get disconnected 2 or 3 holes in, every time. If you are counting on that aspect of it, as I was, it's mildly risky. Works for my friends, doesn't work for me.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so buggy and glitchy, 0/10 would recommend to ANYONE",
            "review_score": "-1"
        },
        {
            "review_text": "  It is pretty decent for free. There are better golf games, even on mobile, but this one is ok.",
            "review_score": "1"
        },
        {
            "review_text": "OH MY GOODNESS THIS IS THE MOST RAGE ENDUCING GAME I HAVE EVER PLAYED, SOME PEOPLE ARE JUST EVIL, YOU MUST GET IT, HOWEVER IT WILL KILL YOU. I WISH YOU LUCK.",
            "review_score": "1"
        },
        {
            "review_text": "Like a puzzle game in a mini golf engine. Plus some of the best drunken/stoned antics in a while. Get everybody on a common voice chat program and enjoy your night.",
            "review_score": "1"
        },
        {
            "review_text": "Slow, Buggy, graphics are awful, just avoid this completely.",
            "review_score": "-1"
        },
        {
            "review_text": "I felt like I caught Ebola just starting the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I could like this game... Music is satisfiying, atmosphere is kinda nice. Some challenging levels... Everything is nice except one thing... FKN Speaking heads that freaking your mind with psichology/phylosophy, some kind of wierd stories and etc. They cant be muted or turned off (except turning off main sound/volume) and being annoying as F@#%! I see this game as a chilling game, and i dont give any fks about story of this game or anything else, I just wanna chill a bit in the end of the day after work. But those fkn head's voiced by non profesional artists but just random people reading text on paper, mostly they don't making any realism and emotions and i dont realy like their type of voices... they sounds monotone ... they sounds like ♥♥♥♥. I understand devs had not enough money to do everything fine... BUT FFS! WHY THERE IS NOT FREAKEN SIMPLE 'MUTE VOICE' BUTTON ???",
            "review_score": "-1"
        },
        {
            "review_text": "This game literally gave me cancer. I probably have about 10,000 less braincells than when I first picked up this game. I got this game for free and I still regret the 5 seconds it took to enter the code into the redeem box. Those are 5 seconds I will never get back. The fans are broken, and this game probably was made by a ♥♥♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "I played this game after getting it from my freind. We are no longer friends. That is all I have to say about this game... But you may like it.",
            "review_score": "-1"
        },
        {
            "review_text": "Wanted to play play with friends however the only server list that would load was the first page (which our game only showed up on 1/20 times). When the host actually did show up on the first page it instantly said 3/3 players however only the host was in the game. This game may be very good, but I could not play at all so 0/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Great fun with a Golf Ball! However it comes with a price tag, not my cup of tea!",
            "review_score": "-1"
        },
        {
            "review_text": "Play mini-golf, get money,  Buy facial hair and a stupid hat... God I wish I could hit the hummingbird with my chipper. Hipster garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is average but i don't recommend this game because the online is dead and some of the courses are very confusing.  Pros: - Great menu - the miniputt courses are great - some good challenge - graphics are good  Cons: -lots of confusing holes - online is dead - a story that no one cares about - bad voice acting - $20 is a bit too steep  Overall it's an alright game with a stupid story and online being dead. 5.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "Downloaded to try and play this co-op with a friend but you can't even invite your friends and there's absolutely no way to join them online. Completely defeats the purpose of having multiplayer.  I get that this is free but if you're going to add multiplayer at least make sure people can join your server, or if it's going to add to the server list that it actually shows more than the first page of the list...  Maybe the single player is fine, but it has multiplayer and the poor experience instantly ruined this for me. When/if it's updated/fixed perhaps I'll revisit. Incredibly dissappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "6/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is so poorly made I can't believe someone actually thought this game was completed",
            "review_score": "-1"
        },
        {
            "review_text": "Got it when it was free",
            "review_score": "1"
        },
        {
            "review_text": "abunch of silly qurky fun to play with your friends yes if your power bar is at the same place it does not allways give the same shot whitch is both frustrating and an instresting machanic like in real miniput.",
            "review_score": "1"
        },
        {
            "review_text": "A game created by the Gods themselves.",
            "review_score": "1"
        },
        {
            "review_text": "The game is kinda fun, I guess. Having to go back to the 'lobby' each time through the tutorial is annoying, though. If I hadn't got the game for free, I wouldn't be happy spending money on it.",
            "review_score": "-1"
        },
        {
            "review_text": "While playing this I suddenly realised that the world was my oyster and I could be doing literally anything other than playing this ♥♥♥♥♥♥ golf game.",
            "review_score": "-1"
        },
        {
            "review_text": "Made me want to kill myself and my entire family.  4/20, it's alright.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game for the free promo, so I can't say much about the value. The gameplay is fun and if you can talk your friends into getting the game or perhaps gifting them a copy, it'd be extremely fun. This is an underserved niche on the PC, and it serves as a great way of escape from other, more mainstream, PC giants (CSGO, LoL, etc.). Definitely worth $5.",
            "review_score": "1"
        },
        {
            "review_text": "I got the game for free during a Steam advertisement. I tried the tutorial levels but it wasn't as fun as I thought it would be. I was expecting customisable characters with golf powers and exciting maps. Sadly, it was just a normal golf simulator. It passes but it's not something I would pay for.  PROS 1. It's Free Great to get free games.  CONS 1. Doesn't Make Sense World of Smog and Golf? Did the developers just roll a random theme generator?",
            "review_score": "1"
        },
        {
            "review_text": "It's like Bioshock Infinite... with golf... and less blood.... and less weapons... and a less sophisticated and deep story... Okay, it's not JUST like Bioshock, but it's steampunk and has nice music. ",
            "review_score": "1"
        },
        {
            "review_text": "local coop, steampunk and golf. Cool idea",
            "review_score": "1"
        },
        {
            "review_text": "I'm not really into golf. I stay away from them games. But this was free for 24 hours, so I installed it. Not a bad game. I was actually surprised to have enjoyed it since it had a low score in user reviews. I'm puzzled how that could have happened. So I'm leaving my positive review hoping to help bring that score back up.  Don't go in expecting it to be a realistic golf game, it's far from that. It's really just a fun game. It reminds me of several mobile games like it. I didn't find the puzzles difficult at all. In fact I found easy ways around most of the obsticles anyway heh.  The controls aren't bad either, I figure them out and felt confortable with them right after the first tutorial.  I really liked the art style and graphics. It looks really nice and reminds me of Bioshock. Admitedly the walking part could use some improvement, mainly on the character model. But eh, I could care less about that part.",
            "review_score": "1"
        },
        {
            "review_text": "A game that takes miniature golf and uses it as an art form.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice steampunk golf, wish the level creation was a bit better, otherwise solid 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is kinda meh, buy it for $5 when it's on sale..watch a youtube video on the gameplay",
            "review_score": "1"
        },
        {
            "review_text": "It's golf, for dirty ♥♥♥♥ing hipsters....",
            "review_score": "1"
        },
        {
            "review_text": "Fun. I got it for free so no complaints.",
            "review_score": "1"
        },
        {
            "review_text": "It sucks",
            "review_score": "-1"
        },
        {
            "review_text": "The videos for this looked amazing. Crazy minigolf up in the clouds just seemed like such a great idea. But then I got the game, and huge flaws started showing up right away. First off, the mouse sensativity was way too high, so I adjusted it from 50 to 0.2, and it was still way too high. The very slightest movement will throw a shot off by a huge amount. The game is barely playable because of this.   A lot of the gimmicks aren't very fun, either, like bonus holes along the way to the main one that remove strokes from your score but become closed after you take too many shots. This basically means that if you get off to a bad start on a hole, a few extra strokes get added to your score on top of everything else. Not cool.  The courses are pretty enough, but the atmosphere is hampered by a distopian storyline that you have to listen to. Maybe it would be immersive if I wan't trying to focus on the golf, but since I wanted to just play the game, it served to mostly distract.   Bottom line: even if you like crazy mini golf, skip this one. poor controls and execution ruin what could have been a great game.",
            "review_score": "-1"
        },
        {
            "review_text": "I really want to like this game but the controls for how powerful your swing is are horrid... it's better with spacebar than with mouse but it still is extremely difficult to get it to hit how hard you want it to. I really enjoy the vibe and look to it though. As long as you can get past the clunky controls it really is a relaxing game.",
            "review_score": "1"
        },
        {
            "review_text": "Love it",
            "review_score": "1"
        },
        {
            "review_text": "The courses are cool and look beautiful, but the lobby/shop/course selection is clunky and bleh. Sadly I doubt extra polish is on the way at this point. Still, it's good fun, difficult, and has multiplayer. What more can you ask for from mini golf?",
            "review_score": "1"
        }
    ]
}