{
    "app_id": 272990,
    "name": "GAUGE",
    "release_date": "2014-05-23",
    "developer": [
        "Étienne Périn"
    ],
    "publisher": [
        "Neko Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual"
    ],
    "achievements": 23,
    "positive_ratings": 141,
    "negative_ratings": 67,
    "price": 2.49,
    "description": "Gauge is an experimental and minimalistic sport game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/272990/header.jpg?t=1447360070",
    "minimum_requirements": "OS: Windows XP Processor: 2 GHz Memory: 512 MB RAM Graphics: Compatible DirectX 9.0c DirectX: Version 9.0c Storage: 100 MB available space Sound Card: Audio standard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It definitely looked a lot cooler than it was.  Not sure why it's not written in HTML5 and uploaded to some ♥♥♥♥♥♥ website somewhere, it'd be beloved by millions if that were the case. Not worth spending any money on. It's nothing new, just a quirky idea with some pretty (and slightly mad) colors splashed in.  Hotline Miami without the amazing soundtrack, blood, guts, story, gameplay, or use of the mouse. So, nothing much really. It only retained the obnoxious colors and 80s drenched effects.",
            "review_score": "-1"
        },
        {
            "review_text": "I am very confused how this has positive reviews. It is just a simple mini-game where you press the space bar constantly to maintain a gauge at certain level. Even if the game cost $0.10 I wouldn't buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "6 Reasons why to buy GAUGE:  1) You lose money. 2) Your thumb will hurt like hell after 10 mins of gameplay. 3) If you don't have epilepsy, you will get one. 4) If you're a achievement collector, this game is a must have. 5) You will see your optician much more often. 6) If you play good enough, you may see a cat.",
            "review_score": "1"
        },
        {
            "review_text": "The thought of a game where all you do is press space bar to control a gauge sounds terrible but it's actually really fun, especially with the flashy background, awesome music, and just how the game tries to distract you all the time.",
            "review_score": "1"
        },
        {
            "review_text": "Not ♥♥♥♥ing good at all.  Maybe for 99 cents.  Not for 4 ♥♥♥♥ing dollars.  You can buy an rpg that will give you 1000 hours of content with that amount of money.  ♥♥♥♥ this game, stupid wannabe meme.",
            "review_score": "-1"
        },
        {
            "review_text": "Needs more epilepsy warning.",
            "review_score": "1"
        },
        {
            "review_text": "It's a hard question answer what this game is but let me try. It's a insanely cool game with strong difficult, a good fair challenge, requires reflexes and have a casual fun. You got to be concentrated in hold and realease you spacebar and ctrl in the right proportion as the the game tries to take out your focus with psicodelic graphics, lol cats, funny phrases, reducing your gauge, shaking the screen and a whole another ones mature nonsenses. Before I forget, it have 4 game modes unlockable plus the original, totally deserves your attention! Extremely cool, you have to try!",
            "review_score": "1"
        },
        {
            "review_text": "man, steam really, really needs a wobblehand recommendation option.  okay, so, since the trailers are pretty dubious and what not, i'll try to make this easy to follow.   this game is called gauge. you fill a gauge, you get points for filling the gauge, you get more points for having the gague as full as possible without overfilling it. sometimes a collectible happens, and you must drain the gauge to collect it, which gives you points and the ability to trigger a second gauge for even more points. you start with a point multiplier that increases at set intervals, and it also counts as your lives--run out of lives, and you lose. the entire game is controlled with the space and ctrl keys, and there is no pausing--once you start, you will keep going until you lose/give up.  the game makes itself harder by tossing in flashy screens, text, audio cues, stylistic changes, screen-shaking/zooming, and other such distractions to get your focus off the gauge--if you have problems with flashing lights or erratic motions, this isn't a game for you. it's simple enough to pick up, but difficult to master once the distractors start rolling in--they can happen at any time in any combination, so you have to keep on your toes.  would i recommend it? depends--it's a fun little time waster, and a neat game for what it is. that said, it's definitely one of those sit-in-a-hospital-lobby-and-watch-your-wait-time-fly-by games, so its value is diminished a bit on steam. still, it's fun, so if ou've got the money and notice it on sale, go ahead and give it a go. i see myself coming back to it pretty often in the near future.",
            "review_score": "1"
        },
        {
            "review_text": "First played this on my friends account and then bought it my self, some while after. I actually found my self enjoying the game, but not alone. Playing this game alone creeps me out, but it's fun with a friend, you control spacebar, and whenever your friend can join in, he can use Ctrl :)  There's not much to be said other that Hahom (Friends name) and I got on the actual scoreboard pretty highranked :D I don't feel as if I should rate this game or not, but if I were to I would give it a  8/10 for it's odd contents of cats, and creativity, but not a single point further.  (My time played on this account is really low, as I said I played on my friends account back then)",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing life itself",
            "review_score": "1"
        },
        {
            "review_text": "Personally, I love this game. I just started playing it tonight, and I played it for about an hour and I am pretty sure my eyes are going to fall out. But hell, it was worth it. That was one heck of a ride. Yes it is a simple concept, and loads of people do not like it and never will. It is actually pretty challenging though, because there is SO MUCH going on and everything changes all the time.. its so much fun! Yeah, I got it for like a dollar on sale and I would encourange anyone interested to do the same. If you like getting your mind and eyeballs ♥♥♥♥ed, then go for it!   I feel like I may still be on acid  ",
            "review_score": "1"
        },
        {
            "review_text": "if ebola had a game.... that was this game",
            "review_score": "-1"
        }
    ]
}