{
    "app_id": 273110,
    "name": "Counter-Strike Nexon: Zombies",
    "release_date": "2014-10-07",
    "developer": [
        "Valve Corporation, Nexon Korea Corporation"
    ],
    "publisher": [
        "Nexon Korea Corporation"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "MMO",
        "Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available",
        "In-App Purchases"
    ],
    "genres": [
        "Action",
        "Casual",
        "Free to Play",
        "Massively Multiplayer"
    ],
    "tags": [
        "Free to Play",
        "Zombies",
        "Multiplayer"
    ],
    "achievements": 65,
    "positive_ratings": 22130,
    "negative_ratings": 12127,
    "price": 0.0,
    "description": "Counter-Strike Nexon: Zombies is a Free to Play MMOFPS offering competitive PvP and PvE action including content from the original Counter-Strike and all new game modes, maps, weapons, and hordes of Zombies!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/273110/header.jpg?t=1551937566",
    "minimum_requirements": "OS: Windows 7 or later Processor: Intel(R) Pentium® 4 CPU 2.80GHz or higher Memory: 2 GB RAM Graphics: NVIDIA GeForce 6xxx or higher DirectX: Version 9.0c Network: Broadband Internet connection Storage: 5 GB available space",
    "recommended_requirements": "OS: Windows 10 Processor: Intel(R) Core™2 Duo CPU E4xxx or higher Memory: 4 GB RAM Graphics: NVIDIA GeForce 8xxx or higher DirectX: Version 9.0c Network: Broadband Internet connection Storage: 10 GB available space",
    "reviews": [
        {
            "review_text": "How to not make a video game:  -Make one team super OP -Use a 17 year old game engine -Add microtransactions -Add crafting (as opposed to actually getting a weapon) -Make craftable weapons only last a few days -Make everything overpriced -Put in tons of camping locations -Re-use content from a 10 year old game -Your zombie is an octagon (I wish I was joking) -Pretend it's a horror game -Foggify old maps to pretend they are new -Make a crappy sound play every time someone dies -Use an over-saturated game idea -License a completely unrelated series -Put your company name in the title -Make it 2GB, because that's the size a game from 17 years ago is supposed to be, right? -Make the menus incredibly hard to understand -Make it free to play  And have fun, your crappy game is complete.",
            "review_score": "-1"
        },
        {
            "review_text": "Free might be too much for this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Play it not for the zombies, but because you can play oldschool CS 1.6 for free.",
            "review_score": "1"
        },
        {
            "review_text": "This game is sadly very disappointing I really tried to love this but I couldn't -menus are hard to navigate -lot's of connection errors (apparently being fixed) -P2W bull**** (atleast from my understanding of things) -in-game shop (that's a very bad sign especially in a game like C.S 1.6) as I said it's disappointing I really wanted this to be good but I guess we can't have nice things for free. ",
            "review_score": "-1"
        },
        {
            "review_text": "Could be worse.  But there are worse situations than being locked in a room full of horny gorillas who have no intention of buying you dinner before what's about to happen.  So, you know, it could be worse.",
            "review_score": "-1"
        },
        {
            "review_text": "I've never cried so much before. Uninstalling can't make the pain go away",
            "review_score": "-1"
        },
        {
            "review_text": "What can I say about this game...bugged, bugged and bugged. When i could finally play for 10 attempts to load, I had got crashed. Everything is like in normal CS, but it's more bugged. I like Counter Strike series, but this is the worst game about CS.   In my opinion: 3,5/10  !!! I DON'T RECOMMEND THIS GAME !!!",
            "review_score": "-1"
        },
        {
            "review_text": "I can now say that I have played a zombie game where I could not kill a single zombie. Great job, Nexon.",
            "review_score": "-1"
        },
        {
            "review_text": "I feel as though this game had potential, but it wasn't used and overall I feel the game had poor design. While I would say if you didn't have 1.6 this could be an alternative given the team deathmatch mode, there are changes in movement and physics that really mess it up. It should have been made in the CS:GO engine for improved graphics and other things (you don't need much to run CS:GO anyway) and I don't think it should really be a standalone game. It is just a mod.   I played Zombie Escape which involved me following arrows on a map which looked open - but turned out to be very linear, just the same thing every round. It was an ok concept for a game/gamemode, but it lacked any enjoyment for me - and I sometimes found myself stuck in the walls of the map, just waiting for my demise. Then it happened as a zombie, and I couldn't do anything - so I quit the server.  So this review doesn't go on forever, here are my pros and cons about the game:  PROS:  -The game is free so you don't waste any money trying it out (unless you use the microtransactions...) -Some good concepts for gamemodes which could be improved and expanded upon more   CONS:  -Some people don't like free to play - so I'm putting that here too.  -Microtransactons -COD-Style Levelling  -Bugs (Stuck in walls, game not starting correctly to name a few) -Made in the 1.6 engine rather than using something more up-to-date -Linear arrow following in what could have easily been a more expansive world to play in -Movement changes from 1.6 make it somewhat unfamiliar to 1.6 players -Gets repetitve quickly -It could easily have just been a mod, and some of the gamemodes are probably playable in Gmod - YOU DON'T MOVE FASTER WITH YOUR KNIFE OUT   Overall I would say this game is a 4/10 as it's features are rather lackluster. I feel as though Nexon have let us down, as I was somewhat looking forward to this game when I first heard about it. These are just my opinions though, and as the game is free you can try it out if you would like.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a piece of trash and it has a VAC Wannabe protection, they ban you permanent for no reason.",
            "review_score": "-1"
        },
        {
            "review_text": "After alot time playing i can give my sincere review, the game by itself is fun and entertaining. You can find alot of games mode, the most popular are: -Zombie Hero(ZBH) -Zombie scenario(ZS) -Team Death Match(TDM) In total you have 21 games modes -  Enought to spend a few hours!",
            "review_score": "1"
        },
        {
            "review_text": "Downloaded the game and ran it. Collected my daily rewards. Tried to start the tutorial, the act of which downloaded a trojan.  Not impressed.  Also constantly opens Internet Explorer (which isn't my default browser) to ask me to recommend the game to friends.  I think not...",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game whit stupid performance Fix your ♥♥♥♥ing servers or let people create their own,even club penguin has better servers",
            "review_score": "-1"
        },
        {
            "review_text": "Enter with caution and keep a firm grip on your credit card.",
            "review_score": "-1"
        },
        {
            "review_text": "  CSNZ It's CS with Zombies, Crafting kinda like having all cheat codes turned on at times well in the zombie modes anyways.  There's lots of Guns, Maps &amp; Game Modes A Free DLC pack &amp; Even BINGO!  I have played more than 200hrs and have never found the need to buy anything and people do tend to share. I feel that I can say that this Is a REAL F2P. It is a complete game at download.   There is however a few 'Cons' I thought the real down side was the the community.Acting rude and just all around not very kind to the new players. all almost as if some of the higher ranks think they just just started the game out at Lv100 the term 'noob' hugely over used and been around for a long time but its used like a little kid just learn a new cool word that all the popular kids use. I mean come on people give'um a brake the game isn't that grate there is other game out there. i made this conclusion at around 300hrs of game play.   Make as many friends as you can as you move up through the ranks and or bring some with you and I don't see why anyone who likes FPS's &amp; ZOMBIES wouldn't have a good time playing.",
            "review_score": "1"
        },
        {
            "review_text": "EDIT 2: Forewarning that impacts my review heavily: They've both removed a permanent item from my iventory** *and* my review was edited with that message being deleted. I've contacted Valve and they won't do it. Most large review sites only accept paid news articles. TotalBiscuit even refused it.   This will be a more serious review as it has the Counter Strike/F2P 'click-bait' name to it. To put it simply, it's a Combat Arms Pay2Win/F2P first person shooter. It has parts of it that are entertaining and parts of it that are abysmal, even worse than CA. Calling it CS is far from the truth.  Most of the modes suck outside of about 2. I recommend their equivalent of Gun Games called Gun Deathmatch (for balance), and the Zombie Scenario: Tracking (if you're interested in purely killing thiings mindlessly). Every other game mode is imbalanced and P2W-favored. The guns are weak unless you pay money or use cheats. Did I mention they use the notorious 'Anti-Hack Shield'? It's useless if you're new to it. I'm not saying everyone cheats, it's just a useless system. There are no fidelity options, the game looks like s***. That's sorta a good thing because even bad computers easily push high FPS. But it looks like it was ported from PS2; it's bad. And the low reqs of it cause a lot of game ruiners to play. And no one talks on this game - text or mic. It's by far the leas strategic FPS I've seen and played, both due to gameplay and that communication issue.  It's the best F2P first-person shooter out there, to be honest. But that isn't saying much.. Even if you're very poor, I urge you to pay money for a game that doesn't suck. It definitely isn't worth playing. I left out some key points to keep this shorter, I just hope I prevents people from making the mistake of installing this. I cannot believe Valve backed it or it's called Counter Strike.... I suppose you can't expect much out of Nexon anyway.",
            "review_score": "-1"
        },
        {
            "review_text": "It's basically  Counter-Strike 1.6  (♥) with slightly improved graphics and gameplay (I really like the crosshair with a dot in the middle) and elements from the famous  Zombie Plague  mode, merged with a pay-2-win shop system that  really  reminds me of  Wolf Team  (and other similar games).   Yeah, there's a shop system in this game...  ...but I'm not going to be a whiny bitᴄh about it (check most of the non-recommended reviews), because I'm not forced to spend money on this, since I can just play on regular 1.6-style servers with all the original characters and weapons.   A thing that did annoy me about this game is the removal of tons of console commands and the ability to have an own user config (the famous 'autoexec.cfg') is gone, but I think this can be added in future updates.  ---  Edit  --- I'd like to add that I'm not mad at the shop system: weapons can be crafted so easily without spending real life money (there's even a chance of getting permanent items) and the only 'pay2win' aspect of the game are some crappy female skins with irritating death sounds that you can quickly frag. Yes, there's people who waste money on that (well, Nexon has to make some profit somehow).",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't even join a server.  Thank God.",
            "review_score": "-1"
        },
        {
            "review_text": "It's fun about 20 minutes.. then you see an alpha version of Killing Floor which is with bad AI, old engine and horrible maps.",
            "review_score": "-1"
        },
        {
            "review_text": "These trailers make most companies presentations at E3 look truthful.  Expectation: Large detailed maps. Epic battles between survivors and the ravenous horde. Varied content. Lots of player customization with weapons and costumes.  Reality: Every map I played was 'run from point A to point B'. Thanks to this, i now understand 'rush B, silver style'. The only people i ever saw shoot were the ones who just started the game. (see complaint #1.) At least there isn't anything interesting to distract you as you run. Any item you find or buy is only usable for a limited time, after which it dissapears into subspace.  Conclusion: I would say there is only one way to quit the game, but the gun you had just dissapeared.",
            "review_score": "-1"
        },
        {
            "review_text": "honestly,is working bad,and between this and 1.6,the 1.6 remains a legend",
            "review_score": "-1"
        },
        {
            "review_text": "This plays like an old CS mod in a bad way. Just feels amateurish with no effort.",
            "review_score": "-1"
        },
        {
            "review_text": "Well i can say this, and hear me out, this game is really fun, sure the launch of the 'Open beta test' was a little bit of a disaster, but its been fixed and really, i played this game back to when it was only in asia as Counter Strike Online, i put so much time in it because i had alot of fun, i don't let a stupid little issue ruin my fun with a Counter Strike game. This game is really worth looking into, just don't expect the graphics to be ground breaking, this isn't CS:GO, please, this brings back great memories with CS:CZ and 1.6. its a blast from the past with some awesome new game modes and Co-Op. Besides, i wanted to play this game as CSO but really, the lag killed it for me there, now its alot better.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great game if you are looking for a free alternative to CS:GO. It really takes a good turn on the First PersonShooter genre with the ability to play as a zombie. The main user interface seems a bit confusing at first but I got the hang of it",
            "review_score": "1"
        },
        {
            "review_text": "The uninstall button, the only thing that makes sense in this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game look like copied ♥♥♥♥♥. CS 1.6 + zombie mod + addons from fpsbanana = make it f2p game --&gt; $$$$ moneys $$$$ Nothing changed this same entertainment + free to pay.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game) Those people who remember the old zombie modes for Css and cs1.6 will be happy .",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike Nexon: Zombies is a fifteen year old shooter Counter Strike 1.6 packed with some new modes and, of course, a bunch of zombies. Its a decent game. The zombies are way too many to kill. Some of the maps has too little places for humans to hide from these zombies. I believe that the game need to make the zombies walk much slower and are able to have their body parts come off with enough damage to do so. Also got lvling system which is a new feature for CS 1.6.",
            "review_score": "1"
        },
        {
            "review_text": "back to Left 4 Dead 2 and Killing Floor",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: Classic 1.6 and many different modes Many new weapons and character models Tons of PvE and PvP  Cons: Menu UI Balancing issues Minor details to certain game modes (More detail below)  I feel this game is a great addition to the CS games, it not only has the original CS1.6 mode, but has tons of new weapons that you can craft and many different multiplayer modes to chose from and some great CO-OP. Though not as fun alone, when you have these people called 'friends' it makes for a great experience. Though yes some improvements can be made, such as a round start timer for the original mode (I haven't seen one myself), less structure health on Tracking mode, the hidden should be more like source, where he remains only slightly visible and you have to watch for certain things to find him, and plus no respawns in that mode (Reason I mention the hidden stuff there is because it makes it way to fast pace). Anyways thats my 2 cents on this game. Play for yourself, everyones opinion is there own... even if its wrong :D  I forgot to mention that the Menu UI is terrible and needs to be the same as the in game video settings. Also there should be more resolution settings (such as 1360x768 for me).  (If there are other things I feel need to be here I'll edit it in.)",
            "review_score": "1"
        },
        {
            "review_text": "This game actually has a bigger Community (Than the rest of the 1.6 community) and is very different in modes, style and gameplay    Pros:",
            "review_score": "1"
        },
        {
            "review_text": "Hi Everone. Please check out my profile for more reviews. :D   This game is a very terrible copy of the originaly Counter Strikes. It adds zombies in which look like pixels with high quality, runs on an 'I need money! Help the producers today!' engine. Realistically, if you enjoy Ace of Spades or Black Ops 2 survival horde mode, this may be your thing. However, once the virus is started, it takes over a clip of ammo to kill a zombie. Note that most of the time, the maps that you play in are short ranged. So, yeah, you're kinda screwed when they attack you at close range.     The headshots seem to do nothing, the pictures on the title that actually look realistic are fake, and once you made you died several times, for some reason, most people on the server dislike you. I don't understand why this couldn't be improved, but the only thing I truely enjoy about the entire game altogether is that you get to play Counter Strike 1.6 for free. But I already have it. In fact, I have all of them. And I have enough experience with games to notice that this is a poorly made game.    The horde mode/base protection, whatever you want to call it, is actually fun. Untill you get to level 11. You need at least 7 team members to survive through it, and all of them (hopefully) have to be really good players. The glitches are terrible with all of the spawn of 'zombies' (I geuss the developers thought those bunches of pixels looked like zombies) around every corner. I ran towards a zombie with full Level 9 health (135 health) and when it hit me (it was a normal one), I died immediately, resulting in a long length of impatience staring at my screen.   Sadly, the others are quite messed up as well. The graphics are just like some crap was smothered and then handed to the online players and makes them believe it looks truly 'realistic'. I appreciate the time that Nexon put into this game, since, if order and layed out correctly, it would have been a good game, but, once again, unfortunately, we have some poorly coded AI units that run around you at random directions and use their weak meelee multiple times, making you overpowered.   Thanks for reading this, and all in all, I procede to announce this review with a 6/10, which, in my book, is quite bad. Note that this was made a few months after the release, so hopefully (even though they probably won't) the company that developed this game in three minutes flat will realize, 'Oh, wait, this is a crappy game,' and improve it throughout the further updates.    Again, thanks for reading this, and check out my profile for more reviews on popular games.",
            "review_score": "-1"
        },
        {
            "review_text": "Played open beta and it was awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Here's a little piece of advice, slick. If you're looking for this type of game, go boot up Halo 3 and play the Living Dead playlist.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I got a golden rifle in less than 30 hours.                                                      10/10",
            "review_score": "1"
        },
        {
            "review_text": "To the administrators of CSN:Z, I was just wondering that if you guys are going to sell weapons each 2 updates just like CSO? Thank you",
            "review_score": "1"
        },
        {
            "review_text": "Not as bad as everyone says it is. First off, it is not completely a p2w as you can still have powerful weapons and all without having to purchase anything. Secondly, the gameplay is actually REALLY fun in regards to how confusing it is at first. I would definately recommend this game to anyone who likes the old Zombie gamemodes from CSS.",
            "review_score": "1"
        },
        {
            "review_text": "No ideas ?!? Make a game exactly like CS 1.6 and copy a mod that allready existed but add some new things like boss, sprint, any crap ♥♥♥♥ that ur head can imagine !!",
            "review_score": "-1"
        },
        {
            "review_text": "At least the uninstall feature works properly.",
            "review_score": "-1"
        },
        {
            "review_text": "The game crashed 10 times, 11th time it didn't crushed the game asked me if i want the name Le Pink Guy 20 times. After it crashed. Great story, great gameplay. But still better than Advanced Warfare.",
            "review_score": "-1"
        },
        {
            "review_text": "Did you even download the Professional Hackers 2.0 Aimbot DLC? its free! if you trade 1000 keys to your nearest DDOSer. Make sure your having fun as much as possible kiddies those guns expire!   PLS DONT PLAY DIS",
            "review_score": "-1"
        },
        {
            "review_text": "It's like CS 1.6 but worse in every way",
            "review_score": "-1"
        },
        {
            "review_text": ":(",
            "review_score": "-1"
        },
        {
            "review_text": "im going to give this game 8 out of 10  pros:great gameplay,great weapons,lots of gamemodes cons:its P2W its an amazing game tho i recommend it",
            "review_score": "1"
        },
        {
            "review_text": "When you read rewiews people are sceptic about this game, when you try yourself you find a fun in it! Try it! 8/10",
            "review_score": "1"
        },
        {
            "review_text": "How to play this game 1. Get a .44 magnum 2. Shoot yourself in the head",
            "review_score": "1"
        },
        {
            "review_text": "Whacking Simulator, whacked literally everything for about ten minutes before i got a gun, when i did get a gun it had no ammo and i had no idea how to get ammo. 10/10 would whack landmines, wood, steel, women, zombie women, zombies, fat zombies, cyborg zombies, and some weird ♥♥♥♥♥♥ plants again.",
            "review_score": "-1"
        },
        {
            "review_text": "well the problem is, its counter strike but not made but valve nexon got copyright for the game and engine, and it did a pile of ♥♥♥♥, not a good cs game the engine is very old, and even if you played cs 1.6 it doesnt give you any kind of sentimental thoughts the crafting is weird, i dont even know how do the drops work its a great example of pay to win, i played a few games and there were guys with one-hit weapons that made me rage a lot good thing its f2p, now i know that im not buying any game made by nexon",
            "review_score": "-1"
        },
        {
            "review_text": "WOW i hated this game! using a machine gun i dumped 2 full clips into a zombie at close range, nothing happened. it ran up and smacked me and turned me into a zombie. i quit. maybe i was missing something but it definitely did not appeal to me, as a human i started with 1000 health, as a zombie i had 1400+ which seemed pretty strange to me.",
            "review_score": "-1"
        },
        {
            "review_text": "Awful awful game. As it is, you'll get some hours out of it but then you'll get sick and tired of the long matches. I've only really played the PvE parts, some fun but it drags on like I said and very little reward. The game has lots of potential, but needs shorter matches and lots of balancing fixes. Doing missions solo is no different than having ten other players with you, all same difficulty. So, I'm partial with this review, it's worth playing for a little bit until you've had your share of fun with it.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, now that i have wasted an hour of my life playing this game to give a proper review, I will write my review. PLEASE NOTE: This is a beta review, my complaints could change, but I don't see that happening since this is Nexon we are talking about. Yes I am aware that this is in beta testing right now, but that is why I reviewing it, to help Nexon (if they choose to do so) fix their game. ALSO NOTE: I love Counter-Strike, all of them. So this negative review is not based on my liking of CS. Now, on to the review.   For starters, this game is Pay to Win up the booty, which is just not fine for any type of CS title, even if it is created by a different company. Every weapon you get dissapears after so long, so have fun spending your time on a weapon that will last half as long.  Second is Sounds, and good lordy, are the sounds hilariously bad. I actually had played this with my friend so I didn't experience the pain by myself. While we were playing, we first joined a lobby and were thrown into a cluster-duck of dumb, bland zombie moans, an announcer that sounds infected repeating 'the zombies will return' and things similar to that, and a guy on the radio calling in a supply drop, but the guy calling it in sounded like he just had his testicles squished in between to hammers. In the span of those 5 seconds, I was crying with laughter because of all of the insanity of sounds.  Now for the gameplay, which isn't much better. Yes, there is a classic mode, which is just CTs against the Ts, but that can't even save this game from the endless and yet almost identical gametypes with zombies. Just to kill a single zombie, (depending on what game type you are on, on some the zombies are litterally impossible to kill) it takes about 2 clips from an m4, which is way too much to kill a single zombie, as opposed to the zombies' one-hit kill with the secondary melee. Not exactly fair. As far as graphics, I don't ever honestly care about graphics, so long as they aren't painful to look at, but unfortunately, I found many textures that were just plain ugly and painful to look at in this game. I love classic graphics, but there is a difference between classic and just plain bad. Also, I guess I should mention that there are AI zombie modes, but its like a modded Killing Floor server that gives you too much money, and with really stupid zombie AI, and by 'stupid' I mean walking into walls, walking past you, etc.  Wow, my fingers hurt, so I am going to say one more thing, if you like this game, goody for you. I am not saying it is wrong for a person to like this game. I mean, this is classic Counter-Strike with zombies! But sadly, they did everything wrong with the concept of CS with zombies in my opinion.  My final verdict would be a 3/10, since it is free, and it is Counter-Strike, and I wish i could love this game like I wanted to, but this was just not what I, or many others, wanted. If Nexon could make this game more like-able, then someone please let me know when they do, I will gladly play this to change my review and update it if it is positively, dramaticly changed, but this was just a huge let-down.",
            "review_score": "-1"
        },
        {
            "review_text": "awesome game. it's like 1.6 but with more items",
            "review_score": "1"
        },
        {
            "review_text": "Barely works. After setup it says it requires steam running while setting up and even when i do that, it still says i need steam and i saw gameplay videos and the graphics are horrible like CS 1.6",
            "review_score": "-1"
        },
        {
            "review_text": "Three words: WORST. GAME. EVER.",
            "review_score": "-1"
        },
        {
            "review_text": "its Counterstrike 1.6 with a crappy zombie mode, pointless loadouts and crafting, and high pings!",
            "review_score": "-1"
        },
        {
            "review_text": "connection to the server has been terminated. Please launch the game again",
            "review_score": "-1"
        },
        {
            "review_text": "It's way to P2W. You can pay to get OP zombies and OP weapons. Also it's just CS with the zombie mod except you have terrible voice actors screaming at you everytime something happens.",
            "review_score": "-1"
        },
        {
            "review_text": "No other game have I uninstalled as fast as this... Didnt believe all the bad reviws and tried to give it a chance. This is a buggy CS 1.6 with cluttered interface, and crappy micromanagement additions. If you have ever played any version of CS, do not install this. They all are much better than this. If you havent played CS, do not install this - it will ruin your perception of an otherwise great FPS. In other words do NOT install this game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's Counter Strike 1.6 but free 420/10",
            "review_score": "1"
        },
        {
            "review_text": "the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?the hell is this?",
            "review_score": "-1"
        },
        {
            "review_text": "gg nexon.  the game didnt even start. i was waiting 10 mins and then i had to terminate the task  booo",
            "review_score": "-1"
        },
        {
            "review_text": "Pure and utter ♥♥♥♥, restarting the game because of connection issues is the most fun part of the game. It is not nearly a representation of the actual counterstrike series and should not be recommended to anyone. They wouldnt even use games this ♥♥♥♥♥♥ to torture people in Guantanamo. Had more fun shoving a banana up my ♥♥♥.   11/10",
            "review_score": "-1"
        },
        {
            "review_text": "'Connection to the server has been terminated. Please launch the game again'  It's a really good video game so far lads 68/54",
            "review_score": "1"
        },
        {
            "review_text": "Worst Game ever.",
            "review_score": "-1"
        },
        {
            "review_text": "Refuses to launch because 'This game requires Steam' I'm uninstalling this junk.",
            "review_score": "-1"
        },
        {
            "review_text": "Tone Off Zombies ! Tone Off Mods !! Tone of Fun !!!  Have some bugs but for a new game is Super Zombie Game ! GG ",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS 15/5 IGN. THIS GAME WILL MAKE U SO MLG! UNINSTALLED AFTER 2000,00 HOURS OF PRO GAMEPLAY,IF YOUR IN FaZe U WILL QUICKSCOPE THE CRACK ROCKS OUT OF THIS GAME. 420 420 RIP IN KILL NEXON ZOMBIESr( ͡º ͜ʖ ͡º) ",
            "review_score": "-1"
        },
        {
            "review_text": "Do yourself a favor and avoid this game, this is not like CounterStrike at all.   I've played CS:1.6 and CS:CZ which are very good games and worth the asking price. This on the other hand is if you took those two games and mixed them with Battlefield Play4Free, and then took a huge dump on it. The User Interface is all over the place and can be hard for new players to understand how to use it, and it litters you with all kinds of promotions and ads for items in the game. Although, once you finally understand how to navigate your way through the insane UI, you will quickly find out that it really is just a butchered version of CS:1.6 with micro transactions all over the place. The re-desings of the old CS maps are not all that great, everything feels way larger than it should feel and the new alternate versions of the maps are really nothing special. The audio is also like CS:1.6, only louder and in lower quality, even with all the audio options set to maximum.    Now for the big one, that being the zombie mode. To put it simply... it's very bad. It really feels like nothing more but the original zombie mod from all the other CS games, and dumbed down to it's simplest form. Either, run away from the zombies with no tactics or pre thinking what so ever, or run around shooting the zombies with no tactics or team work what so ever, and the zombie shelter mode is just so boring, with no pun intended, brain dead zombie ai walking around aimlessly while your turrets fill them with holes and send them back to their boring hell where they belong, or to heven if they are lucky enough.    Not to mention that this version of CounterStrike has no modding features what so ever, because all the events are actually rooms instead of independent servers. Instead, you choose from a couple main servers depending on your geographical location in real life. Because you know, CounterStrike was never known for all of it's mods and community made game modes it has.(To anyone who doesn't understand, that last sentence was sarcasm.) I really am trying to find somthing good about to say about this game, other than you can choose from female characters, which is good. But saddly you can only get those if you give them 9.99 USD, which completely destroyed any positives or upcommings for this game. There are some other things I forgot to mention like crafting and perks, but I have to be honest with you, I really couldn't bare anymore than fourty minutes with this game. Come to think about it, I would have probably have never heard about this game if it weren't for a Youtube I saw while watching a video. I wouldn't have even bothered with it if it weren't for the fact that it was a 'Free to Play' version of CounterStrike.   My final words to you are, if you think this is the Free to Play version of CounterStrike that you have been all waiting for, it really isn't, not even close. If you want to play CounterStrike, then buy any of the other CS games there are, but don't waste your time on this. I hate to say it but, this game is a disgrace to the CounterStrike community.   3/10 not recommended unless you are really looking for a Free to Play First Person Shooter.",
            "review_score": "-1"
        },
        {
            "review_text": "OMG!. this game xD another good game from nexon, ofc it's not the best graphic, and it's a copy of the old cs, but whatever you saying?. do hate it, it's f2p. though i like it. never had so much fun before, team play zombie killing ;D f*ck the graphic, it is good  i've seen only bad revommend on this game, with ppl who only played 0.4 hours??? Daaammmmm.. do not comment it then?, i bet the guy below me is under 1 hour.  but 10/10 - it's a f2p game with good gameplay, not the graphic. ",
            "review_score": "1"
        },
        {
            "review_text": "This game gave me cancer. 3/10 would not play",
            "review_score": "-1"
        },
        {
            "review_text": "This game... Imagine if you will, beating your head against the wall, over and over and over. And then you mostly have the contents of this game.  Based off CS 1.6 this game forces you to kill boxes, with many thousands of hitpoints, 15,000-30,000, and this was pretty unbearable, but then imagine that the makers decided that having the amount of damage dealt to these boxes scales down with the amount of people in the game. When you eventually get to a 'boss' it is simply one of the aforementioned boxes that does an insignificant amount of damage per attack, but suddenly will use it instant kill move. To give perspective, it can use this move with no consequence, no warning, and no escape, even right as you respawn it can do it.   The makers of this game clearly thought that harder difficulty=higher amount of enemy health, and even on easy difficulty this game is a rediculous waste of time, that will bore you to pieces while you shoot boxes blocking the path.",
            "review_score": "-1"
        },
        {
            "review_text": "Poor graphics, poor gameplay, ♥♥♥♥♥♥ weapons, and overall not too great. However, if you want to kill lots of zombies and don't have the money for L4D2, you could do worse.  Overall it can be a fun experience if you're lucky enough to not be subjected to the bugs that many people seem to be having problems with and can overlook the poor design elements.",
            "review_score": "1"
        },
        {
            "review_text": "great game really like the zombie idea",
            "review_score": "1"
        },
        {
            "review_text": "The epitome of all idiot simulators.  How to play:  If you install, you have completed the idiot simulator  I r8 n b8 8/8",
            "review_score": "1"
        },
        {
            "review_text": "Well, this game have the original mods.  A great option for people who don't have money to buy CS GO.  It's free, give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "I like zombie games, so i figured i give this one atry especially that it is free. It is a Micropayments game which i am fine with but i had one giant problem with the game. My problem was that it is unplayable ingame due something with the resolution, the way the resolution ingame looks is like it is meant to be played on an 80 inch. changing the resolution ingame didn't work at all. Did google search and found out that other people have the same problem but there is no solution for it. I recommend try the game if you have the same resolution problem me and other people had. just uninstall it.",
            "review_score": "-1"
        },
        {
            "review_text": "Exit and uninstall works.",
            "review_score": "1"
        },
        {
            "review_text": "yeah cool i play it alot on my other account            *cof*cof*P2P sometimes*cof*cof*",
            "review_score": "1"
        },
        {
            "review_text": "Detected by BlackCipher2    I think it s csnz problem but Nx not fix it give me money pls!",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game..Love it!!",
            "review_score": "1"
        },
        {
            "review_text": "Completely unneccassary. Stereotype eastern free to play flaws plague what is supposed to be a fun game mode within three much better games. Don't let the lack of a price tag fool you, this is not a good time. Play one of the other Counter Strikes, all of them have this same game mode, many more modes, and without all the free to play walls.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty fun tbh",
            "review_score": "1"
        },
        {
            "review_text": "This ♥♥♥♥♥♥ ♥♥♥ game is designed so that you have to spend your cash if you want a better gun. Even with paying cash, you are not guaranteed to good guns, rather, you get same gun over and over again. Don't waste your time playing this piece of ♥♥♥♥. Play league. It doesn't require you to use your money to buy guns.",
            "review_score": "1"
        },
        {
            "review_text": "Piece of Crap. Pros: -Doesn't Crash Cons: -The Game itself",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game :D",
            "review_score": "1"
        },
        {
            "review_text": "Zombie Shelter is where it is at! 11/10",
            "review_score": "1"
        },
        {
            "review_text": "the graphics for this game are so god dam bad every time i joined the game i threw up all over my computer if u want this game is free and it still isnt worth downloading if u wanna get counter strike then get counter strike global offensive it is worth the pay it has good graphics EPIC maps awesome dlc good graphics and different and cooler types of default guns and if u want zombies well get dayz or left 4 dead or something those are also worth the pay",
            "review_score": "-1"
        },
        {
            "review_text": "I sit down waiting for him to peak his fragile head around the corner  I wait..... Wondering how im going to frag him  AHA!  I pull out my awp, ready for him  BLAM  He ducks, right as i hit him, then i feel a tapping on my shouler  Huh?  Its a tall man, blocky, and out of shape He is drawn in nothing but green lines and a cube Then i realize, its his hitbox  POW  He hits me in the head, moments before i can breathe He stares at me, bringing out a glock He mutters a word  Help....Me........",
            "review_score": "1"
        },
        {
            "review_text": "i like it its good but not so good so 5/10",
            "review_score": "1"
        },
        {
            "review_text": "The trailer has nothing to do with the game 1/10",
            "review_score": "1"
        },
        {
            "review_text": "Whats with nexons Fetish for item rentals on to my next rant, This game isnt basically Combat arms it IS combat arms just a different name  Also i need a damn gps and 5 page tutorial on how to find a match. Do i recommend this? TOTALLY",
            "review_score": "-1"
        },
        {
            "review_text": "I gave this game a try, but it sucks; as somebody said unnistal simulator i agree.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Based on 1.6? in 2014? Seriously?  Took ages to get in, no explanations as to what all the options, crafting and skill points etc were about. No clue as to how the game actually worked.  Then it crashed.  Rubbish.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game! Couldn't even get past the main menu because I am a speedhacker, apparently. Didn't know my latency could be classified as speed hacks.",
            "review_score": "-1"
        },
        {
            "review_text": "1/10 this game is terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ you, and ♥♥♥♥ counter strike.",
            "review_score": "-1"
        },
        {
            "review_text": "Think CS 1.6 with all the based weapons nerfed and purchaseable skins and guns.  Oh and zombies...  purchaseble zombies...  CS:MSS Counter strike, money spending simulator.  My advice? Stick to one game, if you're already playing CS;GO don't kill you're wallet by playing this... Or if you decide to play for free... pretend this is a demo, cause people who'd paid money are going to be better than you, have more guns than you, and have more levels than you.  Oh yeah game lags like a car running on square wheels... no amount of micro transactions will fix that.",
            "review_score": "-1"
        },
        {
            "review_text": "WTF is that game ???? Worst use of 2.1 Gb ever ! ♥♥♥♥♥♥ graphics, horrible gameplay...waste of time !",
            "review_score": "-1"
        },
        {
            "review_text": "Bad graphics, poor gameplay, no servers available...all in all not a very good experiance. Hopefully the final product will be better, but I'm not sure if I will sacrifice any more time on it.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't like this game...",
            "review_score": "-1"
        },
        {
            "review_text": "This Game is Suck... It is better to play the original 1.6. without ♥♥♥♥♥♥ mod like this.",
            "review_score": "-1"
        },
        {
            "review_text": "Nope go and play original 1.6 or 1.5 or Counter Strike GO. Just because its free doesnt mean its good.   When i play on dust 2 i feel like movin half in the ground and flyin. Awp is op there is no real interruption while snipin. Also the design is from 1995 even 1.6 design is better then this crap. Remember 1.6 is been sold since 2000 and now even free and avaible under certain servers.   Come on man another Counter Strike 1.6 ? 1.6 was perfect we dont need no bad copy of it. Thanks ...",
            "review_score": "-1"
        },
        {
            "review_text": "What the hell was that?",
            "review_score": "-1"
        },
        {
            "review_text": "The Graphics are still need to be worked on. Its takes so long to kill zombies.",
            "review_score": "-1"
        },
        {
            "review_text": "Achivement unlocked! You have played for 10 minutes!  Everything that's bad about modern f2p lobby games made by nexon and others plastered on to this timeless classic.   Just NO.   Oh... and all servers are quite laggy which is uncommon for regular CS 1.6 hosting made by community.",
            "review_score": "-1"
        },
        {
            "review_text": "If you cannot afford a £1 game play this.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is GREAT! This game doesn't NEED good graphics to be a good game!",
            "review_score": "1"
        },
        {
            "review_text": "Its counter strike 1.6 Its really not that bad.",
            "review_score": "1"
        },
        {
            "review_text": "well the Graphics arnt to brag at but the gameplay is good if there was a out of 10 rating i would give it a 7.9 its good just not the best but then again its free to play dont expect the best but yes try this out if you can",
            "review_score": "1"
        },
        {
            "review_text": "game is honestly super fun. these kids here who only care about graphics play 2 mins see the in game lobby and leave are sad. ITs a free 2 play game with a ♥♥♥♥ ton of modes. Modes that are so unique its realy hard to get bored. LIke shelter mode is insane fun with friends build your base up and fight off zombies at night. 10/10 would leave my friends behind again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is Buggy if you want the same game and does not bug out that much just play Counter Strike Online it is the same thing but does not have NA servers but still it was more fun than this but i do like some added features in this one that CSO does not have but still i could get over them but it has the same format and everything and both made by the same people nexon and valve really fix the buggy ness in it 1 it stops me from moving when i get shot at and the lag some times and the window mode for the lobby make the whole thing full screen lazy ♥♥♥♥s Counter strike GO is better than this and i really dont like CSGO cause the Hit Boxes and the people but still nexon and valve fix this game and make it fun really CSO is Free as well if people dont know and trust me there both the same but this one has NA servers thats the only diffrent and diffrent name but trust me it is the same ♥♥♥♥ing game",
            "review_score": "-1"
        },
        {
            "review_text": "1/10 would uninstall again",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a good game but it's counter-strike and it's free.",
            "review_score": "1"
        },
        {
            "review_text": "still a better love story than twilight",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  Better than nothing  A lot of modes  ♥♥♥♥ ♥♥♥♥♥!  Cons:  Noobs  Lags  ♥♥♥♥♥♥ Graphics  pay2win",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for an improved version of Counter-Strike 1.6 then you have found it. At the moment, there are only a few mods available - Standard(like normal CS 1.6 pub servers), Deathmatch, Zombiemod. You are given the choice to pay for cool weapons with real-life money but you really don't have to as you get awarded with weapons everyday you play. In competitive(pub or deathmatch) AK47 is still the best weapon. In zombie-mod there are supply box drops which give you paid weapons for that round for free.  I would say that the only thing missing in this game are the following mods: War3, War3 + ZM, War3 + DM, SuperHero, SuperHero + DM.  I hope Nexon is reading this and will add the mods I mentioned above because then there will be absolutely no reason to play Counter-Strike 1.6.  Also, unlike Counter-Strike 1.6 decals on client-side match server-side so you can aim pretty accurately.  Overall rating: 9/10. If the mods mentioned above get implemented then this is totally 10/10.  FYI: This game is not pay2win, you can pay for weapons but its not required. This is a free game, Nexon has to pay for the hosting and other stuff somehow.",
            "review_score": "1"
        },
        {
            "review_text": "Zombies, check. Guns? Check. WTF's? check. 10/10 would break the toilet again",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would play yet always forever one of the best games that I have played in my time on steam. It's old guys don't hate on the old games. Just because you're like 'ooooooooo BAD GRAPHICS' DISLIKE it's fun embrace the fun that you had in it and don't just say hurtful things to get this game to be a low rated game! Some people love this game as do I, so, could you stop making hurtful sayings about it? Love you if so &lt;3&lt;3&lt;3",
            "review_score": "1"
        },
        {
            "review_text": "this sucks butt",
            "review_score": "-1"
        },
        {
            "review_text": "This game is free and I still didn't get my moneys worth...",
            "review_score": "-1"
        },
        {
            "review_text": "Started up and expected the orginal feels of zombie escape. In short, its P2W Nexon ♥♥♥♥ that doesn't deserve a Counter Strike title. It turn the zombie mod into this F2P with cash shop and confusing crafting and 10 day rent a item or whatever.  You are better off playing CS 1.6 or Source Zombies.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible in everyway. Horrible graphics, horrible gameplay...",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game with lots of different ways you can play; Defeat seemingly endless waves of zombies in 'Zombie Scenario' with never before seen content, featuring pursuit style, and survival/arena style, story based gamemodes. Survive the hordes of the night and scavenge for materials to upgrade your defences in the hard 1-4(co-op) or 4-8(team vs team) gameplay styles of 'Zombie Shelter'. Be the Hero with exclusive weapons or the be Zombie with exclusive skills in 'Zombie Hero' and 'Zombie Mutant', survive against former friends as they are turned into zombies, or become a zombie and infect your friends... Or if you want to follow the original story behind the Zombie Scenario play as Soi in the 'Zombie Files' and discover the real reasons why/what happened.  Or you can play the normal gamemodes with New or Altered maps; (Team) GunDeathmatch with never before seen weapons. Deathmatch or Bot Deathmatch Team Deathmatch or Bot Team Deathmatch or you can choose to play the original style modes of bomb planting, VIP assasination, or 'rescue the hostage' gamemode styles. And you can also play Basic a game mode in which you have unlimited cash and every terrorist has a default bomb to plant, but like original, after you die you have to wait till the next round before you can rejoin... 'Basic' is an easier version of original in my opinion....  OR You can play Human vs Human or rather human vs (bot) human in this Zombie scenario styled game mode which instead of facing off against zombies, you face off against human (bots, not actual online players) and their fiendish schemes  another gamemode available to play is 'FUN' literally called 'FUN', this gamemode has a variety of random minigames that you can play, for example hide'n'seek is adapted to the game so that one player becomes invisible and has to try and take down the other players using only a melee weapon, this sound OP and it kinda' is except for the negative buff that the 'hidden' player recieves: on the odd occasion when the hidden has dealt damage or has been damaged it will become visible for a short time...  'Counter-Strike Nexon: Zombies' is in many ways harder and easier than your normal 'C.S:G.O.' or 'C.S Warzone' but I for one know firsthand that it is a great game and is one that I would dedicate myself to unconditionally...",
            "review_score": "1"
        },
        {
            "review_text": "Information about the game Counter-Strike Nexon: Zombies obtained at the exhibition Gamescom 2014. The game will be released on the Steam platform and will have a F2P model of payment. Counter-Strike Nexon: Zombies - it's old-school FPS, besides CS Nexon: Zombies will not be very advanced in terms of graphics, game modes will be similar to the classic CS. 7 game modes planned with zombies. One such option some sort of story mode - which gradually turns into a mutant with mutated skills. Another version of the script - a story of people who are fleeing from zombies. Of course, in the game there will be a regime of PVP, PVE, 16 to 16 will be randomly mode when someone will become a zombie, and then infect all.  Game mode of human and zombie is different in a graphical display. The cards will be taken from both the classic Counter-Strike, and added new ones. Choose for whom it is you want to play as a zombie or human, can be from the beginning. Zombies can jump high, can fly and have other qualities which distinguish them from people. The game will be a division into floors, ie are both female and male characters. Some content in the game will be paid, although it will be available during any Event at the game.",
            "review_score": "1"
        },
        {
            "review_text": "Can use a little tweaking but other than that its great!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the worst games I have ever played and this comes form someone who used to play a ton of WarRock (a game also made by Nexon)",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible game, they took files straight out of older counterstrike games and mods, and now provied P2W fetures.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, for the time I have played i cant tell what im playing. Is it minecraft? Call of Duty? Some old timey Resident Evil rip-off? You tell me pal cuz this game is one of the wo-BEST games i ever played. 13/6 wud quikscop freakishly wierd zombie monster things again",
            "review_score": "-1"
        },
        {
            "review_text": "Is this a joke? Horrible in every aspect. Maybe if this came out 15 years ago but there are too many similar, far better games to play. Avoid! Uninstalling...",
            "review_score": "-1"
        },
        {
            "review_text": "The zombies are OP as ♥♥♥♥ while the humans are weak...",
            "review_score": "1"
        },
        {
            "review_text": "(Wonder why I give it a positive rating? Read the whole review.) This game pisses me off. It's almost a pay to win game, I say almost because you can still obtain the rarer guns just by logging in and completing some missions. However, the 'Points' system still hinders you to where you need to grind like a motherfu*ker to get the sufficant points to GET A CHANCE to get the 'good guns'. With the crafting system comes weapons that do nothing and weapons that are literally a godsend, even if you have a godgun, it runs on a temporary system, meaning YOU HAVE LIMITED DAYS TO USE THE GUN. Yes there are 72 day-Pernament materials but it's very rare to get OR you can pay for it.  Another thing that pisses me off is how SLOW it takes to level up. I almost clocked in a day AND i played the OBeta and i'm a level 7. Sure there are EXP Cupons and EXP Boost weekends, but the time it takes to reach these levels are horrendus, especually when you get a crate that you can't open because of your low level.  To add to the hard time it takes to rank up, you can be disconected from the current server your playing on! Even if you have a good connection, it's still possible that you can be disconnected, and once you do, YOU DO NOT GET XP AND LOOT DROPS. It's punishing when you play for a good hour on a zombie senario mission to get some points to craft a weapon you want, and you disconnect randomly for no reason, RIGHT BEFORE THE BOSS DIES. This happened to me more than 10 times now. I've checked my ping, and it was locked at around 30.  Another thing that just urkes my ♥♥♥♥ is when I'm playing zombie hero type modes, and it takes forever to kill the enemy zombies. I understand if the first few zombies need 7000 HP, so they can infect others, however, this becomes an issue because most of the guns can't match the Zombies HP, meaning most of the LMG's and like 1 assault rifle is useful! Pistols, shotguns, and sniper rifles are almost useless, I say almost because guns do slow enemies, some even knock back so it can buy you time. ANOTHER thing that gets annoying is the announcer voice in Zombie Hero mode, it says 'The Zombies Will Be Back' EVERY TIME SOMEONE DIES, which means YOU HEAR THAT MOTHER♥♥♥♥A 32 TIMES MAX.   However...  I still keep coming back. Why, you may ask? Well, even with all of these issues, i'm still hooked. It reminded me of the good ol' times on consoles with private matches on CoD and some servers on CS:S. The gameplay is addicting, you want to survive and fight the hoards of enemies with your friends, and finish the fight with a raid boss. You want badass weapons that your friends have, so you keep fighting the issues to obtain the items needed to craft the weapon. There are enchantments to make your guns and even your zombie character (ZH Mode) even better. There are different species of zombies, and each come with different abilities. You can join a 'family' (A clan, basically) and interact with them and play with them. There are ranked modes, and you have a sperate rank in seperate modes, so you can brag who's better according to ranks. And finally, the game comes with a free CS 1.6. Yeah, a free CS 1.6.  Honestly, I can only complain but in the end it's your choice to try it out or not. I'm giving it a positive rating because first of all, it's free to play, and second, I want you to experience the game itself, and from there you can say if the game blows or not. Much like movie critics, someone can say it sucks, and they maybe right, but who knows if you like it until you watch it.  This game isn't perfect, but still worth a shot.",
            "review_score": "1"
        },
        {
            "review_text": "No... Just... No",
            "review_score": "-1"
        },
        {
            "review_text": "nice game  but need more graphic",
            "review_score": "1"
        },
        {
            "review_text": "THIS is the best avp game and i can say it beats alien isolation but mostly beats alien colonial marines...(to be ones anny game beats aliens colonial marines )but anyway i recomand this game i just enden the predator campaign on hard dif and its awsome sadly it its just to shortt on campaign im gonna look for mods of more sp missions but anyway if u love avp series then u need to have this!",
            "review_score": "1"
        },
        {
            "review_text": "I Love Old CSS/CS 1.6. I Love The Feel When I Play CSS. I Love Older Games They Make Me Feel Nostalgia. I Hope Other's Can Enjoy This Has Much As I Do When i play it",
            "review_score": "1"
        },
        {
            "review_text": "its a good game for FREE",
            "review_score": "1"
        },
        {
            "review_text": "Bascilly the first Counter-Strike revived with a zombies gamemode. its free so ya download it.  IGN 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Don't install this game you are not sure you allready have antivirus ,but for this game i catch TROJAN HOURSE!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I Like It,But put more modes in FUN Please ",
            "review_score": "1"
        },
        {
            "review_text": "Its a pieace of sh!t  Now i can't even play it thanks to the newest update so yeah If i was Valve ill remove this b!tch A$$ game from the store its self.  My conclushen don't get adicted to it play other games for fnck sake.",
            "review_score": "-1"
        },
        {
            "review_text": "This Game is Amazing!!! 100000/10!!",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me too much of Crossfire. If you did not like the game style of the game known as Crossfire this game is almost identical to that. Sorry, but not something i see worthy of keeping. Uninstalling.",
            "review_score": "-1"
        },
        {
            "review_text": "I've absolutely enjoyed ! 9/10 ! As an advanced, experienced CS player. a lover of smashing zombies or other players I can say it's the thing I've been looking for years. An AMAZING MMOFPS with smashing everything around, using FIRE BUTTON all the time. CSNZ if u would have better graphics (like in CS:GO) it would be 12/10 &lt;3",
            "review_score": "1"
        },
        {
            "review_text": " FIRST OF ALL THIS GAME IS NOT P2W ANYONE WHO SAYS OTHERWISE IS LYING OR HAS NEVER PLAYED IT",
            "review_score": "1"
        },
        {
            "review_text": "Best shooting game ever.",
            "review_score": "1"
        },
        {
            "review_text": "Why the hell aren't you people playing this? It's basically Counter-Strike 1.7 with better gamemodes and MORE GUNS AFTER ALMOST 15 YEARS  WHO CARES IF THE MENU IS ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "game sucks ... say what you want ... 1/10 (1 Because its CS )",
            "review_score": "-1"
        },
        {
            "review_text": "its bad",
            "review_score": "-1"
        },
        {
            "review_text": "pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Finally a game that brings that old Counter-Strike adrenaline rush back that kept me stuck at the PC for hours during my childhood!!! Great game if you can get past the overloaded menu screen (confusing) and the outdated graphics (you guys COULD have used the Source engine - am i right??) --- OVERALL - good game [4 out of 5]",
            "review_score": "1"
        },
        {
            "review_text": "  I like the customizable weapons. Wish I could make them permanent.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. It's free counterstike, which is awesome. My one con for now is the recent adittion of perfect enhancement boxes. It gives a 100% chance to upgrade a weapon. This is only available in the store. Obviously, this added a huge P2W element to this game. Other than that, it relatively easy to obtain powerful weapons, so ppl paying to get those weapons don't really have much of an advantage there. If you want to try out counter strike, or just don't want to pay for it, this game is perfect for you. P.S. this is the only counter strike i've seen that also has zombies. :)",
            "review_score": "1"
        },
        {
            "review_text": "I think this game deserves new type of game pay 2 play yeaaahh *cought* its horrible",
            "review_score": "-1"
        },
        {
            "review_text": "good game but CS:GO is much better... idk... i think they didnt give their best :C",
            "review_score": "1"
        },
        {
            "review_text": "Would Recommend this game to anyone that likes fast-paced games with alot of different modes to choose from such as Team Deathmatch to Zombie Scenario to Human Scenario but this game comes with a few off-putting glitches: Sometimes when i've been playing other games then come to CSN:Z (Counter-Strike Nexon Zombies) to play a round or two i find that the whole GUI is flashing rapidly along with some ingame objects (Crates, Ladders) once i close my computer down for about 30 minutes its gone but honestly i'm not sure weather its my computer's GPU or the game.  Would Still Recommend it, just be prepared for time consumption.",
            "review_score": "1"
        },
        {
            "review_text": "Calm down people it's new game and BETA yea it's says: Connection to the server has been terminated. Please launch the game again  they are fixing the game just patience.",
            "review_score": "1"
        },
        {
            "review_text": "This game gave me diahrrea.",
            "review_score": "-1"
        },
        {
            "review_text": "it sucks",
            "review_score": "1"
        },
        {
            "review_text": "Great game, great introduction for people looking to get into the counter strike series.",
            "review_score": "1"
        },
        {
            "review_text": "it's like 1,6 but for free it's old school type counter-strike if you are an fan of games like that play it then",
            "review_score": "1"
        },
        {
            "review_text": "Great game, lots of different type of gameplays, co-op, DM, Team-DM, etc.. All for free!",
            "review_score": "1"
        },
        {
            "review_text": "Been waiting for this for ages! :D",
            "review_score": "1"
        },
        {
            "review_text": "I think this game is a good game just needs a Server download Plus it needs a workshop",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike Nexon: Zombies is a fun to play counter strike game with lots of gamemodes, guns that you can craft or buy, missions. I played it when it wasn't on steam and now i have more fun in it than before.",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is A Masterpiece icant believe its so good as hell best game ever 20000000000000000000000/2 mil",
            "review_score": "1"
        },
        {
            "review_text": "So fun! I can and will not stop playing this game! super awsome! Thank you creators for making this wonderful game!",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS THE WORST GAME I HAVE EVER PLAYED. NO ONE DOWNLOAD THIS PIECE OF GARBAGE.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible  Lag haven  Unpolished Hackers  Get CS:GO better",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME IS AWESOME but only if when you are at the menu it would go fullscreen ",
            "review_score": "1"
        },
        {
            "review_text": "This game is for Gingers. Would dye my hair again. 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "what the fukkk",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoy this game. It brings me back to the CS:S days, thank you for making this.",
            "review_score": "1"
        },
        {
            "review_text": "ShoeShing 100",
            "review_score": "1"
        },
        {
            "review_text": "look i will be straight, i love this game i am an old timer from CSN:Z when it was CSO instead i had alot of fun and met alot of people but......again 1 small issue, Nexon please fix the voice chat support issue, nobody in csnz can use voice chat beacuse it dosent support it at all i have a perfectly good mic that works in every game but every time i try it on csnz i sound like a broken radio, thats all",
            "review_score": "1"
        },
        {
            "review_text": "terrist are overpowered and counter-terrorist are nerfed. realistic textures but there jpg (aredy expected that). sepreate screen from the in game. game keeps claiming its running but its innaccsesable.",
            "review_score": "1"
        },
        {
            "review_text": "Cs with zombies",
            "review_score": "1"
        },
        {
            "review_text": "It's a really good game.",
            "review_score": "1"
        },
        {
            "review_text": "From My experience back in August of last year, I loved the game and I farmed gears for atleast one permanent gun and when I never got one but I still loved the game. Sadly this it possibly the only game nexon has done right in a LONG time seeing how its not overwhelmed with microtransactions.",
            "review_score": "1"
        },
        {
            "review_text": "Best game i ever played in CS series",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play, not too overpowered either :D",
            "review_score": "1"
        },
        {
            "review_text": "What?!",
            "review_score": "1"
        },
        {
            "review_text": "It's amazing. It's pretty much like Killing Zone but better.",
            "review_score": "1"
        },
        {
            "review_text": "I played for Just 10 mins and i hated it bad gameplay, Bad graphics and bad Everything if u do want a CS game dont get this game CS S has Better Graphics than this thing and i would buy that than get this game so Everyone who is Reading this DO NOT GET THIS GAME!",
            "review_score": "-1"
        },
        {
            "review_text": "HOW DO I GET A TUTORIAL?! I DON'T KNOW HOW TO PLAY THIS ♥♥♥♥♥♥ GAME",
            "review_score": "-1"
        },
        {
            "review_text": "Just don't. There is no reason to play this game right now. It is basically uglier cs 1.6 with a pay to win options, tons of bugs, server problems and stuff. There seems to be a lot of different modes but most of them are bad. Not to mention that sounds and voices sucks as hell (seriously, my ears were bleeding after playing this game). The only reason to play this is because it is free to download, but most of you will end up uninstalling this 'game'. Maybe after official release it will get better.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the best Counter-Strike game I've ever played. Literally all I did was own all the nuuubz and pay money to win. Honestly, this game is much worse than any Counter-Strike game. If you want a free to play that is similar to CS Play Combat Arms.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh god, kill it with fire. pliss based god, destroy this monstrosity.",
            "review_score": "-1"
        },
        {
            "review_text": "best game i have ever played would recommend it to all my friends forever",
            "review_score": "1"
        },
        {
            "review_text": "Why did valve allow this game to bare the counter strike name? This game is terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Is Good Game And Very Nice I'dont kown why all player Wirte :Bad Game : Is good game",
            "review_score": "1"
        },
        {
            "review_text": "Verry bad game :c Dont waste ur time. Stay stafe :c",
            "review_score": "-1"
        },
        {
            "review_text": "what the hell",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game. It is really fun.",
            "review_score": "1"
        },
        {
            "review_text": "I am Unable to Play the Game, it's your Job to Fix it Nexon -_-",
            "review_score": "-1"
        },
        {
            "review_text": "What do you get when you combine CS with NEXON? PURE AWESOMENESS!",
            "review_score": "1"
        },
        {
            "review_text": "You should only play this game if you suck eggs",
            "review_score": "1"
        },
        {
            "review_text": "Now you're thinking: 'Nexon? Zombies? Free Counter-Strike? Awful.' And I guarantee to you that this game isn't what you're thinking, so please hear this review out. The asthetic of the game is obviously not appealing, it's rather generic and downright awful, but if you actually check the game out, you'd find that it's literally just Counter-Strike 1.6 with a lot of unneeded crap. Whether or not you like this unneeded crap is up to you. If you don't want this unneeded crap, you can get rid of it. Here's a console command to remove the costumes from your view: 'cl_minmodels 1'. No quotations. All the characters will stay as classic Counter-Strike. There are also new weapons added into the game, they're not overpowered and are perfectly balanced. If you don't want them, simply join a classic game. Host a game and set weapons to 'Classic Only'. You can also change the HUD so you won't see 'x KILL' or the score counter. With these options, you pretty much got yourself classic Counter-Strike 1.6 for free!  That being said, the rest of the game isn't very good. The ranking system is pointless and extremely time-wasting. The crafting system is random albiet not terrible. The UI is hard to get used to and very clunky. The game is sometimes a b*tch to get launched but not for everyone. The only good game modes are Gun Game, Team Deathmatch, and Classic, although I have a guilty pleasure for 'Item Battle' in FUN mode. The Scenario modes are attrocious with braindead A.I., hitscan enemy accuracy, barriers that take way to long to destroy in order to progress, and horrendously long and generic boss fights. The cosmetics and costumization is abysmal and are beyond awful. So this whole game isn't perfect, by any means.  Although, I can't help but reccomend this because of the fact that this has the classic Counter-Strike package, along with other features you may even like. Most people on Steam have Counter-Strike but for those who don't, this is the perfect substitute. ",
            "review_score": "1"
        },
        {
            "review_text": "The zombies are really hard to kill and the game ends up being, how many people can you stuff in a vent shooting whatever comes around the corner.... gets old quick",
            "review_score": "-1"
        },
        {
            "review_text": "Game crashes on launch 10/10",
            "review_score": "1"
        },
        {
            "review_text": "nexon is so cheap, they just ♥♥♥♥♥ up a good game.",
            "review_score": "1"
        },
        {
            "review_text": "So fun i highly recommend this game to everyone.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Game won't even load I have tried almost a 100 times and it won't work and it downloads something called NEXON Hack saver. I don't recomend this for any steam player famous or not.",
            "review_score": "-1"
        },
        {
            "review_text": "i dont recommend this game for a few reasons: 1) graphics. normally i dont mind much about graphics, but it has to be decent at least to the point of the demands of today 2)gameplay. lots of glitches. sucky animations, and many disconnections. unless you can deal with this then i would recommend counterstrike global offensive. but wait for the sale. it will be well worth it.  The End",
            "review_score": "-1"
        },
        {
            "review_text": "This is a pretty good game. Zombies, zombies,zombies and more zombies. Oh yeah did i mention that there is a zombie mode",
            "review_score": "1"
        },
        {
            "review_text": "I can tell this game looks awsome but whats wrong with the SERVERS? please fix the servers now so i can play today :) probs they are fixing the servers",
            "review_score": "1"
        },
        {
            "review_text": "no wother people may say this game is ♥♥♥♥... but it is ♥♥♥♥ing awsome yes it is a reskin but u can use a mini gun in multi player a rpg a AT4 HS a M95 .50 cal barret THIS GAME IS AWSOME!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I've played it a little is seams pretty good so far",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game , cool gameplay and nice mods!",
            "review_score": "1"
        },
        {
            "review_text": "Better than 1.6",
            "review_score": "1"
        },
        {
            "review_text": "EDIT2: Well after they decided to put the game up after 2 weeks following exactly what I said, Nothing new just adding paid features such as pay for not only character skins but also recipes which are used to craft weapons. They are around £1.50 each and they make the leveling system in this game pointless why bother leveling up to open my next crate when I can buy a bunch of crates from the store. Btw I would wait before sending a bunch of cash since right now its only a small chance( if there is even a chance) to get a perma weapon. Following this review I will now be uninstalling and will only reinstall once the game is in a better condition(Which I doubt will happen).   EDIT:- Well they decided to remove the game from steam and wait 2 weeks to release it with the P2W guns, Once its out Ill look at it again other than that if you already play CSO there is now no reason you should even consider playing this game because they are getting ready to add a complete  P2W system.   After playing Counter Strike Nexon: Zombies I decided to write a review for it.  Now this game is essentially Counter strike 1.6, With the exact same engine and gameplay however you can craft new guns and most likely pay for them with micro transaction pretty soon. This 'game' plays like CS should but the only difference is that you get a built in zombie mode which makes this 'game' seem more like a mod for CS. So if you already own Counter strike 1.6 there is little reason to play this version. Even though the game is named Zombies, In my opinion the zombie mode is the worst game mode in the game, With boring and repetitive gameplay such as destory this baracide that has increased amount of health than the last 3 you destoryed while you are being horded by the same zombies that seem to only be able to do around about 10 health in damage each swing(If they even bother).  Once the game gets out of Beta or gets a big update Ill expand on this review until then I would stay away from this game as it is actually a direct copy of Nexon's other game called Counter Strike Online but with a few new maps and thats it.",
            "review_score": "-1"
        },
        {
            "review_text": "runs well, i enjoy playing it. but whenever i shut the game down (Like select quit and whatnot) it still says it's running and it won't let me reopen the game unless i completely shut my computer down",
            "review_score": "1"
        },
        {
            "review_text": "Can't shoot chickens -10/10",
            "review_score": "-1"
        },
        {
            "review_text": "Save yourselves the pain.   Gameplay is poor, its basically Counter Strike 1.6 with a ripoff of modded content being sold as a 'free to play' title with lots of premium guns and expensive things.  Just buy CS 1.6, and search for a zombie mode map to play.  ",
            "review_score": "-1"
        },
        {
            "review_text": "THE BOTS WON'T SHUT THE HELL UP!!",
            "review_score": "-1"
        },
        {
            "review_text": "if you're getting this for cs texture packs, IT DOES NOT WORK. It's all right for a free fps ",
            "review_score": "1"
        },
        {
            "review_text": "Write a review for Counter-Strike Nexon: Zombies Please describe what you liked or disliked about this game and whether you recommend it to others. Please remember to be polite and follow the Rules and Guidelines.  would rather taste my own ♥♥♥♥♥ while ♥♥♥♥♥♥♥♥ butt naked with my gun in the bathroom.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is ♥♥♥♥ing ♥♥♥♥. How it was conceived is far beyond me, as it's literally CS: Source with ♥♥♥♥♥♥ pay2win system that will have six year olds stealthing their mom's credit card to play as a girl with a grenade launcher. I think that one sentence alone just explained the whole play experience.",
            "review_score": "-1"
        },
        {
            "review_text": "While many of the reviews have spoken poorly regarding this game, I would have to assume they are from children or stubborn trolls who are closed minded. The anti cheat, server system and game modes all work very well making this a great alternative to cs 1.6 and also a great way to get newbies into the cs community. The zombie modes are very entertaining and the regular servers are consistantly updated. Great free to play game!!! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's so amazing game i playone day and its so fantastic like this game download ",
            "review_score": "1"
        },
        {
            "review_text": "-10/10   ",
            "review_score": "-1"
        },
        {
            "review_text": "160 kills / 51deaths, 100 headshoots, 2granate kills in Deathmach... How culdn't I like this game? :D  It's Nice one",
            "review_score": "1"
        },
        {
            "review_text": "  ITS PAY 2 WIN     (im so sorry if this offend you but please fix it and read it carefully i said this while im angry of i couldnt even win these 3 days even tho i supported you nexon with 25$ i hope u understand me as a regular csn:z player i love this game but this really annoys me... annoys us .. my friend left this game for this reason)  Plus the game have very weird balancing you can get items that you ALREADY have and nexon is like DEAL WITH IT i got 500 freaking trancedence from the m4a1 dk and the ak paladian event and they gave me few blue prints that i got with ♥♥♥♥♥♥ weapons that i already have i thought every 200 trancs piece is a premium piece from decoders and only things i got is ♥♥♥♥♥♥ weapons..the game doesnt EVEN have a friends system or a party system wich players or friends can play with each other PLUS the charcters are too expensive and their buff is only with scenario mode those are in my personal opinion are the reason why people hate this game or leaving it  like a player that have played the game for 1 year can get beaten easily by a rich kid that bought alot of transcendence decoder.. if they fixed this im sure this game will be almost PERFECT i think alot of people agree with that",
            "review_score": "-1"
        },
        {
            "review_text": "it says 'The server has been terminated' every time i load up the game at the moment this game is un playable",
            "review_score": "-1"
        },
        {
            "review_text": "Better than cs 1.6 c: But go i best.",
            "review_score": "1"
        },
        {
            "review_text": "This pretty much looks like any ♥♥♥♥ing microtransaction game from the rice fields of Korea. In-depth explanation: CSN:Z is a standalone game based of CS 1.6'S Zombie Mode, graphics wise and game play wise.  However, this game (as mentioned above) is a microtransaction game which means to actually kill the zombies single handedly, you've either got to 'rent' or 'buy' the guns, which involves opening up your wallet to the Korean Gaben.  Also after playing this game my computer refused to start up completely, (NOTE: it was fine BEFORE CSN:Z was installed) after figuring out that this game was presumably the problem, I was forced to factory reset my computer to get rid of all the ♥♥♥♥ that this game left behind. 0/10 never playing this cash grab game again.",
            "review_score": "-1"
        },
        {
            "review_text": "Never let this awfull game offend my eyes again - a pure insult to all the counter strike games.",
            "review_score": "-1"
        },
        {
            "review_text": "THES GAME SUCKS SO BAD CANT EVAN PLAY THE GAME  ",
            "review_score": "-1"
        },
        {
            "review_text": "Counter strike Nexon zombies is Realy best Counter in the World :D",
            "review_score": "1"
        },
        {
            "review_text": "Free hip fire simulator better Than gta v",
            "review_score": "1"
        },
        {
            "review_text": "booty",
            "review_score": "-1"
        },
        {
            "review_text": "420",
            "review_score": "1"
        },
        {
            "review_text": "booty",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks ♥♥♥♥ you might ♥♥♥ well buy csgo for 15$ than play this free crap ",
            "review_score": "-1"
        },
        {
            "review_text": "Holy ♥♥♥♥ this is a PERFECT GAME!",
            "review_score": "1"
        },
        {
            "review_text": "I had more fun reading the reviews.....Than playing the game.  Do not get, unless you want ebola.",
            "review_score": "-1"
        },
        {
            "review_text": "My mom told me to stop playing this game all the day and do something else. She was right.   -0/10",
            "review_score": "-1"
        },
        {
            "review_text": "biggest pile of shait i ever seen .. no really .. imagine cs 1.6 with ♥♥♥♥♥♥ zombie sounds.",
            "review_score": "-1"
        },
        {
            "review_text": "Mediocre but not bad",
            "review_score": "1"
        },
        {
            "review_text": "A stain on my harddrive",
            "review_score": "-1"
        },
        {
            "review_text": "It's a nice game looks more like Counter -Strike 1.6 but is perfect !!",
            "review_score": "1"
        },
        {
            "review_text": "pretty great i remember playing this in css and i had tons of fun now its free for all and its great i recommend to any cs go fans and zombie fans",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS GAME I HAVE BEEN WAITING FOR THIS FOREVER TO COME OUT TO THE USA. I PLAYED THIS GAME WHEN IT WAS IN BETA for KOREA. ITS SO FUN MAN EVERYONE NEEDS TO GET IT. GREAT THAT IS FREE 2 PLAY. IGNORE ALL THE BAD REVIEWS ALL THESE KIDS ARE BUTT HURT THAT THEY CAN'T RUN THE GAME LOL. like a computer from 1998 can run this game. a toster could run this GAME LOOKS GREAT IN 1080p almost as good as CSS but its really more like 1.6. it bring back that classic feel but also with a lot of new stuff. I have never had a connection problem with this game so far. I really hope that they bring counter strike online 1 and 2 to steam also. I don't know what people were expecting its not going to be better than csgo. its more like a mod of 1.6, and its just going to get better and better. you guys will see. and the people that have a problem with the main menu is always in 1024x768 you can change it mine runs at 1080p. kids are just to young to play and don't know how to work a computer.   game get an 11/10. just wait till they patch it if you can handle it.   私は永遠にアメリカに出て来て、私はこの待っているこのゲームを愛しています。 ITは韓国のためにベータ版にいたとき、私はこのゲームをプレイ。 誰もがそれを取得する必要があります。 GREAT 2 PLAY自由であること。これらのすべての子供たちは彼らが wwwwwww ゲームを実行することはできませんバット傷つけているすべての悪いレビューを無視します。のような1998年からコンピュータがこのゲームを実行することができます。このゲームを実行することができは、CSSと同じくらい良い1080に大きな見えますが、その本当に多くのような1.6 。それは新しいものをたくさんしても、その古典的な感触を取り戻すが、 。私はこれまで、このゲームとの接続に問題があったことがない。私は本当に彼らがカウンターストライクオンライン1と2も水蒸気に持って来ることを願っています。私は、人々がそのがcsgoよりも良いことを行っていない期待していたのか分からない。その多くのような1.6のモッズ、そして、そのちょうど良く取得するつもり。あなたたちが表示されます。  メインメニューに問題がある人は、あなたが私のものは1080で動作し、それを変更することができます1024×768で常に。子供たちはただプレーする若手にあり、コンピュータを動作させる方法がわからない。  ゲームは11月10日を取得します。ちょうどあなたがそれを処理できるかどうか、彼らはそれにパッチを適用するまで待ちます。",
            "review_score": "1"
        },
        {
            "review_text": "The game it self is a fun concept but is very very grindy if you have no money  It has improved a bit but the main part of the game is really bad and I wish it could be better but it aint gonna happen  If you 50$ to spare get the starter stuff in the game but other than that it tried  I do play this game but not very much,because people who have alot of money to spare have better guns than me   all I can do is try but please rebalance this game the DLC crate guns are to OP  ",
            "review_score": "-1"
        },
        {
            "review_text": "I have only played the zombie game modes, but I've never seen such a deplorable zombie-tagged game. The game is overall frustrating trying to kill zombies, or even killing players with them. Human guns against zombies are like shooting spitballs, but if you get shot, you literally can't even move, especially as a zombie! On top of that, zombie players 1-hit to infect kill and makes it a pain in hole for getting spawn-killed at the first few seconds of the game! Zombies are as fast as balls and can jump somewhat high, and to me it feels completely unfair since the zombies can instant kill humans. I've spent an hour looking at the zombie gamemodes they feel almost the same except for zombie escape which is still terrible. Honestly, I think I've had more fun playing CSP zombie survival on my school laptop which makes me laugh thinking about it. To conclude, do not install this game because it is a waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game but could have better graphics.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Counter-Strike 1.6 but with ♥♥♥♥♥ier graphics, pay2play, zombies, and stupid maps. But on the plus side, it comes with a free virus!  Pros: Free Zombies Free Virus  Cons: Outdated Pay to Play Zombies Free Virus",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing mutiplayer game, it has soo many cool ad-ons which make it an really interesting game!",
            "review_score": "1"
        },
        {
            "review_text": "Dont get this game, it will either make you hate it (97%) or it will make you into another mindless bot paying $$ for female characs(0.1%) or you will somewhat like the game (1%) and the other 1.9&amp; i dunno. you can hate it cause it's broken menu, bad graphics, rip off of cs 1.6, P2W, and came from a game all the way from the asians them selfs with RNG and micros everywhere. it has consumed my life, dont let it consume your's. By the way i still perfer this over the OP old people in 1.6 or the randoms complaining about me being bad in CS:GO. :D",
            "review_score": "1"
        },
        {
            "review_text": "i like this game i got a lot of good stuff well if you started as a new player its ok. being new its always better reason? you may have good stuff instead of having thinks that you dont like &gt;.&lt;",
            "review_score": "1"
        },
        {
            "review_text": "this is way better than left 4 dead",
            "review_score": "1"
        },
        {
            "review_text": "the graphics are interesting...",
            "review_score": "1"
        },
        {
            "review_text": "Its counter-strike 1.6 with some new mods, new weapons, new character skins,etc. i rate this game 7/10 because they push out update's slowly and sometimes it's just only 2 new weps    Do i recommend this game?",
            "review_score": "1"
        },
        {
            "review_text": "The game itself is very good, I like how it adds some aspects of not only the zombies but also aspects of pvp, players vs. bots. I really dont think there is much else to add to the game, possibly a more clear menu of gamemodes but still overall the game is astounding.",
            "review_score": "1"
        },
        {
            "review_text": "Likes: First Person Shooter Viraty of Game Modes The Guns The Broken Currency when Buying In Team Death Match w/bots The Accurcy Dislikes:  Game is Still Open After Closing it The Lag When People Shoot You... It is HORRIBLE it is like you are getting away... NOPE slung back to the line of fire... Another Dislike is the lack of INFO about how to make rooms/how to choose game modes.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but it need to NERF alot of sniper rifles. Alot of raging quickscopers. ALot of ♥♥♥♥ING MLG WHEN I NO WANT OR WHEN I DONT HAVE WEED. I hope they will add more guns and maps ^^ 9/10 Theres no pay to win! You need just craft! Craft its free!",
            "review_score": "1"
        },
        {
            "review_text": "Horrible!",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, but it need to NERF alot of sniper rifles. Alot of raging quickscopers. ALot of ♥♥♥♥ING MLG WHEN I NO WANT OR WHEN I DONT HAVE WEED. I hope they will add more guns and maps ^^ 9/10 Theres no pay to win! You need just craft! Craft its free!",
            "review_score": "1"
        },
        {
            "review_text": "don't even bother to download, just don't.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, but it need to NERF alot of sniper rifles. Alot of raging quickscopers. ALot of ♥♥♥♥ING MLG WHEN I NO WANT OR WHEN I DONT HAVE WEED. I hope they will add more guns and maps ^^ 9/10 Theres no pay to win! You need just craft! Craft its free!",
            "review_score": "1"
        },
        {
            "review_text": "1. Visually looks bad. -This includes awful animation, textues and the models. Dear god, the models.  2. The game RUNS poorly. It's badly optimized or locked at a low FPS, perhaps. But on the rig I have, there's no reason for this to be the case.  3. The music is awful and the sound quality is barely passable.  -Also, the main menu music carries on into the game, and it doesn't fit whatsoever.   Try it if you want, since it's free. But don't expect much. And please don't put any money into it.",
            "review_score": "-1"
        },
        {
            "review_text": "Very nice, i love going back to CS 1.6 and the custom weapons are amazin",
            "review_score": "1"
        },
        {
            "review_text": "I' like this game :)",
            "review_score": "1"
        },
        {
            "review_text": "Ok new review for this game as my last one was crap. first of all pay to win like hell, second no skins (jk) third cheaters and campers, oh just a quick suggustion if you want a free counter strike: critical ops, can be gotten on Android PC (via facebook) and IOS and it aint pay to win, only paid thing is skins.  End of review           why are you reading this? lol",
            "review_score": "-1"
        },
        {
            "review_text": "BEST GAME EVER MY NIGKAS LOVE ALL THAT DECODER ♥♥♥♥ WE GOT VERY MUCH GUNS SO CAN KILLED ALL THE ♥♥♥♥INJ HOOD BLACK NIKKGAS THINKED THAT THEY ALL KONNA DIE LIKE FLIES BUT THEY SURVIVED EVEN MY PLASMA GUN, THIS PLASMA ♥♥♥♥ IS BETTER THAN MY NERF MINIGUN LOL HASFTTAG MOM MAKING POTATOS",
            "review_score": "1"
        },
        {
            "review_text": "Detected by Black Cipher 2 ... ♥♥♥♥ THIS GAME",
            "review_score": "-1"
        },
        {
            "review_text": "The uninstall button works awesomely! the P2W guns are overpowered and you dont stande a chance! its that good!",
            "review_score": "1"
        },
        {
            "review_text": "Basically CS 1.6",
            "review_score": "1"
        },
        {
            "review_text": "The game is good and fun the title says: Zombie but there is a lot of play modes its Pay To Win thats true, but who cared? ;P i know its unfair but who says you need to be Premiun to have fun in a game its rly good LIKE",
            "review_score": "1"
        },
        {
            "review_text": "Its a really good game.Its like if this was real zombie invasion.My only dislike is the fact that one hit from a zombie,your a zombie,but thats what makes it realistic.",
            "review_score": "1"
        },
        {
            "review_text": "Love the weapons and Characters also Gamemodes because I mostly like to play Half Life 1 mods",
            "review_score": "1"
        },
        {
            "review_text": "Pressed the 'Play' Button, it bugged and wont start, even that it says im ingame Tried to start again, it says app already running  11/10 would uninstall again",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game ive played in a while",
            "review_score": "-1"
        },
        {
            "review_text": "lets some check this game.  1.looks ugly, im not graphic men 2. gameplay sucks  3.weapons crafting with items, nice 4.your can not without money buying chars  go and load counter strike 1.6 or global offensive, nexon your sucks to much",
            "review_score": "-1"
        },
        {
            "review_text": "*OPENS GAME* *PLAYS FOR 5 MINUTES* *CLOSES OUT OF GAME* *REOPENS CS:GO* It's a free game, but it's still pretty lame. 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "I like the part when you uninstall it",
            "review_score": "-1"
        },
        {
            "review_text": "it sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly I could not get anything going on this. The aim was way off, and the controls were all different.",
            "review_score": "-1"
        },
        {
            "review_text": "C.S with free content microtranactions skins guns. Good game not graphic wise but gameplay value and what u get from this is CS with some very fun things give it a try don't judge util you play it.",
            "review_score": "1"
        },
        {
            "review_text": "cool never played the zombies in this game though i play original :D",
            "review_score": "1"
        },
        {
            "review_text": "Here's the thing: The game's good &amp; such, BUT The region's prices for items is pretty insane &amp; different: If you're european, you'll have to pay TWICE the price - 2 euro - for 1 weapon package. If You're african/estonian - 1 EURO. If you're RUSSIAN - 0.6 EURO (as in ~30 rubles) If you are gonna be spending money on this game, then don't - This is a robbery!",
            "review_score": "-1"
        },
        {
            "review_text": "it's pretty good and really fun, Nexon, just please fix ur probs on ur games asap/faster",
            "review_score": "1"
        },
        {
            "review_text": "Fun game to play with friend , many funny modes , u can rank up and level up !!!!",
            "review_score": "1"
        },
        {
            "review_text": "this game is awsome i play it all day and all night but they need to make a gun that can kill zombies in one hite",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME i'VE PLAYED IN A WHILE. gREAT SERVERS ALONG WITH AWESSOME CUSTOMER SERVICE. ALTHOUGH HACKERS CAN BE AN ISSUE. OH WELL :)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game but it's PayToWIN...",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game ! :D",
            "review_score": "1"
        },
        {
            "review_text": "pretty lame, i had greater expectations",
            "review_score": "-1"
        },
        {
            "review_text": ":]",
            "review_score": "1"
        },
        {
            "review_text": "Pretty cool that I can play this game for free even after my account has been goldsource VAC banned for almost 8 years now!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game if you're looking for something to mess around on.",
            "review_score": "1"
        },
        {
            "review_text": "I can't recommend it, only play it because my friends beg me to play it.",
            "review_score": "-1"
        },
        {
            "review_text": "Just don't. Save yourself the disapointment and pain.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not worth it because it's boring and the gameplay is really rough. The only good thing is that you get to play CS 1.6 for free. ",
            "review_score": "-1"
        },
        {
            "review_text": "That moment when your dad leaves you because your white",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty cool. But it seems like its just a counter strike for people that want csgo but arent allowed to get it, or just in general too much of a jew to buy it",
            "review_score": "1"
        },
        {
            "review_text": "I recently put in a review, but i deleted it so i will give a shot summary  I HAVE PTSD FROM THIS GAME, DO NOT GET  Sincerly,  Hoxtinator",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to CS 1.6",
            "review_score": "-1"
        },
        {
            "review_text": "Good game. Having good time in this with friends. Keep going!!",
            "review_score": "1"
        },
        {
            "review_text": "basicly, this is a free edition of CS (Counter-Strike)",
            "review_score": "1"
        },
        {
            "review_text": "Believe It or not, the best part of the game is the one that doesn't have zombies on it. Play it for a while(to practice) then buy counter strike 1.6/source/go.  edit*  good things: - it has a flashlight",
            "review_score": "1"
        },
        {
            "review_text": "Fun for ♥♥♥♥ing around in with friends but thats all so about a 6.9/11",
            "review_score": "1"
        },
        {
            "review_text": "do you want a cs 1.6 but getting it for free well there is this game",
            "review_score": "1"
        },
        {
            "review_text": "I liked the game but one hit to be a zombie was kinda lame because zombies take like 80 bullets to take them out so its kinda unfair... Also if this is counter strike remake and yes I know it was made by Nexon but it doesn't seem like its even runing on the source engine I mean it seems like a mix of the old engine they used for half life and all that and also kinda a bit of the source engine... I mean just its okay.... but it looked exiting when I saw it and it was free just if this was a price then I would absolutly would not recomend but it was free so yeah! But gameplay was unfair didn't keep a balance between teams so if they were to add a meter to how much infected you are then it would make it more fair. Server connection was pretty good so connecting to servers without losing connection is not as common. graphic wise it would be an ehhhhhh not so great becuase this is a game that game out in 2014, well I would expect better lighting and textures at least and there wasn't. I mean portal 2 came out in 2011 and it had better graphics but I don't know maybe because they don't own the source engine they can't boost it, so that may be the issue. Repeditive I woul say not really I didn't play all the gamemodes but I do know that there were alot so I would assume that it isn't as repetitive. Do I recemend it? ummm the gameplay is still kinda unfair and graphics eh if your the type that don't care about graphics then okay.  1-3 crappy  4-6 eh 7-8 good 9-10 great  70 points not as good 80 points good 100 recomend  graphics-5 gameplay-7 repititive-9 (its not as repetative) overall-66 it was good but no really that great...",
            "review_score": "-1"
        },
        {
            "review_text": "This is just... wow. I don't know what it is, but I don't like it either. Weapons feel useless, and I'm almost certain making this a Counter Strike game was just a waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "Cool game but i recommend this for older audieces          JK FOR ALL AGES!",
            "review_score": "1"
        },
        {
            "review_text": "this game is better than cs 1.6",
            "review_score": "1"
        },
        {
            "review_text": "biggest ♥♥♥♥ing joke and shame to the CS community. Its like no one has morals anymore. ",
            "review_score": "-1"
        },
        {
            "review_text": "Its a decent game. the main gamemode i played was like deathrun but running away from death who is chasing you down. I wasnt interested in anything else but otherwise i didnt play much else. it was just a mix of a bunch of source games with zombies shoved up the tailhole",
            "review_score": "1"
        },
        {
            "review_text": "By the love of Gabe, the knees of Vectron, the beard of the Prophet , the Pasta, and the Sauce, and the Meatballs, DO NOT INSTALL THIS @#%@#$%@#%$@# GAME  And if you did install this game, dont bother starting up the game, just save yourself the disappointment and the shame and start pressing that uninstall button NOW!!",
            "review_score": "-1"
        },
        {
            "review_text": "this is a game? i thought it was just a long string of microtransactions did EA make this or something?",
            "review_score": "-1"
        },
        {
            "review_text": "When you play you better turn your volume down because it is just a cluster ♥♥♥♥ of sounds. zombies are over powered",
            "review_score": "-1"
        },
        {
            "review_text": "The game is good but it is soo Pay 2 Win???",
            "review_score": "1"
        },
        {
            "review_text": "just another terrible free to play zombie game from nexon, I understand it's free to play but this 'free to play' it's not really a free to play , you pay with the wasted 10 minutes you invest in this pathetic excuse of a game.",
            "review_score": "-1"
        },
        {
            "review_text": "A Really Funny Game For People Who Dont Have Much Money I Reccomend To All",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS SO BAD. CAME OUT AFTER CSGO AND ♥♥♥♥♥♥ GRAPHICS THIS GAME SUCKS. I WOULD RATHER PLAY COD THAN THIS ♥♥♥♥. ♥♥♥♥ NEXON AND THEIR GAY ANIME CHARACTERS.   -69/10",
            "review_score": "1"
        },
        {
            "review_text": "ehhh its free so I cant complain",
            "review_score": "1"
        },
        {
            "review_text": "Not really?",
            "review_score": "-1"
        },
        {
            "review_text": "'Your connection to the server has been terminated, plese re-launch the game.'        10/10 would Re-Launch the game again.",
            "review_score": "1"
        },
        {
            "review_text": "I killed my friend with a snowman that had a bomb strapped to it. I shot my friends leg and got a head shot. I shot a wall and got a headshot on my friend. I fell 2 feet and died. I played soccor with my friend. I used a nuclear bomb and killed my friend. I played on a map with over sized objects. Your character is the size of a smurf.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Uninstalling Works FIne :)",
            "review_score": "1"
        },
        {
            "review_text": "this is a really good games ",
            "review_score": "1"
        },
        {
            "review_text": "impossible to play 'This game requires steam' ITS RIGHT THERE!",
            "review_score": "-1"
        },
        {
            "review_text": "had so much fun plaing this and collecting resources xD we won on my first try and killed final boss!",
            "review_score": "1"
        },
        {
            "review_text": "nostalgic af ? : check op weapons that make the game unbalanced ? : check fun missions , and a ♥♥♥♥ load of maps ? : check  some free drops if u lvl up ? : check free ♥♥♥♥ when events/maintenance ? : check a load of players ? : check  10/10 would laugh at nostalgia again",
            "review_score": "1"
        },
        {
            "review_text": "The zombies will return, but I won't.",
            "review_score": "-1"
        },
        {
            "review_text": "why the hell does it keep saying 'you need steam to run this game' where the ♥♥♥♥ else am i going to get it? tacobell?",
            "review_score": "1"
        },
        {
            "review_text": "2 words, Temporary, Weapons.  I mean, seriously. its like cod online with this many amazing but temporary weapons",
            "review_score": "-1"
        },
        {
            "review_text": "aids just aids and more aids oh and spyware  sh it/10",
            "review_score": "-1"
        },
        {
            "review_text": "So I decided to play this game again: 1. Launching took forever 2. I was banned for hacking/cheating 3. I didn't do neither of them  Don't install this game. ",
            "review_score": "-1"
        },
        {
            "review_text": "tbh this is a pretty bad game i mean the graphics arnt all that great considering the game is from 2014 and the zombies are really op they have like 10k+ health and 1 shot, on the other hand when the survivors shoot a zombie they get pushed back if you are getting shot by like 3 people you cant even move compared to killing floor this is a awful game i dont recomend playing this",
            "review_score": "-1"
        },
        {
            "review_text": "I really like it :} fun",
            "review_score": "1"
        },
        {
            "review_text": "Crashed when opened :L",
            "review_score": "-1"
        },
        {
            "review_text": "My exit button doesn't even work. Send help. Please.",
            "review_score": "-1"
        },
        {
            "review_text": "Listened to a guy scream over his mic saying that he was getting ♥♥♥♥♥ by zombies which sounded like a robot.  911/10",
            "review_score": "1"
        },
        {
            "review_text": "Infested with microtransactions. Kids with overpowered guns that were bought through microtransactions will camp in a corner and win the match. Every. Single. Time. Only play if you have a craving for some tasty cancer.",
            "review_score": "-1"
        },
        {
            "review_text": "Playing shelter survival with friends, ♥♥♥♥♥♥♥ joins, destroys every building and quits... 10/10 would be annoyed again... I am still tracking the guys IP but he wont live long...",
            "review_score": "-1"
        },
        {
            "review_text": "This is how aids was created 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Very crappy graphics but its also glichy andun balenced at times...",
            "review_score": "-1"
        },
        {
            "review_text": "one of my fav games (y)",
            "review_score": "1"
        },
        {
            "review_text": "I cant lost my time in this game its bad",
            "review_score": "-1"
        },
        {
            "review_text": "I know that this game is hated on, but in my opinion it's actually pretty good. If you can't afford any CSGO games, this is great.",
            "review_score": "1"
        },
        {
            "review_text": "home made game with potato graphics and audio by a can of pringles",
            "review_score": "-1"
        },
        {
            "review_text": "Cancer Kill your self please",
            "review_score": "-1"
        },
        {
            "review_text": "for a free game is is amazing i would of happily paid for it if i knew it was this good",
            "review_score": "1"
        },
        {
            "review_text": "its simalar to cs:go in multiplayer wise but cant compare to cs:go  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is cool and all but I wish there was a singler player mode",
            "review_score": "1"
        },
        {
            "review_text": "this games sucks and thats all you need to know",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game sometimes to play zombies with friends.",
            "review_score": "1"
        },
        {
            "review_text": "  Originally posted by  Community :",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game because its a really fun first person shooter game, a lot of people are friendly.",
            "review_score": "1"
        },
        {
            "review_text": "The best game I have ever played in twenty years of computer gaming, bar none (and I have played a LOT of games). Eight years on I can still recall how profoundly that game gripped me, and I am not an overly emotional person. You will care about the characters, you will be moved, you will make choices that tell you more about yourself. It sounds trite, I know, but it really is that good. If only someone would make more of these...insightful, intelligent, devastatingly creative. Fallout is the only RPG to come close. A word of warning: You MUST read all the text, explore all the dialogue options, if you are to gain the most from the game. A decent intelligence and wisdom score is recommended.....although so is a decent score in everything else....the game does the best job of making usually superflous statistics genuinely useful that I have ever seen. Still very much worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "its a good game not any good graphics its srsly un fair thoue cause u get *CUSTOM WEPONS* like the cyclone which shoots a beam at you and then kills you in a good 5 secs and the storyline is just rly stupid dosent make sense at all oh and the zombies rly over powerd but u find these places were the zombies cant reach you *mostly due to the guns firing at them specficly the custom ones* cause your camping for a good 3/4 of a round and then u run around cause the zombies figerd out a way to get up in your camping area and most of the games i play is just zombies thier is Team Death Match which is good tons of players usaly from other countries mostly russia as for the maps you play in it ummm how can i put this Dust 2 huge advatge for the terrioste none for the counter guys and thats mostly cause of the custom stuff they have specficly the guns they just spawn camp as for the other maps thier fair but dust 2 is the most played and for the other maps that are more amazing than dust 2 have been ignored but other than that good game not good graphics i gusse its Quanity over quality *due to the fact that 3rd world peeps play this the most cant blame them* but its reptive and the missions are ridcules u need a good 6 guys just to beat it so ya thats meh review",
            "review_score": "-1"
        },
        {
            "review_text": "as for free game is very good",
            "review_score": "1"
        },
        {
            "review_text": "a horrible game to call cs",
            "review_score": "-1"
        },
        {
            "review_text": "this is the kind of game that people look at the reviews and look and this game is by far the worst of its kind",
            "review_score": "-1"
        },
        {
            "review_text": "this game requires you to sink a ridculus amount of hours into it in oreder to be able to truly play its not fun when your low level and have the basic equipment ",
            "review_score": "-1"
        },
        {
            "review_text": "bust gume 420/666",
            "review_score": "-1"
        },
        {
            "review_text": "I only played for about 20 min, but the game has a dumb background process, so I never noticed.",
            "review_score": "-1"
        },
        {
            "review_text": "Why the HECK would you play this peice of ♥♥♥♥. The graphics are ♥♥♥♥, The audio is ♥♥♥♥, people look ♥♥♥♥, so does the zombies. i'm enbarresed that i wasted nearly an hour playing this. AND THE COMMUNITY: most are AFK, and the players are just 6 year olds that stole their parents credit cards to buy guns, yes all the weapons cost REAL MONEY! The trailer does not look ANYTHING like the game, neither feels like it. I'D RATHER WATCH MY LITTLE PONY!!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is absoulute terrible! It has the first Counter Strike Graphics, very buggy, I get disconnected and sometimes kicked from admin abuse.",
            "review_score": "-1"
        },
        {
            "review_text": "Why buy counter strike when you can get free counter strike!!!  no seriously, it's a ♥♥♥♥in port of counter strike source, WITH ZOMBIES.  so get it.  now",
            "review_score": "1"
        },
        {
            "review_text": "Its good but the wepons should be a little hight damage becose they are not doing something but the game is cool and I recommend this to play !!",
            "review_score": "1"
        },
        {
            "review_text": "It is very much like any paid version, i love it and hope you will!",
            "review_score": "1"
        },
        {
            "review_text": "Wow what a load of garbage. Bs f2p mechanics and the zombies have 10000+ health not even a game.",
            "review_score": "-1"
        },
        {
            "review_text": "this game wow, its like playing the very first counter strike, but with the lag of cod black ops",
            "review_score": "-1"
        },
        {
            "review_text": "i love it.. but since you cant buy weapons from the store with points makes it hard... the other version called 'counter strike online' that was launched in singapore.. was a little better,weapons were available on the shop. keep the game updated please..",
            "review_score": "1"
        },
        {
            "review_text": "This is Counter Strike 1.6 with Zombie Mod , mods like mode for cs 1.6 zombie plague advance ahhahahahahha and is free CS what do you want more : ) Have FUN",
            "review_score": "1"
        },
        {
            "review_text": "You know this game is dogshit, you just don't want to believe it yet. Trust me I know it's ♥♥♥♥.  How?  Because this title doesn't even show up on Nexon America's game list. (With exception to Atlantica Online, and Combat Arms, Those are still ♥♥♥♥)  Why?  It's on Nexon Europe's website and Didn't get the A in history of video game engines, thus falling face first into the dirt we have labeled 'Adorable Failure' and did not get the memo that Goldsource is outdated while also attempting to sneak RNG(Crafting) and microtransactions (Anything permanent) past us. This also proves to us that Nexon Zombies did not pass it's public relations class, welcome to the family of games one and a half decades too late for their time Nexon Zombies.  And I am completely aware that this sounds like an incoherent rant but then again play this for a good five or so hours and you will be ranting incoherently too, understandably.",
            "review_score": "-1"
        },
        {
            "review_text": "First time I saw this: 'meh, another f2p game' After I played it: DIS GAME IZ DA BEST!   Pay to win? Hmm idk since they give you a lot of money in the beginning (Played 4 hours straight at first) ",
            "review_score": "1"
        },
        {
            "review_text": "wont eve ♥♥♥♥♥♥ start load of ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "People say that this game is '♥♥♥♥.' Well i completely disagree with this opinion, this game has alot of features: (Zombie Scenario, Zombie Hero (Zombie pvp for short), and many more!  Weather you like it or not, IT AINT ♥♥♥♥ ONCE YOU START PLAYING IT FOR A GOOD AMOUNT OF ROUNDS.  So i recommend this game for the grab bag of gamemodes that this game features. You can also craft weapons for a certain amount of days, and there is an alternative way for getting free weapons, (Decoders for example.) And sure it has some in game purchases, but that hasn't stopped me from playing this. This game is really fun and i think you should try it!",
            "review_score": "1"
        },
        {
            "review_text": "Theres something weird i only got to play the game once then i tried again it said it requires steam and i have Steam?  Is that a bug/glich?",
            "review_score": "1"
        },
        {
            "review_text": "Take the best game you have and add the thing you hate the most. That is what this game is like.",
            "review_score": "-1"
        },
        {
            "review_text": "Its like cs go but with less russians its like cs go but with cs 1.6 graphics its like cs go but with less money needed to be spent its like cs go but with ♥♥♥♥ zombies Overall its basicly better than cs go  10/10 would cs go again",
            "review_score": "1"
        },
        {
            "review_text": "If you like Glitches ♥♥♥♥ gamemodes and alot of microtransactions go ahead! 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "could make more good weopons  i hit 720 insta swap",
            "review_score": "1"
        },
        {
            "review_text": "10/10  turned my family into zombies would to it agin   IGN",
            "review_score": "1"
        },
        {
            "review_text": "Nice fps with many weapons maps and mods ,zombies is nice but *anti-zombie weapons* witch you buy with gold are realy cheat :/",
            "review_score": "1"
        },
        {
            "review_text": "the game never will start for me.. it either says 'this game requires steam' or 'error this application is already running'. i tried getting steam help but it never works. idk what to do :/",
            "review_score": "-1"
        },
        {
            "review_text": "Caner in it's most pure, untouched form.",
            "review_score": "-1"
        },
        {
            "review_text": "I haven't even played for 30 minutes and i still know its too good to be true. It's like a gift from to the people who don't have counter strike go. Its sooooo fun and with now both zombie and team modes so you won't be bored. Definetly worth checking out, might not be a huge graphic showdown compared to csgo but it serves its place as a good counter strike game :)",
            "review_score": "1"
        },
        {
            "review_text": "It haas so many problems that cannot be told because they ****** up my mind so hard",
            "review_score": "-1"
        },
        {
            "review_text": "not fun i olny got it because I did't have the mney for cs:go",
            "review_score": "-1"
        },
        {
            "review_text": "It crashed when I tried to enter my name. . .",
            "review_score": "-1"
        },
        {
            "review_text": "so stupid, so ♥♥♥♥♥♥♥♥, so i prefer not to play this ♥♥♥♥♥♥ game",
            "review_score": "-1"
        },
        {
            "review_text": "It comes with 1.6......for free....get it if you are a newcomer, if not, then try out the game zombie mode, it is actually kinda fun.",
            "review_score": "1"
        },
        {
            "review_text": "love it accept the shooting and the other physics have to be improved but still is a good game",
            "review_score": "1"
        },
        {
            "review_text": "this game like others might say is bad but i really injoy it if your a rell cs fan then try it its just fun not bad so its graphics might be a little bad but the gameplay is great i reccimend this game my spelling is bad i know i am dislexic so ples read with respect thank you and try the game after all its free",
            "review_score": "1"
        },
        {
            "review_text": "Now this game may seem a little old and you may also think it's not that good just because of the graphics. But this game is pretty cool. Other then the fact that weapons are limited it'f practiacally all fun! You got cool modes example: The Hidden, Football/soccer (depending where you come from), original (yes this mode is just like playing the original Counter-Strike just so you know), Or even with zombies! There is even a crafting system! You can find gears and blueprints, Gears are used to choose how many days it will last (you dont actually choose, what i mean is that you can have 30 days gears, 2-5 days gears and 1 day gears), You also have blueprints. There are some grades of blueprints noted with a letter on the left, Higher the grade better chance of your craft being made (yes you can fail to craft a weapon if the blueprint has a low grade)  Hope this helped and don't get fooled by my playtime i absolutley love this game!",
            "review_score": "1"
        },
        {
            "review_text": "Better than COD: Ghosts  11/10 (Actual Review Below)  This is a spin-off of the very popular Counter-Strike series. At first it looks like Crossfire with the goldsrc engine. I'll go over the pros and cons.  Pros - It's free - It can run on crappy computers - Crafting gives you free temporary weapons - Classic CS action with zombie modes - Very popular  Cons - Pay to win - Unbalenced teams sometimes (eg: Ts are payers and CTs are f2ps) - Everyone camps in zombie mode - Menu is laggy on crappy computers - hackers (possibly)  Overall I give this an 7/10 It's not perfect but it's very fun in bite sized chunks.",
            "review_score": "1"
        },
        {
            "review_text": "try to load it up 'this game requiers steam' -_- srly",
            "review_score": "-1"
        },
        {
            "review_text": "Hahahahaha... Why is this a thing again?",
            "review_score": "-1"
        },
        {
            "review_text": "Couldn't start it. When I tried to open it just says, 'this game requires steam,' please fix.",
            "review_score": "-1"
        },
        {
            "review_text": "Please don't buy this game... JUST DON'T.. All the good reviews are trolls. This game should be gunned down to the face and get erased from existance. Please I'd rather shave my hair off then play this garbage game.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't understand this game. It's too difficult to understand how it works. I play it just for the 1.6. ",
            "review_score": "-1"
        },
        {
            "review_text": "I played this 10 hrs. and .... When you don't have CS:GO , play CS 1.6 ... This game is full of noobs and cheaters ...   3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Its a very ehh game but rated 4/10 good multiplayer but weak zombie gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Really wanted to play the game but it won't work. The menu with the servers come up and when i choose a server and then a game to play it loads then just quits automatically!!!! WTF IS GOING ON!!! Seriously is there a solution to this error coz i really wanna play this game as i am a huge counter strike fan but until now a massive dissapointment valve. :'(",
            "review_score": "-1"
        },
        {
            "review_text": "i puked at this",
            "review_score": "-1"
        },
        {
            "review_text": "If you don't play zombies - it's pretty free counter-strike 1.6",
            "review_score": "1"
        },
        {
            "review_text": "its time to say R.I.P CSZN. FKKK YOU NEXON!!",
            "review_score": "-1"
        },
        {
            "review_text": "its time to say R.I.P CSZN. FKKK YOU NEXON!!",
            "review_score": "-1"
        },
        {
            "review_text": "its free so yeah",
            "review_score": "1"
        },
        {
            "review_text": "Idk yes or no, i think CS:GO is better...",
            "review_score": "1"
        },
        {
            "review_text": "It is ok.",
            "review_score": "1"
        },
        {
            "review_text": "឵  ឵  ឵  ឵  ឵  ឵  ឵  ឵  ឵  ឵",
            "review_score": "-1"
        },
        {
            "review_text": "Its meh",
            "review_score": "1"
        },
        {
            "review_text": "  Let's dispel once and for all with this fiction that Nexon doesn't know what they're doing. They know EXACTLY what they're doing. Nexon is undertaking a systematic effort to change this game, to make Counter Strike Nexon: Zombies more like the rest of games.  That's why they created the Magnum Drill and THANATOS-9 and the Airburster and got rid of 30 decoders a day. It is a systematic effort to change Counter Strike Nexon: Zombies. When I'm at the top of the leaderboards of the Counter Strike Nexon: Zombies, we are going to re-embrace all the things that made Counter Strike Nexon: Zombies the greatest game in the world and we are going to leave our children with what they deserve: the single greatest game in the history of the world.",
            "review_score": "1"
        },
        {
            "review_text": "it is just a great game",
            "review_score": "1"
        },
        {
            "review_text": "HitBoxes are ♥♥♥♥ And a classic pay2win Also Many Hackers",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing, please add full controller support.",
            "review_score": "1"
        },
        {
            "review_text": "hey completley disregard all the people above and below me saying stuff like 'this game sucks' if you want to play a highly modified version of 1.6, YES it does suck but if you wanna play zombie escape... this game is for you. I'm able to easilly spend hours on this game in one sitting playing zombie escape since its just so fun, the games f2p so atleast try it. basically zombie escape is... what it sounds like you run through a map trying to escape zombies...",
            "review_score": "1"
        },
        {
            "review_text": "Over All a Really Great Game A Lot Of Fun To Play Plenty Of Game Modes And Maps To Choose From With a New Mode On The Way I Still Havent Played Them All Yet Still Getting Regular Updates The Cool Thing I Like About Is, If There Isnt Enough Players For The Game Mode You Want To Play, You Can Still Play The Game Will Add AI Bots Dont Hesitate, Play It Today, Or Tomorrow, Or The Next Day  What Are You Waiting For? Come On, You Know You Wanna Check The Game Out",
            "review_score": "1"
        },
        {
            "review_text": "Well that was ♥♥♥♥ing dreadful",
            "review_score": "-1"
        },
        {
            "review_text": "Dont really like it that much",
            "review_score": "-1"
        },
        {
            "review_text": "God awful. The scariest thing about this game is its awfulness",
            "review_score": "-1"
        },
        {
            "review_text": "This game is proof that graphics don't make a game. While the graphics are, without doubt, some of the worst I've seen and the FPS locks itself to 72 instead of 144, the gameplay is amazingly fun. This game gives the gameplay of the super popular Counter Strike: Global Offensive for free. It also has a great zombies mode which is super fun to play. Another great thing is you can run this game at 60fps even with a potato- My laptop (Core i3 2nd gen, intel intergrated graphics hd 3000) can run it at 60fps. I recommend this game and there is really no reason not to download it.",
            "review_score": "1"
        },
        {
            "review_text": "LOVED IT IT'S AWESOME!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "It rocks",
            "review_score": "1"
        },
        {
            "review_text": "Although this game is free-to-play, I think you are better off buying CSGO and playing on a zombie server.",
            "review_score": "-1"
        },
        {
            "review_text": "This is actually pretty good, despite the nonsense and trash people say about it. Is it badly designed in some ways? Yea it is, but that doesn't mean anything. This game has WONDERFUL potential to be better, example would be adding more graphic settings, fixing some hits boxes with the zombies, etc. Just small stuff to work around this. But otherwise i recommend this game to anyone who's a counter strike players and a zombie lover! 8/10",
            "review_score": "1"
        },
        {
            "review_text": "All these negative reviews....... Yet, this game is in the top 10 most popular ftp gams on steam???? WTF",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing is so like wolfteam i hate that game plz",
            "review_score": "-1"
        },
        {
            "review_text": "Holy ♥♥♥♥ this game sucks GabeOnDrugs/10",
            "review_score": "-1"
        },
        {
            "review_text": "How I feel about this game. The concept is good. The community is sort of good and sort of bad. I know I have 146 hours on record, BUT its because I left it by accident many times on the main menu. Its ♥♥♥♥. Don't DL it because you will regret it, its like Condition Zero but 100 times worse. In the end this game isn't good in any way, play it with bots if you want to have some fun. End.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is great! when you undownload everything about it",
            "review_score": "-1"
        },
        {
            "review_text": "Was pretty excited about playing this game look interesting to play, sadly thats all the good things I can say about it. All the free stuff you get only last for a couple of days and everything else you have to pay for. There are games out there that does a better job then this.",
            "review_score": "-1"
        },
        {
            "review_text": "Its good for a free game. it has the normal free game stuff like micro-trans but its like a free cs",
            "review_score": "1"
        },
        {
            "review_text": "Oh god. Its terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Just great! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "mmmm it like old counter but really bad , horrible graphics and boring",
            "review_score": "-1"
        },
        {
            "review_text": "Do yourself a favor and buy CS:GO instead of this CS:♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Nexon is a second away from forcing you to play to be able to use the menu...",
            "review_score": "-1"
        },
        {
            "review_text": "I'm pretty tired of everyones negative view about Counter-Strike: Nexon Zombies, dont think you should think it is bad just because of their reviews,(dont think its any good too with good reviews! lol) honestly all i see with peoples reviews is: Bad, pay4gunz, nexon, bad graphics, CS 1.6. First of it, it is not bad, i happen to own CS 1.6 (i dont have CS: CZ) but i hear that this game is running off of Condition zero which is honestly not that different from CS 1.6, there are plenty of servers available as well as plenty of people, though you might run into different language servers here and there.  its not as bad as people say it is, please at least give it a try, its not like it stays on your computer forever, we are human &gt; Trial and error.",
            "review_score": "1"
        },
        {
            "review_text": "Terrible gameplay, game is the equivilent to stage 666 terminal cancer...",
            "review_score": "-1"
        },
        {
            "review_text": "My relationship with Nexon is like a troubled mother + child one. At the they baby-feed you with a spoon and give your all sorts of toys. But then once you can walk, they give you a kick in the back and laugh as you violently faceplant the floor. Yeah, that my friends, is Nexon.",
            "review_score": "-1"
        },
        {
            "review_text": "Counter-Strike Nexon Zombies will not run on Windows 8, Windows 8.1, and Windows 10 Technical Preview. Don't waste your time trying to play this. It will open, but the game will not show up. IT will just run in the background",
            "review_score": "-1"
        },
        {
            "review_text": "Watching this uninstall was more amusing",
            "review_score": "-1"
        },
        {
            "review_text": "good game 10 out of 10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "worst game wont even start dont even give it a chance if it doesnt work for you there is NO WAY TO FIX IT i sat for 3 hours searching the web and found lots of solutions that ONLY worked for the person that posted them its a really bad game dont wait your time downloading it",
            "review_score": "-1"
        },
        {
            "review_text": "Cs Go is better",
            "review_score": "-1"
        },
        {
            "review_text": "THIS FREAKING GAME RUINED MY LIFE I WAS PLAYING ALONE THE N ALL THE SUDDEN CRASH I PLAYED AGAIN AND AGAIN CRASH I PLAYED AGAIN ERROR 367 THIS GAME WILL RUIN YOUR LIFE AND IF YOU PLAY IT WITH NO PROBLEMS THAN HAVE FUN.",
            "review_score": "-1"
        },
        {
            "review_text": "Free and ugly cs (Positive evaluation)",
            "review_score": "1"
        },
        {
            "review_text": "Total Wallet Opener. You want a good counter-strike game with good fps? Because i looked for one by looking towards this. But really, it's just DLC this and DLC that. The game, with all of it's payments, goes to (an average cs:n player) $50 every 2 months. Do the math, and go get something cheaper, and less P2W.",
            "review_score": "-1"
        },
        {
            "review_text": "Fix the dam lag omfg. I'm in the US I join a North American server and mine and everyones ping is 300+ wtf. Nice game but fix the ♥♥♥♥ing lag problem ffs.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so fun...i was thinking this game wuld be crap   but its not",
            "review_score": "1"
        },
        {
            "review_text": "people on this game are the biggest pieces of ♥♥♥♥ i have ever seen",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ game for ♥♥♥♥ cunts and tramps that cant aford a bath or csgo.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazingly well made for a mod from the first Counter Strike game, it also comes with the first CS game ever made! graphics are bad but its from an old classic so what do you expect, still great, highly recommend. While I have not played much (Got it saturday) it defiently caught my attention and was very well created, lots of gamemodes to play, unique guns and the multiplayer is great!, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Well firstly , i downloaded this game out of curiosity , as i played alot of counter strike in my life , and still love doing so , the game is interesting in the idea that you can create your own weapons and such , i had a few good times , but the biggest thing that turned me off was the f##king lag differences , i mean i swear , i hate that the most , the idea is good , but the actual product is not , it just made me want to buy counter strike 1.6 and play like an idiot which i will do when i get some money.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty good game its fast paced and lots of fun.One problem is that there is ALOT of microtransactions",
            "review_score": "1"
        },
        {
            "review_text": "Game is pretty boring and slow paced, and the graphics are outdated by many years. Not a fun game",
            "review_score": "-1"
        },
        {
            "review_text": "It's cool, old school CS Engine. Basic gameplay. Has its moments but some things are harder to figure out. Uses in-game real money purchases.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible game, no waypoints or anything just a normal survival game, sometimes it crashes upon loading in the game which is really bad.",
            "review_score": "-1"
        },
        {
            "review_text": "If you get pass the fact nexon keeps shoving microtransactions down your throat and the whole pay to win feeling, and if you only play with friends, and ignore the repeating sounds of bots, and the glitches that happen in the buy menu, the insane frame drop in that not so favorite zombie mode, the random crashes,and that it only works when it feels like it, not a bad game honestly. i just dont recommend it and dont recommend any game distributers have anything to do with Nexon.",
            "review_score": "-1"
        },
        {
            "review_text": "Please HELP!!! I open the game and the link pops out a says : Failed to start the driver for hack blocking . HELP PLEASE!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "this game has become complete ♥♥♥♥! do NOT play this game. if its not crashing youre geing spawncamped by a bunch of high ranked enimies. the guns are horrible and the game play is worse. DO NOT play this game.!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Unistall Works Perfectly!",
            "review_score": "1"
        },
        {
            "review_text": "Where do I start, well its free, but it runs on a 16 Year old engine, this was made in 2014 And you choose gold source? Don't take that that the wrong way, I like the gold source engine, but its outdated af. Oh, and microtransactions, seriously, ♥♥♥♥ing microtransactions for some poorly made CS 1.6 Mod? What the ♥♥♥♥ were they smoking.  Overall score, 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "How the ♥♥♥♥ do I do anything?",
            "review_score": "-1"
        },
        {
            "review_text": "crashing everyday",
            "review_score": "-1"
        },
        {
            "review_text": "It's like those crappy games on the Play Store. Infected with ads, Pay2Win, and isn't fun to play at all. Except it took up 3GB, which is probably used for half the crap they advertise the guns with. You should only reccomend this game to play a sick joke on your friends; a joke that I fell for.  The gameplay is mediocre, at best. Nothing you would get from CS1.6, the game this is based upon. To top it all off, you get a faux Quake announcer. Nothing screams half ♥♥♥♥♥ and no effort like a Quake Announcer!",
            "review_score": "-1"
        },
        {
            "review_text": "its very fun",
            "review_score": "1"
        },
        {
            "review_text": "Most misleading trailer 2016...                I love it!",
            "review_score": "1"
        },
        {
            "review_text": "CS with zombies. I do suggest going for left 4 dead 2",
            "review_score": "1"
        },
        {
            "review_text": "Not that good of a cs game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 no clue what im doing",
            "review_score": "1"
        },
        {
            "review_text": "My friend and I both got this game and could barely run it. Not to mention the horrible graphics.",
            "review_score": "-1"
        },
        {
            "review_text": "John was a young lad... One day he got bored of counter strike and decided to play Nexon. Little john downloads the game and a lil bit hyped to play! You see, Dont do what little john did. He played 6 minutes of the game and now he cry's every night at 7:15 (the time he launched the game) Little john will never be the same... EVER!   -WARNING-  -Game causes you to cry  -Game crashes  -Did I mention the game makes you cry?",
            "review_score": "-1"
        },
        {
            "review_text": "This is what happens when Asians get ahold of counter-strike.      ....better than 1.6. suck it.",
            "review_score": "1"
        },
        {
            "review_text": "Craft a ♥♥♥♥ ton of weapons and show off to everyone how awesome you are with an mp5 that spits fire 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This Game is epic makes all other Zombie games look bad. I think anyone good at games would love this. ( Have to use mouse and keyboard)",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would.... No its actually pretty bad.",
            "review_score": "-1"
        },
        {
            "review_text": "LAGS + More Lags + Hackers   and More  CSZN Futures some much annoying bugs and gliches thats makes u addicted  8/10 But wait : Incoming TURK invasion  3muchturk5me",
            "review_score": "1"
        },
        {
            "review_text": "Chinese, Turkish, and South Americans are everywhere.",
            "review_score": "-1"
        },
        {
            "review_text": "it has a virus ",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game to play if you are like me , aka still saving money to get cs:go",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game. ♥♥♥♥ everyone who made it, ♥♥♥♥ everyone who dind't made it, ♥♥♥♥ everyone.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not the best to be honest, it's just a CS 1.6 ripoff with 'zombies' that look horrible and different weapon textures. The kids who play this game think they're cool as hell because they have some girl who when she dies moans... okay then. Crafting... is the weirdest thing ever. You get to use a gun for a certain amount of time, like what? I first got in the game and I was so confused on what to do, I was just given the menu and it was like: 'Here you idiot, have fun. Try finding out how to play on your own, ♥♥♥.' and just left me.  Would not recommend this game, it's bad.",
            "review_score": "-1"
        },
        {
            "review_text": "hmm not bad game :D but it would be awesome with trade system and drops from servers ^^",
            "review_score": "1"
        },
        {
            "review_text": "trash,trash,trash.... DMX, where the uninstall at? ",
            "review_score": "-1"
        },
        {
            "review_text": "Similar mechanics to CS 1.6 but this is just a bit worse, not gonna play it much :/",
            "review_score": "-1"
        },
        {
            "review_text": "dont play this game, its ♥♥♥♥. too much pay 2 win, other than that its good but i dont recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": " Basically a mod for Counter Strike 1.6, with more weapons and character selection.  You can choose to play the original CT vs T game or Zombie Defense through the lobby.  It got boring pretty quick, I've already played my fair share of zombie mods in Counter Strike: Source that just replicates this.  It's still fun and I'd recommend people to give it a try, it is free after all.    5/10",
            "review_score": "1"
        },
        {
            "review_text": "Why can i only downvote this once?  If i had a knife to stab myself and die a slow and painfull death and this game, i would pick the knife.  Seriously i can run Black Ops 2, Half-Life 1&amp;2 etc. without any problem but this piece of ♥♥♥♥ calling itself a game has lags every half second which causes eyepain! It also took half-an-hour to install.  What do we learn from this game? Don't let Koreans make Counter-Strike Games.",
            "review_score": "-1"
        },
        {
            "review_text": "P2P simulator, full of turkish kids",
            "review_score": "-1"
        },
        {
            "review_text": "Don't even try it. It's not worth the time spent downloading and installing. This game made me chop off my arms and hit myself in the ♥♥♥♥ by holding them between my teeth. If you want to play Counter-strike with or without zombies, in this resolution, with these graphics and mechanics, CS1.6 is your best option. Try to ignore this game as much as possible.",
            "review_score": "-1"
        },
        {
            "review_text": "this game sucks the first time i went into it it took me 25 mins to get to the loading screen the 10 more to get to the main menu, when i finally got in the game the graphics were horible, nota counterstike game ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is trash",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game alot",
            "review_score": "1"
        },
        {
            "review_text": "10/10 for the developers making the end(exit) button!!Uninstall simulator 2015!",
            "review_score": "-1"
        },
        {
            "review_text": "These Games is a big Succes even thought Nexon is making rants all the time the game is awesome there are much game modes like (zombie scenario, hide &amp; seek , soccer etc.) even thought i have litle hours on these game i have many perment weapons i got them for decoders wch are pretty ez to the first lvls.  If u have a really bad pc u shall play this game if u spean about 15$ to 10$ or 5$ u can buy soo much ♥♥♥♥ in the game :p",
            "review_score": "1"
        },
        {
            "review_text": "Wow. This is just sad. I couldnt even play more than a few rounds the graphics were so bad. All of the textures look like they were copied from 80's arcade games. Just dont waste your time on this.",
            "review_score": "-1"
        },
        {
            "review_text": "ANABOOOOOOOOOOOL !  -Good Modis  -nice commnity -you can learn russian,italian,serbian -play with friends",
            "review_score": "1"
        },
        {
            "review_text": "Trash!",
            "review_score": "-1"
        },
        {
            "review_text": "This is free and pretty cool game... im not saying this is better than cs1.6 or CS:S... but it's not bad game... you should download this game and try it out! 4/5 :)",
            "review_score": "1"
        },
        {
            "review_text": "WTF is these achievements????",
            "review_score": "-1"
        },
        {
            "review_text": "its like css witch is a bad game but some how csnz is even worse",
            "review_score": "-1"
        },
        {
            "review_text": "its a nice game! a game that has infection gamemode. i would like this game to be better.",
            "review_score": "1"
        },
        {
            "review_text": "I Enjoy the Game, I like playing on the survival agaisn't the zombies while you build a Base, Engiens, and more",
            "review_score": "1"
        },
        {
            "review_text": "it is sure are nice that developers give away this thing for free but... it doesn't worth more than 12 hours tbh.",
            "review_score": "-1"
        },
        {
            "review_text": "The sounds are horrible, the gameplay isn't really that fun, and the game is really unbalanced. Not to mention that the graphics are ♥♥♥♥.  4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game! Quite unstable though.  There are lots of game modes, some remind me of AVP but they all seem to lack of round timer which made the original CS experience. As a free game it's definitely worth checking out.  My first day playing and it's crashed three times (twice clicking on store, once server disconnected). Several other bugs were annoying too, such as the re-spawn timer being covered by some text about achieving 'First Steps'... The UI has room for improvement as well, I can't find an inventory anywhere of items such as respawn, health, etc.",
            "review_score": "1"
        },
        {
            "review_text": "It's Counter Strike...  ...with zombies!!  what more can i say?",
            "review_score": "1"
        },
        {
            "review_text": "best game aver 10/10 pace of ♥♥♥♥ COD",
            "review_score": "1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        },
        {
            "review_text": "wery good shoter game",
            "review_score": "1"
        },
        {
            "review_text": "Good game people! Don't comment before you try it ! At first i don't liked this game but after 2 days i just love it &lt;3  You can level up,New weapons,Textures,Maps,Modes,etc! And if you're a gamer just remember! The gamers try all the games ^^ From the online games to the most 8 gb ram games or anothers! ^^",
            "review_score": "1"
        },
        {
            "review_text": "Source with zambiees, its cool but it has a lot of bug and sometimes the main menu is f@cking laggy... :D",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "its an awesome game to play with freinds or when your bored it doesnt matter i love playing against others in death matches and the more you play the better it gets because theres so many suprises and so little time!!! GL HF :D",
            "review_score": "1"
        },
        {
            "review_text": "the game is fun. the only thing i hate is the zombie part of the game its just bad if your planing in giting this game just play it for the death mach and other modes beside the zombie mode",
            "review_score": "1"
        },
        {
            "review_text": "I've playing over a hundred hours, spend some money, given it more than a fair try. I have yet to craft a permanent weapon. I spent $35.00 in durables and blueprints and I feel that i got totally burned. Also feels like the higher in level I get, the worse my odds of successfully crafting, enhancing, and sythesizing are getting worse. Enhanced weapons level down is a total burn. I'm someone infuriated at this. I spent money and got far more fails than successes. If you are new to this game, then save your money. Not worth it. Build on an age old engine, i expected to get far more for my money. Feels like Nexon is sucking up all my money, and not giving me anything in return. DON'T SPEND ANY MONEY! IT'S A TRAP! :-0",
            "review_score": "-1"
        },
        {
            "review_text": "Hit detection can be just as buggy as CoD which scores a perfect 13472164738/10. Only downside is there's too much .8--water. 7.8/10.",
            "review_score": "1"
        },
        {
            "review_text": "this game....hhhhhmmmmmm.......... I'll be honest I haven't played any other counter strike games(though I'll probably get CS:GO through crafting gems on the 15th), so I'm going off my impression of this game, not any others in comparison.  the basic counter-strike gamemodes(original,deathmatch,etc.) I thought were a lot of fun(despite the fact that I suck at them) however, the zombie gamemodes felt really mediocre, not very thought out.  thats....about it. I mean, the items shop wasn't working at all for me, but that was about it. I mean, at that rate, I might as well just get CS:GO. I'll probs only have this game for a pretty short time.  5/10",
            "review_score": "-1"
        },
        {
            "review_text": "I would only recommend this game is you don't own any Counter-Strike game. Zombies kill with one hit in almost every game mode, and move faster then humans so it completly unbalanced. The fortification mode was intresting, for the first couple of days, the crafting never worked even when the required materials were prestnt, and the 5th day titan never lost any health. I'm not a big stickler with graphics, but this is steam and you're using Counter-Strike as the foundamentals for your game, when source engion is free. There's also a store where you can spend 9 bucks to play as a women, 9 more if you want one on each team. The rest of the store have options that'll go away after 30 or 15 days. I don't know if they're just skins or pay to win.  Like said only get this game if you want a Counter-Strike game and don't want to buy your first, and/or never played a zombie game EVER.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok this game is amazing. you may think 'oh counterstrike from 2001 or so it sucks!'. But let me stop you right there! This game has exceeded my expectations. Its not the original counterstrike. its way better! If your computer isnt that amazing but you love counterstrike and shooter games that dont lag. Well then this is your game. You can craft guns with blueprints in this game. And there are different guns added to the game. Every day or so you receive a daily bonus and a free weapon and booster i should say. Then you customize your classes and try out your new gun. One downside is that if you dont go on every day your progress will be lost but thats just the daily bonus not your overall stats and weapons. I would absolutely recommend you try this game out.  ",
            "review_score": "1"
        },
        {
            "review_text": "This is going to be a short review for only the most basics of my thoughts of the game. The game have limited potentials, plenty of bugs and glitches which makes the game unpleasent. Gameplay is casual, nothing special.  Issues with daily missions and special missions due to bugs such as kills not getting registered a lot of times. Is it pay to win? You can pay to win yes, you can buy the strongest weapons which will give you a huge adventage in Zombie or scenario mods.  Might have been better if instead of a Korean development team a Japanese team would have been choosen (would be less buggy). I would say it's good for practicing shooter games but not a competative game at all.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "I think I gave this game a longer chance than most, but in the end I still can't recommend it. I would be able to look past the graphics if there was balanced gameplay to hold my attention. I could even forgive the limited-time crafted items in the freemium model if there was a reason to use them. Unfortunately, the game is a re-hash of typical FPS game modes without any polish.  I had hope for the couple of unique PVE modes but they were completely unbalanced in favor of the AI. Maybe it was unbalanced because I was playing with only one other friend, maybe it's meant for 4+ players, but I don't find that kind of balancing acceptable. Probably won't come back with more people to try again.",
            "review_score": "-1"
        },
        {
            "review_text": "This is total ♥♥♥♥. Avoid at any cost. Full of crap.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "love it, really good experience for my first counter-strike ",
            "review_score": "1"
        },
        {
            "review_text": "This game is verry action packed and since it has low texture quallity it will probubly work on bad computers personaly my computer sucks and il get a decnet fps on this game. IT also has tuns of maps and fun gamemodes. I cant pick a favirete one cause i love so menny of them! i rate this game a 9/10 cause the things i dont like is that you have to renew your wepons durability and some other stuff but overall this game is amazing. and its free!",
            "review_score": "1"
        },
        {
            "review_text": "Good game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "thank you for game counter",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game for 27 hours now, and it's still fun. The most zombie-modes are boring, except zombie escape. BUT you can play the original CS, and that's what is makes so good. There are also other modes that are fun, like gun deathmatch. So I think you must give it a try! 85/100 ",
            "review_score": "1"
        },
        {
            "review_text": "This game was great! I love the quality in the game. I also like the good texture in the guns and the maps. Plus the characteristics!",
            "review_score": "1"
        },
        {
            "review_text": "Giant waste of time",
            "review_score": "-1"
        },
        {
            "review_text": "Funny game with multiple mods even it if gets repetitive after a while its always fun to shoot zombies at will !!",
            "review_score": "1"
        },
        {
            "review_text": "Un Nexon cv? :)))",
            "review_score": "1"
        },
        {
            "review_text": "i play this before when i was little and then playing it with zombies make me want to play even more",
            "review_score": "1"
        },
        {
            "review_text": "Not to bad takes a while to get into the game, pretty fun though, and its free so why not",
            "review_score": "1"
        },
        {
            "review_text": "Fire in the hole! Go go go!",
            "review_score": "1"
        },
        {
            "review_text": "really fun but there are connection errors VERY often...",
            "review_score": "1"
        },
        {
            "review_text": "Counter Strike Nexon: Zombies takes you back to the old CS games. All it comes down to (depending on the game mode) Zombies vs You Ive invested alot of hours to say: I like this game a bit more than CS:GO just because its more fun.",
            "review_score": "1"
        },
        {
            "review_text": "just play csgo.......",
            "review_score": "-1"
        },
        {
            "review_text": "THIS IS ♥♥♥♥ING AMAZING 11/10 YOU SHOULD TOTALY PLAY IT",
            "review_score": "1"
        },
        {
            "review_text": "Its free!",
            "review_score": "1"
        },
        {
            "review_text": "So I thought I'd give one of the worst games in the world a review, Turns out this game is as everyone says it is : complete TRASH. What were you thinking nexon/valve? for releasing this abomination to the world.... what is this targeted as kids because of the free price tag or the fact that you can run around as a zombie ? oh and btw. this is the only game where you can't kill a zombie. ign/10 crafting makes no ♥♥♥♥ing sense either. Crafted items only last a certain amount of days so that's total ♥♥♥♥ing ♥♥♥♥ as well. makes no sense.",
            "review_score": "-1"
        },
        {
            "review_text": "Glad You fixed up most of the issues.",
            "review_score": "1"
        },
        {
            "review_text": "'I used to be an adventurer like you, then I took an arrow in the knee'",
            "review_score": "1"
        },
        {
            "review_text": "Love it so far besides from the bugs from launch but im sure theyll be fixxed. Dont like the zombies? then play the Classic condition zero instead and be able to rank up and get new weps its pretty much two games in one! but if your not a cs fan i wouldnt recommend it but take a try it is f2p after all",
            "review_score": "1"
        },
        {
            "review_text": "killed myself after 4 minutes the other minute was ok",
            "review_score": "-1"
        },
        {
            "review_text": "Well, it's the same counter strike as always, it is just like Counter strike Online (CSO) just new name, thats all, at the begining I was like ( OMG, Hell yes! new CS awesome :D ) (Checked the release date) Damn, this was released this year, ok better start downloading, my expection was (new graphics gameplay or smth like that.) Nothing, NOTHING NEW WAS FOUND, its like CSO.... well, if u want to have real fun better buy CS:GO",
            "review_score": "-1"
        },
        {
            "review_text": "love the game",
            "review_score": "1"
        },
        {
            "review_text": "Worst recoil on the planet of FPS games.",
            "review_score": "-1"
        },
        {
            "review_text": "At first i was about to write a negative review, but i didn't. You happy now?",
            "review_score": "1"
        },
        {
            "review_text": "GREAT GAME FOR FREE I LOVE IT I WOULD STILL PAY BUT THIS GAME IS AWESOME 10 OUT OF 10",
            "review_score": "1"
        },
        {
            "review_text": "Yeah. I recommend this. This game isn't half bad, knowing how its in Open Beta Testing. It does have a few things that threw me off, like it lags a little bit, and it is very glitchy. Otherwise, it's the best steam shooter game I have. Why? Creativity. Soccer? Check. Homing snowmen robots that have squeaky shoes and self destruct, and have evil faces? Check. Counter-Strike 1.6 Graphics? Yes. Awesome weapons?? To me, yes. Cool maps, from CS1.6? Yes. I recommend it to anyone who has a low budget and really wants CS 1.6 or something. Also, disagree with me all you want, negative comments, I love this game. I also to plan to play waaay more hours.",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike Nexon: Connection terminated. Please launch the game again.",
            "review_score": "1"
        },
        {
            "review_text": "csgo meets cs 1.6 mmorpg elements in a fps its pretty hilarious it has coop mode yep",
            "review_score": "1"
        },
        {
            "review_text": "Really good i like it ! Leave it like this with more cool updates and still Free To Play! ",
            "review_score": "1"
        },
        {
            "review_text": "The game is pretty good,but it needs some serious updates. ",
            "review_score": "1"
        },
        {
            "review_text": "THE ZOMBIES WILL BE BACK THE ZOMBIES WILL BE BACK THE ZOMBIES WILL BE BACK THEZOMBIESTHEZOMBIESWILLBEBACKBACKTHEZOMBIESBACK.  This is ♥♥♥♥ing terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Have been playing 1.6 for over a 10 years now.. What can I say about this mod. I like it. Adds new functions to 1.6 which is nice. This is 1.6 which is more like CS GO. Weird, but not bad.  Will keep comming back. Untill cheaters will find this mod.",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game from what i played but only played the escape mode where one person is the zombie the rest are survivors trying to escape the levels have some traps to slow him down lotta fun",
            "review_score": "1"
        },
        {
            "review_text": "Zombie mode sucks horrible but the reglar modes are just like csgo perfect for people who dont want 2 spend money",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and free.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is AMAZING MUST TRY IT!!!!",
            "review_score": "1"
        },
        {
            "review_text": "The hoard survival is soo good, very intense. So many Zombies, so little ammo, so much KILLING! The other game modes are quite good as well, team death match being an old classic that you just can't beat, along with that the new infection game mode leaves the hair on your neck on edge.  Very good game and I would recommend this game to any one that has played a first person shooter, and to any ine starting!",
            "review_score": "1"
        },
        {
            "review_text": "Really really stupid game....",
            "review_score": "-1"
        },
        {
            "review_text": "CSS with zombie mod from a million years ago and standard junk micro transactions.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥♥ pay2win Counterstrike 1.6 copy.",
            "review_score": "-1"
        },
        {
            "review_text": "mix killing floor with counter strike 1.6 and you get this. Its a fun game to play... but its not a great game with the magical awesome mods and raw epic gameplay of 1.6 CSS and CS GO. This tried to be good, but when it comes to counter strike it must be great im afraid i gotta say no",
            "review_score": "-1"
        },
        {
            "review_text": "░░░░░░░░░░░░▄▄  ░░░░░░░░░░░█░░█ ░░░░░░░░░░░█░░█ ░░░░░░░░░░░█░░█ ░░░░░░░░░░█░░░█ ░░░░░░░░░█░░░░█ ███████▄▄█░░░░░██████▄ ▓▓▓▓▓▓█░░░░░░░░░░░░░░█ ▓▓▓▓▓▓█░░░░░░░░░░░░░░█ ▓▓▓▓▓▓█░░░░░░░░░░░░░░█ ▓▓▓▓▓▓█░░░░░░░░░░░░░░█ ▓▓▓▓▓▓█░░░░░░░░░░░░░░█ ▓▓▓▓▓▓█████░░░░░░░░░█ ██████▀░░░░▀▀███████",
            "review_score": "1"
        },
        {
            "review_text": "Man, this thing is the worst ... i don't think i can call it a game, most likely a modification to a good old game thing: -Confusing Menu for new players; -CS with COD weapons and zombies. AWFUL; -Nonsense missions and timeline; -Kinda destroys the CS games' reputation ONLY because of the name; -And too many other complaints. The only 'good' thing is that you can play some original CS 1.6 maps without zombies. Other than that, i do not recommend this game to anyone... And, please, if you want good zombie games, check the other games, waaay better than this thing...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is pure epic and you can really enjoy playing with humans or zombies. Heh, joke! Now seriously: This game is ♥♥♥♥ing bad, need some balance, because zombies are too op! Graphic is ok for me. Reminds me cs 1.6, and it's all i can say about this game. If you decided to download this game, this will be the worst decision in your life.",
            "review_score": "1"
        },
        {
            "review_text": "Listen, if you like a casual game where you can play to have fun. try it for yourself before you listen to these comments. yes, the zombies can be made better but there are other game modes on this. give it a try. And Nexon if you could make the zombie modes not as over powered over the humans. It'll make it more fun.",
            "review_score": "1"
        },
        {
            "review_text": "Cannot get on the game anymore :/",
            "review_score": "1"
        },
        {
            "review_text": "Okay, so yes the zombies are absolute ♥♥♥♥. It's pretty much Combat Arms zombies, but worse. But hey, you get CS for free. Which is a pretty good deal.",
            "review_score": "1"
        },
        {
            "review_text": "Very bad graphic ! ! !",
            "review_score": "-1"
        },
        {
            "review_text": "when i try to play it says hack sensor ??????????????",
            "review_score": "1"
        },
        {
            "review_text": "Failed to connect to game host! 5/5  Also the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies the zombies",
            "review_score": "-1"
        },
        {
            "review_text": "Better Than Cod ",
            "review_score": "1"
        },
        {
            "review_text": "This game has a very narrow target audience, this is why it won't appeal to most CS players. It is targeted mostly towards Counter-Strike 1.6 Zombie Mode fanatics.  If you love playing Zombie Mode in the original CS 1.6, this might be your thing. Keep in mind that Nexon: Zombies is exactly that (CS 1.6 Zombie mode), but with a few improvements: The game has a lot more MMO-ish design than the original. Thankfully, the gameplay is largely unchanged. The biggest changes are in the UI and in the guns. The game also adds a ton of new Zombie Mode content. We're talking more maps, more modes etc. Unfortunately for some dumb reason, there are only TWO zombie models in the game.  If you don't enjoy CS 1.6 Zombie mode all that much, or just play the original modes, this is definitely not your thing. Players who play mostly bomb defusal scenarios will be hugely disappointed. There ARE classic bomb defusal and deathmatch modes, but they are just there for the sake of filling up the bullet-points.  Pros: + It's Free! AND it's NOT pay to win! + Freshens up the old and stale Counter-Strike formula a bit + New modes, or addition of modes which were not popular with the original CS. (Zombie escape is my personal favourite) + The maps are pretty dynamic for a 16 year old engine. + New guns + Several UI tweaks...  Cons: - ...which may alienate some of the hardcore fans. - The classic modes are a bummer. - Not much variety in terms of character customization (sprays, skins, etc.) - Toxic community. Like, League of Legends level of toxicity. - No modding community AT ALL - For a game that's primarily focused on zombies, the actual zombies themselves are pretty lame. I remember back in the day there were different types of zombies with different kinds of abilities (jumpers, healers, witches)... Instead, Nexon said 'F*ck all that' and gave us only TWO (!!!) zombie models.  Potato comparison: Imagine putting a potato in a cheap microwave for about a minute. When you take it out, some parts of the potato are blazing hot, while others are completely cold. This is what this game is like.  Final score: 6.8/10",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME but idont get the division part how to increase your division??&gt;!",
            "review_score": "1"
        },
        {
            "review_text": "A really enjoyable multi-player game that is fast-paced and of course, includes zombies.",
            "review_score": "1"
        },
        {
            "review_text": "This is when the Uninstall button was brought up. Although I like to play it... I really really would appreciate better quality I do understand that this is made years ago but update it. To be honest, this could be possibly the worst Counter Strike. And do more than copying CSS and CSX.",
            "review_score": "-1"
        },
        {
            "review_text": "the game looks like 1.6 and 1.6 is really fun to play",
            "review_score": "1"
        },
        {
            "review_text": "Id rather spend eternity in a tube wahtching while some idiot destroys all my dreams and everything else I once loved.",
            "review_score": "-1"
        },
        {
            "review_text": "don't (unless you like games where you can get one-shotted with a paid gun that does 200+ damage that isn't even a sniper rifle)",
            "review_score": "-1"
        },
        {
            "review_text": "The game don't even launch for me .LoL.",
            "review_score": "1"
        },
        {
            "review_text": "It was rated number 3 in a top 10 list of F2P FPS's and I really like it. Still can't stand the idea of hip-firing only though x.x  It's Counter-Strike 1.6 with extra stuff. I only play the real Counter-Strike part of it. Everyone else can trash at all its bad sides and ignore the only good things about it and frequently mention how bad the graphics are for an INTENDED LOW-SPEC GAME. I'm a realistic poor college student on a laptop, so this is great for me.",
            "review_score": "1"
        },
        {
            "review_text": "works perfectly great with my windows 10 computer. It runs very well when overclocked",
            "review_score": "1"
        },
        {
            "review_text": "This game is horrrible. It lacks any sort of tutorial for new players and has inconsistent gameplay. It is impossible to play if you are brand new to this game",
            "review_score": "-1"
        },
        {
            "review_text": "Ya know, at least TRY and make the game able to be played more than 1 rounds in a row.",
            "review_score": "-1"
        },
        {
            "review_text": "Good: the game is basically CS 1.6 with additional mods. Brings back good memories.  Cons: The game play is not as good as original CS 1.6, degraded from all the weird weapons.",
            "review_score": "1"
        },
        {
            "review_text": "Community sucks on this, nobody talks in the chat-rooms on this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Eh Sorta good game For people who really like zombies",
            "review_score": "1"
        },
        {
            "review_text": "Really Nexon? Have you ever released a game that is even a little good. Propably not. This game is just f... horrible. Controls are ♥♥♥♥, gameplay is ♥♥♥♥, graphic looks like commodore64. Nexon please make us all a favour and stop making games since its obvious you dont know how to make them.",
            "review_score": "-1"
        },
        {
            "review_text": "Counter-Strike, One of my favorite Fps game series. Also one of the most popular ones out there. This game though, it's... It's ok! I mean besides all the shady micro-Transactions!!! This game is just the same as the old Counter Strike, don't expect anything new. Besides the Crazy Zombies!!!! I really can't judge this game, I mean it is free, so.... Yeah... I guess all I can say is the game has ALOT of Little payments! Besides that! It's not really fair that when you 'Don't' Spend money on this game you cant really get any Interesting guns. For example. Playing Normal, tryna defuse the bomb on the Counter Terrorist side, Until another player from the other team ends up zapping me with some sort of weapon, its just some of the Weapons are OP. Besides that... I got nothin   My rating 6/10   I don't even know If i should reccomend it. Im so confused. I guess I will?",
            "review_score": "1"
        },
        {
            "review_text": "a good game but its not a counter strike",
            "review_score": "1"
        },
        {
            "review_text": "Best game i have ever played in my entire life",
            "review_score": "1"
        },
        {
            "review_text": "All other Counter Strike games run on Linux. Do it with this one.",
            "review_score": "-1"
        },
        {
            "review_text": "this game sucks ",
            "review_score": "-1"
        },
        {
            "review_text": "ok its not for the zombies mode of course , is just for the cs feeling that cs go changed it negativly is just like the old good times of cs 1.6 it has some minor bugs but its ok . about the zombies part now it is fun to paly with friends but again its not for the zombies and also the way i call the soccer mode is : fps fifa 2015 cs edition (oh if you have a problem opening the game right click the shortcut and then run as an adminstinator it will fix the problem , you may also have to repaet it if doesnt work and then reboot your system  now are coming the statics  Pros lots of fun with friends good gfx for its engine (but for current engines ...... 4/10) i managed to play it on my grandmoms pentinum 4 computer without lag always you will have a special time in every round you play frienly community  Cons Minor bugs As i mentioned earlier 4/10 gfx  Anyway i recommend this game to everyone who wants some free , pure , lagless fps and counter strike feeling",
            "review_score": "1"
        },
        {
            "review_text": "Cant play because it says 'This game needs steam' SO FIX THAT",
            "review_score": "-1"
        },
        {
            "review_text": "At this point I can't recommend this game. There are huge problems with the resolution options. The client that opens first doesn't fit my screen. Some buttons end up under the start menu. It took me 15 minutes to figure out how to adjust the ingame screen, so it doesn't show just 1/4 of the game. After finishing the game, I couldn't exit the scoreboard, because buttons were again off reach. As for the gameplay, it is ok for a F2P game.",
            "review_score": "-1"
        },
        {
            "review_text": "Just a Free version of Counter-Strike 1.6 With Zombies",
            "review_score": "-1"
        },
        {
            "review_text": "this game is just stupid the sound files are all messed up the knockback of this game is dumb there is alot wrong with this game and the people are just horrible do you know how many times ive been kicked out of my own server for bad sportsman ship? 6 in a day because i get stuck with people wasteing the materials i gather and breaking the stuff i build the people are all ♥♥♥♥♥♥♥s the game plays stupid and there seems to be a pay to win issue im seeing dont get this game its just gonna ♥♥♥♥ you off",
            "review_score": "-1"
        },
        {
            "review_text": "this game rocks ",
            "review_score": "1"
        },
        {
            "review_text": "Good, kinds gets boring. But i Like it because its good for people who have so/so graphics cards",
            "review_score": "1"
        },
        {
            "review_text": "The best counter strike i ever played, 10/10 - IGN",
            "review_score": "1"
        },
        {
            "review_text": "Its not that good other counter strike games are way better like source and global offensive even the first one is better than this peice of crap",
            "review_score": "-1"
        },
        {
            "review_text": "If you already have CS 1.6, don't bother with this.  If you have any CS game for that matter, ignore it.  Don't even think about touching this game's zombie modes, just play the original CS 1.6 on here, it's free, and (mostly) untouched.  I mainly play this game to compare to CSS (the only other CS game I have) and when I want to play a friend that doesn't have any CS game.  TL;DR Only play if you don't have any Counter-Strike game, or your friends don't have any Counter-Strike game. Never touch the unbalanced and unentertaining zombie gamemodes.",
            "review_score": "-1"
        },
        {
            "review_text": "LOVE IT!",
            "review_score": "1"
        },
        {
            "review_text": "Really Good Game Espicially For Who Cant But The Normal Counter Strike (y)",
            "review_score": "1"
        },
        {
            "review_text": "My Whole life my Grandfather smoked, my mum told him to stop smoking if he ever wanted to see me graduate. he put down and never touched a smoke ever again. 2 years later he died of lung cancer, since then i have never in my life touched a smoke. i feel a slight sense of regret as this game gave me lung cancer anyway...",
            "review_score": "-1"
        },
        {
            "review_text": "I cant really say it was bad or good but it does have problems like when your a zombie bullets stop every zombie so you  can't get close to them. And one the map that I could get on humans just camped there and just all the zombies all and the starting weapons are a joke, to some zombies you can not kill them with the starting weapons the only way zombies can get people is if they get to camping spott and hit somes one which is like 100,000X harder than it sounds i wish the zombies were npcs or I wish that zombies had a fair chance so humans could camp or something but hay its in beta so maybe vavle will change it (I HOPE) p.s. its all so confusing so its ok i guess",
            "review_score": "-1"
        },
        {
            "review_text": "overall the game is good but using an engine that is been like 13 or 14 years old? yeah i was wondering if its a place holder till the source 2 comes out but using the old engine for a game that is released in 2014? doesnt make sence at all... i think its outdated... i'm looking at you valve... and also nexon or could possibly a mod but yeah it is but it re-uses the content from the orginal game Counter strike. maps are not new.. they are old since the old Half Life series, TFC and even CS and trying to rehash them to make them 'new' since its all from the old valve games.  putting in old content doesnt really change anything.. unlike blizzards idea of garrisons to put in to Warlords of Draenor (World of Warcraft) and sorta getting offtopic but rehashing old content to make them 'New' isnt gonna change the gameplay.   time to look at valve... it seems their updates isnt impling me to stay into Dota and TF2 anymore.. just 2 years ago i used to like valve and i do feel like there along side with Blizzard Entertainment but then Valve seem to fell apart and so did Blizzard... i'm kinda sad but valve isnt really keeping me into their games with their Gameplay updates that isnt making me stay into their games...  but this game horrible pace and its direction.. now let the bad reviews of this game begin..  ",
            "review_score": "-1"
        },
        {
            "review_text": "its fun but.. can you update the zombie looks its a bit low xD",
            "review_score": "1"
        },
        {
            "review_text": "The zombie modes are just plain shooting and watching. On the other hand, it lets you play counter strike 1.6 for free.",
            "review_score": "1"
        },
        {
            "review_text": "dose it use CS:S cause that would be good for gmod. I wont play it because its to lagy ",
            "review_score": "-1"
        },
        {
            "review_text": "grate game i give it a 8 out of ten i mean this was 2014 it dose not need the original counter strike graphics and well LAG",
            "review_score": "1"
        },
        {
            "review_text": "after getting spawn killed for half an hour 10/10 would get spawn killed again",
            "review_score": "1"
        },
        {
            "review_text": "good game it's liek an 1.6 but more weapons good job",
            "review_score": "1"
        },
        {
            "review_text": "fun game i mean really with all the modes plus if you dont like to fight zombies you can play the orginal cs",
            "review_score": "1"
        },
        {
            "review_text": "Cant play it, played for 5 hours and now the hack shield is not dentified so i now hate it!",
            "review_score": "-1"
        },
        {
            "review_text": "I actually love this game. It is a great zombie game as well as the non zombie mode a pretty good too.",
            "review_score": "1"
        },
        {
            "review_text": "well it ♥♥♥♥ing sucks it's old it's japonese it's to many thing floating around the screan and well rip",
            "review_score": "-1"
        },
        {
            "review_text": "Play at your own Risk.",
            "review_score": "1"
        },
        {
            "review_text": "This game's menu is too complex and I couldn't even find where to play a real game: I basically got stuck in the menu and uninstalled it not bothering to figure out how everything works. This game is simply too complicated to begin with.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game (not being sarcastic btw).i first got it the day it came out without noticing it was just released that day. i started playing and i really enjoyed it, of course it has some flaws but i do recommend it to make time fly by.",
            "review_score": "1"
        },
        {
            "review_text": "it is fun ",
            "review_score": "1"
        },
        {
            "review_text": "if you like cs 1.6 you can get it free in this mod it has cool new wepons and skins one thing i would say its a good game get it enjoy",
            "review_score": "1"
        },
        {
            "review_text": "its FREE to play, no aus servers, would b a great game if it wasnt for the 300ping 7/10",
            "review_score": "-1"
        },
        {
            "review_text": "Fun for a short time, I do not recommend this if u ask me :)",
            "review_score": "-1"
        },
        {
            "review_text": "super fun and interesting",
            "review_score": "1"
        },
        {
            "review_text": "it'll keep you satisfied for a liitle while, after that you'll realise that it's a ♥♥♥♥ game which is pay 2 win",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ in to te bussy     ĮREKTĮ  IDK  MONEY BODOOD ",
            "review_score": "1"
        },
        {
            "review_text": "How to NOT make a game.",
            "review_score": "-1"
        },
        {
            "review_text": "counter strike zombie. please help me on my problem when i click play they always say this game requires a steam but i already have a steam so why i can't play hope you can help",
            "review_score": "1"
        },
        {
            "review_text": "Does not deserve to have counter strike in its name. -1 / 10,000,000,000,000,000,000",
            "review_score": "-1"
        },
        {
            "review_text": "wtf is that game -_-",
            "review_score": "-1"
        },
        {
            "review_text": "worst game ever 0/10 never play it!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Nice job on the game and i give a 10/10  -Crime.Net  Horror and Shooting :)",
            "review_score": "1"
        },
        {
            "review_text": "Much like a shamalan movie this is complete trash",
            "review_score": "-1"
        },
        {
            "review_text": "This game is horrible. 20yrs ago engine in 2k15 u mad Nexon!?  P2W (Just saying, even if you don't buy premium stuff you can own premium babies). Worst graphics i've ever seen in my life! My eyes cried for a long and long time! I played this game for twenty minutes and yeah, i have to thank the developers of it because they atleast let me know if unistall button actually works. 1/10. ",
            "review_score": "-1"
        },
        {
            "review_text": "Id rather be kicked out of the KKK than play this again -100000000/10",
            "review_score": "-1"
        },
        {
            "review_text": "Its not even like CSGO and it is not realy user friendly",
            "review_score": "-1"
        },
        {
            "review_text": "I know it's older but it really wasn't what I expected. All of the zombies look the same and it has some bad graphics.",
            "review_score": "-1"
        },
        {
            "review_text": "Better than csgo 0/1",
            "review_score": "1"
        },
        {
            "review_text": "It says i need steam i already have steam if that happens DELETE theres no fixing it sorry to be a game bum :(",
            "review_score": "-1"
        },
        {
            "review_text": "I start the game and i dont join in game and the game FALL !!!! Stupid i delete this !!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I'm afraid of zombies",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth it. Don't think of it as a zombie game, but as classic CS with zombie modes added in.",
            "review_score": "1"
        },
        {
            "review_text": "This is barley playable. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "It's a great game for those who wants to start playing the Counter Strike Series :D A total have to try :D",
            "review_score": "1"
        },
        {
            "review_text": "I can't connect to all servers on csn:z.. what should i do?.. please help it says ''failed to connect to game host''",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, not the greatest graphics but over all a game to try.",
            "review_score": "1"
        },
        {
            "review_text": "just cant connect to a single game",
            "review_score": "-1"
        },
        {
            "review_text": "its basicly cs free or cs zombie mode",
            "review_score": "1"
        },
        {
            "review_text": "This game made me kill my grandmother 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Buy CS:GO.  Don't ask your friends to play this game. You get unfriended. Friends suck, anyway.",
            "review_score": "1"
        },
        {
            "review_text": "It's counter stike: JAPANESE EDITION HOO HOO",
            "review_score": "1"
        },
        {
            "review_text": "Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game. Balanced game.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "im just passin time by this game is god for wasting time not bad idea but not good stand alone game should be added to cs-go ",
            "review_score": "1"
        },
        {
            "review_text": "Team Deathmatch is awesome - grreat maps. If you like FPS, this is top notch.",
            "review_score": "1"
        },
        {
            "review_text": "this game sucks",
            "review_score": "1"
        },
        {
            "review_text": "Best Game Hard Every Time ;)",
            "review_score": "1"
        },
        {
            "review_text": "My grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your grandfather put us through.' I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because this game gave me cancer anyway.",
            "review_score": "-1"
        },
        {
            "review_text": "this game has the old cs 1.6 look and feel but the zombies needs more work but other than that its a great game",
            "review_score": "1"
        },
        {
            "review_text": "free cs 1.6 if you like csgo or css you should get it",
            "review_score": "1"
        },
        {
            "review_text": "I Love This Game So Much Great Game",
            "review_score": "1"
        },
        {
            "review_text": "i thought it would be a cs:go inspired survival game but no! it is just a trashy infected game thing. it has people running around dressed in bunny costumes! it is a waste of storage!",
            "review_score": "-1"
        },
        {
            "review_text": "good game reccomend downloading it ",
            "review_score": "1"
        },
        {
            "review_text": "Yes this game is kinda bad, but for a free game, it is an ok time killer.",
            "review_score": "1"
        },
        {
            "review_text": "Is a ok game if you have some freinds to play with you other wise it will get boring even fatser.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the worst I have ever played.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a fun free to play game and has low requirements.",
            "review_score": "1"
        },
        {
            "review_text": "this game is a pretty good game",
            "review_score": "1"
        },
        {
            "review_text": "i would recomend this game to anyone lokng for a truly stratigic tactical game",
            "review_score": "1"
        },
        {
            "review_text": "It's Really Good",
            "review_score": "1"
        },
        {
            "review_text": "This game its good",
            "review_score": "1"
        },
        {
            "review_text": "the Great Value version of CS:GO",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 OMG! This is so f*cking cool! The uninstall button is working!",
            "review_score": "-1"
        },
        {
            "review_text": "Uninstalled as quick as humanly possible.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm tired of this game and the problems it has, where shall I start?  Campers:  every time i try to have a good game on this heap of **** i end up on the server where everyone has to take advantage of the certain spots, the balcony for example, whats the point? it ruins the game for everyone else  Overpowered players:  I can't get near any player because the way the guns affect zombies is too powerful, you can't move when you get hit leaving you open to more gun fire  Teamwork?  whats the point of having a team when on the zombie escape mode they leave you behind?  Glitches,  zombies can infect me through walls now?   although this game may sound appealing and it's from a well known series i wouldn't say download it, if you looking for a similar style go with codename cure, twice as much fun   ",
            "review_score": "-1"
        },
        {
            "review_text": "Like cs 1.6 . Relly good.",
            "review_score": "1"
        },
        {
            "review_text": "no..no JUST GOD PLEASE DO NOT EVER INSTALL THIS CRAPPY GAME THAT WILL MURDER YOU'R EYES RIGHT OFF TO HOW BAD IT IS!!",
            "review_score": "-1"
        },
        {
            "review_text": "Really Cool",
            "review_score": "1"
        },
        {
            "review_text": "Very good game... I love 1.6, 2nd game is this",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot of things you need to get straight before you play this game. First being, the controls can be a little shoddy. More often than not, you'll find yourself having to click out of sniper scopes, or focus and unfocus because it doesn't undo that mechanic after you fire, and hit your target. I'm not sure why, but it sticks, and if there's a way to shut it off, I have yet to find it. I wouldn't suggest playing with bots. Finding a lobby with anyone is better than using the bots. Connections can be a bit wonky as well.     Once you get past that, their selection of weapons is pretty good for people who are just starting, and if you know how to use them, they're helpful in the field. I'm still not sure if you can even customize the character you play as aesthetically, but since it's a Nexon game, you'll probably have to pay for it.     The maps. And game modes. There's a lot to choose from, but some of them are painfully similar to others, and they just make very small editations to a few of them to make them 'entirely different' play styles. But they're kind of the same. Though, team deathmatches are pretty fun. The zombies are kind of original. I've not seen anything like them, in any other kind of game.    This is my first game review, so I can't say it's a fantastic one in means of detail.. so I'll condense it.   Pros:     - Good beginning weapon selection  - Frequent log in rewards   - Original infected ideas.  - Generously large maps.  - Nicely implimented music, and ambiance (map varying)  - Nice weapon SET selections.  - Server/room specifications are fair and thorough   Cons:     - OP bots *but usually, any and all bots are kind of OP.  - Occassionally glitchy mechanics  - Not very customizable.  - Server search/find could be easier to navigate.     6/10 Maybe 7 because it's FTP",
            "review_score": "1"
        },
        {
            "review_text": "its ok",
            "review_score": "1"
        },
        {
            "review_text": "this is a very good game but you do need a decent computer.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would uninstall this ♥♥♥♥♥♥♥♥ of ♥♥♥♥ again",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "wont exit cant figure out how to run",
            "review_score": "-1"
        },
        {
            "review_text": "Counter Strike (Classic) + Not So Detailed Zombies + Nexon On Title = Counter Strike NEXON ZOMBIES",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Well.... I think its a thing ?_?",
            "review_score": "-1"
        },
        {
            "review_text": "For a free bootleg cs 1.6, this really impressed me",
            "review_score": "1"
        },
        {
            "review_text": "Too much glitchers and aimbot losers",
            "review_score": "-1"
        },
        {
            "review_text": "Recommended. It's worth to play CS v1.6 without payment.",
            "review_score": "1"
        },
        {
            "review_text": "Top Game :3",
            "review_score": "1"
        },
        {
            "review_text": "good game, however i found goopad installed with it? and thats a trojen.., not sure what this is about but you can remove the trojen however its the fact its installed with the game?",
            "review_score": "-1"
        },
        {
            "review_text": "would r8 8/8",
            "review_score": "1"
        },
        {
            "review_text": "this game is a pile of greatness... jokes it the opposite",
            "review_score": "-1"
        },
        {
            "review_text": "Its almost like the original game 'counter strike 1.6' But the some popular weapons ak47,Colt feel diferent for some reason. Gameplay its basicly the same, 'de' maps are plant &amp; defuse the bomb 'cs' maps are rescue hotages. This game have the famous 'zombie plague mod' but more improved whit awesome tweeks, have aswell many maps to play whit.  I rate this game 7/10. Feels like counter strike 1.6 but whit some diferences whit the new weapons and game mods. If you like this game i recommend: counter strike '1.6' 'Source' 'Global Offensive' and Crossfire they are all very similar, crossfire being the most similar because weapon system.   ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game really worth downloading",
            "review_score": "1"
        },
        {
            "review_text": "Every time i try to play this game it keeps saying steam requierd. NO SENSE WHY DOES IT HAPPEN",
            "review_score": "-1"
        },
        {
            "review_text": "Very repetitive gameplay but at least it's free.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game!!",
            "review_score": "1"
        },
        {
            "review_text": "Im not a big fan of Zombie mode, but this Counter Strike seems to be ok. So I recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "It's good based on the mode you play.",
            "review_score": "1"
        },
        {
            "review_text": "come on guys it looks cool am i right lets get a thumbs up to make the editors happy",
            "review_score": "1"
        },
        {
            "review_text": "I really don't understand people who say that this game is crap...Ok i understand it's a copy of counter-strike 1.6 But is that the reason to hate on this game? I think this game is a good solution for not cracking 1.6  and there are server's/rooms where you and you friend can play alone  and has the old classic game engine from 10 year's  I played GTA V for 60 hour's now and i played this for almost 100 hours  Please don't hate on this game just of reasons like Copy,Crap Engine,Over priced(Don't know who said that) This game is awsome and i would recommend this game  Dear developer's -Thank you",
            "review_score": "1"
        },
        {
            "review_text": "Great game for being free. Highly under rated.",
            "review_score": "1"
        },
        {
            "review_text": "the game is buggy when i want to connect to a sv for example european for each sv i have restart the game and do verify integrity of game",
            "review_score": "-1"
        },
        {
            "review_text": "Not playable on windows 10... and have to restart computer in order to quit the game...",
            "review_score": "1"
        },
        {
            "review_text": "I like the gamemodes in this one. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "can't even launch game without crashing it serverall thousand times",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game because I figured 'ayy CS:GO for free with zombies lel'.  Quickly found out this game was horrible click bait.  No zombies (from what I could see), horrible combat, overall not fun.  Don't be cheap. Buy CS:GO. Hey, buy CS Source while you're at it! They are both better than this!",
            "review_score": "-1"
        },
        {
            "review_text": "attetion the creators of this game,this game is ok but i would like you to pay attention to a game called counter strike neo it was only released in japan and it looks really cool if you could have a look into getting it on steam i would be very greatfull thank you very much",
            "review_score": "1"
        },
        {
            "review_text": "i mean it is a fun game and all but the start up button is not working that well, at all!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! and it is geting me extremely ♥♥♥♥♥♥ of!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "The best thing about this game was shooting the rectangular chickens with no dieing animation    This game is awful Its Valves Source Engine gone wrong The graphics are at Play Station 1 level (Thats not good)  Theres one thing good about it... Its FTP... So people don't have to waste there precious earnings on this piece of crap!   But wait! Its PTW so people can waste there precious earnings on this pile of crap",
            "review_score": "-1"
        },
        {
            "review_text": "why cant they make the journey to the west package 20$ or 19.99$ I just spent 20$ and 0.99 cents off wow -_- I have to spend another 10$ or 20$ to get the journey to the west package -_- pls make it 19.99 or 20$ pls ",
            "review_score": "1"
        },
        {
            "review_text": "This game is waste of time every time i played for long i mean 2-3h one match it keeps crashing at end , the same for all my mates. I were playing this game for long i liked it at start but that crash ruined everything. 'crash details when match crash you can only close game with task manager and you don't get any xp or points for the game no matter for how long you are playing ' i was mad when it crashed whole day in each game when i play for long 28 days on zombie shelter 4h game gg crash zombie scenario map with yeti crash too :D good luck everione who try playing it . i don't recommend to play this gae to anyone",
            "review_score": "-1"
        },
        {
            "review_text": "This game has helped my speed and reaction time during video games, in which i mean speed to hit the uninstall button.  3.2/10",
            "review_score": "-1"
        },
        {
            "review_text": "plz make it like CS:GO but with zombies thx and plz more weps!",
            "review_score": "1"
        },
        {
            "review_text": "It sucks... 10/10 you need friends who will over load your game to have actual fun not random ♥♥♥♥♥♥ player who are noobs and just tell you to follow that person into a bottomless pit and die. (thats what noobs are btw thres no bottomless pits in the game) gamplay is ♥♥♥♥♥♥ and the graphics... OH THE GRAPHICS IS A LIE! NOTHING SEEMS LIKE WHAT I WAS LOOKING FOR. the fact that you dont sprint in this game and the zombies can makes it unfair and people just camp in one spot and no one ever get to people fast enough because the hidious knock back knocks you back everytime you get hit and you get slowed down and its soo not fun tring to get out of the bullets. and how do you uninstall games pls tell me that i have 2 ♥♥♥♥♥♥ games (1 of them is this) the quit button works very well so 1/10 DONT GET YOUR HOPES HIGH COUNTER STRIKE!",
            "review_score": "-1"
        },
        {
            "review_text": "The game's just not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Its An Okay Free Counter Strike Game . But I Just Want All Those Skull 11 And Other Guns Removed In TDM . Beacuse   1. There To Op.  ",
            "review_score": "1"
        },
        {
            "review_text": "There are problems with this game it never works on my pc or anything else. I DO NOT RECCOMEND THIS GAME",
            "review_score": "-1"
        },
        {
            "review_text": "dear counter strike nexon:zombies,   i am a player of this game and im starting to hate this game cause the items cost so much money not everyone is rich i am saying they should make milliage decoders like 5 for $0.50 and for premnuim like $1.00 for 2 this game is soon becomming demolished if you guys keep doing this if you want it more popular and earn money too don't make it expensive and definitly don't make it bad.   p.s just saying and sorry for my bad spelling don't complating.   sincerly,   thegamer: T",
            "review_score": "-1"
        },
        {
            "review_text": "this game dose seem like a free rip of mod of CS but its fun crapy but fun CS guns some CS maps but its still fun there is a slight pay to win facter or so it seemed but i do think you can do just fine with the base guns.",
            "review_score": "1"
        },
        {
            "review_text": "Allow me to enlighten you on my life changing experience of this game. I launched the game. Well I say the game launched in fact a jpg of some zombies filled half my screen then some daily rewards thing flashed up in and then I opened the options menu to try get it into fullscreen. There. Is. No. Fullscreen. I clicked widescreen, reset the resolution and nothing happened. I then decided to give and and play with the game only filling half my screen. After clicking quick game the game promptly began to crash. This happened repeatedly after my futile attempts to actually play this trainwreck of a game. Speaking of trainwreck, being in a traincrash would be exactly 6.43 billion times more enjoyable than this game. I've had more fun being mauled by a bear",
            "review_score": "-1"
        },
        {
            "review_text": "Yass best game 6/5",
            "review_score": "1"
        },
        {
            "review_text": "It is a very decent game. It has very good and fun gameplay with the zombies and all, it is fun and the crafting system isn't bad I just wish it were somewhat easier to understand. Overall a very positive experience!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best free to plays on the market, provides hours of play. I think if it was brought into the Steam Workshop it would be evem better because of the countless choices people can erect.",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely horrible game very clearly founded upon the pay to win principle. It is literally based on Counterstrike 1.6. I cant believe this is new. Bad audio in general, bad music, boring repetitive gameplay, and the inclusion of the ever-popular 'RPG elements' so that you feel like you should keep playing despite the near complete lack of a real game here because levels are involved if you do boring things forever.",
            "review_score": "-1"
        },
        {
            "review_text": "Good bye CSonline , you was awesome but no more ...",
            "review_score": "-1"
        },
        {
            "review_text": "an old good style of cs :) poor graphics but it's good!",
            "review_score": "1"
        },
        {
            "review_text": "I recommend Counter Strike I do NOT recommend the zombie mod. Its soooooo BORING!!!!!!! Just shoot zombies that have 50000 hp and nothing else.",
            "review_score": "-1"
        },
        {
            "review_text": "awsome zombie killing game even if the graphics need work lol its fun to play try to build bases and shoot zombies dead as hell lol",
            "review_score": "1"
        },
        {
            "review_text": "I begin by saying that the graphics of cs 1.6 is its point of momentum, because not everyone has a pc suit '' gaming ''. I also add personally not a game Pay to win .. because the weapons can win in events held continuously .. and repeat the weapons and still not change the force that a player .. you can kill anyone with the standard weapons. Also the game in my opinion is in effect a fps lacks nothing, the few bugs that are found are resolved quickly by administrators who are constantly working. I invite you to not throw it like garbage bag only for graphics .. games beginning were not that .. we had a meaning and I think this it has to offer for a fps. Recall that this game still had a great success because it is the first launch of the game, there were others like online cso, cso japanese and other. I hope this review has served to make you understand that no matter how small the game has to offer. If something is ungrammatical understand me are Italian.",
            "review_score": "1"
        },
        {
            "review_text": "It is a nice game, with lots of weapons that you can craft and many mods that you can play.",
            "review_score": "1"
        },
        {
            "review_text": "This is a pay-to-play MMORPG hack-and-slash title. It has nothing to do with Counter-Strike and shares none of its design or gameplay. The only parts of Counter-Strike actually in this game are the model textures.  I actually encountered obvious bugs just attempting to set it up. The interface is so obtuse that I simply gave up trying to start a game.  Valve- I know that you're just distributing this game but the publisher needs a hint. This title was advertised in a misleading manner.",
            "review_score": "-1"
        },
        {
            "review_text": "at least the uninstall option works",
            "review_score": "-1"
        },
        {
            "review_text": "pay to win =(",
            "review_score": "-1"
        },
        {
            "review_text": "Where are the anime girls!?",
            "review_score": "-1"
        },
        {
            "review_text": "Sh** as hell",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ game boring same like 1.6 so stuped :) if i need zm 1.6 beter ;) easy this ♥♥♥♥ hawe so stuped menu and its same same just other name nexus buahahah pfff",
            "review_score": "-1"
        },
        {
            "review_text": "They didn't even use the source engine. They use the crap combat arms engine... The gameplay is just god awful! It's not even a counter strike! It shouldn't be considered a counter strike. This game should be called 'Combat Arms Zombies'",
            "review_score": "-1"
        },
        {
            "review_text": "When I first got this game it would not start, I would look it up on google and nothing would show up and when I hit play on the game it would either say 'This game requires Steam' or 'Failed to start application (game is already running)' And no matter what I did these two errors would pop up DEFINATLY not recommended to players who are looking foward to having a good time playing this game and this error popping up. If this were to be fixed maybe I would give this a second chance but as of now, Im not going to be playing this at all.",
            "review_score": "-1"
        },
        {
            "review_text": "The uninstallation is strong with this one.",
            "review_score": "-1"
        },
        {
            "review_text": "NOTE: I have played 11 whole minutes of this, but who hasn’t. Imagine if the Counter Strike you all know and love today was turned into a crappy free to play game, now imagine that it got turned into a crappy zombie game, this is Counter-Strike Nexon: Zombies. I saw this on the steam update news and thought that this was a crappy game from the reviews that it had been getting, but decided to play it anyway. How did Nexon even GET the license rights from Valve to make this pile of yesterday’s excrements? I bet they just walked up and said that they would promise it would be a 'good' game, Valve probably said no and Nexon must have made it anyway. Oh also, these guys attempted to make Counter-Strike Online 1 &amp; 2, however they failed to notice that Counter-Strike is already an online game. Enough rambling on from me, time to talk about this game. This game is for people who either want the nostalgic feel of old CS, or for the ever-so-overused zombies. When you start this game you get about 7 popups stating that you got all of these items and its good for some reason, but I don’t want all this crap in games, I just want to play the actual game. After you configure some things in the settings and all that, you can finally enter the game. So far I saw that there are two game modes: Classic CS, and zombies. Classic CS is what you guessed, good old CS in a crappy game. The zombies game mode is pretty self-explanatory, waves of zombies swarm at you like ants to sugar while you sit back and fire bullets at them until raspberry jam spills out of their wounds. Good luck trying to make your way around when the zombies circle around you and you're out of bullets. I also saw that there is a crappy crafting system implemented into this game, it's always crafting and zombies now days isn't it? I have no idea what credits do, I assume it works like the system in Blacklight: Retribution, where you rent the gun for a few days for a 'bit' of your money that is shoved into your face when you start. I also saw some laggy pre-rendered videos of counter-terrorists shooting some zombies or aliens or whatever. There was also an ad on the side that said something along the lines of 'Play today and get rewards', and had the 'sex appeal', as in a woman with a bra visibly shown and a coat on or something. It's funny how the game advertises this and shows a woman in some raunchy outfit, yet there appears to be no female character in the game, sexism at its finest. To wrap this up, it's the typical modern day shooter/zombie/crafting/crappy interface/free to play game, and before you install it, you should uninstall it. ",
            "review_score": "-1"
        },
        {
            "review_text": " Hello, Gabe NeweII here.  As you all know, we developed unique gaming mechanism for sucking money from teenagers for stupid stuff like didldo pink painted AK47 and banana stickers. We are utterly proud of CS:GO.  Sadly, lot of backward thinking people who care only about gameplay are still not switching to this wonderfull instalment. I am talking about CS1.6 loyalists. When you look at  our stats , old 'Counter-strike' is still in the top 10 played games. So we deciced to do something trully unique.  We took the 12 year old engine, slapped the market on it and made it freetoplay. This way we can sell skins and weapons even in this decade old game - and actually make more money! We have not fixed any of the  50 bugs present  [www.sk-gaming.com] . Only think we care about is market, as you can see from the updates. Heck, who even cares about community anyway? On the top of that we wrapped the whole game, so you can not use any of the  5000 skins, maps, and mods present on gamebanana  [cs.gamebanana.com] . After all, why would we want from you to use  free asiimov awp skin  [cs.gamebanana.com] , when you can pay for one? Or instead of realisticly looking terorist, why wouldn't you pay 13.99 euro for model of a girl in stockings?  After all, that is what counter-strike is all about. Shooting chicken with ridiculously painted gun and paying for it. 10/10. ",
            "review_score": "-1"
        },
        {
            "review_text": "this game got me hard",
            "review_score": "1"
        },
        {
            "review_text": "Every Time I try to Play This Stupid game it says 'This Game Requires Steam' And For tose of you who think Dur-de-Dur He should Get Steam, Well, hw am i reviewing this if I dont have Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Currently the resolutions just dont fit right. The graphics are soo bad also. Hopefully they fix this.",
            "review_score": "-1"
        },
        {
            "review_text": "love this game",
            "review_score": "1"
        },
        {
            "review_text": "Nexon turned Counter-Strike into a spooky game.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Needs a lot of work... Right now it's just the old CS! I DON'T SEE NO ZAWMBIEZ",
            "review_score": "-1"
        },
        {
            "review_text": "Not many zombies... not many zombies... let's start off this review with the most riveting sentence ever. Spooky, scary skeletons! Alright, now let me explain. This game has a very old feel to it, and in my opinion, that's good! When I play this game, I can truly say, 'I'm playing the original counter strike right now.' Wanna know why? Cause It's EXACTLY like the first counter strike! EXACTLY. There are barely any zombies and I sure as hell don't remember any samurai swords. What I'm trying to say is that cs:nz has a special cs:go-ish feel to it in the menu, but in the actual gameplay it has a special cs:s feel to it. I've never seen any zombies or any extremely wierd guns but then again, I've only played it for a couple hours so far. When you shoot someone in this game, your rewarded with an explosion of blood, and whenever you kill someone, you hear a deep, loud voice say 'ONE KILL!' And a thing pops up on your screen that says '1 KILL' so when you become a boss at this game and your killing everyone, you will feel proud of yourself. That leads me to my next point as when you first play the game, you instantly become a pro, and I mean INSTANTLY. Ok, maybe not instantly, but after a while. I would highly recommend this game that in all is fun, addicting, distracting, awesome, bloody, amazing and just downright fun.(oh, crap, i already said 'fun') It's free and awesome, all ready to go for anyone who has the fortune to stumble apon this game in the steam store. Enjoy killing people on the internet, and have a good day!",
            "review_score": "1"
        },
        {
            "review_text": "why gives me the 'sensor hack' ?",
            "review_score": "1"
        },
        {
            "review_text": "I like this game but sometimes I need to know how to kick players if you someone know it please send me a messege. ",
            "review_score": "1"
        },
        {
            "review_text": "Don't play this game because there is no point in doing so. If you want to play a real Counter-Strike, then just go ahead and purchase 1.6 or GO. CSNZ is there for to empty your wallet and that's actually very lame. CS :NZ is no comperson to 1.6 or GO and basically the existention of CS:NZ is pointless.  Don't even install this game, because you will regreat it within the first 5 minutes of play.",
            "review_score": "-1"
        },
        {
            "review_text": "LIFE REQUEST! Please make rare weapon easier to get !!! OMGN!",
            "review_score": "1"
        },
        {
            "review_text": "very bad game!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "it is wonder full more gamemodes and plus you can play zombies and who dosent like zombies and mutiplayer for pepole that like defult counter strike get it now",
            "review_score": "1"
        },
        {
            "review_text": "Counter Strike Nexon: Zombies?   &gt;plays  Make Sure You Uninstall This Game a Total Of 700 times Before Playing.",
            "review_score": "-1"
        },
        {
            "review_text": "Best Game I've ever played in my life time.",
            "review_score": "1"
        },
        {
            "review_text": "seems to be some rendering problems with the GTX 660 Ti and 344.44 drivers  expecting the HD 6970 soon so I will retest the game with that  ",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay is extremely bland and repetitive, no tutorial that I could find. I guess you don't really need a tutorial for a game that is so simple it is boring.",
            "review_score": "-1"
        },
        {
            "review_text": "I reccomend this game because is great but i need help. Why i cann't open the game.  Fatal Error error TS1.4 (GetLastError 0x7e)  Hack sensor Game code, which is set with parameter of intialization function, and the license key value is not same with real value.   Help me please...",
            "review_score": "1"
        },
        {
            "review_text": "420/10 would never play again... bye",
            "review_score": "-1"
        },
        {
            "review_text": "this game is so broken If you have any respect for the counterstrike series never play this game or else it will ruin everything you believe in",
            "review_score": "-1"
        },
        {
            "review_text": "Dont even download this its a compele waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "Okay, now everyone says it's uninstallation simulator and everything, and in regard to the zombies, I agree. But, you get to play CS 1.6 for ABSOLUTELY FREE. Recently, I haven't had enough money to buy CS:GO, even though I want it. This game is a good introduction and I think it is pretty fun. 2/5 But free Counter Strike.",
            "review_score": "1"
        },
        {
            "review_text": "it says error but if i get to play it i think it will be good.",
            "review_score": "1"
        },
        {
            "review_text": "The trailer is about the only thing cool about it. Beween the doom style graphics and the hard to navigate menu's while in a match this game is a big NO GO for me. It lacks the smooth transitions and much of the maps are just bad copies of Csgo.. o.o my advice. Get CSGO... its much easier and not nearly as annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "So, it was a good game, but really, I didn't like it. It had the classic Counter-Strike graphics and gamemodes, a 'Zombie' gamemode which was pretty much TDM but the 'Terrorist' team was replaced by 'Zombie' and only had melee. Second, I could not play this in fullscreen. AT ALL. It just minimizes and won't open. I probably can't do my Age of Reckoning trick, so I play windowed. Also, the main title screen is pretty much just one of those 'Buy guns, go play' kind. Also, they give you 900000000 (sarcasm) points, which do a few things but really, most actually GOOD and USEFUL things cost REAL money. I ain't gonna dish out my dosh for a character skin that is $9.99 and has no other features. I ain't gonna dish out the dosh if this gun costs $4.99 for 1 day. Also, there is a glitch where you only do headshots until you get banned from the server for a month. WTF?! So, only download this game for the CS game modes, because most weapons from it are free at the start for a lifetime. AK, M16, Dual Berettas etc.  EDIT: Whoops, I forgot the final verdict.  4.3/10. I'll play it now and then, but only until I get a rea Counter-Strike.",
            "review_score": "-1"
        },
        {
            "review_text": "Not good game, it seems like a big ropoff of regular counter strike with even less features: paying for weapons, worse graphics, and no custom servers. This just might be worse than combat arms.",
            "review_score": "-1"
        },
        {
            "review_text": ":) ",
            "review_score": "1"
        },
        {
            "review_text": "Plz take this garbage off Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "It's like Nexon and Couter Strike had a very ugly and laggy child. Bad move on teaming up with Nexon...",
            "review_score": "-1"
        },
        {
            "review_text": "The mechanics are simplistic, it's an over-hyped hide n seek game, and most people just try to jump to the most impossible spots to reach. I didn't have a lot of fun playing this, but I'll have to try more in the future, to see if there's something I'm missing. The mod was decent enough, but you need to come up with something more contemporary, and less glitchy.  The most annoying part of this game, is constantly clipping on other players, and the map.  The most fun thing about this game, is hiding in a little spot and winning the game of hide n seek.  In summation, it's simplistic, and I didn't find it very entertaining.",
            "review_score": "-1"
        },
        {
            "review_text": "It's very funny and awesome i like scenario mod is the best! ",
            "review_score": "1"
        },
        {
            "review_text": "The best zombie game i ever played!",
            "review_score": "-1"
        },
        {
            "review_text": "The negative reviews are true, couldn't even get into a server, within 20 seconds of launching the game, it crashes to desktop, and once where it actually held for 1 minute, I tried creating an ID and it didnt give a prompt of whether or not it was available. Not good at all.",
            "review_score": "-1"
        },
        {
            "review_text": "it crash becuase the server but the graphicks is like a old game but the gameplay is good",
            "review_score": "1"
        },
        {
            "review_text": "Whats worse than a game that you cant play?  .....oh wait, nothing. Way to go Nexon, you done ♥♥♥♥ed up!",
            "review_score": "-1"
        },
        {
            "review_text": "this game is too GOOD but consume so much rams :( ",
            "review_score": "1"
        },
        {
            "review_text": "why is it saying hack block when i didn't hack if that is what that means i don't know how to hack or anything like that.",
            "review_score": "1"
        },
        {
            "review_text": "This is 1 of the best Counter-Strike game",
            "review_score": "1"
        },
        {
            "review_text": "' 8/8 Most innovative barricade shooting simulator on Steam' - Gamespot  '360/420 Like Skyrim with Guns, zombies and without the fun' - Machinima  '9999999999999999999/9999999999999999999 It's ok' -IGN  '10/10 Best lag simulator since Two Worlds' - Me",
            "review_score": "-1"
        },
        {
            "review_text": "The best 30 minutes of my life.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a free to play game so you really can't say it sucks because it's like a counter strike free to play not a demo but not the whole package. But it's really fun i reccomend this 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Just pure fun!",
            "review_score": "1"
        },
        {
            "review_text": "Should give it a go",
            "review_score": "1"
        },
        {
            "review_text": "its cs 1.6 with Nexon's name slaped infront of it. But at least the uninstall button still works.",
            "review_score": "-1"
        },
        {
            "review_text": "looove it",
            "review_score": "1"
        },
        {
            "review_text": "Loved playing Counter Strike: Online using proxy servering, and glad that it's released in the United States.",
            "review_score": "1"
        },
        {
            "review_text": "Its ok i wouldn't reccomed it if you have CS GO or CS but if you wanna practice before you get CS GO when you get cash this is a good way to practice :)",
            "review_score": "1"
        },
        {
            "review_text": "a good game to uninstall",
            "review_score": "-1"
        },
        {
            "review_text": "I found this game pretty boring and just not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "For my first expericanes this game is decent. 6/10 But I wouldn't recomendd it. Just go buy CS:GO on summer sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Just play on Zombie servers in CS 1,6 , Source or GO . Don't waste your time with this crap 3.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "From what I've seen so far, It's just CS 1.6 with a few new things. One. Instead of every weapon having a slight variation in how much they slow you down, Everything turns you into a turtle. Thus resulting in the Panic-inducing crawl of death.  Two. From what i've experienced, you BARELY find zombie servers.  Three. No Ranking. I was once a very loyal Nexxon customer. I loved Combat Arms. It would *note, WOULD. not will.* pair you with someone of your own rank to save frustration. But then came the Hackers. This game has the same problem as combat arms does now. No ranking. No pairing. Lots of Hackers.  Overall, I would not reccomend this game to anyone who isn't good at counter strike, and dealing with Hackers.  5/10. Would play again, just to have a laugh or two.               ",
            "review_score": "-1"
        },
        {
            "review_text": "Like skyrim with korean anime ♥♥♥♥ n' guns.",
            "review_score": "-1"
        },
        {
            "review_text": "If people gave the game a chance they will see its actually not as bad as people think.  8/10  Its not paid to win, you can get items so you can get the crafting materials. The zombie modes actually have different classes, and is actually a deep system.  The extra weapons are cool. Its a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Thank god this uninstalled in like 3 seconds! Not Reccommended #PixelatedAids",
            "review_score": "-1"
        },
        {
            "review_text": "what a ♥♥♥♥♥ shite game",
            "review_score": "-1"
        },
        {
            "review_text": "1) Buy the game because it's basically a free counter-strike game 2) Cry because it's CS 1.6 with zombies 3) Realise that this is actually an okay game 4) KILL ZAMBIS!  Overall, this is a pretty fun game, that is if you're not too picky about F2P games. It's free, what did you expect?  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Very pathetic excuse for a counter strike game. Not reccomended, theres many more free to play games on Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Fairly good when you get past all the P2W. If you like Counter-Strike and like zombie games, then you should give this a try. It's only P2W if you choose to pay. It's still enjoyable without paying. After all, it's FREE.",
            "review_score": "1"
        },
        {
            "review_text": "Just like the Original Counter-Strike but with more content :D",
            "review_score": "1"
        },
        {
            "review_text": "'None of your friends have played this game recently. Tell them why they should.'",
            "review_score": "-1"
        },
        {
            "review_text": "420",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy killing Zombies, this game gives you that but not much more, you do have Original mode, which is what I played most.  So if you want more in depth reviews about the Zombie side of the game you should scroll down to see reviews of people who played zombie mode more than I did.  I'm just gonna focus on the Original.  So, you will mostly just play 1 map, Dust2. You will experience how many people are actually good with the ARX *cough cough*.  There is not much more to be said, except that if you do enjoy Counter Strike 1.6 with some extra spice then I recommend playing this, it's fun and I didn't encounter much cheaters. There is quite a large player base as I saw, but a lot of Turkish or so people, and A LOT of russians (as all CS games).  Don't let my hours fool you, I'm a veteran of Counter Strike games, I always enjoyed it, even the lows of this one are blown away by the love for this still to this day awesome game.  I would rate it a solid 8/10.  Sorry for the long post, here's a potato (== )",
            "review_score": "1"
        },
        {
            "review_text": "Good Game PLz Download it!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "i never review games but i had to this time, this game is so bad. its purely pay to win, the online is sketchy, and the zombies mode is terrible. if i wanted to pay for counter strike id pay for counter strike, -10/10 uninstalled",
            "review_score": "-1"
        },
        {
            "review_text": "The game is ok, great for low end pcs, full of microtransactons which is expected in a f2p but they dont hinder your enjoyment of the game",
            "review_score": "1"
        },
        {
            "review_text": "Horrible Graphics and kinda confusing",
            "review_score": "-1"
        },
        {
            "review_text": "Really good game. But why did you release basiclly a free cs:source? Its almost the same game but free and with zombies. (no compliants awesome game valve!)",
            "review_score": "1"
        },
        {
            "review_text": "This would be a nice free-to-play old CS 1.6 with zombies mods with fantastic guns &amp; fun characters. Please therefore do not use the standards of recents FPS games' graphics to score it.",
            "review_score": "1"
        },
        {
            "review_text": "This is the worst game I've ever played, it is not even a joke. This 'game' is a pure ♥♥♥♥♥♥♥t, my brain got ripped off immediately after turning it on. If you want to play this game don't do it, just don't. This is my worst experience with computer games, ♥♥♥♥ that ♥♥♥♥ I am back to club penguin and GIRLZ MMORPG.",
            "review_score": "-1"
        },
        {
            "review_text": "I NEED HELP!!! every time i play like an hour or 2 hours the game automatic switch to the main screen. then after i come back to the game to play the game screen is completly black and the game is runing. how can i fix this its ♥♥♥♥♥♥♥ me off. CSN:Z please help me fix this proplem. thanks",
            "review_score": "1"
        },
        {
            "review_text": "It's good because I can't buy the CS 1.6 or Source in the shop but ths games is free w/ zombie mode, and I think this is a really enjoyable game.     But the graphics can be better, but it's OK.",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike and zombies, whats not to love?",
            "review_score": "1"
        },
        {
            "review_text": "So i download the game and i play it when it starts it says 'This game requires steam.' I HAVE STEAM DOWNLOADED LIKE WTF",
            "review_score": "-1"
        },
        {
            "review_text": "this game be fun",
            "review_score": "1"
        },
        {
            "review_text": "Just play CS 1.6, Source or GO with a zombie mod. If you just want a zombie game, try L4D/L4D2, Killing Floor, etc. Not that we don't have enough zombie games already.  All I saw here was nothing more than an obvious attempt to cash in on old school CS nostalgia with microtransactions and pay2win. Also, I had a better time navigating through the user interface in Skyrim. Never thought I'd say that before.  In brief:  -free2play -pay2win -camp2win -zombies are bullet absorbent SHAMWOW -rental guns -crafting lel -basically modded CS 1.6 with microtransactions and nexon slapped on the title -2GB game size for a 17 year old engine -low population game modes -OP wanks everywhere -connection lost -awkward resolution -GUI is a complete clusterfock -nexon  gg -420/10 would bang my head again c'est tres mal F- shame, see me after class",
            "review_score": "-1"
        },
        {
            "review_text": "Is it bad to criicize a free game? this is just TERRIBLE!!... ",
            "review_score": "-1"
        },
        {
            "review_text": "Unlike CS:GO, I enjoy this game. My only complaint; When you are shot, you can't move. You're characters movement just kinda stutters. Yes, I know, it's the same in Global Offensive. I'm not sure who thought that was a good idea. Overall, multiplayer IS fun and so is zombies.",
            "review_score": "1"
        },
        {
            "review_text": "haif life 2 controls",
            "review_score": "-1"
        },
        {
            "review_text": "-insert a long paragraph that explains how this game is good here-",
            "review_score": "1"
        },
        {
            "review_text": "U will uninstall it faster than u can click the button to play it",
            "review_score": "-1"
        },
        {
            "review_text": "this is a free cs 1.6. i like it, because it's not a pay to win game. :)  10/10",
            "review_score": "1"
        },
        {
            "review_text": "&gt; Sprays on zombies for 3 minutes &gt; Zombie notice me and he kills me with 1 swing   11/10 , would get killed again .    [Not english]",
            "review_score": "-1"
        },
        {
            "review_text": "Lol, same fps capping like fallout, 60 fps for 60hz, 72 fps for 72 hz.  I'm going to give this a thumbs up because free cs 1.6",
            "review_score": "1"
        },
        {
            "review_text": "poor graphics, poor UI, buggy, 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "Very Nice Game  ",
            "review_score": "1"
        },
        {
            "review_text": "Had a lot of potential to be a fun mod, but in its current state humans are too op  bullet knockback is the same as normal CS and not reduced at all  Since humans have guns and zombies can only melee its like a team of knifers trying to beat a team of normal csgo players  the devs tried to fix this by giving some zombies more health or grenades but it just lets them get knockback longer  all humans have to do to win is sit in a corner and spam when zombies try to get up  also server browser is confusing",
            "review_score": "-1"
        },
        {
            "review_text": "Good enough, but to many problems with the server, this server error, came 1/2x a week and can't be online for a freaking week/month, so the publish a unfinished game, and in some of the rooms, you got to much laggs, thatyou can't even play, because you have a good internet connection, and a fast game pc, otherways i like the game really much, thats why i give a thumb up, but they need to work on their server errors, that REALLY annoying man...",
            "review_score": "1"
        },
        {
            "review_text": "I got in a game looked at my screen never got in another game",
            "review_score": "-1"
        },
        {
            "review_text": "free thumb up :|",
            "review_score": "1"
        },
        {
            "review_text": "Very Great game with ok graphics ",
            "review_score": "1"
        },
        {
            "review_text": "its sa ying that i need steam i am on staem ",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game,its gives you option of co-op or classic csgo mutiplayer :D i like this game  ",
            "review_score": "1"
        },
        {
            "review_text": "where do i start just just uhhh this is just ♥♥♥♥ing bad where to start   guns: u only get them for 7/10/30 days just what the ♥♥♥♥!?  gameplay: it ♥♥♥♥ing stupid   players: remember they say this is a good game? well they lie   don't play this game nexon lie about this one valve never help them make this they can tell this game is bad",
            "review_score": "-1"
        },
        {
            "review_text": "Its so weird that this game has Awesome trailers and cutscenes but the graphics (Pwwwhhhh)",
            "review_score": "1"
        },
        {
            "review_text": "Pros: F2P  Cons: You don't know what anything in coutner-strike is anymore.  IGN 9001/9000",
            "review_score": "-1"
        },
        {
            "review_text": "so many bugs and so much pay for guns buy counter strike",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game for free... There are no Australian servers... I want my free back",
            "review_score": "-1"
        },
        {
            "review_text": "Tbh this game is super fun to play for me at least :D i like the old feel of cs:go pretty easy but it is a game where you have to buy stuff but not weps the shop is very weird and kinda dumb pay to look good type game i guess most things are money some are points and eh i don't like that but the gameplay is pretty fun would i recommend trying it out ehhhhhh maybe out of all gameplay to me 10/10 everything else i'd say like 6 under",
            "review_score": "1"
        },
        {
            "review_text": "Graphics: 5/10 Weapons: 6/10 Gamemodes: 3/10 Layout Of main Menu And In Game: 3/10 Overall: 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "YOU GOTTA SEE THIS URGENT MASSAGE!!!!!  Hello, my account name is Harrito could you do me a favor, sir or ma'am? Nothing but could you give us more time to do Jackhammer event for those who unfortunately couln not make it due to some personal situations like back home from a trip  could you delay the date?? it is from 3/30 to 4/14 right?? but mine is like 1 more, like it is gonna be 9 out of 10 on 4/14 Im like oh no~~~~~~~~ pls I like Counter strike zombie so much I want to get this weapon pls delay the date  this is my wish  I will keep playing this  Have a nice day and God bless you",
            "review_score": "1"
        },
        {
            "review_text": "Rip",
            "review_score": "-1"
        },
        {
            "review_text": "Game gave me autism 10/10 would play again",
            "review_score": "-1"
        },
        {
            "review_text": "This Is The Most Amazing Free 2 Play First Person Shooter Out There! I Love Counter-Strike And Got This Game To See It Out. It Is Great!",
            "review_score": "1"
        },
        {
            "review_text": "the game is good and the qulity too but the new scurty seystm is anoying i rocomend this game becoues you can play story mode and zombie mode and pvp mode 3 in 1 better then counter strike go becoues it dos not have a story mode and a zombie mode",
            "review_score": "1"
        },
        {
            "review_text": "pay2win is fun but gets boring after first 20h's    I have 90+hours cuz i played this before getting cs go",
            "review_score": "-1"
        },
        {
            "review_text": "this gaem is k but i didnt hak it and it ays i did liek wtf man",
            "review_score": "1"
        },
        {
            "review_text": "Literally spray and pray. Amazing.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥.worse than the absolute bottom pit-CSGO",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get this game unless you have a really beefy computer, like with a Titan Z.",
            "review_score": "-1"
        },
        {
            "review_text": "Those are some bad graphics for a game released in 2014. By the way it was released on my b-day ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Would you guys like some suckitin and tacos?",
            "review_score": "1"
        },
        {
            "review_text": "there are games which are better than this for free",
            "review_score": "-1"
        },
        {
            "review_text": "hello counter strike nexon zombies. a lomg time ago there was the prize if you get enough piece of transcedence.  if you get 888 piece of transcedence you choose M4A1 Darthnight or AK47 paladin. I saw a video today then you need to use this and then you choose but i didn't knew this and i was have enough to choose one. i will be very very happy if you give me one of them.  happy if you understand and i very like this game.",
            "review_score": "1"
        },
        {
            "review_text": "It has XIGNCODE. If you dont know what XIGNCODE is then it is pretty much a program that scans your history from 48 hours.",
            "review_score": "-1"
        },
        {
            "review_text": "pretty good game i love it ",
            "review_score": "1"
        },
        {
            "review_text": "It is very very addictive afteer you play for 32 hours lol XD",
            "review_score": "1"
        },
        {
            "review_text": "sometimes good sometimes hard to play Xd",
            "review_score": "1"
        },
        {
            "review_text": "great game ak to powerfull",
            "review_score": "1"
        },
        {
            "review_text": "Is Perfect Game FPS for me Goo For New Events,Maps And ETC. ;)",
            "review_score": "1"
        },
        {
            "review_text": "it is just like left for dead just call it left foor dead 3 bad",
            "review_score": "-1"
        },
        {
            "review_text": "didnt like the flow of the game",
            "review_score": "-1"
        },
        {
            "review_text": "GOOD GAME I LOVE COUNTER STRIIKE",
            "review_score": "1"
        },
        {
            "review_text": "it's a waste of time, as the game is boring, looks terriable and it's impossiable to figure out how to play it with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "A more active version of CS 1.6 with a twist and zombie mode, really fun",
            "review_score": "1"
        },
        {
            "review_text": "Ok welp, idk what happened to this game... suddenly the reviews are better.... its scaring me... please just.... idk.... i don't even know if this game is play to win anymore! Its been long since i've actually played this game for like a while like i used to (maybe like 5-8 hours straight)",
            "review_score": "1"
        },
        {
            "review_text": "It is a masterpiece for Free to play. Free 1.6. Interesting topic with skins. Well done the developers!!! Nothing to complain about.",
            "review_score": "1"
        },
        {
            "review_text": "Its a good game",
            "review_score": "1"
        },
        {
            "review_text": "This Fun Game",
            "review_score": "1"
        },
        {
            "review_text": "Like a poor man's CSGO.",
            "review_score": "1"
        },
        {
            "review_text": "Upon playing the game i realised that the graphics were alot worse then seen in the trailer. And another complaint is that the gameplay is repetetive and boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly, it's not that bad. I don't know why people say it is.  It's kind of pay to win, I get it but the weapons aren't so overpowered that it kills you in one shot. I love the zombies mode and also the gun game mode, and the one mode where you play as giant monsters, SO FUN!!...... and the fact that it's the style of the old counter strike reminds me A LOT of Sven Co-op which is an amazing game, recreating hl1 but multiplayer, but this is the old counter strike, but with new stuff obviously (It's different but the graphics are nostalgic)  I would give this a very solid 7.5/10 also, I recommend it if you can't buy Counter strike global offensive, or Counter strike source.",
            "review_score": "1"
        },
        {
            "review_text": "Update to this review: With the updates over the past year, this game has become nothing but play to win. All the best gear is obtained through 'Decoders' which are a pain to get as you have to play for almost 3 hours just to get the max for that day. Or you can buy them for a dollar a piece. Game events are completely redundent. Not what they used to be. 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "How do you change the map?",
            "review_score": "-1"
        },
        {
            "review_text": "Pay2Win, dominated every little kid there was.",
            "review_score": "1"
        },
        {
            "review_text": ";) ",
            "review_score": "1"
        },
        {
            "review_text": "Really fun version of the classic game Counter-Strike. Many different game modes and weapons. I strongly recommend this game to all CS lovers out there!",
            "review_score": "1"
        },
        {
            "review_text": "It is not even 'PvP' Counter-Strike  Last time, when i played this game, it was P2W.   Propably still it is.   Dont touch, buy Left4Dead or Left4Dead2 and Counter-Strike or Counter-Strike: Source, then enjoy.   Dont pick this as cheaper choice.   Just.   DONT.",
            "review_score": "-1"
        },
        {
            "review_text": "People with addictive personalities that fall under the f2p/p2w category need to know that yes you can earn weapons but its easier to buy them so please be warned that if you tend to get dragged into that type of thing it is a fun game but its definitely a pay 2 win game.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent version of Conter Strike. In the beginning does not start, but on the video it seems that it is worthy of time and attention on its passage",
            "review_score": "1"
        },
        {
            "review_text": "This game OK. But the qulity is ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "its not working it says this game requires steam !!",
            "review_score": "-1"
        },
        {
            "review_text": "Free CS 1.6+more fun than any from the other games from the series.  -10/10 was not disappointed",
            "review_score": "1"
        },
        {
            "review_text": "How to play the original counter strike for free.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game, sorta. It's graphics are bad, but nostalgic if you are a 1.6 or Source player, but the zombie mode is very boring and sorta bad. However the bot mode is very fun if you do Bomb Defusal, 16v16 with friendly fire on. It's a cluster♥♥♥♥ of guessing who the enemy is! 3/10 Very enjoyable at some times, but online is so bad.",
            "review_score": "1"
        },
        {
            "review_text": "its a nice game yo",
            "review_score": "1"
        },
        {
            "review_text": "well this game is good but its need to be update",
            "review_score": "1"
        },
        {
            "review_text": "The worst game I have ever seen. Bugged out two computers that I used that were mine and couldn't get them fixed. DON'T DOWNLOAD!!!!!!   0/10 would not download again",
            "review_score": "-1"
        },
        {
            "review_text": "If, for some reason, you can't buy an actual Counter-Strike, this is a decent alternative.",
            "review_score": "1"
        },
        {
            "review_text": "That moment when you play cs with new guns.  10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "ok, so I just finished downloading it, and started playing. I did the totourials and stuff, then i went to play i real game.  At the time I spawned in, I wasnt too impressed by the graphics. But that didnt matter! It has great gameplay and is very addictive. Aside from a few bugs, the game is great! And you should definetly get it. ",
            "review_score": "1"
        },
        {
            "review_text": "Good Games lvl 25 ^^ ",
            "review_score": "1"
        },
        {
            "review_text": "Honestly thought it wouldn't beso much like cs sources zombie servers...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing. Yeah you may not like the graphics but the gameplay is great.  [|PROS|]  -you can get cool items for free  -cool camos ingame   -more weapon varieties than CSGO (Ex. Battle Axe, Fists, and Swords)  [|CONS|]  -Graphics are terrible  -not many online players so you'll have to play againts bots   Overall I'd rate this game ★★★★☆/★★★★★",
            "review_score": "1"
        },
        {
            "review_text": "After more than 506 hours ingame I can say that this game is cool and very fun. There are so many game mods that it\\'s never boring in this game :D About the weapons I can say only that you have to play to get used with the weapon because each one is useful in a different case. If you don\\'t understand all of the game content don\\'t worry for 3 hours of playing you will already know what you need! At least, there are many events which give you a good chance for a weapon or sth else.  For me: 9/10 stars :D",
            "review_score": "1"
        },
        {
            "review_text": "it kicks me out of the game no reson",
            "review_score": "-1"
        },
        {
            "review_text": "PVP IS ♥♥♥♥ING TERRIBLE. But the zombie game modes are great. As long as you don't buy anything you are good",
            "review_score": "1"
        },
        {
            "review_text": "it's alright if you have money to waste",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "  A lovely game dedicated to counter strike minigames",
            "review_score": "1"
        },
        {
            "review_text": "Theres not much to say about this game. This game, personally, I use for the fun and not a competetive aspect. It's really not much a skill based game but that's what makes it so fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "this game requires steam. me: yep definitely haven't installed steam but hey the exit button works 0.0000000000075/10  ( ͡° ͜ʖ ͡°)",
            "review_score": "-1"
        },
        {
            "review_text": "  You need to play at least one years everyday to get a decent account to play Or you can just buy a 50$ millege decoder and hope you get a good gun to play",
            "review_score": "1"
        },
        {
            "review_text": "I have played CSOL，is as same as this game.I guess Csol is more fun but this game you could spend less money.... Pay to win，that's ture.But when you play with your friends or you have a good skill and you are lucky,everything is changed.  For a lot of you guys, cs NEXON-ZOMBIES is not a real cs game.But just because its gamemode,it's became unique.This game really need you to spend lots of your money if you dont play it for a long time.But if you enjoy it,time is not a problem.  By the way, mostly teamates are SUCK(There are no coop)! Everyone just care about themselves when I try to lead the team. For team work,CSGO is much better.",
            "review_score": "1"
        },
        {
            "review_text": "Like this game ,good to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "i love this game cuz i can give free hugs  ",
            "review_score": "1"
        },
        {
            "review_text": "fun game if you like parkour but i think there should be some more surfing maps",
            "review_score": "1"
        },
        {
            "review_text": "Best game if it dont exist Point Blank or Crossfire on the zombies whith",
            "review_score": "1"
        },
        {
            "review_text": "The whole ♥♥♥♥ing thing is a mess.",
            "review_score": "-1"
        },
        {
            "review_text": "Hmmmm...Let's see...  Gamemodes and maps: They are OK but could be better. Almost every game I played was on de_dust2  Characters: Half of the players are using the female characters which is Ok with me, but it distracts players around them. Oh, and you have to buy them for $6.99 each.  Weapons: Too OP and don't fit in with the rest of the theme. Oh, how many times have I been unfairly killed by these weapons. Example: I join a game. I am last standing player on my team. I see an enemy. I have an AK-47, enemy has this weird gun. It looks like a Nerf blaster. All my bullets miss, he shoots a laser. Instantly dead.  DLC: Yes, there is DLC for this game. I know, shocking! And they cost around 15.00 - 20.00$ And throw some microtransactions in there aswell, why not?  Pros: - Money Wasting Simulator 2420 - Exit button si the best button in the entire game! - Random noobs inviting me to some stupid parties - Best OP weapons 2069  Cons: - Careless money grab - Laggy and boring gameplay - Don't play unless you're too poor to buy CS 1.6 - Almost every Basic is on de_dust2 - Makes me wanna cry :,C - In every game there is a single guy just standing in spawn not doing anything - You HAVE to come every day for rewards or you will only have bad, underpowered weapons - Every single 'custom' weapon is a gimmick - Waste of space - This game exists. volvo pls fix  BEST UNINSTALL/EXIT SIMULATOR 1337/420 IGNE",
            "review_score": "-1"
        },
        {
            "review_text": "Free 1.6... But i dont know... its a little bit boring. :D",
            "review_score": "1"
        },
        {
            "review_text": "nice game free 1.6",
            "review_score": "1"
        },
        {
            "review_text": "It's okay I guess",
            "review_score": "1"
        },
        {
            "review_text": "I want to say, first time I play this game was about 9 years ago, I am not kidding. I clearly remamber I was a secend year middle school student that year, my best friend told me a zomber version CS just released, We were so excited about this. It called CS-olline in China. Then we joined the battle of this amazin zombes game. There was only one type of zombe (that one has speed boost) and tow guns can be percased (MG3 and M134),most people use AK47 for there premiary wapon, but that was so fun and so exciting. I stell remamber for the first tow years, CS-online had about 10 servers and full of players all the time, sometimes I could not squeeze in. Yeah, it was a hot game, we all had good memeries then, I miss that so much. Now, I play this game again on steam, to commemorate those years.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would crash my PC",
            "review_score": "1"
        },
        {
            "review_text": "it's overall alright although kind'ova ♥♥♥♥♥ to get started due to my pc's firewalls and other things but yeah overall yeah it's pretty frigging fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Man I hate english god damn! I have no friends I have no enemies (♥♥♥♥ man) but this game is something.",
            "review_score": "1"
        },
        {
            "review_text": "Good way to pass time",
            "review_score": "1"
        },
        {
            "review_text": "csnz is just the original but with zombies so you could call it cs zombies mode",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good, although it could be better. I hope they make it better in the future. Other than that, it's a pretty solid game.",
            "review_score": "1"
        },
        {
            "review_text": "Top game ♥",
            "review_score": "1"
        },
        {
            "review_text": "Bad Game Good Memes",
            "review_score": "1"
        },
        {
            "review_text": "good f2pgame ive spend atleast 12$ love ya nexon please doan free 100 decoder event",
            "review_score": "1"
        },
        {
            "review_text": "While this game does have lots of content and different things to do,it boils down to  PVE Zombies:Lets hide in a corner! Campaign:Lets hold down LMB! Deathmatch:Lets have zero idea what we are doing! Zombie Scenario:Lets just stay at the base,while everyone else does everything for us!   Lets not play any other gamemodes!  While the game does have plenty of things to do,its ruined by the fact that most of that content is terrible/nobody plays it   Did i forget to mention the increadbly annoying P2W system the game has in place?    ",
            "review_score": "-1"
        },
        {
            "review_text": "The Zombies were hotheads.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game but is pay to win",
            "review_score": "1"
        }
    ]
}