{
    "app_id": 273500,
    "name": "Over 9000 Zombies!",
    "release_date": "2015-02-25",
    "developer": [
        "Loren Lemcke"
    ],
    "publisher": [
        "Loren Lemcke"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Co-op",
        "Online Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Zombies",
        "Indie"
    ],
    "achievements": 43,
    "positive_ratings": 948,
    "negative_ratings": 161,
    "price": 1.59,
    "description": "Over 9000 Zombies! is top-down arcade action blown out of all reasonable proportions. An endless horde of zombies is coming your way, how long can you survive?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/273500/header.jpg?t=1480607988",
    "minimum_requirements": "Betriebssystem: Windows XP (SP3), Windows Vista (SP2), Windows 7, Windows 8 Prozessor: 2.0 GHz Dual Core Processor Arbeitsspeicher: 2 GB RAM Grafik: GeForce 8800 or equivalent. DirectX: Version 9.0c Netzwerk: Breitband-Internetverbindung Speicherplatz: 200 MB verfügbarer Speicherplatz Soundkarte: DirectX 9.0c compatible. Zusätzliche Anmerkungen: While in early access system requirements will fluctuate as development continues, please ensure you safely exceed the stated specifications to ensure the best experience.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "They really sold themselves short calling this game 'over 9000' zombies.   Yeah there are over 9000 zombies. But it's like saying over 9000 grains of sand on the beach. We're talking a lot of zombies here. Like hold down the grenade button and lay on that flamethrower and there are still too many zombies to see the ground. We're talking like, if these zombies were spontaneously generating from dirt, there's no way we aren't violating conservation of mass with all these zombies. We're talking more stories than grandpa has about the fourties zombies.  It's fun and simple. Would have liked to have seen more done with the building system, would have liked to see something to help with collection of drops, would have liked to see a higher turret limit than 6 (really, only 6?), but it is what it is and it works.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Great time-killer and has a variety of guns and power-ups. Get it on sale while you can. I promise you'll have no regrets getting this game. That is all.",
            "review_score": "1"
        },
        {
            "review_text": "I think I love this In this game you dont need to think just kill, kill and kill  pros +hard game xD +game is based on days, so you need survive long as possible +have leaderbords, so you can track down your progress +weapons are based on how much you kill, more you kill, stronger weapons unlockng +have turrets,make game little easier with them +amazing soundtrack,really good for this type of game  cons -maybe for some players this game is expensive but try grab on sale, I bought with coupons have no regrets :D ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would stay up till 6AM playing again",
            "review_score": "1"
        },
        {
            "review_text": "ayy lmao this game is awesome, try it now it's cheap lel uh huuuuh",
            "review_score": "1"
        },
        {
            "review_text": "Great game, lots of fun and replayable by getting new maps! The game is amazing. Pros: Killing Cons: None  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun relaxing game when you get to shoot 2D zombies.",
            "review_score": "1"
        },
        {
            "review_text": "Cool and Good.",
            "review_score": "1"
        },
        {
            "review_text": "Wow.... what a dull game. Are people trolling during the reviews?",
            "review_score": "-1"
        },
        {
            "review_text": "pretty annoying that the screen shakes when u shoot, which u are doing constantly",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and adictive. put i think its a bit too pricey for what its is. i still recemend it thoe",
            "review_score": "1"
        },
        {
            "review_text": "Extremley fun yet addicting game, needs tweaks and more content but has alot of potential. I would like to recommend it ! The multiplayer is simply amazing, except for a bit laggy Score : 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I hate that I love this game. The graphics are meh. The shooting / targetting system is meh. The weapons are meh. Yet this game is super fun, as it is challenging, super dynamic and, well, there's tons of killing. I ike the tactical side of it, where you think how you'll use your resources to build turrets and walls to better defend yourself from the next wave of zombies. It's just pure fun. In short, worth the few dollars no doubt.",
            "review_score": "1"
        },
        {
            "review_text": "lots of simple fun with a nice weapon evolutionary system that can get you quickly addicted. The map editor is a great touch, allowing you to make and publish nice maps with a somewhat limited amount of tiles as well as download user mad maps thanks to the steam workshop. I spent an hour and was able to make what I think is an ok map 'Office Outbreak'",
            "review_score": "1"
        },
        {
            "review_text": "It certainly is 'Over 9000'!  A great game to relax with a friend or group; chill, drink, and watch the whole world burn...",
            "review_score": "1"
        },
        {
            "review_text": "Pretty cool game so far like the turrets!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "For a survival game, this is an incredible purchase. Great weapon progression, challenging waves, and Steam workshop. But even after all the guns and blood, the best part is still the feature where the zombies chew through walls. Makes the map much more fun, especially on the later waves when there are hordes outside your house. Has a few bugs in 4-player split screen, but well worth your time. I would try to get it on sale though, as it can go for cheap.",
            "review_score": "1"
        },
        {
            "review_text": "Over 9000 Zobies is a great top-down shooter with base building elements. I got it on sell for a dollar. This is an amazing price for this game. For 10 I still wouldn't hesitate on buying another copy! ",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Could do with a few tweaks/additions but on the whole a top game to kill 45 minutes.   7/10 solo 9/10 with friends.",
            "review_score": "1"
        }
    ]
}