{
    "app_id": 273600,
    "name": "Descent: FreeSpace – The Great War",
    "release_date": "2014-05-07",
    "developer": [
        "Volition Inc."
    ],
    "publisher": [
        "Interplay Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Includes level editor"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Space",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 123,
    "negative_ratings": 30,
    "price": 6.99,
    "description": "Volition's classic is back. Descent: FreeSpace is the quintessential old school space shooter. With a deep story, great graphics and engaging battles against fighters to capital ships it keeps you moving. Breakout that flight stick and enroll with the Grand Terran Alliance today.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/273600/header.jpg?t=1447360124",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8 Processor: 1 Ghz Memory: 256 MB RAM Graphics: 3D graphics card compatible with DirectX 7 DirectX: Version 7.0 Network: Broadband Internet connection Storage: 1600 MB available space Sound Card: DirectX 7 Direct Sound compatble or better",
    "recommended_requirements": "Processor: 1.4 Ghz Memory: 512 MB RAM Graphics: 3D graphics card compatible with DirectX 9c DirectX: Version 9.0c Network: Broadband Internet connection Sound Card: DirectX 9c Direct Sound compatble or better",
    "reviews": [
        {
            "review_text": "This is the greatest video game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "I remember playing its demo over and over again when FreeSpace was released in 1998. As a 12-year-old I was in awe and completely immersed in the experience fighting the unknown, mysterious and deadly Shivans. When it released on Steam a while ago, I instantly bought it and relived that same feeling - albeit with an xbox 360 controller rather than my old joystick - I recommend using a joystick if you have one, the 360 controller lacks precision for this type of game (though not enough to be disruptive).  If FreeSpace 2 is the better game, this one opened up the world of space combat sims for me. Looking forward to playing more similar games now that the genre is seemingly becoming more popular again.",
            "review_score": "1"
        },
        {
            "review_text": "The day has finally come! We are getting FreeSpace 1 and 2 it seems! I cannot stress how amazing these two games are. Hands down THE BEST space sims out there, and some of the best games ever released, period. Amazing dialogue, probably the best I've ever encountered, and I've played my fair share of games in my 20 or so years of gaming, along with absolutely amazing combat mechanics, and visuals that hold up today, this is a MUST BUY.  DO IT.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game when it came out, but the lack of removing the inverted controls from the mouse input is just annoying...",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game when it came out, but the lack of removing the inverted controls from the mouse input is just annoying...",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Dogfighting is very fun, and story is good, joystick/controller support Cons: Forced 480p, Cursor is very jittery  I have found 0 mods that can fix the cons, but I'm sure they're there.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay (Balance/'Game Flow'): 5/5 (The Weapon and Ship statistical builds in this game kick ♥♥♥! The best in the 'dogfighting' genre) Story: 4.75/5 (This entire series has a great story. It is so good that Mass Effect stole the idea of an all-powerful race that destroys worlds and creates subspace nodes to 'cleanse' and retain the 'cycle.' That's right the Reaper race is a copy of the Shivans) Presentation (Visuals/Soundtrack): 4.75/5 (Not as glamorous as the graphical update in FS2 but still has a better Soundtrack) Replay Value: 4.75/5 (Silent Threat is a fantastic add-on for the Multiplayer and the Singleplayer. Have fun spending countless hours enveloped in the massive array of missions) Multiplayer/Co-op: 5/5 (So many missions to overrtake with friends either as allies or enemies!) Difficulty/Progression: 4.5/5 (The statistical records this game stores for you is detailed, not to mention the medal case you have to put your prized accolades in) Level Design: 4.75/5 Fun Factor: 5/5 (It is extraordinarily challenging to break from this game. The missions, whether it's Multiplayer or Singleplayer are challenging, intense, and a hell of a lot of fun!)   Overall: 4.81/5 - 96% | Outstanding (I honestly believe this is one of the best if not the best video game ever made. I still think it is better than the critically acclaimed sequel Freespace 2 which is also terrific but the original captured that perfect balance with the ships and weapons that really translated itself into the gameplay)",
            "review_score": "1"
        },
        {
            "review_text": "Wow... this game is epic. It functions with the insane totaly uncontroled yet navigable combat feeling that you find in planetside, a fully original flight mechanic and a story told more through atmosphere than words. Highly recomended for fans of the finer things of life",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games of all time, and certainly the best space-shooter of all time, bested only by its sequel (Freespace 2).",
            "review_score": "1"
        },
        {
            "review_text": "Excellent old school space shooter. Was the first game i ever really played through as a kid and replaying through it was just as fun. About a 12 hour game on your first play through. Controls are pretty simple and work well. Can play with keyboard and mouse, keyboard and joystick or even a controller if you want to map out controls.   My hours played is bugged for this game, its more like 15 :)",
            "review_score": "1"
        },
        {
            "review_text": "I was a Wing Commander freak and this game is built on the same concept. Would of loved to play this game but for some reason it hates my laptop. I've a decent system that does play anything I throw at it but not this throwback of an old game. Unlike Wing Commander, the controls are simpler and simpler is better. But now the game doesn't run... wont run? How can I recommend a game on that note?",
            "review_score": "-1"
        },
        {
            "review_text": "Once again, cheap game from Steam crashes on startup.",
            "review_score": "-1"
        }
    ]
}