{
    "app_id": 273770,
    "name": "Game Tycoon 1.5",
    "release_date": "2014-02-11",
    "developer": [
        "Sunlight Games"
    ],
    "publisher": [
        "Sunlight Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Strategy",
        "Management"
    ],
    "achievements": 0,
    "positive_ratings": 89,
    "negative_ratings": 547,
    "price": 0.79,
    "description": "Welcome to the Game Industry!The year is 1982. Three young entrepreneurs discover the computer and potential to strike it rich in the Games Industry! Their love for computer games is a common bond that they all share but they are also in fierce competition with one another in a race to build a successful Games Development House…They...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/273770/header.jpg?t=1525867465",
    "minimum_requirements": "Минимальные: ОС: Windows XP, Vista, 7, 8 or 10 Процессор: Pentium 3 with 600 MHz (or better) Оперативная память: 128 MB ОЗУ Видеокарта: Graphiccard with a minimum of 256 MB Ram DirectX: Версии 9.0 Место на диске: 300 MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Game Tycoon is a very unique tycoon game to the point it could be considered a point and click adventure / tycoon game. Nothing is laid out with menus, its all places and locations. You have a university, office plaza, media plaza and your home (which seems pointless). In these locations they are like city streets, you need to scroll your mouse left and right and click on doors. One click will have your player character enter, two clicks will automatically enter. When inside a building, you see a room and need to find what you want to do. It makes the controls needlessly cumbersome. To see how many copies you have in stock, you need to go across town. To see your finances, you need to go back across town. It is crazy.  The game is very click base as if it could be a mobile game, you won't find hot keys or even menus. Right mouse clicking exits you out of an area. Stats and charts need to be found in rooms and areas. Even then, there's no depth. There is no way to see how well games are selling, you just need to hope they sell well that month at the price you've set. You can visit a university magazine stand to find out the most popular games and genres for $4 each time. You can visit a game store in the media plaza to see where your games rank. You can visit an advertising executive to publicize your games, your company and see how you stack compared to the two other companies you're competing against. You can even visit a banker, take out a loan, buy and sell stocks of your company and the other three. Those are nice features, but when you visit the banker and executive, you need to talk with them. Click something to say and listen for them to say it before you can continue. If you dare click on something else it could cause a glitch that will loop the speech if not crash a menu 10 seconds later. It is stunning.  When you play, there is no hand holding. I needed to figure out to visit my office, create a game engine (or license one), then click and drag the 'print out' into my inventory. Then go next door to the development office? Once there, I need to click and drag the 'print out' into the project list. After that, since I had no employees, I had to go to the university and figure out that I needed to click a bulletin board in order to find employees. The hiring system is nice, it shows you the quality in stars, and their tempo to complete the job. You hire programmers, artists and composers. Some you can hire and others that are independent. So they can get better jobs and come back to you when you need them most, but they don't get paid when they're not working. Then its back to the development studio with my employees. I need to click the project, then assign programmers to the engine and click start project.  After you wait a few in game days, weeks or months, its time to take that game engine project, click and drag it back into your inventory, then go next door to your office and make a new game after clicking and dragging the engine into the proper position. Creating a new game project is easy. You'll get to chose things like what languages and what platforms. By platforms I mean, PC, arcade and console. There are no specific consoles. Just those three. Then when that is all 'printed out,' its back over to next door to click and drag the 'print out' from my inventory into the project window. Once there, I need to click on the project, then sift through my employees to assign programmers, artists and composers. The more people I have working, the faster they'll get done. The higher quality they are, the better the game.  From there, you don't just release the game. Once you click and drag the finished project into your inventory of course. Its off to the manufacturing facility where you click on the design table to include everything that will come with your game. By design, I mean pack the box with stuff and raise the manufacturing cost. Shirts, buttons, stickers, black and white instruction manuals, color instructions, an insert. Its all up to you! With some click and dragging. With that done you'll visit the manufacturing machine that will churn out the copies of your game. The more copies, the cheaper they become to manufacture. Click and drag the finished product into the machine. Then start manufacturing! After a few game days, all of the copies will arrive.  Do they just sell themselves? Nope. Time to find a publisher! So you need to visit a publisher's office and select a publishing deal from books on the wall. They all have minimum quality ratings, so your 45% quality game can't be published with a 53% quality deal. There is a punishment for failing to release the game by the allowed time and for your trouble of making a game, you'll get 6% of the profits depending on the deal. Some deals are far better than others.  After that, its back to the factory that has your copies. You need to click on the pallet with the finished copies and click and drag your publishing deal from your inventory into the game's slot and flip the checkmark switch to officially release it! Wasn't that easy? No hand holding at all!  Of course 5 hours into the game, I finally discovered the tutorial was in the campaign, but wasn't marked as a 'tutorial.' I thought it was just another scenario in the campaign. The tutorial explains what to do, but it gets caught on itself and could explain things better, such as flipping through a gaming magazine had me clicking all over before I figured out to click a game title. The voice over will talk over other voice overs. Not just that, but if you go to a different location than you should be in, the tutorial narration will tell you what to do as if you're in the correct place, instead of saying no this is the office, go to the university.  As soon as you get the hang of the 1,000 step process, it becomes an insane juggle of going between locations since there is no menu. Waiting to pan the street to the right or left. Waiting for your character to walk to the building before you realize double clicking enters the door instantly. Even though there's a game speed, that doesn't speed up the character. It doesn't speed up every time I need to hear 'I would like a bank loan,' then hear the banker's rebuttal.  There are visual errors here like text not disappearing when the dialog boxes do. Text overlapping out of windows. Sometimes the ticker PDA doesn't show anything when it should have a message. The PDA (ticker) is nice, it pops up useless information like you need to pay $3,000 for golf clubs or you're having a bad hair day. Its all random things that might as well be Chance cards from Monopoly. The PDA pop up changes the game from fast to slow, which is good, but the problem is that a lot of what the PDA shows is useless moments to make you laugh. You didn't sleep well, because your bed broke. Stealing MP3s is bad. Visit the gametycoon website. Your employees will get sick and will be unable to work for 12 days.  The only way to get a game over is if you go into debt for more than 90 days. You can get loans and sell stock to stay a float, but even on normal, it seems difficult. Your games only make money at the start of every month. You have full control over the price of your games at the factory, but to put publicity into the games, you need to go to a different area down the street.  The game itself is difficult even on normal. Luckily there is an easy mode. To top everything off, it has crashed or permafroze a few times, so you'll need to keep saving frequently, since there is no auto save feature. With all of that being said, there are some interesting elements in the game, but the juggle and struggle of going location to location over and over again is unfun and begging people to not play it. If only there was a menu and no traveling. The time it takes to hear people talk is just too long with no way to skip it.",
            "review_score": "-1"
        },
        {
            "review_text": " Gameplay Premise",
            "review_score": "-1"
        },
        {
            "review_text": "Avoid this game. It's ironic really, playing a game about game development that is so poorly designed. This game was so bad, between the lack of handling for audio overlap, the vague tutorial directions, and the generally crappy UI that I can't believe it's actually on the market when something like Game Dev Tycoon already exists.",
            "review_score": "-1"
        },
        {
            "review_text": "It would be incredibly hard if not for an exploit where you can make almost any crap game, print a million copies of it (so they're less than a buck a copy) and 'sell off' the game, netting you a tidy profit (the game thinks that selling every copy for like 2 dollars is often a huge loss except you're moving such volume it breaks the game)  Glitchy, unintuitive and just obtuse at times, it's nearly unplayable in any enjoyable form.",
            "review_score": "-1"
        },
        {
            "review_text": "Deadly silence... hastily pushed on Steam and never ever support again.",
            "review_score": "-1"
        },
        {
            "review_text": "NOT A GAME DEV TYCOON SEQUEL!! ancient game. very bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Lots of bugs. Some of the text is untranslated and the rest is mistranslated. Not a single funny joke. Would not recommend 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Crappy game  ",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible in every way",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible game, anyone know how to get a refund?",
            "review_score": "-1"
        },
        {
            "review_text": "awfull and full of bugs DO NOT BUY ! Game is crashing like hell , tutorial is complete joke (i lost in a tutorial level ??? Dev's are you kidding me right ? ) . When you reach the time to read the magazines you simple can not , you can berely hear the sound of the tutorial guy , if you go to the menu you loose the progress. DO NOT BUY a big waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh dear god don't buy this game.  The game is buggy as all hell Terrible interface Terrible game play Terrible mechanics Terrible voice acting Just terrible!  I normally always say try it for yourself becasue some may like it, just this is the exception, Terrible! don't waste your money. If you like the idea of it Look at game dev tycoon, thats fun and is clean and finished, not a game that looks like its still in ALPHA, Run!!!",
            "review_score": "-1"
        },
        {
            "review_text": "  I got this game for free. I want my free back!",
            "review_score": "-1"
        },
        {
            "review_text": "Took about 3 minutes to find out this game was a complete waste of money. Horrible UI, bad voiceacting and generally just uninspiring.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't Buy This Game.   I am usually pretty generous in my vision of whether or not a game is 'good' but regardless of the perspective I try to view it from, it is.... garbage. It is buggy, it is not at all user friendly. I sat there clicking aimlessly while trying to understand what the heck the tutorial was talking about, and I have played I think every game development game out there.  I swear, this game, is not what you think it will be. It made me feel buyers remorse pretty quickly, and its a pretty cheap game.  ",
            "review_score": "-1"
        },
        {
            "review_text": "So can I get my money back? This is hardly a 'game'. I feel like I'm playing the demo of a game that just went into development.  The tutorial is awful and doesn't teach you a thing; is also awfully confusing to try to follow as it does a very poor job at explaining most things.  0/10- Didn't even get to learn how to play the game. Never buying any game by this developer ever again.",
            "review_score": "-1"
        },
        {
            "review_text": "the game makes me feel sick and kills me inside when playing it do not buy do not play stay far away from this",
            "review_score": "-1"
        },
        {
            "review_text": "More like Game Tycoon 0.5. Or less than that. Unintuitive interface and full of bugs. I can t believe someone would release and charge for this,",
            "review_score": "-1"
        },
        {
            "review_text": "Very buggy, non user friendly game. Do not waste your money on this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game hoping it would be a few moments of fun. Unfortunately, there are no moments of fun to be found.  First of all, the name is not a good representation of the game. The 'game design' parts are basically nonexistent and it's mostly about walking from one screen to the other, so the UI has nothing to do with tycoon-type games. Instead, you are putting engines and games you've forced students to produce into your inventory, so you can print them up and hope it works. The rating system is almost impossible to spot the first time around, and it has no depth what so ever once you do.  Also, there are no subtitles. Yes, you heard me; no subtitles. This may not sound too bad, but then again you haven't experienced what I have. I had to listen to one of the tutorial missions' same line 15 times (because, if you are not doing what you're told - like entering one of the many indistinguishable buildings - the tutorial voice will repeat the same command in 10 second intervals). Why? Well, the terribly EQ'd voice had already nagged me into going to a warehouse, where a printing machine is a part of the background sound template. It was impossible to hear anything the tutorial said - and, to top it off, this is the same source in the customizable mixer in the option menu.  Short story: this game is terrible across the board. The techincal aspects are horrible, the UI doesn't work, the graphics are below average... I could go on. Take it from someone who spent their money on this thing: don't make the same mistake.",
            "review_score": "-1"
        },
        {
            "review_text": "I usually try to get past the tutorial before I rage quit, but I literally couldn't. It doesn't state how to turn pages in a magazine, it doesn't tell you which buildings are which, you just have to go to each one and randomly click stuff, it doesn't tell you all that much of anything. But what was the most annoying was the guy kept repeating himself and sometimes his speach was either not understandable or you couldn't hear him for the background noise. He'd pop up everytime I was trying to read the stats of the contracts. And who the hell pays just to READ a magazine?! Why wouldn't you get to keep that magazine. I ended up spending about 20 bucks on one stupid magazine that I couldn't even turn the pages in! I am glad I bought this on sell, because it's not worth full price. I'm not the type to ask for 29 cents back, but still I wish they'd put these games as demos if they're going to suck.",
            "review_score": "-1"
        },
        {
            "review_text": "  I would have refunded this if I hadn't got it for free, because it freezes all the time and is a headache to play. It doesn't work well with Windows 10 or Windows 8.1. I did not try it on any other systems, but it's a very broken game on those very popular OSs.  The idea behind the game is a sound one. Tycoon games can be fun. Game Tycoon is actually designed at least on paper in an interesting way. Unfortunately, even though the game clearly has a lot of assets created for it (voice acting, 3D character models, etc.), it's not playable. Not only is it an extremely unstable game but the navigation design is weird and unexplained.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ game omfg all time crash",
            "review_score": "-1"
        },
        {
            "review_text": "The most confusing, god-awful, and yet again, confusing game in the world. It has no claer instructions, and is a rip-off of another game. Talk about a ♥♥♥♥ing waste of money. You are much better off getting Game Dev Tycoon. I couldn't even manufacture my damned games it was so buggy! I would try to click on one thing, and I would walk to my office, WHEN I'M NOWHERE NEAR MY ♥♥♥♥♥♥♥ OFFICE! 2/10, somebody fix the ♥♥♥♥ing germans already....",
            "review_score": "-1"
        },
        {
            "review_text": "Nicest graphics in its genre, but also the worst game in its genre. Very glitchy. Horrible tutorial.  Don't buy this crap.",
            "review_score": "-1"
        },
        {
            "review_text": "Meant to buy Game Developer Tycon... wish I had, waste of time and money",
            "review_score": "-1"
        },
        {
            "review_text": "Got this game on giveaway/promo - read FREE, still i think i paid too much. Lots of bugs,problems kills this game. better stay away.",
            "review_score": "-1"
        },
        {
            "review_text": "Didn't play too much because such a weird game. Also this isn't some continueation...just a really bad spinoff.  Pros: Creative UI and layout of all funtions You can make your own game engine an games Creative Hub world  Negatives: Graphics(Looks like something a PS1 could run) Confusing mechanics(Game making and stuff) Horrible repetitive music Horrible dialogue  Honestly thats all I got out of in under 5 minutes!  Although I did like the idea just not for me.  5/10",
            "review_score": "1"
        },
        {
            "review_text": "DON'T BUY THIS!  It's effectivly impossible to play, I only got as far as the tutorial before I just installed the thing!",
            "review_score": "-1"
        },
        {
            "review_text": "'Great' Game I Buy It!",
            "review_score": "-1"
        },
        {
            "review_text": "This is an interesting game from a certain point of view. I enjoyed playing it, does have a special graphic and great game mechanics, the overall sound is good. Keeps you entertained and satisfied.",
            "review_score": "1"
        },
        {
            "review_text": "Is Very Gud Game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is not as bad as people say, in my opinion. Sure, it's a tad old and the original release date should be mentioned in the store page, but the game itself is surprisingly fun. Let me elaborate:  It's not Game Dev Tycoon, which (to my knowledge) is the newest of game developer simulation games, and they aren't that similar either. Sure they share a theme, but the gameplay is different. In Game Tycoon, you can acquire licenses, you have to print the games yourself, choose what goodies to include in the packaging, advertise your games, see the reviews (they have pics too, though there should be more variables among them) and all that.  The graphics are cartoony and do their job, and there is voice acting (few lines here and there, nothing major). Music is a bit repetitive, but then again it's a simulation game aimed for niche market.  The only major problem I have is that it tends to crash on my system, and when it does it deletes my saves. I am not certain if this is a common problem, or just my machine.  I like this game and do not regret getting it.",
            "review_score": "1"
        },
        {
            "review_text": "This game doesn't feel as finished or nearly as well done as some of the similar games on Steam. Do yourself a favour and skip it.",
            "review_score": "-1"
        },
        {
            "review_text": "I really had high hopes. But from th start it wa horrible. Couldnt understand a word the tutorial man said, and he did not describe things well at all so it took me a while to figure it all out.",
            "review_score": "-1"
        },
        {
            "review_text": "It's really, really bad. I wouldn't mind the character spending a lot of time walking back and forth between buildings if there was actually something to design in each location. It really is just a drag and drop game.   The game is broken up into chapters with an objective style of play, rather than one long career mode. Essentially you start over each time. I could only get through the first two before I completely lost interest in the gameplay.  The gameplay is centered upon developing a game in a specific genre and hitting a specific percentage point to satisfy the publisher. No real way to improve quality if you don't hit the mark. Never take a publishing contract unless you are certain you'll exceed the expectations.   No subtitles! I usually play with the sound off. So there were many critical parts of the game where it was impossible to continue without audio instruction.  Do not buy this. Go buy 'Game Dev Tycoon' instead. This is an old game that is just being re-released to attempt to cash in on Game Dev Tycoon's success.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like this game, I really did. I enjoyed the first couple of minutes in the tutorial, but then it froze, and I couldn't get it to close. Finally I figured out I had to lock my computer, then hit the escape key to get my lock screen to show. I was then able to force the game to close. Tried again, hit Career, changed the character and the game froze again, and again, and again. This game is actually unplayable no matter how many times I reinstall it. If the developer would bother fixing this issue, then I would love to try it again. Got it for free through Indie Gala, and it wasn't worth the time it took to redeem it.",
            "review_score": "-1"
        },
        {
            "review_text": "Endless crash.",
            "review_score": "-1"
        }
    ]
}