{
    "app_id": 273740,
    "name": "Extreme Roads USA",
    "release_date": "2014-06-06",
    "developer": [
        "United Independent Entertainment GmbH"
    ],
    "publisher": [
        "United Independent Entertainment GmbH"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation"
    ],
    "achievements": 45,
    "positive_ratings": 7,
    "negative_ratings": 57,
    "price": 6.19,
    "description": "Off you go! Get ready for trucking challenges that will keep you on the edge of your seat as you hitch up and haul your way across the ‘extreme roads’ of this massive map and unforgiving terrain.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/273740/header.jpg?t=1447360129",
    "minimum_requirements": "OS: Windows Vista, 7 or 8 Processor: Intel Core2Duo / AMD X2 CPU, min. 2.4 GHZ Memory: 2 GB RAM Graphics: Nvidia Geforce GT 240 / AMD Radeon HD 3700, min. 256MB VRAM DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 7 or 8 Processor: Intel I5 / AMD Phenom II, min. 2.8 GHZ Memory: 4 GB RAM Graphics: Nvidia Geforce GTX 660 / AMD Radeon 7850, min. 1GB VRAM DirectX: Version 11 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "My friend reccomended me and bought me this game because I liked Euro Truck Sim 2.  He's dead to me now. :)",
            "review_score": "-1"
        },
        {
            "review_text": "This looks and plays like it was coded by a child, appalling handling, terrible scenery, total rubbish. Steam should remove this game as it is not fit for purpose. DON'T BUY IT",
            "review_score": "-1"
        },
        {
            "review_text": "this game is not only a supreme piece of garbage, but a greatly overpriced piece of garbage at that. not only are the graphics VERY dated, this arcade game (which they tout as a simulation, for some reason...) does not even have functioning mirrors for the inside view. the AI sucks. the graphics suck. the controls suck (i could not get rid of the dead zone for controllers, making driving a real pain in the butt). the music is alright, but on the sucks side of alright. how can i get my money back? this game looks best in the pictures above, once youve seen them all, youve seen the best the game has to offer and should really just move on to something else.",
            "review_score": "-1"
        },
        {
            "review_text": "The best way to describe this game is Big Rigs between the first two patches, because you have collision with AI and guard rails and /some/ of the buildings. You can easily drive through forests without the branches even trying to stop you, you can drive through solid buildings, you can drive through water... okay, hold on. Imagine thick woods, with squirrels playing, deer prancing, and a truck made out of tinfoil staring menacingly from the shadows. That's this game.  This game is worth it for a laugh and that's it; I spent $2 on a bundle with this game and it was KIND OF worth it.  Also the game uses up 2 cores and 3GB of RAM because it's a leaky mess, runs in debug mode for some reason, and on top of that, will begin to drop frames and stutter. Considering what others said, I had it run okay, considering it didn't crash.",
            "review_score": "-1"
        }
    ]
}