{
    "app_id": 273800,
    "name": "Forestry 2017 - The Simulation",
    "release_date": "2016-03-25",
    "developer": [
        "Joindots",
        "SilentFuture"
    ],
    "publisher": [
        "United Independent Entertainment GmbH"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Stats"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation"
    ],
    "achievements": 27,
    "positive_ratings": 39,
    "negative_ratings": 57,
    "price": 14.99,
    "description": "Forestry 2017 – This Simulation takes you to the forest! Take over the tasks of a professional woodcutter and enjoy working in the woods. Control huge machinery, fell the trees, arrange the timber and comb through your wood. Sell the wood, several products and earn money to expand your company.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/273800/header.jpg?t=1458921829",
    "minimum_requirements": "OS: Windows Vista, 7, 8, 10 Processor: Intel Core 2 Duo Dualcore, AMD X2 Dualcore with 3.0 GHz Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 280, AMD Radeon HD 4870 DirectX: Version 9.0c Storage: 3 GB available space Sound Card: DirectX Soundcard",
    "recommended_requirements": "OS: Windows 8, 10, 64-bit Processor: Intel i-series Quadcore, AMD FX-series Quadcore with 3.4 GH Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 760, AMD Radeon HD R9 270X DirectX: Version 11 Storage: 3 GB available space Sound Card: DirectX Soundcard",
    "reviews": [
        {
            "review_text": "Forestry 2017 - The Simulation is exactly what it says it is and what it is supossed to do. Just by watching the trailer you will get aclear understanding of what the game is about, but I can further explain that you will play with lots of tools associated with, of course, the theme: forestry simulation.   My experience with it was very pleasant, smooth gameplay together with fancy visuals and neat sounds. I particularly like to try mastering the machines as soon as possible because it will help a lot on winning more revenue from all actions. The main purpose will be to expand your company, and to do so you will need to sell a lot of woosd logs and other related products.  Forestry 17 is a great title, aware of any other forestry simulator out there. BUT!!!!! ---&gt; Needs Steam Trading Cards!!!",
            "review_score": "1"
        },
        {
            "review_text": "The open world is big,but needs more movement. I really love this game's feel and atmospehere. It makes me feel like I'm actually a lumberjack at times. The graphics are top notch and the mechanics are amazing. I would definitely recommend it to a friend!",
            "review_score": "1"
        },
        {
            "review_text": "If you like cutting trees, this gamer does exactly what it says. It's a little different to get into, but once you do, it's pretty fun. The only drawback I have is its repetition. Other than that it's totally worth buying, especially if you love simulation games.",
            "review_score": "1"
        },
        {
            "review_text": "Unfinished. Untested. Unplayable. Unhappy.",
            "review_score": "-1"
        }
    ]
}