{
    "app_id": 273850,
    "name": "Ski-World Simulator",
    "release_date": "2014-11-18",
    "developer": [
        "United Independent Entertainment GmbH"
    ],
    "publisher": [
        "United Independent Entertainment GmbH"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Cloud"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 9,
    "negative_ratings": 38,
    "price": 6.99,
    "description": "In Ski-World Simulator you are managing your own skiing area. Work with the snow cat and prepare the slopes to become a skier’s paradise! Make sure that your patrons have everything they want in order to earn money and increase the size of your skiing operation. The keys to ski-world success are in your hands!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/273850/header.jpg?t=1447360134",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: 2,4 GHz Pentium or 100% compatible CPU Memory: 2 GB RAM Graphics: Nvidia Geforce 6800GT, ATI Radeon HD 3650 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1 GB available space Additional Notes: MULTIPLAYER ONLY VIA LAN",
    "recommended_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: 3,0 GHz Pentium or 100% compatible CPU Memory: 4 GB RAM Graphics: Nvidia Geforce GTX 560, ATI Radeon HD 6970 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1 GB available space Additional Notes: MULTIPLAYER ONLY VIA LAN",
    "reviews": [
        {
            "review_text": "There has been very little time and resources spent developing this and it shows.  You are given a mountain village in a valley this is always the same scenario, there are no other landscapes to build on. The camera cannot be moved around freely, it is in a fixed spot, and no zoom. When building the infrastructure in your ski resort you chose from a list of particular attractions, which builds these things in designated spots; you have no choice where you locate, ski runs, restraunts, hotels ect. There is no budgeting to know if your making or losing money, and no way to tell your income/expenditure. Only the money you have to spend.  There so no gameplay value. For example, I simply built the first lift and ski run, carged the maximum price and people still came. I then proceded to click the 'next day' button continuously and made a fortune.  There is also a component of the game involving maintaining your resort, such as using oversnow vehicals to clear roads, groom runs ect. This is simply boring, and hard to control.  In conclusion this game if very poor, no effort has gone into making this game fun or playable. Do not waste you money on this like I have done!",
            "review_score": "-1"
        },
        {
            "review_text": "DONT LIKE IT",
            "review_score": "-1"
        }
    ]
}