{
    "app_id": 274170,
    "name": "Hotline Miami 2: Wrong Number",
    "release_date": "2015-03-10",
    "developer": [
        "Dennaton Games"
    ],
    "publisher": [
        "Devolver Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Workshop",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Great Soundtrack",
        "Gore",
        "Pixel Graphics"
    ],
    "achievements": 29,
    "positive_ratings": 21838,
    "negative_ratings": 1933,
    "price": 11.99,
    "description": "Hotline Miami 2: Wrong Number is the brutal conclusion to the Hotline Miami saga, set against a backdrop of escalating violence and retribution over spilled blood in the original game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/274170/header.jpg?t=1498680121",
    "minimum_requirements": "Минимальные: ОС: Microsoft® Windows® Vista / 7 / 8 Процессор: 2.4 GHz Intel Core 2 Duo or better Оперативная память: 1 GB ОЗУ Видеокарта: OpenGL 3.2 compatible GPU with at least 256MB of VRAM DirectX: Версии 9.0c Место на диске: 600 MB Дополнительно: PS4 or Xbox 360 Controller or Direct Input compatible controller",
    "recommended_requirements": "Рекомендованные: ОС: Microsoft® Windows® Vista / 7 / 8 Процессор: 2.8 GHz Intel Core 2 Duo or better Оперативная память: 2 GB ОЗУ Видеокарта: OpenGL 3.2 compatible GPU with at least 512MB of VRAM DirectX: Версии 9.0c Место на диске: 600 MB Дополнительно: PS4 or Xbox 360 Controller or Direct Input compatible controller",
    "reviews": [
        {
            "review_text": "Pros - grammy award level soundtrack - challenging difficulty, forces you to survey the levels carefully and plan every move. if you play this game like HM1 you are going to die a lot and get frustrated - new game plus - multiple interesting characters with varying abilities - vibrant 2d artstyle - the game doesnt overstay its welcome, no filler levels - controls great on kbm and xbox360 pad  Cons - enemies get stuck/glitch on doorways frequently - lacking variety in melee weapons compared to the first. the game is more open in terms of level design so guns play a larger part - cannot stealth execute or use bodies as human shields anymore - inconsistent enemy ai. sometimes they will not see you other times they can see you from halfway across the map with their backs turned",
            "review_score": "1"
        },
        {
            "review_text": "While it's fun as much as it's predecessor, the gameplay feels a bit different than the first one. If you've played the previous game and liked it then it's safe to say that this is pretty much what you've been waiting for.  Not to mention that the soundtrack is just beautiful!",
            "review_score": "1"
        },
        {
            "review_text": "Hotline Miami 2 is a difficult game to recommend, because it's only going to appeal to a certain group of people. Not to mention, the base game has changed a decent amount since its release in March 2015. As of now, I would recommend Hotline Miami 2 to fans of the first game and twin stick shooters, but the game itself is pretty hit-and-miss.  The story of Hotline Miami 2 is polarizing, to put it lightly. You'll probably have a different opinion on it than any of the critics or players you find after finishing the game. I've got mixed feelings on it. Its structure, where you play as characters before and after the events of the first game and an overall plot slowly forms, is really innovative and allows for some cool set pieces. However, due to the narrative being split between a dozen or so characters, there isn't much in the way of development or growth for anyone, so it's hard to feel connected to your character before he or she gets their brains blasted out.  The gameplay has improvements over the first game and questionable changes. Guns are now more viable and frequent, and every bullet will deal a one-hit kill to regular enemies instead of the RNG of the first game. There are more factions to fight and more weapons to choose from (though not everything from Hotline Miami 1 makes a return). Unfortunately, melee weapons got a severe nerf. For some reasons, melee swings are much slower, and most executions are drastically slower than in the first game. Expect to die frequently because you executed an enemy while another wandered into the room. You'll be desperately mashing the attack button and getting killed often, aside from a few fast executions for certain characters.  The soundtrack is fantastic. Regardless of how you feel about the game, you'll want to buy the soundtrack after you play through it. It's heavier and darker than the first game's, and has a more diverse selection of artists. Musicians like Perturbator and Jasper Byrne return, and newcomers like Carpenter Brut and Benny Smiles bring their own unique styles to the game.  If there's one standout reason I would recommend the game, it would be the level editor. Though it may not be perfect or even complete, the level editor allows the user to right some of the wrongs from the story's level design and create their own single levels and campaigns. With Steam Workshop and sprite modding support, one can feasibly make the Hotline Miami 3 of their own desires. Or, if you don't take it too seriously, you can create comedic levels with rapid-fire dialogue and intentionally-crappy designs.  The degree to which I would recommend this game depends on how much you liked the original. If you thought it was alright, I would skip Hotline Miami 2. If you liked it and wanted more, I would recommend buying this on sale and skipping over to the level editor once the story mode becomes unbearable. If you honestly, truly loved the first game and analyzed every detail of it, I would suggest buying it at full price and plowing through the complete story. At the very least, the final level's spectacular presentation and attention to detail make up for the lackluster fifth and sixth acts of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Glass and offscreen enemies: The game.",
            "review_score": "1"
        },
        {
            "review_text": "Alright, let's start this game and beat some thugs! *dies* Whoops, I should look out for that guy! Ok, let's do this again. *dies* Okay...guy with a gun on the right, look out for him... *dies again* Alright, I need to act quicker this time. *dies again and again and again* Alright, I have this plan. I am gonna get in, take out the guy on the right with the bat, then scoot to the left to avoid the shotgun blast, then I will move to the next room and knock down the door next to the guy who's smoking, and take his weapon, bait the shotgunner, slice his throat open, and finish off the guy I knocked down. Let's do this! *dies again* AUGHHHHHHHHHHHHHHHHHHH!!! *you charge in the level, with no plan or strategy, and miraculously... 'LEVEL CLEARED, GET TO THE CAR'  Hotline Miami 2 in a nutshell.",
            "review_score": "1"
        },
        {
            "review_text": "Hotline Miami 2: Wrong Number, seems like the perfect way a sequel should be executed. In theory. The game features significantly MORE of everything, there's larger maps, a considerably longer campaign, more playable characters, more missions, overall going with the assumption that Bigger=Better. This is generally true, as it is not a sequels job to evolve gameplay in significant ways, thats the job of new IP's. What a sequel is generally supposed to do, is take an already stellar concept, and add on to it, refine it, fine tune every small detail until it reaches the potential it always had. Wrong number does this in many ways, and for the most part does it beautifully. However, as I was about 2 hours in to wrong number, I noticed something that greatly concerned me. I had stopped playing it. The original Hotline is in my opinion perfect. Every single aspect of the game was executed flawlessly, the tone, the atmosphere, the soundtrack, the vague and ambiguous story, the incredible adrenaline rush as you murdered dozens of faceless mobsters for the thousandth time that level, and how you snap back into reality when the music stops, and you realize the horrific atrocities you've just committed. And then you do it again. Anyway, there was not a single time for my entire first playthrough of the original Hotline Miami where I stopped playing. Even though the game was, when you think about it, very repetitive, I was never bored. It concerned me when the sequel didn't have the same effect. Granted, it's considerably longer, but I don't think that's the only reason. I decided to delve deeper and try to find out what exactly went wrong in Hotline Miami 2. Let's start with the pros.  The story in Wrong Number was absolutely fantastic. It opted to drop the Vagueness of it's predecessor, to great effect. Wrong Number tackles significantly bigger topics then HL before it, and ends up succeeding with flying colors. For the first few scenes, I was somewhat concerned that the story would be more convoluted than Season 6 of Lost, but as it progressed, I understood the tale the writers had in mind, and really enjoyed it. You play as a multitude of 'Protagonists' this time around, all of which have unique personalities and motives for their actions. There's a film star, a Corrupt Cop (Clear inspiration from Showtime's 'Dexter') An actual serial killer, A soldier in Vietnam, a drug Kingpin, a Failed writer, a group of Vigilantes hoping to recreate Jackets rampages throughout the first game, and numerous others. Each story was well written, intricate, and differed greatly from the others. Without venturing into spoiler territory, You're in for a treat. Another positive note, is that the fast, fluid, adrenaline fueled gameplay returns in full force. There aren't any significant chances to the formula, besides a few new enemy types, however I'm pleased that they kept the flawless gameplay virtually untouched. Obviously the soundtrack is phenomenal. Like, its freaking awesome. The game is also SIGNIFICANTLY more difficult than the original, including an unlockable hard mode, for those who require practice in punching computer screens. The difficulty change is both a blessing and a curse, which I'll get to in a minute. Now for the negatives.  Wrong number is a hard game. If you haven't played the original, PLAY IT FIRST OR ELSE YOURE BONED. I was still able to eventually beat it, but some of the levels I was forced to exploit AI problems to win. However, Wrong Number, unlike it's predecessor, often feels unfair. Anytime I died in HL1, it was due to my own poor timing or slow trigger finger. with enough patience and skill, you could tackle any situation the game threw at you, everytime. Less so with it's sequel. As I mentioned earlier, the levels are much larger. And considerably denser. And whoever designed these apartments, clubs, and military bases has a very strange obsession with windows. THEY. ARE. EVERYWHERE. I can not even count the number of times I cleared a massive area, which often took minutes (Which because of the multitude of restarts, minutes+Wrong Number=Hours) and as I rounded the corner, some unbelievable accurate enemy spotted me from across the dimension, shot at me with pinpoint accuracy FROM OFFSCREEN, and I was forced to play this one FREAKING area again for the billionth time! THIS GAME MIGHT BREAK YOU! So yeah, unfair difficulty. Next point. Something I always loved about the original Hotline, was the freedom given to you at each level. There was a massive selection of masks, each giving significant buffs to Jacket, which helped you find a playstyle that worked for you. There were also a multitude of paths that can be taken through the level, based of your both your play style and preference. This is reduced heavily in the sequel, and I think I found out why. Its essentially because in HL1, gameplay drives story. You do whatever you want in a level, and the game doesn't care. It gives you a number of options, you pick one, and you go on a majestically brutal murderous rampage. you're given a blank canvas to draw a picture of some drug lord choking on his own large intestine. However in HL2, story drives gameplay. You play almost every level exactly as the developer intended, with only a few levels straying from the beaten path, and even then only slightly. Because there are specific characters for specific levels, you dont get to choose a mask at the beginning of each level. The only times you get to choose a mask (I believe) Are for the fans/kingpin, where you get either a BARREL ROLL, killing blows (But unarmed), dual characters armed with a chainsaw and an interchangable firearm (this one was pretty amazing) or dualweilding machine guns. And then theres the one snake guy who either get's a nailgun, killing throws, or I think (I dont remeber this one) like some martial arts thing. Even though the mask system is present, its also considerably more limited, and often times restrictive. Why can't tony carry weapons? Why cant the bear drop his weapons at will, or at least reload when he wants to? These questionable game design choices are pointless and frusturating, and very dissapointing. In addition, the different ways each character plays, and the lack of choice makes for a more linear and, in my opinion, watered down experience.  I've said a lot in this review, but I haven't answered the one, simple question. Do I recommend this game? Absolutely. I said many negative things about this game, and I stand by those. However, the game is still a Hotline Miami game. The gameplay mechanics are amazing, the story is fantastic, the music is incredible, the atmosphere is spot on, it is an amazing game! However, is it as good as Hotline Miami 1? Not remotely. But how could it be? Hotline Miami was perfect, and truly did not need a sequel. But, if there has to be a sequel to it, it really couldn't be better than this. If you don't have the original, get that now. If you hate the original, there is no chance that this game will win you over. If you loved the original? You have to get this game. It's more of the same. The same is fantastic. Hotline Miami 2 is disappointing. It's a sequel to one of the greatest games ever made, it's bound to be. But am I glad I played it? Without a doubt in my twisted little mind.",
            "review_score": "1"
        },
        {
            "review_text": "One step forward, two steps back. The title for the game should be “Hotline Miami 2: Lure”, because for 80% of the game that’s what the game forces you to do, lure enemies towards a door or around a corner by playing peek-a-boo and then shoot or melee attack them until they are all dead, repeat ad infinitum.  This is what happens when you build the level design around the story and not the gameplay, I can’t believe the developers didn’t playtest this before it was released and see the problems. The main issue is that they made the levels and hallways so huge and long that you can’t see to the end of the area, so you have no idea where anyone is, and will inevitably be killed by a bullet coming from a guy off screen. The game forces you to lure and blind fire at unseen enemies. Nearly every level in the game is like this! In the first game you could see where everyone was and could choose and adjust your playstyle accordingly.  They also seem to have limited the number of masks you can wear and are again forced to complete levels a certain way based on the character you happen to be playing as at that moment. The story has a shifting narrative structure which is told out of sequence, so one level you will play as a reporter who can’t kill anyone, and are forced to melee enemies. Another level might have you play as two characters at the same time, who wield a chainsaw and dual pistols (for some characters, once they run out of ammo you’re boned, you can’t pick up enemy weapons!, and are forced to melee attack).  Were all of these changes to the game design worth it for the sake of the story? In a word……NO, I admit as a film it would be interesting to watch, but with the top down pixel art graphics, following 10 different characters and stories makes it confusing and hard to follow and remember who is who, and the fact it keeps going backwards and forward in time makes it even more needlessly confusing.  They did add a few new enemy types, there’s one type who ducks when you shoot and you are forced to use a melee weapon to take him out. Another type charges at you, and can only be killed by chucking a weapon at his face and then performing a finishing move on him while he’s on the ground stunned. To be honest I found those new enemy types annoying and took away some of the enjoyment from my run and gun playstyle.  The one thing they got right was the music, which is at least as good as the first game if not better, so you have some decent tunes to listen to, while you lure all the enemies to your position.  Overall a disappointing effort, I would still recommend it to fans of the first Hotline Miami. There are very few games that play like and do what Hotline Miami does, so I give it a low pass for that mainly. There are fun moments but if you haven’t played either game yet then get the first one.",
            "review_score": "1"
        },
        {
            "review_text": "Peh. So they turned a brilliant psycho rampage game into an annoying cover shooter.  The level designs feature too many windows and firearms, enemies constantly fire from outside your view and with the bigger maps restarting becomes more like a chore. All of this means you have to advance slowly and carefully, abusing the view distances and such. Gone are the days of improvised driller-killer rushes. There's less choice in picking masks before levels so don't expect as much freedom in your playstyle and weapon picks. On top of this, there are more enemies which are immune to certain weapons and they interrupt your flow as you have to backtrack to find the correct weapons to kill them. It's not a freeform killer puzzle anymore.  Even though the soundtrack is good, the gameplay just isn't fun enough. Just grab some Perturbator and Carpenter Brut albums and go replay the first one with those instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Edit 2: Started Hard Mode, because I figured I can't give something a negative review if I don't try out all aspects of the game. Hard Mode is literally artificial difficulty: levels are reversed, higher number of Thugs (enemies that need to be shot), you can't lock on to enemies, and guns lose ammunition as you drop them (basically a huge nerf to Jake, who was actually decently fun to play). Different-ish story, though, so I'll be looking to see how that plays out. Seems more interesting than Normal mode's story. I do NOT recommend the design decisions that Dennaton took for Hard Mode.  Edit: So, just finished the game (only required 5.5 hours, so read into that what you will). I won't spoil anything, but holy hell, what a disappointment. I haven't seen an ending this shoddily constructed since 'No Country for Old Men.' Dennaton should be ashamed. Game feels rushed, unfinished, and as though little serious thought were put into it. The rest of my review holds. Favorite Chapter: 22; Least Favorite Chapter: 11 (  with all the Soldier Chapters close nearby  )  I'm writing this review as a die-hard Hotline Miami fan, holding several very high scores (i.e., rank &lt; 3000) on several of the levels in Hotline Miami 1; I've played that game to death, and even got good at speedrunning it.   Quite simply, I don't like Hotline Miami 2, but perhaps you will; my bias comes from having loved the gameplay of HM1 so much. Hotline Miami 2 attempts to fix things in the original game that were already perfect; an all-too-common no-no in game design. Hotline Miami 2 isn't a bad game, exactly, and many people will probably have fun with it; it is, however, a very poor sequel to the beloved original title.   Now, for the actual review...   The good",
            "review_score": "-1"
        },
        {
            "review_text": "PRESS 'R' TO RESTART PRESS 'R' TO RESTART PRESS 'R' TO RESTART PRESS 'R' TO RESTART PRESS 'R' TO RESTART PRESS 'R' TO RESTART PRESS 'R' TO RESTART",
            "review_score": "1"
        },
        {
            "review_text": "Hard mode.  Dead Ahead  4 hours to finish this level  10/10 Best Game Ever",
            "review_score": "1"
        },
        {
            "review_text": "The storytelling in this game is fun, I especially liked the way the mechanics change when you're playing the nonmurderous writer guy. The masks are much improved, rather than giving little stat boosts they significantly alter the playstyle; the coolest one being the mask that makes you into two people.  However... they made guns useful for more than throwing at people in the worst way possible. All the maps are vast and spacious, to the extent that you typically can't see the other end of a hallway if you try to look. This means that you need guns to clear out areas blindly, and means that fighting people who have guns when you have a melee weapon now primarily consists of baiting them and waiting for them to chase you rather than the first game's well-timed bloodthirsty charges.  I don't hate this game, but unlike the first one I don't feel eager to go back and try for better scores on the levels.",
            "review_score": "-1"
        },
        {
            "review_text": "Overall, it pales in comparison to the first game.   Hotline Miami  mostly took place in tight corridors and was focused on melee combat, there were firearms but they were more limited and the placement of enemies with guns was far more deliberate so that it added challenge without being faux difficult.    Hotline Miami 2: Wrong Number  however has a lot of large open levels with the majority of the enemies having guns, so a lot of the time I ended up being shot from off screen. This meant a lot of the time I was playing far more cautiously because I couldn't run through the levels quickly like the first game and trying new strategies for getting big combos. Because of the randomness of the gun enemies I kind of just went from room to room hoping the enemies would be in the right position so I wouldn't get shot, so overall it was less fun than the first game where you could get very precise. It was very annoying being shot through a window because an enemy had moved there when you fired a gun and in the last death he wasn't there. The first game was challenging but it was also fairer, because it felt like when I died it was my own mistake in mistiming, whereas in the second game I often died because I got shot by an enemy off screen had shot me, often through a window and I had no way of knowing they were there. The large level design doesn't help that I get shot from off screen and enemies can you see. Its just really cheap compared to the first.  The storyline also felt was misguided in that it overexplains things that happen in the first game and was too easy to follow. I liked how the first game was simple in the plot and the second game adds a lot of characters and lore that I felt didn't really work with the first game. The ending was cool though.  However the music and aesthetic are just as good and you can still have some fun with it at times. Its not a bad game, its just overshadowed by the first in a lot of ways. If would only recommend it to fans of the first game who want more levels, for anybody else I would say just play the first one.",
            "review_score": "-1"
        }
    ]
}