{
    "app_id": 274250,
    "name": "OlliOlli",
    "release_date": "2014-07-22",
    "developer": [
        "Roll7",
        "General Arcade"
    ],
    "publisher": [
        "Devolver Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Sports"
    ],
    "tags": [
        "Skateboarding",
        "Indie",
        "Sports"
    ],
    "achievements": 12,
    "positive_ratings": 596,
    "negative_ratings": 156,
    "price": 9.99,
    "description": "OlliOlli mixes addictive one-life gameplay with over 120 tricks and grinds across 50 deviously crafted levels, 250 Challenges, Spots Mode and Daily Grind.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/274250/header.jpg?t=1498680287",
    "minimum_requirements": "OS: Windows XP or later Processor: Dual Core 2.0 Ghz Memory: 2 GB RAM Graphics: NVIDIA GeForce 9400m or equal AMD Video Card / Intel HD3000 Storage: 300 MB available space Additional Notes: Microsoft Xbox 360 or Sony PS3 DualShock strongly recommended.",
    "recommended_requirements": "OS: Windows 7 Processor: Dual Core 2.2 Ghz Memory: 2 GB RAM Graphics: NVIDIA GT 650M or equal AMD video card / Intel HD4000 Storage: 300 MB available space Additional Notes: Microsoft Xbox 360 or Sony PS3 DualShock strongly recommended.",
    "reviews": [
        {
            "review_text": "Let's go in steps here. First of all,  you  probably  need a controller to enjoy this game , even the game tells you that when you're opening it without your controller plugged in. I haven't tried playing with my keyboard, but with the controller you use your analog stick to do tricks, so it involves a lot of spinning it around in multiple ways and pressing buttons along to do all the complex stunts you need without really having to think too much about it. Simple to learn, challenging (in a fun way!) to master, as it offers a fulfilling variety of stunts of different levels that you can perform.    Is this another one of those endless running / distance games?",
            "review_score": "1"
        },
        {
            "review_text": "Borrows a bit from THPS and a bit from SKATE, but still is able to form a unique skateboarding gameplay experience. Timing-based scoring system (Perfect! Sick! Sloppy! Sketchy!) makes for a solid 'perfectionist' type of challenge, yet one not exactly punishing at early levels. Animations are pretty choppy and the character art (while often charming, such as the bails) is unrefined and downright ugly at times. Kickflips and heelflips for example, are visually indistinguishable, and for a 2D game, good sprite work and animation seems like a pretty important thing. Doesn't really have that skateboarding 'feel,' but a solid game nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "Fun for a few hours.",
            "review_score": "1"
        },
        {
            "review_text": "Incompatible with Steam Overlay, causes blackscreen when enabled",
            "review_score": "1"
        },
        {
            "review_text": "OlliOlli perfectly coalesces modern game production sensibilities into a relentlessly polished experience, creating a sure-to-be-classic skateboarding game. The soundtrack alternates between energetic and groovy, setting the tone for 'this run will be the one' moments. Controls are effortless, tight, and really evoke the physical motions of each trick. Unfortunately, on some levels not all the surfaces are seamlessly bounded which can cause some frustration when tricks fail to land that are otherwise timed perfectly.  Career mode's challenges will gradually teach the high-scoring techniques necessary to succeed in the game's harder modes, offering challenges that both the casual and the hardcore gamer can enjoy. Still, it is the hardcore arcade enthusiasts that will really reap all the rewards OlliOlli has to offer as they vie for top position on the high score list while mastering the nuanced trick controls.",
            "review_score": "1"
        },
        {
            "review_text": "Combo button mashy board grinding fun. My biggest issue is the addition of male voiced sound effects because it means I can't pretend the skater's a girl. As far as issues go, though, that's not too bad and I can just turn down the sound effects and up the music. The music's great, by the way. The exact kind of chill skateboard game music you would expect.",
            "review_score": "1"
        },
        {
            "review_text": "I'm enjoying this a lot. There was a lot of Tony Hawk Pro Skater muscle memory to unlearn though. You basically do everything with the left analog stick and use the A button on the xbox controller to push/land.  I did have some trouble landing perfect grinds. I'm not sure if it's possible to land a grind too late, that might be the cause of it. EDIT: I was using a wireless controller which was the cause for that.  I can pull off perfect grinds pretty consistently now. The weird thing is that you can get perfect grinds by grinding at the last possible moment but that doesn't seem to be the case for landing on the ground, I have to press a bit earlier for that.",
            "review_score": "1"
        },
        {
            "review_text": "Draws on the nostalgia of the old school Tony Hawk games, focusing on the 1 million+ point combos and flawless trickery. Brilliantly addictive gameplay, and a cracking soundtrack to go alongside it. Keyboard play was quite awkward, controller recommended.",
            "review_score": "1"
        },
        {
            "review_text": "A fun romp to be sure.",
            "review_score": "1"
        },
        {
            "review_text": "fun, addictive, especially if you like skateboarding",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Too much water - IGN",
            "review_score": "1"
        },
        {
            "review_text": "Just started playing this game, and I can already tell I am going to be spending a lot of time on it.",
            "review_score": "1"
        },
        {
            "review_text": "Tons of fun. Perfectionists, competetors, and platforming fanatics alike will all appreciate this game. Comparable to a sidescrolling SSX, there's a level of improvement and friendly rivalry here that breeds real enjoyment from such a simple game. It does what it sets out to do and it does it well.",
            "review_score": "1"
        },
        {
            "review_text": "A fun, crappy, skater game.  Not worth $10, but if you can get it for $2 or less grab it.  No cards, horrible graphics, no steam cards (yet) but still one of those fun ways to spend an hour or so.  PS I can't get the screen capture to work, but that's minimal.",
            "review_score": "1"
        },
        {
            "review_text": "A really addictive and fun 2D platformer/skater.",
            "review_score": "1"
        },
        {
            "review_text": "Fun platforming game with cool music.  It may look like a 2D THPS, but OlliOlli is really a platformer at heart. Sure you do tricks and beat challenges, but the feel of the game is WAY more like Super Meat Boy or an endless runner.  If you like platformers and enjoyed trying to get endless combos in THPS, give OlliOlli a try.",
            "review_score": "1"
        },
        {
            "review_text": "Like Hotline Miami but 110% more radical",
            "review_score": "1"
        },
        {
            "review_text": "A really fun game to pass the time",
            "review_score": "1"
        },
        {
            "review_text": "Plattformer Game of the Year 2014.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just as challenging as trying to pull off the Super McVarial 900. Simple concept, very fun gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awsome! If you like challenging 2d 'Runners' then this game is perfect for you! Itz very addicting whn you have a controler wich i dont. . . hehehe :3",
            "review_score": "1"
        },
        {
            "review_text": "This game is super easy to get into but very, very difficult to master. You will push beyond extent that your reflexes will allow to beat this game and get every star for each level.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, challenging enough to keep you enganged. Music is pretty good too!",
            "review_score": "1"
        },
        {
            "review_text": "Almost a 2D successor to the Tony Hawk games. (The first three, the BEST three crapped on by the 'Tony Hawk HD' crap. That's not a remaster, that's an insult. Grab the originals.)  Tricky to learn, but not punishingly hard. Give and take is balanced. But it IS challenging, so if you are a controller breaker, this isn't for you unless you own a box of them!",
            "review_score": "1"
        },
        {
            "review_text": "this game is so gnarly man you can pull of some rad tricks i shred so good",
            "review_score": "1"
        },
        {
            "review_text": "It's like Tony Hawk Proskater had a baby with Guitar Hero and it was raised on Sega Genesis.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun... But super ♥♥♥♥ing hard at some points...",
            "review_score": "1"
        },
        {
            "review_text": "This game's pretty fun, you can just fly through it and that's probably the best way for your first playthrough, because doing each stage's challenges will get you pretty tired of that stage as you reset over and over. The music is nice to listen to and the worlds are varied enough to keep you from getting bored, although the backgrounds are kind of busy for some worlds and you can easily lose where rails and the ground is when you're not super focused on what's happening.   Needing quicker reaction time than I can pull off consistently makes finishing all stage challenges a little tough, but not undoable. Fun game overall though if you like stages that have you chaining one combo through the entire stage or near all of it (these are the best and make you feel cool when you're just playing a videogame).",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds of the good old days with THPS. Altough it is ♥♥♥♥ing hard the music is superb and it's got some good gameplay vibes too it. I really can't wait to get better at this. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is alot of fun but it has a few flaws. The game is almost unplayable with keyboard/mouse and it gets fairly stale after awhile. But it has it's moments and is alot of fun. This is worth buying in a sale but not at full price.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Side scrolling arcade style skate action! OlliOlli is vaguely reminiscent of 720, the 1986 arcade game, albeit with some more modern twists. The game gives you infinite tries to get to the end of the track, but, beware, if you crash you'll have to start over. The challenges are challenging, though with extreme variations. Sometimes the game feels like your friend and other times it slaps you in the face and saunters off.",
            "review_score": "1"
        },
        {
            "review_text": "Fun lil skate board game!!! If you like the Tony Hawk's American wasteland you'll love this platformer!",
            "review_score": "1"
        },
        {
            "review_text": "Fun lil skate board game!!! If you like the Tony Hawk's American wasteland you'll love this platformer!",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice game, i'd say it's a lot harder to pull off combos than Tony Hawk Pro Skater. Maybe that's just me. A nice piece to scratch that itch for rad tricks",
            "review_score": "1"
        },
        {
            "review_text": "Great game! using a keyboard isn't the easiest, but with a controller the game is amazing! Almost finished all levels and very challenging on 'basic'",
            "review_score": "1"
        },
        {
            "review_text": "Basically Tony Hawk + Super Meat Boy. Difficult, lots of fun, and the soundtrack is very well-selected (as officially required for skateboard games). Looking forward to the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. It's like the 'Trials' of 16-bit skateboarding. Love it.",
            "review_score": "1"
        },
        {
            "review_text": "Once you get use to the controls the game is fun. I still do not have the controls down all the way yet but i'm at the point where the game is a hell of a lot more fun then it was trying to start. One negative thing i have to say about the game is i think the pirce point is a bit to high, if it were selling for aroun 5-6 bucks then i would say this game is worth every penny. There are not a whole lot of skateboarding games out there on PC so if you are a fan of skateboarding and need to get your fix i would have no problem reccommending this game to you. Just don't think your getting some huge open world game with stat upgrades and a store to purchase more equipment and clothes at. It would have been awesome if the devs added all that stuff then i would say the current price is a steal. But when it comes down to it this is a fun little game and depending on how badly you want to play you could pick it up right away or if you can manage to hold off wait till it goes on sale.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing Awful. the games hard, don't have a problem with that. I do however have a problem with the lag that makes this game unplayable. I have heard that the lag is not an issue on consoles but that doesn't help those of us that payed for this steaming pile of ♥♥♥♥ for pc. did noone play test this?",
            "review_score": "1"
        },
        {
            "review_text": "If you love old 80's arcade you will love this game. Aesthetic and gameplay recalls that era you can get fun since the start or put a lot of time in order to master it.  Gamepad is mandatory.  Have fun skating over a communist militar base or grinding Godzilla!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 - Gameplay - Sound (Soundtrack) - Rolling down the steps until you have no bone left in your Body - Button Mashing - Daily Challenges - Difficulty   Definetly something for people who liked the Tony Hawk games. Feels like home for my hands on the Gamepad doing the Trick combos all over again. Let see how many hours i will sink in the Game. :P",
            "review_score": "1"
        },
        {
            "review_text": "OlliOlli reminds me why I spent hours and hours on the early THPS games.",
            "review_score": "1"
        },
        {
            "review_text": "i like this game enough to write a review of it   which i dont do a lot  and heres my review  its a good game buy it  it's got the music. it's got the graphics. it's got the graphics. it's got the music it's got all the components of a great game",
            "review_score": "1"
        },
        {
            "review_text": "Wasn't sure how I felt about this game at first, but it's been a blast. I play it on my PC, 3DS, and WiiU. Its got a ton of replayability and the challenge depth of it is awesome. If you like hard, fun, short games that challenge your refleces then get this.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun if you like try-fail-repeat kind of games.  You skate only from left to right, and the levels are pretty short, but if you fall, you have to start over. There are 5 themes with 10 levels each. You unlock the next Amateur level just by reaching the end, and the Pro levels by doing all the goals (get a certain score or grind a certain ledge). If you have played the Tony Hawk series, the controls feel unintuitive at first. Unlike THPS, you don't have separate buttons for jumping, tricks and grinding, and you have to press down every time you land, or you'll fall.  The game is playable with a keyboard, but it's much better with a controller.",
            "review_score": "1"
        },
        {
            "review_text": "The keyboard controls for this game are not good. Don't buy this game unless you plan on using a controller. The controls via keyboard are unresponsive.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a glorified flash game. There is no customization for either the player or the skateboard, can't do more than flips and grinds, it's hard to distinguish between obstacles and background items, moves (especially grinding) tend to not register correctly and it uses an unoptimized engine that makes the game run badly and crash often.  The overall design makes it obvious how it started as a simple mobile game, so one can only hope the sequel changes that.",
            "review_score": "-1"
        },
        {
            "review_text": "OlliOlli is just too frustrating. Being a big fan of 'simple-to-play-difficult-to-master' types of games, OlliOlli looked to be right up my alley. After trying many many times to control the character with keyboard or gamepad, I just couldn't get the hang of it. There are two things holding me back: 1) Viewing or anticipating what's coming next, 2) Timing.  Yes this is a timing game but if I can't see what's coming next I cannot anticipate when to jump. The game forces you to memorize and replay, rather than stick to reflexes and hand/eye control. I wish the camera was zoomed out 10-20%. Also the controls are pretty brutal when it comes to succesfully landing a grind, rotation, or landing. I wish it was just a tad more forgiving as crash landing a 10 trick run is mostly due to missing it by a nanosecond. For some this is just right, for me it's too harsh.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a game about keyboard spamming to do tricks to get points. Nothing fun about it for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Regrettable purchase.  No Ollie button - first of all. None. Zero.   Controller reponse is garbage. Tricktionary is unclear.  The good thing is that it is cheap enough to forget.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad. Crashes all the time. Glitchy.",
            "review_score": "-1"
        },
        {
            "review_text": "Awful game, don't waste your time. Just play any Tony Hawk game instead.",
            "review_score": "-1"
        },
        {
            "review_text": "NEVER for 12.99$. Lets get that straight first. The game is fun, in a phone-game kind of way - but a *good* phone game. This idea has a lot of potential for expansion and overall more depth. I have been playing for about 2 hours now, and will certainly play more with a controller.   Pros: 1. Addicting twich-style 2D Tony Hawkish gameplay 2. Fast restarting, and it is overall fairly easy (no rage quitting for me so far)  Cons: 1. It is sometimes hard to tell what is the background and what is interactable - this really matters since you will lose unfairly due to these issues 2. No customization for the skater or skateboards 3. Grinds and jump styles are SUPER SIMPLE - we need way more room for improvisation ala Tony Hawk 4. Graphics are meh. Might be cool to see a 2.5D version of this  Get it in a bundle for near free - and you will have a fun afternoon.",
            "review_score": "-1"
        },
        {
            "review_text": "They advertise xbox360 controller support however what they don't realize is in game, you need to be able to select your controller if you're on a mac. It's a bit useless playing with a keyboard and I'll be waiting on them until you can flip input devices within the game.",
            "review_score": "-1"
        },
        {
            "review_text": "'Buy This game!', they said... 'It's a good game', they said... Actually, no. And it's not because of the difficulty (it's no big deal), it's the controls. They don't react quickly enought. And bugs. Many bugs. When you are 2 pixels inside the ground and you kill yourself the instant you want to jump. This game is just bad, bored-made and unpleasant.",
            "review_score": "-1"
        },
        {
            "review_text": "I am pretty ticked I can't get this game to play correctly. For whatever reason, I can only see half of the screen when I load up the game. I can't figure it out. I've even tried re-downloading the game. Am I missing something or is this game not compatible with my laptop?",
            "review_score": "-1"
        },
        {
            "review_text": "This is a game for all us that cannot skate. But it is probably a game meant for phone/tablet. If you enjoy pressing buttons in rythems and repeatedly I would recommend a game like Guitar Hero instead of OlliOlli.",
            "review_score": "-1"
        },
        {
            "review_text": "i am still having problems where the game starts but sends me to a black page",
            "review_score": "-1"
        },
        {
            "review_text": "Wish I could play it.",
            "review_score": "-1"
        },
        {
            "review_text": "These are the most unintuative controls I have ever encounterd in a game. I supose if I had never played Tony Hawk game it would have made an easier transition, maybe.. I played for about a half hour and I wanted to kill something. I supose this is a game the rewards skilled players. I just don't have the patience for that.",
            "review_score": "-1"
        }
    ]
}