{
    "app_id": 274350,
    "name": "Dropsy",
    "release_date": "2015-09-10",
    "developer": [
        "Tendershoot",
        "A Jolly Corpse"
    ],
    "publisher": [
        "Devolver Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Indie"
    ],
    "achievements": 30,
    "positive_ratings": 1158,
    "negative_ratings": 80,
    "price": 6.99,
    "description": "Dropsy is a non-traditional take on the classic point and click adventure formula starring the game’s perpetually carefree namesake clown as he explores a richly detailed world full of colorful characters and sinister secrets, doling out hugs along the way.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/274350/header.jpg?t=1449202090",
    "minimum_requirements": "OS: Windows 7 or later Memory: 1 GB RAM Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "When I first heard about Dropsy, I was kind of put off. I mean, look at him. He's kind of creepy looking - especially if you don't have a fondness for clowns.  But after talking with the developer and reading up on Dropsy's creation... I fell in love. I played the side game that put out for a game jam (Dropsy and the Black Lodge) and that just cemented this character for me.  He's an innocent. Probably one of the only pure innocents I've ever run into in gaming.  I don't do a lot of standard reviews of games (and this is my first on Steam), but I love this game enough to write this.  I honestly am not sure what to say that doesn't just sound like me gushing about Dropsy. So... I'm going to gush.  The audio is fantastic. The soundtrack helps set the mood (and the Dream-world tracks... some of my favorite).  The hand-drawn animation just fits. The first time you see Dropsy get excited because someone likes him, when you go to hug someone and they accept the hug... I'm actually getting a little emotional just thinking about it.  Jay does a fantastic job of including humor in the game. The emotional scenes hit you right in the feels. The laughter is contagious. And even the frightening gives me goose-bumps.  Controls are fairly standard Point-n-Click.  There is nothing written in the game. The visual method that characters use to communicate can take a little getting used to, but it's laid out simply enough that even a child can understand it.  It's not often that a game comes along that can literally be appealing to kids and adults, but my nine year old son is just as excited to play with Dropsy as I am.  What are you waiting for? Go start hugging!",
            "review_score": "1"
        },
        {
            "review_text": "I hugged a tree. I felt alive inside.   No other game has let me experience that.",
            "review_score": "1"
        },
        {
            "review_text": "Right away I'm extremely charmed. Ten minutes in and it's making me smile.",
            "review_score": "1"
        },
        {
            "review_text": "The fact that  Dropsy  is a point-and-click adventure game about a creepy-looking clown should not put you off this delightful game. The art and music are top notch, and the game is full of heart all the way through.  The annoying parts of old adventure games are absent - there are no puzzles requiring you to use non-sensical things to progress; instead, you're given cues through 'conversations' had entirely with icons and unintelligible sounds. And the majority of the puzzles are working out how to solve problems for forlorn characters, who reward you by letting you give them a hug. A weird, wobbly, greasy hug, but a geniune one.  The ending is a bit of a crazy twist but it's a perfect capstone for the game. Definitely worth the few hours it takes to play, and the few dollars they're asking for it.",
            "review_score": "1"
        },
        {
            "review_text": "This game was relaxing. The largely nonverbal storytelling might weaken it for some, but you can work out the translation soon enough. There is even a guide for it, but it's more fun to try it yourself. Good music, good art, and a feeling that is down to Earth. It is an adventure game, and while I took a break from it when I did get stuck, I came back fresh and found how to advance.",
            "review_score": "1"
        },
        {
            "review_text": "Strange, weird, unsettling, beautiful, charming, melancholy, sad, hopeful.  A must play for adventure fans and lovers of the bizarre. ",
            "review_score": "1"
        },
        {
            "review_text": "Hugs. Lots of hugs.",
            "review_score": "1"
        },
        {
            "review_text": "An astonishingly beautiful game.  I love this game, from the demented character designs, to the awesome jazz soundtrack, and the unique open world adventure game concept. The four playable characters (dropsy, his dog, the bird, and the mouse), are all really cool, and interesting companions, each with their own character specific abilities.  So many of the gameplay mechanics are unique, and surprisingly enough they're implemented in a way that close to perfect. Some specific examples of said mechanics are the interesting non verbal clues the characters give you, as well as the different character, and team specific puzzles available.  There also is the larger puzzle of decoding the in game letters of the game, Fez did something similar, however unlike Fez figuring out what these specific characters mean is a significanlty easier task. Being able to read the in game languge will help shed light on the in game lore. Which is a fun bonus, and a nice touch.  I like that you can complete so many different side objectives, and that the game allows you to keep track of what you've done via some pictures on the wall of the main characters home, as well as a small map in the dogs room.  Neat little touches like that really show how much thought went into the game, not only from an asthetic standpoint, but also from a design standpoint as well.  There are some things I wish were handled differently, some items seem to stick around even after you've used them, some items don't get collected properly either. None of these are game breaking issues, and hopefully will get patched.  Some of the puzzles were too easy, and at times literally were repeated (like the bird stealing two wheels). I also feel a newgame plus would have made this game more enjoyable, I doubt everyone is going to beat all the side quests the first time around, and it's kind of arduous needing to get everything all over again.  The game is also a little short, it would have been nicer to have been able to explore a bit more. On the other hand the artwork and animation are top notch, so it's understandable for a project this detailed to needs to limit itself, otherwise it would still be in development, and people need to eat.   Lastly I like that despite the dark aspects of the game, the underlying themes of teamwork, friendship, and understanding are all present. It's so rare to have a main character these days who's completely magnanimous, there is something really positive about this game that just makes it a fun, and enjoyable experience.  4/5 I would recommend.  Thanks, - Celx Requin   www.twitter.com/cancercinema   www.cancer-cinema.com/badtaste ",
            "review_score": "1"
        },
        {
            "review_text": "This game is adorable, charming, and surprisingly gripping  My only complaint is I have no ♥♥♥♥ING idea what's going on  Update: So I just completed the game (I will admit I had to use a guide several times) and if you're wondering if things make any more sense at the end, I can confirm that no, they don't",
            "review_score": "1"
        },
        {
            "review_text": "In the world of adventure games, Dropsy stands out on so many levels that it deserves to be considered a classic of the genre. The art is amazing, the characters memorable, the soundtrack is astonishingly perfect, and the story will pull at your heartstrings in all the best ways. That the game manages to tell a story and guide the player through it without any written or spoken dialog* is a quite a feat.   For me, it's a game that's not without its faults - the day/night cycle was more of a hassle than it's worth, and the fast-travel system gets introduced way too late in the game. There's a whole lot of walking around you'll have to do before it presents itself. But I guess you could argue it at least gives you more time to listen to that amazing soundtrack. These are all minor nitpicks though, and I'm glad I gave the game a chance.  (* ok, not quite true, but you'll get what I mean)",
            "review_score": "1"
        },
        {
            "review_text": "Dropsy is a quirky game that oozes character. The sprites are all well-animated, the soundtrack is great, and some of the puzzles I've seen so far have been pretty clever. Even though there's no dialogue, you still have to pay attention and use some logic to solve some of the puzzles, or open up new areas.",
            "review_score": "1"
        },
        {
            "review_text": "I don't think I've ever come across a game that is as satisfying as this one for its genre. Amidst all the rpgs and roguelikes that proliferate the atmosphere of Steam, Dropsy is that one point-and-click adventure that I'm glad to have stumbled upon. To this day, the game's story and music grow fondly in my heart.  Pros: -Dropsy is an amazing, unique, innocent character that you can't help but feel for. -Gamplay mechanics are intuitive and well-placed (as opposed to clicking everywhere until a solution is found). -Storytelling is utterly satisfying and surprisingly deeper than expected. -Visuals are rendered in a delightfully pixelated world, and are no stranger to a day-and-night cycle.  Cons: -The game is relatively shorter than expected. -The deeper aspects of the story remain hidden in crypted text, but does not harm the integrity of the gameplay itself.  I would happily enjoy going on more adventures with this one-of-a-kind character.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the best game of 2015, or at least one of, for sure. The design, music, characters and story is all top notch and all filled with love and inspiration! My only complain is that some puzzles are a bit too obscure and some 'dialouge' too difficult to decipher. The creator himself even thought so as I understood it, but then again, some got themselves all the way through, while others did not. It may be a case of people being a bit spoiled with quick solutions in the modern age compared to the golden age of LucasArts and Sierra, where pixel hunting &amp; trial and error basically were the rule as there were no forums or walkthroughs on the web.  But to conclude: I love this game. It enriched my life.",
            "review_score": "1"
        },
        {
            "review_text": "A truly remarkable game. Amazingly crafted, has funny characters, really good graphics, amazing and unique style and cool music.  That's all you need to know. GET. IT. NOW.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "✓ Good graphical design ✓ Interesting soundtracks ✓ Compelling storyline and quests ✓ Decently balanced difficulty ✓ DRM-free version exists ✓ GNU/Linux support!  ✘ Some camera/control issues and other minor details needs to be ironed out",
            "review_score": "1"
        },
        {
            "review_text": "I came for the catchy theme song,  and stayed for the hugs and catchy casette tapes and the evil twinkie company. But most of all, I stayed for a world that seemed bizarre at first but ultimately felt just right.",
            "review_score": "1"
        },
        {
            "review_text": "A bit on the short side in terms of game time, but definitely not short changed in terms of feels. Dropsy is a simple little point and click which leaves the player completely on their own. There is no dialogue, the story must be inferenced from the scenarios at hand, as well as the pictures that the characters use, in place of dialogue.   You go around hugging people and animals. You hug them after you have made them feel better, or solved their problems. Seriously, how can that not make you smile? Sure, Dropsy is a terrifying freak on the outside, but it just goes to show that this little weirdo has a heart of gold, and you will quickly warm up to this hugging machine!  Charming characters. Great music. Wonderful, albeit short story; and genuine puzzles that had me stumped for a while (I looked up some help, I'll admit it), but nothing feels unfair or unexplained, so I don't blame the game for that. Overall, this is another one of those diamond-in-the-rough indie games that have been coming onto Steam in droves - and I welcome it and all its kind in one big ol' damp warm hug. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Dropsy is a fun, point and click adventure that really tells a story. It's set in a world much like our own and follows a happy clown that wants nothing more but to hug every little thing in sight. It was a great experience and I really felt for Dropsy by the end of the game. I'd recommend this game for anyone looking to see a sad and happy story unfold. I really enjoyed this game.",
            "review_score": "1"
        },
        {
            "review_text": "A game about making everyone you meet happy.  Dropsy is endearing and beautiful, my favourite point and click I've played in a while.",
            "review_score": "1"
        },
        {
            "review_text": "Review: I CRIED. SO MUCH. And I'm not even angry.   At first Dropsy is reminiscent of ye olde point-n-clickfest BUT REALLY IT'S NOT. No rubbing everything in your inventory together, and I felt start to finish the puzzling steered away from frustratingly inane territory. Loiter around people to get their picture speech bubbles, piece together what they mean as you go along, and you'll typically never be completely lost, save for a few points where I had trouble telling what an item or object actually was. As for the hugventure, there's hugs, variant-hugs, and the different ways people embrace Dropsy is special.  Yes. Buy. Do it. All must love Dropsy as I do ;-;",
            "review_score": "1"
        },
        {
            "review_text": "Feeling down? Cynical? Depressed? Dropsy is there to lift everyone's spirits with his simple innocence and love of hugging!  So what about the game itself? The pixel art is well animated, colorful, and a sight to behold. Everyone has the greatest expressions on their faces, and the use of visual cues instead of spoken dialogue is genius! The soundtrack is moody and fitting, and I never would've thought an open-ended world would work for a point-and-click adventure game, but for Dropsy, the nonlinear layout gets you to think a little more about how best to tackle helping out others.  So hug your friends, and then hug the developers and give them money!",
            "review_score": "1"
        },
        {
            "review_text": "Dropsy finally has his own game. Took you a while, Gaspy.. but you got there.  Oh right, a rewiew.   Read everyone elses, then go get it. It's a must buy if you love adventure games.",
            "review_score": "1"
        },
        {
            "review_text": "If you're craving old-school point and click adventure or wish to experience the sick addiction us old timers developed back in the glorious Sierra days, you've come to the right place. Well-done pixel art, Sound Blaster inspired audio, the whole works is right here for you.  My only negative critique is some of the difficult puzzles are difficult because there's little to no context letting you know that a thing has happened arbitrarily.  Otherwise, it's clever. Quite clever. Come get some hugs!",
            "review_score": "1"
        },
        {
            "review_text": "Too weird to live, too rare to not play !!! ... a lovely point and click game with hug",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend flailing your arms the way dropsy does along with him every time you get a hug",
            "review_score": "1"
        },
        {
            "review_text": "Watched Pushing up Roses review of this and she has always been right in the past about good adventure games. But i was still so very hesitant about this. It looks so weird, the graphics look weird, wtf is up with the conversation system?   All doubts be put aside - this game is great, brilliant even.",
            "review_score": "1"
        },
        {
            "review_text": "Dropsy is an equally disturbing and heartwarming 'hugventure' about a grotesque, misunderstood clown who tries to make new friends in a town where everyone believes he's a psychotic arsonist. With nostalgic graphics, a mind-blowingly awesome soundtrack and challenging puzzles, this is a game you won't regret buying.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, beautiful art, colorful landscape. This game is a fun and brilliant game. This is what I call an amazeing point and click adventure full of happiness. You play as a clown named dropsy who's mother died in a circus fire. Everyone thinks he did it. It's only him and his father. He is set out to help people and be nice. It gives you a great sensation to solve someones problem and/or hug them. This game is a must buy!",
            "review_score": "1"
        },
        {
            "review_text": "Such a strange,crazy yet breathtaking and heartwarming stroy.   Capitalists are demons!!!!!!!!!!!!!!!!!!!!!!!!Heed my words people!!!!!!!!!!!!!!!!  ",
            "review_score": "1"
        },
        {
            "review_text": "What a wonderful, bizarre, creepy, and joyful experience. Hug your way through a delightful point &amp; click adventure game in an effort to cheer up the town.",
            "review_score": "1"
        },
        {
            "review_text": "Undertale goes to clown college",
            "review_score": "1"
        },
        {
            "review_text": "This happens if you take the bunny and dog out of your LSD trip.",
            "review_score": "1"
        },
        {
            "review_text": "The game is disturbingly fantastic. The ending has a great buildup to make it all wrap together in a really exciting way. Right until the very last minute or so. That was so bad that it honestly ruined the entire game for me. It felt like there was no thought put into it.",
            "review_score": "-1"
        },
        {
            "review_text": "What a pain having to sit thru 5 minutes of this game to review it, lacklustre game, initial thoughts on graphics, worst pixelated crap. Sound and music on and off, no adjustment.... no resolution option.... maybe I just don’t get the 'artistic value of it, but just moving through the world for 5 minutes, I decided what a waste of space.  I saw no pro's, but with the initial negative ambiance the game hit me with I wasn’t going to look for them. ",
            "review_score": "-1"
        },
        {
            "review_text": "Just the art style is worth the price. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A Point and Click adventure featuring a terrifying looking clown that will actually have you feeling all warm and guzzly inside. Didn't plan on getting this at first, but I'm glad i did. Go Dropsy!",
            "review_score": "1"
        },
        {
            "review_text": "Never have I been more emotionally invested in a game. Clowns are nice, too.",
            "review_score": "1"
        },
        {
            "review_text": "If I had to sum up Dropsy, I'd say this: bizarrely charming. An interesting, yet short point-and-click that never ceases to surprise and entertain.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like clowns? Do you like awkward physical contact? No and no? It doesn't matter. Buy the game anyway. The price isn't too bad. It takes at most 4 hours to finish it. The story is happy and tragic. The visual style is superb. The music is fitting. The game has a perfect difficulty to it. Just doesn't last really long. Note: The game has absolutlely no replay value. You'll probably do all the extra stuff which could take at most an hour but afterwards, there is no incentive to go back and replay the game. Still really damn good. Check it out.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game much more than I expected to. More than just a point-and-click, it was an experience that the artwork, the sad story, the music, and the damp hugs all contributed to. Days after beating it, I still have the feels and the superb soundtrack stuck in my head. Would play a sequel if the creator made one.",
            "review_score": "1"
        },
        {
            "review_text": "This is a short game, but a good movie is also short. 100% worth it. A lot of love went into this game and you feel it.",
            "review_score": "1"
        },
        {
            "review_text": "Delightfully Horrifying",
            "review_score": "1"
        },
        {
            "review_text": "Play this game. You won't regret it, just don't get the iOS version, you can't finish it until they fix it. I bought this game while looking for something surreal. It really is unique and touching and the music is great too. Good work!",
            "review_score": "1"
        },
        {
            "review_text": "It was great sure it was somewhat small and the story wasn't the easiest to understand it was still a good idea and I hope the creators make more games like this.",
            "review_score": "1"
        },
        {
            "review_text": "all you need to see to know if you will like this game is dropsy's walk cycle. it is funny, bouncy, cute, a bit creepy, and just great",
            "review_score": "1"
        },
        {
            "review_text": ";(",
            "review_score": "1"
        },
        {
            "review_text": "It made me cry. I think.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Soundtrack is great, most puzzles are fair, deviating from the point-n-click trope of searching for pixels. The art-style is absolutely beautiful. Slightly short, but for the price it isn't too bad. Definitely an easy recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing game, worth full price. Difficulty-wise it has a few confusing moments but nothing compared to the adventure games of old. Makes you want to go hug things :)))))))))))))",
            "review_score": "1"
        },
        {
            "review_text": "Really quirky and interesting point-and-click adventure. Reminds me a lot of the early Sam &amp; Max games in its humour, aesthetic, and gameplay.  With that said, it is also a lot like Sam &amp; Max in that the 'puzzles' span from the mindlessly simple to the astonishingly obscure solution. I never used the help of the walkthrough because none existed when I played, but I must have spent about 2 of my 6+ hours of playtime scratching around the big map trying to figure out what to do. It doesn't help that characters speak in sometimes difficult-to-read images rather than true dialogue.  The redeeming qualities, though, trump the aforementioned cons. Dropsy is really visually stunning in every scene. And the 'puzzles,' while obscure in some areas, are rewarding to figure out. The story, also, if you can decipher what the characters say, is very deep and meaningful.  I'm very hopeful for future releases from the 'Dropsy' devs!",
            "review_score": "1"
        },
        {
            "review_text": "Totally quirky and surreal. Dropsy is the feel good game of the year. Ranks up in quality of the classic Lucas Arts games of yesteryear. P&amp;C adventure game fans shouldn't hesitate a moment to play this; one of the best in genre.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty decent point n' click adventure with a unique story, characters and setting. Unfortunately the ending leaves much to be desired and the 'plot twist' was very underwhelming. Worth it on sale, if only for the twerking.",
            "review_score": "1"
        },
        {
            "review_text": "Point and click adventures are evil. Seriously, I can't remember the last one I played where I didn't hurt in some way at the very least one (usually innocent) NPC. Over time being mean to other characters has become a staple of the genere. Even if this is rather usual in other kind of games, it feels very different when done in point and clikc adventures. More concious, more meditated, with a far clearer mischievous intent. And I love it :-P  Dropsy isn't really different to similiar games in that sens, though it definitely does feel different. The main character has an aura of innocence about him. All his actions are clearly aimed to ultimatley helping his neighbors, even though they openly despise him. It is very unsual to find games where the main objective is making everyone happy. And I truly appericate this.  Dropsy the clown isn't alone in his adventures. As his jorney progresses, a trio of additional playable characters joins his party: a dog, a mouse and a bird. Each of these are different sizes and have different movement possibilities. These differences are cleverly exploited to block acces to specific areas or objects until the needed friend has joined the party. It may be not immediately obvious how these additional characters are supposed to be used. They lack inventory and all their puzzles are very physical, usually consisting in finding the path to a specific position.  I find laudable the effort that was put into telling the whole story without resorting to text or voices. Unfortunatley the meaning of some of the icons used during dialogs is not always clear. Speaking of which, keep in mind there is text in the game though it just contains additional details which aren't really important to understand the story. These texts are in english but written in a custom alphabet instead of the latin one, so they must be deciphered by the player.  These game is rather non-linear. In fact, many of it's quests are optional. This is great, though sometimes it may be a bit disorienting. It's not always obvious whether helping one of the neightbours leads to a dead end or has further reaching consequences.  Artistically the game is great. Backgrounds and characters and detailed and full of personality. The animations are also great, very lively and charming. The music is excelent too and very varied. It's also integrated into the gameplay since there are a handful of additional pieces that can be optinally collected through your journey. The SFX are fine, though not very impresive.  All in all, and although I felt disapointed by the ending, I enjoyed playing Dropsy. It's quiet easy and not very lengthy, so I recomend it to anyone looking for a frugal, pleasant and warm experience.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. I  liked  Dropsy. A lot.  I got this game as part of the Humble Bundle Monthly and I did not know what I was getting into when I launched it. There is no written English in this clever and beautiful illustrated point and click adventure. The game was fun, the achievements were a blast to get (to be honest, I just turned on his clown shoes early on and left the sound muted), and the story was really interesting. The language has been and can be translated, so there's a bit of codex fun to it if you're into that. Also, you can play as a few different sidekicks, a dog, a bird and a mouse, although their interactions are limited. I would love to see this game and its world continued, expanded even. I would absolutely, without hesitation, recommend Dropsy for fans of old point and clicks and as an introduction for new players to the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Only played the first part so far, but I absolutely love it already.",
            "review_score": "1"
        },
        {
            "review_text": "A charming character-driven point-and-click adventure about kindness trumping prejudice.  Falls to a few pitfalls of point-and-click adventure games — I recommend consulting a hint guide or walkthrough if you get lost. Don't worry, though: I don't think you can ever screw yourself into having to restart the game.  It has one big selling point I liked: a complete lack of text. I imagine it could be played by anyone, regardless of language and literacy. (Though there may be some cultural barriers.)",
            "review_score": "1"
        },
        {
            "review_text": "For starters i have to admit that this is the first point n click i have played through. i have to say i couldnt have picked more of a peferct one in the genre to start with. even if the play time runs a little short (6-7 hours) the amount of heart put into this game clearly made up for it. i sat down with my girlfriend and we played through the entire game together. we enjoyed every moment, and couldnt help but smile at all of the puzzles and details . If you are looking to get into point and click adventures, Dropsy is a great choice to start with. the puzzles are challenging enough and the story and atmosephere capture your emotions instantly . can't wait someday to have more adventures with dropsy .",
            "review_score": "1"
        },
        {
            "review_text": "Aside from a couple sections where I had no clue where to go or what my next step was, which isn't terribly uncommon in point and click adventure games. I found the game to be a steady and enjoyable experience that caused me to feel some genuine emotion at times. I wish I had discovered fast travel a bit sooner, but such is life. Overall the game play is fairly simple and straight forward.   The graphics are simple but expressive. The music is really unique, kind of trippy but the majority of it I found the be quite enjoyable and I might even listen to the soundtrack outside of the game. The puzzles themselves are fairly straightforward and the game is more about exploring the environment and learning the history of the town and its characters.   I am thankful for the experience and look forward to playing it again someday.",
            "review_score": "1"
        },
        {
            "review_text": "Apart from all good things already said, the game has some really catchy sound tracks that would keep me going back, like the one in dreams, in the church, everything in the last chapter, just to name a few.  For the warm damp hug edition, you get 2 albums of sound tracks from the game plus a sketch book from the game designer. While the sound tracks are all awsome, I'd recommend removing the vocalist(not to be personal), it doesn't fit into the general 16-bit flavor.   The sketch book is pretty raw, it's more like a bunch of game design documents put together. While it could be interesting especially if you're into game design, it would be better if more drawings are put inside",
            "review_score": "1"
        },
        {
            "review_text": "this game is a rollercdoaster of confusion, damp hugs, unwarrented hatred, and one very happy and loving clown  first time I played it I thought it was about a mentally challenged clown and his aged carnival associates, but then I came to realise, this is a story of redemption, lots of damp hugs, and love. srs is guud gaem",
            "review_score": "1"
        },
        {
            "review_text": "A good ol' point and click.... it's a bit weird but really touching... though it doesn't really say it has a hard mode I'd disagree... just turn on the clownshoe sounds. If you were a fan of Lucasarts old SCUMM games I think you will like this.",
            "review_score": "1"
        },
        {
            "review_text": "One of the far more heart felt games out there, great aesthetic,music,and design. also warm hugs &lt;3.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It's cute, gross, funny, and poignant all at the same time. Definitely one of my favorite point and click adventures.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a pathos rich story told without any text, and I think that's something groundbreaking in the adventure game genre. Plus, you get three animal companions you can smooch. Buy immediately, or whenever you can afford it.",
            "review_score": "1"
        },
        {
            "review_text": "If you've seen the trailer, erase it from your mind if you can, this game is at best when you don´t get spoilers.  You´ll find yourself in a world that is sympathetic, funny, evil, surreal. A classic yet fresh adventure that is a cure for any cynical person.  Personally I skipped this before as I thought it would be too surreal and colorful for my taste but after 2 minutes of gameplay already changed my first impression. I could as well have paid the full price for this. I recommend it with or without discount, an adventure you most likely haven't seen before.",
            "review_score": "1"
        },
        {
            "review_text": "It's memorable in visual and score. I wouldn't reccomend it for young kids.  Suffers many of the same old point and click issues. Some of the acheivments seem intended to be annoying.",
            "review_score": "1"
        }
    ]
}