{
    "app_id": 274480,
    "name": "Drox Operative",
    "release_date": "2014-02-18",
    "developer": [
        "Soldak Entertainment"
    ],
    "publisher": [
        "Soldak Entertainment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Space",
        "Indie",
        "Action"
    ],
    "achievements": 63,
    "positive_ratings": 229,
    "negative_ratings": 26,
    "price": 14.99,
    "description": "Drox Operative is a starship action RPG with warring alien races, fierce space battles, a dynamic, evolving galaxy, and co-op multiplayer for Windows and Mac.Eons ago the Drox ruled the galaxy through their mighty Operatives. These elite starship captains were trained to accomplish the impossible at whatever cost necessary.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/274480/header.jpg?t=1536792013",
    "minimum_requirements": "最低配置: 操作系统: XP or newer 处理器: 1.5 GHz Pentium 4 内存: 256 MB RAM 图形: GeForce 2 or better 网络: 宽带互联网连接 存储空间: 需要 200 MB 可用空间",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Basically, the game is Din's Curse..IN SPACE! with some heavy focus on diplomacy and politics. The idea is that you are part of a group called the Drox Guild, with the goal of maintaining the presence of the Guild in the sector (the game world). There are several ways one can win or lose, giving YOU the player the ability to choose how to win/fail. Like the other Soldak games, this features the living world around you aproach to the hack and slash. Quests have time limits. Success or failure will cause changes to the game world. That radiation leak on the planet won't fix itself, and if you leave it for long enough the planet can suffer more woes that you can solve. But should you buy this game?  Yes. Yes you should. Here is why:  +You are a space mobster. Really the game should be called Drox Moberative. +Technically infinite gameplay, just because you beat the sector doesn't mean you can't keep playing in particular in HOW you won the sector. I got a 'fear' victory while at war with two races and battled them for a good two hours to make little head way. +Decent gameplay. Its a hack and slash, but it is tuned to make sense and it plays pretty well. The battles are engaging and enjoyable, if not overwhelming at points. +VERY diverse worlds. It is improbable that you will get the same sector twice. In addition to simply having a random lay out, each system and sector have different moddifiers (more enemies, more agressive behavior, more traps) so you never know what you are going to get with your new sector. On top of that, Mods Mods Mods. Add more mayhame with mods +Easy to lose track of time with. Not sure why that is a plus but what ever.  That said there are some things to be desired such as stat point distribution, but most if not all can be fixed with mods. Give the demo a try if you are still not sure. It is much more engaging than one would think.",
            "review_score": "1"
        },
        {
            "review_text": "I've been insane for this game since I tried it and realized what was going on: At first it just looks like Diablo in space; a solid space-spaced ARPG with enough stat-building and ship-customizing (with the random components from blown up ships, or scenario rewards) to keep you blasting for a bit. Fans of games like EV Nova might enjoy this game just for that.  But there's more. Instead of being story-driven, the game randomly generates new quests and events as you play. An elite space monster shows up, starts gathering a fleet, and if you don't react, he might take over a star system. Then the monster starts sowing chaos on nearby colonies; they might contract a plague, get computer virus, etc. These events can also escalate if unchecked. I've seen empires lose planets to open rebellion. I've HELPED rebels escalate, and contributed to the creation of offshoot races!  Also the various species - and your guild, the Drox - all have dynamic relationships. Help a race, they like you more. Attack them, they like you less. Help their allies, and they like you. Attack their allies, and you might earn more enemies than you intended. You can carefully nursemaid a sector-spanning alliance of friendly races for a diplomatic win... or watch the network of alliances fail like a house of cards if you bungle your relationship with one of the races. That might be a good time to switch tactics and go for another type of win.  The various systems interact in what looks like a well-tuned, balanced way - no surprise because the game has been out for some time. The interactions give this game a nice emergent-gameplay edge that keeps things interesting, and there's nothing more hilarious than being a few planets away from a military victory and having the Drox Guild tell you that you MUST, due to Circumstances Beyond Your Control, ally with the race you've just been eradicating colony by colony from this area of known space.  Highly recommend for fun ARPG-in-space with a sandboxy twist.  Edit: There is an expansion out, which is not on Steam at the time of this writing. You can purchase the expansion from Soldak and apply it to the Steam version of the game to gain access to additional features. He's also said that he's working on getting it into steam. He's been providing Steam codes for anybody who purchases directly, and we can expect this to continue for the expansion.",
            "review_score": "1"
        },
        {
            "review_text": "Update 25/11/2016: Nominated for my “Just 5 More Minutes” Award.  I saw some footage of this game in January 2013 which was enough to tempt me into trying the free demo. My curiosity was piqued but I wasn't expecting much - just a bit of a time killer to tap away at and fill up a bit of the afternoon. I came away several hours later with the music stuck in my head, feeling as if very little time had passed, then went on to have a dream about Drox Operative that same night. I bought the game from Soldak's site the next day and have been playing Drox on and off since then without ever having cause to regret the puchase.  It's a hugely addictive little loot-focused ARPG with a beguiling amount of depth. As most reviews have mentioned, the most compelling feature is the sense of a living galaxy going about its business in the background while you perform the basic functions of clicking, killing, looting, equipping and selling. Essentially the alien AI races play a 4X style strategy game against eachother (albeit in real-time) while you fly about attempting to affect the outcome, with the goal of satisfying the win conditions set by the Drox guild (such as uniting the AI races, or allying with the winner of an all-out war, or victory via exploration and volume of quests completed, etc.). After triumph in one sector, you move onto the next one - presumably a harder one, although the player can set the parameters for each randomly generated sector, including difficulty. Coop online play is possible, as well as 'Hardcore' (permadeath) mode which unlocks once you get a ship to level 25.  Everything the player does affects the game universe in some way. Destroy a named boss monster and the planets in that system will become more prosperous for the alien races who hold them, giving those races more resources to build ships and advance their technology faster. Leave that monster to its own devices and he may form a fleet with other tough mobs, create malicious devices in space or perform acts of sabotage against the AI and their planets - which in turn leaves them crying for help from you, the Drox Operative, to solve all their newfound problems in the form of new quests.   Performing a fetch quest to prevent a planetary famine may solve that planet's problem - or it might produce another fetch quest from that planet, as they ask you to help destroy their rampant 'super weed' created by the fertiliser you delivered. Failing to solve fetch quests involving riots and civil war may even result in the creation of new races, who splinter off from their parent race and colonise planets of their own, becoming a new force in the sector. Alternatively you might intentionally foment discord and quest for rebel ships in order to fulfil precisely that goal. Much of this sense of life and variety comes only through the flavour text of the quests, but it is all very cleverly conceived and the quests do all have real consequences for the calculations under the hood, for the prosperity and the military fortunes of the AI. If you get tired of questing and manipulating, then you can simply explore and leave the AI to tear eachother to shreds (albeit hopefully without triggering any of the Drox guild's failure conditions).  My current ship, which I've been running a long time, is level 92, it's in a sector with 10 AI races all with their own grudges and friendships and problems, half of whom are at war with me and half of whom love me (and some of those that like me are at war with me anyway). The sector is so busy with catastrophes and weird developments that the events windows scrolls too fast for me to digest. I know I could fire this game up right now and easily lose several hours enjoyably.  To be honest, I don't know enough about the ARPG genre itself to make a judgement on the game loot balance, the min-maxing potential, or the diversity of builds available in Drox compared to other games. It feels very deep in this regard - you have stats, racial specialisations, plus a great variety of shield modules, armour modules, instant hit weapons, aimed weapons, minions (drones), buffs, debuffs, hulls and miscellanous doodads (installed in modular fashion). However I don't play enough of this type of game to know whether Drox is really deep or my understanding of ARPG systems is really shallow. I'll leave that aspect for other commenters to examine. All I know is I'm still having a great time with the unpredictable outcomes and three- or four-way battles that Drox Operative sometimes throws up, over a full year since purchase.   A special mention should be made of Soldak's excellent post-release support. The game has been patched regularly throughout this last year or so, while Soldak (creator of  Din's Curse  and  Depths of Peril ) has also responded promptly and effectively to community feedback and bug reports. Drox was a fully formed game long before its recent emergence from Greenlight onto Steam. Now it has the benefit of this wider exposure it deserves to be played by as many people as possible, because it's an unsung gem. Clever, addictive and great fun.",
            "review_score": "1"
        },
        {
            "review_text": "Drox Operative is an excellent and unique ARPG, well worth your money.  The Good: -Unique character development -Extensive variety of builds and ships, you can do pretty much anything you can come up with, and succeed. -Random area generation, each playthrough is different. -Built in mechanics to encourage you to play each round differently, without penalizing you for playing the way you want to play. (For example, the Drox guild will issue you a quest to save one race, destroy another, protect a specific alliance, etc, and you earn extra rewards for compliance.) -The graphics are no where near as bad as the screenshots would lead you to believe. -Easy to respec, making it almost imposible to permanently screw up a character. -Fun factor: this is one of those games where you look up and realize hours have dissapeared, and your wife is standing behind you nagging.   The Bad: -Learning curve can be a bit steep, with spikes in difficulty. -Drox Guild quests can often encourage you to do the Exact opposite of what you've been working towards. -Easy to screw up a character, forcing you to respec.  ",
            "review_score": "1"
        },
        {
            "review_text": "I will agree with the word that keeps being used in reference to this game... a 'gem'. What a breath of fresh air through the pollution of crap games that somehow continuously show up on Steam. You have to play the game to realize why this has a 19.99 pricetag. Then you will realize why its worth every penny. On top of that, the one DLC they have is stuffed with content and again, worth every penny. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "I found this to be a very enjoyable and replayable game. I felt there was a bit of an initial learning curve, but still a fun game for any gamer whether they be hard-core or casual. I particularly enjoy the addition of the Scavengers in the expansion, which by far have been my favorite race to play. I look forward to unlocking their sub-races if I can ever manage to do so.  Update 03/02/2015 - After 110 hours into this game, it is still one of my favorites. I highly recommend any of the Soldak titles, which all seem to use the same engine. The randomness of the game keeps it fresh, and the settings allow for a great deal of customization.",
            "review_score": "1"
        },
        {
            "review_text": "Hey, this game is cool. Imagine Diablo meets Civilization, set in space. It takes some getting used to - particularly with how fast paced the game can progress when you're screwing about, but once you get a hang of it you'll be hooked for days.   There is an expansion available for the game already (although it only just hit Steam, Drox has been out for a while and I can't wait until it becomes available here too, but the base game is still a heck of a lot of fun so don't feel like you need to wait for the 'full package'.   Thanks to the abundance of context-sensitive help you'll quickly get up to speed on the various dynamics, but I still recommend reading through  this guide  [www.stephenhornback.com]  if you find things overwhelming - like Drox itself, the guide is not particularly pretty, but it's comprehensive and well designed. If you like unique, challenging action-rpgs you should jump on Drox Operative.",
            "review_score": "1"
        },
        {
            "review_text": "great fun space rpg game  with lots of exploring sectors  you meet lots of races and sub-races plenty of quests to do and lots of loot too much to name ",
            "review_score": "1"
        },
        {
            "review_text": "What can I say?! Wish I found this years ago... Exactly what Iv'e been looking a long time for... 2 words... GET THIS!!",
            "review_score": "1"
        },
        {
            "review_text": "For the first time in literally years, I have finally found a game that managed to scratch a very particular itch that I have had since Escape Velocity: Nova. Despite the indie production value, this is a truly good game.",
            "review_score": "1"
        },
        {
            "review_text": "Drox Operative is one of those gems that don't need a huge marketing campaign to prove its concept. This game is just good as it is. The graphics are warm, the gameplay is solid and the experience is deep and very interesting as is the motivation to explore and play on.  You can play it solo or with friends and loosing a game (Sector) doesn't destroy your ship. You are allowed to start all over with your last ship and gear. How's that for a change?  There's also a DLC, but it's not on Steam yet; so you'll have to wait for that a bit more.",
            "review_score": "1"
        },
        {
            "review_text": "Some pretty fun coop for such a seemingly simple game.",
            "review_score": "1"
        },
        {
            "review_text": "Not bad, but not my style of game, have to make alliances... Im more about killing everything, but if you are into that stuff, go for it, not bad for a no name developer, graphics are very much low enc",
            "review_score": "1"
        },
        {
            "review_text": "Don't look at my 'hours played', as I play offline mostly. Look at my achievements.  If you're looking for a good 2D space combat game like 'Solar Winds', 'Starscape', or 'SPAZ', this is not it. Keep moving.  This is a ♥♥♥♥ing grind fest with a space skin on it, nothing more.  Think Borderlands, with no plot. All there is to this game is grind for XP, grind for better random items, that's it.   It also shows strong evidence of no playtesting. There's no attempt to make this game fun. Expect to get one-hit killed many many times when you get to level 50. It starts getting quite unbalanced about that point. I found an enemy that had health regeneration that was higher than my DPS, and I had put about 40% of my points into tactical (the damage stat).  Also, it is not possible to max out your character, there are 6 skills, and enough levels + points to max out 2 of them, assuming you put absolutely no points into anything else.  Graphics are pretty rough, which probably wont bother you if you're looking for a 2D space combat game, sadly however the frame rate stuttered quite often on my as of 2014 US$3000 PC.  That may be your cup of tea, but it sure as ♥♥♥♥ is not mine.  Avoid like the plague.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a surprisingly addictive game, I highly reccomend it with the proviso that you should go into it knowing its not a deep game, it does have tactical depth but as an 'RPG' its mighty thin.",
            "review_score": "1"
        },
        {
            "review_text": "This is basically an action RPG with a procedurally generated world. Finding new areas and exploring them can be a bit tedious, but the game keeps you interested for a good amount of time by always throwing new loot at you.",
            "review_score": "1"
        },
        {
            "review_text": "this game is fantastic, the visuals in the trailer seem very 90s and low end but the gameplay is great fun. drox operative has a lot of depth with its arpg gameplay, rpg leveling system and loot that once you start playing online co op with some friends you wont be able to stop",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game. Open Ended Space Sim. Lots of potential to do whatever you want. I'll be playing it quite a bit.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Diablo-Esque game. Kind of wished it had classes, but all in all a great game.",
            "review_score": "1"
        },
        {
            "review_text": "I suppose the idea here is that this is like playing a mercenary in a 4X game, while the AI handles the four x's. In practice this seems to work, there are AI civilizations fighting, colonizing and entering into diplomacy and you can influence and effect things, sabotage races you want to lose, or just join in an all-out fight, pick a side to ally with and destroy their enemies. Easy enough to pick up and there's depth to keep you playing. Its a really good idea, the game has a lot of charm, and when it works is a lot of fun. Diablo-like, this is a point and click shooter with a streamlined leveling system and crate-loads of loot.  The trouble is its as buggy as hell, and at 2+ years old there really shouldn't be such blatant bugs. I keep getting quests to colonize non-existent planets, to destroy non-existent enemies and half the time complete quests I wasn't even set (which is a nice XP boost, sure, but confusing!) Imagine hunting a bounty in Diablo 3 having being told they are in Westmarch Commons. You spend an hour looking for them only to get bored, go elsewhere, and discover the bounty was actually in Desolate Sands.  It looks like the main issue is that the game randomly generates each sandbox sector for you to explore, and simply gets muddled by the amount of random info. being generated. It means a lot of aimless wandering, and wiki visiting to find out where you are actually supposed to be. The other trouble is that it is very easy to win a sector (I hope it gets harder as I level up), I just keep buying victories, paying off the most powerful race to be my ally. I also felt the inventory options were limited, while these can be expanded, even when I had four cargo bays I was leaving a lot of litter spread around the galaxy (never mind the fact that none of the vendors ever have enough money to buy goods from you!) Add to this the fact that there are random wormholes everywhere. They always seem to catapult me to a part of the galaxy well above my current level and seem to be a random 'insta-death' function that you cannot avoid. Finally, I have scoured the options and menus and cannot find any information about how many experience points you have and how many are needed to level up. These are all very minor quibbles, but considering the number of indie Diablo-clones out there that are far more polished (and cheaper, or even free!) these add up to disappointment.  Recommended with caveats and a hope that a future patch fixes some of these issues.",
            "review_score": "1"
        },
        {
            "review_text": "I had a tough time really staying motivated with this game. Though I put in a decent amount of playtime, I didn't really feel that I'd accomplished all that much, and I didn't feel like pushing forwards. A friend and I played a handful of games, and ended up getting meeting three of the win conditions. The other win conditions seemed to involve a bit more luck, and seemed to drag on and on. In my view, although these games are procedurally-generated, the variables don't seem to produce anything particularly interesting. The best part of the game, in my view, is the way that your ship is constructed. Your 'build' consists (for the most part) of which parts you install on your ship. If you want to be more tanky, put on more armor at the cost of firepower/thrusters/power. If you want to maximize DPS, throw on a second weapon. However, it's difficult to really feel that you've maximized your spots, and it's hard to plan when you really don't quite know what you'll find. However, I understand that planning in an action-RPG is not something that everyone is interested in doing. However, I like to do it in every one, to know where all my skills points (etc) are going. One quick fix that might improve my experience would be an outline of which types of parts can go into which slots. Is it possible to find a weapon in the green slot? Are there any super-powerful red crew members?",
            "review_score": "-1"
        }
    ]
}