{
    "app_id": 274880,
    "name": "Jet Car Stunts",
    "release_date": "2014-05-01",
    "developer": [
        "GRIP Digital s.r.o."
    ],
    "publisher": [
        "bitComposer Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Racing",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Indie",
        "Sports"
    ],
    "achievements": 12,
    "positive_ratings": 94,
    "negative_ratings": 46,
    "price": 1.99,
    "description": "Master difficult stunts, set the fastest times and let your Jet Car Stunts skills shine.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/274880/header.jpg?t=1447360165",
    "minimum_requirements": "OS: Windows Vista Processor: Intel i3, or equivalent. Memory: 2 GB RAM Graphics: DirectX 9.0 compatible DirectX: Version 9.0 Storage: 400 MB available space Sound Card: DirectX 9.0 compatible Additional Notes: Game pad strongly recommended.",
    "recommended_requirements": "OS: Windows 7 or higher Processor: Intel i5 or equivalent Memory: 4 GB RAM Graphics: NVidia GeForce GTX 645 or better DirectX: Version 9.0 Storage: 400 MB available space Sound Card: DirectX 9.0 compatible Additional Notes: Game pad strongly recommended.",
    "reviews": [
        {
            "review_text": "Do you like platformers? Do you like to go fast? That's right, the next best thing to a Sonic is here!  Unlike some of the other reviews, I very much like the way the cars control in the time attack and platforming modes. On the ground, the controls are quick and snappy. In the air, their turning/angling is delayed and slower as you would expect them to be (due to less friction). You can even adjust your position in midair slightly by coordinating between boosting and using your air brake. Some of the stunt jumps you will be making later in the game are insane but can be achieved with enough practice and strategy.   On the downside, there are a few tracks in the game where you will have to jump through several 'hoops.' These hoops are kind of hard to fit through and the hitboxes between your car and the hoops seem pretty big and hard to avoid. However, with enough practice, it is more than possible to make it. Also,  the third game mode, 'Collector,' seems like a waste of time and is poorly designed.  The placement of the stars/collectables you have to drive into to collect is pretty terrible and incredibly difficult. The way the car controls in this mode is a mess - slippery and just all over the place. The camera is stuck in a fixated spot behind the car at all times, so if the car moves on the ground or in the air at all, then the camera moves along with it. Think of it as racing on the SNES with mode 7 all over again (...but in an actual 3D game). This gameplay mode seems to be the least important of the three though since it has fewer tracks.   The other two modes are great.  The time trials allow you to just go all out crazy with boosting and pushing your speed to the limits. Gotta go fast! The platforming levels are really creative and challenging. Towards the end of the game, I couldn't believe some of the stuff I was pulling off and the crazy stunts I had to perform. Simple, yet effective design! If you've ever played ATV Quad Power Racing 2, the platforming levels (and time trials) in this game remind me a lot of the ones in ATV 2... but faster. So if that's something you enjoyed, this game is for you.    All in all, great game. I am very happy with my purchase since I got it on sale. I love the controls, the game engine, and everything BUT the Collector Mode.  In fact, this game has so much potential to be even more than it already is. It would be amazing to see a REAL multiplayer mode, battle mode, bigger/wider tracks with more gimmicks besides just conering and jumping, a whole other mode, a better designed Collector Mode made easier, or even something along the lines of what ATV 2 had to offer with the tournament races or freestyle modes.  Still needs: * In-game music? * Time Trial Leaderboards",
            "review_score": "1"
        },
        {
            "review_text": "Very fun. It's like Trials as a kart racer.",
            "review_score": "1"
        },
        {
            "review_text": "FAKE linux 'support' (does not support linux)!!!!!!!!!!!!!!!!!!!!! : (   It is a good game on windows though!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a lot of fun. I really wish there was an option to be able to see through your car. Often you are aiming for a platform that is far away, and you can't see it because your car's graphics are blocking your view. I wish the car would go transparent or wireframe in these situations. After playing for a while, it just kept coming up, I'm trying to hit a target far away, and because it's far away it's small and my car blocks it and I can't see it. So I end up replaying parts of it but then I feel like I'm only getting it because I've memorized what to do. Enough times of hitting stuff I would have missed if I could see better and I'd had enough for today. It's a shame because this one tiny change would take this game from 'might play again later' to 'will play all the stages and 100% this game.'",
            "review_score": "-1"
        },
        {
            "review_text": "Poor port of a great mobile (iOs) game. The controls are just horrible!",
            "review_score": "-1"
        },
        {
            "review_text": "336.7MB of sheer frustration",
            "review_score": "-1"
        },
        {
            "review_text": "Actually this game have a little potential but all bugs, car mechanics and drive controls ruined this game.I dont understand this cars a plane or car or both, if you press turbo at the end you can actually fly.",
            "review_score": "-1"
        }
    ]
}