{
    "app_id": 274900,
    "name": "Murder Miners",
    "release_date": "2014-07-25",
    "developer": [
        "JForce Games"
    ],
    "publisher": [
        "JForce Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Co-op",
        "Online Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "FPS"
    ],
    "achievements": 18,
    "positive_ratings": 4295,
    "negative_ratings": 818,
    "price": 0.79,
    "description": "The #1 rated Xbox Live Indie Game. Halo-inspired. Destructible/constructible environments. Vehicles. Zombie survival. Hookshots. Infection mode: Be the zombie &amp; eat the dead to level up your zombie abilities. We host 30-player games every week. Join us!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/274900/header.jpg?t=1549902509",
    "minimum_requirements": "OS: Windows Memory: 1 GB RAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 250 MB available space Additional Notes: In order to run the game, you'll probably need one of the following graphics cards or above: ATI Radeon X1300-X1950, nVidiaGeForce 6 et 7, Intel GMA X3000 series",
    "recommended_requirements": "OS: Windows Memory: 2 GB RAM DirectX: Version 10 Network: Broadband Internet connection Storage: 250 MB available space Additional Notes: In order to run the game, you'll probably need one of the following graphics cards or above: ATI Radeon X1300-X1950, nVidiaGeForce 6 et 7, Intel GMA X3000 series",
    "reviews": [
        {
            "review_text": "Get a blender. No, not that blender. A cool one, with holographic lights or something. I don't know man, duct tape Christmas ornaments to it. There you go. Now go grab your Halo collection. Yes, all of them. No wait, put Halo 4 back. There you go. Now dump 'em all in the blender. Okay, grab Minecraft. What? No, that's Terraria. Grab Minecraft. Okay, that's Yogscast Adventures, and that game doesn't even exist. Grab. Minecraft. Okay good, now throw that into the blender. Turn it on. No, no stop fiddling with the buttons. On. Turn on. Yes, it's plugged in, turn it on! It's on? Okay, good. Let that sit for a minute. Mmm, tasty right? Grab a glass. A... plastic cup? What is this garbage? I said glass, man. Glass. Okay, that's a bowl, and now you're just screwing with me. Thank you, a glass. Pour the holy combination of Halo and Minecraft into that glass. Okay, well, you spilled some on your shirt, but hey, we all make mistakes. Go to your computer. Open the disc tray. Okay, that's a waffle maker, not a disc tray. Is the disc tray open? Okay, put the cup in it. See? It's like a cup holder. Close the disc tray. Is it working? Okay then, have fun!",
            "review_score": "1"
        },
        {
            "review_text": "In Murder Miners you play as Murder Miner, a miner whose mission it is, is to murder every other miner.  The plot is rather dense and requires quite a lot of exploration to really appreciate it. You'll find yourself in areas with miners AND murderers in this thrilling romantic adventure opera of murder mining.  The gameplay is great, as it offers both the ability to murder AND mine.  I think however my favourite thing about Murder Miners is its atmosphere, you really lose yourself in this game's themes, which mainly consist of bloody horror involving murder, and deep underground immersive areas with remnants of mining.  Overall, I would rate Murder Miners.",
            "review_score": "1"
        },
        {
            "review_text": "*note* I've played this for like 5+ hours but my 'hours played' thing glitched for some reason.  PROS: -Generally friendly community -Very tight gunplay -Grappling hook is a nice touch to combat -Infection mode alone is a decent enough reason to buy this -Detailed colour customisation for your character  CONS: -Really tiny community (8-15 people online at a time on PC) -Not the prettiest game around -Not worth $5 in my opinon (so get it for 99c while you can) -Deathmatches can be a bit difficult for newer players -There is this one player who is a regular named GET_GOOD, he is a ♥♥♥♥♥♥ and swears at everyone through chat and tells them all to 'get good'  SCORE: 7.5/10 would recommend for 99c.",
            "review_score": "1"
        },
        {
            "review_text": "Everything that Brickforce wasn't",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Halo/Ninjaish feel Active community MML (Murder Miners League) Noobs dont know how to overjump/triplejump/double jump  Cons: Play too well get kicked because the host is a jealous ♥♥♥♥ Barely any CTF/MurderMatches/TDMs All the 7 year olds play INFECTION/Zombie survival INFECTION INFECTION DID I SAY INFECTION? INFECTION? INFECTION ",
            "review_score": "1"
        },
        {
            "review_text": "I dug a hole into the ground and hid from zombies while people called me a camping loser, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "TL:DR You can use a grappling hook to take a man out of his helicoptor, punch him to death, steal the helicopter, and kill 30 zombies with flaming rockets where zombies can not hit you and Halo Spartans can shoot at you. Hope they don't have grappling hooks.  This game is amazing. The graphics are a bit poor, but there are many gamemodes, amazing weapons, lovely vehicles and mechanics, sick maps, and just an all around quality game for 2 dollars. ♥♥♥♥ lunch at Micky D's, get this game.  Final Verdict: Buy if you have any interest at all.",
            "review_score": "1"
        },
        {
            "review_text": "What are you doing reading this, for another (as of writing) 13 days this is £0.75, BUY IT NOW.  Seriously, this is the best cheap game anyone can buy, it is one of the few games on the xbox 'indie' store that is actually any good. It seems like a rip-off of Halo and minecraft (both inspirations for the dev), but it is more than that, it is one of those games that is more than the sum of its parts. The weapons in the game are extremely satisfying, more so than some major titles, each with its own character (my personal fav is the shotgun, which allows you to camoflage and become a stack of blocks). Combat is sound, not outstanding in its mechanics, but extremely fun and entertaining. The game has more gamemodes than you need, all of which are great (infection stands out), Users can make new maps and upload them for use, allowing (over time) for a nigh infinite amount of replayability, as of writing it has an active player base (within 5 minutes of hosting a server i had over 10 people), and most of this playerbase is friendly and helpful.  I cant say anymore as i do not want to ruin the fun, if your looking for a great game to play with friends, look no further than this, a 4-pack is only (again as of writing) is only £2.02, which is ridiculously worth it. Id be more than willing to pay £20 for this game, and its only £0.75 (£6.99 at full price), no other game will give you as much satisfaction at such a great price, ill see you in-game :)  EDIT: it says something about a game when the only negative reviews are for a lack of players, which has been fixed, and is on the rise.",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game on the Xbox and loving it, I couldn't wait for the PC port of it only to like it even more! This game plays like if Halo 1 and Minecraft had a child and was given a hookshot for it's fifth birthday.   I recommend this game to anyone who enjoys Halo 1 or Minecraft. ",
            "review_score": "1"
        },
        {
            "review_text": "Your character does a dance when you customise him.",
            "review_score": "1"
        },
        {
            "review_text": "This is good, old-fashioned fun. Simple as that.",
            "review_score": "1"
        },
        {
            "review_text": "Needs More players!!!!!",
            "review_score": "1"
        },
        {
            "review_text": " This game is fun sadly, the community is very toxic.",
            "review_score": "1"
        },
        {
            "review_text": "So, I saw this game on the store, and I thought it seemed kind of lame, because I'm not an FPS kind of guy, and it was cheap, and my friend was telling me that it looks bad, and so I decided to buy a 4 pack as a joke and gift to each of my friends. My friends started it up and we played and couldn't stop, it is really fun, and I really don't like FPS, my personal opinion, this is better than any of the COD games after COD MW2, and this is about as good as Halo 3 or Halo 2. I was really surprised at how enjoyable the game is, and I can't say that i regret buying it, I even went on to buy like 4 or 5 more copies after I bought the 4 pack, then got some more friends to buy it. I'm trying to get my friends to play a huge free-for-all. A couple things that I would Change however, is the game privacy system, and I would see about adding more weapons and adjusting the zombies a bit. My favorite thing is that my understanding is that the developers are a small group of friends and they came together to make a cool little game, which is what I have wanted to do for a very long time. I think the major companies take away a lot of the glory that little indie companies or groups don't get.     In short, I love the game, and it is on my list of top 5 favorite shooters.  It is like cocaine, you will get hooked, the only difference is that it isn't gonna kill you, unless you are in the game, if that is the case then you should think about respawning.",
            "review_score": "1"
        },
        {
            "review_text": "A seemingly simplistic yet fantastic game. It's main appeal is the easy stage creation which basically feels like everything a Lego game should be. (Don't kill me Minecraft fanbase. I'd rather die at the hands of someone less then 20 years younger then me).  The actual gameplay is simple enough to not have the many overcomplicated woes of modern FPS games, yet the appeal of the late 90s deathmatch games. Also, hookshots for us Bionic Commando fans. All 5 of us.  Its almost impossible to play a match of this game and not laugh for one reason or another. Either you're killing some adorable little soldier in some explosive manner resulting in their body flying followed by a cartoonish SPLAT effect, sniping their head off followed by blood gushing out, or just having an insane match with dozens of users with an odd number of asterisks in their usernames.  The best and worst social aspect of this game is the community. The users range from really fun to play with and lighthearted, to your typical 'THIS MAP SUCKS/YOU GUYS ARE CHEAP' type players who are usually the ones with 0 points. There aren't usually that many active servers, and there are even days where there will be just one game active, usually some bland textureless map with only pistols and swords enabled *Shudder* and everybody taking the game way too seriously. However, if you do start a server people WILL join. It can take 30 minutes or 20 seconds, but they will all flock in simultaneously.  If you buy this game, have a few matches to get used to it, but make sure to create some stages as well. The most relaxing thing in the world is to spend hours just making an awesome map.",
            "review_score": "1"
        },
        {
            "review_text": "You can dap your slick! Master Chef put his weenie in my trusty Steve and popped this game out of their Angus Sirloin Bheesechurger!",
            "review_score": "1"
        },
        {
            "review_text": "legitimately fun game, especially for 2 bucks. wish the community was bigger.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just awesome, like halo? then get this game 8/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Its is a great FPS!!!",
            "review_score": "1"
        },
        {
            "review_text": "I like it a lot, it needs some improvement, but I like it. I wish you guys would do some campaign mode, single player and co-op, it would be really nice if it was possible!",
            "review_score": "1"
        },
        {
            "review_text": "It plays a lot like Halo, and I love Halo. Just remember to turn off sprint though. Map making, classic arena-type gameplay, it's just a lot of fun. Could use some more tweaks and modability, but it's so cheap you may as well just buy it. It's Halo-like gameplay on PC for almost free.",
            "review_score": "1"
        },
        {
            "review_text": "Closest thing I can get to halo on PC...",
            "review_score": "1"
        },
        {
            "review_text": "Great game to screw around in!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game! Recommneded to all who like block,build up,kill and team up games ..",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, played it forever on X-box now i can play it on PC, im so happy.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics are meh but gameplay is amazing!!!!  You gotta love halo  You gotta love the sprinkles of minecraft  You gotta love dat apocalpse  You gotta love dis game!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Hey, thats pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "It is AMAZING!  Downsides (while not making the game worse, they make the game better, but more frusturating) : Zombies too fast Zombies too op No way to easily tell where zombies are, radar is confusing as balls though  Downsides (that make the game worse) : There are different spawn rates in different maps, different rooms and it's easy to find a place where zombies always spawn so you can get a huge kill streak Some maps are GOD AWFUL, different spawn rates in different rooms, some have zombies spawn ONLY IN 2 ROOMS, not needed rooms etc.  Good things :  The game is amazing I don't have words to describe it Stop reading these reviews, borrow 2 bucks from your mom, go to the bank and transfer it to your steam account, then buy and play the god damn game, don't think it's bad off of the start, you need to play it to get into the zone",
            "review_score": "1"
        },
        {
            "review_text": "Pretty standard, generic weapons and gameplay, but it's fun nevertheles.  Server are low populated, but there're several games anyway.  Runs amazingly well even on a 7 yo gaming netbook.  Got it for free, but I would recommend it even at full price.  And no, it's not minecraft clone.",
            "review_score": "1"
        },
        {
            "review_text": "Lot less variety than Garry's Mod or Minecraft, but a lot easier on your computer too. If you just want to tear up or build up the map and fight zombies but not deal with being an engineer too, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Edit: Oh wow, the developers of this game reply? Thats awesome! ^_^ Im glad you took the time to shed some light on the issue. I'll try to join in at the time you're hosting the playdate :)  Major Re-Edit: After noting what the developer has said, i was able to find people during the day from an oceanic spot. Most modes were empty but the most popular ones were infection and murdermatch *merciless killing without teams*  The weapons in the game have a certain feel that make them enjoyable to play, you are given: swords, machineguns, pistols, mining weapons, snipers and shotguns to brutally murder your friends and zombies in the infection mode.    You are able to find people who are playing every day. Go out, by yourself a 4-pack give it to your all friends and make one big party and play.   Pfft...it sure beats COD, on a side note, theres a COD Nuketown re-make map just for you COD Fans &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "To be honest this is really fun but the player base seems to be low It really needs more players great buy at 94 cents.  to nitpick on one thing that bugged me the control options are not really redone for pc so mouse sensitivity is still listed as X and Y axis other then that the game is fine   Final score 4.9 outta 5 very good game it plays like a halo minecraft hybred.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, I just got this game for pc. However, I have owned the xbox version since it came out. This is a great game. For the price, there is just so much to do. I highly recommend this game to anyone. This is the type of game that I can always come back to. I know this review is short, but so is the average attention span of most people who scroll through these reviews lol including myself and this is my frist review.",
            "review_score": "1"
        },
        {
            "review_text": "(This review will be slightly biased.) A FPS that combines elements of Halo with Minecraft, this game contains single player and online mulitplayer. This game was also my first indie game purchase, and opened the door to indies for me. So yeah, except bias. The game is mainly and most notably built for online play, although it does contain single player, the single player consists of mainly fighting zombie NPCs until you reach the score limit, in which case you win. Murder Miners's online play is where it truly shines. The gun play in Murder Miners is basic, but has its own simple charm. A good example of this is my own playstyle(#selfpromotion!) . Rush in towards an enemy, use a shotgun, and ram them, then fire the shotgun. If they're unprepared, they'll die instantly; if they're prepared, they'll use the sword and dodge you by flying overhead, in which case you're dead.   Now the servers are usually unpopulated besides two or three servers, but on weekend play dates the devs hop on and so do other players, usually causing quite a few servers to pop up.   So, do I recommend this game? Yes, I do.",
            "review_score": "1"
        },
        {
            "review_text": "WOW! What a shock! This game is a brilliant FPS and I recommend it to everyone!  At first I was reluctant to play it: it just seemed unoriginal and looked like it wasn't quality. I WAS WRONG.  This is one of the most action-packed, fun and unique FPS games I've ever played! Let's see what is so special... By using the shotgun's special ability, you can camoflague into the surroundings When holding down the attack button with the energy sword, you can hover and when you release it you go zooming in the direction you're aiming, meaning you cna basically dash onto the roof of a building or decapitate a enemy by zooming through their body There are giant, expansive maps for sniping and massive wars There are vehicles There are customizable characters You can get grappling hooks to climb high buildings It is possible to play zombie modes and even be a zombie, you can feast on corpses and gain levels which increase your stats There are actually people playing it, so you will find others to play with Heaps and HEAPS of fun with friends, I recommend playing with at least 1 or 2 to have the best experience Did I mention destructible environments?  Long story short, this game is pure magnificence. Don't let looks be deceiving, this is so much fun to play. I even bought my friend a copy and we spent almost 2 hours playing and still didn't get bored. I HIGHLY RECOMMEND this game, and it's DIRT CHEAP! Pick it up, NOW! DO IT! STOP READING AND GO BUY IT!",
            "review_score": "1"
        },
        {
            "review_text": "I went in completely erect and horny, but i came out flacid 1/10 does not keep my boner going  In all seriousness, its really good to spend a few hours or so on, but its definately not the best.          still better than CoD AW tho",
            "review_score": "1"
        },
        {
            "review_text": "First of all, I just got this game for pc. However, I have owned the xbox version since it came out. This is a great game. For the price, there is just so much to do. I highly recommend this game to anyone. This is the type of game that I can always come back to. I know this review is short, but so is the average attention span of most people who scroll through these reviews lol including myself and this is my frist review.",
            "review_score": "1"
        },
        {
            "review_text": "This game kicks ♥♥♥. If you dont have it get it!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Deserves more credit.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the most underrated Shooters on Steam. personally I think I should have paid more for it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much like halo that its basically the same besides the graphics. At the beginning when I saw the screen shots I thought it was minecraft first person shooter rip off but I decided to buy it because I was looking for a game to play. When I got on there were several game modes, you can even create you own map, and the gameplay was just like HALO! Halo has had a way of making their games fun and Jforce did exactly that. I would highly recomend this game to anyone because its just plain fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible. It is worth way more than it's one dollar price tag. I just got the game last night and it has been so much fun. Infection is a great game mode and the rest of them are amazing as well. It's a lot like Halo but I like how they put in some ideas of their own such as the hook shot, sword and the block tool. 10/10 master piece of video gaming. I really want to see what other games Jforce has made :)",
            "review_score": "1"
        },
        {
            "review_text": "  If Halo and Minecraft Butt ♥♥♥♥ed.",
            "review_score": "1"
        },
        {
            "review_text": "well worth the small price tag",
            "review_score": "1"
        },
        {
            "review_text": "Minecraft Meets CoD and Elements from halo Dear Ty~ Please put trading cards in this ^^ and if not, please include them in MM X :D 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I totally enjoyed this game on Xbox, now they have it on Steam? Life is great. :3",
            "review_score": "1"
        },
        {
            "review_text": "Played this during BETA, and man i am so happy to see it made it to the store, this game is very fun and has a nice touch of Halo's feel without over doing it and just being a copy of the game. I think it can compare to a lot of FPS's and creative games like minecraft. I would reccomend this game to all my friends as it is also very cheap, only costing about 5$. 11/10 would mine again",
            "review_score": "1"
        },
        {
            "review_text": "Great fun game for its price",
            "review_score": "1"
        },
        {
            "review_text": "Minecraft Meets CoD and Elements from halo Dear Ty~ Please put trading cards in this ^^ and if not, please include them in MM X :D 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game was so fun to mess around and have lots of fun. Overall a really great game to just have fun in. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Terrific fun. Way better than one would expect. Its an absolute steal for its price. Reminds me of classic games from the Xbox-PS2-GC era. Games like Timesplitters and Halo.  I highly reccomend Murder Miners.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. The main thing people hated from this game was that no one played it. But when i went on there was some many peole on the game.",
            "review_score": "1"
        },
        {
            "review_text": "Halo made out of blocks=Murder miners  Back when this game was just on xbox 360, it was the top selling indie game. I hope that it gets the attention it deserves in the near future because at the moment its very overlooked.  As a classic Halo fan I can recommend this to anyone who misses the old halo multiplayer style but it's not too similar to halo, you can build maps, destroy the environment, fend off zombies and much more. I hope to see more players soon.  It's cheap so its not like you're wasting much if you dont like it so just try it out.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "i downloaded this game because i like to look at cheap indie games and chuckle to myself about how bad they are but when i opened this game i had a blast of nostalgia it felt so much like halo a game i had long to play for so long but it also had its own unique element to it i love this game i would recomend to anyone",
            "review_score": "1"
        },
        {
            "review_text": "This game is VERY enjobable and fun at the same time",
            "review_score": "1"
        },
        {
            "review_text": "There are not enough words that can describe how good this game is.",
            "review_score": "1"
        },
        {
            "review_text": "everyone needs this game. right meow.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "LOVE IT BUY IT IT COOL!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun. It feels like I'm playing Halo but in a Minecraft world. And both games are incredibly good.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Extremely cheap and got a lot more out this game than I ever thought I would. Plenty of maps, gamemodes, matchmaking options and fully customizable playermodels. And my favourite part, the community ain't a bunch of ♥♥♥♥♥♥♥s!",
            "review_score": "1"
        },
        {
            "review_text": "Build maps and shoot people.",
            "review_score": "1"
        },
        {
            "review_text": "It's Halo. If you like to play Halo, then your choice is clear.",
            "review_score": "1"
        },
        {
            "review_text": "Super awesome game all around and I had this on the xbox 360 and the pc version is just better all around great pc port",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Extremely cheap and got a lot more out this game than I ever thought I would. Plenty of maps, gamemodes, matchmaking options and fully customizable playermodels. And my favourite part, the community ain't a bunch of ♥♥♥♥♥♥♥s!",
            "review_score": "1"
        },
        {
            "review_text": "Murder Miners is a facepaced shooter kinda (dont qoute me on this) like quake, unreal tornument, or like halflife multyplayer. The pros and cons of the game are very simple  Pros- faced paced shooter  -fun if you need something to do for 10 to 30 min  -Halo and minecraft feel  -easy to pickup  Cons-Graphics Stink(but i dont care but you might)  - only 4 or 5 servers daily with a total of around 10 15 people spread throughout the servers  -no worth full price, get it on sale overall though its a fun game and thats why it deserves a thumbs up. Sorry for spelling.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games ive ever played its like halo and minecraft all in one game you shoud get this game plus its so cheap its only 2 dollars",
            "review_score": "1"
        },
        {
            "review_text": "Fast-paced fun FPS with some random stuff added. You have a small selection of weapons, and you're limited to two per respawn. Ammo is limited, but enough bullets to pump into some enemies. A couple of gametypes. Basically, it's just a good old-fashioned 'bad graphics' [not a bad point] FPS. Totally worth what I spent. [81% off sale, haha]  Yes, this is just a skeleton of a possible full-fledged review, but I can't literally say anything more than such. It's fun, and I like it. Done and done.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let my few hours total on this game fool you, I played this alot on Xbox back then, when I found it on steam I was like ♥♥♥♥ YEAH. Awesome price for such a great game with great potential. The developer seems pretty chill and active as well. Bought 4 copies to share with my friends.",
            "review_score": "1"
        },
        {
            "review_text": "It's this nice blend of Minecraft and Halo 3. Destructable environment, good-enough selection of weapons, and multiple types of multiplayer. The hookshot works really well, and is undoubtedly the most fun thing in the game.  However the population of the game is fairly low. You can meet up with more people at a certain time on Wednesday for the group event (join the game-related group), but if you don't plan on playing with people on hump-day then, well, the spam is real.  Overall, I really like the game but the low population and sometimes odd net-code keep me from playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Deffinately the most fast paced shooter I have ever played. Good Controls, fast gameplay, good mapmaking, and of course, the well made hookshot. This is either one of my favourite shooters I have ever played or it is.  I give Murder Miners a 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "pretty fun made me kill myself 10 times  halo + minecraft had a great night but halo got pregnant then this came outa the ♥♥♥♥♥ the end",
            "review_score": "1"
        },
        {
            "review_text": "  Is the best game buy now",
            "review_score": "1"
        },
        {
            "review_text": "It's like minecraft and halo combined :^) sooper fun game, only if you're playing with friends though.",
            "review_score": "1"
        },
        {
            "review_text": "What ISN'T thereto like about this game?!  Other than the zombie AI being dead stupid but...  Still gets a Halo/10",
            "review_score": "1"
        },
        {
            "review_text": "pretty fun made me kill myself 10 times  halo + minecraft had a great night but halo got pregnant then this came outa the ♥♥♥♥♥ the end",
            "review_score": "1"
        },
        {
            "review_text": "i leik this one its not rhat fun cause im jewish and a special guys ok?",
            "review_score": "1"
        },
        {
            "review_text": "  The best hide and seek simulator.",
            "review_score": "1"
        },
        {
            "review_text": "See video review for full detail!           YouTube™ Video:  Rainbow Reviews: Murder Miners&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "2 dollar minecraft rip off how could you go wrong",
            "review_score": "1"
        },
        {
            "review_text": "  You could buy this for cheaper than a CSGO key honestly Valve step it up.",
            "review_score": "1"
        },
        {
            "review_text": "At first, I thought this game was a cheap ripoff of Halo and Minecraft- which it still is... but after I started looking around for games and getting to know how the game worked, I got hooked into this one server and I had lots of fun there. The people on the server were very friendly and cooperative. My teammates listened to what I had to say and were supportive of my ideas. I got bored and actually made a tunnel that went behind the other team's base so that we could take their flag and they wouldn't even know. My teammates and I took advantage of my idea and made it bigger and more discreet, and not a single person found out about it on the other team.   Even though the people are fantastic and friendly, there definitely is a lack of people playing the game. Servers were at a minimum- there were only 2 servers available and the server I was on only had 6/15 people at the time before it stacked up. What I noticed was, lots of people in the chat were saying,'Wow, I've never seen a server with this many people before.' which is a not a good sign for the game having full servers.   If you're wondering about the gameplay, it's almost near exact to Halo and Minecraft- except you can't starve and ♥♥♥♥. I'm personally not a fan of this game style because I don't exactly play Halo and Minecraft that much anymore. Anyways, combat seems fluid and you can get kills easy enough.   Definitely get this game when it's on sale, though. I only paid $0.99 for my copy instead of the $4.99 price tag. I think the price I paid is definitely a good price to pay considering the game is near-death in it's servers. Only 3 out of my 114 friends play this game, so zombie mode isn't really going to happen.   Overall, the game is nice and fluid, but the developers could have definitely worked harder on it. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "2 dollar minecraft rip off how could you go wrong",
            "review_score": "1"
        },
        {
            "review_text": "The best ♥♥♥♥ I've ever experienced. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I hate to have a nostalgia bias, but I reallly liked this game as it reminded me of PC games I used to play quite a while ago, like several years ago, like Ricochet and Quake. I got the game when it was less than a buck, and yes it was worth the price then. Now, it's still a great game, with a slight price tag. Did I enjoy it? 'Yes' would be an understatement. Would I recommend it? Not so much for the current price. Wait until a discount or Negro Friday or whatever they call it.",
            "review_score": "1"
        },
        {
            "review_text": "heck yeah! just like on xbox but better i've played this game when it first came out for xbox i was amazed on how fun it was (trust me if you look through the indie games on xbox half are crapy dating sims and the other half is riped off unfinished zombie crap) but this indie game has earend its place as one of the most fun indie games of all time i hidhly recommend this game 8 / banana-IGN",
            "review_score": "1"
        },
        {
            "review_text": "Is a really good game if you play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "good game got it on xbox and now i hav it on here its great What happens to a sycamore tree when u giv it asprin Its syca NO MORE",
            "review_score": "1"
        },
        {
            "review_text": "Looks cool :D",
            "review_score": "1"
        },
        {
            "review_text": "Play with friends or get booted",
            "review_score": "1"
        },
        {
            "review_text": "it awsome to play more and it fun thx you JForce",
            "review_score": "1"
        },
        {
            "review_text": "9/12",
            "review_score": "1"
        },
        {
            "review_text": "this game is good         I play it at night",
            "review_score": "1"
        },
        {
            "review_text": "oh this is good",
            "review_score": "1"
        },
        {
            "review_text": "Great game with more in it then you think.... 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game! I always have fun on whatever gamemode or server i play on.",
            "review_score": "1"
        },
        {
            "review_text": "It have a Halo more feeling then minecraft... Still you can build but there Halo minigames like Infections, Team Deathmatch and more!!! If you're not into Halo and only want this game cause it cheap and have minecraft blox then I don't recommand you to buy this as you can only build when you create your own match that people can join or that you play by yourself which is extremely boring! Get the game since it on sale and make sure to buy the 4pack so you can get this game active",
            "review_score": "1"
        },
        {
            "review_text": "Great multiplayer game with tight controls. Heaps of fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "halo copied this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is not terrible I would recommened it but it could use some work. I got this game from a friend, he bought the game and I didn't know what to expect. The graphics are blocky, not the best but I wouldn't judge a game by its graphics. There are very few guns to pick from they're not the best but the game is in devolopment. Playing any other game you would think that a sniper rifle would kill a hostile entitie with one shot which it does well in the head it does. The game is good but not the greatest I would love the developer to keep doing good. Also anyone who read m frist edition knows this is not the same but the developer sent me a message and I felt bad and thought my review was too harsh, i wold like to add that I played an older version and my game was a bit laggy.",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS GAME ",
            "review_score": "1"
        },
        {
            "review_text": "It's fun That's it",
            "review_score": "1"
        },
        {
            "review_text": "A good game with a mix of halo and a little minecraft. I would recommend this if you love halo, minecraft or both. Maps are great and you can create your own bases which is pretty cool.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I love everything in this awesome game, it's fun, addictive, and you can play with your friends! This game is awesome. I can't wait for murder miners x!! ",
            "review_score": "1"
        },
        {
            "review_text": "its really cool and fun get it",
            "review_score": "1"
        },
        {
            "review_text": "It's a good FPS.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game...Its really interactive and fun to play with friends..",
            "review_score": "1"
        },
        {
            "review_text": "&gt;lovely fluid gameplay  &gt;nostalgic graphics (im looking at you unreal tournement) &gt;easy to operate  however the problem is that the community is sooooooooooo small that at somepoints during the day you wont find a sever  9/10 would shoot a rainbow sniper rifle again",
            "review_score": "1"
        },
        {
            "review_text": "This game is a perfect blend of Halo and Minecraft, it's wonderful. To me it doesn't really feel like minecraft, the art style may look similar to it but it's not; if you love playing Halo this is the closest you'll get to a Halo experience on pc. But even then, there are some game modes that don't feel like Halo, there is a zombies survival game which can be extremely fun if the host of the game sets it up correctly. Although this game is very fun to play it's pretty much dead, it'd be great to see a massive sale on this game again and see a lot of players on this game once again. Like being able to buy 4 copies of the game for like $3.",
            "review_score": "1"
        },
        {
            "review_text": "Good fun, great price. Bring friends.",
            "review_score": "1"
        },
        {
            "review_text": "Its just so much ♥♥♥♥in fun! If you like any Halo games you owe it to yourself to play this.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this on xbox pretty soon after it came out and i loved it 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "For as little time as I have played, I've still come to love the game as if it were the best. It is not, however, but I'll get there later. Murder Miners is not so much a Minecraft-like game, however I do agree with the Halo-like arguements. This game is a shooter, through and through, so it is to be expected that the fun comes from the players, who can control the enviroment and game status throughout, which can potentially create some levity to the game if need be.That does not mean that all players will act that way, but there is the potential. Back to the best part I said earlier, this game is not perfect, but I can understand that. It needs major improvements, such as the awful hit detection in game modes such as Infection, but I like the game enough that I can wait for it to be updated and improved on the devs' time.  Overall, I'd say that this game is worth you however much, but if you crave content, bookmark this one until future updates.",
            "review_score": "1"
        },
        {
            "review_text": "Great! I LOVE THIS GAME it's very fun to build maps and play with friends also survive against hordes of zombies play this game NOW.... THE HELL ARE STILL DOING HERE BUY THIS GAME!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game and cost almost nothing! :) reminds me of halo! the pictures may look ♥♥♥♥ on steam market but the gameplay is fun! :) abosolute worth the 1 euro i used on it! :D",
            "review_score": "1"
        },
        {
            "review_text": "OP Sniper is OP Sniper. Alt-Fire is usefull. tentacles. bwaaaahhhh. blocks. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, its the most enjoyable game out there to me. and the community never fails to entertain me.",
            "review_score": "1"
        },
        {
            "review_text": "A good and fun time waster nothing more nothing less. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10, Like Halo, but with blocks.",
            "review_score": "1"
        },
        {
            "review_text": "Installed the game, couldn't figure out what the hell to do, deleted game, now I can't get it out of my game list - 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I bought this on xbox pretty soon after it came out and i loved it 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "  best game i ever played you never get lag unless your cheating in game just follow the rules for the ga,e and have fun while playing",
            "review_score": "1"
        },
        {
            "review_text": "When I bought this with some leftover steam account money, it didnt seem like a big deal and I uninstalled it after 20 somthing minutes. Then I got it for my Xbox Live account and IT WAS AMAZING! I loved every second and I play it all the time. It's a really good game and for so cheap.",
            "review_score": "1"
        },
        {
            "review_text": "After a bit more playing the game, I have concluded that it is good but could use tweaks, like the guns are way to powerful, now for the sniper and shotgun thats fine but everything else is way too strong and doesnt fit (I mean pistols should not be that strong) but i can find enjoyment in the game and the game does have fun maps. While I'm on the topic, a health bar would be helpful if JForce Ty takes the gun nerfing into concideration. But overall the game isn't that bad my original review was after 1 hour and i was on games with people camping. 4.3/5",
            "review_score": "1"
        },
        {
            "review_text": "Ok Game If You like Halo-Themed Games Its cheap so dont think your wasting your money :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, totally worth the purchase. Its like a mix of halo 3 and minecraft, which is a good thing! And also it runs on my laptop great too :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, especially for the price. This is definately a hidden gem. Vehicles feel pretty solid and not too overpowering. The weapons are fairly balanced, and the map making mode is pretty cool.",
            "review_score": "1"
        },
        {
            "review_text": "Its just so much ♥♥♥♥in fun! If you like any Halo games you owe it to yourself to play this.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Very few players though.",
            "review_score": "1"
        },
        {
            "review_text": "Zombie mod is so much fun!",
            "review_score": "1"
        },
        {
            "review_text": "Feels like Halo, which is pretty refreshing compared to most fps games. In fact, this could be the mashup of Halo and Minecraft, but more leaning toward the combat than crafting. Very solid, very fun, lots of features to discover. Get it when it's on sale, it's a good buy.",
            "review_score": "1"
        },
        {
            "review_text": "What do you get when you put Minecraft and halo together Murder Miners, my brother introduced me too it one day, i got obsessed with it,  (not in a bad way), Its a really good game, and its a pretty good game, for a bunch of indie developers Variety there isn't much of Variety of weapons you can choose from, It would be cool if there were, the program they created this game is very limited so its not its fault, its completely Horrible graphicy but its supposed to be like that because its Minecraft and halo together, The sequel is coming along and it does look alot better, ",
            "review_score": "1"
        },
        {
            "review_text": "Zombies can fly vehicles and zip around like spiderman Players can turn into blocks to hide Masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer lags me the f*ck out.",
            "review_score": "1"
        },
        {
            "review_text": "Fun Graphics may look a bit funky but then again it has awesome gameplay and features.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say; you get what you pay for :')",
            "review_score": "1"
        },
        {
            "review_text": "I keep getting kicked because I'm good at this game, so much so in fact that it upsets other players. What the ♥♥♥♥.  On the bright side, pretty fun gameplay and slick controls.",
            "review_score": "1"
        },
        {
            "review_text": "Note before looking at my gametime: I have played murderminers for about a year now on xbox and its the same game.  People often look at murder miners and they think: Ugh not another minecraft game.. But they are wrong. So very wrong. Murder miners is like the best parts of halo and the only thing good about minecraft (simple map desgins) and puts them together to make a game like halo with unlimited amounts of maps and a really good playerbase. People are moaning about no one playing but start up a public game and people join in no time and its got some competitve parts too it as well I definaty reccomend it but a tip: DONT USE THE MINERGUN AS A GUN ON TDM/DM/CTF/ANYTHING.",
            "review_score": "1"
        },
        {
            "review_text": "great game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, there is good points for this :  -it's funny -there is many mods -you can custom your character (colors and head) -good weapons and items (hook, minergun, sword, minigun, sniper, ...) -good maps -cost only 2€  But there is some points who ruin this game :   Not enough weapons Not enough maps NOT ENOUGH SERVERS ! :/  Too bad, it's a simplistic game...but awesome and cost only 2€ so i still recommend this game ! :3 ",
            "review_score": "1"
        },
        {
            "review_text": "This pleases me.",
            "review_score": "1"
        },
        {
            "review_text": "Since any recent HALO games are unavailable on PC this is what we have. It's worth it.    Pros",
            "review_score": "1"
        },
        {
            "review_text": "Sweet Game!! 10/10 Reminds me of Halo days.",
            "review_score": "1"
        },
        {
            "review_text": "it wont work on my laptop but i love that game",
            "review_score": "1"
        },
        {
            "review_text": "NOTHING like the trailer, but the game is OK. So I rate yes, but a little no. In a way, they copied minecraft with the blocks. Overall, it's 7.5/10 (maybe a little like the trailer XD)  Also, thanks JForce Ty for replying :)",
            "review_score": "1"
        },
        {
            "review_text": "at first i hated the game but then i played with my friends and it turned out to be the so funny :) we played the zombie game mode and there wasnt a boring moment!",
            "review_score": "1"
        },
        {
            "review_text": "I played it a little bit its okay.   Halo like game play, and decent graphics make this a decent shooter.   Con that needs to be pointed out is that this game isn't F2P.",
            "review_score": "1"
        },
        {
            "review_text": "yes jesus hello? someone took over your job and did better than you did.",
            "review_score": "1"
        },
        {
            "review_text": "10 outa 10 game its awesome",
            "review_score": "1"
        },
        {
            "review_text": "It is pretty fun. Awesome 1st person shooter. I like it better than call of duty xD.",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME EVER IF IT ACCAULLY WORKS NOW",
            "review_score": "1"
        },
        {
            "review_text": "Very fast first person shooter game. Very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Those who like the killing aliens and pvp aspect of Halo and the building/demoloshing the world aspect of Minecraft whould love this!! Clean port of the Xbox 360 edition, has a lot of maps (and counting...) and is so satisfying whenever you finally kill that zombie that just killed you for the umpteenth time.  Sad to say that those who are looking for a shooter with scopes on every gun will be disappointed, cause you can only zoom battle rifles, snipers, and pistols. Hope in the name of holy hell your aim is good, or you might end up dead (or a zombie's snack.)  over 9,000/10",
            "review_score": "1"
        },
        {
            "review_text": "At first startup this game kind of puts you into a jarring 'customize your player' mode, but once you figure out what happened and start playing the game, you see just how far the rabbit hole goes. Or so you think.  If you want a game that crosses Minecraft with Doom/Quake-style deathmatch, this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty obvious this game is a small-scale and much less fun than Halo, but like Halo, it is suprisingly fun to play with and murder your friends. And the music (There is only one song on the Main Menu) is oddly satisfying to listen to. Overall, an okay game to play, but don't expect to come back to it anytime soon. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "This is Halo PC. Buy this game now. Don't let the graphics fool you, this game is solid and fun as hell.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Not bad it plays like halo and has a extensive builder to build maps in I could see alot of quality maps come from this game if time is put into it the map maker is quite tedious to navigate and build maps quickly    Is it a good shooter?  Definitly good multiplayer with friends well polished gameplay and a variety of gamemodes as well as the play dates mentioned below   Map making  Is alright could be better it takes some time to build simple buildings, structures etc",
            "review_score": "1"
        },
        {
            "review_text": "It's Halo 1 with sprint, map creation, and zombies (with grappling hooks). So, yes buy/play this game now!",
            "review_score": "1"
        },
        {
            "review_text": "This game is goood but the community is dead i go on the server browser the good  - has a 30 player limit instead of 20 player limit. - The game is built with XNA which is not an engine.(its a good port) -we will recive more updates more than xbox  -PC version has chat and now infinite fog distance.  negitives -The community is dead.(more people need to buy the game) -needs more weapons I belive.(i would think he would add more weapons (Like the DMR) -horde mode for me is very difficult mabye make an easy mode or medium or even insane   you make theese improvements you may attract halo fans to the pc :)",
            "review_score": "1"
        },
        {
            "review_text": "Halo and Minecraft crossbreed 11/10",
            "review_score": "1"
        },
        {
            "review_text": "The closest thing that we will get to Halo for PC, guys. );",
            "review_score": "1"
        },
        {
            "review_text": "  Friend of mine gifted me this. It was fun reliving the Xbox 360 memories until I started the game up and I couldn't see the menu background, character models, or weapon models. This game hasn't been updated in a year and there's been no progress update on Murder Miners X for 4 months. JForce wyd.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would look at stolen textures again  games ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Not my favorite game, but it's fine if you just want to play with friends,family ect.",
            "review_score": "1"
        },
        {
            "review_text": "How to win infection/zombie survival. Pick shotgun as main weapon and whatever you want as secondary. Hide in a corner, cloak even if you want to. Fill any zombies you see with lead. Finally, get booted because your too MLG pro for everyone else. EDIT: actually, it still may work for some but the best way to go is to stay in a group (and maybe stay in a corner cloaked with a shot gun  The game is very fun and pretty well balanced         YouTube™ Video:  Jontron - Best game [Takeshi's Challenge]&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "This game deserved much better. It's got decent gameplay, a map editor, and fun gamemodes, yet the community is damn near dead. I'd highly recommend it for like, private games with friends, it definitely evokes that classic local multiplayer feel that older FPS games used to give.",
            "review_score": "1"
        },
        {
            "review_text": "The keyboard controls hang a ton, the customization is okay, the guns all feel unique and the gunplay feels really damn good. However, in my experience, there are almost no people on the main gamemodes. I could only find a functioning server with good ping on the zombie mode. So if you want to try your luck, buy it on sale. It's not great, it's not bad, but I enjoyed my time on functioning servers.",
            "review_score": "1"
        },
        {
            "review_text": "This game is super fun if you are a Halo fan and you are salty that Halo Online isn't coming to any other country other than Russia. Definitely worth the dollar or two you pay for it.",
            "review_score": "1"
        },
        {
            "review_text": "Better than you'd expect",
            "review_score": "1"
        },
        {
            "review_text": "Amazing shooter with fluid gameplay and artistic graphics. anyone looking for a low priced party shooter should get this game.",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME EVER IF IT ACCAULLY WORKS NOW",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this game if you're good at shooters, because you will be kicked for winning too many times.",
            "review_score": "1"
        },
        {
            "review_text": "Good game much fun Will kill self 123/456 No server",
            "review_score": "1"
        },
        {
            "review_text": "Worth your money. Warning though, if you are good at this game, you will be booted a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty good",
            "review_score": "1"
        },
        {
            "review_text": "I originally played this game on xbox 360 before it was even advertising for steam greenlight. It is just the way i liked it back on 360. Gameplay is simple but entertaining and fast paced. The zombie survival can be suspenceful and it is always fun! i would definitely reccomend that you would buy this if you are looking for a casual and fast paced shooter!",
            "review_score": "1"
        },
        {
            "review_text": "Look, this game has ALOT of potential. If more people actually PLAYED the game, it would be great! But until more people play, buy it on sale. The graphics need tuning and the controls/gameplay can be confusing, but once you figure that all out, it's pretty fun!",
            "review_score": "1"
        },
        {
            "review_text": "I played this game for many many hours on XBOX. This is a great game and I'm glad it got greenlit. It needs a bigger community.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game that plays just like Halo; it has a regenerating shield system, melee lunging (when you press the melee button while facing an enemy, your character jumps forward to hit them), normal and sticky grenades, and vehicles. The destructibility of the maps lends a sense of wear and tear, as well as allowing for a bit of tactical burrowing or building if the server has destruction enabled. The weapons seem relatively balanced (except for the shotgun - that weapon is absolute crap), and the battle rifle hearkens back to Halo 2. Murder Miners offers the bare-bones multiplayer modes - Team Murdermatch (TDM), Murdermatch (DM), and Murder the Flag (CTF), as well as a very interesting Infection mode. In this mode, most players start out as normal characters, and they have to kill the randomly-chosen zombies. If killed by a zombie, players then join the zombie team. Zombies do not have any shields, but run faster than normal, have a one-hit-kill melee attack, and have a tentacle weapon that works like a grappling hook, pulling them towards surfaces and pulling players towards them. Whenever a player is killed by a zombie, their corpse remains on the ground for a limited time and can be 'devoured' by zombies to gain permanent speed buffs, health buffs, and tentacle / digging upgrades.   Because this game works using a voxel-based building system (think Minecraft with smaller blocks), users are able to create their own maps from scratch, block by block, and host them on their own, personal servers. This feature makes it so that the amount of maps available is limited only by the time and creativity of the user base. Naturally, this also allows certain players to make trolly or just plain bad maps, but these are fortunately thin and far in between.   Murder Miners isn't perfect, of course. There are a few bugs, such as broken spawns on some maps (usually user-made maps, the official maps are pretty well put-together) and occasional glitches through vehicles or walls. In addition, the game can suddenly begin to stutter and lag whenever there is too much destruction or too many effects at one time, even with a good PC; this only lasts a few seconds, though, and although it is very irritating, it isn't extreme enough to cause you to, say, stutter off the map or into somebody's grenade.  TL;DR:  PROS Plays like a Halo game Completely destructible maps Users can build their own maps in the map-editing mode Infection mode is awesome You can turn on zombies and infection during normal modes, creating a hybrid gamemode Pretty balanced Good community Active developer  CONS Some assorted glitches and bugs, including stuttering when too much is going on Vanilla gamemodes can get old after a while A lot of servers seem to have an issue with latency Player population has gone down; there's still enough to get a decent-sized game going, but not enough to provide you with a choice of what server to play on  Overall, a very fun game with a very good price. ",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this game is actually rather good. I switch between Call of Duty and the like, but this is refreshing. You can play any map you can think of (as long as you build it) and there are plenty of weapons and game modes. There are a few PC features I would like to see in the sequel such as more graphics options and a ping meter, but apart from that it's really nice.",
            "review_score": "1"
        },
        {
            "review_text": "  Fun fun fun It's very fun to setup a public server will friends than make factions and battle it out!",
            "review_score": "1"
        },
        {
            "review_text": "Its a great cheap fun game to play with friends. What is there more to want?",
            "review_score": "1"
        },
        {
            "review_text": "A game with a Title Properly made by people who can't make the letter J apparently.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game to send some hours on while ou have you CSGO Comp ban on, But there is a lot of lag when frags are thrown.  Dont even think about playing zombie mode, as it is AWFULLY made with wierd maps and hard to control zombies. Overall, I think it would deserve about 6.85/10",
            "review_score": "1"
        },
        {
            "review_text": "Halo and Minecraft crossbreed 11/10",
            "review_score": "1"
        },
        {
            "review_text": "The wall jumping make me vomit it even worse than your mom roller coaster  Also give me autism   10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun if you like fps with a little bit of minecraft and zombies invlolved. I reccomend buying this! Such a great game for such a great price!! ",
            "review_score": "1"
        },
        {
            "review_text": "Meh it's ok.",
            "review_score": "1"
        },
        {
            "review_text": "It's a ton of fun. Just wish it wasn't so expensive...",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic, dont look at the graphics. the important thing is that its fun and this game its really fun especially playing zombie, i had a lot of fun in there...for 1$ its worth buying it.",
            "review_score": "1"
        },
        {
            "review_text": "Murder Miners is a fun entertaining game that combines Halo and Minecraft! With classic game modes like: Capture The Flag, Team Deathmatch, Deathmatch and more! I look forward to any new updates on the game!   10/10 Greasy Burritos",
            "review_score": "1"
        },
        {
            "review_text": "very fun and it was free :D",
            "review_score": "1"
        },
        {
            "review_text": "halo X minecraft done right",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty good",
            "review_score": "1"
        },
        {
            "review_text": "worth every pennie",
            "review_score": "1"
        },
        {
            "review_text": "  It is absolutely fun, but it needs more people playing!",
            "review_score": "1"
        },
        {
            "review_text": "A cool game about cool guys in cool armour doing cool parkour while fighting cool zombies while doing parkour while chatting with awasome devs     10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "halo X minecraft done right",
            "review_score": "1"
        },
        {
            "review_text": "i played the ♥♥♥♥ out of this on xbox. 10/10 best memories",
            "review_score": "1"
        },
        {
            "review_text": "If quake, halo and sanic had a crack baby this would be it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is exciting!!!!",
            "review_score": "1"
        },
        {
            "review_text": "A lot of things in this game are handled client side and lots of people play from foreign countries so expect to die a lot to invisible enemies. Large amount of people hacking with no knockback and infinite shield. Have fun.",
            "review_score": "1"
        },
        {
            "review_text": "Great game loads of modes and good guns, but hardly any players anymore. When I first played almost a year ago there were more servers up. I encourage people to buy this game and host servers.",
            "review_score": "1"
        },
        {
            "review_text": "I liked murder miners i would recermerd it because I have played it for 150 hours ",
            "review_score": "1"
        },
        {
            "review_text": "This game needs more love! Its Very Welled designed and Balanced very well. the only problem i have is this. -Why Does the Shotgun get a Headshot Counter",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly funa nd easy to pick up",
            "review_score": "1"
        },
        {
            "review_text": "This is both fun and cheap. Glad I could get such a good deal. It's a nice game, though the graphics are kinda weird. But then again, it was only like a dollar, so....",
            "review_score": "1"
        },
        {
            "review_text": "nobody plays it and the only funi got was from having flying shotguns but that is fun um well am gonna give it a secand chance so yea",
            "review_score": "1"
        },
        {
            "review_text": "Even though it is a minecraft-ish looking game, its is still really enjoyable! the guns are nice to use and the overall gameplay is smooth. Good work devs!",
            "review_score": "1"
        },
        {
            "review_text": "Fun and cheap cool times with friends",
            "review_score": "1"
        },
        {
            "review_text": "Allows you to eat. I haven't gotten up in 6 days.",
            "review_score": "1"
        },
        {
            "review_text": "Game's pretty good, requirements aren't crazy and you get a lot for your money. Workshop helps a lot when you get tired of the maps that come with the game.  Specially fun while playing with friends, it has different game modes to try out.  Gotta love how weapons have different special attacks (Shotgun FTW!)",
            "review_score": "1"
        },
        {
            "review_text": "110% worth it. Even if you only find it fun for a few hours, it's still only a dollar. The community is alright and although the servers are usually somewhat empty it's not too hard to find a match. The visuals are simple yet effective and the guns feel alright. However, the sniper feels unbalanced, and sometimes it is a little buggy and relatively unoptomized. A great thing about the game is that there is no option to purchase in-game cosmetics and your character is fully customizable without need to by anything. My biggest complaint is the lack of options involving zombies and the lack of some options in general.   TL;DR Halo with Minecraft elements, def. worth the dollar it costs. Support the devs who are working hard and actually care about the game.",
            "review_score": "1"
        },
        {
            "review_text": " Sadly, this game does not have:  - Anti-hack security. - A good community. - Original concepts (Vehicles are original, but weapon mechanics are the same ones from Halo CE and Halo 2) - Good framework response. - Better...names. (Seriously, putting 'murder' in every gamemode is not promising)    I'm not stopping you. Buy it if you want.   You'll get surprised with the load of bullcrap it has inside.    Wrapping this thing up: Murder Miners is a copy paste of Halo CE and Halo 2 mechanics with few original concepts and lacking complexity.",
            "review_score": "-1"
        },
        {
            "review_text": "Can someone return 0.5 hours from my Tiny life pls?",
            "review_score": "-1"
        },
        {
            "review_text": "Uninstall button was the greatest experience.",
            "review_score": "-1"
        },
        {
            "review_text": "Gameplay - Horrendous Framerate - Below Average Controls - Reasonable Graphics - Good Difficulty - Very Easy Sounds - Average Story - There isn't one  Fun Factor - 2/10   ",
            "review_score": "-1"
        }
    ]
}