{
    "app_id": 275180,
    "name": "Costume Quest 2",
    "release_date": "2014-10-07",
    "developer": [
        "Double Fine Productions"
    ],
    "publisher": [
        "Midnight City ",
        "Majesco Entertainment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Casual"
    ],
    "achievements": 18,
    "positive_ratings": 496,
    "negative_ratings": 72,
    "price": 10.99,
    "description": "A sequel to the popular Halloween adventure from Double Fine Productions!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/275180/header.jpg?t=1538670107",
    "minimum_requirements": "OS: Windows Vista Processor: 1.8 GHz dual core CPU Memory: 4 GB RAM Graphics: 256 MB GeForce 8800, Radeon 3850, or Intel HD 3000 Graphics DirectX: Version 9.0c Storage: 1500 MB available space Sound Card: DirectX Compatible Sound Card",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Core 2 Duo at 2.2 GHz, or AMD Athlon 64 at 2.2 GHz Memory: 4 GB RAM Graphics: 512 MB GeForce 220, Radeon 4550, Intel HD 4000 Graphics DirectX: Version 9.0c Storage: 1500 MB available space Sound Card: DirectX Compatible Sound Card",
    "reviews": [
        {
            "review_text": "Very similar to the first Costume Quest which is good for the most part but I found it getting repetitive after a couple hours. Removed the post battle healing and force you to backtrack to a water fountain to heal waaaay too frequently which can be a pain in the ♥♥♥ in unfamiliar territory. No maps provided of new areas unless you buy it. Even with the map there is no indication of your current location. Battle stamps (passive upgrades) have been removed and a new buff system using Creepy Treats cards as in battle items takes their place. Fairly entertaining story but I preferred the previous Costume Quest.",
            "review_score": "-1"
        },
        {
            "review_text": " Costume Quest 2 PC Review     Summary/Overview",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't played the original Costume Quest, check that out first. The game plays pretty close to the original. The game isn't really hard and anyone should be able to pick it up and enjoy it. The costumes in this version are memorable and none of them repeat from the original unless you pre-ordered or they release the DLC. I thought the storyline in this met my expectations of a sequel. You play the kids from the original and they time travel to stop an evil dentist from destroying Halloween. This time both the brother and sister are teamed up. You still have to make a decision in the beginning on which one gets the dialogue throughout the story though. I recommend picking it up if you liked the original a lot.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the first game you should like this one because it is basically more of the same. The only thing I don't like about this one are the timed attacks in combat. It reminds me of Super Mario rpg and that was about the only thing I didn't like in that game. It's fine though I guess but one other thing that bothers me is that combat takes a long time because you have a follow up attack on each attack that you can do, enemies have a lot of hp, and all attacks from you and the enemies take longer than in most games. Although I wish combat was quicker, it isn't too bad, especially since this is the type of game you only ever really play through once. I like the first game better because it seemed like it had more detail to the story and the world. This one seems to be a toned down version of the game, but it is still a fun game in its own right. Some of the reviews I've seen didn't like this game for whatever reason but like I said its basically about the same formula as the first one.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Incredible. This successor to Costume Quest is simply amazing and does everything right which the first game didn't (Skippable cutscenes and battle intros, Sprinting with every costume, etc.).   The storyline is actually a bit weaker than in the first game, but the improved gameplay makes up for that.",
            "review_score": "1"
        },
        {
            "review_text": "A group of youngsters face a future without Halloween after an evil dentist steals a relic which allows him to drastically alter the future by allowing monsters into the human world. These monsters live off the currency of candy, something that is now illegal for humans to consume. Desperate to save Halloween and prevent the dentists version of a utopia coming to fruition, the crew goes back in time (and then to the future, and then back again?? and then the future once more... and then... kinda jump between the two a couple more times trying to unlock that freaking solar system costume) and save Halloween using the only logical method of attack... turn based combat!  Double Fine have a habit of making charming games that I love. They aren't perfect (except Psychonauts which literally is perfect and when I die I hope to be buried with it) but what they lack in one area they will more than make up for in story telling, character development and humour. I found that I take more screenshots playing Costume Quest games and DLC than any other game. Everything just looks gorgeous, not like a new AAA game where you can see every speck of dirt on the lead characters face, as he walks in a rain, with a lightning storm in the background and great lighting effects - no, not that. It's gorgeous because it's colourful and engaging. The world, be it cartoony, feels real.   Honestly, I enjoyed the original more than the sequel but it's still worth playing if you're a fan of their work and want to support the developers. If you are not a fan or know nothing about Double Fine or their games, I would recommend starting with the original.",
            "review_score": "1"
        },
        {
            "review_text": "The changes that Costume Quest 2 brings are evolutionary rather than revolutionary, but they're also on-the-whole smart and serve to make it a more well-rounded experience than the original, if a little less surprising.  Changes to the combat are largely successful - damage types, combo attacks and the trading cards all make things a little more interesting and varied than it was before, providing more meaningful decisions in battles. It's not deep by any means, but it was enough to sustain my interest over the 6 hours or so that it took me to see the end. It was also good to see special meter retained between battles, although the retaining of damage between battles mainly just provided a chore of going back to water fountains regularly to recharge. Luckily, there's pretty much always one nearby.   Elsewhere the game has all the charm we've come to expect. A graphical uplift makes the already lovely, stylised visuals even sharper, and the time-travelling plot provides opportunity for a wide variety of locations. Peter McConnell is back for the soundtrack, which stood out to me as one of his finest, with the themes in the past area making particularly fine use of slide guitar.   The humour is endearing rather than uproarous, which suits the tone of the game well. It would have been nice if they'd had a budget for voice acting, as I'd love to hear this world come to life in that way, but we can't have it all.  Over all, a highly successful sequel which doesn't do too much to the formula, but makes smart changes where it can and doesn't overstay its welcome.",
            "review_score": "1"
        },
        {
            "review_text": "Costume Quest 2 feels exactly the same as the original game, which is not a bad thing if you're a fan of the original. The sequel continues the story where the original game left off with the same characters. The sequel did not have the same Halloween vibe as the first one did for me, which made going through the game not as enjoyable as I wished. If you enjoyed the first one it's worth playing the second one, however if you could barely get through the first one then I would recommend avoiding the sequel. Overall, it was pleasant to see the Costume Quest storyline continued in a sequel however it does feel like a large expansion pack rather than a sequel on its own.",
            "review_score": "1"
        },
        {
            "review_text": "There are new cool costumes, and the characters and story are still awesome. The problem is that now you don't have auto heal after battles. Walking back and forth from save points is a little bit annoying. The cards are now to be used in battles, they are not equpments anymore. And all the costumes have the same quick time events in order to land a good attack or defend. I really wanted to like this game, but it was pretty disappointing after such a great experience on the first game.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm going to be perfectly honest; this game took me a while to warm up to. The original Costume Quest was one of my favorite games of all time, so the changes that were made to gameplay weren't all that welcome at first. As I played the game, though, and let go of my prejudice, I discovered a really great game with a cute story and some really cool mechanics. While I'm not sure it surpasses the first game, it does serve as a good continuation of the Costume Quest tale. While I may have gone into this game shy, I had grown to thoroughly love it by the end. I have a feeling I will be playing through it every Halloween along with the original and Grubbins on Ice, and I'm really happy to have it in my collection.  Pros: +Really cute story, with well-written characters and an enjoyable story arc +Picks up right where the first game and DLC leave off. The continuation feels nicely organic. +Costume upgrades were a nice touch, both in how they improve the costumes and the physical changes that occur +Classic Double Fine humor +The musical score fits really well with the game, and functions better in places than the original in my opinion +All characters can use the skate shoes now +Some of the new costumes are simply fantastic +Candy Corn  Neutral: =The game can be short if you don't explore endlessly or grind for candy and experience =The game bosses seem underwhelming compared to the first, and don't put up much of a challenge =Somewhat requires you to have played the first game and the original DLC =The new Paper Mario style combat is a wild departure from the first. I think I preferred the original combat as the different costumes required different combat quick time events, but the combo system in this version is welcome.  Cons: -The new Creepy Treat card mechanic isn't as much fun for me as the old battle stamps -You no longer auto-heal after combat, meaning you're always running back to a fountain to heal. There is an option to eat candy to heal instead, but it never seems worth the cost until after you've bought everything you can. -No bobbing for apples game",
            "review_score": "1"
        },
        {
            "review_text": "Great!",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion not as great as the first one. Some improvements, but some drops.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game so much! its cute and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Cute and fun! I play this and the first one every October. Love all the collectables and the new costumes.",
            "review_score": "1"
        },
        {
            "review_text": "Costume Quest 2 is a light hearted turn based fighter, rpg.  A great sequel to the first, the worlds are much more developed and the story arch is rather well done too. Combat mechanics have been expanded but are still familiar and easy to master, cards replace battle stamps and their artwork and abilities are rather good too. Nice amount of humour laced into the dialogue and animations, on top of one of the best themes of all, Halloween!",
            "review_score": "1"
        },
        {
            "review_text": "Bottom line: Not as good as the first in terms of battle stamp usage and constant heart healing as well as a few minor bugs here and there (during exploration I got stuck in part of the Bayou woods my character somehow pushed into and had to reset), but definitely a worthy play through if you were a fan of the 1st. Still the best Halloween centered game series (if not the only) around!",
            "review_score": "1"
        },
        {
            "review_text": "A fun, if short, game full of Double Fine charm. If you like the first game you'll enjoy this sequel.  Personally I feel the first one is better and more charming.",
            "review_score": "1"
        },
        {
            "review_text": "Since I've bought it I have been soo excited to play it! Finally I've played it and finished the game and LOVED IT!  It improved so much from CQ1 and I had so much fun!!! :D I love every inch of it! Colors, graphics, plot, quests, costumes and candies!!! :D  It has 1 thing similar to CQ1 I was wishing to be different and that is.. I wanted to go back after winning the game, I mean, after winning the boss battle and open the game next day, I don't want to appear before the final boss batlle. I wanted to appear after I won and had a portal to go back to every place I've visited before.   But above all is my favorite game of the year!!! :D Can't wait for DLCs pleaseee I need some witch and dracula costumes please! YAY!",
            "review_score": "1"
        },
        {
            "review_text": "Decent sequel to Costume Quest.   It's a bit of a mixed bag, some gameplay elements are refined (and some even improved) but the dialogue writing just doesn't reach the original.",
            "review_score": "1"
        },
        {
            "review_text": "Love the first one.. this was just as good!",
            "review_score": "1"
        },
        {
            "review_text": "Right, now that I finished the game. Time to give my impressions.  So, would I still reccomend this game? Yes. And here's why.  As I have mentioned before, the combat is been reworked a little, so instead of function selections it's actually QTE button attacks. But there is a bit more variety than I first mentioned. Not a whole lot, you can double attack and counter (if you can time the counter right). But it still makes a faster pace to battles.  The Battle Cards replace the Battle Stamps and Creepy Cards, you use the card like items in battle, which takes up one turn. You can have up to three for selection at battle, and they take a number of battles to recharge (you can cheat this by restarting the game). The cards vary from 'Enemy takes his own damage', to 'Double Candy from Battle', to 'Get healed 25 percent of your health for three turns' etc. You get these cards by drops, buying, chests, and trades.  As I said before, the area's are expanded out quite a bit, but there is only two hub worlds you can play in. But that's not bad though, there are big maps, and one would take up nearly 3 area's. Exploration are well done, but near the end the game curves paths to more straight lines so it's easy to get to chests, kids, or quest items.  Speaking of quests, not too much to offer. If you played the first one, you'll know what to do in the second one. If you haven't, it's mostly talk to this person, use this costume to find clues or get to new area's, play hide n seek.  Story is alright. It's nothing to write home about, but it doesn't have to be. It made me chuckle and that's what I expected.  And that's what I think of this game really, it's expected. I'm rather glad most YT'ers are sorta overlooking this game, they probably would have chewed it up by the changes since the first one was very charming, and thus it will give them time to look at it for what it is and not what they want it to be.  If your still on the fence, I would recommend a sale then, at least 30 percent off. But as it being of Double Fine's first sequel ever? I think it's alot better than I would have first though. Give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Great follow up. Any fan of Double Fine or Costume Quest should grab this. Cheap as I am, I bought it on release date @ full price - no regrets!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. I've played the first one and the expansion of it 4 times, I love that the villian is a dentist. and that you can play as candycorn. I highly recommend this game, but you really should play through the Costume Quest 1 before you play this one. My only complaint is that when you get out of a battle, you are not healed so you have to go all the way to the beginning of the map to get a drink from the water fountain.  8/10 _____________________________________________________________  Edit: When I first bought this game, you couldn't eat the candy to heal. I think that is just genius, so I am changing my review.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "I've played both games now and gotten 100% completion in both. Overall I enjoyed 2 on it's own merits, but I feel it is a lesser outing than the first. The change in both the battle system and the cards was unwelcome. I'd much rather have passive abilities i can choose and stick with than having to constantly juggle the 8-9 useful cards constantly. Real pain when you forget that a good card is off cooldown.   The super secret is kinda neat and you'll feel pretty awesome if you figure it out yourself.   The overall story was short (I did 1 playthrough, and got everything in that one playthrough and did it in 9 hours) but was well written and funny.   I'd have to say try it but don't go into it thinking it would be like the first. It's not. Worthwhile on it's own but lacklustre compared to the original.   Also thinking a sequel might help a bit, least for lengthening playtime, more achievements and maybe fixing the battle system? Granted not sure where they could take a sequel, but I think Double Fine could find a way.",
            "review_score": "1"
        },
        {
            "review_text": "Just as fun as the first one!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, just like the first costume quest except on this one you have to run to a fountain to heal after almost every battle. That can be a bit of a pain but its managable, not such a pain that I wouldnt recommend the game. If you are a fan of turn based RPGs or a fan of Double Fine this has that distinct charm of their games. The price is right, so get it.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! I loved it.",
            "review_score": "1"
        },
        {
            "review_text": "An awesome RPG with cute holloween theme style. Hope for more.",
            "review_score": "1"
        },
        {
            "review_text": "I adore these costume quest games, I played the 1st and 2nd and I replay them fairly often. It’s simple, cute and all around fun.",
            "review_score": "1"
        },
        {
            "review_text": "Kiiiiind of inferior to CQ1 but still good? I have no major complaints but there was also nothing I absolutely loved. I just kind of slogged through it before Halloween 2015.",
            "review_score": "1"
        },
        {
            "review_text": "Costume Quest 2 the follow up to Double Fine's Costume Quest released in 2011. I was excited when I saw the announcement for this game and bought it the moment I had the money. Costume Quest 2 brings you back in the shoes of twin siblings Wren and Reynold, it appears the game leaves off right after the first game, like the previous title this game revels in a lot of clever humor and a decent storyline. One part this game falls short at though is it feels far too short to be a full title, it feels more like a DLC in length one can beat the entire game just going start to finish in about six hours. Although I do recommend this game I recommend getting it at a discount.",
            "review_score": "1"
        },
        {
            "review_text": "Great sequel, expands everything about the first game, good fun times. Has one of the best credits i have seen. Played with a smile all the way through. Go for the Hardcorn mode achievment, it's very funny.    Candy Corn can't control what the media says about him  ",
            "review_score": "1"
        },
        {
            "review_text": "Just finished the game.In short, this game has a personal style.  Strongpoints: -The story is simple but the details are intricate.The past causes correspond perfectly to the future ending. -And one thing interesting about a time travel is that you have many possibilities to reverse the whole story. That inspires me to move on and hold on, though some quests &amp; acheivements are miserable to complete. -The graphic style just like CQ1,I like it very much. -And I also love the music in CQ1&amp;2.Whenever you guys release a soundtrack I will definitely buy one! -Comparing to CQ1, this game makes NPCs much more alive &amp;humorous.Alway enjoy talking with them!And quests need you to do that!Or you will miss some quests,espeically the solar system costume.  Shortcomings: -Some quests &amp; acheivements are miserable to complete. -Sometime battle speed &amp; waiting the door to open run slowly when I use my laptop to play it; -Some costume are interesting,but others just look like those old ones in CQ1 with different surfaces. -Can not avoid the repeated quest &amp;story pattern in CQ1.The secrect's idea is new,but it is boring sometimes. -It has a much more complex battle system&amp;cards usage,so it takes me a lot of time to get used to. But you don't have to use cards to win the final battle,so what's the meaning of cards?(except collection)  Rating： 7/10  I love this game&amp;Iook forward to CQ3!Hope CQ3 has a obvious improvement. ( CQ2's DLC is also welcomed :)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much a repeat of the original Costume Quest, but I still had a lot of fun playing. I think it would have been interesting to have story line choices incorporated in so the player isn't just battling and collecting cards. I really like the story, so making character decisions would have been more fun I think.",
            "review_score": "1"
        },
        {
            "review_text": "  DISCLAIMER: This is a full review, and NOT a first impressions review like all my other reviews, if you want a better full review, then please read better reviews then mine",
            "review_score": "1"
        }
    ]
}