{
    "app_id": 275200,
    "name": "Westerado: Double Barreled",
    "release_date": "2015-04-16",
    "developer": [
        "Ostrich Banditos"
    ],
    "publisher": [
        "Adult Swim Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Western",
        "Pixel Graphics",
        "Indie"
    ],
    "achievements": 79,
    "positive_ratings": 1198,
    "negative_ratings": 110,
    "price": 10.99,
    "description": "Westerado: Double Barreled. When your family is murdered by a mysterious desperado, you set out into the world to take revenge. Take control of your own fate and that of others, all using your trusty shooting iron.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/275200/header.jpg?t=1447360194",
    "minimum_requirements": "OS: Windows 7 Processor: Dual Core 2.4 Ghz Memory: 2 GB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Westerado: Double Barreled is a top down, open world shooter where you play as a man who (light spoiler)    has his family murdered by a random desperado    in this western world. The thing I love about this game is its open world nature, and your ability to kill anyone at any point. This ads a lot of variety to an already varied world with lots of things to do. You can do bounty quests, kill random people for money, and even play a few(or many) hands of poker. The world is so varied, and has a vast array of side quests. It reminds me of something like Morrowind, where you can kill any character at any time and it can impact your story. To show an example of some variety, I'm going to tell part of my adventure in the next paragraph. It will contain some spoilers, jump ahead to the next paragraph if you wish to avoid them    Spoiler Warning",
            "review_score": "1"
        },
        {
            "review_text": "This game is genuinely fun. The music is great, the gameplay is crisp, and the battles are fun. It is engaging, I wanted to keep playing. This game is one of those rare games in my opinion that is worth it.",
            "review_score": "1"
        },
        {
            "review_text": "A truly original western epic that still feels like the classic movies. I normally don't review games, but I feel like this one deserves it. The story may start out as the over-used revenge story, but by the time you finish it feels completely fresh. The tutorial introduces the plot right away (a mysterious bandit burns down your ranch), and the rest of the game is dedicated to your personal vendetta. The mechanic here is interesting, because every playthrough the outfit of said bandit changes, and you are tasked with asking around to learn what he looks like. This is achieved through a multitude of ways, from rumors, to quests, to even blaming everyone until you find him. Seriously, this game takes free-roam to the next level. Even in conversations, you're not only given dialogue different options, you can pull out your gun, ♥♥♥♥ it, then fire it if you want. You can also just walk away. These are legitamate options, and the characters will respond appropriately, some will just hand you money when you threaten them or get annoyed if you walk away. Personally, I find this incredibly satisfying. This open endedness extends to everything too. To earn money you can do jobs for people, mug strangers, or even rob the bank. And you don't need a quest or specific button to rob the bank, you just go in, shoot everyone, grab the money, run, and pray to god that the sheriff doesn't find you. The map is pretty massive for such a short story, and there's a ton to do. Every quest has several different ways to go about it, and quite a few of the quests will depend on you not doing another one. For example, you can help free the buffalo for the Indian Camp, but if you do that, you can't help the army fight them. Customization is there, if you're wondering. They have different outfits and hats to buy or pick up all over the map. There's no RPGish skills or anything, but it's not needed. The game depends on the player skill. The music and sound are not only authentic, but match the mood and fit the game perfectly. I would say the same about the art style. It's simple and pixelated, but get's the job done well. Even though the characters are basic and abstract, some of the backgrounds are detailed and gorgeous. The art and sound design fit Westerado well. Now you might be asking if there's anything wrong with this game. I have only one small complaint, so   if you need to read any part of this review, here it is.  The combat is weak. It's a 2D shooter, and while it fits the game well, it can be a bit clunky and difficult to aim. The depth is unfortunately hard to judge, and several times I found myself shooting right behind enemies. And in a game like this, a few misses will cost you. It's such a small issue though, and the rest of the combat system is quick and satisfying. Also, here's a ton of different guns which brings variety to the mid-game, and improves the combat system. Replayability is also high, with 4 different characters and tons of different options each playthrough.  TL;DR: Buy this game, especially while it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Replaying is fun. There's different endings and mission branches.",
            "review_score": "1"
        },
        {
            "review_text": "HOOOOOOLEEEEEE CRAP! At first when I saw this on the market, I was kinda like 'meh, It looks pretty good' but then after playing a bit of it, I was completely hooked! The amazing storyline, the controls an mechanics, and the way you could shape the story depending on waht you did! 10/10 we need an actual westerado movie or a sequel!",
            "review_score": "1"
        },
        {
            "review_text": "The sherrif was supposed to help me kill the bandits trying to rob the stage coach. Instead he rode with them and personally shoot off two of my widebrims. MoF***Ker. As soon as we got back to Santa Ana I killed that p o s. Now im banging his wife at her cabin, she doesn't even know he is dead. The rat ♥♥♥♥♥♥♥ oil tycoon gave me some b s clue about my families killer. I killed his ♥♥♥ too. Why do i need these kind of people in my life?",
            "review_score": "1"
        },
        {
            "review_text": "There once was a man who ruled the wild west with an iron grip. You're not that man. You're the man that everyone fears because you killed him.",
            "review_score": "1"
        },
        {
            "review_text": "great little openworld westerngame with alotta freedom. Would have loved some rpg elements and stuff like night/day shift bonfires, mining, fishing, duels, weather etc and such but ye you gonna make that in the sequel :D",
            "review_score": "1"
        },
        {
            "review_text": "Didn't expect to enjoy this anywhere near as much as I did.",
            "review_score": "1"
        },
        {
            "review_text": "Westerado: Double Barreled. My mandatory obscure indie game my best of 2015, and it's a good pick. Created by Ostrich Banditos and published by Adult Swim Games, this game is the closest thing I've played to Red Dead Redemption since I played Red Dead Redemption. It's the closest thing on PC to it, and that's pretty cool. So should you pick it up? Well, let's take a look at it to find out.  STORY: You are... some guy. Your brother and mother are killed by a man, and you go out on a journey to get sweet revenge. You go around and help people and you find clues to find the murderer. The story is a RPG, so you can choose what happens and that'll shape the world around you. Shall the military fight the Indians off their land, or will the Indians fall back, or can you make peace between the two? Shall the railroad go back to its former glory? You can decide. The murderer is randomized everytime, btw, so it has some good replay value there. Overall, it's a decent story.  GAMEPLAY: The perspective is kind of like Dota 2, though it's not similar gameplay wise. You have your handy revolver. You ♥♥♥♥ it with one button, fire with another, and reload with a different one. If you get hit, your hat falls off. You usually have some spare ones, but if not, you are hatless. If you are hit then, you're dead and you wake up at your last spawn location with half of your cash gone. Decent enough, has some fun firefights and cool side activities, and it's good fun.  GRAPHICS AND PERFORMANCE: 30fps, though with this game, that's fine. Runs smoothly. Game looks nice, has a nice pixely artstyle. It's charming, and it looks nice. That's nice to see.  CHARACTERS AND DIALOGUE: Decent amount of variety. Your character is the usual player character, and you run across a lot of western stereotypes. The washed up sheriff, the girl who wants a man who can give her an adventerous life, the robbers who rob just for the hell of it. Fun little characters, some complexity to them as well. Nice to see some of them, I won't complain.  FINAL RATING: Underrated game. Worth picking up on a sale without a doubt. 8.5/10, good game, nice debut for this studio. See if you can go out and support them if you have the money to.",
            "review_score": "1"
        },
        {
            "review_text": "They distilled a massive open world game down into a compact and fun indie title.   It's completely non-linear, except for the finale. There's lots of places to explore, different quest lines, different ways to accomplish each quest, different results in the world from your choices, and none of them are required. At any point in a conversation you can draw and ♥♥♥♥ your weapon for different results, although it's not used as much as it could be. If you want to, you can kill anybody and everybody. The art is good and the music is fantastic. The writing is great, with a lot of humour. Combat is probably the weakest part of the game, and can be a little clunky. You only shoot left or right so a lot of combat is running up/down, drawing, cocking, and shooting.  Beating the game for the first time takes 1-2 sittings, depending on how much you explore. The bulk of the gameplay is in replaying to follow different quest lines, take different sides of conflicts, and see things that you missed.  Overall it's a delightful and enjoyable game that will stick around for me as something fun and light to replay for a quick hour.",
            "review_score": "1"
        },
        {
            "review_text": "Great little game, very polished, reminded me of the my C64 days. A Surprising amount of depth to it too with some great touches and excellent gun mechanics (♥♥♥♥ and then shoot adds some skill imo).  An RPG for western lovers and it can be completed in 3-5 hrs depending on how you play it.  I loved it.  Also it's worth buying for the music alone, superb soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Westerado: Double Barreled may not be the prettiest game around with its blocky pixel art, but what it lacks in the visuals department is made up with its gameplay and humor. It captures the feel of a good ol’ fashioned Wild West revenge flick while having a good, and sometimes really weird, sense of humor.  The fact that you can pull out your gun on anyone during any point in a conversation should tell you quite a bit about the tone of the game. The metaphor for physical intimacy also deserves a nod. You’ll run into weirdos, bandits, hat makers, bandits, people that can use your help, and more bandits. On your quest for revenge you can change the fate of some characters if you follow through on their questlines or just murder them in cold blood.   All of the above means that there are different outcomes and methods to solving the same quest. For example, there’s a group of bandits blocking the railway with their shenanigans. You could murder them all, turn them into the sheriff’s deputies through a series of complicated steps, or even scare them away with a certain NPC. If you’re looking for an uncomplicated experience, murder tends to be a viable method of solving things, but know that it doesn’t have to be the only way. Making good dialogue choices might also accomplish the same task. Let’s not forget, you’re actively collecting clues to have a more complete picture of who the murderer is and the identity changes with every new game. Completing quests for NPCs rewards you with a single clue. You can also find the murderer by accident which I was able to do once. Let’s just say I forgot how to holster my pistol correctly.  Discovery is a big part of the game and the multiple endings add to that feeling. The kind of person you are is reflected in the ending and can be affected by siding yourself with important quest givers. If you’re achievement hunter, Westerado might have an even greater appeal to you since they generally have you going after different outcomes or scenarios that you might not have thought were possible. You can also have fun just by finishing the game a couple of times.  The gameplay is simple, responsive, and satisfying. You can shoot left or right and can move up or down. You have to pull back the hammer before you can fire and each round must be manually reloaded. This leads to some tense moments as you have to balance when to reload versus shooting back. Revolvers aren’t the only weapons, but they’re what I prefer. You can buy a shotgun, a rifle, or another revolver for some dual-wielding action.  Another great thing about the combat for Westerado is that enemies can harm each other. Maybe you don’t have a great window for reloading and there are enemies on both sides. Some nimble footwork can have enemies shooting at each other while you dance around. Most of the time, it happens accidentally, but doing it deliberately is also fun. Keep in mind that friendlies can unintentionally do the same thing to you and vice versa. Your lives are represented by the number of hats you have. You can have up to three hats to absorb shots; a man with no hat has a very short life expectancy.   There are only a couple negative criticisms I can make. Sometimes alternate solutions to quests are just really complicated, even if you bust out a guide. If you mess up, you’ll need to start a new game. The fact that playthroughs can become very short once your familiarity with the game increases does soften the blow. The other aspect of the game I didn’t like were the really blocky characters. The environments looked fairly okay with the pixel art, but the people were just giant pixels to me. A few more details wouldn’t have hurt.  Other than those two things, I think Westerado is worth your time, especially if you’re a fan of the wild west setting. The fun gameplay, the silly things you can do, and the varied outcomes make this game pretty fun. Man, ah love my revolver.",
            "review_score": "1"
        },
        {
            "review_text": "i think that this is one of the best games i ever played. westerado is an amazing advanture game, the artstyle is great, the characters are funny at times, and the world is for you to explore. (spoiler alert for the first min of the game) your family got murdered and you need to avenge your family. sounds simple? well you dont know how the killer looks. if you do quests then you will get information about your killer, once you get enough info you can go after the murderer.  every time you play the game the killer is a diffrent guy, so everyone is a suspect. but the best part about this game is its music, the main theme NEVER gets old. the downsides are the bugs and the fact that the game is pretty short. overall i recommend this game to anyone who likes advanture games.",
            "review_score": "1"
        },
        {
            "review_text": "A fun role playing game. Marvelous soundtrack. The people who made Westerado and the person who made Gunpoint should work together.",
            "review_score": "1"
        },
        {
            "review_text": "There...is just so much I love about this game, including the music...Oh god the music.  It helps set the mood and in a game where you decide how things are done, well it can add alot of emotion to scenes, there's one I like in particular but I am not going to ruin it for players, I recommend it because they need to hear it in its entirety.  Next: The Gameplay, You are using a 2D plane but you fight using only one of those *Nerdspeak translation: You can go left, right, up, down, and diagonal but you can only shoot left or right, your enemies have this restriction too* and it gives a great feeling of tension as you don't know if you'll hit the guy or just BARELY miss him by a few pixels, the satisfaction of getting a hatshot as rewarding as the hat you can then grab, and again you can go about it in a number of ways, you can the the nice guy or you can be the guy who guns down anyone who ROUGHLY fits the description...I do hear though that going murder crazy on everyone is a bad idea, I'll have to try it next playthrough.  Finally the story: Its pretty stock of course, but it uses the tropes very well, it has some humor that can help take a load off your quest for vengeance...  In my view, 10/10, would avenge again.",
            "review_score": "1"
        },
        {
            "review_text": "A free roam game with simple yet fun combat, funny moments and good times exploring",
            "review_score": "1"
        },
        {
            "review_text": "Great soundtrack, great gameplay. A full grasp of whe 'Wild West'. and i got to kill a hooker. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. Reminds me of the old (and good version) Sid Meiers Pirates - except in the old west. Well designed and plays smoothly.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Nice throw back.",
            "review_score": "1"
        },
        {
            "review_text": "A really great game with a reasonably large map and 4 stories with lots of different missions. I recommend it to anyone with £6 in their steam wallet or anyone looking for a new cheap game to play",
            "review_score": "1"
        },
        {
            "review_text": "this feels a lot like fallout 3 in terms of open world, wacky humor, lots of meanginful choice. fabulous game. short but very satisfying game",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best 8-bit game i ever played in my entire life. I RATE IS 10/10 BEST GAME EVER",
            "review_score": "1"
        },
        {
            "review_text": "If the cowboy's in the game are actually actors are they still gay?",
            "review_score": "1"
        },
        {
            "review_text": "I like cowboys",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "Need another sequel please",
            "review_score": "1"
        },
        {
            "review_text": "'s pretty gut",
            "review_score": "1"
        },
        {
            "review_text": "The graphics are impossibly ugly. Backgrounds are alright but the characters are just formless...things. Gameplay is annoying, the shooting is terrible. You need to span the hammer and then shoot for every shot, so you're double-tapping all the damn time. Why? Nobody knows. Hitting enemies also is completely inconsistent.  And then there is that weird overload of quests. Im not 5 minutes in and I piled on two dozen quests without knowhing where to go or what to do. Ugh. Doesn't help that everything looks the same.",
            "review_score": "-1"
        },
        {
            "review_text": "I really want to play this game but, whenever i go through to a new area the screen goes black and it say ,'' An unknown error has occurd, sorry for the inconvenience.''  I don't know if anyone else has had this problem but i really want to play this game and I'm disappionted with the amount of bugs in it. it looks like an awesome game.",
            "review_score": "-1"
        },
        {
            "review_text": "what a dumb game  dont buy this game i thought it would be kind of cool but it is so slow and boring and the fighting system is so terrible and random. a bag game thank for nothing Westerado",
            "review_score": "-1"
        },
        {
            "review_text": "open world  western  RPG  co-op  crazy awesome music  beatiful visuals   a must have game",
            "review_score": "1"
        },
        {
            "review_text": "Really amazing game with a surprising number of possible storylines. I've already played through twice and I'm still discovering new characters/areas/quests.  The simple idea of being able to kill any person in the game is so satisfying and really gives this game an infinite replayability.",
            "review_score": "1"
        },
        {
            "review_text": "I've finished the story of this game only once, and mostly thanks to my luck. So keep that in mind.  Your goal in this game is to find the man who killed your family. You'll achieve this goal by doing quests for people who will give you hints in exchange. By progressing in the game, the puzzle pieces start to fit together and you'll find the murderer.  The combat is fun. There are a few weapons to choose from, and you can only shoot horizontally. Same goes for enemies. I was expecting for a little hiding-behind-cover, but every battle is an all-on-shootout. No cover.  This game is promised to have a big replay value: The murderer is different every time. Maybe I should've found the murderer more than just once before writing this review, but the first time was fun enough.",
            "review_score": "1"
        },
        {
            "review_text": "Another game with adult swim awesome juice poured onto it to make it even more deliciously awesome. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun!  Its not very easy but also not too hard! :D (I was able to play it^^)  I'd love to see some more maps! I'm the kind of person who loves it to drive (ride) around and explore! If i could have my very own horse and a 5 times bigger map... That would be preeeetty cool! Also i think the game should get some more weapons! (The rifle is my favorit!)  Yea... All in all its my new favorite game! :P",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually awesome. It's Pokemon without the Pokemon and a pixelated Skyrim with guns. I've only playd a little, and I really enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "- awesome pixel art graphics  - really funny coop mode  - plenty of things to do in a (small) open world  - plus a ton of little details that definitely make this game awesome !",
            "review_score": "1"
        },
        {
            "review_text": "I love this game soooo much, I it all the time and even after playing it for a while i still seem to find things to do, i love the freedom of the game because in most games if you cant kill an important character but in this game you can basically do whatever you want. i love this game.",
            "review_score": "1"
        },
        {
            "review_text": "'16-bit-cant-move-in-a-diagonal-direction-spaghetti-western-shoot-em-up' em up. Also amazing",
            "review_score": "1"
        },
        {
            "review_text": "YEE-HAW ♥♥♥♥♥♥♥♥♥♥♥♥.I love this game,it has multiple ending,multiple quesat ending and is a different experience everytime.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun It's challenging It's funny And even after my first playthrough, I was still discovering new things.  This game has plenty of replay value and is worth your money. Nothing phenominal, but worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Guns, buffalos, flying hats, sherrifs, harmonica, pretty ladies, money &amp; revenge. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game ! Just spend the last two hours on it with a friend killing EVERYONE and still winning ! And the possibilities for other win strategies is just a great replay source ! A must have ! :)",
            "review_score": "1"
        },
        {
            "review_text": "Fun little game to mess around in solo or hotseat with 1 friend. I love the gunplay mechanic and the artwork in particular.",
            "review_score": "1"
        },
        {
            "review_text": "Humble bundle, now, get it.   A great deal of fun, intriguing story, fun rpg side where your actions now can affect your later ones. I would have paid full price, but getting it in the bundle was even better.",
            "review_score": "1"
        },
        {
            "review_text": "The best indie title I've played in a while. It's quite short, but left me with my mouth open at the end. Recomended to anyone who likes western theme, non-linear story with great replayability and great writing.",
            "review_score": "1"
        },
        {
            "review_text": "pros: - very simple but insanely fun gunslinging mechanic - neat character interactions and questlines - unlockable characters - different every time you play - horsies!  cons: - some quests compete with each other; things can get messed up and you're never quite sure what you did to mess it up. - on a similar note, it can be way too easy to accidentally do something to make people mad. sometimes instructions or limits are unclear. they will also never forgive you, shutting out complete parts of the game due to accidents. - i wish the final section of the game had as much variety as everything leading up to it. - unlockable characters don't actually offer much variety.  summary: this game is fantastic. if they made it a little harder to ♥♥♥♥ people off permanently or shut down questlines accidentally it would be even better. i'm not sure i'd pay $15 for it but if you have the opportunity to buy it on sale it's really super fun.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this simplistic but supprisingly complex game to everybody. Soundtrack is beautiful",
            "review_score": "1"
        },
        {
            "review_text": "I played the original Westerado on the web, hungry for a western themed game. I liked it, but I didn't really fell for it.  When this version came out, I decided to give it another try. The openworld-no hand holding plot-I'll kill anyone who gets on my way of this game is incredible. No other game gives you this amount of freedom.  The replayability value is great, with all it's different endings and the unlimited ways to approach every game play.  Adult swim made one of the best open world games out there, and it's simplicity is, instead of a handicap, a great asset. Perfecto for casual gaming with some depth and roleplay.",
            "review_score": "1"
        },
        {
            "review_text": "I want to like this game, as it's a cool concept of action mixed with detective bits. However, the gameplay is broken. Randomly while playing with my controller, moving 'down' will just randomly stop working. And when you are trying to manuever around an enemy aiming at you, that's important a decent amount of the time. Maybe if this gets fixed, it'll be an okay game. But as of now, I have to drop it and move on to better, non-bugged games.",
            "review_score": "-1"
        },
        {
            "review_text": "All the fun starts after you beat the game",
            "review_score": "1"
        },
        {
            "review_text": "Got a job with the army and took all money for other people. Gambled it. Collected money from ranchers for someone else, gambled it. Got a girlfreind and gambled away all her money to buy a house, then killed her and her ex husband. 10/10 would become gambling addict again",
            "review_score": "1"
        },
        {
            "review_text": "The music and art style is great. But the clunky combat controls are preventing me from finishing the game, and after many frustrating failed attempts to complete the final series of shootouts I have given up. If I could just recommend the music &amp; graphics I would, but as a complete 'game' I just can't. Shame.",
            "review_score": "-1"
        },
        {
            "review_text": "First of all, ah would recommend Westerado at half price. Ah don' think it's worth the full amount, but if you can get it on sale, you have a nice little game to play.  Story - 7/10 - Yer family gets killed by a person, and you have to go kill that person. The story does make you want to play, but it ain't too original. The cool thing about it is that the person that killed your family changes every time, so you ain't gonna know who the killer is ferever.  Graphics - 7/10 - Nothin' to write home bout'. It looks fine, and there ain't any glitches in animation as far as ah can tell, but somethin' feels a little lackluster bout' it. It ain't gonna fect' the gameplay though.  Gameplay - 9/10 - The gameplay is very simple. There are 3 parts of the game. Movin', Shootin' and Talkin'. Movin' - You move round'. This is bearable cause' you has a run button and there's an open world to explore, even though the world ain't very big.  Shootin' - You shoot people. The Combat is fun cause' there are multiple weapons to use, but you can only shoot left er' right, which is a weird design choice. Talkin' - You talk to people. Most of the time you will do one of 3 things. Help, Ignore, or Threaten. You can git missions and sist' people with jobs or be a little varmint and walk away. The fun things that you can do are accusin' people of murderin' yer family or pull out a gun and have the option to shoot em'. Pullin' out your gun may lead you to new dialougue options, but'll get you into a gunfight 50% of the time. It's yer choice!  Overall - 8/10 - Westerado's a nice little game that doesn't last too long, but it packs punch, like ah shotgun to the hat.        (P.S. NO OFFENSE IS MEANT TOWARDS ANYONE WITH A WESTERN ACCENT! IT JUST FITS THE THEME!)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome! who love pixel and adventure games, this is a first choise. Red Dead Redemption is for boys, real men play Westerado: Double Barreled",
            "review_score": "1"
        },
        {
            "review_text": "I heavily recommend this game, even I was on the fence about buying it. Trust me it's worth it. This game is honestly beautiful. Amazing shooting mechanics, even if I still can't shoot the lock of a gate. Will frustrate the hell out of you sometimes and may still have a few bugs but it's worthwhile man. The music is great, even if you can tell it's on a loop. Although I hate the Indian music. God forbid you go there for more than a minute. Being able to kill everyone is amazing, and this game made me chuckle with how many corpses I've had littered ont he ground and the waves of npcs coming to murder me. It's also got a few pop culture references, whatever that is.  It's a change from all the games I've played aka rpgs and roguelikes, just kidding! This is technically a roguelite or some sort but I've never had so much fun coming back and doing it all again. And killing many, many people And by people I mean bottles. They work for The Murderer. He's a tall glass of water. I'll drink him (and to damn him) one day. Also kill Richard. He's a ♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Shot my borther in the first 5 minutes - 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Simple, fun and a great passer of time. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Short but fun. You play a gunslinger tracking down the man who killed your family, using clues given to you by the townsfolk. The actual look of the man you're hunting changes each game.",
            "review_score": "1"
        },
        {
            "review_text": "Westerado is what I would consider one of the best games of all time. It is ridiculously simple in it's execution but has such depth in the gameplay and story. It has made me laugh, it has made me cry. I definitely recommend if you consider getting this game, it really is something special! 10/10",
            "review_score": "1"
        }
    ]
}