{
    "app_id": 275390,
    "name": "Guacamelee! Super Turbo Championship Edition",
    "release_date": "2014-08-21",
    "developer": [
        "DrinkBox Studios"
    ],
    "publisher": [
        "DrinkBox Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Metroidvania",
        "Action",
        "2D"
    ],
    "achievements": 30,
    "positive_ratings": 1728,
    "negative_ratings": 122,
    "price": 11.49,
    "description": "The definitive version of the smash hit Metroidvania-style action-platformer, Guacamelee! STCE adds new levels, powers, challenges and refinements to the sprawling, ridiculous, Mexican-inspired adventure of the original Guacamelee! Gold Edition.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/275390/header.jpg?t=1544283236",
    "minimum_requirements": "Mínimo: SO: Windows 7, 8, XP, 2000 and Vista Procesador: 2 Ghz+ Memoria: 512 MB de RAM Gráficos: Shader Model 3.0, 512 MB VRAM DirectX: Versión 9.0c Almacenamiento: 800 MB de espacio disponible Notas adicionales: Supports Xbox 360 Controller and other XInput-compatible controllers",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Donald Trump's worst nightmare/personal hell. 10/10 too much mexicans  But in all seriousness, damn near perfect game, buy it now. It was a steal getting it on sale. BUY NOW.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really enjoyable platformer. It is witty, funny, gorgeous, and feels great to play even on a keyboard (a bit of training required, and lots of missed keys).  The controls are smooth and the combos are neatly chained and impactful.  My only qualm is that the skins are tied to power-ups and disadvantages. Sometimes I just wanted to enjoy some look but its bonuses aren't as good or my playstyle as other skins, so I just used Diablo and the monster one, mainly.  Played 2 games, normal and hard: 1st playthrough, about 10 hours, 100% completion; 2nd playthrough, hard mode, about 4 hours, rushed. I really wish hard was available from the beginning, it added some needed challenge. I played a second time mainly for the achievement, but I would've enjoyed the game a lot more in one full hard mode playthrough. 100% achievements (second run in hard-mode required).",
            "review_score": "1"
        },
        {
            "review_text": "So from playing both versions of Guacemelee! at 100% achievements, I can give a proper review.  This version of the game has more features and levels than gold edition but this also made the game easier (looking at you intensio). The achievements were cut in haft (so 30 achievements to unlock unlike 60 in gold) and getting costumes with special abilities require silver coins where they are found from completing arenas or chests (by the way Pinata costume doubles any chest, this includes silver chest so you may want to invest into that early).  They remove some stuff like the flashing lights from getting power ups (thank god) and some undodgeable attack that some enemies have.   Overall, I still have fun and this version supports 4 players instead of 2 apparently!   I'd recommend this over gold.  Have fun admiring all them references.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun! Only played two player, but we both really enjoy it.  The artwork and music are lively and lovely, mechanics are good and dialogue is funny.  I love the goat.",
            "review_score": "1"
        },
        {
            "review_text": "The most fun I've had for a while. Does a great job with the theme. Took me just under 8 hours and the Luchador never felt tired (which was something I was sure would happen). It's challenging enough to make you relish victories, but never felt unecessarily punishing. Great experience, solid combat, fun characters. Well done Drinkbox.",
            "review_score": "1"
        },
        {
            "review_text": "I must admit, I wanted it out of curiosity in the beginning, but I couldn't expect how much fun it could actually be.  The fighting system feels fast, responsive, and with a lot of potential for combos, and juggling enemies in the air. Each move you have has a specific purpose and is clearly differentiated from the others, creating a small yet varied set of tools at your disposal. Yet one can't help but think that a couple more moves wpuld help make battles more varied and interesting. The tactical side of things, later on with the addition of shielded and alternate dimension enemies you can't just take them all on at once, you have to be more methodical, to decide which targets are a priority, which should be knocked down for later.   The game can be pretty tactical, yet not so much so as to become slow or unenjoyable. The game doesn't ask you to make big plans about each fight, but to assess the situation and make on-the-fly choices to defeat you enemies in the most efficient, safe, fashion. And that makes it actually rather enjoyable.   Unfortunately, however, the difficulty from battles comes more from the ammount of enemies rather than the individual enemies themselves. They never really feel dangerous on their own right, all of them being rather slow and having pretty big tells for when they're going to attack, making it easy to avoid them. Instead, the danger comes from having to keep track of a lot of enemies at once. Yet, at the same time, it makes sense, since it helps keep the flow of the game, whereas single, difficult enemies might make it slower. Overall, the combat is good and has quite a lot of potential  The art style is indeed pleasing to the eye, it looks really colourful yet clean and simple. It's nice to look at and adds character to the game, it works with it, whereas a more realistic approach, at least in my opinion wouldn't have been half as charming  However, one thing the game does suffer from, is it's really short length. I finished the campaign in about ten hours, and I really took my time and 100%'d it. And while it's true that it's better to not overstay your welcome and instead leave a good memory, I'd say Guacamelee!, however, left too early, leaving you wanting more but without much else to do, as the game doesn't really have much in the way of post-game content, other than the El Infierno and Caverna del Pollo challenges. Granted the game does have a good ammount of exploration to do to get all the secrets, it rather goes by fast  Another small problem the game has, is it's lack of online co-op capabilities. While it's understanable that it could cause a lot of problems and frustration with an uncoodinated group, it would also be great fun when it worked. It would be a really nice feature to have when your friends aren't available for some Luchador action.  As I have rambled a lot, and with purpose of making the list more approachable, I'll include a list of pros and cons:  Pros:  +Very solid and entertaining fighting style that doesn't get old +Well differentiated moveset where every move has its clear purpose +Lots of enemies that make for varied encounters and strategies to beat them +Colourful and clean artstyle that adds charm to the game and has just enough ammount of detail to not feel boring +The enemies, thanks to the art style are inmediately recognizable, and thus you are rarely confused about what you should do +A good amount of costumes, with their own effects, that allow even more variety in your battles, and in my opinion, look pretty nice +Chickens  Cons:  -The game suffers from a really short length, leaving you wanting more with no real way to ease that craving -Not much in the way of post-game content. It's a small game -The movelist, although differentiated, is rather small. It could have done with some more moves -The platforming requires good eye-hand coordination late-game. Can become frustrating if you have poor reflexes -A little too heavy on the memes -No online multiplayer support  The game, overall, is really good and I enjoyed it inmensely. I'm also impressed in how well the extra areas are included in the game, I didn't know they were add-ons until I looked them up due to how well integrated they are. The only real complain I have about the game is the short lenght. It's a small game, but a really good one. I would definitely recommend it",
            "review_score": "1"
        },
        {
            "review_text": "PROS: The art style is distinct and enjoyable. This game is HILARIOUS and obviously made by people who love video games, as there are references to other classic games everywhere. The combat consists of a somehwat limited moveset, but it somehow works throughout the entire game. I played with a controller and the controls were responsive and well done. The use of Hispanic culture is well done and gives respect to the traditions that inspired the game ( soTumblr can't say there is 'cultural appropriation' or whatever)  NEUTRAL: At times it can be confusing to know what to do but never anything super serious  CONS: The ending is really difficult. I can't even get to the final boss because the final level is so damn hard. This probably says more abouit my ability to play the gamre more than anything else.  VERDICT: I love this game. Fun, hilarious, original. Highly recommended  ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome metroidvania Title  EPIC GAMEPLAY!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "The original Guacamelee! is one of my favorite 'Indie' games that I own, and I was extremely excited when I heard that the Super Tubo Championship Edition came to PC. I purchased it immediately and just finished my Normal playthrough.  Guacamelee!: Super Turbo Championship Edition adds a good amount of extra content, in the form of new levels, new enemies scattered throughout the game, a new boss, and new abilities. It's a 'Metroidvania' style 2D action game, but instead of a bounty hunter or vampire hunter, you play as Guacamelee!, a luchador fighting his way through both the land of the living and the dead to rescue his love.  The Good:  *Unique art style drawing from Mexican folklore, specifically the 'Day of the Dead' *Great music and environments *Tight controls *Clever, rarely frustrating platforming sections *Fun combat, with a mix of combo-based striking and grappling *Simple story with humor and references to classic games all over every stage of the game  The Bad: *Can't remap controls on a controller. This is a minor gripe, because the controls make sense, except for the new 'Intenso' mode, which requires pressing LS and RS simultaneously on a gamepad. This is annoying, especially considering that RB and RT are both mapped to the same function, and either could have been switched to Intenso mode. *Game is short. I wanted it to last longer. There is replayability in a Hard mode unlock and a challenge guantlet of sorts, with lots of hidden items to go back and find for 100% completion. But even with the added content, I beat the game in 9 hours (not 100%), with a considerable amount of backtracking and exploration. *The new Intenso mode makes combat far too easy on Normal playthrough. Entering Intenso mode lets you just wail on anything until it runs out, forgoing combos and dodging entirely.  Overall, I'd highly recommend this game. As an owner of the original Guacamelee!, I received the upgrade at a discount (67% off, or $5). I had no issues replaying the game from scratch, because it's fun. I'd be less likely to recommend the upgrade to existing Guacamelee! owners at $15, because there's not THAT much new content. For new owners, however, $15 is absolutely worth it, even with the short length of the game. You'll want to get 100% completion, and then tackle Hard mode if you still haven't had enough.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game , its fun , fast past .",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest platformer/ beat um ups i have ever played, it has skeleton #1 creepy guy with 12 ft head, it has chickens, and dead chickens its the 4X fecta of platformes based in Mexico.",
            "review_score": "1"
        },
        {
            "review_text": "I just finished this game on co-op and I gotta say it's some of the most fun I've had in a long time. It took us about 7 hours to beat even with the two of us. You pretty much play as a super-hero luchador in a beat-em-up style game trying to save your princess. There is tons of secrets, in which you don't unlock the 'true ending' unless you find them all. You can also unlock different costumes which gives you different benefits and you can upgrade your skills. I played most of the game with the Diablo suit which kind of made it like hard mode even on easy.  I gotta say this game really did remind me of the old-school games and some of the music even sounded alot like Mario and other games. Enemies were decently hard to beat without being too difficult, but keep in mind I did have another player helping me. Storyline is decent and there is tons of humor in the game also. It's kinda like they took everything people love about indie games and put it into this game.  Co-op design is fairly decent but the camera kinda sucks as it will only follow player one instead of expanding. Every time you die you have a timer to wait to come back and when you do you're a little orb that floats around until your teammate releases you. I felt this made the co-op fair without being too much struggle. Pretty much a fun co-op experience that adds mild difficulty to great teamwork gameplay. Coordinating certain platforming can be incredibly hectic though and we usually just let one person do all the platforming at the hard parts because it was too hard with two people to do.  Co-op is also somewhat buggy... I have a screenshot where instead of dying, me and my buddy just have 3 copies of ourselves each...  I will probably replay the hell out of this game until I unlock all of the achievements. I can't really say too much bad about the game in all honestly so I would have to give the game somewhere around a 4.5/5.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, This is must have! i found myself spending all day and night on this. The puns, the humour, the action and the storyline is a 9/10.  i even learnt some spanish playing this  POLLO POLLO POLLO!!",
            "review_score": "1"
        },
        {
            "review_text": "I want to love this game way more than I do. This is by no means a bad game, in fact, it's an extremley good one. While the puzzles are pretty easy and I never thought twice about what to do, even though it's a metroidvania, the combat, level design and overall charm is wonderful. However, I don't think I will ever revisit this game again as the final hour of the game is filled with tedious challenges, awful enemy placement, to the point of entire sections of the game where the most difficult enemies are just packed in, and an atrocious final boss completely soiled the very fun experience I had with this game. ",
            "review_score": "-1"
        },
        {
            "review_text": "pretty nice game u play as a guy it has cool combat with combos and ♥♥♥♥ its metroidvania  you kill a lot of skeletons and then the main villain is also a skeleton and there is also a skeleton costume so its pretty spooky",
            "review_score": "1"
        },
        {
            "review_text": "BUST IT BILL  AND  REPAIR IT ROB",
            "review_score": "1"
        },
        {
            "review_text": "The setting and writing are overrated...they're typical game cheesiness. The price of the game is a bit of a lie - without a controller this game is nearly unplayable. Programming a notification to that fact into the opening credits should be not be a replacement for programming workable PC keyboard controls.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun beat 'em up. Nice soundtrack. Decent graphics. Not worth completing tho, sorry.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "It's the same ♥♥♥♥ that gold edition, but with another title and less achievements",
            "review_score": "-1"
        },
        {
            "review_text": "Overall I liked the game and it's definitely worth the price on sale for ~4hrs of entertainment. However there was a slight issue I didn't notice early enough that I'd like to warn people about.  When this game goes on sale, it'll also have the gold edition and this one bundled up in one. Pay attention and don't buy the bundle, just buy this edition.",
            "review_score": "-1"
        },
        {
            "review_text": "Best game, best story, but.....stupid keyboard move list.",
            "review_score": "-1"
        },
        {
            "review_text": "You'd think with a title like Guacamelee, this game would have guacamole be some sort of central thing to the plot or something. It's not. The title's just there to sell the game's aesthetic. And you'd think that a game like this that goes so far out of its way to give life to its little cartoon Latin America would try and capitalize on what Latin American culture has to offer in terms of themes storytelling, sort of like what 2015's Book of Life ended up doing, or like what Clover did with Okami and Japanese folklore.  But wow. Not Guacamelee miss its chance to do that, it dives off a cliff to avoid it.  Gorgeous animation, beautifully thematic visual design are all wasted here in a game who's core is bogged down by an overwhelming amount of lame, blatant references to other video games have nothing to do with this one (I still can't wrap my head around the Hotline Miami billboard) and 2013 era memes that not only cringy and extremely dated, but break the immersion the art and music worked so hard to encourage. And if you want to give the game props for being mechanically functional and satisfying, that's fine, but there are better games that are better at even just being metroidvanias than Guacamelee is. Pair that with writing that's clichéd but alright at best when it’s not busy explaining its jokes and winking to the audience and you’re left with just a hollow, cynical shell of a game that thinks pleasing a crowd is the same thing as being good. It thinks that a cultural aesthetic can be worn and sold like a costume. It's gross, it's cringy, but it's worst of all just plain lazy. And that's a damn shame.   Don't buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Apparently there are multiple endings, i may google it, IN THE NEXT DECADE OR SO. Im way too ♥♥♥♥♥♥ now to bother  I wanted to recommend this, but i just want to tell the devs '♥♥♥♥ YOU'. The game is good, up until last bossfight. Last bossfight has an incredible difficulty spike in it compared to anything JUST BEFORE THAT, its boring, uninteractice (both phases) and the time to dodge is incredibly narrow, also your attacks have a massive recover time, while falling to the ground after an uppercut for example, and those narrow down the dodge windows to incredibly small.   The ending is a spit in the face, last boss fights are incredibly dull compared to the other ones which are pretty good, the area before the last boss is incredible long, took me atleast 70-80 minutes to get through (thats from boss fight to the last bossfight distance).   Yea, you could tell me that a good story is where the hero doesn't get live in the world he 'fixed' and i would tell you to ♥♥♥♥ OFF. Seriously im getting ♥♥♥♥in seriously bored of endings where our hero isn't satisfied, in a book its okay, but in a video game, thats eye candy with vibrant colours humor fun and action it is absurdly anti-climactic and totally ruins immersion and fun. Im on the verge of wanting to refund this ♥♥♥♥.  I want to vomit now, yea i understand the 'happy ending' is basically an overused cliché ♥♥♥♥in hell mate, we worked hard on getting through the game, its not easy unless you are a fighting game expert. One of the WORST if not THE worst conclusion to a game.   Its incredibly short too, there are collectibles but if you aren't into those you aren't going to have much fun. 6-8 is approx completion time, thats not much, and ♥♥♥♥ THE ENDING. Happy ending =/= BAD STORY okay?! Just because you gave the game a happy ending doesn't mean its ♥♥♥♥.   I've played countless games with a rich story where it doesn't end in a horribly deppressive dumpster. And you know what the WORST about the ending? Its that its a half win! Let me explain, you get to live with the girl you saved, IN DEATH BECAUSE BOTH OF YOU DIED! Thats even worse than killing the main protagonist right after he saved the world. Scummy ♥♥♥♥♥♥♥t. After a tiring ♥♥♥♥♥♥♥t last fight i want to be happy not to be told 'this is how life works son, get over it' Im playing video games to escape reality FFS!   I think i've ranted enough, now dislike it, because i disagree with you fanboys. IDC",
            "review_score": "-1"
        },
        {
            "review_text": "An amazing game that only got better! EPIC! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, would recommend!  The Good: +Great theme with matching visuals and music +Interesting take on integrating platforming and combat +Large world to explore with plenty of secrets +Some humor and charm to be found  The Bad: -A bit short, beat the game 100% in 7.5 hours (Although I had 100%ed the Guacamelee Gold Edition) -Platforming elements not as tight as I would have liked",
            "review_score": "1"
        },
        {
            "review_text": "It's just like Guacamelee! Gold Edition, with new moves, new areas, and new powers! In addition, the stronger throws are available by default and don't require stamina. But most importantly, it doesn't have the seizure inducing flashing when you gain new moves or powerups! If you enjoyed Gold Edition, you'll love Super Turbo Championship Edition.",
            "review_score": "1"
        },
        {
            "review_text": "An absolute platforming blast. Gold edition was fantastic and even if you have beaten it I still would reccomend super turbo championship edition. It just tightens everything up; expands the story, allows for 4-person local co-op, adds egg bombs... it's just so much fun to play, especially with friends. This game has actual skill requirements for its platforming puzzles and that is where the only flaw I can imagine for this game comes from (though completely avoidable in this version with moderate skill): co-operative platforming often results in getting in eachother's way.  In gold edition everybody was locked to the same phase as eachother meaning that platform puzzles that involved phase swaps got complicated, nigh impossible, fast. IN this one everybody can control their phase independantly, which makes it completely plausible, just confusing. When we played through we usually dropped to one player for difficult puzzles to keep camera in the best location.  Overall I loved this game, my absolute favourite platformer thus far.",
            "review_score": "1"
        },
        {
            "review_text": "Jesus, this game is good. It has a bunch of references to Metroid in it, which I found disappointing, because I actually enjoyed this game far more than any of the Metroid games. This game learns from all the Metroid games' mistakes to give an incredibly satisfying experience.  It's essentially if you took the exploration and fun of Metroid, tightened up all the sequences, made it hilarious, and then gave it an amazing combat system reminiscent of Smash Brothers. Speedrunning is awesome. Completioning is awesome. Everything about it is just a lot of fun, and I want to play more. One of the best games I've gotten on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Gracias for this game, amigos.",
            "review_score": "1"
        },
        {
            "review_text": "You can be a chicken!",
            "review_score": "1"
        },
        {
            "review_text": "This game has fantastic artwork, fluid gameplay, and a lot of fun little bits and pieces that reference gaming history or culture or whatever you want to call it. The writing is well done, and I'm going to praise the artwork for a second time. Great game for fans of metroidvania!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, lots of fun, plenty of challenge. Well worth the Steam Sale price I paid and more.",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee Super Turbo Championship Ultra Neon Hyper Mega Ninja Nitro Edition is good.",
            "review_score": "1"
        },
        {
            "review_text": "A great and funny game for people who likes Metroidvania-style games.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game... To that extent, I'd spend three hours in one extremely frustrating platforming section just to get the last orb and unlock alternative ending. It's like the love-hate relationship - sometimes you claim it's over, but you'll always get back together and try harder instead. Everything else has already been said. Anyway - it's one of my favorite games ever.",
            "review_score": "1"
        },
        {
            "review_text": "excellent platformer. runs great even with 4k - 60fps on my 1300eur laptop.",
            "review_score": "1"
        },
        {
            "review_text": "Having played the Gold Edition of Guacamelee almost to the end I was hesitant about buying this edition that would require me to restart the whole game as each area was modified and so saves would not be compatible. I'm glad I took the plunge (with a major discount helping) as this is the definitive version of the game.  Guacamelee is one of the finest action-platformers ever made with outstanding level design and gameplay fusing superb and intelligently designed platforming with great beat-em-up mechanics all in a beautiful, colourful and musically pleasing setting. It has a metroidvania-style exploration system where new abilities enable exploring previously locked areas of the game and the map is filled with chests to find and interesting challenges to reach them. Each new move doubles as both a combat-ready combo-expanding ability while also enabling greater environment traversal. The level design smartly teaches you how to apply them while offering extremely creative ways of using them both individually and combined with previous abilities. The story and characters are fun and the music is fantastic and the traiditional Mexican art style is great too.  The gameplay in this version has been enhanced compared to the Gold Edition and the few areas that used to feel frustrating no longer do so, they feel challenging but fair and skill-based. The visual upgrades are a nice touch with enhanced lighting and generally more colour tastefully applied. The new areas are nice additions expanding the backstory and there are a few new secret chests to find with the new Pollo bomb ability. Technically the game engine seems to have been enhanced too as it feels smoother (although that is subjective and may just be an impression).  Just buy this game, it's one of the best games ever made, rarely has a game been so fun.",
            "review_score": "1"
        },
        {
            "review_text": "+ Great gameplay, super amazing graphics, good music. + A bunch of combat movements to test your memorization and controller skills (like old school!) + Definitely metroidvania style, huge map and a lot of hidden items. + A hilarious goat teaches you the best tricks. + Nicely designed monsters some of which will make you think 'What the hell' the first time you see them, like that huge sleeping dragon. + A looot of achievements to get. + And most importantly, it is local-coop!! Up to four players. Nothing better than help.  - The music gets boring after a while, although doesn't bother much. - I don't like the font on the dialogs. haha.  Score: 9/10 Amazing game. ",
            "review_score": "1"
        },
        {
            "review_text": "Fun, challengig 2d sidecroller, with dinamic action!   Superb!!",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee! Super Turbo Championship Edition is one of the best platformer, beat em up and metroidvania style games I ever played.",
            "review_score": "1"
        },
        {
            "review_text": "A game that will have you running into puzzles and combat believing them impossible to accomplish but after a few tries leaves you praising the devs for their creative level design. Satsifying combat supports this with a full range of moves to not only navigate the world but take down anyone in your path. Worth playing even if not a big fan of platformers or indie games, cant wait for a sequel or more games made by these devs.",
            "review_score": "1"
        },
        {
            "review_text": "Turned into a super powered luchadore then turned into a super powerd chicken.  10/10 would super power chicken again.",
            "review_score": "1"
        },
        {
            "review_text": "This game answers the call to everything I want in a platformer. Solid controls, clever design, beautiful style, sense of humor, smooth difficulty curve, catchy soundtrack, and Mexican wrestling.",
            "review_score": "1"
        },
        {
            "review_text": "Fun co-op platformer/beat em up. The polished graphics paired with extra levels and higher difficulty compared to gold edition makes it very good. It feels like the controls aren't as responsive because sometimes the character waits a bit before executing a special move, though.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Love the art and gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "The Metroidvania game we've been waiting for.  Very fun brawler-style combat, lots of secrets to uncover, powerups are pretty awesome (wuzzup chi-cken how you doin), and the music/atmosphere is top-notch. Animation is gorgeous.  AND IT HAS LOCAL COOP. Shame about no online multi, but for a game like this, it would've been a bonus.  Besides the added content in the STCE, obtaining new powerups now boast 95% non-seizure-inducing backgrounds! This is a huge step up from the base game, since grabbing new powers meant a trip to the neurosurgeon!  Pollos/10, one of the best Metroidvanias in a long time.",
            "review_score": "1"
        },
        {
            "review_text": "Decent for coop.",
            "review_score": "1"
        },
        {
            "review_text": "the game's fun, has a great gameplay - thus still good even when replaying - and a really nice style graphics wise it's also one of the few games that actually made me go for the 100% completion, so...",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, you should play it! :D",
            "review_score": "1"
        },
        {
            "review_text": "Simple yet highly entertaining game.",
            "review_score": "1"
        },
        {
            "review_text": "This game completely won me over. It's a fabulous combination of music, visuals, and gameplay that rewards you for paying attention and being creative. The game is sufficiently difficult to be a challenge for those who seek it, and easy enough that you can get by with button mashing.  It's one of the best entries in the metroidvania genre of 2D action &amp; exploration. Guacamelee has given me hope that game developers still make awe-inspiring magic in these years of shallow spectacle.",
            "review_score": "1"
        },
        {
            "review_text": "A spectacularly crafted Metroidvania like platformer and an extremely satisfying and fun combat system. Oh and plenty of sombreros. Don't think I could ask for anything more then this.  10/10 would Pollo Power again. Go buy it!  ",
            "review_score": "1"
        },
        {
            "review_text": "  Awesome challenging platforming and enemies i only wish there was online play 8/10",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR Mexican Metroidvania, great action, funny dialogue and characters, rendered in a cartoon style with excellent hat-drops to past and present games (in Tech Mex style ;-) ).  Bought after recommendation from a game design podcast suggested it was a near-perfect Metroidvania and I wished to study the style for potentially creating my own. Great fun.  Would die at the hands of skeletal death and embark on a 'the princess is in the other castle' quest as a reincarnated Lucheros again!",
            "review_score": "1"
        },
        {
            "review_text": "Tons of fun",
            "review_score": "1"
        },
        {
            "review_text": "Skeletons. Chozo statues. A talking goat. Countless references to beloved games and movies. Hilarious dialogue. Chickens. Dimension swapping. Incredible fighting combos pulled off in mid-air. Beautifully caricatured Mexican in-game world.  However.... Lime-green shields and yellow shields do not mix with protanopia, unfortunately. I've died multiple times because of that fact.  Update to review: Having played now to the final area, I've been a bit dissappointed and am knocking some from the score. The endgame, for some reason, shifted gears from super fun combo-happy throw-your-enemies-around-the-screen combat to arbitrarily difficult twitch reflexes and unfair fights. You're required to repeatedly shift dimensions perfectly in time, and one horrific fight required you to cling around on walls and hit enemies in mid-air (using a skill I won't reveal) perfectly or else you fall to your death instantly. When I reached the final dungeon itself (this twitch section was the approach), I discovered hordes of the same enemies I'd been fighting the whole game. The only difference was that this area merely replicated the enemies over and over and over, forcing me to fight ten or fifteen of them at the same time. This may sound like normal game design, but keep in mind that half of the enemies are in one dimension and half in the other, meaning that you can't even damage half of them and they're able just to repeatedly hit at you while you try to deal with the other half. If one enemy gets a hit off on you, you're locked in hitstun for quite a while (every hit in Guacamelee results in Juan being launched off his feet) and only pure luck dictates whether another enemy will hit you before you prepare a dodge. In addition, many of these enemies have green or yellow shields. Again, I have protanopia. When I use trial-and-error to hit at a shield and it's the wrong color, allowing the enemy to hit me back and locking me in hitstun, finally killing me and forcing me to begin the entire battle again because I HAVE A STUPID EYE MUTATION BY NONE OF MY OWN CHOICE, that's frustrating. There are no words to describe how frustrating that is. Imagine strolling along on your favourite nature walk, only to find that someone's set a fire and burned down the scenery only to annoy you. That's how frustrating it is. It's so frustrating, in fact, that this update to review is being written after a ragequit. I rarely, rarely, rarely ragequit.  The endgame is bad. It trades the fun combat of the early game for arbitrarily difficult combat against hordes of enemies. The hordes of enemies don't have a trick to them. There isn't any make-the-floor-disappear-so-they-fall-in-the-lava element to them. It's just you versus an unfair set of skeletons with ambiguously-colored shields. Horrible. Now I'm going to have frustrating nightmares and ragequit my night's sleep.   9/10  8/10 for a Metroidvania.",
            "review_score": "1"
        },
        {
            "review_text": "Nice time consuming game. For an indie game this one was really good but I still prefer Child of light inspite this game comediant style.",
            "review_score": "1"
        },
        {
            "review_text": "Like metroidvanias? Then boy do I have the game for you! This game is incredibly fun, the combat is fast and caters to both high and low skill players. The main story is really fun, but whats really great is trying to get all of the orbs to the hidden mask! Its in 6 or 8 parts, and some of the challenges are the hardest ive ever faced! I actually couldnt get the good ending because one is so ♥♥♥♥ing hard to get! And thats my only real gripe is how I got literally everything except ONE orb, and I get the ♥♥♥♥♥♥ ending! Even though it usually rears its head around top20 or 10 hardest gaming challenges lists online. Oh well, still great game, and its also really funny and seeped in mexican culture. Pleasure to play, and to watch!",
            "review_score": "1"
        },
        {
            "review_text": "I'm glad I finally tried this game out and its one of those metroidvania types, which I really enjoy. The game is more casual then challenging but I haven't yet played it on the hard mode which is unlocked after you complete it. Also it felt like the gameplay was about 70/30 or 60/40 of puzzle/combat, but that depends on your willingness to obtain powerups and money.  The game was fun and I'm pretty sure other people will enjoy it if they are fans of the genre.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is a true gem! From the graphics, game play, level design , story, everything about this game is a real delight. Some of the challenges can get frustrating, but it's never so bad where you won't want to try it over again. Visually, this game blows my mind with the fantastic style. Controls are tight and everything feels responsive, but it can get hairy when you're battling a big group of enemies, but that's part of the fun ( and I guess the reason for the Intenso meter) The interaction with the people and NPCS is always sharp and funny. This game has everything you could wish for in a metroidvania, and brings plenty of twists to keep it feeling fresh. In short, I really love this game and can't recommend it enough!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game, good combat system",
            "review_score": "1"
        },
        {
            "review_text": "In might be a better Metroidvania then Metroid. Or Castlevania. It's real good.  I'd recommend playing it with a controller, though.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun and beautiful game. If you like metroidvania, you should definitely play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Just gorgeous great controls great visuals and just wonderful!",
            "review_score": "1"
        },
        {
            "review_text": "You'rea luchador and Satan is a chicken, all packed in a super awesome fun Metroidvania. What more do you want ese?",
            "review_score": "1"
        }
    ]
}