{
    "app_id": 275350,
    "name": "Sentinel 3: Homeworld",
    "release_date": "2014-02-03",
    "developer": [
        "Origin8"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "Strategy",
        "Indie"
    ],
    "achievements": 47,
    "positive_ratings": 73,
    "negative_ratings": 17,
    "price": 4.99,
    "description": "The biggest installment of the award winning Sentinel sci-fi tower defense series now on PC!Take the fight to the alien homeworld and unleash a massive arsenal of weaponry. Get up close and personal on the battlefield in your power armor to execute devastating attacks and support your defenses! * An epic campaign across 20 levels.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/275350/header.jpg?t=1447360198",
    "minimum_requirements": "OS: Windows Windows Vista or Windows 7 Processor: 1.2GHz+ Processor Memory: 1 GB RAM Graphics: OpenGL 1.3 gfx card/driver with 128+MB Video Ram Storage: 300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Pro:  Four difficulty levels.   Double speed option.   You can build and use abilities while the game is paused.   Con:  Options are limited to fullscreen/windowed and sound levels.   Graphics ported directly from the mobile version.   Lazy port with mobile features still intact (e.g. you have to buy upgrade slots).   Respeccing the commander is expensive.   Towers and abilities lack creativity.   Levels take too long.   Little variation in enemies.   Too few placement options.   Conclusion  Sentinel 3 is not the worst TD i've ever played, but it is still soulless, boring and a poor mobile port to boot. I'm getting a refund even though i only paid €1,19 for this, that should say enough.",
            "review_score": "-1"
        },
        {
            "review_text": "So, you are piloting this huge power armor reminiscent of the Tau Commander from Warhammer 40k and one of those ugly robots from Avatar (the movie). Then imagine you are outnumbered, outgunned and outmaneuvered by an evil alien race with infinite numbers of weapons and units. But imagine that despite this, against all odds, you and a handful of auto-turrets and drones join forces and open fire at them while screaming 'THIS IS MY HOMEWORLD, WE WANT HOMEWORLD RELEASED ALREADY!! DAKKA DAKKA DAKKA DAKKA!!'  And boy by that glorious scream the dakka flows.  That's Sentinel 3: Homeworld in a nutshell. A pretty fun tower defense, nowhere near the quality of a Defense Grid but damn fun! Special mention to the OST, which has some sort of trance-house style that reminded me of some PC games of old. Bad points for the surpride dubstep of the main menu theme though. But guess a giant bada$$ mech that stomps enemies and causes shockwaves can go all 'wub wub wub' while firing twin miniguns.  Another special mention to the Laser Tower, aka, the dubstep tower. Seriously, build laser towers and watch those rows of enemies burn all at the same time in a glorious rain of fire.  Considering the game seens to go for sale frequently, this can be a great purchase indeed!",
            "review_score": "1"
        },
        {
            "review_text": "such a good game, good mix of tower defence and a slight RPG elements. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "To be fair, this is a decent game. I'm making a thumb down review because Steam doesn't allow for neutral reviews, and they are many Tower Defenses that I would recommend before this one. The game has most of the basics of TD right, but it lacks anything special that would make it stand out of the crowded TD genre. On sale this could be an ok pick.  + The game as a fair amount of content, with 2 separate campaigns, 2 commanders with different abilities (you can play either campaigns with either commander), and 3 different play modes.  + The economy model is decent rewarding players who spend the less they can for each enemy waves.  - The main issue, is that the various levels are a little too generic, this feeling is increased by the fact that waves are only made of one type of enemy at once, the game merely increasing the number and strength of those enemies. Overall many levels feel too long and repetitive. This may be fine for mobile gameplay but on PC it doesn't work so well. Several times, confident in my defense, I just pressed ALT-TAB and went on reading my mail or browsing the web, just monitoring the game from times to times in the taskbar with aeropeek and switching in only for the occasional boss waves. Here I should point that the second campaign was a bit better in this regard and offered a little more variation and slightly more interesting action.  - Towers can only be placed on specific locations, no “mazing”. The background graphics sometime makes it hard to say if a specific square is build-able or not, this is an unfortunate oversight. ",
            "review_score": "-1"
        }
    ]
}