{
    "app_id": 275570,
    "name": "Summoner",
    "release_date": "2014-03-12",
    "developer": [
        "Volition"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "Fantasy"
    ],
    "achievements": 0,
    "positive_ratings": 225,
    "negative_ratings": 45,
    "price": 4.49,
    "description": "Summoners have toppled empires and challenged gods. They are venerated as saviours and feared as destroyers. With rings crafted by the ancient Khosani, the gifted can call forth demons, dragons, and elementals, but only the strongest can control the forces they unleash.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/275570/header.jpg?t=1490950147",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: 1.8 GHz Processor Memory: 512 MB RAM Graphics: 3D graphics card compatible with DirectX 9.0c DirectX: Version 9.0 Storage: 800 MB available space Sound Card: DirectX 9.0c or better compatible sound card",
    "recommended_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: 1.8 GHz Processor Memory: 1 GB RAM Graphics: 3D graphics card compatible with DirectX 9.0c DirectX: Version 9.0 Storage: 1 GB available space Sound Card: DirectX 9.0c or better compatible sound card",
    "reviews": [
        {
            "review_text": "Blast from the past this one, but in a good way. I remember having many late nights playing Summoner on the PS2. The PC port works fine and I suspect will run on fairly low end rigs. The Graphics are a little muddy looking in places but Summoner's not really the kind of game I play for good visuals. Bottom line is -  If your up for a decent RPG experience with slightly dated visuals then for the price you can't really go wrong. Summoner is one of those games you can sink heaps of time into and still only scratch the surface.  Recommended to any fan of old style RPGS!",
            "review_score": "1"
        },
        {
            "review_text": "[WARNING: NOSTALGIA INTENSIFIES] I was about ten years old when my father bought a gaming magazine. It was rare for him to buy these things, moreso to actually read through them or even install something from the cd. But when I came home from school one of these days, there he was, telling me that he installed this awesome demo where you could walk in the city and there were even rats and shopkeepers and stuff. So I tried it, and I was eternally captured. Was it the design or the great and original music? I kept replaying the demo over and over again. Months went by, it was december, and we stumbled upon the full version in a supermarket. I will never forget the shade of that green box. My parents told me we couldn't afford it and I understood that, but I cried like a little ♥♥♥♥♥ when I got it for Christmas. Still got the original cds, but the beautiful green box is lost because I kept carrying it everywhere with me like a ♥♥♥♥♥♥. I will be thinking of this game on my deathbed. [END OF NOSTALGIA]    Game settings, lore",
            "review_score": "1"
        },
        {
            "review_text": "Summoner, a game that i first played at it's release on ps2. And despite being pretty dull, repetitive, graphically ugly (it was even back then), and raw it still has stayed on my mind all these years. There's a certain charm in this game. The first city stays on your mind forever.  Combat is pretty clunky, relying on timed button pressing to get chains, you can pump out chain attacks as much as you got AP. That's pretty op in the end stages. You get a party of 4 chars, and one slot reserved for your summon. so, 5 slotted party :D I never really found much use for the summons actually, and i haven't grinded my characters especially either. So the game is pretty easy on the combat-aspect. If you're looking for tactical challenge, it's not this game.  The lore is big on this game, that is really the most crafted part of this game, and a big thing that got me into this game. It's interesting, there's a lot of lore you might miss if you don't explore the game. The locations are also intrestingly crafted, the cities feel like cities. There's one dungeon that felt too boring, but otherwise the swamp palace felt logical. Not too big, not too small, something that wuold be built in the real world also.   I wuold like to see this game remade, there's a lot of potential for epic fantasy moments/locations, the island monastery, the giant waterfalls at lenele, the Urath temple.   There's a lot of flaws in this game, nothing game-breaking but annoyances like bad camera movement, clunky combat, sometimes it's really repetitive when enemies spawn when going back to other floors. underneath it all, it's a solid sotry, unique world and that strange, raw charm that somehow gets you interested, and eventually thinking about this game from time to time. With a cheap pricetag, it's a good addition if you're into rpg's.",
            "review_score": "1"
        },
        {
            "review_text": "The second I knew that this game was on steam I slapped down my money to steam and bought it without question. This old classic is still one of my most beloved and remembered RPG games and in fact: this WAS the RPG game to me. It was my first followed by Legend of Dragoon. This games deserves high praise for its depth and powerfully written story, the visuals are beautiful even if they are dated, and the voice acting isnt too bad either! I would love anyone to try this game and experience it for themselves. If you like Lord of the Rings, Inheritence, The Apprentice, and like to get well invested in a world and all it has to offer to you then I can faithfully say without a doubt in my mind Summoner will be a game to follow you forever, whether it was your childhood or a classic you have yet to discover.   However, sadly this port comes with a couple bad cons. NO WINDOWED SUPPORT Unfinished multiplayer addition with some graphic bugs for certain systems and builds.",
            "review_score": "1"
        },
        {
            "review_text": "I first played this game on the Playstation 2 and it took me such a long time to actually decide to sit down and give this game a chance and it was such a wonderful decision. The game may not look the greatest, but the story more than makes up for that. Replaying it on Steam is definitely going to be a different experience, but I enjoy the game as much as I did those years ago.",
            "review_score": "1"
        },
        {
            "review_text": "This game still remains my favorite game of all time. I remember having this game on my PS2 years and years ago. This game feels like an older installment of the Dragon Age series. I love the lore, the characters, and the plot. The side quests are also fun; I recommend using some sort of guide, or you will miss out on tons of loot and side quests.  For only 4 dollars this game is a no-brainer. It is a must buy. Secondly, for such an old game it still gets a 78 metascore, and that is because it is such a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Together with  Darkstone  and  Arcanum  it was one of my first RPGs, right after I bought my first PC, so I can't be objective because of the nostalgia ;) Great graphics, as for 2001, but even today looks quite good.",
            "review_score": "1"
        },
        {
            "review_text": "Classic RPG.  Now port Summoner 2 to PC and make Summoner 3 please.",
            "review_score": "1"
        },
        {
            "review_text": "This game is definiley better then a 78 from metascore. Maybe not a 90, but definitley higher then 78",
            "review_score": "1"
        },
        {
            "review_text": "Played this game back on PS2 and it's just as fun 16 years later",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game to watch the credits.",
            "review_score": "1"
        },
        {
            "review_text": "One of the worst RPGs I've ever played, believe me I tried really hard to like it as well as cut it some slack for its age but some of the game's flaws and problems are absolutely inexcusable.  Everything about this game is inadequate and sloppy.   The story is pretty tropey.  A lot of the game is a massive grind, filled with needless padding.  Combat is very clunky and difficult to manuever around in, especially when as soon as you move enemies crit and slow you if not timed right. The areas you fight in get very repetitive and the random encounters are somewhat nonsensical in terms of ecology.  A lot of the spells feel useless and lack depth.   The world map is so devoid that it is almost senseless to even have it.  The side quests are mostly fetch quests and aren't worth the time in the rewards they give. You could kill enemies in a random encounter and get 10x the reward plus save half the time.  The thing that gets me the most is the shopping and buying equipment.....You can wear two pieces of chainmail for about 30k and it will give you the same protection as a 300-800k suit of armor.  The game has almost every aspect of a first generation game rushed out to a new console, with little planning and foresight....with massive padding so they could claim X hours of gameplay.   It has very few redeeming qualities (I actually like the chaining system). The only people recommending this are doing it out of nostalgia and/or haven't completed the game to really see how bad it gets.",
            "review_score": "-1"
        },
        {
            "review_text": "not sure how to rate this game, I haven't been able to play it once yet. it seems to think I do not have a GC at all...",
            "review_score": "-1"
        },
        {
            "review_text": "Awful. No widescreen or resolutions above 1024xx768. Graphics from 15 years ago. Bad animations. No UI scaling. 6 pages of text tutorial.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best RPG's ive ever played. You will enjoy it",
            "review_score": "1"
        },
        {
            "review_text": "Of all the games I've ever played, this one does something right that everyone else has done wrong. Yeah I barely have any time playing this through Steam, but I played it on Playstation. Didn't beat it, but I got close before my memory card got stolen. Anyway. What does Summoner do right? Okay. Let's look at any other RPG. There are only a few buildings at most, and that is somehow supposed to equate to thousands of soldiers or at least a dozen NPCs? That doesn't make sense. Of course, Guild Wars does it right in the Shing Jea region; but this game was the first. There are lots of apartments and buildings in a HUGE city, and countless NPCs all over the place.  It actually makes sense that there could be a real world with a validly stable housing and civilization size, just looking at the main town. Story isn't bad, either. Just, uh, make sure you play with an open strategy guide because there is a quest through the whole game that you really have to pay attention to in order to complete. You're gonna want the reward, but you'd never figure it out without that guide.  Mish kish fish.",
            "review_score": "1"
        },
        {
            "review_text": "Great, timing-based combat system and huge story. Played this when it first came out on PS2, got it on here for the nostalgias.",
            "review_score": "1"
        },
        {
            "review_text": "Classic. This was a PS2 launch game, so it may not feel groundbreaking like it did back in the day, but none the less it's still a great game with a good storyline.",
            "review_score": "1"
        }
    ]
}