{
    "app_id": 275670,
    "name": "Space Run",
    "release_date": "2014-06-13",
    "developer": [
        "Passtech Games"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "Strategy",
        "Space"
    ],
    "achievements": 30,
    "positive_ratings": 1474,
    "negative_ratings": 232,
    "price": 10.99,
    "description": "Space Run is a «real-time spaceship construction strategy game». Space Run takes the well-known Tower Defense-style gameplay and twists it, challenging you to manage and protect a spaceship and its cargo against the hazards of deep space!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/275670/header.jpg?t=1533809590",
    "minimum_requirements": "OS: WINDOWS XP SP3/WINDOWS VISTA SP2/WINDOWS 7/WINDOWS 8 Processor: AMD/INTEL DUAL-CORE 2.4 GHZ Memory: 2048 MB RAM Graphics: 512 MB 100% OPENGL 2.1 COMPATIBLE NVIDIA GEFORCE 8600/ATI RADEON HD 2600/INTEL HD 2000 Storage: 1 GB available space Sound Card: FMOD COMPATIBLE Additional Notes: INTERNET CONNECTION REQUIRED FOR THE GAME ACTIVATION",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Less of a 'Tower Defense' and more of a 'Point Defense' with a tactical twist. You build onto free hexes on your ship, as you fly towards your goal, and try to defend yourself and your cargo from a constant barrage of enemies. Competently amusing story-dialogues, and genuinely exciting bossfights spice it up rather nicely.  The challenge is derived from the way the game forces you to split your considerations while managing a limited budget: You must choose between weapons, defenses, engines, and other specific needs based on the 'client' you are running the mission for. Focusing on firepower is easy enough, but youll lose speed and get a lower score, which limits your tech-tree advancement. Focusing on speed will get you killed. Choosing the right pieces, at the right times, is vital to getting the best outcome. This becomes more difficult as the game advances, because larger/more-advanced constructions require various levels of power, and because components must be built adjacent to each other in certain ways to function.  If I had to complain about anything in this game, it would be that there is no 'free-play' or 'random' mode. Only the campaign exists, and there is no variance within said campaign. Once you have played all of the levels once, all there is to do is to go back and play them each again, and try to get a higher score. The game ended, for me, before I was ready to put it away, and I was sad to see that no expansions or DLC exist to get more playtime out of it.  But, to say that a game was good enough that it left me wanting more is a compliment in its own right. Definitely worth the price at 15 dollars, and maybe worth more.",
            "review_score": "1"
        },
        {
            "review_text": "✔ Good presentation ✔ Good performance  ✔ Good sound design ✔ Humour ✔ Linux support!  A solid tower defense game, with interesting ideas and a good execution.  Runs very well on Linux.",
            "review_score": "1"
        },
        {
            "review_text": "The fact that you can't reorient the weapons more easily, even the guns that are specifically meant to be reorientable, makes the game feel more like whack-a-mole than some kind of strategy neo-tower defense kind of thing that it tries to be. I can't say I enjoyed my time here too terribly much.  That said, the production quality was pretty alright. If you _really_ like tower defense, you might enjoy this more than I did.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game. I love this game so much. But it's important to know what this game is.   This is not a tower defense game. This is a game about ship management and balancing offense and defense. I'd almost say it's more akin to an RTS base building game as opposed to tower defense. You don't build your ship, then send it off into space and watch what happens. Oh no, you spend the whole flight turning cannons, activating abilities, launching volleys, repairing damage, and collecting currency.   If you're not into micromanaging your ship, you will hate this game. But if you're willing to learn the hotkeys and enjoy managing chaos, you'll love this game.   I think the introduction of speed and asking the player to sacrifice space on their ship for engines in addition to cargo and weapons adds a nice twist on ship building that keeps each level more interesting. It's not all about safe delivery, it's fast AND safe delivery!   I'm not crazy about the levels spawning in a static pattern, so you can simply restart the level and pre-build up your defenses, but the game definitely takes this into account. It challenges you with some pretty beefy bosses that clearly expect you to spend the lion's share of the level preparing for the impending attack.   I enjoy the characters and the voices a great deal. Each contract feels unique to me and each type has special needs.  The game is a challenge, and it can get really stressful at times, but it's totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is outstanding! Really great combination of timing and tactics, and the variety in the missions is really impressive. Kind of like a combination between tower defence and an RTS. I really didn't know what to expect, but I've loved every minute of Spacerun and can't wait for more.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Tower defence game, a lot of fun and very under promoted. If you like games like DG, DG2 you'll love this one.  It's a new spin on tower defence, turning your base into a moving space ship, you have cargo to  protect and some times it's people! the different types of cargo adds a twist to your tower placements.  It's challenging! As you play you'll unlock more and more moduals and upgrade them, but the game will also get harder as you go. So it evens out instead of the unlocked items making it easier, they are instead almost 'needed' to succeed with the highest ratings.  I could play it for free through the family share here with STEAM, still bought it just to support the dev.  ",
            "review_score": "1"
        },
        {
            "review_text": "Fun but only worth a couple hours of your time.  They have a very good idea, solid tech progression, but like others have said, the campaign is lacking and the need to constantly adjust turrets and such is tedious at best.  For some reason I thought that you could set up the look of your ship and thus put the tiles where you want, making room for your cargo, weapons and more. Unfortunately you cannot, and thus lose an aspect of the game that could have made it stellar instead of meh.  I'd recommend it if it's on sale for $5, (I bought it for $9 and think I overpaid), any higher though and it's really just a slightly fun game with a tedious endgame that makes you want to stop playing.  Good effort and a cool idea, just kinda falls flat after a few hours of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This is a tower defense game with a twist. There is no path which the enemy will follow like he's supposed to. Enemies will attack you from all sides, it is up to you to build defenses on your ship to keep you alive. It is not an easy game, after a few levels you will be killed. The idea is you go back to your spacestation and rethink your defenses.   The voiceovers are well done, the jokes are funny, and the graphics are polished. It is a little sad that there are only about 20 to 30 levels in the game, it should have been deeper or randomly generated.  Since the game isn't very easy at all, it will take you a while to complete it.   In short, it's pretty enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Very unique for a tower defense. It is also faster pace then usually.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great reminder of the early games I used to play, only now with advancements in technology, and video it screams out 'Play me', young or old (me 60) this is a good game to play",
            "review_score": "1"
        },
        {
            "review_text": "I used to love tower defense games a few years back. However, they all became very similar - almost cookie-cutter in their design and gameply - making most of them completely undesirable to purchase, or even to play for free. Space Run goes back to doing tower defense the right way. The main feature/attribute that the other tower defense games were missing was that you always had more $$ than you needed. This means there was no strategy needed. None of your decisions mattered. You were going to get to the next level regardless. So, with Space Run, you are back to the [strategic] reality of finite resources. Choose wisely, otehrwise you may not defeat the enemies or the elements.  Just recently I vowed to never purchase another tower defense game. However, Sanctum (1 and 2) made me rethink that decision. And now Im glad Ive purchased Space Run. You can tell if a twoer defense game is good almost immediately and while Ive only played through 5 or 6 missions, I knew right after the intro/tutorial (which isnt even painful) that the game was going to be fun, challenging, worth my time, and more importantly, worth my money. The full price of 14.99 USD seems a little high but the sale price puts the game right into the Goldilocks zone.  Would I recommend the game. Sure thing. And I havent played enough to give it a rating out of a possible ten points. Will add that rating later.",
            "review_score": "1"
        },
        {
            "review_text": "This game is tower defense with a rather unusual twist: Your spaceship is the center of attention and from all planar directions, pirates and asteroids come in to bombard you. As if that weren't enough, you have to balance speed (one more engine) with defense (one more shield) and aggressive defense (one more weapon). Those decisions are made on your hex-based ship, different weapons, defenses, engines and generators feeding the former having increasingly complicated shapes to fit. It's all about finding the right combination of modules in the right places at the right times. In your first tries, you may fail, but later come back with a vengeance, after having reinvested your earnings for fast and possibly safe delivery of goods into the newest technology upgrades. Still, especially the later missions will keep you occupied for quite a while. For the perfectionists, there's a good 30 hours of gameplay, until you unlocked every achievement, doing everything perfectly.  Definitely recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Space run is a fun tower defense game though some additional levels would be nice though the game is fun and well worth playing where some levels are easily failed but due to their nature rarely become tedious.   ",
            "review_score": "1"
        },
        {
            "review_text": "Space Run has humor, charm, wit, and a very decent challenge that is well designed.   The basic concept of Space Run is tower defense, but it takes things in a surprisingly exciting and original direction. Given a ship, a cargo, and an engine, the player constructs weapons, shields and many other devices as needed, all constrained by the limitation of space that the hexagons of the ship represent.  The feeling of flight, of speed is palpable, as the ship soars past planets and asteroid fields, threatened from all sides by every manner of trouble. Pirate ships, tumbling rocks, and even other space truckers all present either a danger, or an opportunity to make cash on the side.  The goal is to protect the cargo and deliver it as quickly as possible - the faster, the better the payoff. But there are strategies that pay well in doddling too, and there are times when it is sensible to hunker down, and times when putting everything into engines is better. It is the diversity of choices, and the continual unlocking of new weapons, shields and engines that make the game entrancing.  Cultural and media references abound - there are nods to everything from Red Dwarf and Blake's Seven to Babylon 5, and more.   Above all, the game is just plain fun. I highly recommend it as a light, enjoyable diversion. Each run takes about ten to fifteen minutes, making it ideal for a quick break or that waiting time before dinner.  This is a casual, but not unchallenging game, that holds a lot of fun in a small package.  It is worth the price. ",
            "review_score": "1"
        },
        {
            "review_text": "An excellent game that offer pretty good time. Not a huge shelf life but well worth the money!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games of 2014 so far. Hands down. It takes a traditional concept and puts an interesting spin on it.  The goal of the game is to make deliveries with a customizable space ship for different companies. Each of those has a different gimmick you have to take into account when doing a mission. Apart from the first company which is kind of generic, but for which you can earn extra money in the later levels if you're good enough. You can skip the story, however. Your ship consists of hexagonal tiles on which you can place various modules. Each module fulfills a different role (separated into offense, defense and power/engines) and can be upgraded 3 times. The visuals are pretty nice actually and game play is fun if you like thinking on the fly and adjusting to situations. You WILL have to micro manage quite a bit in this game, so take that into account before buying it. If you do not like this, then you will not like the game. Period. For all others it is worth the money though.  Pros: - Nice 3D visuals for a 15 € title. - Engaging and interesting game play. Instead of defending a portal or whatever from thousands of minions you have to protect your cargo, which can be individually attacked from marauding pirates. - Enemy variety is pretty decent as well. - On the fly thinking with micro management - Lots of different upgrades, modules and strategies - Trade-off system (You can't just build bigger and stronger guns without a trade-off, i.e. require more space, more power and can't do stuff cheaper modules can. Best example is the guns. You can rotate your level 1 guns and increase their fire rate, but they generally do not do much damage, your level 2 guns, do A TON of damage, but can only be placed in certain angles to your ship, which gives them a very limited fire solution, but you can 'delink' the towers to fire in 2 separate directions. Your biggest gun takes a lot of space and does the most damage, but it can only fire on a fixed location. You will usually only ever have 1 of them at the location where the heavies opposition is coming from. Furthermore you need quite a bit of power and you need at least a tier 2 shield generator to permanently encase them in a protective shield) - Actually good voice actin - There is almost no 'progress wall'. You can repeat missions as often as you like and get the money from it again, which means that you can buy all the upgrades eventually if you think you need them. Some of them are locked behind the 'rating stars' you get for each mission. You can't accumulate those, but so far I have gotten the maximum number of stars for each mission (I have 7 left...I think it's 35-40 in total) and have never encountered a problem here. Of course you will have to complete missions in order to progress to new missions... - Good value (should take you about 10-15 hours to finish depending on luck and skill) - Polished product. No bugs or freezes encountered in about 10 hours game play.  Cons: - There is no pause mode. The game can become pretty hectic, but I suppose this is deliberate. You have to think and act quick - In line with the above it can get VERY confusing to actually find all your modules in a pinch situation and activate the correct ability - There is no auto save or quick save option. If you fail you have to go from the start again. - The story is presented in boring dialogues. The voice acting is good, but there really is no reason to listen to it I'm afraid. You talk to your android co-pilot, your employers and the 2 pirates in the game. All of them have a unique personality (including yourself) which is presented a bit over the top (almost trying too hard, but that is again probably deliberate). - The cutscenes need to be skippable. Every time you start a mission you have to watch your take off again. But the real annoyance comes in the form of the pirate leaders, who get ridiculously long and annoying cutscenes, which you cannot skip completely. You can only skip the dialogue one by one... - You cannot save a ship layout. Every time you fail you will have to create it anew. - Trial and error is involved.  Summary: If you like hectic and unique TD games with a space setting that require micro management, on the fly thinking, good planning AND learning the missions more or less by hard before getting 5 stars and all cargo through (I am looking at you VIP Travel) then this game is for you and the money spent is well invested. If not, then do not buy it and post negative reviews.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite games. Simple as that. It reminds me of Galaxy Trucker in real time. The puzzle element was quite enjoyable; each mission follows a set script so you have to tune your strategy untl you can manage 5 stars.",
            "review_score": "1"
        },
        {
            "review_text": "very addicting game that moves cargo in space useing tower defense  needs hot runs which pays more and more rewards for next time by how you place",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the most unique spins on the tower defense genre. I really enjoy this game, not only are you focusing on defending your ship, you have to maintain it's speed, face adverse effects ranging from space pirates, energy draining cargo, selfish passengers that demand an exposed window seat, time trials, etc. I definitely recommend this game to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "For a Tower Defense game Space Run comes in as an odd duck, but leaves you wanting more missions. Many other reviews say that the game could use a 'pause' feature for building but from someone that is new to tower defense games I honestly like not having it. The need to think ahead and on the go is a challenge, and there are times when the game can be difficult but for myself that like a challenge this is a great thing.   For anyone that has never played a RTS (Real-Time Strategy) game or any tower defense game, Space Run can be a pain, but FUN.   Only thing that is a miss with Space Run is the campaign can feel a bit short for time wise compared to other RTS games. But for the money, 30 hours of first time play though is not too much. Picking you the game on sale would honestly be the best bet.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic take on the tower defense concept. Top notch music, voice acting and graphics. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "While Space Run is a novel idea, there's still room for significant work to be done to make this a real stand out product. It's worth a look, but I'll wager that once players finish the game, it won't have the replay appeal that it deserves.   The Good: A catchy story that engages the player in the sci-fi genre. IMHO, I feel engaged in the story to want my character to make the fast, safe deliveries. I've even played the same job a few times over to get the highest rating and to see what the next job offers entail. This is also necessary as ship options and upgrades aren't cheap.   The Bad: The controls aren't smooth and there's no zoom feature so unless you have a good idea what things look like while they're all clustered together, you may find some frustration when you're placing pieces and even orienting them during the heat of battle. Maybe it's just me, but sometimes the bad guys seem to have too much of an advantage...I'm also open to the idea that I'm not that good of a 'tower defense' player, but this isn't about me. Another aspect I disliked was the fact that destroying a pirate's boosters does not affect their speed. They manage to keep up with you with their one booster while all seven of mine where giving me maximum thrust.   The Superficial: There's some variety in this 'tower defense' space battlefield even though it's simply flying from point A to point B (I would have liked to have seen a navigation screen so that I could at least choose the path my craft is going to take a la Starfox navigation screen on the SNES). The story line adds humor, though your android's responses are repetitive. Maybe the next iteration, we'll get to chose our crew and even chose a different android. I for one would find a sassy female android better company than the annoying Addam-12. I would have also liked the option of selecting the layout of the transport for my deliveries, but the 'one man studio' developer made it work with the one you end up using. Speaking of layouts, Star Wars fans will be happy to see a familiar shape on the BC mission 'Asteroids on Steroids'. While I get that space is vast, I was hoping to see more engaging celestial objects in the background such as a comet, black hole, nebula or star.   Though I do recommend the game, I would hope to see a quantum leap in game controls and other improvements should there be another Space Run. After all, they made a Cannonball Run 2....",
            "review_score": "1"
        },
        {
            "review_text": "It's a cute blend of TD and Endless runner, but not endless.  The level mechanics are fun. It passes the time in a light-hearted and furious way.  Must be a great micromanager to enjoy this game wholeheartedly.  ",
            "review_score": "1"
        },
        {
            "review_text": "Addictive! I want more! ",
            "review_score": "1"
        },
        {
            "review_text": "Game is a lot of fun like tower def. !",
            "review_score": "1"
        },
        {
            "review_text": "Great game, new twist on tower defense, love it!",
            "review_score": "1"
        },
        {
            "review_text": "I loved the idea but not the execution. The ship design should have been left to the player and I often felt like I would have made a better ship. I also would have liked a persistent ship design that I upgraded as the game went on, not just random ♥♥♥♥.   I didn't play long and wont likely return.",
            "review_score": "-1"
        },
        {
            "review_text": "Frantic for a tower defense game. I'm currently enjoying the ♥♥♥♥ out of it.",
            "review_score": "1"
        },
        {
            "review_text": "Very reminiscent of the capitol ship tower building game popular in Starcraft 2, but I mean that in a good way. I've always wanted that mod to be a real game and this game fulfills that completely.  It's a very fast paced, action packed game with a toooon of versatility, especially when compared to most tower defenses. The one thing I do wish it had was a pause button that I could use for building. I'll typically just use the menu pause for figuring out my strategy, but you can't build while paused. Only a minor complaint.  9/10. Good job devs!",
            "review_score": "1"
        },
        {
            "review_text": "If you are a  masochist Galaxy Trucker  like me, you will probably get at least 10-20 hours of fun out of Space Run.  For those who are wondering if this is anything like the board game Galaxy Trucker, I tell you   it is!  With the twist of having both the building and the flying of GT compressed in a single phase.   In ‘Space Run’ you build your ship as you fly, so the impeding urge to build quick is still present and you have little to no time to adapt to the new events of the trip. As you complete your delivery assignments you get money to upgrade your parts (engine, shields, lasers, etc) and if you fail a mission all you have to do is try it again. The events will be the same within each mission, so after 3 to 4 tries you probably ace each level.  You can also re-run the same mission with you newly upgraded gear to try to maximize your score and money. I played around 20 different missions before it got more difficult and I would like to face in this game. I think the game should have some kind of ‘pause to build’ mode for casual players (such as myself).",
            "review_score": "1"
        },
        {
            "review_text": "Space Run is an interesting take on the typical Tower Defense gameplay, and while I'm not a huge fan of these games I did enjoy this one enough that I felt like I got more than my money's worth (Note: I paid ~$5 but I do consider it worth $15 if you can't get it on sale).  Instead of building towers on a stagnant map with a maze like path for lines of mobs to run through toward their goal, you build on a platform (your spaceship) which 'flies' through space and you encounter asteroids, fighters, and larger spaceships. Beyond that it's pretty standard Tower Defense fare, kills things for points, use points to build more towers, complete map for upgrade points to buy upgraded towers, rinse and repeat.  This game also has fun little snippets of dialogue between missions, and good quality voice acting. The graphics are decent, as is the UI, and there were no major bugs during my playtime (the worst things I had happen was it would occasionally glitch after resetting a map, but exitting out to the mission select and starting again always fixed it.)  I had some issues with the game though. For instance, I really didn't care for the tedium of being forced to repeat missions in order to get enough upgrade points to not gimp myself in future missions. Nor did I like the cargo loadout part of the game, that just increaed the odds I would end up handicapping myself since I'd have no idea which parts of the ship would be hardest hit during that mission on the first playthrough. It also seemed like a mistake to force the 'ship' design on the player when in my opinion that should have been a big part of the upgrade system, do well, get a bigger ship, etc. In that way the 'ship' could have also been a persistent RPG element and made the game more interesting.  Again though, that first half was a lot of fun, more than I have in most other games at the same price.",
            "review_score": "1"
        },
        {
            "review_text": "Requires way too much micro for a TD.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is great in its take on the Tower Defense genre (TD). It's attractive, well-balanced and incorporates elements from several similar genres to make for a new and different twist. I wish I could say that I loved every minute of it, but sadly I have stopped playing it after only two hours. See, during the awesome combat scenes, it gets hectic. Very hectic. Attacks of varying types from all different directions. And it happens in real time! But therein lies the problem: the entire game is in real-time. There is no ability to slow down or pause the action to adjust your 'towers' to react to the current and upcoming threats. This games potential is fully and 100% lost on the lack of time-control. If it's possible to patch the game to add this functionality, Passtech Games must do it. Until then...I'm on to the next game!",
            "review_score": "-1"
        },
        {
            "review_text": "Quick &amp; Dirty Review: Excellent fun, 10-15 mins mini missions, tower/ship defence. Worth it.  Slow &amp; Clean Review: Space Run had a lot of similarities to a board game called Galaxy Trucker which I am a big fan of. So I was curious and managed to get it cheap (Thank you Special Deals) but if I had paid full price... it would have been worth it.  Graphics: They are clean and decent for what you need. The 2D space setting makes it a bit weird but considering the gameplay it would be too difficult to add a real 3D element so your ship remains flat and it doesn't really need to be given that extra dimension.  The laser, ion and missile effects are nice. Any system should be able to run this so it's nice knowing your MB's onboard GPU is what is needed.  Sound/Music: The voice acting is enjoyable. It's not out of this world but it gives a really nice depth. The main character comes off likeable and his android 2IC has some great dialogue. Only issues is there isn't more. If they released a DLC with additional audio dialogue esp. for the wise-cracking android I'd buy it immediately.  The music is decent for what you want but it does become repetitive but that's understandable given the music is often the cue for pirate attacks and can be a forewarning before you even detect astroids and other ships on your rader.  Gameplay: It's fun. It doesn't give you any time to prepare and you basically need to build and de-construct on the fly. The missions run between 8-15 minutes with 10 being the average. There is no downside to losing which is both good and bad.   Good because there is no real tutorial and sometimes you just don't know what to build until you've failed. And no one likes to lose credits, reputation or XP.  Bad because there is no down side to dying, you are never really at risk and that means the equiv of having God mode/reset switch on the universe. I think if the pirate factions got upgrades or bonuses it would have shook things up a bit or at least a change to difficulty but all in all it's moderately difficult the first time and getting that 5th Star Rating can be quite difficult if you don't adapt your tactics. I think a survival mode or iron man mode would be a welcome for the hard core gamers out there.  Overall: A fun enjoyable game that is great for when you just want to kill half a hour or need to de-stress from the day. I hope to see a true sequel and looking forward to what Space Run Galaxy might have to offer.  Hope the review helped.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 what is better then a Spaceshipgame or a TDgame, your rigth a Spacetowershipdefencegame XD OK the story is not a big deal deliver stuff from A to B but the gamplay is big fun and 'If it were easy everyone would do it!'",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a cheap, casual game I recommend you try this one. You are an intergalactic delivery man/ smuggler just trying to make your way through the galaxy. You get jobs, and finishing those unlock harder jobs. Its fun to replay these jobs later when you have more upgrades to try and get all the stars for it. You are judged by how much of the cargo you get to the point with, and how fast you get it there. you start out with basic modules, they take one space, and need no power to work. Eventually you will get parts that take lots of space, and need power to work, so you will have to plan out where you place weapons, generators, and defensive systems. Each system also has three upgrades, two active abilities, which take the same resource as building them. The third is a passive boost that happens when you give the system enough power. I just wish there was a pause feature so that you could build stuff and activate abilities without being overwhelmed from all of the enemies on screen.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and pretty original. I strongly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "A moderately challenging game thats really fun. The customizations are great. Limited space on your ship means you have to be very smart and economical about your builds. Dig it.",
            "review_score": "1"
        },
        {
            "review_text": "I am a fan of tower defense and this game is OK. The major downfall of these towers is constantly having to change your los of each tower to react to incoming problems. overall i'd say 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "I am a fan of tower defense and this game is OK. The major downfall of these towers is constantly having to change your los of each tower to react to incoming problems. overall i'd say 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "A well-made Tower-defense style game with well-written characters &amp; story. Not very deep but has a steep learning curve and you will have to replay missions multiple times to unlock everything. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "It's a cool game and I'll put a thumbs up on it but I didn't enjoy it myself. Because of, solely, that the game demands quick mouse/hotkey action. Add 'pause to do things' and we've got a stellar game(pun intended). Every single structure in the game has several abilities to be used strategically. And, one of the cardinal no-nos of TD games, mouse over the money to pick it up. Every level also demands a fast finish time to unlock further tech. So, while there's thinking and strategy to be done, the challenge is just being fast. Solid game, but not for me.",
            "review_score": "1"
        },
        {
            "review_text": "Space Run is an excellent indie title. I must admit, from the screen captures I was a bit sceptical but I took the plunge and purchased on the strength of other reviews. I can add my voice to the chorus and say, just buy this its excellent fun and very well polished.  There is plenty of replay value and more than one way to complete a mission, you can always return to a mission after getting more equipment if you don't get a top score on your first run. It's fast paced and makes you think on your feet. Although the graphics don't look fantastic in the screen captures; in game they are surprisingly detailed and the whole art style just works. There is plenty of tongue in cheek corny humour to keep you amused and the sound effects are also very fitting.  I have found the game to be a very stable and very well polished, bug free title. I genuinely can't level any serious criticism against the game and have thoroughly enjoyed every minute of playing it. Along with 'Don't Starve' this is one of the best Indie games I have ever purchased.",
            "review_score": "1"
        },
        {
            "review_text": "Space, pirates, and tower defense. Normally I do not enjoy the latter, but this time it's well executed and not boring.  Not a long game, took three evenings to finish. Definitely needs more levels.  Recommended; passes the time just fine :)",
            "review_score": "1"
        },
        {
            "review_text": "Space, pirates, and tower defense. Normally I do not enjoy the latter, but this time it's well executed and not boring.  Not a long game, took three evenings to finish. Definitely needs more levels.  Recommended; passes the time just fine :)",
            "review_score": "1"
        },
        {
            "review_text": "Fun and very challenging little game in later levels. Maybe not worth picking up at full price but good for a 50%+ sale if it ever comes along.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun! The other reviews say it all. I keep hoping for a Space Run 2!",
            "review_score": "1"
        },
        {
            "review_text": "100% linear and uninspired. This is basically on the level of a free Appstore/Google Play game. 1/10.  Pros: - Pew pew pew  Cons: You have done everything that's in this game already, unless this is one of the first games you've ever played.",
            "review_score": "-1"
        },
        {
            "review_text": "Need a tactical pause in the game. without this feature its click frensy game, no strategy at all   If you love TD games this isnt for you",
            "review_score": "-1"
        },
        {
            "review_text": "united postal service. in space. with guns. hell yeah!  i totally loved playing this one. if you like to manage, optimize and refine your tactics while your guns blast away at pirates and asteroids till they glow white then this is THE game for you!  however at first you are probably going to suffer a little. i know i did. you have no idea what to do or what to expect. the game mechanics are new and you don't have access to upgrades or better units yet. but that will change and you will improve quickly.  you can't just build a flying bunker with one tiny engine or you will be late and therefore not get the full reward. at the same time you have to keep your cargo safe from pirates and asteroids so you can't just build engines all over the place.  for every mission you get a different ship layout consisting of hex cells. you use these cells to build units and obviously to store your cargo. everything else is up to you. engines, guns, shields and generators need space to build. higher level stuff performs better but takes up more space and usually needs a specific formation of hex cells. and costs more of course. so it's up to you to optimize your placement of units and combine them in the best way possible to get your cargo to its destination quickly and in one piece. and as soon as you get into this game you realize just how many ways there are to combine and optimize your units and their special abilities to max effect while reducing building costs and not wasting a single hex cell on your ship. it's truely awesome.  even after 21 hours i could keep playing this game forever. but you know how it is. suddenly a wild steam sale appears and you aren't even finished with half the stuff you bought last sale. sooner or later you just have to make room for something new.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun! and adictive. spaceships plus tower defense gameplay = awsome!",
            "review_score": "1"
        },
        {
            "review_text": "Don't recommend. poor interface. especially when trying to adjust turret direction.",
            "review_score": "-1"
        },
        {
            "review_text": "Disappointed. The game is really well made, but the challenge style leaves me frustrated. Most games of this type give you the basics, then fold in more options which help refine your strategies as you progress. You build your understanding of the game and develop layered strategies to overcome new challenges.  Each level in this game felt more restricted, like I had less and less to work with. New tower options seemed no better than the options I already had. Increased power, balanced by increased bulk and power requirements, but nothing new with regard to functionality.  I really wanted to like this game, I think the concept is great, but the level design was not my cup of tea.",
            "review_score": "-1"
        },
        {
            "review_text": "Beautiful game, lots of potential, but it shouldn't market itself as tower defence without active pause.",
            "review_score": "-1"
        },
        {
            "review_text": "highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "I usually like fairly challenging games but this one has really made me question my ability to even compete at a 'normal' difficulty. Really wish I could get my money :/",
            "review_score": "-1"
        },
        {
            "review_text": "Could have been a nice game to occupy me for 4-8 hours, but I encountered a glitch where the platforms as well as some of the buildings built don't show. makes it virtually impossible to play and a total waste of money. reinstalling, restarting, reworking graphics settings don't work.   wouldn't recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "To busy :(, I shouldn't have to click on turrets to change their direction. FAIL Lets just assume your in space. Well here in the old none intergalactic civilization EARTH, the US NAVY all weapons turn on their own. I should know, I'm a FC2 Fire Controlmen. That part of the game indicates to me the desire to add a click fest to this game. Thats just not gaming to me. I give this game 2 stars",
            "review_score": "-1"
        },
        {
            "review_text": "Initially fun, quickly gets frustrating and infuriating. Difficulty level is too sharp, even the RPG elements where you get better ship equipment don't help, as they are always too expensive... Overall fun for a few hours, then crap",
            "review_score": "-1"
        },
        {
            "review_text": "Poorly desgined and written as far as game mechanics go, save your money and buy one of the other tower defence games",
            "review_score": "-1"
        },
        {
            "review_text": "First things first: This is a good game.  It plays nicely, it looks well enough and the gameplay keeps you playing 'just one more mission'.  So, on the good side:    interesting entry into the tower defense scenario    challenging    good for a casual game in between    replay value as long as you can still tinker for 'that extra bit' to get 5 stars on every mission.   On the bad side: No custom missions. After playing through, this is what I wanted: define my own ship (with custom layout) and run through a set of challenge maps. I want to optimize my ships layout beyond the strict constraints of pre-placed hex fields. No luck, there, unfortunately. The missions there are, are the missions you get and your ship's hex field layout is always predetermined.  Still, get it. It's fun while it lasts.",
            "review_score": "1"
        },
        {
            "review_text": "I've played approximately 1,363,757,346 different videogames during my lifetime, and this is BY FAR the best videogame I have ever played in my life. IN MY LIFE.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun Tower Defense with a twist. It gets quite challenging and has a little bit of trial and error. Overall, an enjoyable experience.",
            "review_score": "1"
        },
        {
            "review_text": "Have not much time for games, so I choose carefully, and choosen this one. I'm not dissapointed. Nice crossing of some popular mechanics but it's mostly quite oryginal tower defense. I like it very much :) Nice job!",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game can become addictive. At least you forget the time. The graphics are like a leggo build on a computer. Unlike other better graphic games one is not bored silly. The dialog is childish. The good thing about this game is that you do not have to do exciting things like mining, play for weeks on end to get upgrades and best of all one does not have to spend real money to get new ships or upgrades.",
            "review_score": "1"
        },
        {
            "review_text": "I quite enjoyed this game. It struck a nice balance between planning a good strategy and being able to adjust/repair/etc. It wasn't too frantic, which I enjoyed, as many games of this nature tend to either lean so hard on the strategy as to be 'set and forget' or are so fast paced that strategy is replaced by reaction speed. The downsides are that it's somewhat short, and upgrade pricing is a little on the steep side so repetitive gameplay is required to unlock everything. I would buy a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "This is an good tower defence type game. The levels are challenging and the gameplay is solid. Nice little game to play if you are short on time.",
            "review_score": "1"
        },
        {
            "review_text": "Fun take on the TD style games. Would wait for it to go on sale though.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Tower Defence(TD) game I have ever played! Very fast pace, lots of micro, and entremely engaging! You get a set ship layout for each mission which you than build towers and engines on. Engines make it so you get a bonus to how much cargo you kept alive. Towers help you make it to the end alive. You have many upgrades which you unlock throughout the game. Missions can be played more than once and which time you beat it you get money to spend on upgrades. Anyone who likes TDs get this game! Totally worth $20+",
            "review_score": "1"
        },
        {
            "review_text": "If you do not pay any attention to the writing, voice acting, or characters, this is actually a fun little game.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun TD with lots of big guns that can blast asteroids to dust.",
            "review_score": "1"
        },
        {
            "review_text": "Fun time blowing game. Insteresting graphics and a new take on tower defence game styles. Would like to see some more missions, but there always room for DLC.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome TD! There are a lot of TD out there, some bad, and some awesome. The awesome are: Defense Grid, Desktop TD, Kingdom Rush (some of the brilliant SC2 mods/arcade of course) and this; Space Run. Had my doubts since it looks a bit weird floating around in space bulding on something that does not look like a space ship, but I was wrong. This is great!  Space Run requires a bit more reaction time than the most of the otther TD´s (mentioned above), and is a little bit more hectic/action, but all in all a great game for all fans of the TD genre.  Agree with this, as found in the reviews: “Really good spin on tower defense! Really enjoyable, fun game with a lot of depth and a great deal of challenge.”  TotalBiscuit   ",
            "review_score": "1"
        },
        {
            "review_text": "8.5/10  First and most important: DO NOT think of this as a tower defense game to sit back after building your 'towers' and watch your enemies slaughter themselves upon your defenses;  DO think of it as tower defense game in which constant care and strategy will be needed to fend off the denizens of space intent on harassing and stealing your cargo.   Part of the fun of this game is the micro: switching your guns between various modes, reorienting to aim in the right direction, activating special abilities of the constructions. All fairly simple, in terms of microing, and very rarely did I have those misclick moments where everything went suddenly sideways because I falsely thought I had activated an ability.  Pros: Inventive Fun Easy-to-use interface Multiple ways to upgrade/arm yourself Good level replay value as you upgrade  Cons: If I hear that Android's ridiculous commentary one more time, I'll delete his data so hard he'll.... Repetitive, unoriginal, OBNOXIOUS exclamations.  Strategy for each level is often formed after playing the level several times to get the feel for how the enemy waves spawn, because those spawns do not change Voice 'acting' is somewhat...ridiculous.  Honestly, for full price I don't know ($14.99), but if it's on sale, definitely worth the purchase!  If they added a 'build your own ship framework' option to essentially 'build your own level' that would be awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Usually tower defense games get dull for me but this grew on me really quickly. It's unique, engaging as far as characters and voice acting goes and has some really fun storylines.",
            "review_score": "1"
        },
        {
            "review_text": "Space Run is lots of fun, quite simply put. It is a strategy-action tower defense game, the strategy being the careful (or purely random, as you fancy) placement of towers and the action being the pleasure of watching lots of enemy ships (and platforms) explode on your screen. Space Run has you coming back for more, with difficult runs (missions) that require multiple play-throughs to understand the best way to tackle them. Some runs are worth doing several times, even though you beat them quite easily.  The power-ups, weapons, and various 'towers' that you can build have you coming back for more, not to mention the good graphics and rather funny story (you're a courier boy and sometimes, you courier toxic waste... go figure).  I would recommend this game to anyone and warn them of the many hours they'll spend playing it. Good job game devs. God bless.",
            "review_score": "1"
        },
        {
            "review_text": "This was a great little time waster. Totally worth the money. The 'campaign' itself is fairly short, but I still managed to spend 30 hours in the game.   The tech tree is well designed, and varies enough that you never stop using the early technologies. They remain useful (often the best choice) all through the game.  The little shout-outs to other sci-fi franchises are a fun addition as well. You'll recognize many of the ship silhouettes.  As long as you realize that the game doesn't have a ton of content going in, I'd give this game a 3+ with a re-roll. It could definitely use some DLC though...just a few more new missions. Please?",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this orginal take on the Tower Defence genre very much !  Challenging missions, entertaining dialogues, lots of upgrades &amp; high replay value ! Got me hooked enough to 100% it :p",
            "review_score": "1"
        },
        {
            "review_text": "This game provides more of a puzzle challenge than most of the tower defense games that I'm familliar with. I got about 20 hours of play out of it, and enjoyed every minute. The game features unlockable upgrades that you earn for completing levels, gradually your selection of towers expands and allows for more finite control over how you solve the puzzles. Over all it is a great game and I highly recommend it. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun twist to a tower defense game. The only thing I think it needs is an endless mode. I am 5 missions from beating the game. After replaying the old missions to max out stars and upgrades, I feel that there isn't anything else to do once you beat the game.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game. Not an enormous level of 'story', but just enough to string together an exploration of many different combinations of challenge.  Space Run is a fast, fun combination of tower defence (sort of) and resource management genres, set in an interesting environment.  I have really enjoyed playing this.",
            "review_score": "1"
        },
        {
            "review_text": "Very solid game. Like a tower defense game where the tower moves through a course instead of baddies moving through your course.",
            "review_score": "1"
        },
        {
            "review_text": "Neat tower defence game but tower defences might be more up your alley",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great take on tower defense. The levels and level types each present a unique challenge and require different strategies. The characters and their interactions are comical without being over the top, and there is an appropriate balance between gameplay and story (appropriate for the genre). The standard difficulty is challenging yet approachable. The music compliments the game. All in all, a great deal for a very enjoyable game.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun Tower Defense with a twist. It gets quite challenging and has a little bit of trial and error. Overall, an enjoyable experience.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, little too short, but you can't blame them at this price. Must play for tower defense fans.",
            "review_score": "1"
        },
        {
            "review_text": "A really interesting and inituitive take on strategy bult up with a simple but good looking graphics system. This is the next level of Indie games.  In space run you are given the task of making it from point A to point B, you fly a space ship holding valuable cargo and it must make its way to base via a route as quick as possible, this basicly means youre flying in the face of danger. Worry not, for your tools against imminent doom are plentiful. As you fly, topspeed, you must find a balance betwen speed, survival and offence using resources gained in the heat of battle to build extra engines, turrets and other spaceship goodies.  The game has the basic addictive tenets of most tower defense games, but suffers slightly less replayability since its basic premise is to complete a combative time-trial, meaning that there is no 'endless mode' as is for most tower defense games, and yes this is a tower defense game. Although space ships are involved, your ships 'movement' is a direct path orchestrated by your cargo supplier in each mission, and your opponents invariably show up to lay the hurt on you.  The intesting extra twist that makes this game fun is that you are not protecting a base,but rather, you ARE the base. As you take damage your cargo gets destroyed and your ship gets dismantled, that means your reward and rank for completing the mission goes down and the space you have to build stuff shrinks. Furthermore, because youre on the clock, bunkering down is not a valid tactic, you need to go fast enough to complete the mission (with extra rewards for accomplishing it post-haste) and you need to be tough enough to survive attacks (and preferably kill the attackers to harvest their loot, lest you become too starved for cash to survive against the ever tougher enemies).  I highly reccomend this game to fans of RTS, TD , Strategy games and Indie games in general.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really amazing game if you like tower defense, you get a hex-based frame to load cargo on, then you have to power and defend the ship and cargo through set levels of enemies and obstacles. The mid game suffers a bit from wonky ship frames that make it really hard to fit what you need(want) on them, but once you're through that part of the game it gets a lot more fun.   My only real critique is that there isn't an easy way to plan out your ship in-game or to re-orient or use abilities right when you need to since it's all in real-time, being able to pause in the way you can in say FTL would be very welcome, but I could see how that might ruin some of the action.   It probably doens't have much replayability since all of the levels have static spawns, but it is a real blast.",
            "review_score": "1"
        },
        {
            "review_text": "once you get over just trying to beat the game and you start experimenting you find a lot of different combinations that work. i know there's some tech you just wouldnt touch, but if you work with it you'll wonder how you lived without it.",
            "review_score": "1"
        },
        {
            "review_text": "if you like the board game galaxy trucker, get this game!!",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game. kinda of predictable ok for younger kids.",
            "review_score": "1"
        },
        {
            "review_text": "Easy to slightly challenging on normal levels of play. Enjoyable way to kill some time if you like tower games",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Short tho' ... get some new ♥♥♥♥, finished in 2 days some 12h playing :p",
            "review_score": "1"
        },
        {
            "review_text": "A variant of tower defense where your ship is made of tiles in which you can buy and place a variety of offensive, defensive, and utility structures. Story is minimal and is just something to string together the scenarios but there's enough flavor, humor, and characters with personality (although one-dimensional/no development) that it strings it together well enough for me.  You need to balance your combat structures (that destroy things to gain more money and let you survive to the end) with engine structures (that are necessary for speed bonuses). You unlock new structures by spending points you gain by completing mission objectives. You'll have to grind a little but it isn't so bad if you like to spend time repeating missions to try and get a 5-star rank. However, sometimes it's better to just come back later when you've unlocked the better (although more expensive to place) structures.  There are four types of scenarios, each with unique structures you're forced to place onto the ship that waste space and sometimes have additional negative effects.  It feels like scenarios aren't randomly generated. There are set tiles and seemingly set enemy spawns and patterns. It's pretty nice from a puzzle/high-score aspect because you can figure out and optimize the best build order. I'm pretty surprised that there is no score attack mode/leaderboards because it feels like it would fit well. However, not having randomly generated missions also means that anyone who really likes it will run out of 'fresh' content.  I would have liked to be able to switch difficulty (rather than be locked into one difficulty the whole time). Or at least be able to have all difficulties on the same profile so you can easily switch between difficulties (and progress is separate for each difficulty). As it is you'd have to go back to the main menu to switch profiles for a different difficulty.  Worth a look for people who enjoy tower defense and would like something with a little spin on it.",
            "review_score": "1"
        },
        {
            "review_text": "It's been sometime I played this but decided to give it proper love.  The game is awesome. Just buy the damn thing and be a cheap ♥♥♥♥♥♥♥.  You might wanna check the sequel Space Run Galaxy.  Now go deliver some goods.",
            "review_score": "1"
        },
        {
            "review_text": "Played for a couple of hours so far and am enjoying it. It does get a bit frantic at times, but so far nothing I can't handle. The ability to adjust firing arcs while paused would be nice to have, but I think it's more challenging this way. All in all, definitely worth my money.",
            "review_score": "1"
        },
        {
            "review_text": "Great original take on an old formula.",
            "review_score": "1"
        },
        {
            "review_text": "Space Run is a nice revamp on standard tower defense games. Instead of having a static playing field, you build your modules on a ship where the danger can elevate in an instant. Because there are few breaks in-between waves and no pause feature, things can get hectic pretty fast, but I think that adds to the overall fun of the game! The game is a little glitchy, but it's nothing too bad that will mess you up in a fight. If you're into tower defense games, you will like this!",
            "review_score": "1"
        },
        {
            "review_text": "Its like tower defense but not \\(o-o)/ it adds something new and if you like tower defense game you will probly like this game",
            "review_score": "1"
        },
        {
            "review_text": "Lovely stuff!",
            "review_score": "1"
        },
        {
            "review_text": "Jumped the gun and bought the game. No regrets yet.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game. It's the perfect mix of tower defense and strategy. My only complaint is the annoying sidekick android commentary that is on loop. If I could zap him with an EMP, I would. You'll be wishing you could too on the twelve-hundredth-'I hope you can fly better than you build'-comment. Truly the most frustrating part of this game.  Developers: If you're going to have a comic relief character and you want it to come across as snarky, give him more then 3 lines so we don't have to suffer the endless 'you suck' on loop, and maybe make it a little less degrading. Eh?",
            "review_score": "1"
        },
        {
            "review_text": "A space themed tower defence with many ways of getting through it. Will require a bit of manual dexterity along with tactical thinking. The game is ment to be a real time thing, as most, is not all games of gerne,  20 hours is enough to get to the end of it with ~70% of achievements.  Might have been somewhat cheaper or longer tho...",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun Tower Defense that gets a bit hectic in the later levels.",
            "review_score": "1"
        },
        {
            "review_text": "This is basically an action version of Galaxy Trucker. I LOVE Galaxy Trucker, and if you like fighting against the odds in space as you haul cargo of all shapes and sizes (and varying mechanics) you will enjoy this game. I've already gotten my moneys worth, get yours!",
            "review_score": "1"
        },
        {
            "review_text": "If you like space genre and tower defense or just fun ( sometimes frustrating :))) game then it is for you. If you dont have hours of free time then this is game for you, each mission takes up to half hour. Also voice is from Starcraft and dialogues are fun and there are many jokes.",
            "review_score": "1"
        },
        {
            "review_text": "Hey guys its quite fun but is it just me? Or the game crashes quite often (first 10-12 missions no problem) and than it crashed for the first time ... and after that once every hour of gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Good Tower defense game. Gave me some good hours of casual fun with a nice learning curve and chalenging levels =) I higly recomend to buy in a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Overall, a really fun game with decent difficulty. All the weapons and what-not are well balanced, so you'll often find yourself using a different tactic on each level instead of finding one overpowered combo and yawning your way through the game. Definitely a must have if you're a tower-defense junkie like myself.",
            "review_score": "1"
        },
        {
            "review_text": "Cool strategy/Turret defence game. Easy at first if you get the basics, but it gets harder fast. my expectations were meet 100 %!  BUY IT &amp; TRY IT!!!",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun, cool idea, thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent Speedrun/Tower Defense Hybrid. Features a Meh level Storyline, but that's not why you play TD in the first place.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, and at the end of the day, isn't that what games are supposed to be. This game has taken the oft-abused genre of tower defence and added a new spice to it. The need to not only survive the battles but also try and get there as quickly as possible does add some tactical flavour to this game.  This game could have been outstanding if it weren't for the fact that some of the missions are only achievable (for a fast run time that is) by using equipment that only unlocks at later levels. I guess this is a way for the game to maximise playability, but still, the game would rate better if it depended more on skill and not just better equipment.  All in all though, worth my time and money.  And Robert Clotworthy, a.k.a. Jim Raynor in Star Craft 2 for the voice acting, awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Good idea, nice graphic. More levels, It's will be great.",
            "review_score": "1"
        },
        {
            "review_text": "Kind of a reversed tower defense if that makes sense. A solid game, very fun and worth playing through multiple times.",
            "review_score": "1"
        },
        {
            "review_text": "Space Run is a good and notably different take on the tower defense genre. It's well-produced, has amusing characters, a good variety of 'buildings' and abilities, and the campaign has a lot of variety and a good difficulty curve.  Its balance isn't perfect, and some missions are fairly limited by your cargo. There are about half a dozen different kinds of cargo, each with different effects ranging from simply taking up space to draining power around them. Some of these types of cargo missions are lots of fun, but I found two of them to be rather unenjoyable. Luxury passengers and alien artifacts have mechanics that severely limit what modules you can practically use, and the restrictions diminished the gameplay rather than making it more interesting.  It's also rather frenetic, for a tower defense-style game. I would have appreciated a pause mode that let you issues commands, but the game seems very built around the semi-frantic pacing. It's not intrinsically bad, but some people may not like that aspect.  Overall, Space Run is a lot of fun, and it's pretty unique in the things it does. The above caveats shouldn't push you away unless you really don't like the sound of the game's speed.",
            "review_score": "1"
        },
        {
            "review_text": "Decent replay value, if you're a completionist. 20 unique missions, but most of the challenge not from learning the game, but from learning the missions. There's a lot of ♥♥♥♥ moves where the entire time enemies only spawn on one side of your ship so you beef up your weapons, armour, etc entirely on that side. . . then a big wave comes at the other side all at once. Since you just spent all your money on engines to get 5 stars you now can't build any guns on that side, so you just have to take it like a ♥♥♥♥♥ and deal with only getting 3/4 stars from having half your ship blown up, or just restart the mission.  Still, it's a fun reverse TD/strategy game. There's a metagame that involves upgrading your parts/perks that make it almost laughably easy when you revist the early levels after beating the full game. The last few missions of each line are still legitimately challenging though.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun tower defense variation. Definitely looking forward to a possible sequel and/or extra content for the first game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, let's get some more missions, DLC, and/or a sequel going...preferrably starring Michael Jordan, he isn't doing sheet these days and loves space-themed media.   But Seriously I had some good aracade fun with this one.",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend Space Run but....  Space Run is a fun game, but because of the low ammount of content and possible play styles i wouldn't recommend buying it at full price. If you are looking for a challenge you shouldn't play on normal cause it was quit easy.",
            "review_score": "1"
        },
        {
            "review_text": "It's a sort of hybrid space-shooter and tower defense where the goal is to build weapons, engines, and other hardware on to your spaceship and make The Kessel Run in less than twelve parsecs. It is fairly easy to pick up and play, but offers plenty of customization and upgrades to your hardware. You'll easily find yourself replaying many of the missions to five-star them, gain money for upgrades, and learn the pattern to finish the level flawlessly. I enjoyed it and intend to keep playing.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. Script/dialog is a little stilted in my opinion, but amusing enough, and the core tower defense game play is solid.",
            "review_score": "1"
        },
        {
            "review_text": "Brown Beard is the best!! I really hope for a sequel and Brown Nose is in it. The voice acting was hilarious the script authors did a fantastic job I just wish there was more. Hahaha he said surrender his booty!!",
            "review_score": "1"
        },
        {
            "review_text": "great twist on the old tower defense mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, unique way to do tover defence game and it work, los of fun",
            "review_score": "1"
        },
        {
            "review_text": "Overall good game, short story, but if you want 5 stars at every mission you're going to spend quite some time!  I recommend this game if you like strategy/puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "Rare style of Defence game. ",
            "review_score": "1"
        }
    ]
}