{
    "app_id": 276360,
    "name": "Riding Star - Horse Championship!",
    "release_date": "2014-03-27",
    "developer": [
        "Sproing"
    ],
    "publisher": [
        "familyplay"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Casual",
        "Simulation",
        "Horses"
    ],
    "achievements": 0,
    "positive_ratings": 23,
    "negative_ratings": 20,
    "price": 6.99,
    "description": "Ride like a world champion! Breathtaking action, challenges in show jumping, dressage and cross country riding are waiting for your talent.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/276360/header.jpg?t=1540457311",
    "minimum_requirements": "OS: Windows Vista/7/8/1 Processor: Intel  Pentium  (or  similar  AMD)  1.5  GHz Memory: 256 MB RAM Graphics: Direct 3D compatible graphics card with 128 MB RAM DirectX: Version 9.0 Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The Dressage portion has you use WASD, the arrow keys, and the mouse all at the same time. This would be awesome if I had 3 hands",
            "review_score": "1"
        },
        {
            "review_text": "'Ride like a world champion! Breathtaking action, challenges in show jumping, dressage and cross country riding are waiting for your talent. You train rides and horses and lead them to success.'  When I received this thoughtful gift from one of my friends I knew it was like a sign, ney ... a calling to greater things. In his message he told me 'Schnall dich an', which means something like 'brace yourself' and boy did I have to. I imagined myself riding gracefully into the sunset, the sea buzzing in my ears. Then I heard from him about the upcoming features and was blown away: 12vs12 epic scale horse battles with build-in matchmaking system. We both can't wait for what's to come.  10/10 - Can't get this thing to run.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pure furstation, the controls are wonky and if your horse even a little bit off center for a jump it will refuse.  The grooming is annoying as you have to status bar to see how groomed your horse is, you just have to keep going until it says you're done.  The training is super repeative you just go around the same course over and over until your horse is trained enough for the competition.  The Cross Country and Show Jumping do not show how many faults you have on the screen, not to mention the Cross Country has really tight turns that would never be in a real Cross Country event.  The Dressage is good if you want to test how long your temper holds, it expects you to use the mouse and all four arrow keys at the same time to perform a 'figure'. You're supposed to press the right and left arrow keys to keep in 'harmony' with your horse, but this rarely ever works you must do this while keeping your mouse pointed in a certian direction and trying to steer your horse so it stays on course.  And it the higher competion levels you have to do the Dressage 3 times in a row, I've never seen a Dressage event that has 3 'rounds'.  Packed nearly 9 hours into this trying to figure out the controls, all I got in return was frustration.  The horse customzation sucks, you get to pick from three coats and a mane and tail colour. Can't even change the markings. You can edit the tack but half the tack is locked until you win the events.  You can free ride but the world is so ugly I can't stand using that feature.  If you're looking for a good horse game on Steam, try My Riding Stables 2: Life with Horses and pretend this game does not exist.",
            "review_score": "-1"
        }
    ]
}