{
    "app_id": 276810,
    "name": "Mordheim: City of the Damned",
    "release_date": "2015-11-19",
    "developer": [
        "Rogue Factor"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Tactical",
        "Games Workshop",
        "Turn-Based"
    ],
    "achievements": 109,
    "positive_ratings": 3596,
    "negative_ratings": 1614,
    "price": 29.99,
    "description": "Mordheim: City of the Damned is the first video game adaptation of Games Workshop's cult classic tabletop game Mordheim. Set in the Warhammer World's decimated Empire city, Mordheim: City of the Damned is a turn-based tactical game where you lead warbands into bloody and lethal skirmishes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/276810/header.jpg?t=1549361592",
    "minimum_requirements": "OS: Windows Vista 64bit, Window 7 64bit, Windows 8 64bit, Windows 10 64bit (32bit OS not supported) Processor: AMD/INTEL Dual-Core 2.4 GHz Memory: 4096 MB RAM Graphics: 1024 MB DirectX 9.0c compatible AMD Radeon HD 5850/NVIDIA GeForce GTX 460 or higher DirectX: Version 9.0c Network: Broadband Internet connection Storage: 8 GB available space Sound Card: DirectX 9 compatible Additional Notes: Internet connection required for online gaming and game activation",
    "recommended_requirements": "OS: Windows Vista 64bit, Window 7 64bit, Windows 8 64bit, Windows 10 64bit (32bit OS not supported) Processor: Intel Core i5-2500K @ 3.3 GHz or AMD FX-8350 @ 4.0 GHz Memory: 4096 MB RAM Graphics: 2048 MB DirectX 9.0c compatible AMD Radeon R9 270/NVIDIA GeForce GTX 670 or higher DirectX: Version 9.0c Network: Broadband Internet connection Storage: 8 GB available space Sound Card: DirectX 9 compatible Additional Notes: Internet connection required for online gaming and game activation",
    "reviews": [
        {
            "review_text": "When reading reviews for this game pay attention to the hours played. The people complaing about the AI being too hard or the RNG throwing off the game are mostly all still playing with low level characters. When you first start out, your soldiers are lvl 0. Of course they will miss alot and get their ♥♥♥ kicked. If you keep them in groups they will support eachother and you'll level up pretty quick. I have a lvl 6 soldier who can kill enemies in one or two turns at the most... just a few levels prior he was getting his butt kicked almost every battle.   About the game itself... if you like turn based games like X Com, or you D&amp;D, or X Wing Miniatures... and want a fantasy theme... this game is great. I enjoy it a lot. The graphics are cool... the environments have a nice mood and feel. The battles are very strategic and challenging. The game doesn't allow do overs so you have to play with caution if you want to keep your soldiers around for many more battles. I'm having a blast playing it and think its worth the money. Glad I bought it and would recommend it to anyone who likes these kind of gams.",
            "review_score": "1"
        },
        {
            "review_text": "Reasons not to get this game: 1. You get upset if you've spent a good bit of time working on building a character up only to have him killed by a 1/1000 chance occurence that you couldn't do anything about. 2. You think games need to have save slots that you can reload if you make a mistake. 3. You don't want a game that has a moderate learning curve and no forgiveness whatsoever 4. You only want to fight - This is a game about trying to scavenge items in the middle of a battle. 5. You are spoiled by AAA titles.  If none of these apply to you and you want a difficult strategy game with good replayabliity, you probably should try this one out. The gameplay is excellent and my only real complaints are the minor bugs in the AI and that I'm greedy and want more content (warbands, maps, hired swords, etc.).",
            "review_score": "1"
        },
        {
            "review_text": "Pros: -Warhammer game which guarentees excellent characters and story. -Maps are beautiful rendered with a few randomly generated features and because of how quickly the AI mindlessly charges you, will never get to explore it and realize just how similar the maps really are. -Permanent consequences and wyrdstone shipment requirements make gameplay much more intense and involving. -Campaign missions are very well done and each faction has a well detailed story that gives some purpose to your warband's struggle beyond just grabbing loot.  Cons: -Heavy reliance on RNG takes away from the strategy aspect and turns every engagement into little more than a game of dice, which more often than not, will feel heavily weighted in the AI's favor. -AI feels less like a rival warband attempting to seize as much loot as they safely can before engaging in battle and more like a suicidal band of madmen/madwomen with a pathological hatred of you. It will simply charge you with whatever units it has as soon as the game starts and will largely ignore even the most valuable loot along the way. -Only way to replace units is to either hire level 0 scrubs who will be wiped out in 2 attacks later in the game or pay exhorbatant fees to hire from a weekly pool of randomly generated warriors who still are just barely a few levels higher than 0. Advancing along the games campaign and smuggling system will give a free higher level unit, but in a game so heavily reliant on RNG with such aggressive AI this will not make up for the heavy number of losses you are likely to experience. -Small number of factions combined with a very simplistic AI creates tremendous repitition with the tedium only broken by campaign missions. -Loading screens long enough for you to pick up a new hobby. -Clunky UI. Although I hear is much better if you use a controller but I was not that fortunate.  My experience with this game has felt a lot less like some tactician and more like a compulsive gambler who enjoyed the ups and downs of such a hardcore game but every gambler has a point where they realize the pain of the game has finally outweighed the enjoyment. Mine came when I had 4 critical hits on three different characters and my leader killed himself with a 9999 damage bad luck roll all in one turn. That was the last straw that made me realize the game just wasn't enough fun for me to be worth such frustration.",
            "review_score": "-1"
        },
        {
            "review_text": "Let me tell you the tale of Kashmet, the One Armed Rat. Kashmet was recruited to be the commander of the Vargen Front. A Scaven warband tasked at recovering warpstone from the depths of Mordheim. Kashmet had a loyal warband behind him. His officers, Mik Varr and Drac Rat watched his back and as he led them to victory over and over. As the Vargen Front grew so did they the attention of larger warbands that feared the rats may steal their warp stone from under their noses. Be it overconfidence or stubbornness, the Vargen Front decided to attack the rather powerful 'Cult of the Possesed.' The battle ended in a decisive defeat. Several clan rats where slain and the commanders all suffered permanent injury. Drac Rat lost a leg, but he shrugged it off. He was already slow from the heavy armor he wore, being a little bit slower won't hurt. Mik Varr lost his right eye, limiting his aim with ranged weapons, but as an assassin he preferred to stab his opponents in the back anyway. Kashmet lost an arm though. He could no longer wield his dual warp blades, who's green glow struck fear in his enemies. Unsure of his usefullness, Kashmet went into battle wielding only a club. Instead of being a handicap to the team, Kashmet beat indescribable amounts of ♥♥♥. Not afraid of death, he charged headfirst into battle with his club. Many a foe received a cracked skull at his hand. Fear of the One Armed Rat spread through the rivaling warbands. Under the leadership of the One Armed Rat, the Vargen Front: Decimated the Cult of the Possessed, Burned Empire ship yards, and destroyed the burrows of the Black Paw Clan. Kashmet's status in the Under Empire grew and grew, but all great hero's must fall. The Vargen Front was charged with destroying the Temple of Sigmar in the name of the Horned Rat. An ambitious mission that Kashmet was honored to accept. It was during this mission that the One Armed Rat squared off against a Maiden of Sigmar. As an elite unit, Maiden's of Sigmar are avatars of the god. Normally one would not face such an impressive foe alone, but drastic times called for drastic decisions. The Vargen Front's flank had been broken. A Matriarch and lesser sisters has reached the more delicate members of the warband and Mik Varr's scouts had suffered injuries and to fall back. As the warp guards reinforced the flank, the Maiden showed her self. She approached wrapped in a holy light carrying a mighty war hammer. She had to be held off until the warband could reorganize their ranks. Kashmet met the Maiden in one on one combat. The Maiden hit hard, but Kashmet was fast. He dodged her slow, but powerful blows and lashed back over and over. Slowly he whittled her down. With gnashing teeth and cunning feats of agility, the One Armed Rat seemed to be besting the Maiden until she finally land a blow. Her mighty war hammer brutaly caved in the skull of the One Armed Rat, slaying him. Although their leader was defeated, the Vargen Front still achieved victory. The Temple Burned in the name of the One Armed Rat.  That wall of text was the story of my favorite character from Mordheim: City of the Dammed. I have never cared so much about any character I have created in any game. He died a few days ago and I am still sad about it.  About the game though. Mordheim is a tactical rpg like Fire Emblem or XCOM. Just like those games it is absolutely brutal. When a unit is defeated in battle, instead of dying right there, they have a chance to just be injured. It can be a light wound or a permanent injury. You can chose from 4 different warbands, Scaven, Sisters of Sigmar, Cult of the Possessed, and Empire Mercenaries. The aim of the game is to scavenge the fallen city of Mordheim for Ward Stone and sell it for profit. As your warband grows you can hire new units, level up each units stats, and buy new gear for individual units. Its a complex game with a very high learning curve. The online play is brutal because your units can still be injured, but it feels so good to get the hate mail when you kill some fools. The developers are very active and the game receives patches every two weeks. They plan on adding new warbands soon. This is without a doubt my favorite game of the year.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking at the reviews, then this game already appeals to you on some level; maybe you enjoy turn based RPGs, games like XCOM, or board game/table tops?   If so, I can't think of a reason to hesitate in picking this game up. It's punishing but it's immersive, time-absorbing and very rewarding.   It's a weighty and substantial tactical offering that any fan of the genre should play really.    I will add one caveat, given the trend of reviews since the sale started. If you want instant gratification and are unfamilar with how RNG works, or are unwilling to get over the tough start at the beginning, then maybe you should proceed with caution. For everyone else, enjoy :)",
            "review_score": "1"
        },
        {
            "review_text": "Overall - I recommend you only buy if you're going to play against others, such as friends.  Good - I love the idea of having a group that you control and level up over time. You could really get a sense of achievement if it was done correctly. The way they handled the turns and player perspective is great. You're not really playing from overhead (though there is a map). Instead, you see what your active player sees, which improves the immersion.  Bad - Improving your gang (warband) members has no meaning. As your gang gets stronger, the AI will automatically match them. As your gang gets bigger, the AI will automatically match that, too. Add a big guy to your gang - you'll be seeing those on the other teams, too. GW games have this approach in table top games so that anyone can sit down, play a game with someone they just met, and things are balanced between the two players - even if one has a much stronger team. In the PC games, it kills all sense of progression and meaning. If everything around you scales to match you as you progress, you never really feel any sense of accomplishment. This kills the game and actually only increases the penalties for failure. Losing a strong team member and replacing them with a basic new member weakens the entire team and that individual can't really contribute. You'll see people online trying to find workarounds - such as never levelling anyone up or having gangs split up into an experienced set and inexperienced set. Ultimately, you'll eventually feel like there's no point, though.",
            "review_score": "-1"
        },
        {
            "review_text": "I want to like this game. Actually, I want to love this game. But it is too strategically limited, too slow, and just too random. Let me explain...  On the plus side, the game evokes the Warhammer feel very well, and the ruined city idea means the developers have been able to create environments which are tactically interesting without seeming contrived. So I keep wanting play it - to dive into the evocative ruins, in a brutal, scrappy series of skirmishes where the risk of permadeath gives extra weight to every decision. That’s really appealing!  But....  First off, as lots of peoples' reviews have noted, as a player you are often victim of the random number generator. And this can be spectacularly random. (As an extreme example, consider that if you cast a spell there is a random chance of something bad happening; one of those things is that the character can lose all his hitpoints; if a character loses all his hitpoints, there is a random chance of permanent death. So, on one occasion I had my fully-healthy leader lose all his hit points as a random result of casting a healing spell – and I could have lost him entirely. Seriously.) Now, some will say 'ah but Warhammer is always strongly random.' And that’s true. But that doesn't change the problem that there is a basic disjointedness between actions and consequences - if your main character can be killed because you decide to cast a healing spell, or if a glass-canon or scout-type character can be killed because a random set-up put him/her right next to a pack of enemies, this is not rewarding or fun. It's just dis-empowering.  Secondly, this game is slow. Really, really slow. You wait while each enemy warrior moves even if you can't see him/her. The user interface takes a little while to go through, so your own turns aren’t uick. And then at the end of each turn you even have to sit through a message saying that the game is processing a move for each of the already dead enemies. So, even if you take a direct approach to hunting out your enemies it can take a while to finish a mission. And if you decide to try hit-and-run tactics, or lay traps and goad the enemy, etc., then it takes even longer. (The last mission I played it took 3 hours just to kill off four enemy mooks.) And of course because it is so slow you often won't bother trying different tactics - it's much less frustrating to just use a direct approach.  And the same problem of pacing that bedevils the tactical game also impacts the strategic arc. Upgrades to troops are earned slowly, and don't often seem to have much real impact. A typical upgrade might give you a bonus of a few percent to some skill or other. (So, after X hours of grinding a character, what do I have to show for it? +4% to something or other? Hmm.)  This leads to the third point - that there just isn't much room for experimenting with different strategies. After 20 hours my main warband was basically doing the same stuff it was doing at the outset, but with slightly higher stats. Nor is my strategy even really one I've chosen - it's just the strategy that seems to work best across all warbands. (I tried developing a hit-and-run style, I tried a missile-weapon-based warband that lured enemies into murder zones... nope, those strategies just aren't as viable as what appears to be the expected strategy.) And trying different warbands opened up no apparent strategic options, as each band (with a few minor variations, like the Sisters not having many missile troops) basically behaves the same way. By comparison, in the XCOM or Shadowrun games, as examples, having different combinations of characters allows you to approach missions in very different ways, and as the characters level up this opens up new playing styles and tactical options; in Mordheim, however, the slowly granted bonuses are really just allowing the characters to do the same stuff that they did before (perhaps with a little more specialization).  So, I really want to love this game. I enjoy the feeling of the cities, and am enticed by the idea of delving into the chaos-riddled ruins. But unless you're a die-hard Warhammer fan you may find that there is only so much fun to be had from ploddingly repeating the same tactics over and over and hoping that the random number generator doesn't do anything too crazy.",
            "review_score": "-1"
        },
        {
            "review_text": "I'd give this game a neutral review but since Steam only allow for a thumbs up or thumbs down, ill have to lean towards negative. But only for one main reason: this game is not Mordheim.  If you have ever played tabletop Mordheim and were expecting this to be a direct translation, you'll be disappointed. In and of it self this game is an ok game for its genre, it's not a great game though. That's not to bash Rouge factor. Like tabletop Mordheim, Rouge Factor probably didnt get a lot of funding from Games Workshop.   TT Mordheim had simple skirmish combat system that made for great quick battles. And Half the fun of the game was the awesome leveling system they used. It was a very casual friendly game. TT wasnt perfect, and had some issues, but with a few house rules it was a great system.   Instead of making a translation from TT, Rouge factor (or GW) decided to make their own system based of the Mordhiem setting. Maybe they didnt think that space hulk or blood bowl sold enough (those games where more of a direct translation). The game mechanic system that rouge factor made seems overcomplicated for what it does, half my play time was spent trying to figure the system out. Where in tabletop you could level up almost every battle. In this game there is a lot more grind involved. When you level up in this game, a lot of the time its hard to notice any improvement. There doesnt seem to be a whole lot of game variations so it can get repetitive fairly quick.  Pros:  This city visuals are amazing. The cities really have the look and feel of Mordheim. Unless you had tons of dosh, and/or time and skill. You would not be able to get that on tabletop.  The Developers seem to actually read and respond on the forums far more than most game Devs do. So props for that.  Cons: Way too much grind in this game. Its usually not a good thing if game develops substitute grind in place of content.  City movement is very restrictive and constrained. You can only climb/jump in certain spots, even though that ledge looks just as good as this one. Many times you'll find an area that looks like you can move no problem, too bad its impassable. Rotting paper thin door blocking your way? Nope cant kick it down. Trying to get into a locked “cell”(that only has two walled sides and no roof, with a grated door skaven could easily climb over) and you dont have a key? Too bad.  Lack of visual character customization. Im guessing that they had plans for lots of customization, but ran out of time and/or money. Some units have a few options, most have very little.  Too much focus on gathering wyrdstone during the battle. In TT this was mostly handled in the post battle sequence. It just gets too repetitive in this game. If they streamlined the system of picking it up, it would be much better.    I can appreciate and understand why the developers made their own game mechanic system instead of making a more direct translation from tabletop. But, to honest I much prefer the original.",
            "review_score": "-1"
        },
        {
            "review_text": "Warhammer flavored Xcom. Overall pretty good, if you like difficult strategic games. I have 3 issues with the game, however.  The UI is cluttered and often finnicky. For instance in the store you can't use the scroll wheel if the mouse is on the line inbetween the items, yet if it's directly over an item the scroll works fine, meaning you have to use the arrows or drag the bar. Little things like that are here and there.   The gameplay generally starts off focused on looting wyrdstone and then moves on to fighting. I like the looting aspects but it's VERY slow. It feels like the first 10-15 minutes are spent picking up rocks.  Difficulty is great. I love it for that, same reason I like xcom/darksouls. But difficulty and unfairness are two separate things. When you can't control where you spawn you are rolling the dice to decide whether your game instantly ends after 20 hours of time spent into it. For instance last time I played humans I was on day 16 and started a mission.. one archer spawned completely alone in a hall with an enemy on either side. Another spawned in a corner with a rat ogre pummeling him on round one. Both were guaranteed dead in the first 2 moves(not rounds) of the game. This would ultimately mean I couldn't win the fight - even if you disregard the other 2 units of mine that would also be screwed.   So.. yeah. The difficulty is fine, but never choose to play any mission where your units spawn randomly around the map or you are basically asking to lose the game. Not great design in that regard, but if you avoid those missions (which don't convey different content, just spawn points) it's fine. *And choose 'launch and deploy' to choose your spawn locations when applicable. Game never mentioned that as far as I could see, choosing 'launch' auto-assigns spawns.",
            "review_score": "1"
        },
        {
            "review_text": "I am totally addicted to this game, but there are a few things you should know before buying it: It is brutal. By that I mean there is no saving and reloading to earlier points (For idiots like me who make stupid mistakes). Your characters that you spent so much time leveling up can be maimed or die from one bad decision. You can ruin your entire party if you are not careful.  I ended up creating and recreating warbands (The party) due to silly decisions over and over. It took me a good 10-15 hours to get the hang of things (see above re:idiot me). You will need to put in a few hours to get the hang of things before it starts to be very enjoyable.  Normally I don't like these types of games, but this is different. It's got a fun turn based combat system that I have never seen before. It seems a little convoluted at first, but once I got used to it, there were a lot of different strategies available to me. It is turn based combat.. My first game started with me seeing a rat running towards my leader, and I freaked out a little because I thought maybe I had to click on defend or something. What threw me was that I am so used to seeing hexes in turn based games that the free running rat made me think of Skyrim or the Witcher.   I have come to like the perma maiming/death system. I think what helps is that even though your warband may be devestated beyond all repairing, all your kills/looting/wins put points to a global achievement section. When you level up this achievement, you get extra benefits and skills for every new warband. These skills are set on a per warband situation, so you can pick the ones most suited to the warband you have now, knowing that you get to reassign them if you create a new one.  Here are a few things I wish I knew before playing: Keep your units close to each other. A lone unit is practically guaranteed to be maimed or killed.  ALWAYS 'Launch and Deploy' - When you start a new combat, you will have the option to 'Launch' or 'Launch and Deploy', without any instructions on what they mean. It's as simple as it sounds, 'Launch': the computer place your units in their starting positions, and these will often be the worst possible positions they can be in. 'Launch and Deploy' you place your units in the starting positions. Buut sometimes even if you 'Launch and Deploy' you will not get to deploy your troops. It depends on the mission type and what side you are on.  Don't be afraid to skip a day.  The enemy will place the same number of troops as you do. So, if you can only muster 4 troops due to injury or training, then deploy them. The enemy will only have 4 too.  Do not get too attached to your warband early on. There are a lot of ways to screw it all up, many you will only find later (usually when you start to think you have the hang of it).   One last thing: What the hell is up with the dice rolls in this game? I have never seen so many 90+ rolls (Higher is bad in this game). The only good thing is that it seems to affect the AI as much as mine.   ",
            "review_score": "1"
        },
        {
            "review_text": "Do you enjoy building a customized party of badass adventurers? Do you enjoy leading that party into glorious turn based battle? Will you realize you are bad at strategy, watch your merry band be ripped to shreds by rat men, and hang your head in shame? If you answered yes to all of these you are a lot like me! I am really bad at this game. But I still really enjoy this game. Just come in expecting to die horribly and enjoy the ride. Thats kind of the overarching theme of Mordheim. It is very fun but stays true to the source material and its insanely high levels of difficulty. Don't say I didn't warn you.",
            "review_score": "1"
        },
        {
            "review_text": "MY First impressions: I hate&amp;love the 'thrown in without much explanation' approach. There are 4 ambiguous choices between which race I you want, which will effect, EVERYTHING. so no pressure. Then, there is something about grabbing all the stones, Killing the other three other choices you didn't choos and then the game throws everything on your plate. It's nice enough to restrict some things you don't need yet but I feel a sense of dread that I already ♥♥♥♥ed something up with the few choices I had, and not enough knowledge of what my actions actually will do. on top of that I don't like being made to spend resources without knowing what the value is cause it implies I might need them later for something better. On the other hand it implies, that none of that really matters and with hope I can pick up on mechanics as they become relevant so fingers crossed for the first mission... Mission overview: got my ♥♥♥ kicked. two dudes got hurt, and my mage lost his staff so... Restart.  If you buy the game, I strongly recomend you look at the controls, cause the game doesn't explain anything. easy enough to learn, but it doesn't give a ♥♥♥♥ if you are just starting out. it's glove off from start to finish.",
            "review_score": "1"
        },
        {
            "review_text": "Being a veteran of the Table top Mordheim, I decided my life would not be complete without the Video game version. And let me tell you, I regret nothing from my purchase. This adaptation of the Table top game has me coming back to the fight just to continue the story of my Scaven Warband led by none other than Master Splinter himself.   Mordheim: City of the Damned is not a easy nor forgive game at all. One wrong placement of your henchmen or your leader getting mobbed on by the sisters of battle and... you're done. If you enjoy an EXTREME challenge, then this game is perfect for your disturbed mind.  ",
            "review_score": "1"
        },
        {
            "review_text": "I feel compelled to write a review based on how many negative reviews with low play time I am seeing showing up.  This game will frustrate you while you learn the mechanics this is a given. Even with 300+ plus hours in when I screw up and 3 Skaven jump out after i moved a little to far and take out my leader and i know i'm going to have an injury roll I will panic. But i have to say that is what keeps the game interesting and fits the setting. Mordheim chews up people and spits them out eyes, arms, legs your sanity all are on the line when you head into the city of the damned. Having a real risk is what helps keep the game fresh as you have to replace your megolmaniac wizard because you though you could send him an extra couple doors down the seemingly empty alley to pick up some wyrdstone.  The main point is i don't even think I knew what i was doing until 5+ hours of playtime and wasn't even doing it well until maybe 10-15+.  ",
            "review_score": "1"
        },
        {
            "review_text": "Short version? it's fun, and a definite buy with friends to play it with.  Long version, Mordheim is a game that really tears me up, on one hand, the emotional side of me gets attached to each character, you can customize each one with a flurry of options and even write your own biography for them. On the other hand, if you actually use them and they are put out of combat (happens pretty often by the way, even if you're experienced a bad RNG for a match can still ruin your day.) then they could get brain damage, lose a limb, an eye, get a permanent wound, or even straight up die, which really breaks my heart when I spent so much time making them into a real character and then firing them because they got hit so hard they don't even remember where they are in the next battle.  So, if you like emotional heartbreak and aren't afraid to use a little imagination, definitely a game for you.  While the RNG can be a real ♥♥♥♥♥♥♥ at times, its usually fairly balanced and you'll get an extremely good game for each extremely bad one. The game plays A LOT like XCOM, just in a very different setting. To make things even more fun, it plays like XCOM does on ironman mode, with autosaves aplenty and no save scumming (or at least minimal) so what you do actually means something.  So, if you like XCOM, and want a challenge, go for it.  But maybe you really hate the fact that there's no progression in XCOM, that every game means you lose all your previous progress, well well well, Mordheim's got you covered. They put in a 'Veteran System', which basically means the more you play, the better each new warband you make gets, crazy stuff right?   So if you like progression throughout an entire game and also through each one of the warbands you create. you know what to do.  You like choices? Well, there's a few. Sure, four warbands may not be a ton of choices, but like the rest of the choices in game, they actually matter. Each different warband actually has an entirely different storyline, that's baller! I mean, that makes the game like, 4 times more replayable, at least! Not to mention each warband looks and plays distinctly differently. You may play your sisters of sigmar like tanks, and your skaven like rogues, or you could do it the other way around, I don't judge.  So if you like choices, yup, this game is the way to go.  Maybe you hate difficult games, well then this is tough for me to recommend, but I'll do it anyway! In fact, you should recommend it too! Grab a friend, name a warband 'The Salvation Army' and feed your friends to your heart's content! Easy mode has never been so, well, easy!  Want something easy? Yeah, mordheim even has that.  Or maybe you wanna show off the greatest warband that has ever existed. Can't get enough of rubbing it in your friends faces that you wreck everything, but don't want all your grade A units to come back from a battle beaten and bruised? Oh man, guess what? Yeah, morheim's got you. In exhibition mode you can crush your friends warband without actually destroying it for real, proving you're the king of the city of the damned (for whatever that title is worth.)  Like to brag? Do it.  I guess it wouldn't be a review without a bad section though, I'd like to see coop 2v2 warband matches, I think that'd be cool. Then you could mix up your strategies and build warbands around support, I'd love to see some straight healers supporting another warband, it would bring a whole new perspective to the game. The item interface is mildly annoying, the fact that you can't drop items and cant get rid of anything unless you put it in a chest is really inconvenient, especially on missions where you have to pick up certain items, but I suppose you could always just consider it another resource management tactical choice 'should I pick up this nice item? or use this character to go get the quest items?' Finally, impressive units are insane, I have to push my whole team on one to even attempt to fight it, and if its friends are nearby they wreck me. It's not even about luck at that point, they are just entirely too good at both offense and defence. My whole team can barely take one out (relatively early game) and then they get to have 3 swings on my characters? It's like the game is trying to wound my warband.  So, get this game, and also, if you don't have friends, just add me, I'm game to feed you whenever.",
            "review_score": "1"
        },
        {
            "review_text": "Tried it during the free weekend. I'm glad I didnt join the hype train. RNG seems to be just an NG, and foes seem to have buffed stats to make up for lacks in AI.  Overall, the game has its moments and is fun to play, but still I wouldnt recommend it, unless you can get it for less than 10 Euro. It's just not worth anything more.   ",
            "review_score": "-1"
        },
        {
            "review_text": "This is a good game. I just wanted to get that out of the way first. BUT. And this is a big but that I think anyone who has played more than one or two Games Workshop games can attest to. There isnt enough... This isnt Warcraft. There isnt only three factions. You have told us you are making a Mordheim game. So naturally people are like f*ck yeah I cant wait to see how different it is playing Undead as opposed to Dwarves. Or play as the old Mordheim favourites the Carnival of Chaos. But wait...? No Undead? No Dwarves? No Carnival, Orks or Witchhunters?   Poor show Mordheim the video game poor show.   So asides from the cop out level of completion the developers thought acceptable for a game with such an enormous set of histoyr and lore I have to say its a great game. The play style is really interesting and helps make a game that while completely different to its board game counter part is very fun. It could do with more varies missions and maybe a little voice acting but the main game is enjoyable. Permenant injuries and deaths add some excitement and can help make your warband feel very treasured and unique. The Warpstone shipment system also adds another element of much needed pressure during the campaign but I tell you nothing feels better than making that shipment and having a few days to recover.  There have been a few lacklustre DLCs released for this game but nothing that makes up for the frankly insulting number of factions. You dont make a Lord of the Rings game and only put Humans and Elves in it. You CERTAINTLY dont make a Warhammer game and only put 4 factions in it.   Sort it out dudes.",
            "review_score": "1"
        },
        {
            "review_text": "Its Great but I would like some more tools for orientation.",
            "review_score": "1"
        },
        {
            "review_text": "pretty dang cool.",
            "review_score": "1"
        },
        {
            "review_text": "RNGsus's Light does not shine in Mordheim. 10/10 Would have an army of amputees again.",
            "review_score": "1"
        },
        {
            "review_text": "GREAT Game !! Buy it. You will not regret it. Worth every penny. NEED MORE WAR BANDS !",
            "review_score": "1"
        },
        {
            "review_text": "A truely great adaptation of the original tabletop game. The community this game has grown is increadable and the developers continue to support the release. With the release of the Undead DLC all of the original warbands are now playable in game.  One of the few times a Games Workshop IP actually turns out well.",
            "review_score": "1"
        },
        {
            "review_text": "Game has been steadily improving with updates.  Sigmarite Greathammer is a nice addition, would be nice if it had a unique model and texture though because it currently looks exactly the same as the regular Greathammer.  It's nice that they added a new war band and new units as DLC, and I hope they add yet more in future. I would really like to see a Night Goblin war band with Squigs and Loons, and a Chaos Demons war band that actually lets you field the demon units in the game. I want to field a Daemonette :P the model is reeeealy nice.  It's way more optimized and stable than it was.  There are still long pauses during the AI turn while you wait for the enemy units to move around the map. It would be really nice if they could figure out a way to speed up enemy movement when you cant see the units anyway, this game has allot of downtime when your not really playing, just waiting.  It's hard to find good srpg's, and this one is actually not too shabby. Good lore, good atmosphere, plenty of grimdark, and nice music thats appropriate to the game.  For all it's flaws this game is getting better, and I hope the developer continues to improve it and add to it. It already has a special place in my heart as there is nothing else quite like this out there.",
            "review_score": "1"
        },
        {
            "review_text": "I've thus far only played one of the factions as a warband, but I have to say I am impressed by this game. It's well thought out, the maps are solid, and I haven't found any issues to have concerns with. It is a time-sink of a game however, there's no such thing as a 'Quick round before work or bed'... but that's what their auto-save is for apparently. I'd highly recommend anyone who enjoyed the recent X-COM games to Mordheim. It plays a lot like it, except the camera is based on each individual character you're controlling, so it's more of an over-the-shoulder, fantasy based X-COM game model... if that makes sense.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game as a pre release the game needed lots of work that was a year ago. Since those guys turned it around, the game is great, love the hardcore perma death perma injuries system, great rpg stff. There are a few flaws some mechanics could be polished. Download times are abit long but worth the wait. All in all this game is great for people who like the original board game or people who like turn base skirmischs. Good GAME.",
            "review_score": "1"
        },
        {
            "review_text": "This game is definatley not for everyone and at times will make you want to chuck something at your monitor, but overall I've had fun playing this. The game is not too terribly hard when you grasp the mechanics, but even when you plan things out well they can still go terribly wrong to due the incredible amount gameplay based on rng... I would stay away if you frustrate easily.",
            "review_score": "1"
        },
        {
            "review_text": "It says something about how poor the game design is, that the Devs have to jack up enemy warband difficulty to insane levels just to make the game workable. I just got done doing a normal difficulty mission with a rank 10 warband, and literally every single one of my henchman was crit on the first swing of the match, stunned, and then promptly dismembered by the massive damage increase that the enemy warbands get. What gives devs? Still using 'Our AI coding skills are bad' as a crutch excuse for artifical enemy warband bonuses?",
            "review_score": "-1"
        },
        {
            "review_text": "Fight with skavens in the noble quarter. Perfect fight, just before morale test one lucky ratmen critshoted my captain. Bah ... he´ll be fine ... but he wasnt. Died next day and whole warband was out of money to hire a new one so tough luck and strart again ... just like tabletop version.  As a old player of tabletop Mordheim, I am bit distracted by transformation of classic warhammer dice rules to percentages, but hey we use D6 mainly because they easy to count and keep track of hits and misses ... if computer do the whole counting I dont mind.  Ranged weapons are less deadly than in original, there are no slings (incredibly powerfull, low cost weapon that even nuns could use) I have played the game for a few hours and its solid. Worthy buying in when is below 20€.",
            "review_score": "1"
        },
        {
            "review_text": "I have been meaning to buy this game for a long time, but the negative reviews have kept me from taking the plunge. I have tried it over the free weekend and I am definitely buying it now.  If you like turn-based, tactical rpg's you should buy this. It is hard, there is a ton of stats and a lot of character progression. If you like easy games that you can quickly get into, do not get this.",
            "review_score": "1"
        },
        {
            "review_text": "Very promising and reminds a lot of the old cult classic tabletop game. So far only 2 warbands, Skaven and human mercenaries, but they will add a lot more over time. Mechanics are fun, graphics and sounds are good. Overall a fun turnbased experience with a very interesting new take on action points, and how they work.  Update: With the full release here and 4 warbands instead of two. They added Sisters of Sigmar, a hard-hitting band of religious nutcases Warhammer style as well as adding Cult of the Possessed, which is a Chaos warband, with all that that brings. Mutations, weird way of thinking and just plain barbarism.  With over 100 hours logged, I have this to say: The game is very unforgiving, and at times extremely frustrating. Very long load times, which seems to be something the company can't fix because of how the game is built. it has a built in anti-rage quitter system, meaning if you quit during any mission or skirmish, it treats it as if the warband got routed and EVERY SINGLE WARRIOR in the fight will have to roll on the injury table to see if they suffer any injury or lose any equipment. This is very harsh, especially for single player where you don't really hurt anyone by abandoning a mission that goes really, really bad (considering the loss of one skilled warrior can set you back around 10 hours of game time). it doesn't help the AI is dumb as bricks, and pathfinding for large units really is an issue. More than once, I see them stuck by a door and just can't move.  Still, even with its flaws this game is very addictive and I stand by my early access opinion, the game is great.  2nd and last update: Loading times has been fixed, it now loads very fast. Gone from over a minute of loading time to around 15-20 seconds. (I use a SSD).  They've added 2 new Warbands: The Witch Hunters, a warband of Witch Hunters (think the psychos from the witch hunts in Europes history) and their cohors: religious nutcases (Flagellants and Zealots). Their impressive unit is a very large human with the suiting profession of executioner. He likes to set his enemies on fire. While they're alive.  The second new is Undead, set to be released tomorrow as I write this (the 25th of october 2016). I can't wait. Vampires. Zombies. Dregs. Necromancers. Crypt horros. Oh my.",
            "review_score": "1"
        },
        {
            "review_text": "Its kind of hard to properly mark this one since its yes or no. I'm giving it a slight yes in regards that it can be pretty fun when things are going properly. RNG is wickedly against you in this game as it is with most tactical combat games. You will miss quite often on 80% chance to hit moves and even on 95% in the same vein as XCOM would make you miss with a shotgun at point blank range. The game is unrelenting in its difficulty giving you no way to save and the fact that the AI will land impossible hits for incredible damage and when surrounded somehow rarely if ever break and run. You will feel scared to death nearly every battle of one of your men going down in battle because that mutant you've been leveling up since the start with all the shiny upgrades in gear can suddenly be dead because a gutter rat got lucky.  Strangely enough this turns out to be fun if not frustrating as all hell. Battles are always tense especially when you really need that wyrdstone to keep your boss from kicking you to the curb and ending your campaign and a severe wound can put your best soldiers out of the fight leaving you scrambling for new recruits to piece yourself together until they recover. Missions that scatter your warband across the entire map can really suck when you got one guy on his own and he gets ambushed by the entire enemy team leaving you to desperately run for your life to try to save your poor doomed soldier.   The main complaint I have is the loot and objectives. Many objectives require you to loot a certain amount of wyrdstone and you need to finish these or you lose out on bonus items which can save your life. Only problem is as soon as you break their warband the mission ends and you gather only a small chunk of whats on the map. I will gaurantee you that you will only finish maybe 1 out of 5 bonus objectives every mission until you have a godlike meatshield to hold the enemy while you go loot. Because they will always find you and then die and end your mission screwing you out of the objective nearly every freaking time. And the fact that you can't spend maybe 2-3 turns after they have retreated looting makes this game have a fake difficulty that is far more frustrating than fun.  So..I could only recommend this if its on sale. If not, until the needless frustration of wasted time trying to finish objectives and huge amounts of lost loot due to the suicidal AI bumrushing to your location no matter where you are its not worth full price. A very hesitant recommendation to anyone who enjoys unrelenting difficulty and cussing at their screen.",
            "review_score": "1"
        },
        {
            "review_text": "Update -   I'm having more fun then before. I've found more bugs and the story missions can be confusing sometimes. But, the epic feel of survival is great. I'm not one to complain that I miss a 95% roll. I don't believe that game is broke or cheats, I believe I just had a bad roll. I also hit the other day when I had a 7% chance on a shot. It is random and it happens, but games like this are built that way. I don't want to know exactly what is going to happen every sword swing that would be pretty dumb.   The injuries don't bother me. I don't ever deploy my own troops, I always let the computer deploy them for me. I like the difficulty. I have a Human Merc warband and we've struggled and also dominated. Nothing better then getting smacked around, scrapping together after the fight and going out and deciminating your enemy next time. Yes you can do that.   This game is simply fantastic. There are minor issues here and there and some odd graphic glitches. But, overall the game requires thought and planning. But, I think it captures the warhammer world very well and handles the mechanics of the boardgame.  I wish it had multiplayer servers and warbands were stored online for online play. Some kind of ladder or online campaign would be great as well.  I would buy additional warbands as DLC. I would also pay for multiplayer. It is a great merc sim and really has been the kind of game I've been waiting for.   Well done, Well done indeed.   9.0 out of 10. Would like multiplayer ladders, servers, clans etc... Also multiplayer campaigns. I hope this is game is a hit and they look at funding or kickstarting some of those features. We also need more custom options for faces. All my guys look the same and that is annoying. Make it so people can mod.",
            "review_score": "1"
        },
        {
            "review_text": "Mordheim is a rather challenging turn-based squad management RPG set in the Warhammer world, with unforgiving rogue-like qualities that won't be to eveyone's liking. To be quite frank, people who head in thinking Mordheim willl be akin to XCOM will probably be rather let down. This is primarliy an old Games Workshop board game brought to life with all the idiosyncracies this entails, and it therefore has far more in common with Blood Bowl than regular turn-based titles. Don't let the 3rd person gfx trick you into thinking otherwise, that's basically just a way of getting scenary and elevation changes to work (something that wasn't needed with Cyanide's Blood Bowl conversion).   The Blood Bowl comparisons continue through to the front-end, which is about as user friendly as a casual headbutt. However, perseverance with the steep learning curve and the obtuse management system does start to pay off. Trying to keep a fledgling warband afloat by selling everything and fielding guys with smashed up legs only to find you've then got no spare weapons for your next raid is the kind of experience you'll either like or despise - luckily for me, it's right up my street.   I tried PVP in beta and it had a lot going for it but I've just been doing campaign stuff since I fired it up aagin and I am genuinely impressed with the solo experience. The meta actually has a lot in common with Darkest Dungeon (this is a good thing, DD is wonderful). Also of note is that the Xbox pad works nicely, meaning I can get my tactical on from the armchair.  Mordheim has developed nicely into a game that now offers a fairly singular experience, though undoubtably rather niche. If you're looking for a mixture of Blood Bowl and Darkest Dungeon then look no further.",
            "review_score": "1"
        },
        {
            "review_text": "Despite always fancying it I delayed getting this as the luke-warm reception it recieved put me off. However, I must say I'm getting pretty hooked.  The virtual dice rolls won't always go your way. You simply have to make peace with that if you want to enjoy this game. Though sound strategy will see you right most of the time in single-player. It is pretty common to have one or maybe two out-of-action party members per match even when things are going well. And there is always the chance they end up perma-dead or with such a debilitating injury they become next to worthless.  Multiplayer is another matter, there will be players out there that can take your beloved warband to pieces. But you have the option to play in exhibition mode with no permanent repurcussions, but no rewards either. Or just have seperate relatively 'safe' SP and riskier MP warbands.   It's worth knowing that there is a veteran system letting you level up and keep bonuses to running your warband that carries over to the next even if they all end up dead. You even get to choose how you spend your earned bonuses for each warband. I've got 25 hours of fun out of this to date and I've only played with 2 of the warbands on offer so far.  More customisation options would be very welcome, it is hard to make your party members look individual, which is a shame. Another niggle is that the game always suggests a parry stance for my warriors that are better at dodging and vice-versa which gets tiresome after dozens of battles.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun but very tough game!",
            "review_score": "1"
        },
        {
            "review_text": "Ridiculously difficult. And by difficult, I really just mean the RNG system sucks. I think it's just a bad mechanic at this point and doesn't have a place in modern vidya. Missing three times in a row on a 75% chance to hit is not fun.   Enemy difficulty also seems to scale very badly, and you can easily build your squad 'wrong.' As in there's a ton of non-viable builds possible. There's no point in that being a thing unless you're trying to actively make the game frustrating to the player and not fun. Seems like pretty linear progression until you're just ♥♥♥♥ed and there's nothing you can do about it.  Great artwork, interesting random map generator, good VO and music. The factions are distinct and interesting despite 3/5 of them just being different groups of humans.  I'm not obsessed enough with this game to ever beat it by doing a bunch of math and finding out what the system exploit strategies are. I shouldn't have to. Early on in a campaign it's really fun, but that enjoyment shouldn't drop off so dramatically as you progress and get further and further hindered by permanent debuffs, drained of funds and forced to take rush missions.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to like this game I just can't  1. Mercs have no spellcasters until higher level and comes into play with weak spells. by the time you get him tha spell that gives people in an area a -5% to hit, dodge and parry will help very little.  2. Skaven are the best in balance with a good dodge that can help you early in the game and Chaos and the sisters have spells that can help you in the game throughout combat.  3. Sisters are overpowered to the point where if I'm randomly scattered and I am against them I abort as soon as I can.  4. Potions are pathetic and virtually unusable in most cases. A 10% increace in armor protection will not outweigh the 100% loss of stun resistance, especially when you have a skill that can give you a good chance to stun early on.   5. Armor is supposed to help absorb damage, not make you a punching bag to the point where you hesitate to put armor on a charachter and just risk it with a weapon and shield.  6. Setting abushes against the NPC's just have them immediately stand off and go into ambush mode themselves at least for a couple of turns.    DO NOT BUY THIS GAME.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game when I can play it fluidly. The level load times are what they are, and I can live with them. However if you play more than 4 or 5 missions in a row you can end up with animation load times that are so long (1+ minutes) that rather than slit your wrists, you kill the process, which penalizes your current warband. I was also playing with a friend, encountered a bug where the game never came out of an ambush and one of us was forced to forfeit- which penalized the 'offending' party's warband. This should not be a full release game.  Do not buy this until they get it into a state that is worthy of a full release. As far as I'm concerned this should still be pre-release.",
            "review_score": "-1"
        },
        {
            "review_text": "Originally the Warhammer Fantasy equivalent of Necromunda, the miniatures game came out in late 1999 if I remember correctly. It is a skirmish game based on gang warfare in the ruins of the doomed city of Mordheim.  All of the basic bands from the core rulebook (Human mercenaries, Skaven, Cult of the Damned and Sisters of Sigmar) are represented in the game, and the rest (Witch Hunters and Undead at this moment, more probably coming in the future) are being released gradually as DLC. The look and feel of the tabletop game are well adapted, without the inconvenience (some may not view it this way) of having to modify the miniatures when some of your warriors inevitably get mutilated or mutated by a wounds/mutation dice roll, or without having to keep an extensive array of scenery in the closet to prevent the games from becoming boring brawls.  Also, the tabletop's ruleset has been well adapted, better than the original IMHO, as it allows for greater granularity and slightly reduces the luck factor from the original (and the power differences a single point in a stat could imply in the tabletop game, but I'm talking from old memories). Graphics are more than good enough for their purpose and don't have huge requirements.  Regarding the gameplay, it fits the grimdark atmosphere of the source material - you hire a bunch of mercenaries to set up your band, and go fight other bands in the ruins of the city for a few fistfuls of wyrdstone, which is fantasy plutonium. Playing the full tutorial is recommended in order to understand all the nuances of the tactical part of the game and the band management part of the game, or you will probably lose hard early on. In line with the grimness (and the darkness) every time a critical strike is landed on someone, or someone is knocked out, a roll is made after the battle and there's a chance that character will end up maimed (this happens to the NPC bands too, and when you encounter them again you will be able to notice the effects of your handiwork on their bodies and minds). Some people get lucky and make a full recovery (or you can get a bunch of one-eyed guys with PTSD or mangled hands - most of the time not all at once). If your guys get knocked out, your enemy can steal their gear, and if you lose a battle you don't even get a booby prize - winner takes all. It's a hard life out there in Mordheim.  If you ever wanted to reenact 'Acción Mutante' in a ruined medieval city, play this game. And if you don't get what the hell I'm talking about, go watch 'Acción Mutante'. You'll enjoy it too.  In short, buy this game. Buy it for your friends, too.",
            "review_score": "1"
        },
        {
            "review_text": "Honest review, and its a 'neutral'.   (Those coming here from X-com or similar backgrounds, be warned! Raising troops from rookies isn't part of this game. If a unit dies or becomes a liability, hiring a pre-levelled units is the only real option to replace. Anything but early game, rookies will be targetted and easily killed by any enemy. Take this as you will.)  Early on, it is very, very unforgiving. Against the AI, 'fair' fights are suicidal. They are better than your troops. Routs come early (maybe not so early with Sisters) and without the skills and gear from progression its very luck-based.  Mid-game (warband rank ~ 5-7) is a bit better, you have the gear and (hopefully) some skills that will synergise. A hero or leader miiiight be able to fight one on one with an enemy unit.  Late-game, its either very easy, or utterly painful, since RNG effects are pretty extreme (massive crits mostly).  Enemy scales to your warband rating and rank, difficulty is mission based (changes the rating of the enemy warband up with higher difficulties). The design seems to be that you'll always have a challenge. Doesn't really work out. AI is fairly suicidal, enemy warbands are random genned for the mission. How their stats are allocated, present injuries and their equipment is also mostly random (seems to be skewed based on race). This is what makes the mid-late game easier, as your warbands are hopefully designed to a plan. Difficulty adds health and damage % bonuses to enemy troops.  As your warband ranks up, you get more money (from selling enemy enchanted gear, which they get to match your rating). More enchanted gear on your troops = more on enemies, so more cash.   Random gen missions, especially later on, are very grindy due to enemy health bonuses. Damage bonuses mean armour isn't very useful (its % reduction), parry/dodge is better. Healing in-combat is essentially non-existant (rare consumable, provides little health). Most consumables are either useless or have minor effects that you could do without.  This is a game about numbers. Small numbers adding up to hopefully have a noticable effect together. It is fun, once you get used to the mechanics and maps, but does often become tedious. Combat does tend to become drawn out and limited animations don't help.  A huge amount of the game is at the mercy of the RNG (...basically anything but movement essentially). This is, however, popular in some circles. I have noticed that the RNG isn't completely random though, it does often have a tendency to roll high or low and rarely in between, but this might be personal effect and not affect everyone.  TL;DR, not a bad game, fun, not for everyone, but does become quite boring later on.",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game for a long, long time I feel I can finally give it a review. Well, I'll start by saying, it is addictive. The devs do not spare you from death. Of course, you can get off easy by losing an arm or leg, but that's the game.  I've been looking fowared to a good, Turn-Based strategy game for a long time and I can honestly say, this is it.  Thank you.",
            "review_score": "1"
        },
        {
            "review_text": "Turned-based strategy game. Read the tutorials and save yourself the frustration. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "The new campaign mode is every thing I was hoping for! I love a tactics game that allows for random non-story line missions that can be done as often as desired! The game is challenging and you are just as likely to take a loss as you are to push through to victory! I highly recommend this game and am so looking forward to more to come!   UPDATE 11/21/15  100hrs into the game and I still love it just as much as I did at hour 1. I have already suggested this game to many of my friends. As a turn-based rpg fanatic I love the way the game plays and the unique abilities for each warband. The permanent injury system is a nice touch, if not heart breaking at times (your star hero gets swarmed by skaven and ends up losing an arm). The maps are great, have a very Mordheim feel to them and pleasing to the eye. Some suggested improvements:  *In-battle equip system. On the occasion I've accidentally sent my warband in and my warrior only has a dagger after getting robbed the last battle. After killing a rival, I can put a sword in my backpack but not simply hold it in my mainhand. I'd even be cool with the action costing strategy points to equip, etc.  *Skills are way too expensive for the amount of gold you are able to make. I literally have an entire roster of warriors with 2-4 skill points because I simply cannot afford to pay for all of them to skill up and still meet the constant demands for wyrdstone shipments. Average low skill is 95 gold (and I have the scholar veteran skill too), the higher level skills range to upwards of 280-300 gold. Even after completing a 259lb wyrdstone shipment I'm only able to pay for two or three skills before I'm in danger of not being able to pay for treatments, equipment loss, and upkeep. I suggest perhaps a separate currency system for skills? or a lowering of their price, or an increase in wyrdstone shipment payouts? Or maybe even just dropping the gold cost as you already require skill points themselves?  *Wyrdstone shipments come at regular intervals with increasing amount required and it is a great idea. It gives you a huge reason to harvest the pesky green crystals. However, the demand is a bit strenuous. It would be a lot easier to pay for skill upgrades and my warband in general if the demands weren't so constant. I love the system, but maybe a reprieve between shipments would help tremendously? Sometimes being able to send small shipments to one of the side smugglers helps out a lot, but then in doing so puts me behind the 8-ball on the next demand that comes within a day or two of the last completed.  Love the game, keep up the good work. I've got three open games going so I need to get back to my mercenaries. Look forward to updates and hopefully more warbands. (I'm looking at you Dwarves, Undead, Orks, elves (both kind), Witch Hunters, and *hopefully* lizardmen.)",
            "review_score": "1"
        },
        {
            "review_text": "Very engaging strategy game focused around building up your units. Lots of variety in advancement options and lots of possibility for permanent injuries and even death that keeps things challenging and realistic. I legitimately worry if one of my important units falls in battle. Comparable to Blood Bowl in these respects and warband management does parallel a sports sim in many ways.  Combat can get a little bit repetitive. Not a lot of story mixed in, unfortunately, but good background and setting. Ability to customize units' appearance is good, but being forced to do so for each one as they all start off looking identical (instead of randomized) isn't ideal.  DLC nickel and dimes you to death, as with anything Games Workshop related.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting take on Mordheim, pretty damn true to source.  I'll reccomend it because I had a lot of fun playing it.   Pros: Lore accurate representation of settings, characters, races and abilities. Reasonably well balanced matches, rarely are battles impossible or very easy Deep and interesting character levelling and equipment progression systems Your warband develops real character naturally over the course of a campaign  Cons: Graphics are not up to par for something this recent. I'm the first to say 'Graphics aren't everything' but also they are not to be ignored. Random deployment missions are often skewed to be impossible, edge case scenarios in rare circumstances make certain battles unwinnable.  Some injuries should not be permanent. High level units can be injured and permanently lose all value, forcing you to replace them with rookies and play another 20 hours to level them up, or be satisfied with a perpetually sub-par warrior.   I understand the injuries are also a great aspect of the game. Peg Leg Grunhir the giant ♥♥♥♥♥♥♥ with the halberd was one of my favourite warband members, and I don't want his leg healed by any means. We have magic potions, we can teach people spells and enchant weapons. Can we really not send Rolf 'Basically Legolas' Murnheim off for a week to have some mojo done to reverse his brain damage? It was just a concussion bro. Get over it.    ",
            "review_score": "1"
        },
        {
            "review_text": "Mordheim, when it first came out I expected a lot from it and was sort of let down but that was right after it released for early access... so i put it on the back burner to see what the Devs were planing to do with it .... AND I couldn't be happier ... thank you for listening to us all and making it much better... there is one small complaint (really small) camera views ... like some spots where your guy is going to jump down it snaps so you just see most of the roof or wall ... or when a warband member spots a guy and it is tracking it it moves into spots where you loose site of the opposing guy.... but these are vary minor in a turn based game like this ... Loving it ... THANKS!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "X-COM meets Dark Souls. I don't think I've ever played a tactical game so addictive and very VERY well designed. So many customization (talking about RPG elements, not visual) options for your characters, and each victory feel like you won the lottery (because there is a big element of luck in the game lol).  In any case, if you liked X-COM, want it to be darker and more hardcore, pick this one up, it's one trip you won't forget! (graphics could be way better, and the animations are dull and boring).",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. There is a learning curve but this is sped up by reading through the tutorial mission. The game ios hard at first as your warband has no abilities yet. I notice people reviewing this poorly with 8 hours played, etc. I would honestly ignore those reviews as it takes longer than that to really get to know this game. The different factions all add good replay value as well as dictating how you approach missions as fighting the Sisterhood is vastly different than fighting the Skaven or the Undead. The hardcore aspect where characters can be maimed or die adds consequence and grit to this game and adds to the feeling that you are managing characters rather than pixels. If you are looking for a challenge with tons of play value for a very reasonable price then you can't beat this title.",
            "review_score": "1"
        },
        {
            "review_text": "This game is not for the easily frustrated but can be highly rewarding for those who put in the time to understand its mechanics and figure out how to navigate all the challenges such as the wounds mechanic (or mutations too for the chaos faction) that can throw a wrench in any plan. despite taht actually making it past the first 2-3 levels (i feel those were the hardest) can be very satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "i dont get,i had old asus,installed game,was so slow(from the menu) now i got alienware 17 and its still same,like im playing gta 5 on pentium 4....  after all updates,game works great and its good game!",
            "review_score": "1"
        },
        {
            "review_text": "A 3D, 3rd-Person, Turn-Based, Tactical, RPG set in the world of Warhammer Fantasy. Mordheim: City of the Damned has everything that I love in a game: a grim-dark universe rich with lore, simple controls, procedural encounters, customizable characters, and a difficulty that cannot be altered or lowered.  This game is hard, not because it requires skill but because every action taken by your characters, (walking is mundane and requires no actual roll), will be resolved randomly based on a percentage of your characters' skill; this percentage will be bigger or smaller from how high the skill is required to perform that action is. This means, you, as the player, have no actual control in how well your characters perform, the most that you, as the player, will be doing is moving your characters to an enemy and telling them to attack or up to a wall and telling them to climb it, all you can do is watch and hope they succeed. The player is soley responsible for strategy on the field and building up your warband to get better percentage rolls. So let me reiterate, this game is hard, and you will become frustrated when you fail but the replayability for this game is extremely high and I advise playing as each of the available factions because they each require different types of mindsets to play them, and nothing feels better than settling with a race or faction that just speaks to you on an emotional level.  Anyways, I recommend this game to anyone who is a huge fan of unforgiving turn-based random number generators, meaning if you really liked Darkest Dungeon you are gonna enjoy this. I have been playing since the Cult of the Possessed were first added during Early Access so I am very pleased with how this game has evolved. Oh and I highly recommend looking up the official lore and fluff for Warhammer Fantasy, you'll be suprised at how vast the universe can really be. Thanks for reading.",
            "review_score": "1"
        },
        {
            "review_text": "Love it. I'm really only posting to counter what I feel are unfair reviews of a great game. In fact this might be one of my favorite games in my collection. Xcom was my favorite TBS game but this completely overtakes it. I wish the graphics were a bit more over the top but one of my only wishes that this game doesn't take care of. Great.   Update after hour 50- The best non-highly reviewed game I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "been playing for 6hrs now im having fun with it, afew things i wud like to see put into the game is a mini map wud be awsume would help out alot and more zoom out from the 3rd person view would be great aswel, but as i said aprt from that its a good game really enjoying it. well done :)",
            "review_score": "1"
        },
        {
            "review_text": "A challenging blend of warband management and turnbased tactical gameplay. You won't like it if you want to just sit back and relax while playing games.",
            "review_score": "1"
        },
        {
            "review_text": "This is an overall positive review, but the shortcomings are, again, much like what everyone else sees wrong with it. The game premise is definitely fun, not being able to pick up wyrdstone at the end of battle when you were right next to it is not fun, getting your team or just your favorite sister of battle to Monster level is fun, not being able to complete 'Break their morale' side mission because it breaks their morale too fast and ends battle is not fun. I could go on with this flip flop, there are quite a few things very right and sadly wrong.  It seems they fixed the AMD video card issue, though, so that becomes points in their favor.   The missions are pretty samey (knock down everyone until they die) where the tabletop was not (escape successfully off of a corner of the map, or pick up X amount of wyrdstone, or have a person standing on these 3 spots at once, as well as knock the people down). A vast majority of the upgrades are just +5% to such and such, as well.  It appears that they've continued to improve on the game, though, there are some nice, very noticeable changes from when I last played. This goes from 'I like it pretty decently' to 'Yeah, I'd recommend this to a buddy.'",
            "review_score": "1"
        },
        {
            "review_text": "Just a fantastic strategy RPG. Can be very unforgiving at first, but stick with it and you will become a warpstone collecting murder machine.",
            "review_score": "1"
        },
        {
            "review_text": "Highly underrated game. It is a hard game, but if you're a TBS fan then this will offer a fun and satisfying challenge. The injury system really makes you think tactically about your every move, and can potentially mix up your entire strategy! Seriously great game, I highly recommend this one.",
            "review_score": "1"
        },
        {
            "review_text": "I gave a hand down to this game short after release. Much has improved since that time.",
            "review_score": "1"
        },
        {
            "review_text": "  This is a short first impressions after playing the game for just under 2 hours (during the free weekend). The short conclusion is the game is good and very fun showing lots of potential, with a couple of critical issues that might put off a few people (in terms of gameplay and design decisions).   Longer version - the game is solid. Indepth party system where you can make your warband anything you want as the time goes on and the level of customisation is impressive. I can see that over a campaign, players could really bond with their little toy soldiers through unique experiences. Feels like this might be better done that even something like Xcom. The strategy in it is good and overall reminds me of Valkyria Chronicles (VC) without the obnoxious cutscenes, overbearing story and general animeness. The missions have an interesting way about them and you have to balance danger, party ability, demands for resources and local mission requirements making for an interesting risk reward system that relies on your ability to command. Feels very organic, though I cant say how it will last in the long run. Basically - the actual gameplay of the game is satisfying and I enjoyed it a lot.  There are a couple problems here though. The UI is, in a word, crap. Mouse+keys or gamepad (I actually found gamepad more viable in mission mode due to some weird camera acceleration, but mouse in the menus) - its all really clunky. Lots of small windows with masses of stats and info. Very cool for showing all you want to know - but it is pretty intimidating at first and then its just a bit messy. This is all forgettable, however. My biggest issue, as many already have pointed out - the AI turns are dull as hell. For around a third of most rounds youll be stuck watching the back of your last soldiers head as all the AI units move about unseen on the map. This takes a long time. Genuinely - the game has an unreasonable amount of downtime between your movements and I found myself feeling as if my time was being wasted. Comparing to the peers, VC shows you all the enemy troops off the getgo and you see their moves - feels like youre part of the game. Xcom has pretty quick turns and some feedback in the form of sound waves (helped by the isometric view). Here its just 'wait for a couple minutes till the AI is done and then get back to playing'. Its annoying and actually detracts from an otherwise fun strategy experience. Finally - Im not into WH lore so I dont know about the fanbase, but the factions of offer were a bit bland and samey from a first look. Humans, different kind of humans, a 3rd kind of humans, a 4th kind of humans (now posessed by chaos) and ratmen. Doesnt exactly feel like the creative muscles were stretched there.   Ultimately - I liked what I saw so far and will finish off my free weekend with it to see further in. People who like turn based tactics games a-la Xcom will enjoy this, especially if they like the WH fantasy universe (Im ambivalent to it, but the game suits the setting well). People who are used to faster games will probably find this too restrictive. An overall thumbs up from me, but the long AI turns combined with a messy interface could genuinely make this a dealbreaker. Ive yet to see. I recommend looking up videos and maybe finding someone who already has the game to see if the issues ive pointed to matter to you. If they dont, get the game - youll have fun.",
            "review_score": "1"
        },
        {
            "review_text": "The game is a lovely Turn Based Strategy with a couple of flaws in the execution only. Often the characters themselves appear as if they can fit through something, but they cannot when you try. Also there are times when enemy units have immunities to various mechanics, and it does not show this on the buff/debuff menus when you inspect an enemy unit prior to attacking. That being said, this game does not show mercy or cut you any slack, but that is part of the appeal. It is a very tactical and thinking man's game, where you can easily lose a character mid-mission, and they end up being useless or near useless afterwards, and you are counting the days until you can buy a replacement. It is a beautiful application of a masochistic strategy game, that makes you feel reaaaaaaaaaaaaaaaly good when you out-maneuver your enemy, and leave them in a horrid position to fight from, while you overwhelm them with debuffs and swarm tactics.",
            "review_score": "1"
        },
        {
            "review_text": "Solid. been playing for like 20+ hours and no sign of getting bored yet. plus replay value with other warbands is high and pvp would be fun if i was brave enough to risk my warband and try it",
            "review_score": "1"
        },
        {
            "review_text": "You will learn how to avoid, or deal with, loss. You will make choices, knowing that there is no 'best choice.' Loss: Yes, random rolls can pile up, forcing you to lose a treasured unit. You are fighting with other mercenaries over the 'City of the Damned', people will die. You might actually care for them. It will hurt. You may quit. Or you may find the young replacement and swear at how wortheless they are compared to the veteran that they replaced. It feels like a warzone, and that's what I wanted. Learn to dodge. Choices: The optional objectives are woth more than the primary. The primary is, usually, easy. Beat the not so smart AI. When just starting, I did lose a few primary objectives. You learn to stick together, and if you don't start together, get together ASAP! Then you start winning primary objectives. You start looking at those optional objectives. And realizing that if you want to accomplish them, you might have to break out of your comfortable, stick together, everybody comes home safely routine. Maybe you start taking risks. And you like the rewards. Then somebody gets caught alone against a swarm, or maybe just a single impressive unit. And it hurts. And you wonder if those rewards were worth it. Stick through it, learn. And you can find yourself making most of the optional objectives and making it home in one piece. And sometimes you look at the map/setup and realize it's the day to just hunker down.  Those two things are why I love Mordheim.  It does have some negatives. Managing inventory during a mission could use the ability to drop items. I get annoyed when the enemy routs immediately after I take down the one guy I needed to take down, only to not get the chance to grab his token before the rout ends the mission. Deployment could be made more user friendly (selecting deployment from the map instead of cycling). The game has gotten a LOT better since it first came to Early Access, and I hope they continue working on some of those. But the good things more than make it worth dealing with the few annoyances in the game, in my opinion.  I hope they continue, either through DLC or just updating the game itself, to develop more warbands, more equipment, more customization of models and more mission types (story or procedural). But I love the game as it is today. I would just love to have more too :).",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, until you realize that the developers force you to play the sisters of sigmar. They are so much stronger than all the other warbands its absurd. It is one of only two complaints with this game. They need to have their chance to hit lowered if they are going to put out that much damage, or have parry actually do something. Parry being the second complaint...I played so many campaign fights with literally less than 10 parry procs. This warband leader has 82% parry proc and does nothing but DODGE LOL. Come on, fix this please. Parry is worthless, and Sisters of Sigmar are do too much damage. I would recommend staying away from this game till they truly balance these broken factors, they distinctly break the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring and Frustrating until you get the hang of it",
            "review_score": "1"
        },
        {
            "review_text": "Like warhammer? Like xcom? buy this, and let your mutated freaks run amok amongst the mercenaries, whilst they smack skaven who are needlessly hounding the sisters of sigmar. ♥♥♥♥ING GET IT ♥♥♥♥♥ I NEED SOMEONE TO PLAY AGAINST.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a very good core idea like a Action Turn-based game. The different system of the gameplay and management makes it fun. However, the game is too punishing and depend too much on RNG, there seems to be 1 or 2 major bugs that affects the outcome of the match(even on full release).  Though it is a good game, it still lacks varieties on class and skills which affect the long term mood for gamers to continue. Even though gamers still continue the game, the game mostly focus on map tactics and lightly on unit types. The game requires a some small features that can overide RNG to balance off the game, making easy for beginners to learn.  I would definitely recommend this game for game elitists looking for hardcore game. But for normal players who goes mainly for overall gameplay, I definitely do not recommend this.  Personally, to be fair and honest, although some hardcore game suits me, this one seems 'stagnant' to me in the long run.",
            "review_score": "-1"
        },
        {
            "review_text": "As a fan of Games Workshop I was looking forward to playing this game. Positives first it looks great, has not lagged, crashed or frozen on me once. Sounds great and does a dame good job is emulating the table top game it is based on. The reasons why I am not recommending this game boil down to the combat. To be fair to Rogue Factor they have done a good job in merging the rolls to hit, wound and save into one single action but however there are some major problems.   First the percentage chance show when about to hit an opponent is just wrong. It only shows your chance of hitting after your characters modifiers are taken into account, but not the enemies. The community keeps pointing out that the opponent’s modifiers are shown; they are just not included in the calculations for hitting. This is especially frustrating when despite being told you have a 95% chance to hit, you miss four times in a row. Second and perhaps the biggest the range for the RNG used in this game is too high. When turning a table top game that requires dice to play into a computer game using an RNG is a good way of measuring the dice rolls. In this case however Rogue Factor have taken a game that uses dice numbered between 1-6 and ups it to 1-100. This is a major issue as it greatly increases the chances of missing and failing to repel attacks. The worst one of these I experienced was having a single Novice from the Sisters of Sigmar kill two of my henchmen and my war band leader on her own because I could not roll a single hit.  I would suggest you play Bloodbowl instead as Cyanide has done a far better job at converting a tabletop game into a computer game. ",
            "review_score": "-1"
        },
        {
            "review_text": "Very simplistic turn based stategy game, don't let that trick you into thinking it's easy. RNG rules and it doesn't favor you in the least apparent 80% will miss three times in a row for your warband but the AI doesn't seem to obey the rules of Chance.  But even if it did it serves to highlight the real problem with the game. The complete lack of depth to it's gameplay to give context, at the ten hour mark you may have characters with two or three abilities all behaving much the same. Some warbands have purely worse troops that still cost the same...management is shallow and limited, deployment is more often then not taken from you.  All the preparation in the world and all the careful management (or what little the game offers) matters little when all but moving your troops is reliant on a dice roll.  Other tactics games simply do more, often with much less powerful hardware.  Add to that an abusive requirement to hand in resources regularly forcing you to focus on collection in battles where the AI can simply focus on you.  The entire game seems like it was designed by a dev team who didn't know how to make a challengeing game but still wanted to plaster 'Hardcore' on eveything.  If you're a warhammer fan you've probably already brought it and are playing it like me simply because it's a warhammer game that's vaguely playable.  In even simpler terms, this focus on making as simple a game as possible but also as 'Hard' makes a game that only real masochists will enjoy beyond it's warhammer skin. If you want more challenge then that afforded you by making your way through a brick wall with your face there are many other roguelikes available to play.",
            "review_score": "-1"
        },
        {
            "review_text": "While this is a functional turn based game, it's not the best turn based game you can play. Buying the DLC was enitely too expensive for what you get. The game feels unfair at times and customization is not particularly great or fun.   I should have saved my money and purchased a few table top minutures. It would have been more fun.   I would not recommend this game, even to a fan of the tabletop game.",
            "review_score": "-1"
        },
        {
            "review_text": "I really want to love this game, but I just can't in good conscious recommend it to anyone. There are too many issues.  In case you aren't aware, Mordheim is based on a skirmish tabletop by Games Workshop, though as I understand it it doesn't use the original game's rules. The adaption is a turn based strategy game in a really dark fantasy setting where you build and manage a warband. You recruit heroes and henchmen and slowly build them up by surviving randomly generated missions. There are permanent consequences anywhere, from permanent injuries after dying to downright permadeath. There is a constant race against time too since you need to deliver a ressource in time that you can gather during missions every few ingame weeks. If you manage to do it the timer is reset, but if you don't the whole game is lost. Losing too many people permanently and not being able to go to missions to gather the ressource does in essence also lose you the game permanently. This doesn't happen after 3 or 4 hours by the way, this will become a problem after 20 or 30 hours.  It would all be fine if it would all be down to your skill as a player, but there is a TON of reliance on RNG in this game. If facing permanent debilitations because of things completely outside your control is something that bothers you, dear god stay away from this game.  But it wasn't what made me quit playing ultimately (no I didn't ragequit after losing the game). What kills it is the slowness. There is a ton of waiting for enemy actions during missions and slow animations that can't be skipped or sped up. Also, the story missions are absolutely terribly designed. They are on maps that are confusing as heck with totally unclear mission directions. And they take forever. The first try you are almost guaranteed to lose until you figure out what the mission is even about. They are just a complete drag and no fun at all. After 20 hours of building my warband, seeing the forth mission of the sisterhood and thinking that I will have to face more of that ♥♥♥♥ after 20 more hours I just lost all energy and motivation.   Thanks but no thanks, there are games that are simply more fun than this.",
            "review_score": "-1"
        },
        {
            "review_text": "Nasty Wet Smear play much-much rat man! Kill-Kill many surface dwellers and steal-take all Wyrdstone. Murderlord reward Nasty Wet Smear with more Skaven and Nasty Wet Smear stab-kill in Murderlord's name! Beautiful circle it make. All rat happy!   Nasty Wet Smear hate random number generator! 95% should mean 95%, not Miss-Miss! Why 5% feel so big-huge when whole stratergy depend on it!? Many rat man swing-cut and hit no manthings! War band angry get and game quit many time!   Mostly, though, murder like clockwork is! Skaven kill-kill manthings when told and weapons and money take! Review we write so that in Mordheim we see you, then your throat we cut-cut and your shoes and hats we steal. Your meat feed many babes and more Skaven make. Murderlord thanks you from comfy throne... Throne where Nasty Wet Smear should sit...",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game, i like the challange.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is made all the more infuriating by how good it could be, but it is just frustration and anger wraped in a pretty bow. A brawl disquised as tactical combat. I had to delete it to prevent myself from trying to progress because I feel like if I smashed my head against this brick wall long enough I might find gold underneath. The cake is a lie, and this game is just a turn based third person shooter.  After some time I decided to give the game another go, and really put in some hours to see if the game improves as you progress. It does, alot. If you can get past the first 10 missions there is a fun game underneath the pain and agony. I like games that punish poor decisions, not so much games that punish bad luck with rolls. This one is unfortunately the latter, a little good luck can get you a long way but the best flanking manouver can go horribly wrong when every attack misses even though it claims your odds are over 80%  I still cannot recommend this game; even though I am personally enjoying it and will likely continue playing. Even a victory is a defeat early on as the route mechanics just do not function properly for low level groups making most optional objectives completely unattainable. If you are a stubborn sort who can get past the first 10 hours then go for it, otherwise look elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "Had to edit the review because since the last patch I always get a crash when starting a game. I sent the devs the report, made a thread in the forum, but didn't receive any support at all. It's a shame because this game has a ridiculous amount of potential.",
            "review_score": "-1"
        },
        {
            "review_text": "Please give DLC !  Seriously tho, Awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "By the numbers: 91/100  The Short Review:  Do you like the following?  Knights of the Old Republic X-Com (the original moreso than that modern... thing) Tactical squad-scale combat simulations Turn-based games The old SSI DnD gold box games Warhammer lore  If you answered yes to all of the above, push the Buy button. I can guarantee you will not be disappointed.  The Long Review:  Part 1, The Good  In the way of a preface, I've not played the Mordheim boardgame, but I am a Warhammer player from the very beginning of the franchise. I ran a Warhammer FRP campaign while aboard ship (The USS Tarawa, to be precise) in 1991. I later got into the miniature scene-- both the WH and WH40K side -- and I've a deep love of the Warhammer universe, especially the fantasy side. This game fairly oozes Warhammer atmosphere.  There is an attraction in managing a party of characters in an RPG that cannot be duplicated by MMOs. It creates an emotinal investment born of the natural leadership impulse in competitive personalities. Seeing your warband grow stronger and more powerful is a pleasure unto itself. The recent resurgence in popularity of roguelikes is -- to me, at any rate -- an indication that many gamers are becoming bored by the 'customer is always right' mentality that has come to dominate modern tripe-A game design. Intelligent people get bored quickly when they always win the fight and there is no real threat of loss; only a challenge will keep them interested. Mordheim provides challenge in spades.  The developers of Mordeim understand that being a leader is the imporatant part of a tactical wargame. Gradually developing your warband into a force to be reckoned with is the point of a successful party-based RPG. The individual warriors become real to you; they are people to be trained and used to greatest effect, rather than disposable products of a factory. The loss of a trained warrior has a real impact on your long-term strategy, as it should. But it also opens up new avenues for advancement, forcing you to consider alteratives that you may not have seen before, often resulting in a complete rethink of your approach.  Do not misunderstand me; this game WILL make you mad. There will be matches where the RNG gods will frown upon your existence and you'll wonder if any of your party have actually even held a weapon before. But there will also be engagements where everything goes right, where the universe smiles upon you, where you dominate your foes so completely that you will be convinced no one can stand against you... until the next battle. That is the essence of a good tactical wargame, and Mordheim has it in spades.  The beauty of the game is that any given engagement may or may not favor you. Sometimes you will be allowed to deploy to greatest advantage, other times you will be caught off guard, scrambling to get your team together. Much as with real war, the enemy doesn't wait until the situation favors you, rather you must analyze, adapt, and attempt to overcome. A word of advice: your first priority is always to Get the Band Back Together. As a squad, you are strong. As individuals... Well, there's a very old aphorism in the Marine Corps: never employ the soda strategy. SODA is an acronymn for Spread Out, Die  Alone.  Plan your strategy. Train your squad. Fight smart. That's Mordheim.  Part 2: The Bad  There are a few minor issues with the game. The most prominent is looting. The rules are written in such a way that you must make looting items -- especially wyrdstone -- your first priority. I put this in the bad category, but it's not necessarily all bad. I understand the background: you are a mercenary force in Mordheim. Your reason for being there is to acquire the extremely valuable wyrdstone and sell it, either to your sponsor or alternate factions. That's good; it's a great mechanic, as it forces you to always consider what you can get out of any given engagement and balance it against the risk of splitting up your force. The problem comes with the loot rules. You can ONLY loot that wyrdstone when you're standing on top of it during active play. Even if you defeat the enemy and you're standing on top of an entire field of wyrdstone, you can't loot it afterwards.  Imagine that you're a bank robber, (you're not I know, but just put yourself in his shoes for a moment). You hold up a bank, you kill all of the guards and tie up all the patrons. Now it's time to loot that vault over there fifteen feet away from you, right? Nope! You killed all the guards, so it's game over. No loot for you. If you wanted the money in the vault, well by God you should have looted it while you were killing the guards, eh? That makes sense, right? OF COURSE IT DOESN'T. But that's the loot mechanic in Mordheim.  I understand the balance issues. The devs don't want you to be able to loot the whole map, as it will result in a rapid build-up of gold and you'll easily defeat the AI. I get it. But there should be one full turn after you defeat the enemy warband wherein you can loot what you can reach. Because killing an enemy while you're standing in a field of wyrdstone and not being able to BEND OVER AND PICK IT UP before the match ends is... well, it's just frickin' stupid -- boardgame rules notwithstanding.  Part 3: The Ugly  Consolization. The interface was designed from the outset for a console release, despite the fact that the game's initial release is on PC. I can deal with it, but it does become annoying from time to time. For example, during deployment phase, you can't simply click where you want to deploy a warrior. Oh no; you must go through every single possible position One. At. A. Time. in third person view. On missions where there are dozens of possible deployment points, this can become extraordinarily tedious, since you can't deploy your warriors from the map. You have to constantly switch between third person and map for each warrior for EACH POINT, examining sight lines and location. It takes far, far longer than it should and is an inherent weakness of play-with-your-thumbs design. It has a smaller but noticeable impact in the warband management screens. An irritant more than an annoyance, really. But it's there.  That being said, however, the console-biased interface is not game-breaking. I put up with KOTOR's ridiculous console interface because it was such a great game. The same is true here.  Part 4: The Indifferent   S L O W. I put this in the indifferent category because everyone will see it differently. I love slow progression; the slower the better, in fact. If you're impatient, craving a continual stream of satisfaction and reinforcement, you will almost certainly dislike this game. It takes many, many hours of play to advance your warband even a little. Magic-using characters, for example, start off weak and essentially useless; you must spend a lot of time and gold to make them powerful. But with enough time and a great deal of gold, they can become the lynchpin of your strategy. Leaders are vulnerable (some moreso than others) and must be carefully nurtured into powerhouses who can sway the outcome of a battle. If you're looking for quick, easy satisfaction, you will not find it in Mordheim. This is a game of time and patience, development and planning. If the idea of investing an hour into a turn-based battle that would play out in mere minutes in real time annoys you, I cannot recommend you buy this game.   Part 5: Random Thoughts While Drinking Some Liquer Called Ke-Ke Which Tastes EXACTLY Like Key Lime Pie  Best Mechanic Ever: Morale is separate from morale impact (on death). It's far too complex to explain, (Steam says No More Words For Me), but essentially Morale is unit cohesion while Morale Impact is unit fragmentation. Just try it. Once you figure it out, you'll see the awesome genius of it.     ",
            "review_score": "1"
        },
        {
            "review_text": "A turn based strategy that has a collection of vastly different factions (dictating relative playstyle), the ability to fully customize your warband in terms of look, composition and even name, Hardcore gaming mechanics and character perma-death, and the ability to take your single player warband up against others in multiplayer and have those battles count towards experience and loot. What's not to like?  This unforgiving game will not hold the punches, and has a learning curve that may cause some players to turn away but in terms of fully customizable Turn Based Strategy I would call this a true gem of the genre and a very fulfilling experience on the whole. Each battle is tense and demands attention and understanding of your warband's abilities and limitations. Much of the battle system relies on Random Generated Numbers (So as to stay true to the Game's Origins from Table Top), but in this game strategy is key as you attempt to navigate this deadly city and keep every party member as whole as possible.   In Mordheim there are no victors, just survivors.",
            "review_score": "1"
        },
        {
            "review_text": "I've enjoyed this game so far. There is a steep curve when you first play, and it is pretty unforgiving. But if you're willing to sit back and do some reading to figure out the mechanics, then it has some quite rewarding gameplay. In games with such severe penalties at the whim of a RNG there will always be that frustration in the results, and it's really whether you're the sort of player who'll endlessly reload to achieve perfection or who'll press on through the failures which will decide how much enjoyment you'll get from the game.  It's got a fair amount of flaws which will grind the gears of some, whether limitations in customisation options or choices made in creating the turn based combat system, but nevertheless I've found a charm to this game which still has plenty of room for further improvement, development and additional content.",
            "review_score": "1"
        },
        {
            "review_text": "This game, dare I say, is even better than the tabletop version. No arguments over line of sight, no disagreements over if someone is in charge range or not, no loud discussions over the terrain features and how they affect your movement and most importantly, no one is getting dice pelted at their face when the above situations occur. There are some features of the tabletop version that I like and that are missing from this iteration however these are small things, and far outweighed by the impressive array of skills, a much better percentile system (over the old D6) and better opportunities to really customise your gang of misfits.",
            "review_score": "1"
        },
        {
            "review_text": "I'll not lie, its not a incredible game, in fact i dont know what this game has, but i cant stop playing it......  ",
            "review_score": "1"
        },
        {
            "review_text": "I bought it in early access ages ago as I played this tabletop game as a child and loved it.  I waited until it was out of early access before playing it as I didn't want to ruin it (just like I don't watch trailers for movies).  I am loving it. The game mechanics are very different to the original game but they work very well as a video game. Amazingly well in fact. This is the best designed game I'm played in a long time.  I love the open-ended, rogue-like nature of the game. I got brutally slaughtered in the first game (before I realised not to split my band up) but still enjoyed it as I was immediately spending XP and changing my choice of weapons.  Losing is common, but it's not so bad as your warriors don't die (some get injuries, usually 1 max). Just keep grabbing Wyrdstone on the matches.  I've had zero crashes in 13 hours, of playtime. It is slow to load the matches (~40 secs) but once they start it's fine.  If you like tactical combat and open-ended gamepleay, I can honestly say this is the best game like this that I've ever played in the last couple of years.  Edit after 150 hrs: Still enjoying the game very much. The main flaw, and it's a big one, is that the AI pathfinding is pretty poor. This means that sometimes the AI warriors get stuck and essentially waste their turn. I hope they fix this in a patch as this game could otherwise be a classic.",
            "review_score": "1"
        },
        {
            "review_text": "Solid 8/10  Pretty good game, I bought it because X-COM2 wasnt out yet and I surprised myself stucking on that game instead of actually buying X-COM2.  The fact is : This game is really harsh, I should say unfair and over-punishing with new players. Other player`s opinion may differ, but this was my experience. Dont get me wrong, its not a bad thing. This game was MADE to be that way.   WHAT YOU NEED TO KNOW :   -----This game should have a warning on its label :  You are going to get intensely r4ped for the first 10 hours or so. Its totally normal if you feel sad and angry, just accept it...Learning curve ?...No way, you are thrown into it and you are going to drown. Pretty much the reason of all bad reviews.  -----The game also doesnt warn you that its almost impossible to stay with your first ever warband, so dont get attached too soon. You are going to replace them often, disbanding and re-creating at least once. They going to get killed, crippled, ransacked and sick poor again. You are going to want to bash your whole house and family with your keyboard, but its part of the first stage of the game.  -----To be honest, once you get past the ' initiation ' step, its one of the best bucks$/game ratio I ever played, and I bought it full price so I reccomend you jump on it, especially if its on sale. The game also greatly rewards new warbands, depending on your easily obtainable achievements.  Most of bad reviews come from people with less than 15hrs. Give yourself a chance, you are missing a great gem of a game. The game is still challenging and hard when you gear up and lvl up, but really less unfair. Damn good game.  My point is : Dont buy if you dont like getting angry on a game. Dont buy if you want a 'walk in the park' gaming experience.    NOW THE HONEST REVIEW :   Dont buy if you dont like unexpected and 'against the odds'. Whole game is based on dice-rolls and odds. Once again, reason of most bad reviews...  Personally I call that ' Challenging' and 'Refreshing' ...Mostly 'Refreshing'  But most gamers nowaday calling that... ' Broken'...go figure....And I am not even that old. I am not even an hardcore gamer.   PRETTY SIMPLE :  You want to win on each tries, you want forgivness on your stupid/rushed plays?  You want to load a previous save because you ♥♥♥♥ed up?    Steam, Origin, U-Play, name em are full of those kind of un-original games, of any genres. 70-80-90$-DLC not Included, and you will get erected at how much copy-paste/recycled games are appealing and how much dev team doesnt care about you and your elite community. Btw, I got these kind of games on my pc. Some I love, Some I regret. I am no hater, I love games.   Rogue-Factor`s first game...Not perfect, but damn impressive for a little bunch of devs. Promising future if you ask me, just dont bury em under false bad 'under 10 hours game experience' meaningless-seen-better-meh-IamtheShit opinions.  Worst of all, every negative stuff I read about this game is absolutely wrong on most aspects. Too little time into it to make worthy reviews. I have seen about 3 constructive bad reviews, with points I agreed on, but never to the point of calling that game-breaker.  IMPORTANT TO MENTION :   -Great ambiant music and great grim victorian dark atmoshpere. I mean, its dark, and grim. Like the first Diablo compared to Diablo3.  -...You have to be patient...You have to let time to the enemy to place their warriors, can take several seconds. -I never tried multiplayer, due to real life stuff. But from what I heard, its not optimal yet. -Dev team often on forums and answering constructive posts. -Speaking about the forums, many experienced players are there, always happy to give tips.  long read, sorry. By the way, I never played the table-top version. I heard there is some inaccuracies. Some people like it, some dont. Anyway, the game is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Update: ----------- As of yesterday, I managed to connect to a Multiplayer game, so looks like something has been fixed in one of the patches. Thanks devs! I'm still unable to play the game in windows, so I played in WINE after dual-booting.  It was a fun game for MP, and I enjoyed the ability to scan around in 3rd person while the opponent was scurrying around trying to sneak up. The turns went fairly smoothly, with no discernible lag between turns.  Original review follows. ------------------------------------------------------------------------------------------------- Every game results in a hard lockup of my PC. I have to hard-power-off every time.   Drivers updated, reinstalled, tried all the settings, checked temps yada yada. Support responded with boilerplate questions and never replied after I provided the info they asked for. I have 400 other games that do not lock up my PC.  It does run under WINE in linux (on the same hardware as above) but have been unable to join a friend and play online. It's pretty straightforward but drop a comment if you need help to run in wine.  Could have been a great game that I would have sunk some hours into, but I can't recommend a game that locks up my PC in windows and doesn't work MP in linux.",
            "review_score": "-1"
        },
        {
            "review_text": "There is a flawed but essentially good game underneath Mordheim's problems, but it is heavily marred by a user interface and game flow that is *extremely* wasteful of the player's time and attention, to the point of displaying a marked disrespect for the player.  This disrespect is on display everywhere in the game, from every in-game action being punctuated by several one-second pauses in UI interaction, where it essentially animation-locks the UI, to the fact that the game does *not* fast-forward AI actions that are out of view -- it plays them invisibly at normal speed, meaning that enemy turns take 10-15 seconds for each enemy (and there are 5 to 10 enemies), and most of this time is unnecessary waste.  I'd also like to note that Mordheim's developer is one of those who purposefully refuse to allow beginning logo videos to be skipped, in spite of clear negative player feedback on it. (Their answers on the forums are disingenous -- they claim that the videos cover game loading time, but the hard drive and CPU usage are nearly nil beyond what is used to play the videos -- CPU usage actually increases once the logo videos are done and the skippable intro video begins playing.) Disingenous forum answers are also disrespectful.  So, all said, I personally think this developer could use a lesson not only in UI design, but also in respect for the user. This problem is distinct and serious enough of a flaw in the game, that to me it warrants a punitively low review score. I hope developers learn to be more respectful of player time and attention.  There are other significant flaws with the game design, but I won't go into those. They're workable and could be forgiven, especially if alleviated in patches. But the UI itself, along with the unskippable logo video timewaste at the beginning, is the dealbreaker. And shame on you, Rogue Factor, for it.  EDIT: I can see that in the latest patch, the devs added an option to speed up the AI player's turn 15%. A move in the right direction.",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely fun game. It reminds me of xcom but with swords and shields.",
            "review_score": "1"
        },
        {
            "review_text": "not played for some month and now after patch 2 i tried again BUT i do not relly enjoy it. RNG is against you and if that is not enough injuries are too often really crippling you. That would be okay if i deliberately would have chosen HARDCORE mode or something like that. I love the Table top and hope that the game gets playable. But now with my tier 2 warband i already get punched to dust by lucky AI. The enemy heroes hcarge for 40 to 60 dam in the first encounters. Your own units will miss alot and if they hit it is for 25is damage.",
            "review_score": "-1"
        },
        {
            "review_text": "This game surprised me, I came in with no real expectations but having played the board game I was pleasantly surprised. The game is what it sets out to be, hard, tactical, dark. Very well polished and a good use of the IP.  However, I CANNOT recommend a game with such a godawful business model. I would be fine with warbands being DLC, or the main game being higher priced. I am NOT ok with selling individual heroes as DLC.  Only buy this game if it is on sale, and only buy the DLC if on sale and bundled. It is a shame for a great game to be handled like this, but business needs are being met in a distgusting way.",
            "review_score": "1"
        },
        {
            "review_text": "It's just not very good. I'm a big fan of the tabletop game, but this bears it little resemblance. Combat is totally different, as is positioning. Navigation is very hard with the insistence on a first-person view. A top-down view would be much better.  Too much time is spent hunting for wyrdstone -- is it on this level, or up or down a level?",
            "review_score": "-1"
        },
        {
            "review_text": "Hardcore game, everything can be lost and can ♥♥♥♥ you, when someone is downed if their equipment is expensive you better loot it or they may lose it It's a great concept but needs some fixing winning a battle shouldn't make a unit lose their gear after being downed (wouldn't the warband carry them with their gear back to the cart?) This game is great, but do not take it like XCOM this is a true Ironman game spreading too thin is death, a single soldier isn't a god not even an Impressive or story characters taking a on 1 people with 1 character will ♥♥♥♥ you This isn't casual, the enjoyment is in strategy taking on Deadly missions will hold great loot but you will probably not loot much because you need everyone to take them down",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love this game. Single player missions have been really satisfying, and would love to get some of my friends into it to play some matches against each other. The game could use some updates, which fortunately the devs seem to be doing actively so far. Learning curve is a bit steep and the game could use some more visual feedback to help understand its mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "After a few hours play time i quickly noticed that this game has alot of RNG. If you don't like that kind of games this game is not for you. If you don't like to die over and over again cuz there is no option to save and every action you make will effect mostly the rest of the game then this game is not for you either. It has a really good atmosphere and nice graphics as well and i think it lives up to its title 'Mordheim: City of the damned'. It's a pretty nice game overall. Ohh and did i say you will die-die alot?",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, looking forward to more warbands as DLC. Hopefully GW gives these guys the rights to make Necromunda. This is one of the best GW conversions!!",
            "review_score": "1"
        },
        {
            "review_text": "Get this if you like blood bowl and hate elf bulls#!t. No crazy rules, just knock the enemy out.  Good game for those looking for a challenge. At first it will feel completely random, but in time you can reduce the risk a great deal with good strategy. You will still have those occasional moments when the enemy hits that 1% chance and you lose your best character. If you can't deal with that, don't bother playing.  The vetran system means you make permanent progress, no matter how bad it gets. It almost feels like a rogue-like, due to individual matches for shorter games and progress across warbands.",
            "review_score": "1"
        },
        {
            "review_text": "Ok let me start by saying i have had time to think about the game and what i have posted below. I might be a bit salty that 3 out of 3 youngbloods that have had higher than 75% dodge may have died by getting chained by highley mobile enemys in combate. I admite i was hoping to get hit 1 every 10 attacks, but i accept thats just not how the game works. the game is challanging, but you cannot depend on raw unit talent. You must depend on wit and largley luck. luck is the enemy you must give it the lowest possible pprobability with your actions to win, be it by fighting with alot of range in narrow spaces, or by creating a kill zone. it is worth playing but do not expect to have fun, come looking for a challange and to spit in the face of death.   Below is my review at my worst. Enjoy!    Hello You might be interested in this game, so before you buy i would like to give you my review after about 30 hours fo the game.   1. Random number generator is broken, with a 85% chance to dodge with my favorite hero young blood he managed to dodge 3 times out of 9 strikes. While this may not seem so bad to you since its its a dice roll game anyway, characters who you may put hours of level grinding into may have a bad streak will most likley die permenantley, then you will be forced to create a brand new level 1 hero youngblood, who will most likley die before you manage to train him up to par with the rest of you veterens, since the game doesnt not scale down when this happens. Also when the game does give you an experienced merc it will most likley cost you more then you will be able to make since the main source of income ( your patron) pays you less then 50% what other clans would.  2. you are indebted to a patron whom basicly pays you peanuts when you can sell to other clans for much higher of a price, leaving you unable to skill up champions due to a grand lack of gold from your patron. This also infuriates me because for some reason the patron who keeps you broke is the only way to continue playing. since if you fail to ship him your slave labor 4 times you lose and you must completely get rid of your warband that you spent 30 hours on. making it very difficult to actualy train your mercs with skills that will save their lives oir give them a lead in battle.   3. the game does not attempt to complete objectives as you do, you will find your self in a rush to get wyred stone for your patron and for other clans the latter of which generousley gives you much much more gold, while you are questioning why your patron is your patron at all the npc AI will always be spanwed closer to the wyred stones on the map, and will always try to intercept you and zerg rush you instead fo collecting stones and making money themselves. the worst part about this is that if you do and the enemy routes the mission ends, Giving you no chances to collect anymore resources and Worst of all A MAP CHOCK FULL OF WYRED STONE THAT YOU FOUGHT OVER AND POSSIBLY PERMENANTLEY LOST SOLDIERS FOR THEN YEILDS YOU THE MINIMAL RESOURCES POSSIBLE INSTEAD OF WHAT IS ON THE MAP. a perfect example is a map with 5 clusters 14 shards and 20 pebbels will yeild   1 wyrd piece, 1 shard, and 0 clusters. so thsi is perticulerley bad if you constanley get rushed and forced to fight and kill the ai till they run.   The game has potential and when it works right its fun but the amount of time it works wrong is just not worth the effort of playing it. its concept is uniqe and the world is crafted well, but you will find your self hating it, its like looking at a shiney new possable firgure and finding out its not actualy possable.",
            "review_score": "1"
        },
        {
            "review_text": "I love hard games, and this game can be very hard until you learn it. Im hovering at 90 battles won with a 100 percent win ratio, and a 700 percent casualty percentage now. The game is great! Even when I feel like I have a confident grasp of battles and my people the game still makes me nervous at some point.  Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This is the perfect balance between roleplaying and strategy games. Yes, the opponents do take a fair bit of time to make their moves, but you can browse reddit, or even skip between your characters to try to plan your next move. I personally love this game, and would highly recommend",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy games such as XCOM and Darkest Dungeon, you'll probably enjoy this too. Don't expect AAA production values or fairness. If you come into this game expecting a smooth run, you're gonna be disappointed. If you enjoy the ups and downs of a game of this nature and take it as it comes, you'll find a satisfying experience tactically on par with the aforementioned games.  I actually enjoyed that unlike XCOM or Darkest Dungeon, downed soldiers will usually survive and are more likely to be injured than dead. It's a bit more granular and allows for more balanced fights where you can have multiple downed soldiers but still win, rather than all-or-nothing (either you kill all the baddies, or it's a total failure). The 'rout' system plays into this nicely as well. Coming from XCOM I found it refreshingly forgiving while still keeping the fear of death at every mission-end screen.  It's not a beautiful game and it could certainly have more variety - if I paid full price for it, as a frugal gamer, I might feel a bit ripped off. But at £10 it's a steal. It fills a niche that few games do, and it's gradually getting better over time as they add more warbands (even if you don't buy the DLC warbands, they'll show up as enemies) and fine-tune the balance. The devs are very communicative too. I hope to see the game expand even more over time.  There's unfortunately lots of folks downvoting genuine reviews and trying to trash this game, which is silly. It seems a lot of folks have never played an RNG-based game before and are stunned that 90%s can miss and 10%s can hit. Those moments where your archer fails to climb up a wall three times in a row are hilarious BECAUSE they are unlikely. The moment when your henchman nails a 10% to hit a vampire lord, or when you lose your leader to bad luck - that's why we play these games. It enables a narrative that other games don't have. The triumph of victory against steep odds, the crushing defeat of failure. You don't get that feeling in most games. It's not for everyone, but if you're one of those people - you know who you are - then you know that there's no substitute.  I suggest looking at hours played for reviews and check out some youtube lets plays if you're on the fence.",
            "review_score": "1"
        },
        {
            "review_text": "This game is complete and utter garbage for one reason only. The random number generator is broken as all hell in this game. At first I loved this game and thought it was the most accurate conversion of a GW game that I had played, but when all your hard work and tactics is thrown under the bus in every single match its insulting to the player that the Developer is either so inept or so careless that their 'random number' generator is bias and broken.  When your leader has a 75% or more dodge rating and EVERYTHING HITS HIM EVERY TURN, it shows how broken it is. I understand that occasionally you get back luck and bad rolls, but this game consistantly ruins your efforts. Dodges are failed enmasse, and yet when you attack an enemy with an 85% chance to hit and you fail 5 attacks in a row, every turn it demonstrates that the developer has skewed ot the numbers to fail you and favour the AI. This is an enormous deterant to playing seeing as your Warband has to carry from game to game with all its failures and setbacks while the enemy AI gets a fresh team every single match.   If this was just a difficulty setting I wouldn't mind so much. If it was bad luck every now and then I wouldn't mind so much. However all the high percentages set in my favour, fail about 80% of the time. Whenever the enemy has a low percent, they seem to succeed 80% of the time.  It breaks the game and mean no matter how much effort you put in or how much time you spend learning the mechanics, it means ♥♥♥♥ all. Because its auto set to fail you.  \\O/ DO NOT BUY THIS BROKEN GAME \\O/",
            "review_score": "-1"
        },
        {
            "review_text": "Helen keller could hit more people than my team",
            "review_score": "-1"
        },
        {
            "review_text": "really tired of GW games being put out missing more then half the actual mini game races/teams, and then having to pay for all the extra teams/ warbands as extra dlc.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to enjoy this game but it has major flaws that made it unjoyable. First off don't get me wrong some strategy and warhammer fans will enjoy this but to others its a pretty bad game.   The Good: - The graphics are pretty decent - Environment is great and you can feel the dark and despair around you - Rogue like  The Bad: -The combat is atrocious since the turn/attacking systems is completely random and doesnt follow any pattern - Steep learning curve - Confusing management and wyrdstone bartering -When climbing/dropping between floors you have the chance to take damage  I was expecting a game like Xcom but was not greeted well. Overall I didn't really enjoy this game (6/10).",
            "review_score": "-1"
        },
        {
            "review_text": "I really tried to like this, and I looked at forums and suggestions for play but I really cannot recommend this at all. I know the frustration of RNG linked games, like for instance Blood Bowl; they can make you howl with rage, but as long as you can still have fun I don't mind that at all - so I love Blood Bowl despite the fact your best player can die trying to run in a score with a 80%+ chance of success without any opponents near them. This game has that frustration but without any fun. It is dull, frustrating and repetitive. I gave up thinking of reasons I should give it another chance and just removed it. Not worth wasting my time, and I would suggest yours.",
            "review_score": "-1"
        },
        {
            "review_text": "I want to like this game... I really do. I gave it a big chance, tried each warband, played it pretty hard.. But it's massively let down by terrible balancing and lack of saving... My game was ruined at Act 1 scene 4, after building a solid gang, I was progressing across the bridge when the Chaos Ogre on next to no health, Stunned the main story character then killed him in 2 blows from full health.. Mission over I lose? all my characters take wounds which ruins them, I lose all my magic equiptment... Seriously 3 BS Dice rolls in a row and may as well start over.. Why would you not give a save option? Seriously it's 2016.. you have an ok game with a terrible mechanic ruining it.  Add to this... Terrible balancing means camping/Turtleing is by far the best option, kite an enemy, kill them, rinse and repeat.  I await the downvotes from the insane hardcore lovers.. 'oh you just don't get it' or some such nonsense.. Terrible mechanics don't equal hardcore they equal terrible design descions...  Edit - It's not even difficult for the developers to fix. Offer a single player mode (so saving can't be exploited for multiplayer) disable the multiplayer for warbands created for singleplayer, and allow the player to save the game, it's clearly saved after every single characters move. Just add saving/loading in camp. Then people can re fight bad fights.. Suddenly the game is less merciless and enjoyable.   Balancing the battles however might take a bit more work. At present the AI seems ridiculously over powered in 1 on 1 situations.",
            "review_score": "-1"
        },
        {
            "review_text": "The only negative thing I can say is that I wish they had more warbands",
            "review_score": "1"
        },
        {
            "review_text": "A Very good Strategy game for all Warhammer fans (:",
            "review_score": "1"
        },
        {
            "review_text": "The game is all about restart or starting over. The success percentage is way off in this game and seems to favour the AI. Not a game I'd recommend to people to aren't fans on the warhammer universe   4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Interface is cumbersome and there's no way to tell where each character is any kind of an easy way. Kinda feels like a junk 90's RPG game without mapping. So close to being fun that its ridiculous.  Like any other GW specialist game it's almost good, but really isn't.",
            "review_score": "-1"
        },
        {
            "review_text": "Only recommended for a die hard Warhammer fan. If you are looking for a strategic game is better to find an alternative. The campaign &amp; warband management it's generally well done, with upkeep costs for your soldiers, wound system (both mental and physical) that can permanently change the warrior attitude and stats, equipment choices and so on, but the actual strategic gameplay is a joke. Movements and attacks are performed in a 3d person view camera, you can't pan around and you can only use a crappy 2d map to actually plan your moves. Movements are clunky at best. UI it's terrible. Actions takes way too much time to process (especially the enemies ones), many useless animations are in the way. Stats checks for stupid stuff like climbing a wall that frankly i don't understand what purpose should serve in terms of actual gameplay. Lastly, most of the skills/spells you can teach to a warrior are useless or way too marginal to actually make a difference.   It's just feels weak as a turn-based strategic game. Overall a sleep inducing gameplay, with a boring soundtrack and low quality sound effects that unfortunately didn't help in keeping me engaged.",
            "review_score": "-1"
        },
        {
            "review_text": "Clunky and just generally difficult to use.  This would have been a mediocre game in the 1990's, but by today's standards, it's just horrible to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Mordheim has a nice idea, coming from the old tabletop game. However, the idea that your warband automatically deploys every time in random areas with no idea where the rest of the warband is, is just flat out rediculous. You have no way of knowing where they are unless you accidentally see them in passing, when the enemy is moving and you see at least 2 warband members. Then finding any loot, forget it. You have no way of knowing where that is either. You will wind up deleting and creating new warbands constantly because you have so many injured, that you cannot adventure to make money, and when you do, you are scattered and wiped out. And your opponents are not scattered. They are grouped together and always know exactly where your warband is.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has an excellent premise, it has the perfect setting, it is punishing if you make a mistake and intend you to not get attached to warbands as they fall by the wayside in the city of the damned.  It is also incredibly unfair at times, and I personally will never put the game down with a smile on my face as I generally feel cheated by the RNG or the AI's ability to rush half a football field over to you and then ruin your day in a turn. Add this to the INCREDIBLY clunky looting and movement system, you can when the luck goes against you feel like flipping a table due to the sheer time investment you've made into the session.  Is it a good game? At it's core, yes it is a good game. Is it worth 40 Euro? No. It is not worth 40 euro by a long shot. Pick this up when it is on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "this is a fun game and I like it",
            "review_score": "1"
        },
        {
            "review_text": "So I downloaded the free play demo. I'm running 2 x 980 Ti's and the game just keeps crashing on me. Haven't managed more than 2 minutes gametime without a crash. Don't think I'll bother making a purchase, even though it's 60% off at the moment......",
            "review_score": "-1"
        },
        {
            "review_text": "Some things that happened to me in a few hours of play.  Leader died on second mission, i had no money to pay the upkeep or medical bills, had to sell my wyrdstones just to get by but i also needed to fulfill a shipment request in three days. After hiring a new leader and patching up my guys i had one day remaining for delivery, took a mission crushed my enemies got the stones, somehow it all worked out and all was fine for a bit.  Some time later my leader died yet again this time along with one of my henchmen and several others were wounded pretty bad, the loss hurt even more this time as both dead characters had spent skill points 200 gold down the drain.   After recovering things were going pretty smoothly, i was making shipments on time doing well on missions and even picking up a few upgrades for my warband, it was looking good...  Next day i do a campaign(story) mission, get horribly recked by demons and fail it, leader died again and my hero also died, my impressive unit got a leg sliced off and now can barly move around on a peg leg.  Basicly playing this game is like riding a rollercoaster, sometimes you hit the high point and feel untouchable, then suddenly you get plunged into dispair and desperation.  10/10 would get leader killed and units horribly maimed again.",
            "review_score": "1"
        },
        {
            "review_text": "The game can be very frustrating at times, but it also can be very satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a very good adaptation of the tabletop game. Probably the only critique I have on the game mechanics is the huge focus on Wyrdstone, which, while giving it a sense of difficulty, gives problems in terms of trying to play it as a simple fight. You only get that time to play it like that when you collect and send out the shipment, but it's not for that long a period. But this is definitely a great game if you're into Games Workshop's tabletop games.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game ! Hard, Brutal, Unforgiving!",
            "review_score": "1"
        },
        {
            "review_text": "Its a good game not my kinda game and i wish i could get my 40$ back",
            "review_score": "1"
        },
        {
            "review_text": "Boring. No depth. Every quest is deathmatch where you glitch the AI or lose.",
            "review_score": "-1"
        },
        {
            "review_text": "Not for the faint of heart. Prepare to die, lose limbs, lose eyes, rupture ear drums, and become stupid.",
            "review_score": "1"
        },
        {
            "review_text": " Pros:     Faithfully replicates a lot of the Mordheim wargaming experience    Cons:     Faithfully replicates a lot of the Mordheim wargaming experience    Jokes aside, I really wanted to like this game. I'm a big fan of Warhammer in general, so anything in that setting deserves a look in my book. This game fails to deliver on quality, tho, and I'm a bit salty that I spent cash on it at this point. I kept playing, hoping it would 'loosen up' and get better as I learned the systems more, but that didn't happen.  I played Mercenaries, so your experience may vary depending on your warband preference.   Main problem",
            "review_score": "-1"
        },
        {
            "review_text": "It's pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Perma death ? That's so last year, this game has perma injuries.",
            "review_score": "1"
        },
        {
            "review_text": "If you get frustrated with x-com's rng don't buy this game it's even worst. The game prides itself on difficulty whenever it's just tankier people higher the difficulty, and RNG that's against you regardless of having a 90% chance. Honestly I'd love this game if the RNG wasn't such ♥♥♥♥♥♥♥t, I'd even say most older CRPG's have better hit chances than this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Good gameplay and atmosphere. Willl I get it? No, namely for not enough rpg elements in terms of character personality and customization, as well as the loot mechanics being a bit too harsh for my taste. A decent core experience though, and I will look out for future titles from the developers that maintain this style without compromising those elements.",
            "review_score": "1"
        },
        {
            "review_text": "it's cool, wish there were more units tho",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game, it's addictive and is fun to play up to a point. But it is so demanding constantly, needing to earn gold to pay your warband, collect wyrdstones to send shipments and being constantly aware that one battle could be the end of your warband perminantly, even a technical win could result in a overall loss if some of your key members get poor RNG results at the end and end up loosing an arm or other injuries.   While I do like the demanding nature of the campaign it makes the game something you can't really play when you're not paying full attention and it makes it feel not so much like fun to me. If they were able to introduce a way you could have duel profiles, one you could play seriously and was as it is now brutal, and one where things were more relaxed but not easy I think I would start recommending my friends to get this game rather than steer clear for now.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game of tactical combat. Every mistake costs you a lot but that's part of the fun. There are consequences to wounds, and you actually care for your characters as a result. The factions are varied, gameplay different whether you play melee-only sisters, fast skavens or balanced mercenaries. I'm usually not a fan of DLCs, but these bring a lot, plus you can play against the new factions even without paying anything.",
            "review_score": "1"
        },
        {
            "review_text": "Mordheim: City of the Damned .An awesome game that simply needs polishing or at least modding....  A hardcore game , 300% hardcore . I love it and it reminds me of X-Com: Enemy Unknown. There are several thing i LOVE .   1:NO ♥♥♥♥♥ SAVING . 2:It`s Warhammer Age of Sigmar. 3:Factions ( Skaven (LOVE EM ) , Adepts of Chaos (Disappoting) , Sisters of Sigmar (never heard of em) , Mercs and Witch Hunters (OP if you ask me)) 4:Customization is cool but could be better. 5:The city is ♥♥♥♥♥ amazing ! Traps , shady pathways , destroyed buildings and mutation starting to take over the city .   But there are thing that could be some much better in this game like: 1:Skills are kinda lame ... Some skills seem to even harm you if you learn em. I would preffer X-Com like skill system or Faction exclusive skills with neutral skills mixed in or something like that .... 2:Objectives : Poorly executed. Why? Cause to win you need to do a Primary objective and it`s simple . Route or kill all enemies , easy peasy lemon in your eyes squeeze ( Gives you 2xp) . Secondary objective kill and loot marked enemies(easy) , collect warpstones(easy-hard) , steal opponents flag and bring it back(Brutal) . (Gives you 3XP) Last one is total BS .... Primary 2xp secondary 3xp .... Just meh.... 3: Battle difficulty : What is difficulty level does in battles ? It buffes your enemies with more health and damage that`s it ... lame as hell ((( It is rewarding though but there is no point in getting stronger because your enemies will ALWAYS be as strong as you are and have the same unit setup. So as i said lame as hell... GIve enemies more units or allow enemies to have reinforcements like in campaign missions... 4: Units death : You would think that if your unit died ... well he died. Nope not here , we have KO`s here with an axe or a greatsword to the head . LOL . But here is a thing your unit that was KOed has a random chance of dying , you won a battle but your leader got KOed and BANG he is dead FUN!!! Otherwise there is an injury system that is really cool but at the same time I just hate it .... It just doesnt make sense to me ...  5: Ai turns : are SLOW as hell when you dont see their units ...   All in all a fun game, soooooo .... BUY IT ! Me want MORE games like this =^_^= PS: I WANT ORCS AND MORE UNITS !!!",
            "review_score": "1"
        },
        {
            "review_text": "As someone who has played the actual tabletop game, and still keeps several Warbands on hand (y'know, just in case)... I can very much reccomend this game to anyone that is a fan of the tabletop version. It has it's flaws, and there are bugs, but please keep in mind that this is an Early Access game. They are barely in alpha and aren't even finished making all the warbands. I admit that the limitations of the program now do make it something that would be hard to play often, but as more features are released to people that have already bought it, the game will get much better.   There are currently four warbands to choose from (June 2015) and they are Humans, Skaven, Sisters of Sigmar, and The Cult of the Possessed. The units included are all quite faithful to the source game, and the equipment loadouts are fairly self explainatory to anyone familiar with Mordheim, and easy enough to figure out for new players. Lack of leveling system is disappointing, but that will come in future updates. When the game is more complete it will have a lot more appeal to newer players, or people unfamiliar with the source material.   Gameplay is fairly easy to figure out. Move your character, perform action, etc. Combat animations look decent, the city has some nice detail and the maps look pretty good. Fun overall to play, though definately more fun with other players than against bots. The bots are fine if you just need a quick game, but for the best experience, play with friends. All the best multiplayer games are ones that can end friendships. lol.  TL:DR VERSION: Good game. Currently would rate 6/10, only for limitations of early access version, but well worth investment. Great game, faithful to the source material, and fun to play with friends. 10/10 would buy again.  UPDATE - Full Release Patch 2 - Having played the campaign and had a chance to genuinely enjoy the game a bit now that it has hit full release, I can say that I still do not regret my decision to purchase this game. It remains a very playable, faithful adaptation of the classic tabletop game that still gets played in my house. Looking forward to the addition of more warbands and expanded content in the times to come.   10/10 would descend into the City of the Damned again.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game!",
            "review_score": "1"
        },
        {
            "review_text": "I like this game, but it still feels like alpha. It was probably pushed too soon to ''full'' releasee.",
            "review_score": "-1"
        },
        {
            "review_text": "Yes this is a good(maybe great game), if you like warhammer this will be a game for you. Careful though, as there are still glitches and bugs that make you want to cut someone deep, wide and Continuously.  Good.  Graphics are not bad. Replay is decent, with some warbands. Solo play with multi play so either or you are set. Decent fun in just the warband screen lol. Change uniforms, names all the good stuffs. Game play is good. Fights are unfair to you. Fun just the same.   Bad.  Unforgiving, as in do not pay attention to the % they put on your screen. Insert cake is a lie line here. Bad story line. Do not do the missions unless you out rank them quite a bit. Or have hours to look for things.  Good game over all, do not expect to 'win'. Do not get attached to a warband, it will die, in the face, alot. There are no real tactics in the game, think more of tabletop with a cpu. Or if you get it Big Blue vs. you. Fun, fun game.",
            "review_score": "1"
        },
        {
            "review_text": "It is a try to bring Mortheim on the Screen. But the controls are terribel and the whole game feels clonky. The mostly character bound Camera does not really bring you in the action as much as it restrains your view. The Art is the biggest let down.  The detailed and well amde Citadel miniatures and GW awesome Artwork are far beyond what you get in this game. IT feels more like a mod made with RTS Assets then a sopisticated round based Skirmisch game.",
            "review_score": "-1"
        },
        {
            "review_text": "Very hard game,but once you learn and understand what it's asking you to do,it's a very fun game. Great game if your looking for a hard but fair turn based game.  worth every dollar.",
            "review_score": "1"
        },
        {
            "review_text": "This is my first ever review. Mordheim is a brilliant game in every way, or should I say: was. It requires real tactis and battle insight, it gives a very good squad build-up and as such requires long term planning of every single member of the squad. The options you have are endless. The whole system works great and the new races bring even more versatility.  Alas, as of late I can't even get my squad to win missions in such a way that advancement is possible. Planning has no use anymore, it's more about survival in almost every single mission. I know it is meant to be unforgiving and it should, but this is getting out of hand. It's no longer fun if you can't even get a new hero to survive for more than two missions since then the injuries start piling up. I played for (in game) 13 days, a whole cargo assignment cycle and had the feeling my squad didn't advance a bit. Yes the stats did, but no skills, no money, almost no wyrdstone ( at least not enough) so constantly battling for survival in every mission. It feels I'm following the lead instead of leading the dance.   Again, I know it's meant to be tough, and with over 400hrs playtime and many many warbands I think i have no problem with that. But this is getting out of hand. I suppose it's also meant to be fun on the side, and at this point I'm seriously considering quitting all together. The only race I've had successes with ( as of lately) are the vampire counts. The rest are difficulties difficulties and, yes yes, even more difficulties.   Over all, a very great game, I really recommend it, IF some minor changes would be made. Good news is they actually read these things and update regularly. Hence this first and only review ever. I sincerely hope I can enjoy this game again as I used to, till late at night and proud of the (injured) warband I had created, which was able (with injuries) to beat the odds and advance even further and falling 'in love' with every squad member, even those with missing eyes and limbs! Not watching my squad being helplessly being beaten into the mud over and over again, till death do us part...",
            "review_score": "1"
        },
        {
            "review_text": "This is a very rewarding tactical game with an impressive depth to it. The learning curve can be fairly steep, and the difficulty levels on the missions should be taken seriously: if a mission is marked as very difficult, expect it to be exactly that. If you blindly rush into battle, expect to get slaughtered more often than not. With all that said, it can be played, it can be beaten, and it's a sheer delight when you do achieve victory.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Personally, I dislike this game. Now don't let that get you down, because there's really nothing wrong with the game itself.  If anything, if you're like me and you expect gameplay somewhat like turn-based dragon age, welp, you're looking in the wrong place. I think the best way to describe this game would be to compare it to darkest dungeon, but with better graphics and more confusion. And 3D. But of course, still the same amount of micromanagement, perma-death of characters, stress, and the game simply hating you. Another way to describe this game would be.... say... 'turn-based dark souls'. I think that should say enough.  But hey, if you /are/ interested in a hardcore turn-based 3D game, then here's some stuff. This game allows you to choose between like, 6 factions, (two of which are dlc only but it won't tell you until you try to choose them), and build a warband with the units from that faction. With your warband, you go on missions, which are basically 'matches', where characters take turns doing actions (order is determined by stats n' stuff) and you need to eliminate all enemies; there are also some side-objectives. This game has the kind of combat where you left click twice to attack, yet it is one of the most complicated combat systems I've seen, you know? Chances and stats and stuff? And targeting stuff? Ye. But don't expect to just go from mission to mission, left clicking enemies in a strategic way, no no no. You gotta assign stats n' stuff. You gotta equip yo units with stuff. You gotta let yo bois heal. You gotta hire new bois. You gotta manage 'wyrdstones'. And even in combat you gotta manage like 4 different resources per character every turn, like, no matter what. Basically it's hardcore af is what I'm saying.  So ye. If you're up for a game that will take a while to get used to but then, like, you'll be used to it so you'll be like, liking it and stuff, and then you git gud n' stuff, and start understanding all the complicated stuff and... stuff... then ye. This is the 3D dark hardcore darkest dragon age dungeon board game for you.   TLDR; It's complicated af, so only buy it if you know what it's like and want to get invested into it. Like, real deep n' stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Jumped at the game as basically a noob at squad based tactical games like this. Either I am super luck extreme or the game is not as hard as advertised, I've only lost due to making idiotic choices. I'd recommend the game, it's a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, it will make you rage at times but its really well made and worth playing",
            "review_score": "1"
        },
        {
            "review_text": "I actually had no problems whatsoever from the performance side, except for one thing that kills this game completely for me and i don't see myself playing it any further. The waiting times while the AI moves drive me crazy. I started to Alt Tab out of the game because i was getting sick waiting. (i AM an impatient person). Waiting for hidden movement to be done while they loot, jump, and whatever the f*** they do is not fun.  I was looking forward to a hardcore game, everything looks great from what i've seen but the waiting, i can't take it, let me speed this up and i might reconsider it, huge design failure in my book. (Apartently technical difficulties)",
            "review_score": "-1"
        },
        {
            "review_text": "If u hate RNG and getting punished for your mistakes then this isnt the game for you, if on the other hand u like a challenge then this is defintly the game for you ;)",
            "review_score": "1"
        },
        {
            "review_text": "So offensively Old-School Warhammer that it's like coming home early from work and finding John Blanche in bed with your wife. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "From the intro video explaining the lore, to the twelve tutorials, to the 13 statistics displayed next to each unit in combat, this game is steeped with piles upon piles of information you as a player need to take in. For some, this may come naturally, but for others, such as myself, it is incredibly overwhelming and leads for feeling uncomfortable. My 'fight or flight' instincts kicked in constantly with my short time trying to learn this game, and soon enough, I finally gave in and ran away with my tail between my legs.  I like Shadowrun Dragonfall, so I can enjoy strategy, and I found the Warhammer setting intriguing when I played Warhammer Vermintide, so it's unfortunate that this game made me feel so overwhelmed and uncomfortable.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is bad to the bone.... If this is the game you're looking for. You like to play Diable on hardcore? This is your game. You play XCOM on Iron man? This is your game. It's hard and that's what makes it so good.  If you're the opposite of those things, suck a fart, jabroni. Go crush some more candy.",
            "review_score": "1"
        },
        {
            "review_text": "This game looked really promising and I was excited to play it. It look complicated but not too complicated. The tutorials were really helpful and gave me a strong sense of what to do. BUT then I was released on my own. And that's when the ♥♥♥♥ hit the fan. My first mission went well, but then I started having to pay for upkeep and for injuries. Which is fine, except you really don't make much money in this game. Not at first atleast. Your funds quicky run dry and you try to loot as much as you can in a mission but each character's carrying capacity is very low at first as well. You can return items back to your cart, but of course that's not easy to do if you are on the otherside of the map. Then the awesome GARBAGE ♥♥♥ supposed rolls of each characters' action start to happen. You notice quicky that the enemies 'rolls' are consistently higher than yours. You notice that it's nearly impossible to keep your soldiers healthy while also not suffering permanent injuries. Situations like your character suffered a blow to the head and now he/she has to roll a stupidity check every turn. If they fail to roll high enough they are completely useless for that turn. There are garbage situations like this that absolutely destroy anything exciting about this game. And I'm stating this as a person who's played D&amp;D for years and other games that use this dice rolling mechanic. Maybe I've had badluck for my 12 hours worth of experience. But that's more than enough to tell you, I'll be deleting this game off my hard drive. This is not a game for those of you who get frustrated easy or don't like to feel cheated while playing a video game. This is a thumbs down for me.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a terribly designed game, full stop.  I'm all for unfairness and steep learning curves in games, but not for games that outright CHEAT and have so many hidden/unknowable variables that basically negate any strategy except 'hope you get to gang up on them before they gang up on you'. Given that the enemy ALWAYS gets better iniative and equipment than you, that so rarely happens that building a viable warband at the start of a campaign is a fools hope, and hoping to carry through the campaign is beyond foolish.  If there was something that allowed you to even partially mitigate the extreme RNG with planning, skill or tactics, this could have been a fun game.",
            "review_score": "-1"
        },
        {
            "review_text": "Mordheim is missing the diversity, and it just aint good enough. The ai is really bad, aswell as the randomness in character progress is okey it also has some big faults..  If they fix this it will be okey",
            "review_score": "-1"
        },
        {
            "review_text": "If you like a hard unforgiving game that can end months playing a warband with 1 roll , This is the game for you. The warhammer setting is great and the gameplay very good. But be ready to lose everything , And more then once it will be completly out of your hands. And thats the huge problem with the game , A game that only have Ironman setting will never get a recommend from me when bugs can and will ruin everything you build.",
            "review_score": "-1"
        },
        {
            "review_text": "WARNING: This game is for die-hard fanboys only, as anyone else will be completely unable to overlook some GLARING issues.  1. HORRIBLE optimization. Seriously, this game struggles to support itself, and it's evident in everything from the initial menu to the extremely stupidly long loading screens. 2. Price Gouging. This is NOT a $40 game, and the units being sold individually is a horrific joke. 3. Gets real old, real fast. Once you've played this game, then you've played it. It doesn't have the replay value that you'd expect a title like this would. 4. No modding, no creativity. If it's not in the game, then you better not want it. And if it's COMING to the game, then expect to pay for it when it DOES come, which is a laughable, horrible way to treat customers who spend $40 on your unpolished product.  Buyers remorse, it's a real thing. Had this since it was pre-release, thinking, 'man, it can only get better!' But, the disappointment is strong with this title...",
            "review_score": "-1"
        },
        {
            "review_text": "  Mordheim: City of the Damned in a nut shell  Vampire leader vs Reik grunt  85% chance hit.... miss *Sigh*  Try again  82% chance hit.....miss * FUUUUUUU*  Zombie dude next  24% chance hit..... critical hit *¯\\_(ツ)_/¯*",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended for those suffering low blood pressure. After you miss a 10th attack in a row with 85% hit chance your blood pressure will be sky high!  Even better, you will get a short but energetic arm workout when you throw your laptop through the nearest window.  A++++ would have my spirit crushed again!",
            "review_score": "1"
        },
        {
            "review_text": "First off, the game system is more akin to Valkyria Chronicles, where you control individual units in real time in between turns. It's not so much XCom.  Second, reviews about brutal RNG and the pointlessness of advancement because AI always matches you are only partially correct. The game has a Roguelike Veteran system that levels up along with your warband. It will make contacts and get small bonuses, so that even as your Warbands scrub one after the other, the next one will start with better stocked shops and get other small bonuses.  Also, while the game will match stat point increases into your Warband pretty much point for point, it doesn't (seem to) take equipment into account. Well equipped soldiers can start to slowly start to seem more powerful than the competition.  Finally, missions come in Normal, Hard, and Brutal difficulty, and there are few enough deadlines that it's feasible to simply skip days when there aren't any 'easy' missions available.",
            "review_score": "1"
        },
        {
            "review_text": "Worth it even if you are not a hardcore warhammer fan. Permadeath... enough said. ",
            "review_score": "1"
        },
        {
            "review_text": "A+ game with moderate difficulty. the major defect is that you could not deploy you troop on the map and you take a long time to look for suitable position. plus some enemies could be stuck during battle",
            "review_score": "1"
        },
        {
            "review_text": "A good adaption of the board game, Where you take your men into this post apocoliptic city and get loot.Like Munchkin. But with more rat ogres. And death.",
            "review_score": "1"
        },
        {
            "review_text": "missed so many above 90% chances i had xcom flashbacks.",
            "review_score": "1"
        },
        {
            "review_text": "Yo this game is friggin dope",
            "review_score": "1"
        },
        {
            "review_text": "good game but pvp is dead   buy it only if you want play against mindless AI",
            "review_score": "-1"
        },
        {
            "review_text": "I would really like to give a thumb up. The game is rich, detailed, has a nice atmosphere, and the developpers are really committed.   But it's been developped as a console game, and as such, for gamepads. Which is horrible for a PC player. The camera view is third person, with very limited vision and no de-zooming. You can't click anywhere,you just have to move each character as if it were a real time action game. And given the complexity of the maps, you spend lot of time getting lost in building and looking for a way to navigate. There isn't even a mini map. You only have an informative (ie you can't give orders while on it) 'strategic' map, where you can hardly recognise what's been drawn vs the 3d elements you see while in game.  It's a complex turn based squad tactical game. It could have been similar to XCOM (it was released on PC and PS3) in it's controls and camera, I wasn't asking for a classical RTS isometric view. And really, who's gonna buy it on PS4 anyway given how niche and complex the game is ?",
            "review_score": "-1"
        },
        {
            "review_text": "  The singleplayer is far too much like multiplayer.  The focuses in not on fighting creatures from mordheim,you fight another warbands.Its like if in XCOM,instead of fighting aliens,you fought only EXALT.  The gameplay is not very good.I assume it grows more fun in later stages of the game,but in the early phases,the early classes are boring  Also there is no reason for having to wait for the CPU to do its turn in real time when their troops arent visible.  Also,you need to pay the Sisters as if they are mercenaries,and i assume that applies to the chaos acolytes as well,which is just ridiculous.",
            "review_score": "-1"
        },
        {
            "review_text": "Great, hardcore and grim TBS 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I really want to like this game it ticks so many boxes, but the camera/navigation around the map is crazy and it's less about tactics and more about rushing in and praying your hits land. Even on sale -33% i don't think it's worth the cash with much better games out there! Hopefully after a few more patches this game will get some much needed improvements.  Overall not a bad game, but not a good one either!",
            "review_score": "-1"
        },
        {
            "review_text": "This game's concept is good, and the gameplay is mostly solid. However, luck plays too much of a factor in winning or losing so badly you have to restart the game. I want to play and enjoy this game, but when the game randomy decides to kick in your teeth before you even have your warband together, something is wrong.",
            "review_score": "-1"
        },
        {
            "review_text": "Bugs make this game unplayable with certain Radeon graphic chips. They are still present 2nd of March 2016. Devs are absent on their forums and refuse to give a refund. Steam also does not view the game being unplayable as a reason for refund.  This game is only any good in multiplayer, but the mp-mode is so poorly made you'll need to organize through game-groups off game. They aren't very hard to find, but it's a real hazzle.  Beyond these couple of game-killers M:CotD is ok.",
            "review_score": "-1"
        },
        {
            "review_text": "The other useful reviews already pretty much spell out the pros and cons.  The AI is still a dufus, getting stuck on wagons and such. That said, if you are picking hard/brutal missions it's still a challenge, you've got to be smart about how you deploy and build your characters.  I had a lot of fun for the 70 hours or so I put into it, managing my roster, figuring out what I might want on each mission, but in the end, all the missions mostly boiled down to the same thing: cluster up and kill the AI that's come hunting for you. The maps have good variety, but the game play itself starts to feel the same every time. It really needs some XCOM style mission variety.  The auto-scaling of the enemy force is a mixed blessing. It ensures a challenge, but it adds to the sameness of each battle.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game which I MIGHT recommend to a friend. Why would I hesitate to recommend a great game? because as it is the early user experience is downright painful.  The glaring weak point of mordheim, at this stage, is that the interface gives you almost no assistance at all. The early expereince can be confusing, annoying and frustrating. That is because the game takes place on some pretty intricate tactical maps, and there are often multiple significant strategicly important points on that map, but the interface gives you absolutely no help in orienting yourself or having any bearings on where things are. Picture a jumbled table top game, but you don't get to stand over the table and view it. You have to look through one of those surgeon scopes which is laying flat on the table somewhere.  When you combine that with a 3rd person view that is fixed on your various squad members during your turn, you end up with a claustrophobic and confusing perspective. The only chance in hell you have is in orienting yourself according to the only two indicators that appear on that map, a blue and red light over you and your opponents effective base.   The only other complaint I have, and it is a pretty big one, is that some maps don't allow you to choose your own deployment. Pick the wrong mission, where your warband starts out 'scattered' and you will find yourself watching your squad members die in a position you didn't even choose, surrounded by multiple enemies and killed before they even get one turn in.  Seriously, it is bad enough to drive away many players. And that is a real shame, because this is actually an awesome game.   Even at this early stage it is very enjoyable and playable. The 'hardcore' tactical combat feel is very good. It feels alot like you are playing the board game once you learn some tricks to orient yourself on the map despite the terrible interface. The unit types are balanced, the skill and combat system seem quite solid, and the flow of the game is pretty good overall, despite having to wait a bit when it is the AI's turn.   The campaign and warband management are also quite good already. Once you get into it, you feel like you are really conducting a campaign with your ragged band of cut throats, who can each level up, improve stats/gear and learn skills, get maimed and die individually. One of my skaven grunts lost an arm, and has been carrying on with his stump through several missions now.  So overall I am giving this game a thumbs up, because it is a gamer's game and it deserves it. I do hope they will add something to the interface to prevent 50%+ of new players from quitting in frustration before they get a chance to appreciate the jewels of this game. I really shouldn't have to rely on switching between possible positions during deployment, just to see the shifting perspective so I can have a chance in hell of understanding the general layout of the map I'm playing on, especially when the game is so punishing of anything less than cohesive and close deployment. You will love this game if you love hardcore tactical games.",
            "review_score": "1"
        },
        {
            "review_text": "Very much the same feel as the board version. I love the fact that it's so brutal. The death of a prized hero is nothing to be scoffed at!",
            "review_score": "1"
        },
        {
            "review_text": "Warning first, detailed explanations after. (negative review is because this game is for 'hardcorez only' so 'normal people' should save their money). But it is a game with some very good aspects.  Also, FYI this is a RNG ♥♥♥♥♥♥♥t game (this is not bad design is just a type of game so you are warned if you are the kind that rages at missing a 98% hit chance).  Discloser: look at my played hours, look at my XCOM1/2, Darkest Dungeon, etc. hours, this is not a rage review. I like difficulty when well designed.  The bad:  . Game has really bad AI. Devs compensate by giving enemy over the top bonuses and say 'game is meant to be hard'. No, hard games are achieved by good AI not ♥♥♥♥♥♥♥t bonus/penalties. . AI units always zerg you as soon as they spot you. Even if going for a strategic objective would win them the game. This is why the game is playable at all. Because 'the hardcorez' have figured out they can just lure the enemy in one-by-one and beat it. A game that requires 3 of your units and exploits to beat 1 of theirs is still bad design to me. . There are 'elite' units in the game that can wipe your entire group single-handed but you can bugg them out (stuck on doors,etc.), or cheese (see point above). Again this is bad design when the way to beat the game is to exploit and not by gameplay mechanics. (also your elite units cant do the same back) . Equipment progression is also RNG based, both items and enchantments (why?!!!). You can choose how you level up the skills and abilities of your units but you have to pray to the dice gods to land that sweet 2H sword (which may never happen in extreme situations). Why not have a research or tiered buy system... . Devs have the 'my vision matters more than making a good consumer product' ♥♥♥♥ attitude. Game only has Ironman. No need to explain why this is bad in RNG games, 40 hours of gameplay gone on some bad rolls, or worse due to a bug which this game has quite a few (lost an entire party due to a dmg curse that should last one turn but was bugged so it just kept going until everyone was dead). It is a single player game! I will never understand why would you screw over a player by not letting them enjoy the game their way, when they play it alone and only for themselves! Devs even went as far as too code in anti-cheat measures! So if you back up your save file the game wipes it out! . Game difficulty levels are built in the missions. So you cant choose your difficulty at start of game, instead you can take on easy or harder missions. This is bad because the only thing it does is punish players for no reason. If you only take easy missions you have to grind a lot! That means your playtime has now been doubled or trippled for no reason! Instead they could have difficulty modes and let players still enjoy the story of the game for the same amount of hours/effort and let them choose how hard it should be. . The devs 'dumb vision' IMO turned this game from being another wide audience tactical game (like XCOM) into a niche 'hardcorez only' game. I guess they dont do it for the money... (worse is the amount of players that buy it and feel screwed over bought/played ratio is abismal)   The good; . Amazing concept. Tactical game where you control your units in 3rd person. It is brilliant and really immersive. . Good, clean, and functional UI and controls. . Amazing art, graphics, and maps. The atmosphere of the battle games is perfect. . Great music which you get for free in MP3. . Great setting. It is Warhammer after all. But GW IPs have been butchered so many times that this game deserves praise for doing justice to what is one of GWs best stand-alone products.  Final word: buy this game only if you are ok with RNG, ironman, and having a steeper learning curve (reading guides from players will speed it up considerably). No matter how good looking and fun it can be, you will ragequit if you are not ok with the above.",
            "review_score": "-1"
        },
        {
            "review_text": "I am a massive Warhammer nerd. its the treasured, beloved mythos of my childhood.  and so it pains me to see this isnt a very good video game.  you create a warband and lead it through randomly generated missions. theres no story or other game modes. just this.  it doesnt look very good. old, is what I can best describe it at. functional. competent. but old. visuals animation, sound design - nothings really top noth, but its all decent.  what the game is good at is complexity. both the combat and the warband advancement is veeery complex and there is a lot of satisfying equipment and stat tinkering to be done.   BUT. this game did the same thing Vermintide did. they both transitioned from a very promising beta into FULL RELEASE, without actually polishing the game. its SO CLUNKY. the interface sucks ♥♥♥, nothing ever transitions smoothly, the tutorial isnt adequate, combat doesnt feel weighty and (maybe true to tabletop form) very random.  this isnt fun to play. which I hate to say.",
            "review_score": "-1"
        },
        {
            "review_text": "Its hard to recomend this game due to all the technical glitches. when you are actualy able to get a game going the game play mechanics are great and the art style is fantastic and true to its source material.  The problem is that loading a game will often result in the game crashing, and even when you do get in from time to time your characters will seeminly teloport to the other side of the map, for a game wiht 'all alone checks' this is not a good thing. I have played around for hours trying to get this game to run smoothly and have tryed countless 'fixes' problem still persists. I have never gone through so much hassel to get a game running smoothly before (and never failed either).  I'll come back in a few months hopefully the game will be fixded. shame on the evelopers for letting a game be released with this many problems (&amp; for releasing new paid for DLC before addressing these issues).",
            "review_score": "-1"
        },
        {
            "review_text": "Installed got bored of the terrible dodge sistem unistalled XD",
            "review_score": "-1"
        },
        {
            "review_text": "My initial review of the game was not good because of several key things I though Skaven were lacking in. I still hold the opinion that in single player the balance needs to be reworked so that Skaven can get numbers. They are sufficently weak to warrant that advantage. They suffer against some of the enemy warbands due to a lack of ability to take damage and inflict it and the fact that the AI always has equal numbers and equal troop types if not downright superior troops due to skills, spells, and gear makes the Skaven much weaker in general. I haven't seen any advantage to them being quicker really except by grabbing wyrdstone. You still have to win the fight.   I am pleased there is a map and apparently I wasn't paying attention so +1 there. It made a huge difference in the success of my missions.   I hate that I can only give a yes or no review simply because I am on the fence about this game to a large degree. Once I get to MP I'll have to circle back around and add to this review.",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth it. As your gang gets stronger funny things happen to the law of probabilities. 80% to hit - you might make 50% of the time. Just had a battle one of them 75% to hit my guys avarage 50% dodge or parry. Hit 3 out of 3 twice with criticals. This happens time and time again. Fed up with it now. Basically the game cheats to make it harder. But it is not possible to plan. In short the game is clever but they arn't . IF they are that desperate they should pay me. Will not buy from this developer again waste of my time and money.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a chore to play.",
            "review_score": "-1"
        },
        {
            "review_text": "First of all the loading times in this game are appalling. That combined with how long the AI needs do do things in combat is infuriating.  Under that lies a fun game somewhere but it just get more and more frustrating to play after the first hours when it's all new.  This games needs more work, if it get's it it's going to be great!",
            "review_score": "-1"
        },
        {
            "review_text": "-RNG will get you killed, or cause you to fail Quests and Bonus Objectives. -Interface is a mess. You will dread having to buy new equipment for your warband. -If a character gets defeated in battle, you're ruined. Maybe. Or maybe not. The game uses random chance for that too. Maybe they come back okay. Maybe they need treatment. Maybe they die from their injuries. Who knows? -This is the worst tabletop-to-video game transition since the buggy mess that was Vampire The Masquerade: Bloodlines. And much like that game, this one doesn't feel like the developer actually finished it before release. -Tutorials are helpful but do not inform you of the game's dependence on random numbers.  I don't have much play time and I'll probably try it again at some point, but this game is a 5/10 for me. It feels like a budget Valkyria Chronicles with artificial challenge brought to you by randomization, hidden under the intriguing appearance of a medieval apocalypse. ",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game to bits and hope they realease more dlc as i will buy it asap",
            "review_score": "1"
        },
        {
            "review_text": "This is a completely worthless and CRAPPY game. DON’T BUY IT ",
            "review_score": "-1"
        },
        {
            "review_text": "Poor performance. Loading time is horribly too long.",
            "review_score": "-1"
        },
        {
            "review_text": "Imagine X-Com set in Mordheim. How great does that sound? Pretty damn great.  Unfortunately, we'll just have to keep imagining.  ",
            "review_score": "-1"
        },
        {
            "review_text": "STEER CLEAR PEOPLE!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "don't buy this game! worst game....",
            "review_score": "-1"
        },
        {
            "review_text": "The game is just so slow, that I can't recommend it. It has a lot going for it, but walls of text and enemy turn I can watch videos during ruin the experience. Couple that with the fact character progress is slow, and you have a true snail's-pace game.",
            "review_score": "-1"
        },
        {
            "review_text": "--you may want to skip the waffle-- I purchased this game a while back while it was still in development. I have always been a big fan of Games Workshop IP, and have loved specialist games like Mordheim. As you can imagine I was very willing to assist with development by purchasing the game before its release.  So I booted up the game and found quite a few issues. The loading times are incredibly long, the text on screen is almost impossible to read (i changed the resolution multiple times to no avail) and the game was painfuly slow once it had loaded. I put this all down to teething issues and felt happy to pop the game on the back burner and wait for the full release.  --this part is the jist of this review-- I have loaded this game up several times since release and each time it has crashed during the loading screen for campaign. So I'll review what I can see. The font is incredibly small on tutrial pop ups as well as briefing screens, to the point I cannot read most of it. As mentioned before I tweeked my resolution to attempt to fix the problem to no avail. Annoyingly that's all I can review as for some reason the game will not run.  I am very annoyed that I made this purchase, and I am heartbroken the game dosen't work.",
            "review_score": "-1"
        },
        {
            "review_text": "  I tried the game during a free weekend. I'm not a casual gamer, i started playing turn-based games since the very first X-Com in 1993 and tried most of the famous titles. Never thought i'd write a negative review on such a game, but i seriuosly can't recommend it to most of the people. The game is hard, and it's achieved not by some tactical advanatages or clever AI, but through crazy random. 80% chance to hit? You'll miss. Twice. 73% chance to climb? You'll fall. Twice. The game is an offence to the theory of probability itself. That's not to mention quite complicated controls, uninformative map, lack of normal grid, being unable to save at least once during the mission and several other issues that make the game uncomfortable to play. The devs tried to reinvent a bicycle, and in my opinion they failed. And all the nice features, like interesting tactical moves, character customization and progress and warband management are killed by the rest of the negative things. Some people might find the game interesting, and i even might buy it myself, if there will be at least 80% discount on a bundle with all the DLCs, but until then - not recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "&gt;81% chance to hit &gt;misses 3 times in a row &gt;enemy has 25% chance to dodge &gt;succeeds every time 10/10 would fail stat class again",
            "review_score": "-1"
        },
        {
            "review_text": "Just a badly design game. Totally unfogiving save system. Don't bother with it. Better games to spend your time and money on.",
            "review_score": "-1"
        },
        {
            "review_text": "Overpriced garbage. -Horrible camera angles. -Going though all actions is horribly slow and destroy any rythme the game might had. -Artificial difficulty to its finest.( YOU ARE gonna miss 2/3 actions with 90% sucess rates) - 0 learning curv, it's just being good at RNG I guess. -Poor looks overall. ",
            "review_score": "-1"
        },
        {
            "review_text": "  Am I really playing a 2015 game ? Sound like a PS1 game with the UI.",
            "review_score": "-1"
        },
        {
            "review_text": "  Horribad loot system. No thank you.",
            "review_score": "-1"
        },
        {
            "review_text": "very laggy . impossible to play",
            "review_score": "-1"
        },
        {
            "review_text": "  Horrible. I was put off within the first couple of minutes. [KKArkady] is an emo little ♥♥♥♥♥. :)",
            "review_score": "-1"
        },
        {
            "review_text": "If you like turn based strategy games at all you should definatly try this one. Some people did not like this game because they said it was 'too hard', it was a challenge for at times but the game had me hooked and I had fun the whole time.",
            "review_score": "1"
        },
        {
            "review_text": "plays just like the table top game, level up your war band and enjoy. Most bugs have been fixed since early access, really enjoy this now. Just wish the war bands would be a bit more customizable.",
            "review_score": "1"
        },
        {
            "review_text": "I have loved this game since it first came out in 1999 as a tabletop game. This incarnation I both love and hate, but it is extremely addictive.  I feel like i'm there, I care about my warbands, I love the models, voices, sounds, missions, campaign. I pretty much would give this game a 10/10 if it was not for one thing.  Rng.  Yes Rng is Rng, but this game, wow. Now you can see all the modifiers to your rolls and all I can say is, if they reversed the rolls to high being good and low bad, I would be an unstoppable force of nature, a God.   I've recorded the stats on over 30 games and the results just leave me shaking my head. I roll high 90's a lot, and I mean I could put real life money betting on them and make a comfortable living out of my winnings. Don't even get me started on just how often I fail something by 1 measly point, and I look at every roll the game makes.   Wonderful game but the Rng, imho, is stacked and brutal. I still recommend Mordheim though, as much as I quite often want to put my fist through my screen lol.",
            "review_score": "1"
        },
        {
            "review_text": "I don't tend to leave reviews, but there seem to be so many negative ones for Mordheim I felt I should post one...  The game relies heavily on RNG - which is fine by me. Don't be fooled by people complaining about it; it may be unlikely that you'll fail lots of 95% actions in a row, but it's NOT IMPOSSIBLE - so it CAN happen, it doesn't mean the game is broken. You don't see anyone moaning that they are making 30% chance attacks all the time. The RNG works just fine.  It's a hard game too - you can exploit the AI, and it's easier once you have a few games and experience under your belt, but if you don't want or enjoy tough, unforgiving games, this isn't the game for you.  It's very unforgiving of mistakes and there are negative points - animations are very similar, there are only 4 warbands, the AI is dumb as a post and (like a lot of games, tbh) the information you'll get from the community makes up for the lack of documentation/obtuse menus.  Read the community guides for beginners, don't expect your first warband to do very well (or rather, expect later ones to be better built) and stack the odds in your favour (esp. when picking missions in the beginning) - and if you lose warriors to injuries, death, and amputations, well, that's part of the 'fun' (see Dwarf Fortress).  But overall, guiding a warband through the ups and downs of Mordheim is hard, rewarding and unpredictable - just like the boardgame, so, fine by me.  Will be nice to see more warbands and variety, but I personally think this game is a lot of fun, and recommend it to anyone wanting a challenge in the old Warhammer setting.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game and awesome custom squads with permadeath and injuries. Choices matter in the game big time and there are no re-dos. Best gripe is that the percentages are blantantly off in campaign fights as fighters end up missing four attacks in a row with more than 75% hit chance. It gets frusterating with devestating conquences to an already brutal system, and it can easily lead to some yelling 'Bull ♥♥♥♥' at your screen as you lose a fight because you are basing your strategy around actually being able to hit enemies when the game says you will. However, the gameplay is RNG based so you will also have lucky times when enemies miss a near death character 5 or 6 times in a row, allowing you to rescue them.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy squad scale turn based combat with substantial depth and high stakes rpg elements, this is the game for you!  most of the people voting this game down were simply too stupid to understand the strategy, or too attached to the mordheim source material. the game system is not related to the original mordheim system, they only used the original game for setting.",
            "review_score": "1"
        },
        {
            "review_text": "It's not a game for everybody, but it is a game for me.   If you enjoy games where one small decision could ruin your whole life forever this is the game for you.   'The game also requires you to be very tactical. If you just continue to press the same button like the x x x, and the y y y, and the x x x, and the y y y, again, you will be sucked.' -Tak Fujii",
            "review_score": "1"
        },
        {
            "review_text": "I've played this far too much, and I've not even touched half of the warbands available.  Challenging, very enjoyable when you pull off a win by the skin of your teeth.  Would recommend if you've got time to burn, like strategy and would prefer to persevere when you lose rather than reload (no quicksave here, you mess up you've just gotta live with it!).",
            "review_score": "1"
        },
        {
            "review_text": "A must play game for fans of the warhammer games. Beside who could resist playing as a Skaven warband they are just too cute! What other game can you spend hours lovingly leveling a character just the way you want him only for him to be mamed so bad you let him die rather than pay to treat his wounds. A truely brutal game where one mistake may cost you a cherished character.",
            "review_score": "1"
        },
        {
            "review_text": "the game should patch the hit chances to be higher, because 95% isn't enough.",
            "review_score": "1"
        },
        {
            "review_text": "This game will teach you how 90% chance to hit can miss four times. while you get slaughtered with your 85% chance to dodge. It's very unforgiving.",
            "review_score": "1"
        },
        {
            "review_text": "Alright, so after having a negitive review on this game for what feels like forever, I'm going to go ahead and recommend it. I've played it for just over 900 hours and i honestly hate it nearly as much as i love it, but ultimately it is the best at what it does and that's worth something.   Yes, the RNG is cruel. Yes, the AI cheats by knowing ahead of time where your people are and which are the weakest. Even with flaws like that, it's still solid(if you can keep your rage down which is hard).   Looking forward to the future of this game, hopefully we'll see lots of new content in the future   **********UPDATE*********** 11/24/16    I loved this game, I thought it was amazing. I worked my ♥♥♥ off at it and as of now I have 81 hours logged and that's just on this last content patch. So that's why it bugs me so much to have to change this review. This game is crap now, it's seriously horrible.   I have so many complaints it's hard to even find a place to start.   The mission design is terrible. There's next to no explanation of what you're supposed to do and 'learning' during the mission doesn't work because there are permanent consequences to every minor mistake.   the AI is buffed to an insane degree. There's little to no consistently to the mission lay out. I've played 'normal' maps that the enemies rating was 60% higher than mine(1200/1900) and brutal maps where I'm actually above them. you have NO idea what rating the enemy will be before the mission is selected.   The debilitating buffs are frustratingly permanent and the AI suffers NONE of them, which further disadvantages the player.  The store is a joke, you can't buy anything worth anything there and the missions don't lend themselves to exploration, you're too concerned about trying to recover from the horrible placement the dev's decided would work for you this map(and the joke of a 'manual' deployment system is F awful, it's like your goal is to make the game less fun to play).   The magic, it's all so bad. Even the good spells are hardly worth it. There's ONE leader unit type(way to add diversity guys) and more often than not it's a caster so just expect your leader to hang out and attack infrequently.   Holy F your percentages are off. I tallied up a game with my leaders attacks. On average he has about an 80% to hit at lv 6. After 5 seperate missions he hit around 43 % out of 25 attacks. That's not even remotely close. I'm not talking about the enemy 'dodging' or 'parrying' attacks, just normal attacks that missed. Your dodge and parry mechanic are similarly broken. The entire % based system needs an overhaul and honestly at this point I'm thinking the devs should have just stuck to the d6 system if you were going to mess it up this badly.   congratulations on continuing to make bad Gamesworkshop games, it's a long history with a few success stories snuck in there every so often and I really appreciate your continuing it.  ***********UPDATE*********** 10/20/15   I really enjoy this game so far. I find there to be so few tactical RPG's like this that have anywhere near this games quality and it's only in its earliest presentation. While I'm hopeful that races like Undead are added so far this game is already amazing and I really look forward to where it ends up in its final form.",
            "review_score": "1"
        },
        {
            "review_text": "I once again rec this game. Reasons? Simple. Read all the other great reviews. The Devs listen for the most part and do what needs to be done to make this a great game.",
            "review_score": "1"
        },
        {
            "review_text": "simply great",
            "review_score": "1"
        },
        {
            "review_text": "Definitely reminiscent of my experiences with the tabletop game. No matter what I do I'm screwed, all that matters is holding on for as long as possible.",
            "review_score": "1"
        },
        {
            "review_text": "I was hesitant at first to buy this game. The clan or factions they presented looked sub-par as to what I had hoped for from the Warhammer Universe. Also the game looked less then polished... But when the priced dropped to 20$ for their promo week, I decided what the hell.  So far as I have played, I have absolutely loved the game. I am building a nest of Skaven assassin rats; 'Red Fangs.' The game has some interesting mechanics as to how the fights go down that take some time getting used to. The game is difficult, and I like that. It makes the City of Mordheim a dangerous place to be. You have to be careful and thoughtful about your moves and engagements.  I think there is some programming stuff that needs to be fixed, like the (climbing, scavenging, treasure,) nodes that you cannot access if another of your teamates is standing on them. But besides that, I have had no issues with the game.   My favorite part about the game is that every unit you have counts. They start making a history of their service to you. They carry wounds that disable them, ailments that hobble certain abilities and so forth. Every fight therefore has a bit more hanging on your outcome of victory or defeat. I think thats what makes it a bit more immersive. For example; one of my rats name Stab Greymein was squashed bad in a fight with an Ogre Merc (actually a lot of my rats were, we got our asses handed to us that day). He was so badly damaged that he lost an eye permanently. And there was a actual missing eye and scarring on my rat. I couldn't help myself. All the other rats started calling him One-eye, and thus he was renamed... I love this game.  Pick it up, buy it, you won't be disappointed.   P.S Rogue Factor; I am waiting for the dwarven faction to come into play, DLC me when you can. Thank you!  ",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed this game, even the frustration of RNG combat, but hey it's random. Liked leveling my warband, but I won't be continuing to play the game. I've edited this review to a positive because I loved this game (and reading other reviews no-one else seems to have hit the same problem) but below is a cautionary tale that hopefully won't apply to anyone else: My system is more than capable of running this (i3 3.2ghz, GTX750Ti, 16GB ram) but I've experienced 3 crashes (black screen then back to windows with fatal crash of game). Every time I end up with a 'saved' game in prgress that loads back in to an incomplete UI and unable to advance the mission. This results in having to forfit, meaning loads of injruies to my warband leaving me stumped 3/4 missions in every time. I'd love to recommend/buy this game, but I just can't with this stability issue (my of course just be my system, but I've not had any crashes with other games)",
            "review_score": "1"
        },
        {
            "review_text": "Recommended for fans of tactics/strategy games, especially those who seek an experience more along the lines of tabletop wargames, and/or those accustomed to unforgiving classics like UFO Defense. Not for the faint of heart; you have to work with or around the balance issues (there are quite a few, I admit). Clunkiness aside, I'm more than happy with the game. The atmosphere is stellar, the difficulty is manageable, and the battles are intense.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very good turn-based squad combat game. I've played WHFB but almost no warband variants and I think this game is lots of fun. Here's the ever-popular list:  Pros:  The implementation of the warbands and their flavor is great. Sisters' hammers, Van Helsing Witch hunters, Cultist demons and mutations, and especially the Skaven.  The use of rings on the ground to show movement limits is great.  Includes and handles all the situational stuff that was tedious in tabletop, like Stunned, Stupidity, Divine Wrath, and traps.  Customization of your warband--some variants but mostly color. Switch in weapons and armor, etc. and it's filtered for what your unit type can use.  Injuries are implemented well--I have my one-armed, one-legged Flagellant to level 6 and he's still going!  Campaign mode is fun and flavorful.  Skirmish mode is a cool MP mode--especially like the Invite a Friend mode and you can have 'friendly' (no permanent effects mode) . No saves--This is not the city of the Happy Unicorns, your band will lose limbs, loot and lives! I think it adds a good grim and gritty feel, and all you get is taken from the slain in one way or another.  All-around fun game, and I don't have any nostalgia factor of the tabletop going on.  Cons:  The game is harder earlier than later, so if your scouts don't find you enough normal missions, it can be brutal.  It is a bummer when you are in the position of not wanting to finish off the foe's leader because you are close to getting the optional goal done, or because you need to get to that wyrdstone cluster but your guy is slow. Win the fight and then morale check fail and it's over, so no love. On this point, I am fine with not getting to loot the city because I won, but just that it's a slight letdown in that one case, but hey, part of the challenge.   The Story Missions, esp. early, are brutal. Wait until you are way over the rating then ok. Not much of a gripe, just something that hurts to learn by doing when no saves, etc. RNG is frustrating, but that is what RNG is. Not a complaint, just saying that it is present and a factor (I always seem to roll 97 when all I have to do to hit is 95 or less)  Stuff that can be frustrating is within game theme, nothing I have seen is truly infuriating. On a scale between 'meh' and 'OMGZ RAGEQUIT!!' I would say this game is 'A Mild Vexing' usually, and that is all RNG. It can get to 'Swearing Loudly at the Screen' when your guy never hits or parries, but again, RNG.  Overall, if you like the setting, this game has been faithfully well-made. If you are good with squad combat and turn-based moves then you will like the mechanics. I like this game, and have been playing it since EA through now. I think the devs have put their hearts into this and they seem to be involved and care. Bugs are few and are responded to.    ",
            "review_score": "1"
        },
        {
            "review_text": "Having a lot of fun with this game. It is difficult and doesnt hold your hand; if you like easy, mindless games than you probobly won't like Mordheim. The challenge makes it more rewarding when you finally win, however. The witchhunter dlc is good but the other dlc I rarely use.",
            "review_score": "1"
        },
        {
            "review_text": "I've given this a reasonble play over the last few days (about 10 hours) and I have to say its actually a pretty bad game. Many of the scenarios are very broken (like spawning one of my dudes next to three enemies all who attacked first killing my dude before I'd even taken a move!). That's pretty shoddy game design. Everything is pretty under-whelming as well. Like the skills and stuff you can learn really aren't that exciting or spetacular. Its hard to get excited by a 5% bonus to something. In its current form its not a game I'm going to play anymore of. I love the old school Warhammer IP and in theory this game should be awesome but in practice its a bit of a dud. Honestly I'm not recommending this to anyone, even GW/WHFB fans (which I am myself).",
            "review_score": "-1"
        },
        {
            "review_text": "Could this be the most unfair game ever I dont know Could this be the hardest game ever maybe but what I can tell you mordhiem is certainly one of the most frustrating futile games your ever likely to play this game smacks you and smacks you again even if you dont make any mistakes.  One thing the Mordhiem wants you to remember is everyone is diposable your leader your heros your henchmen everyone and dont forget it.  You can put days and days worth of hard grinding into your warbands carefully selecting skills and weapons only to have your ar** handed to you the very next mission with all your best fighters dead or missing limbs with not a penny to show for it Not a game for the newb but if you like a real challenge mordhiem could be what your looking for.   I think the DEVs could have done a few things better with mordhiem it starts out to hard for the novice players with very little funding to kik things off I feel this will turn a lot of novice players off.   Mordhiem does not really get any easier until you do a lot of leveling up and good luck keeping your warband alive till then.   Dont get me wrong guys I really love playing Mordhiem and would love to give it a good review But I am constantly frustrated with the mechanics of the game and left wondering if the DEVs even played the game with all its little glitches it really looks like it had minimal funding and was pushed out to the pubic asap and thats somewhat dissapointing but its not all doom and gloom.  The game is slowly getting better and a bit more playable as new patches are released but six more months in development could really have done wonders for the game.   Four factions are not really enough to keep this game interesting for to long so I hope the devs are working on a few more factions perhaps Orks and goblins or Dwarves would be good and set in sylvania why no vampire counts yet hopefully they will be coming soon  On the plus side the game is resonably priced and some fun can be had if your very very careful or very lucky.   Cheers",
            "review_score": "-1"
        },
        {
            "review_text": "Let me start off by saying this is my first review.  This is an exceptional tactical game with some strategic aspects. I would offer, in my opinion, that this is one of the best tactical games I've seen (and I've been playing them for some 10 to 20 years...). The strategic aspects revolve around planning your warband's skills and attributes to meet your playstyle needs, assuming you can keep your members alive that is..  I love the campaign aspect of the game. I would like a story that pulls me in a little deeper but that being said I am still really enjoying the game.  I believe the to hit percentages are off. I'm not sure the random logic/table that is used but after many games I'm finding the to-hit percentages really don't accurately reflect the chance to hit. I will try to measure this more meticulously and possibly update this review in the future, but would like to see the game designers run some analysis on how accurate their numbers are.  In Summary this is an exceptional game. If you've been looking at it thinking 'maybe', I'm confident you won't be disappointed.  Note: I have not played any multi-player yet.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice port of the table top game although you can´t really compare them. In the table top you just have to sacrifice henchmen to slow the enemy down or to win a scenario. That is not the case with the PC- game. It is always better to keep your band close together for support. And I definitely am missing some very fun-to-play warbands like the Undead, orcs, dwarfes and bretonians. Nevertheless, I can recommend the game not only for warhammer/ mordheim fans.",
            "review_score": "1"
        },
        {
            "review_text": "TL/DR Dont not buy this broken pile of.... Worst RNG ever produced in the 35 years I have played  Stats after 80+ hours Comp have not failed any alone tests at all! =) I have failed 100%   Comp hit 95% I dodge 1/3 as best with 80% dodge and three atempts I hit about 50%  Comp dodge my hits 73% of the time   AI is really bad too. Exampel:  Enemy stands in ambush stance. Runs over the road climb a wall then jumps down same wall go back to start and ambush stance again at rthe same time I stand in melee right beside where he stands and fight his teammate.  Devs dont know how to make a even ok AI so instead they break the RNG  to try and cover the absent of know how:   RNG is a big joke so you should like beeing frustrated a lot.    Also I like the permadeath and dmg and that the game is hard but with all bad coding its just not so fun to play.  Clunky anhimations and the same animation over and over and over.  Lots of graphical bugs.  Now all of a sudden my hecnhman decided that no I dont gonna take the sword and shield into battle I gop for a dagger and dont care what you want... Moar bugs  Cant handle latest graphic drivers from AMD and says its AMDs fault and I be like 'Hmmmm but all my other games work so sure blame AMD....'  Rude to players that say all other games work but yours then the DEV says he know better becasue he heard other games have problems so of course he knows best.  Good that they say the listen but sad they dont have the skills.  I am sorry for backing this game so you can be fooled into it. Of course also the release more broken things for even more money.  If they managed to fix the RNG and make a decent AI I think it would be a good game: I think its good AI have stronger teams if not for the broken RNG.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is fun and challenging.   My only major gripe is no UI mapping manual to explain what some of the icons mean. It feels like I have to stumble my way through the game and hope to figure it out. The learning curve is pretty high. It is not a download and play right away game.  Still enjoying it though.",
            "review_score": "1"
        },
        {
            "review_text": "Mordheim is a very rewarding game but with a very steap learnig curve. You will lose and badly at the beginning if you don't understand the game and all the mechanics of the game(I had to restart warbands five times when I was new). Once you get past the learning curve however the game is incredibly fun. Mordiem is like a 3D version of Darkest Dungeon, only more brutal and punishing. Mordheim is a game of wit, where you need to out maneuver your opponent, with sometimes brutal consequences if you can't.   Because of the unforgiving nature of this game you will grow attactched to your individual soldiers. As they level and become more powerful, they start to feel like old friends. However one bad decision, or poor planning on your part can get them maimed or even killed. While it can be disheartening when one of your most dependable and strongest soldiers get crippled or maimed, it is also what makes the game so riveting. When one of you guys survives an ambush by the skin of his teeth it can be a real thrill.",
            "review_score": "1"
        },
        {
            "review_text": "Tickels the right Mordheim itch when no one around wanna play the table top version :)",
            "review_score": "1"
        },
        {
            "review_text": "Old Review  EARLY ACCESS REVIEW:  Firstly, if you've played the Mordheim tabletop game, THIS IS NOT IT, it merely takes the themes, aesthetics and mindset. It's a solid tactical turn-based strategy game with an emphasis on unit cohesion. I've played as all of the factions with the exception of Sigmar, which is next and I think you'll be happy with the variety. Though Chaos seems underpowered in terms of ranged combat and Mercenaries overpowered in the same area, it is still in beta and final balance tweaks are happening constantly.   You'll also find a good variety of players when you take it online, from people like me, who tend to stick to the rooftops and use ambush tactics, to brawny, frontline players who smash everything they see, to entire units of snipers. All are effective given circumstance. The magic targetting needs a little work and the Skaven need more ranged options, but otherwise the game is incredible, especially considering the phase its at.  As a former Mordheim (coreheim) player, and a fan of this style of dark fantasy, as well as a tactical strategy fan, I'm going to give this game a 9/10 potential with a current score of 7.5/10 because of interface issues and the above complaints.  New Review:  Just reinstalled it after a while of not playing...good job me. Bought all the DLC and went to town, oh my god has this game improved, play it.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. turn based combat. cool looking areas to fight in. matches can take time to complete if you search for items on the ground. just be prepared to die and do alot of killing....what more could we ask for?!?!? oh yeah more killing.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Should have saves but still damn good!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Trashy Dungeons And Dragons Neato",
            "review_score": "1"
        },
        {
            "review_text": "Hard and fun. Feels like Mordheim even though it doesn't quite play like the tabletop game.",
            "review_score": "1"
        }
    ]
}