{
    "app_id": 277490,
    "name": "Battle Group 2",
    "release_date": "2014-06-13",
    "developer": [
        "Bane Games"
    ],
    "publisher": [
        "Merge Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "achievements": 34,
    "positive_ratings": 352,
    "negative_ratings": 70,
    "price": 5.59,
    "description": "Your battleships are fully loaded with the return of Battle Group. Command the war against advanced pirates with brand new Satellite Strikes and upgrades for your state-of-the-art battleships. As the commanding gunner of this advanced armada, it's imperative you stop a terrifying new foe our world has yet to fathom.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/277490/header.jpg?t=1447360275",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: 2.4 GHz or equivalent processor Memory: 2 GB RAM Graphics: 500 MB Video RAM and at least Shader Model 2.0 DirectX: Version 9.0c Storage: 900 MB available space Sound Card: Windows compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you love old school type action shooters such as Battleships or 1942 then you're going to love  Battle Group 2  as it combines the best of those, it's so easy to just pick up and play with no complicated controls or instructions and with minimal setup as well so you'll be up and playing in a couple of minutes. In fact it's such a breeze that any fool can play it.  This is strictly a single player game with 30 stages in the campaign and starts off very easy and gets progressively more difficult with each stage that you complete, there are no difficulty options so everyone plays the same game. Each stage is very short and your job is to control a single ship at the start and two ships after your have upgraded to fend off various waves of planes and helicopters which can be shot down with your ships guns or missiles which can also be upgraded at the end of every stage when your scores and rewards are displayed. You control a primary ship which is your main weapon and a support ship which offers backup and there are a total of 8 ships that you can collect and use throughout the game.  Ok graphics and sound i have to say is really quite impressive, really nice detail in the sea which flows quite nicely and all the ships behave as they should but the sound is far more impressive, guns have a real nice meaty sound as they should and the planes also sound very good and they do sound like jets too. The voice overs for the story content is nicely done and there are some good background voices too for the ships, the controls are really so easy and all you have to worry about is moving the mouse to aim at the targets and then the mouse button to fire your weapons.  This is a very casual game so you can play it as much or as little as you like, it's just a great load of fun but it's very addictive i can tell you !! Depending on how well you do in any given stage you are rewarded with a number of stars so reach 90% of your goal on that stage and you'll be rewarded with 3 stars and get over 100% and you'll receive 4 stars but they are golden so can you collect all the stars? Some stages although not all that difficult will leave you pulling your hair out especially if you want all those golden stars, sometimes i found myself on 99% and thought there's no way i can do that but your will keep trying until you get there.  In summary just ask yourself do you like planes and ships and want a good fun time without reading loads of instructions or have a long winded tutorial or without needing to know what you have to do to get any where? If that all sounds good to you then you could do a lot worse than boot this baby up, oh and by the way there is more content to come and the Developers are rather active in the community and are a friendly bunch of souls so why not give it a go? I personally rate it a rather good 82/100 but that may improve after more content arrives but have fun playing the game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very enjoyable game that plays well with a mouse and keyboard or a touch screen. It reminds me of missile command but has different ships and upgrades that you can buy with special weapons on them. The creator is still active in the forums and continues tweaking the game. There are 30 missions plus a final boss battle but you'll probably end up grinding a bit to get an early advantage which prolongs the game. The commanders of both forces play the G.I. Joe and Cobra Commander image which is a nice touch if you grew up watching those cartoons. I don't have anything negative to say about this game. I believe it was coded by one person which makes it all the more impressive.",
            "review_score": "1"
        },
        {
            "review_text": " VERDICT:  Battle Group 2 can best be described as a naval-themed strategy clicker, on-rails.   Take one or two ships, survive thirty-one naval patrols by destroying enemy planes, ships and missiles while keeping your kill streak alive. Gain rewards to upgrade and unlock better ships. Its simple premise, fast-paced gameplay and short quick-fire sessions are sure to take you back to playing Missile Command back in the day. The challenge is pretty easy, though gameplay is quite addictive. Graphics are well-drawn and the music though simple, suits the pace of the game perfectly.   Reservations include not so dynamic enemy spawns and pathing. It gets grindy towards the end. There is no endless mode and it could really do with more content with more ships, more weapons, more levels and even more action!   Other than that despite its mobile/tablet origins, it was actually a fun port to play and is sure to be a draw for fans of casual games.     ... More info below ...     01. GENRE:  Arcade/Clicker Action-Shooter.   02. SETTING:  Naval Warfare operations.   04. GAME MODES:  Singleplayer with one thirty-one level campaign.   05. GAME/LEVEL DESIGN:  So-called replayable missions but low randomness. Missions can be replayed if failed.   06. GAMEPLAY/MECHANICS:  Guide your ships to the end of the level and blast every enemy seen as your fleet moves horizontally across the screen without player input. Point and click to shoot weapons or approaching missiles. Your ships have numerous fixed weapons and anti-fire measures such as: missiles, cannons, helicopters, flares or anti-missile guns. Maintaining high kill-streaks provide bonus oil barrels and raises your score. A few Boss encounters are littered through the missions.   The action is in real-time. Timing is everything. Better ships can be unlocked with oil barrels earned by shooting enemy aircraft, missiles, installations and ships. Three power-ups can be purchased to assist you: Hyper-time - slows down time, EMP Blast - clears enemy missiles and Instant Recharge - circumvents the reload time.    07. ENEMIES:  There are a limited number of enemies, each with their own particular traits. Kamikaze gunboats move slowly but zig-zag to avoid your fire. Frogfoot sub-sonic planes fly slower and shoot projectiles while their Mig-type counterparts fly faster and fire homing rockets. Forcing players to concentrate on where and when they fire. Rockets provide a slow moving target but are fired in large numbers. While helicopters hover and fire multiple times before fleeing off-screen. Periodically you will see bonus aircraft. These are harder to destroy but provide a good amount of bonus are help maintain kill-streaks.   08. A.I:  Basic but well implemented. Mostly due to the fact that the A.I. doesnt have to react to anything. The illusion of a clever enemy is conjoured through the use of varied flight-paths/pathing, increased numbers, speed of movement and spawn frequency. However its all done very well and you never quite feel in control in the final missions. Something I imagine is intentional so iOS users spend cash on power-ups. PC users at least wont need to worry. (Earn enough to buy power-ups by farming oil, by repeating missions)   09. INTERFACE/CONTROLS:  Very simple and robust. Just mouse click on the target to shoot, use ships secondary equipment or activate a power-up. Its not to hard to see why this was made for iOS.   10. GRAPHICS:  Pristine, clean-cut and great for this sort of game. From the detailed artwork of each of the four primary and secondary support ships to the enemy air and seacraft, all of it is pretty to look at. As are the explosions! Changes to ships when damaged by enemy fire is neat. As are the animations when you fail to protect them and they sink.   11. SOUNDTRACK &amp; AUDIO:  Very good. Music changes depending on the mood of the action from soft mellow _ to hard pulsating eletro rock tones when you are up against it! Simulated battle chatter takes the overall audio experience from being good to just that bit more!   12. VOICE ACTING:  Very good again. It has an excellently voiced female commander/co-pilot to help you through the first few missions which I thought was actually well-written and voiced. Thought there isnt enough of it and during my playthrough she isnt used as much in the final third of the game. Which is a shame.   13. CHALLENGE/DIFFICULTY:  Difficulty is very low to barely moderate. The real challenge is slanted towards getting perfect or near perfect scores using high kill-streaks. Given the speed of the moving craft, their numbers and frequency this becomes near impossible in some missions, especially towards the end. For mere mortals like me the availability of the power-ups makes life much simple! Overall the recipe is simple: Choose the right ships. Have enough upgrades and power-ups and the game ceases to be much of a challenge and devolves into a click-fest!    14. PROBLEMS:  None experienced.   15. ACHIEVEMENTS:  Possesses a good mix of achievements overall. Complete campaign missions, use x type of power-ups, unlock y number of ships or earn n mission stars. Achieve milestones such as: shoot z missiles, hit m targets etc. Most are obtainable in a few hours. Only a two; kill 10,000 targets, shoot 10,000 missile need a fair amount of grinding.   16. DLC:  None.   17. ONLINE PLAY/COMMUNITY:  Singleplayer only.   18. ENJOYMENT/APPEAL:  BG2 provides a good dose of fast and easily accessible shooting, blasting fun that may get somewhat old after about half-way. It did for me.    19. PLAYTIME/LONGEVITY/REPLAYABILITY:  The campaign can be completed in five or so hours if you are efficient with your oil spending and get the ships you need rather than the highest ranked ones. You will have to be smart and grind out credits to purchase power-ups. If you want 100% achievements then you will need to grind alot. Doing so will extend the game life to at least ten hours. More if you aren't fussed at getting perfect scores every time.   20. VALUE FOR MONEY:  Its on sale quite frequently. Just about worth the full price, if your budget allows or you cant wait for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "  gameplay is very good but I would like to see more content, more ships, more upgrades and more levels",
            "review_score": "1"
        },
        {
            "review_text": "Battle Group 2 is not bad, and it is reasonably priced. I would however say that battlegroup 1 was a better game. Battle Group 1 had more variety of enemies and your own ships were also more varied. Graphically Battle Group 2 is better, but the levels are very short and are only made challenging by the volume of missile spam. The addition of the power up system also makes the game less interesting and challenging.  If you do choose to buy this game and enjoy it, I recommend you also go play Battle Group 1. Or just go play that first.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game, I enjoy to play it. It´s bit short but also not expensive. It´perfekt to play when you do have time cause RL",
            "review_score": "1"
        },
        {
            "review_text": "This game might seem simple and a bit boring at first but it is actually a pretty fun game. I recommend this especially if you can get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "The game is a basic arcade shoot-em-up. You are in control of two ships, a primary vessel geared towards attacking and a secondary vessel with a variety of support options.  The game's story is Command and Conquer with you playing as the UN versus NOD, for some reason. The dialogue is a bit simple and nonsensical.   The gameplay is standard fare except for the nature of your weapons. There is a delay between when you fire and when you hit so for fast moving enemies (all of them) you have to lead. A lot of enemies also bob and weave meaning you have to be good at predicting their next position. The levels themselves are largely samey and are very short in length. There are some gimmicks in levels, such as your vessels getting split up, having to defend civilians and night battles but its really the same thing again and again. At least for me, the combat was satisfying because of that delay and it is satisfying to blow up enemies and watch the debris fall into the water.  The sound design is steller. You get nice ambient radio chatter, satisfying explosion sounds and distinctive noise made by each enemy and missle type.   On the whole, I'd say its a nice short arcade blaster worth its budget price.",
            "review_score": "1"
        },
        {
            "review_text": "Great casual game if you get it for a few bucks. It took me about three hours to finish without trying to finish it (you can go back to earlier levels if you want to earn more cash to unlock better upgrades). It has a bit of Missile Command to it if you're old enough to remember that game, in that you spend some effort timing incoming missiles and figuring out the lead to allow. The secondary weapons are a great addition, and they're easy to use.  Definitely a fun game you can pick up and play in about 10 seconds.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome fun game",
            "review_score": "1"
        },
        {
            "review_text": "I left this game running over night, and got alot of trading cards.",
            "review_score": "1"
        },
        {
            "review_text": "too simple and boring",
            "review_score": "-1"
        },
        {
            "review_text": "Some grindy arcade game, with a very simple gameplay.  Really not much to say here, except that the base price of 7.99€ seems way too much for a game that have probably better alternatives available on flash game websites.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so amazing, i turned into a pear. Genuinely worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "Dont liked that much tho. Buyed from Humble Bundle when its on discount :P",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to the world of overhead missle command. Click on targets (Ships, Aircraft, Or Enemy missles) and watch them blow up.  Good Graphics, Neat Story, and easy to understand mechanics.  Overall, a good but simple game.",
            "review_score": "1"
        },
        {
            "review_text": "simple but lots of fun",
            "review_score": "1"
        },
        {
            "review_text": "Good game (I am not a staff member being paid to write this review btw)",
            "review_score": "1"
        },
        {
            "review_text": "This is underrated and a bargain for an enjoyable time.  It's the first Missile Command style game that I've ever really liked. Everything about it is great so far. I enjoy playing it.  I'd have to be nitpicking but the sound effect when you try to fire but are out of missiles is too loud. Also, maybe in Battle Group 3, vehicles could move less robotic, and more natural.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, it's worth $3 on sale! It's really fun for about 40 mins before it gets a bit repetetive but it's a great casual timewaster/bullet hell kinda shooter. If you ever played Missile Command on Atari, then you are familiar with this. Lots of upgrades but they are pretty much on a standard set path without the ability to really deviate and no different strategies to employ, but it's $3 and it has slick production. Just do it!",
            "review_score": "1"
        },
        {
            "review_text": "You click things and they explode. It's exciting.",
            "review_score": "1"
        },
        {
            "review_text": "BattleGroup 2 plays best in short, enjoyable bursts. You can push through the missions and make progress, or replay earlier missions for currency to unlock or upgrade ships and buy abilities. The relatively simple gameplay can be very challeneging in later missions, with a ton of things coming at you and almost no way to deal with it all without taking a few hits and/or letting enemies slip away.  The sound is what draws me into the action most... planes, missiles, helis and almost everything has a unique sound, and the explosions and missile impacts feel solid. The radio callouts from your mates may become reprtitive, but are not obtrusive; you will be so focused on the incoming enemies that you don't pay much attention to anything else.  The control is simple point and click with key bindings for special abilities. It's that simple and it works well.  Honestly, I was expecting much from this game, but have come back to it again and again for a quick 15 minutes of fun. As a relatively simple mobile port, I wouldn't spend much money here. If you can get it on sale for a few dollars, it's certainly worth picking up if you're looking for something to play for short breaks, or as a quick change of pace between your usual fare.",
            "review_score": "1"
        },
        {
            "review_text": "Great little time killer. It's like Missile Command but with more content. A great game when you dont have hours to spend on your main games.",
            "review_score": "1"
        },
        {
            "review_text": "'Missile Command' in top-down view. Good for passing some time.  Linux: Achievements do not work.",
            "review_score": "1"
        }
    ]
}