{
    "app_id": 277470,
    "name": "The Book of Legends",
    "release_date": "2014-03-14",
    "developer": [
        "Aldorlea Games"
    ],
    "publisher": [
        "Aldorlea Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "RPGMaker",
        "Indie"
    ],
    "achievements": 44,
    "positive_ratings": 163,
    "negative_ratings": 68,
    "price": 10.99,
    "description": "Huge RPG in the 16-bit style (Final Fantasy, Breath of Fire etc.), featuring an epic, exciting adventure in a fantasy world and packed full of characters (more than 30!), quests and secrets.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/277470/header.jpg?t=1487172294",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8 Processor: 1.6 GHz Memory: 128 MB RAM Graphics: DirectX 9.0 Compatible DirectX: Version 9.0 Storage: 150 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Book of Legends is one of the best RPG Maker JRPGs I've played so far. The battle mechanics are very basic - you have your Fight, Skill/Spell, and Item options, as well as Rush (everybody attacks random enemy) and Escape, but it's the quality and quantity of content that make this game.   There are tons of playable characters, and most of them are well written and often have something interesting and/or funny to say when you speak to NPCs. Jordan, the main character, is, well, an ♥♥♥, who doesn't shy away from telling people what he really thinks of them, or from poking fun of standard JRPG tropes such as NPCs who just stand around saying the same line all day.   I was surprised when the game offered me the choice to kill the first potential companion who offered to join, a cute anime girl at that. There was very reasonable (paraphrased from memory) explanation of 'You just tried to kill me, and when that didn't work you know offer to work for me? How can I trust you not to try to kill me again when my back is turned?' I chose that option, and the story went along with it.   By the end of the game you'll have many characters accompanying you - some optional, some required. You can only have 4 members in the active party, but you can juggle your party around any time outside of battle/cutscene. Inactive party members still gain experience when the party wins battles, but at a greatly reduced rate. Still this keeps them useful when it's time for boss battles which often require you to field two to three non-overlapping parties for concurrent fights.  There are tons of side quests, secrets, items, spells/skills, etc to keep a JRPGer occupied, and I found the story and dialog well written and engaging.   One thing to keep in mind is that the main character is ridiculously overpowered for the starting area, and can still easily solo most enemies for some time afterwards - but he is supposed to be a badass after all. Don't worry, battles come soon where you actually have to rely on your companions.  Another thing worth mentioning is that while the game has 'random' encounters, the time period between the encounters is not random. In Casual difficulty you'll have an encounter every 50 steps, and in RPG difficulty every 40 steps. I found this a very welcome change of pace from JRPGs who seem to throw you into combat every couple steps.  My only issue with this game was from the UI perspective. It's generally pretty good, but a couple pieces of missing functionality stood out:  1. The game has plenty of status effects which your characters can deal out or be dealt in combat, but no explanation of just what those effects do. 'Poisoned' and 'Paralyzed' are self-explanatory, but 'Diseased', 'Dazed' and 'Distracted'? And after beating the game, I still don't know what the difference between 'Paralyzed', 'Lost' and 'Numb' is (though based on observation I think Lost enemies took more damage or were more susceptible to critical hits).  2. When shopping for equipment, you only see which of the 4 characters in your active party can use any given piece - to know if any of your dozen+ reserve members can use it before buying, you gotta swap them in. And lack of item descriptions for equipment in the inventory means that not only do you know know which character can wear that 'Full Moon' you just found, but until you find one that does you don't even know which equipment slot it's for!  TL;DR I recommend this game to any fan of the JRPG genre.",
            "review_score": "1"
        },
        {
            "review_text": "Alright, so I cannot recommend this game for the $15 asking price (as of writing this review), however it's worth about $5-10. The game itself is pretty basic, you fight similar enemies with similar skills the whole way though. Once you get a few more party options the game gets a little more interesting. I am satisfied with the amount of grind to it (so far very little), but the combat is uninspired to say the least. I have to say that the story and characters are well worth pushing through the game. They interact enough that they're memorable, but not so much that the game is centered on interactions. It's good for a few hours of fun at the very least.",
            "review_score": "1"
        },
        {
            "review_text": "By the time you face Pride &amp; Luxury you better start preparing yourself... if on RPG-Mode.  Anyways, I always love those games that you can go and check things ACTUALLY expecting to 'find' (Steal) something from NPCs. Haha.  I hope Indinera starts to put more of his games on Steam, it is a better way to organize your games.  The only drawback is... no Anitta for us. Tried lots of things, but I guess he just didn't want a cat on our team (already full of animals).",
            "review_score": "1"
        },
        {
            "review_text": "I've actually played this game before when it first came out on Aldorlea. This is quite an amazing stand-alone game. Note that the choices you make will affect the outcome of your game (which characters you can find, quests you can complete, and the ending). One example of this is whether or not to kill the female thief in Moondrop Woods. The game is also quite funny. The main character is arrogant and sarcastic and very powerful. One of the most memorable moments from this game is happening upon a basket - yes, a basket - who can talk and wanted to join me on my quest. I was checking the basket for gold or items and got a party member. That was just so funny. Check everything in sight, for this game is loaded with hidden items (weapons, armor, utilities, etc). I truly hope to see many more games from this developer come on Steam. I'm currently playing this game for the second time (this time making a few different choices). Ooooh, and don't forget to try the Collosseum!! If you like turn-based RPG games, you do NOT want to miss this!!",
            "review_score": "1"
        },
        {
            "review_text": "A somewhat lengthy but good RPG Maker game that has interesting dialogue, and I would recommend it to fans of classic JRPGs.",
            "review_score": "1"
        },
        {
            "review_text": "I love the characters and the storyline but there is so much endless grinding (as usual of these kinds of RPGs, random encounters that pop up every ten seconds or so) that I find myself very reluctant to continue. That's the biggest headache with this game. To get to a boss battle and advance the storyline, the player has to encounter about a hundred battles against the same kinds of enemies ove rand over. There's no way to avoid it and considering that many of the dungeons are mazes, the chance that the player has to backtrack paths is very high and hence even more boring battles with endless minions. The actual battle system is the typical I power up and hit you, you hit me, I heal sort of routine so it's really not much fun. Because of all this, I have to not recommend this game unless you're willing to go through all of it. I had enough patience to play 19 hours of this game and I'm about done with my patience.",
            "review_score": "-1"
        },
        {
            "review_text": "The developers gave it a good ole college try, and if combat was more engaging I would have given this game a recommendation. But as it stands I don't recommend this game. Sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "Very good 2d rpg, with nice story and awesome black humor. However it is way to pricey to buy it full price, so I recommend geting it on sale or in bundle.",
            "review_score": "1"
        },
        {
            "review_text": "This is the gameplay for The book of legends - from Aldorlea Games an Indie company that does a lot of top down adventure RPGs   You are a antihero trying to stop a demon from awakening by exploring the world, battle foes, and complete quests   Lots of maps to explore and characters to add to your party each will interact with one another and will bring special skills to the battles  It has that retro feeling of this kind of games, the music is nice, the story is well paced and the dialogs are a plus, you'll have hours of gameplay here.   It drops steam cards   I rate it 7/10   Follow me on:  Twitter: @mtgoguy Twitch: mtgo_guy Facebook: mtgoguy  Steam: mtgoguy",
            "review_score": "1"
        },
        {
            "review_text": "I personally think this game is highly worth the try. Good plot overall, the main character may seem quite the rash guy in the beginning, but you'll finish by getting along with him, and even appreciate his constant sarcastic attitude, especially towards the girl he calls his 'servant', Jasmine. The gameplay is the typical Dragon Quest-Like J-RPG-one, so if you're already used to the genre, you will not be puzzled by its mechanics. A good experience for all retro-RPG lovers, with a huge bunch of quests to accomplish and a vast world to explore, all this for quite a reasonable price. Will you depart for this adventure and open the Book of Legends? I did, without a doubt. :)",
            "review_score": "1"
        },
        {
            "review_text": "In the spirit of old Final Fantasy and Dragon Quest games but doesn't take itself so serious but still delivers an epic storyline and satisfying combat.",
            "review_score": "1"
        },
        {
            "review_text": "This is quite litterally a horrible game. Do not buy or purchase the game.  It will make you want an instant refund.  This game has 1 button and movement controls. And zero plot or story.  I would honestly degrade this game to 'RPGMaker' status, but that would be an insult to RPGMaker games. That's how bad this game truly is... you were warned.",
            "review_score": "-1"
        },
        {
            "review_text": "I've been looking for good retro style rpgs for a while now, and it seems I have found one with this nice title from Aldorlea. -the story is good. -the characters are unique and interesting. -the combat and skills are well done. -the graphics are classic retro style that I like. Obviously, I've got a long way to go, but I've enjoyed it so far and am looking forward to a long and entertaining game. It's one of those that time gets away before you know it. Great game from these devs. ",
            "review_score": "1"
        },
        {
            "review_text": "I am only an hour or two into the game and I hate the main character. He's not funny anymore, he's just being an a-hole. A lot of the jokes fall flat, and if I get another dead in where the main character comments that we wasted our time going out of our way to look into a pot, I'm just going to delete it and never look back. Sadly, with the way the game is designed, that seems very likely to happen.  Overall: - Game looks like it was developed using basic RPG Maker tilesets, sounds and music. - Seemingly intentional bad game design. - Story is fairly predictable. - Writing didn't go through and editing process.  My Opinion? If you see it on sale for a dollar, get it, otherwise, pass.",
            "review_score": "-1"
        },
        {
            "review_text": "I hate this game.   For hours Ive been wandering around.  The Quest says go SOUTH and find a cave. I havent found it.  Absolutley pathetic.   Disgraceful ♥♥♥♥ piece of software.  If I found the cave and progress, maybe I would change my opinion. BUT as it stands, I cant go anywhere, theres no proper map of the area and im amazed that so many people seem to have surpassed me in where to go.   WHERE THE ♥♥♥♥ DO YOU GO and WHY IS THERE NO MAP?????",
            "review_score": "-1"
        }
    ]
}