{
    "app_id": 277560,
    "name": "Where Angels Cry",
    "release_date": "2014-02-27",
    "developer": [
        "Cateia Games"
    ],
    "publisher": [
        "Libredia Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Adventure",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 53,
    "negative_ratings": 47,
    "price": 3.99,
    "description": "Strange events are taking place in an isolated medieval monastery, set high in the Alps.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/277560/header.jpg?t=1529672936",
    "minimum_requirements": "OS: Windows Xp, Vista, Windows 7 Processor: 1 GHZ Memory: 512 MB RAM Graphics: 128 MB 3D video card Storage: 650 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "So far this is a pretty well executed casual point and click game developed by a very small team compared for the price.  Overall, I would definitely recommend this game, it is a casual game and a small casual game gem for the price, or while waiting for the 2014 game of your choice. It will transport you in that world.  The game definitely has cinematic ambition for mood, plot, etc.. Settings are well thought and bring good mood.  Designs are well created.  Voice acting....while it is pretty good acting and it is the team's choice, I believe it is better to stick with original voice actor instead of trying to pull accents even though it is supposed to be in the alps, hopefully it does not dither to suspension of disbelief but it definitely can be confusing for very short time, so my definite choice would have been 'speak English or Italian for a good majority of the acting and elder monk(s) or special key role(s) (for example) can use a mix. Character animation are limited and that is a good thing in this case and game.  Total hours played does not say much about my experience. I stumble on this game on Steam while working on Photoshop, Maya, Mudbox, and Articydraft open at same time, although I repeat again this game may suffer of a little - here and there, it definitely is worth it overall and I had to voice up before I go back to work or it would grind me all day long ;-)   ",
            "review_score": "1"
        },
        {
            "review_text": "For what it's worth I used to pour scorn on hidden object games...too casual for me/kids games/generic blah blah blah.   In regards to this however, it's thoroughly enjoyable. Most likely shares elements of gameplay with the likes of Nightmares from the Deep, Angelica Weaver and the Midnight Mysteries series in that it has hidden object elements to it but your essentially advancing a story by finding objects within the game world, often combining them with each other, the game world or game characters something along the lines of an adventure game although not quite.  It really is quite well done, the whole monks and templars thing is interesting with decent logic puzzles complimenting the story, HOG and adventure elements of the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a beautiful story line (if you're into angels and religion.) For a point and click hidden objects, and a puzzle game. It's quite entertaining. Although it is quite short, its fun to do all the achievements and want not.",
            "review_score": "1"
        },
        {
            "review_text": "really short, barely any animations, below average for point &amp; click hidden object game. could have passed 15 years ago for a decent game",
            "review_score": "-1"
        },
        {
            "review_text": "...ridiculous short...not worth the money...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is really short, two hours to get all the collectibles and finish every puzzle without skipping through any dialog. The backgrounds are pretty, but the characters are most definitely not, standing there absolutely still like statues. The voice acting is really bad for the most part, a couple of characters are kinda alright but nearly every character had me wanting to just read the text and jump to the next line. The music seems alright at first, but the high points are distorted and hurt my ears, had to mute it.   All of this is fine, especially for an indie game, the main problem is the stupid puzzles. For example, there must be 7 times through the game where you need to pull nails out of wood with pliers, but you have to find a different set of pliers every time because your character is a complete idiot, they just vanish from your inventory. I've had plenty of puzzle games remove items from my inventory once they become non-relevant, but the pliers stay relevant all the way to the end of the game, shovels and hammers are repeatedly needed too, they're removed just to force you into more needless scavenger hunts. The puzzles  The areas change in a weird way, at one point there are numbers carved on these pillars as clues, the next day they're just gone, the pillars are still there, carvings are not, I started to think my character hallucinated all of the events of the game.",
            "review_score": "-1"
        }
    ]
}