{
    "app_id": 27800,
    "name": "Space Giraffe",
    "release_date": "2009-03-19",
    "developer": [
        "Llamasoft LTD"
    ],
    "publisher": [
        "Llamasoft LTD"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Psychedelic",
        "Arcade"
    ],
    "achievements": 0,
    "positive_ratings": 36,
    "negative_ratings": 17,
    "price": 6.99,
    "description": "Space Giraffe is an abstract action arcade style game that takes place in a succession of beautiful environments generated by an advanced graphics synthesizer. It presents itself as a shooter but the more you play the more you discover the hidden depths and strategies that make the gameplay satisfyingly rich and rewarding.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/27800/header.jpg?t=1447351752",
    "minimum_requirements": "OS: Microsoft Windows® XP SP2 / Windows Vista ™                    Processor: Intel® or AMD™ Processor 1.9 Ghz or higher                    Memory: 256MB                    Graphics: DirectX 9.0c compliant video card with 256MB RAM ( Shader Model 2.0 )                    DirectX®: DirectX 9.0c                    Hard Drive: 80MB of free space                    Sound: 100% DirectX 9.0c compliant sound card                     Controller Support: Generic HID controller DirectX compatible, XBOX 360 for Windows Controller, keyboard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A novel and innovative sequel of sorts to the legendary Tempest 2000 (T2K) that was a system seller on the Atari Jaguar and returned on the original PSX as Tempest X.  In Space Giraffe players are rewarded for getting into the zone and using not just visual cues but also the rich audio to survive.  Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Space Giraffe by Jeff Minter is a game where the player controls Elfie - the first giraffe to ever be sent into space. The game begins by quickly going through the two decade’s worth of intensive education which Elfie must first undergo before he can become the first space giraffe. Completing many assignments and even making a few friends along the way. At the end of the first level, Elfie is awarded a space giraffe diploma, and there is a beautiful shot where the player can see Elfie’s parents in the audience at the ceremony. Since the game is made with the same graphics engine that powered Sony’s Afrika on the Playstation 3, the level of emotion that Elfie’s parents are able to display was quite impressive at the time. Elfie finally boards a rocket in level 2 and is shot into the vast vacuum of space, wherein for the first time in his life, Elfie comes to the realization that he will have to spend the rest of his life alone. Over the course of a year, the player gets to witness Elfie’s descent into madness, and as he loses his mind, the universe around him starts to change in colour.   The rest of the game just rips off the end of 2001: A Space Odyssey, but instead of a space baby, we get to see the ghost of J. Allard.",
            "review_score": "1"
        },
        {
            "review_text": "Iz space. Wit animals. And teh rainbows. 5951395715105/10 Buy it. Naow",
            "review_score": "1"
        },
        {
            "review_text": "Be warned, I got this while drunk and on sale for £2... and I still think I was ripped off.  Confusing, overly complicated and to be honest ugly.",
            "review_score": "-1"
        },
        {
            "review_text": "A thoroughly underwhelming Tempest-like. Weird for the sake of being weird, and not in a good way, this just isn't that engaging. The mechanics don't feel great, the visuals are so overdone that it's hard to follow what's going on, sound effects are annoying. Not only are there better games in this genre, but there are better games than this that are freeware. Even if you like Tempest, which I do, there's just no compelling reason to pick this one up, it's a poor variant on the genre with little original on offer (and what is original generally isn't good). Found this to be a sore disappointment when I first bought it and my opinion hasn't changed since.",
            "review_score": "-1"
        }
    ]
}