{
    "app_id": 278100,
    "name": "RIVE: Wreck, Hack, Die, Retry!",
    "release_date": "2016-09-13",
    "developer": [
        "Two Tribes"
    ],
    "publisher": [
        "Two Tribes Publishing"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Twin Stick Shooter",
        "Side Scroller"
    ],
    "achievements": 44,
    "positive_ratings": 597,
    "negative_ratings": 95,
    "price": 10.99,
    "description": "This 360-degree shooter/platformer hybrid lets you choreograph a ‘dance of destruction’ in insanely spectacular battles and set-pieces. RIVE feels like the explosive games of yore, pumping megapixels in true 21st century style.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/278100/header.jpg?t=1491295962",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 (64-bit) Processor: Dual Core, 2.5Ghz or better Memory: 4 GB RAM Graphics: Geforce 8000 series (discrete) DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": "Requires a 64-bit processor and operating system",
    "reviews": [
        {
            "review_text": "Very, very polished and quite funny. Only a little bit in but feels like a sort of shmup/metroidvania/arena shooter mashup. Has that trademark Two Tribes style and charm.",
            "review_score": "1"
        },
        {
            "review_text": "Here we have the swan song of Two Tribes: a balls-out hardcore hyperkinetic platform-shooter by the studio well known for its... puzzle games. Alright then!  The humor is a bit overly cheesy and the 4th wall is barely even a suggestion, the player character has a tendency to ramble constantly and there's a surprising amount of dialogue even when you opt to shoot the guide bot to skip his speeches. I've had a checkpoint respawn me in the middle of taking a massive amount of damage several times. That said, it feels great, controls are really tight (at least on a gamepad), it looks nice, and most importantly, level design is both really solid and varied. Autoscroller sections, lots of platforming, zero-gravity sections, sections jumping between zero-gravity bubbles, some really tense chase sequences, and definitely never a shortage of hazards to life and limb or things to shoot at. I wouldn't  quite  call it a must-have, but the price is right and it's a really challenging, strong entry in a really sparse genre.  PS: For me, the campaign was about 3.5 hours. Results may vary, but I really don't see it lasting 6. It is quite genuinely replayable, though.",
            "review_score": "1"
        },
        {
            "review_text": "It's funny, it's challenging, it's exactly what I wanted. Can be sometimes furstrating due to the difficulty, for example, right at the end of the second mission, the boss is quite... nice :) ... But you'll die and start almost right where you were, so you do not have to restart the whole level. I really like it till now. ",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful game that perfectly blends high-octane twin-stick shooting, platforming and no small amount of humor with some nail-biting difficulty that is much needed these days. A short romp through a beautiful game that leaves you wanting more.",
            "review_score": "1"
        },
        {
            "review_text": "WHY IS THIS GAME SO ♥♥♥♥ING BRUTAL?!  WHY CAN'T I STOP PLAYING IT?!",
            "review_score": "1"
        },
        {
            "review_text": "Looks great, Sounds great, Plays great, Great price, Games great. No really it's a great game!",
            "review_score": "1"
        },
        {
            "review_text": "You play as a no-name, space-salvaging badass in a robust spider tank. It’s an armored, all-terrain machine with a giant machine gun for its basic weapon. As you progress, you’ll earn more upgrades like new weapons and armor, plus some gadgets that let you take control of everything from turrets to trains. Funny too, I almost enjoyed the interations with the different robots when they just talked more then the action part of the game. I thought a lot of it was writen very well and very funny. Worth the money this is one of them games that you can play forever.",
            "review_score": "1"
        },
        {
            "review_text": "Two Tribes says this is their final game and they leave with a really good game.  I blew up many times while blowing up tons of robots and still having a blast.  It's just fun.",
            "review_score": "1"
        },
        {
            "review_text": "  In general I wouldn't consider myself to be a huge fan of the shoot 'em up. Despite that fact I really enjoyed Rive.   Rive is unique in that it is a combination of a platformer and a shoot 'em up. While the game is more shoot 'em up than platformer, both elements come into play in the game. What I liked most about the game is that it does a good job combining the two different genres. Two genres I didn't think would work well together actually make for a pretty fun game. While the game doesn't do anything highly original with either genre the game does a good job utilizing the game's mechanics to create some fun and interesting levels.   Overall the controls work really well. I would say the game is moderately difficult. It provides a challenge but it didn't feel as difficult as most shoot 'em ups. The story is pretty average but has some funny moments.   I would say the game is around six to seven hours long. After beating the game the only replay value comes from replaying the levels in either the time trial mode or the single life mode. If you like a challenge you will probably enjoy these modes.   Coming from a person that generally doesn't love shoot 'em ups, I had a lot more fun with the game than I was expecting. If you hate shoot 'em ups or don't like the combination of a shoot 'em up and a platformer, the game may not be for you. Otherwise I would recommend picking up Rive.   For my full review check out   Geeky Hobbies   [www.geekyhobbies.com]  . ",
            "review_score": "1"
        },
        {
            "review_text": "This one is tough...and was ALMOST a No, so read on.  The game is really top notch from a presentation standpoint, and a core game loop. The mechanics are a lot of fun, and the level design is fun as well. If you like the idea of a sort of Twin Stick shooter platform adventure, this is worth playing.  HOWEVER, the difficulty spikes a lot. There are a LOT of sudden death moments that feel unfair. I actually just gave up at Chapter 11 of 13 due to this, and will probably not finish it. If you like a good challenge though, and want to prove you're a great gamer, then go for it!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Action shooter platformer. Loved the character and the narration.",
            "review_score": "1"
        },
        {
            "review_text": "Fast. Frantic. Frequently unbalanced.  Whilst silky smooth to play and beautiful to look at, elements of Rive's design come off as cynical. While controlling your little craft through these levels and blasting at enemies is a delight, Rive's challenges switch uneasily between pulse-poundingly excellent and downright unfair.   Being trapped in an anti-gravity bubble and fending off a swarm of enemies approaching you from all possible 360 degrees is exhilerating, and when laser turrets are thrown into the mix it's an astonishingly difficult trial but one that's a blast to overcome. Yet when enemies swarm from sides of the screen you'd already visited (and obliterated) just as a new threat approaces in the distance, you can't help but call b**lls**t. Similarly, escape sequences that can only be surpassed first time with either divine clairvoyance or knowing what already lies ahead having died to it multiple times already is aggravating. Especially when, in those sequences, the camera pulls in to a tight, claustrophobic view which barely pans the screen at an accurate speed. The attempts to intensify some of these challenges come off as cynical, to say the least.  I can't give a 'mixed' review, but I'll recommend on two conditions: know what you're in for, and hope that some of the game's cheaper moments will be addressed in a balance patch.",
            "review_score": "1"
        },
        {
            "review_text": "RIVE does so much right. Graphics, Design, Style, Voice-Acting, Plot... Its a great feeling to shoot and dodge those drones at 'RIVE-Speed'. You will surely have a great time with RIVE until you get to the point when the Leveldesign becomes just too frustrating. RIVE creates this 'one more try' feeling but at some point after the 50th try the fun is gone. My opinion. Less instant-kill-leveldesigns could have made the game more enjoyable and less frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "Love this game. It has all the right echoes from 90s DOS gaming, complete with goofy characters and ridiculous button mashing firefights. A tremendous amount of heart went into this, and true to the classics, running a custom engine means a distinct feel, not another cookie cutter Unreal or Unity game.",
            "review_score": "1"
        }
    ]
}