{
    "app_id": 278460,
    "name": "Skyborn",
    "release_date": "2014-02-21",
    "developer": [
        "Dancing Dragon Games"
    ],
    "publisher": [
        "Degica"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "RPG"
    ],
    "tags": [
        "RPGMaker",
        "RPG",
        "Steampunk"
    ],
    "achievements": 24,
    "positive_ratings": 1331,
    "negative_ratings": 190,
    "price": 10.99,
    "description": "Life under the rule of the winged Skyborn race isn't so bad for Claret Spencer, the star mechanic of an independent repair shop. She can patch up just about anything...but when a certain cravat-wearing customer turns her life upside-down, she finds herself pulled into an epic, city-wide conflict that's going to take a lot more than elbow...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/278460/header.jpg?t=1542849007",
    "minimum_requirements": "OS: Microsoft® Windows® XP / Vista / 7 (32-bit/64-bit) Processor: PC with 800MHz Intel® Pentium® III equivalent or higher processor Memory: 256 MB RAM Graphics: 1024x768 or better video resolution in High Color mode Storage: 200 MB available space Sound Card: DirectSound-compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Skyborn is a unique story driven R.P.G. developed by Dancing Dragon Games and published by Degica. The Skyborn are a winged humanoid race that has defeated in war and consequently subjugated humankind. You take on the role of Claret Spencer, the star mechanic of an independent repair shop, who suddenly finds herself pulled into an epic city wide conflict which takes her and her friends on a journey through a tale of magic, metal and mystery as she unravels the secrets of the Skyborn. This is a R.P.G. Maker title which up to this point I had never heard of although I have played many games in the past with this same look and style. For those that don't know, R.P.G. Maker is a program that allows users to create their very own role playing games. With that said, the gripping story in this title is really well conceived and unfolds over the course of the game in unvoiced dialogue and cutscenes many times alongside gorgeous anime inspired handrawn artwork that is truly a pleasure to the eyes. There's enough intrigue, action and humor in this wonderful game to keep you consistently playing from start to finish.  As you travel through the beautiful and heavily steampunk themed world of the game, Claret and the allies that she manages to assemble along the way will be forced to do battle against the Skyborn themselves as well as a variety of other enemies and adversaries. The combat in this title, which is very fun and quite different from the typical R.P.G.'s that I tend to play, takes place in the form of the turn based J.R.P.G. battle systems similiar to many classic well known Japanese Role Playing Games like Final Fantasy and Grandia. As you win you constantly earn experience points and automatically level up your group. You also have the ability to upgrade the gear of your character and companions by purchasing, looting or crafting various weapon and armor sets. Besides the main story, Claret will meet many interesting and sometimes hilarious N.P.C.'s who will provide you with the chance to take on any number of optional sidequests. There is also an incentive to explore the world because there are many hidden items to find which can yield extra experience points and crafting materials as well as currency.   The musical score and sound effects in this title are phenomenal and fit the gameplay perfectly. Whether you are engaged in battle, leisurely strolling about or having a conversation there are tracks to suit the occasion. The world is filled with gears grinding and smokestacks puffing as one would expect in a steampunk themed game and this title does not dissapoint. I find myself listening to the classically inspired soundtrack on a daily basis as I'm logged on to Steam and will continue to do so because it's that memorable.   Discovering this game came as a huge surprise for me as I never thought that I would have enjoyed a title such as this as much as I have. Playing this game has definitely piqued my interest in the R.P.G. Maker genre. Like I stated before, this genre is completely new to me but I'm going to go out on a limb and say that this title has to be one of the most well developed and polished of them all. I constantly find myself scouring Steam every week hoping that I might one day come across another gem like this one. If you're looking for a lighthearted roleplaying game with a fantastic story, just the right amount of humor and interesting combat then look no further...Skyborn would make an excellent addition to your library and is highly recommended! As a side note, the developers have recently begun asking the Steam community what they would like in another Skyborn game so I'm crossing my fingers and hope to die that a sequel could definitely be in the works.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game.   I did not get through the additional content, I only played the story, but I can tell you that for it's short lived life, it was fun.   It's generally an RPG maker game, but done extremely well. I'm talking lots of custom art/graphics, and a strange weapon mod system.   I would love a sequel. I teared a wee bit at the end. ;)  9/10",
            "review_score": "1"
        },
        {
            "review_text": " Steampunk in full swing",
            "review_score": "1"
        },
        {
            "review_text": "I gave the game a fair shot, and my experience was mixed.  First of all there is a lot of great custom art for this project. Bravo to the artist for literally carrying this game.  Sadly they left in the default sounds effects. For a small budget you can get loads of free on the right sites with enough leg work. It doesn't seem like the developer knew to do this. I broke quite a few events and even managed to find multiple passability bugs. It really seems like this was someone's first RPG maker game as it has a lot of quality errors.  *To the people who quality tested this game: Shame on you. You missed a lot. I won't go further into muck racking than that. You failed at your job, and it blatantly shows.*  Good music was another positive quality. The theme was used enough and remixed to the atmosphere of the areas that it wasn't tired, but invigorating hearing it. I was enthralled enough to keep playing with the BGM going.  The story was patchworked at best, with things shoe horned in that left me confused at times without explinations. I enjoyed the ride, but the story didn't go anywhere. The big reveal at the end came out of nowhere and literally stopped the story dead to justify the end boss. Even then the ending showed that a support character was the most important and invested character in the game, not Claret. Claret was the falling star of Skyborn, and is sadly on the cover. She has no place on the title, because this is not her story. It's Claska's story and rise to power.  The battle system is simply steam rolling enemies at any difficulty. The side boss is not worth revisiting, nor does she make any sense in the explaination of this world. She seems to be able to go to the Fae world, so I assume she is an Earthenfae too. Not that we are given any reason to invest in her.  Items weren't worth investing into. At a point in the game where major upgrades are bought you replace them with found treasure almost instantly. It's a big time sink that didn't need to be there. Had weapons been upgraded like Claska's claw it would have been a bit of a smoother transition and better use of the anvil and synth system which fell short of simply buying better gear.  Skyborn can't decide what the Prometheus Engine is. It tells us it is an Airship Engine at first, then an anti magic shield, and finally it turns out to be a mecha robot. It has all but 30 seconds of screen time and isn't used in the final encounter. Big build up and grind for little pay off there. Claret focus quickly dwindled.   Sully's focus happened at the wrong times with his father being shoe horned in, and then almost forgot about his sister nor does she appear in the Fae Realm with the other half breeds. His part as the Red Spectre had little to do with anything other than baiting the player.  Corwin is the ultimate silent character. I feel like he wasn't even there. He didn't even so much as chew the scenery.  Alda's derpy blonde face with it's crossed eyes had me amused, but her character's motivation kept changing to the point I felt she wasn't a liability so much as a natural blonde. She is the over kill character. She is far too powerful to be in the group. EMP blast and Missle Launch had nothing on her Mystic Blade and Lightfury.  In the end it was worth one playthrough. Was it perfect? No. Was it good? Yes. But it felt hastily put together and poorly tested. You really need to pick and choose your testers. Their laziness and inability to grow with the project's need hurt all of your custom materials.  It wasn't the developers fault with this game, his staff didn't measure up to the challange. Hopefully Phil finds better people.",
            "review_score": "-1"
        },
        {
            "review_text": " The Short of It",
            "review_score": "1"
        },
        {
            "review_text": "I just started to play this RPG Maker style game as part of my 'collecting trading cards to buy cs:go skins' marathon, but I have to say, this game is awesome.. I really got into the story very fast, it really does have stunningly beautiful graphics and the story is really really good so far.. I strongly reccomend it for everybody who is a fan of pixel art rpg games",
            "review_score": "1"
        },
        {
            "review_text": "Skyborn is a simple 2D RPG reminiscent of 16-bit era JRPGs. The protagonist is Claret Spencer, a mechanic who gets caught up in a rebellion against the titular Skyborn, a winged humanoid race persecuting humans and, more prominently, the so-called 'half-breed' crosses of humans and Skyborn.  The story and characters are...simplistic, and if you play the game for them, you will probably be horribly disappointed. The production (visuals, audio) are nice, but nothing particularly noteworthy. Any saving grace would have to come from the gameplay...and that, in my experience, has been hit-and-miss.  There was clearly attention paid to gameplay details, which I can respect. The classic RPG situation where three spells are useful and 50+ are useless is generally avoided. Some exploration is offered without being annoying, and a lot of weaponry and crafting options are available. On the other hand, very little explanation is given on matters like the str/agi/int stats, and enemy difficulty spikes horribly towards the end of the game without warning. Not to mention the relatively short length of the whole thing...  I can only recommend this game on sale,  if  any of this interests you to begin with. At full price, there's certainly a lot more for your money available.",
            "review_score": "-1"
        },
        {
            "review_text": "Games designed with RPG Maker often get a lot of hate, due to the overall simplicity of the (basic) engine and the rate of sheer garbage that gets pushed out by wannabe game developers who have absolutely no idea what they're doing. But not all RPG Maker games are bad - just look at Skyborn.    It's certainly not perfect. It's a little rough around the edges, there's a few minor mapping errors here and there, there's a couple glitches, and the game balancing isn't the best... but it's okay. The overall mapping is beautiful and well designed, as are the graphics themselves which are largely custom made, featuring only a few of the basic RTP assets that come with RPG Maker. The music is all custom as far as I know, and is actually rather good. My only complaint is that none of the music loops for some reason, it just fades out and starts over.   Gameplay-wise, it's pretty solid, if unbalanced. It uses a variant of the Charge Turn Battle System (the one from Final Fantasy X), which is in my opinion one of the best battle systems available for RPG Maker. All of your party members are decided by plot progression, and you have very little control over what skills and spells they learn (only decided by two class change events partway through the game, which change which skills you will learn), but you rarely feel like you're lacking in skill variety, and most of your skills are actually useful in one way or another. You've got an offensive fighter, a tank, a healer, an offensive debuffer and a sort of battle-mage, and each party member fills their purpose pretty well, except for maybe Sullivan, the tank, who does a great tanking job, but lacks any real offensive options at all.   The main twist of the battle system is the Threat system, which brings MMO-style aggro into a turn-based RPG, where your party member's actions will determine how likely they will be to be attacked. But other than that, it's a pretty standard system, with a very heavy focus on managing buffs, debuffs and threat.   Story-wise, it's a pretty standard rebels-against-the-empire story, with a few little twists and turns. If you like the Steampunk setting, you'll like Skyborn, since it's all about steam engines and airships and stuff like that.   All in all, I'd recommend Skyborn. It's a pretty good JRPG-styled game on a platform with very few good games of the genre. It took me about 12 hours to beat the game, and I did pretty much everything there was to do (to my knowledge), so it's not a huge time investment, but it's fun while it lasts.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game for free a few months back and although I haven't finished it yet, I have got to say that for a game made with RPGMaker this games really shines.  Skyborn is set in a SteamPunk universe, it has an intriguing story, some very well made set of tiles and maps, a main character with a charming personality, some very clever/humorous dialogues. and a nice fitting soundtrack to top it off.  All in all, a much better game than I expected, if you see this on sale make yourself a favor and buy it, it's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing game, with an early 2000s feel. Great plot and amazing sound track. I wish the game wasn't so short, for I enjoyed it thoroughly.",
            "review_score": "1"
        },
        {
            "review_text": "Skyborn is another RPGMaker game, as To the Moon, the strength of this game are the story &amp; storytelling. The Story is about that the Skyborns, who rule over humans and hunt down half breads. Nobody knows why, but you'll find out and fight along friends you meet through the story to victory.  The gameplay is very simular to a classic JRPG, you can choose if you want to battle monsters or try dodge, the monsters and avoid a fight and missing out on the XP. However there are XP bonuses all around the world, which stop you from getting underleveled. Then in combat you won't see any animation/action, like old RPG's you'll just see the sprite of the monster and see the screen shaking if damage is dealt.  Overall if you are ok with the gameplay you can a enjoy a nice steampunk/fantasy world, with interesting and beatiful environments.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty neat game - finished it in about 12 hours. If you like this genre of game you'll enjoy this one. A bit of romance, a bit of dungeon crawl and maze-like environments. Quite enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful art and wonderful story. Highly recommended to anyone who enjoys class turn-based RPGs!",
            "review_score": "1"
        },
        {
            "review_text": "Really good game. Closest resembling games brought to mind are Final Fantasy or Dragon Quest. While not the longest game around, it is a definite recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome , nice storyline i loved it from the first minute i saw the graphics. If you are looking for old-styled console game this is the game. I wish everyone to enjoy it like me :).  If there is part 2 i would be very statisfited as i am now",
            "review_score": "1"
        },
        {
            "review_text": "At start i thought Skyborn will be boring or another badly made RPGmaker game.. but when i started to play this, took me a while and i liked it.The story in this game was very well executed. Usually not a big fan of these kind of games but this one was a very nice one. I would rate this 9/10 Pros:  Addictive characters.   Good combat system.   Easy item gathering.   13 card Spades deck.   Nice stage designs.   Story was so good it needs like 12 episode anime.   Has a collusseum, where you can get a champion title.   The music is good and fitting for every stage, but easy forgettable.   Lots of secret items to discover, with special attributes, that cant be bought or crafted.  Cons:  No voice for characters.   Lack of crafting stuff.   No sequel to this.   Not much sidequests.   Saehral is too damn OP!  Overall if you want to enjoy a RPGmaker game, that is well done, get this one, won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Plot twisted!",
            "review_score": "1"
        },
        {
            "review_text": "Great story , love the game , mid-end game became somewhat too easy even on hard mode but overall good game  a little sad that there's no new game+",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game with great story. There are several different ways to build each character's stats. I have finished the game, but still haven't found all of the secrets yet, so this may keep me entertained for a while yet.",
            "review_score": "1"
        },
        {
            "review_text": "Well made short JRPG with some enjoyable dialog. If you enjoy 'em you will likely enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say about Skyborn. It's a great JRPG made on RPG Maker. As you can probably tell by the pictures, it is a steampunk style game. The combat system feels great, and the game has a pretty decent story. The game is pretty easy though so if you are looking for something challenging, I would look elsewhere. There's a ton of quests to keep you busy, with a 'find all the things laying around the map' quest to keep you busy as well. If you are looking for a casual rpg where you can just faceroll and still enjoy the game, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "  Skyborn is... ehrm... quaint. It is a relatively short (around 8-10 hours) and straightforward jrpg with a couple of plot twists at the end. The combat mechanic is very similar to what you would expect from a jrpg - you got your attacks, items and spells. There is also something called 'threat', that accumulates throughout the fight while dealing damage and determines which of your characters the monsters will attack. The story has its issues, but only if you think too much into it. The plot, overall, is not very detailed and little time is spent on character development. I encountered only 2 side-quests in the whole game, so you don't really get into exploring the world either.  Despite all this the game is solid. It is well thought out and it runs well. It is OKay, and if you have already gone through the must-plays of the industry like Final Fantasies, Chrono Chrosses and Triggers, Evolands and whatever it is they currently are, but still fancy a somewhat classic jrpg adventure, do pick Skyborn up.   PS: Be warned though: in case you are looking for a steampunk themed adventure - look elsewhere. Even though there is a flying ship, a mecha armour and tech-type attacks, nothing would change were they replaced by a chocobo, an enchanted platemail and, say, alchemy. IMHO The only reason this stuff is in the game is to somehow differentiate between the humans and the skyborn, as though the technology vs magic trope is original.",
            "review_score": "1"
        },
        {
            "review_text": "I must say when I got this game it looked promising. A steampunk RPG? Sounds great, but you have to do it just right and the creators of Skyborn did great. I literally had to switch off from it to write a review of how great it is. The characters are interesting from a range of backgrounds. The world shows a great depth. The turn based gameplay gives a feel of an MMO rather than an RPG. you have your characters which you can choose to specialize in diffrent ways to make your kind of team and for an avid MMO player I of course have my tank, dps, and healer. This rpg as well is one of the only games I've ever known there to be a crafting system in. Though not as in depth as an MMO might be it gives a certain feel of progression that I thought only an MMO could do. You even have a sort of enchantment system which allows you to add diffrent states to your weapon and armor. This game by far blew me away and I feel myself getting jittery so I can play it some more. definatly a 5/5 in my book. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun and games till you run into the last boss and he can be a pain in the ♥♥♥ when he reaches 50% of HP",
            "review_score": "1"
        },
        {
            "review_text": "Great art, challenging fights (should you choose so), nice alloy of steampunk and magic. Enjoyed immensely.",
            "review_score": "1"
        },
        {
            "review_text": "really good game. short but good. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I have already played a damn lot games like this one. So also I love these old school RPGs, I easisily get bored by them, and I already tried a lot and stopped playing them before the end. But Skyborn kept me excited until the end. Great work!",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but short - only 8-10 hours of gameplay, even chasing most of the optional side quests.",
            "review_score": "1"
        },
        {
            "review_text": "Great story! A littly bit short (finished in around 10 hours on my first try) but I did not do all side quests, went straight to the main story to the end.  I'm starting a new game and doing all side quests I found, sure I will double the game duration.  It is a simple 2D RPG, but I really liked it!",
            "review_score": "1"
        },
        {
            "review_text": "good game.. but the story is too short..",
            "review_score": "1"
        },
        {
            "review_text": "Skyborn is a fun RPG, and deceptively simple! I tried to go into a in-depth review of it, but it turned out way too long, so I'll just go into a Pros and Cons type of points, with the full analysis for myself. If you're interested in it, I'll send you the whole review, just!   Pros  -Great world! It starts out fairly average, but it later reveals itself. It has a few interesting concepts, worth looking into. -Unique combat system. It's a mixture of the classic turn-based combat, with a few more modern Skills and Gameplay concepts, akin to MMOs, like a threat system, big focus on buffs and debuffs rather than pure firepower, and good interaction and role separation between classes. -It looks pretty good. -Music is simply fantastic! It really reminded my of Golden Sun. While it's not quite at that level, it's still very good, and it feels more modern sounding. I really liked it. -Provides a good challenge on Hard Mode without feeling too frustrating (until the last 2 Bosses, which are impossible unless you do absolutely every objective before heading into the final section of the game. However, nothing previously indicates that to be the case, which one is likely to miss, not realizing it until it's too late to go back.) -No random encounters! You can see those encounters on the screen, approaching at will. -Retry feature to get right back into a battle when you're defeated. -Good control scheme (I personally used a controller for a more laid back experience, and it worked fine).   Cons  -Lack of any resolution options, leaving you with a very badly scaled game in Fullscreen, or just a small window (the latter is recommended, Fullscreen looke hideous). -Poor interface design, looking very average, and not very functional. -The crafting system was awful to navigate, and didn't provide much benefit, as you could earn enough gold to render it useless, as everything would be for sale. -The game loved to surprise you with Boss Fights, and having you walk for half an hour if you did something wrong regarding leveling, or equipment. Some Boss Fights also appeared out of nowhere, sometimes making it impossible to procceed without reverting a couple of Saves. -Low amount of Save Slots (only 4). -The last few maps seemed a bit too clustered and confusing. -Lack of information. This game is not very informative regarding some of its details, leaving it all to trial and error. Sometimes, it can be very damaging to the player's experience. Every shop, forge (for crafting) is very far apart, leaving the player with empty hands for long periods of time. In the end, it was my downfall, as I literally couldn't go back, but HAD to, to be able to finish the game. Again, it does NOT give the player enough information for the player to make some decisions safely, but it was a big sore spot for me.   Overall, Skyborn was an enjoyable experience. I liked a lot of it! But, looking back at it, it is also riddled with so, so many issues...! Some of those are inherent to RPGMaker, but some of those were also huge design flaws, which is disappointing. If you're looking for a JRPG with a more modern feel, give this one a try! I enjoyed most of it. Not recommended at full price, though, 15$ seems way too high for this game. It feels small at times,and just doesn't seem worth that price point, with so many amazing games at 10$.",
            "review_score": "1"
        },
        {
            "review_text": "Did a first play some time ago , didn't go that far, by lack of time mainly and characters didn't hook me up yet.  Came back on it recently and I must say it's quite a gem of an 'old-school' rpg. The story, without being groundbreaking is well written and the characters are really lively and relatable. No cliche of the 'dark hero with a tortured past' or the 'happy go lucky kid who somehow gets stronger than veterans because ♥♥♥♥ logic he's the chosen one' here. It's a relief.   When you kick a baddie's butt here, you feel gratified to teach him a lesson and that tells about how well the whole thing is written.   About the gameplay itself though.....   Well..... it's too easy. I'm playing on normal and plan to give a try with a second run on hard to check but damn, I didn't die once so far. The amount of augments and accessories make for a wide choice to modify your characters and also you can chose advanced classes which seem to propose pretty different strategies.   I'm a bit disappointed enemies don't have better patterns and ai, especially bosses which I could basically faceroll against the floor in 2 minutes so far. Maybe it gets harder later but for now I'm at around 6 hours of real game (I left the game running while doing other stuff a lot) and no difficulty whatsoever. It doesn't disturb me that much because it's still fun and I play rpg more for the story than anything else.   I wonder how some guys got lost in dungeons because the map design is pretty simple without being over-simplified either. You have room to get some extra-loot and xp which is always nice. Doesn't seem to have really hard to get secrets so far though. Time will tell maybe it comes later.   The music also is pretty good.   One of these games (like the Legionwood franchise) proving that YES, you can produce a good game with rpg maker. Without game-breaking bugs and actual fun. Which actually took time to polish. Incredible. Wow.",
            "review_score": "1"
        },
        {
            "review_text": "I have mixed emotions about this game. It's fun, but I was a bit disappointed about the battle mechanics. I was hoping for a final fantasy type deal where it goes through a cutscenes to a fight. It just shows a picture of a enemy and you just click and randomly pick things to attack or defend. The game has a great storyline so far even if battle mechanics are just meh. I will suggest this cause the storyline is good. I hope to see the creator make more games with improved battle mechanics",
            "review_score": "1"
        },
        {
            "review_text": "I gave this a thumbs up when I first started playing, but am now giving it a thumbs down. I am halfway through the games and there are far too many parts of the world you can't explore. Not because of limited world, but because of bugs. You click to move to a part of the map and are unable to move suddenly. Not even back to where you were. I'm so frustrated. I tried working around the bugs. I really did. I had so enjoyed this game til halfway through. But now... it's like buying a piano and only half the keys work. You try to play songs, but only some sonfgs can be played because the rest of the time, no sound comes out. I just want my money back. I don't want a broken product.",
            "review_score": "-1"
        },
        {
            "review_text": "Got the game from a giveaway. Didn't play it much. Got cards and awesome emoticons. Happy.  100/10 Would pay nothing to get those emoticons again.",
            "review_score": "1"
        },
        {
            "review_text": "Its probably the best rpg maker game of all time ;)",
            "review_score": "1"
        },
        {
            "review_text": "Plot is kinda boring but otherwise this is a really nice game, especially for such a small studio.  The two big things that set it apart from your standard 16-bit jrpg are A: Breaks a lot of rpg gender conventions in a very natural way B: The combat system remains interesting, with timing, classes, and debuffs. I found myself using different powers and tactics for each fight, and there were few to no abilities that I never found purpose for.",
            "review_score": "1"
        },
        {
            "review_text": "Well, I was kinda expecting an average JRPG with a steampunk theme.   However, it is good. Here are the  Pros:  -The music is really nice -Sound design is done well. It is not just a silent world.  -Story is cool -The setting is suprisingly unique  Now the  Cons:  -Some portraits look kinda ugly :P -The fight system is not too special  Cool game. 7/10. Worth a buy.",
            "review_score": "1"
        },
        {
            "review_text": "A super cute little game that takes a lot of inspiration from gameboy advance era rpg's. It is a steampunk setting but is mostly fantasy rather than the alternative history that has become the expected norm of steampunk.  Always worth a play. It is a relaxing game that is easy to learn and also it has really pretty artwork which looks kawaii as f*ck",
            "review_score": "1"
        },
        {
            "review_text": "It seems to me that this game was primarily made by an artist: The art is beautiful, but the programming / systems involved are not particularly complex. Fortunately, there was a lot of hard work put into them, and despite being a simplistic affair, the combat is balanced and even strategically challenging on harder difficulties. One particular (optional) fight, which I later discovered defaulted to the hard difficulty, was amoung the most challenging RPG fights I have ever done, and yet, it was not arbitrary... it just required a lot of strategy... though by the time I finished it, I was pretty much untouchable.  In the meantime, if you don't care too much about the battles, you can drop the difficulty to easy and enjoy roughly ten hours of a well told story. It's not quite Bioshock, but many a sucessful AAA title has gone to field with worse, and it's engaging enough that I played through it in one go, without feeling any desire to stop midway through. Nor did I feel the need for a walkthrough or to look up advice on the game, which was fortunate, since there is rather little.",
            "review_score": "1"
        },
        {
            "review_text": "Great play! old school style, great story, worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "I got this for free, so im biased, but it was great.      4/5",
            "review_score": "1"
        },
        {
            "review_text": "Very solid game, tough it felt short. I didn't have much use for the crafting system because money wasn't an issue. Story line was good, recommend for anyone wanting to take a break and play an RPG that let's you skip random encounters, gives you bonus XP for exploring, and has some funy moments",
            "review_score": "1"
        },
        {
            "review_text": "This game looked great when I started to play it. The graphics were nice, and the steampunk theme went along really well. But there was just one part that ruined my experience.  The controls. I just couldn't play this.  I couldn't edit the controls in the options menu, and I had to click on my mouse instead of using the arrow keys or WASD. Whenever I clicked, the character I was controlling would go all over the place, instead of where I need the character to go. Like when I click to the left, the character would go left, make a turn, go right, then go down.  This keeps on happening and I just decided to stop playing. DON'T BUY THIS GAME!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Had a great intro, but soon fell apart with repetative battles.",
            "review_score": "-1"
        },
        {
            "review_text": "to much talking its anoying",
            "review_score": "-1"
        },
        {
            "review_text": "Guys with wings came to ♥♥♥♥ me on the city after every 6 - 8 steps   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game with great depth, twists, turns, and characters.",
            "review_score": "1"
        },
        {
            "review_text": "Step 1: Get free copy from PC Gamer Step 2: Install the game Step 3: Run the game idle for 1-3 hours and get card drops Step 4: Sell cards and get rich Step 5: Uninstall the game",
            "review_score": "-1"
        },
        {
            "review_text": "  It's a decent game, nothing more to it",
            "review_score": "1"
        },
        {
            "review_text": ":( ",
            "review_score": "-1"
        },
        {
            "review_text": "God standart RPG Maker game ... WIth lovalble characters , cool soundtrack and really interesting story .  IF you are a fan of RPG's in general , this one is totally worth it !  Only con to the game its its lenght :| Even then , its worth every cent !",
            "review_score": "1"
        },
        {
            "review_text": "Art is ♥♥♥♥ story is ♥♥♥♥ everything is ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I would love to say this was awesome but firstly it registered with my Anti Virus as a threat.. so I had to set it as an exception to even launch. Then 10 minutes into it it caused a graphical error that necessitated a shutdown and reboot to fix.  Im sure this game is great but it doesnt seem to do so well on all modern PC's.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a very good example of what Indie games can be, besides Slender of FNAF. This game is a basic RPG that did a lot of things right, with only a few little fall offs. The story was good, not an intricate multi-level story, but enough to drive you to want to continue the game. Meanwhile the combat is the basic RPG maker system, which is not THAT bad, but could feel more engaging. The art work for the game is actually pretty good, it melds the color pallete nicely, it gives the game a rust-like brown that shows its metallic and manmade (Which I think fits the story nicely).  The plot is a bit bland, I could tell what was going to happen a few times. However the dialog overshadows the blandness with a nice uplifting comedy-like undertone.  I give this a 4.5/5.",
            "review_score": "1"
        },
        {
            "review_text": "Final Fantasy VI meets Firefly.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game, with great story, plus it has awesome soundtrack, that most of 'RPG Maker' games doesn't have. But its pain, when you finish. It only has singleplayer, and you cant continue after the end, but still 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Excellent story!  I recommend it for anyone who likes interesting fantasy stories.",
            "review_score": "1"
        },
        {
            "review_text": "Never trust childhood ♥♥♥♥♥♥s who ruin your life in the instant blink of an eye.  Will give this game a 8/10. Had Suikoden feels, although abit dissapointed in the battle system. Still, gonna finish it nonetheless!",
            "review_score": "1"
        },
        {
            "review_text": ":melon::melon::melon::melon::melon: Very Good GAME! Interesting gameplay. 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "Adicttive game 10/10 will play again P.S got it free.",
            "review_score": "1"
        },
        {
            "review_text": "This game's strong points are it's story and characters. Every one is unique, and has depth. Just watching them interact is entertaining. The gameplay is a solid, classic RPG, with difficulty ranging from laughably easy, to frustratingly hard, depending on the enemy you are facing, and the difficulty setting (Easy, Medium, Hard)  I am glad I played this game, and, if you like a good story, with lovable characters, then give this game a try.",
            "review_score": "1"
        },
        {
            "review_text": "The music is awesome, the character design is pretty well, the story seems good. The negative points are the low frames per second (in town huge drop) and impossibility to rebind the keys.",
            "review_score": "1"
        },
        {
            "review_text": "Has a pretty good storyline overall though quite short; beat it in 6 hours and thanks to the discovery lights didnt have to fight many creatures either.",
            "review_score": "1"
        },
        {
            "review_text": "A well executed, if short, JRPG.  Those of you looking forward to flying your airship around the world will... Not be dissapointed, but that's not what you'll get.  Unfortunately, the devs appear to have moved on to other things. Even their website has fallen off the internet. A pity, since the readme claims the original art assets could be found there, and I would've very much liked to have had access to them.",
            "review_score": "1"
        },
        {
            "review_text": "Fun SNES style JRPG Enjoyable story. I shed a tear or two. I'm a softie. Optional boss at end can be a bit difficult. For gear put puffin feathers on your armor to increase SPD. +4 metal ingots on weapons.  1st playthrough on hard I couldn't beat the optional boss so I did a 2nd replay. ",
            "review_score": "1"
        },
        {
            "review_text": "I've played many RPG maker crafted games and I've got to say this one makes it into the top five. The music and artwork are both amazing. The story is also very interesting and kept my attention throughout the whole game. In fact, it was so good that I felt the need to play the game again once I had finished it. There is some flexibility is choosing the class of the character, which is quite uncommon in story based RPG maker games. The dialouge is well written too. I can't say there much of a downside to it other than the fact that it's shorter than I'd like it to be but all in all, it's a wonderul game that I'd recommend to all RPG players.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with great story 11/10",
            "review_score": "1"
        },
        {
            "review_text": "From what I've seen so far, I'm really liking this game. The art is gorgeous (background and character art alike), the music is lovely, and the characters and their interactions are really amusing. Combat seems a little on the slow side and rather tough, but I look forward to it opening up in complexity.",
            "review_score": "1"
        },
        {
            "review_text": "I'm about 1 and a half hours in and I LOVE IT!!! Love the steampunk idea, great world! Its a recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Its a nice game,loved it while i played just one f*cking annoying thing...pressed f12 for a screenie but *sigh* it just went to the main menu and rip...was at the spektre's HQ when i did it and i did everything so far, dont think ill touch the game for lil while now,ruined the interest PS. Stopped being a baby and got to the same spot soon (started playing after i wrote this review xD )",
            "review_score": "1"
        },
        {
            "review_text": "First off the game is only about 7 hours long so if you wanted a game to go trhough in one sitting then this oculd be it.Sure it could be long if you do every single battle and every side quest but probebly only by like 3 hours more.   Game play is your typical rpg maker game so there really isn't anything new here other then the threat meter.Depend on what character has more threat that character will get attacked more.   Story is actually pretty well written it kepts me coming back to it so it has that.   Music is decent and as far as i can tell it is original. Most of these rpg maker games tend to rip off others but i don't think this one does.",
            "review_score": "1"
        },
        {
            "review_text": "I don't actually remember buying this game, and when I found it in my library and played it I was pleasantly surpised. It's surprisingly well written, and the gameplay is well balanced.  The gameplay is far from revolutionary, apart from the 'threat'-mechanic which I've never seen before, but works really well and is nicely streamlined. It's well balanced, but some areas lack a little polish. That's acceptable since it was made by a small team, and it never breaks the game in any way. The soundtrack is nothing revolutionary either, but at least it's nice music and it fits the settings it plays in.  The main characters are well written and realtable. The game succeeded in making me like the heroes and at least disliking the villains enough that I agree with the ultimate goal the heroes are working towards. The story is not overly dramatic, it doesn't try desperately to be funny all the time, and it's not all grim or lighthearted. It introduces characters at a good pace and gives them space to develop over time.  This game is like a good fantasy-steampunk book, with monster slaying in between every chapter. The game succeedes in really feeling like an adventure, but it never loses sight of the end goal.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game but it's kind of short when I played the game. The final boss was really hard.",
            "review_score": "1"
        },
        {
            "review_text": "The devs of this game have bottled up the sheer joy and sense of wonder from the old school Final Fantasy games (before they became emo boy meets emo girl romances) and just gave us a fun, well written, wonderfully designed and beautifully scored RPG. Some tropes are followed and a little predictable but the additions of a fast crafting system and no random enounters makes the game a positive experience. It made me feel 15 again, staying up super late to play just a little longer. Although if you do it once with this game you'll probably finish it as I hear it averages about 8hrs play time, though I don't know what difficulty that is. Get it on sale for full value.",
            "review_score": "1"
        },
        {
            "review_text": "If you like RPG's with a good story and you like steampunk style games. This is a definite buy!",
            "review_score": "1"
        },
        {
            "review_text": "awsome game I am not one who likes to write reviews but loved the story line and wish there were more games out there like this one",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome little RPG, anyone that wants a blast from the past with a little sci-fi should check this out!",
            "review_score": "1"
        },
        {
            "review_text": "I got Skyborn in a bundle a while back and played it last week, and it's a surprisingly decent game - there's almost no grinding, the characters are fairly diverse (though there's a slight flaw with one of them due to how his MP mechanic works in the late game), it's somewhat well written (though the plot is fairly generic) and it doesn't overstay it's welcome (since it's only 8hrs long, though I imagine you could get another one or two with the bonus dungeon I didn't touch). It may not be worth £12, but I could see it being worth buying at 66% or 75% off if you fancy a decent JRPG or RPGMaker game.",
            "review_score": "1"
        },
        {
            "review_text": "From what little i played, it is really good. It has the Basic turn-base classic with a slight upgrade. Steam punk and fantasy melded together and became Skyborn.",
            "review_score": "1"
        },
        {
            "review_text": "I was shaken after putting a few hours into this game! The music, attention to meaningful details regarding characters and plot have given me a greater respect for RPG Maker products. I believe in supporting small developers and indie so if you see this game and want to similar experiences to Chrono Trigger or Final Fantasy you will not be disappointed.   I look at greenlighted games which vastly are alpha or beta unfinished products. Now compare them to 'RPG Maker' designed games and I shake my head at all of the gems which could be slipping through the cracks, dont let this game be one of them!",
            "review_score": "1"
        },
        {
            "review_text": "All in all, you can play through it in about 6-7 hours, so not a long game. Nice story, moderately acceptable (if clicéd) characters. Item variety seems OK. Graphics-wise, I wish the ingame character-drawings got nearly the same attention as the one on the boxart. They are jarringly different. It has its own set of bugs (the most annoying is hiding the enemy life bar about a second after it changes), but it is playable. There is also crafting that can get you some pretty nifty items.   All-in-all, nice, but short indie RPG. Not worth the 13€, but for $1 bundle, it was A-OK.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't level my characters enough or equip them well enough and now I can't beat the final boss even on easy mode.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Worth playing. Challenging toward the end, yet fair. I wouldn't mind seeing a sequel or an extention, some sort of side story that involves some of the other towns and places mentioned. Great work to the developers - kudos.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great(even though it's made with RPG Maker), but too easy.. Get 3 Iron ore + 3 coal, use a forge, and make a 1h-gun with the iron and coal, and 300% that quality... Very Over-Powered weapons. I'm going through the story, and it's very nice so far(albeit 1-hit kills... Two of those guns are just insane damage output...). I'll make sure to update when I'm finished with the story. Very well done on the developers part with the story-telling.  edit 2 days later:  Well, the story ended great, and the weapons got even more Over-Powered as the story went on lol... Obsidian Weapons+2+3 are just insane. Bosses still seemed to be a little bit of a challenege,   but the last boss was a lot easier than the girl you could fight before the end...   Overall it was a great game, I really enjoyed it  9/10 - Because it was too easy (not counting the bosses)",
            "review_score": "1"
        },
        {
            "review_text": "I was in the mood for a really good RPG so i picked this up. This game was amazing! Its a bit shot about 7-8 hours give or take however the story is decent and the combat is fun. I loved looking around and exploreing the area.  Story: 7-10 Gameplay: 7-10 Dialogue: 8-10 Music: 7-10 combat: 9-10  This game deservers a sequeal.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it! Great story, beautiful soundtrack, and overall a very refreshing RPG.",
            "review_score": "1"
        },
        {
            "review_text": "Fun short little RPG with a decent story. About 12 hours to completion.",
            "review_score": "1"
        },
        {
            "review_text": "The only good game that I got from giveaways",
            "review_score": "1"
        },
        {
            "review_text": "It all went smooth ... Till Qua 'Lon came out ... and then only I realize I was weak... But there's no turning back.....and hence there ends my exploration....  10/10 would die repeatedly for Qua'Lon",
            "review_score": "1"
        },
        {
            "review_text": "Very,very well done for a RPGmaker game,it is a bit easy but story is most i like,remind me on my childhood games on SNES :D Strongly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "LOVED This game. It took me about 8 hours to clear (I played in offline mode on my laptop for half of it). The combat is balanced and the characters are interesting and all useful in their own way. All characters are customizable from picking which skills they learn, to choosing equipment, to finally choosing which item/buff to apply to each piece of equipment. Building up my characters was the funnest part. The combat is interesting. It has a threat system where enemies focus on the party members doing the flashiest moves. Exploring the game world is vastly rewarding and encouraged. Not only do you find great gear, but you can find experience points by exploring. The game also has additional side content that I didnt complete in my 8 hour playthrough. This includes, a fighting arena, a side dungeon to explore, and finding a deck of cards that has been scattered across the land. My only complaint is that the weapon/armor crafting system in this game seems tacked on and forgettable. The items you can craft are limited and you usually have them by the time you can craft them anyway. Having said that, this is a game that no RPG fan should miss out on. 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Surprinsingly enjoyable. I did not think that I would like an rpgmaker game as much as this one, especially since it's turn-based. I got the game when it was free, so wait for a sale.  Awesome points:   There is a lot of freedom in this game. You can do whatever you want, whenever you want. There's crafting, an arena, collectables and tons of places to explore.   The story is pretty well written. The characters were memorable. Their individual storylines were awesome to read and wove into the main story really well. (Personally, Alda's is my favourite storyline. Especially the end.)   It plays a little like a visual novel. With fighting and exploring. Not bad. Lots of reading.   Downsides include:   Lack of map, extremely easy to get lost. I would love to have a minimap or something to show locations.    Very little tooltips. Though, that may be an upside as well? It takes a bit of experimenting and trial &amp; error to work out exactly what's going on in the game.   Mouse interaction was not smooth. It was difficult to navigate the inventory. Mouse control over the menus was pretty clunky as well.   Quest menu sucked. Sometimes the writing at the end would be cut off and it was impossible to read the last couple of steps. Sometimes I forgot who I had to return my sidequest to, as the place wasn't stated. Ended up running around for half an hour talking to everyone I came across.   If you can deal with the downsides, the game is enjoyable and worth the time.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished it.  Good gameplay. Good story. Good music.   Plus Alda is hot.",
            "review_score": "1"
        },
        {
            "review_text": "The story line is quite cliche, but i somehow really loved the game. If you ever enjoyed playing one of those gameboy pokemon games, you should really try this out.",
            "review_score": "1"
        },
        {
            "review_text": "Really loved playing this game, wonderfull story that just dazzles you and make you want to know more and more, not to mention the characters  ",
            "review_score": "1"
        },
        {
            "review_text": "Decently immersive storyline, scaling battle difficulty to suit your liking, and people with wings. Just what I look for in an RPG :)",
            "review_score": "1"
        },
        {
            "review_text": "This is my First Original RPGMaker games on Steam.  Well, i found a little non sense bug. But, the story seems nice with it's back story.  i found having fun playing this games, the story between human, skyborn, and half-breed makes a conflict and recommended to RPG Fan",
            "review_score": "1"
        },
        {
            "review_text": "  An amazing story with great characters! Somewhat challenging for newbies to the RPG genre, but it isn't all on the gameplay, the story is the main drive and what a ride!",
            "review_score": "1"
        },
        {
            "review_text": "Skyborn is a fun jrpg. It is easy to pick up and play. Downside- it is kinda short, and very linear.",
            "review_score": "1"
        },
        {
            "review_text": "great game :)",
            "review_score": "1"
        },
        {
            "review_text": "-I just got finished playing Skyborn. Its a good, simple, game with a easy to follow story line and simple battle mecahnics. This is a RPG game for people who cant invest a ton of time into long games anymore but still want to play RPGs, It will take you about 9-11hrs to finish. -The only complaint I have about this game is the tiles that make up the terrain, in a few areas of the game, get kinda confusing. In 2 or 3 areas I was having a hard time telling where I was allowed to walk and where I wasn't. -I think retail on this game is $15 right now, I paid MUCH less, but In my opinion I believe it's worth about $8.00, maybe $10 at most",
            "review_score": "1"
        },
        {
            "review_text": "Good RPG! If you like steampunk games, give it a try! The story is good and it will remind you of the golden SNES era.  It took me between 4 and 6 hours to finish the game.",
            "review_score": "1"
        },
        {
            "review_text": "If you like old school turn based RPGs you'll like this game. It has a nice compact story with reasonable twists and surprises. Combat is solid, multiple levels of difficulty, enemies don't respawn so there's no grinding nor any need to grind. Use your money, equipment, and augments wisely and you'll be able to overcome any challenges in the game.",
            "review_score": "1"
        },
        {
            "review_text": "Very well done indie RPG. Favorite part is the music though! Love it.",
            "review_score": "1"
        }
    ]
}