{
    "app_id": 278530,
    "name": "3 Stars of Destiny",
    "release_date": "2014-03-28",
    "developer": [
        "Aldorlea Games"
    ],
    "publisher": [
        "Degica"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "RPGMaker",
        "Indie"
    ],
    "achievements": 50,
    "positive_ratings": 110,
    "negative_ratings": 81,
    "price": 10.99,
    "description": "In this extensive old-school RPG, explore countless unique places, defeat tons of enemies and complete richly developed quests. The game features addictive gameplay and an adventure worth about 40H of playtime.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/278530/header.jpg?t=1447360368",
    "minimum_requirements": "Минимальные: ОС: Windows XP/Windows Vista/Windows 7/8 Процессор: 1.6 GHz Оперативная память: 128 MB ОЗУ Видеокарта: DirectX 9.0 Compatible DirectX: Версии 9.0 Место на диске: 100 MB Звуковая карта: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I am really enjoying 3 Stars of Destiny. If you dont like RPGMaker Games then this isn't for you. Personally I find the full maneuverablity with the mouse, story and graphics more appealing compared to older JRPG titles which can be cumbersome with their controls (except for Kemco on IOS). It does take about a good 3 hours to get into the meat of the story and battles and I personally found it rewarding onwards from the Mt Zulle Trials onwards.  The fact that you can choose what mode (Casual to Hard) and the Encounter Rate means that you can level up and play according to your style and preferences (I prefer Casual and a Normal Encounter Rate).   The characters are younger and this is relected in the storyline which I found has an innocence and humorous/playful tone. The game is massive in scope and it is the patient gamer who is rewarded. There are many secret rooms and items scattered about. Rush at your peril. Some of these are really great items, weapons, armour, stat boosts, money and quest items which can make a big difference to the game. Explore every nook and cranny.  If you are sometimes impatient like me there are many tips and walkthroughs available on the Aldorlea website. An easy way to switch between the game and a webpage is Alt + Tab.  I still have a long way to go but am loving playing this again and highly recommend if you are after a fun, entertaining and great value RPG.",
            "review_score": "1"
        },
        {
            "review_text": "Only 2 hours in, and I'm in love. The characters really shine when in combat, as well as out side. Beginning game is a bit slow, but the amount of fun I've had is unmatched. 3 Stars of Destiny is worth it's small price tag right now, but it is also worth the 15 normally. Witty dialouge and fun combat with an interactable world, make this one of the funnest (I don't care if it's a word or not) RPG's I've played in a while!",
            "review_score": "1"
        },
        {
            "review_text": "I met the heroine in her bikini.",
            "review_score": "1"
        },
        {
            "review_text": "RPGMaker style game with snowmen feat. a character named Indy Jones.  Sometimes it's a little rough on the eyes, but I guess every now and then so are you.",
            "review_score": "1"
        },
        {
            "review_text": "Havent played yet, but received in a bundle. Cheap!",
            "review_score": "1"
        },
        {
            "review_text": "Do you remember the olden days of Final Fantasy, Dragon Quest and what not ? This game looks like it would be the same, but do not be deceived, it is not. I tried to give it a chance, but the dreadful characters, the nonsensical way of doing things, the constant 'poisoned/tired' cycle, the fact that you do not heal up when levelling up (wasn't that a thing once ?) and the way your characters express emotions in conversations (*chuckles* ? Could you not just have drawn a different portrait to show the emotional state of the one talking ? And while I am mentioning portraits..why do they look so weird ?) are quite off-putting.  I've spent 3 hours in the game and this is what I experienced story-wise in wall of text form :  Intro : Some God gets summoned to the home of a witch. She tells him that there are 3 stars and he should suck out their bodily powers. The God is not convinced, but the witch throws out some valid arguments and he realizes, that sucking their bodily powers out is probably a good thing to do. He then kills the witch, but *chuckles* had forgotten to ask the witch who the stars were. That's why he's gonna create some sort of trap to catch them. End of Intro.     You are a guy with a serious attitude problem and have to bring some stuff to your parents. You meet an elven girl in front of your parents house, which leads to a conversation in which you express your dislike for her for no particular reason.  She then vanishes, you deliver the goods and decide to go look for her. You find her in a bathing suit and argue with her some more. You get attacked by the pond spirit. The elven girl helps you defeat the evil pond queen, which apparently was mad, because you saw the elven girl in her bathing suit. The elven girl vanishes again. You are going home.  Your chameleon pet is missing and you're off to find it. You do find it and fight elves,who were apparently also mad that you saw the elven girl in her bathing suit. The elven girl helps you out and vanishes after some more arguing, but she is telling you to meet her in some cave.  You now know that she is your neighbour or something and you ask people where that cave is. You go to that cave. You meet her in the cave in a bathing suit, you argue with her. You fight a dragon with her. She vanishes again after more arguing.  You learn about some sort of trial to get enrolled in some sort of magical school for which you need a partner. You are called to visit your parents, who make you team up with the elven girl for that said trial. You both argue.  You are off to the trial, flipping lots of switches and meeting a living flame, which constantly says PEEKABOO. You kill a ghost. You let the girl touch the crystal, because your guy does not like pink. You finish the trial.  You have to duel 2 other guys to win the trial for good. You are the winner.  You are supposed to be taken on some sort of convoy to the school town, but your hero decides that he'd rather walk there on foot all by himself for no particular reason. You and the elf argue.  You are off to walk to the town, being pursued by the guards who were gonna escort you to the town, which you then proceed to kill. You narrowly escape, despite having killed them (at least I did, since they kept bumping into me over and over in an endless cycle of combat until they were gone for good) and the girl breaks her leg. You argue.  You break into a witch hut and acquire something to help the girl's leg. You are being surprised by the witch, who is understandibly unhappy that someone broke into her hut. You kill the witch with no remorse. You help the girl out and there's more stupid banter.    I quit the game.  Now if any of that tickled your fancy, then go ahead, you will probably have fun in a grindy, weird way just like I put up with it for a while. But eventually you will realize, that matters do not seem to improve at all and you begin to question, why you're not playing one of your other 100 games instead. Or even one of the old SNES rpgs. So many choices, why would you go for this ? WHY ?",
            "review_score": "-1"
        },
        {
            "review_text": "It's pretty hard to find words for this game..   I am playing on normal with normal enemy counter.  For the first hours I was running from one point to another .. and back again. And what for? To have a 1 minute talk with a party member where we decide to go back to the place we just came from. Fact is you have to run around excessively most of the time. An on top of that - even with normal enemy counter you get so many fights, it starts bugging you more and more.   It's definitely what it sounds like. Boring and awfully tedious.  You don't have much money to buy stuff and if you want to heal yourself at a bunny safepoint (which can be pretty useful), it costs you half your money. Every. Damn. Time. Just why? Good point is: there is much stuff lying on the floor waiting to get picked up.  While running around, it just doesn't feel like there is any (good) story behind that's worth playing. I'm missing something here. I couldn't find any depth and the first hours seem to be a long introduction to blunt characters.   Running around with stupid reasons and not-so-good dialogues would be half as bad if there was any good mapping. Most of the plants and stones on the ground are just there to block you. You can't cross them and have to run all around it to get somewhere. And that's another point where you get annoyed by this horrendous amount of fights.   Also there doesn't seem to be a good balancing, I am overpowered right from the start and I quickly found a secret room with an op weapon. So I am twice op and those damn things would die even faster. If they wouldn't die after one hit anyway.    What I hate most? Sometimes you have a choice what you want to do. If you say no you can't change your mind and have to reload an old safe game. If you say yes, you can't leave the dungeon until it's done. If you do (because you need potions and can't kill that overdone boss e.g.), you automatically abandon your quest and can't proceed. There goes your (possible) reward. Bye-bye!     I'll give it a try to see if it gets any better. I get my hopes up.",
            "review_score": "-1"
        },
        {
            "review_text": "Contains tiny spoilers:          YouTube™ Video:  tl;dw - 3 Stars of Destiny&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "Played for 7 hours and got stuck in an area in the swamps. The game is so-so. Story is kinda complicated and I didn't finished the games so I don't know if they made the story untagled at the end of game.  The enemies aren't that hard to kill, but bosses... God damn bosses are way too OP and are 20 lvls above you! I was stucked in that menchoned swamp, when I got stuck on him. I can't go outside the tomb, can't resuply can't kill boss. Spent 3 hours farming trying to kill boss, but no way. He hits hard, summons too many minions, has too big restitsance and has waaay to much hp. 15e for this game is like slpa in the face. Save money for better RPGM games.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring and poorly made.",
            "review_score": "-1"
        }
    ]
}