{
    "app_id": 278620,
    "name": "TinyKeep",
    "release_date": "2014-09-29",
    "developer": [
        "Phigames"
    ],
    "publisher": [
        "Digital Tribe"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "Indie",
        "Adventure"
    ],
    "achievements": 36,
    "positive_ratings": 260,
    "negative_ratings": 127,
    "price": 7.19,
    "description": "TinyKeep, a top-down procedurally generated dungeon escape game with permadeath - you die and it's game over. Master the frantic physics-based combat, lure enemies into traps or make them fight each other for dominance. There are many ways to survive in TinyKeep!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/278620/header.jpg?t=1447360372",
    "minimum_requirements": "Минимальные: ОС: Windows 7 Процессор: Core 2 Duo Оперативная память: 2 GB ОЗУ Видеокарта: SM3 512MB VRAM DirectX: Версии 9.0 Место на диске: 1 GB",
    "recommended_requirements": "Рекомендованные: ОС: Windows 7 Процессор: Core i3 Оперативная память: 4 GB ОЗУ Видеокарта: SM4 1GB VRAM DirectX: Версии 9.0 Место на диске: 2 GB",
    "reviews": [
        {
            "review_text": "TinyKeep is a (very) casual roguelike based, in part, around speed-running a scripted sequence of dungeon levels.  After completing the game you unlock an enhanced difficulty mode. Hardcore Steam achievements presumably add some additional, longer term play value. &nbsp; The fact that this plays better as a speed-running game rather than a more traditional roguelike is obscured by the campaign scripting, which is written in a way that implies more story than is actually the case. Ultimately, the dialog is simply an excuse to provide some light direction to point the player towards what they need to do next. &nbsp; Room layouts within a level are procedurally generated. The rest of the game is fully scripted, including the sequence of levels (including dungeon graphics and type of monster), event triggers and (very light) mini-puzzles. &nbsp; There's no direct character leveling or stats, however there are altars scattered around which give you random, permanent boosts which accumulate, and therefore have the effect of making your character more powerful over time. As you might expect, some boosts are more powerful than others, meaning that the luck of the draw can play a part in the success of your run. &nbsp; There is no inventory system and no loot, other than picking up a sword and shield on the first level. The sword and shield are not in your starting room and the game can be a bit confusing here as you can't damage the guards until you get the sword, and it turns out that you need to do a crazy sprint to find these while dodging the guards, setting the tone for the rest of the game, although this is not explained. &nbsp; It is not possible to save your game , if you need to turn off your computer half way through you'll be starting again from scratch next time . (As of patch v1.2 you can, however, quit the game in the middle of a run and pick up from the start of your most recent level next time you play. Your save is still wiped, however, if you die.) &nbsp; The game plays best when you sprint around the levels as it can feel quite slow if you're just wandering. Playing the game as a speed-run, however, creates a nice flow and manageable craziness that does effectively get the adrenalin flowing. &nbsp; Combat is simple - attack with sword or block with the shield. The dev has suggested that timing hits is worthwhile, but I've not had any trouble just whacking away. Blocking seems kind of useless as successfully landing a hit creates a knock back that gives you enough time to launch the next attack. When mobbed there's even less incentive to block.  To add complexity to play, there are a number of ways to use the environment to your advantage, for example traps effect both you and the monsters, meaning you can kite monsters to their deaths, and fire pits can be tipped over to set adversaries on fire. Monster types will also sometimes fight each other. &nbsp; The foundation of the game is incredibly solid. The graphics are evocative, gameplay is smooth, and I've found no noticeable bugs. &nbsp; To my mind, unfortunately, the game suffers from a noticeable lack of variety. Each run the levels are basically the same, and the lack of inventory, drops or emergent events leaves no great incentive to explore. &nbsp; This is a shame, as a ton of additional unscripted content would give the game a lot of potential staying power, particularly as a quick diversion.  As things stand, however, I've bounced off the game in less than three hours, and I suspect most others will find the same. There's simply not enough here to justify the investment.  Considering an alternative? I can highly recommend  Full Mojo Rampage  instead.",
            "review_score": "-1"
        },
        {
            "review_text": "A little tough for an old timer gamer. but fun! the graphics are cute / good on the eye. Love the thud as my sword makes contact with my victim.  The procedurally generated dungeons add to the game so you don't get fed up of running the same level easily.  Lots of nice touches. I get a bit annoyed with getting stuck on dead bodies but i also enjoy seeing the end result of my hack and slash!  Its so cute, and so charming - i love it!",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, unimpressed. I found the Graphics, look and feel all met the idea they designers were looking for.  One of my biggest gripes is that the level design can create some terrible maps. Such as there being to many walls to see properly or corridors you cant get to becasue two corners of two other rooms block your way.  'Feeling overwhelmed? Run away!' forget it, becasue there are some Boss monsters that can run faster than your character sprinting.",
            "review_score": "-1"
        },
        {
            "review_text": "This game falls on the spectrum somewhere between a classic roguelike and a fast-paced FPS game like Serious Sam. The core game is very solid, with attractive graphics, fast-paced gameplay that's just challenging enough to keep it interesting, traps and monster AI just complex enough to be both dangerous and useful, a pleasant soundtrack and engaging voice acting.   What it isn't is a traditional RPG roguelike with levels and armor and gear and so forth. Instead, as befits a dungeon-escape storyline, it's basically a speed run challenge -- how far can you run before one of the Dungeon's terrors catches and kills you.   As such, therefore, and in keeping with classic roguelikes, the game is fairly challenging, there is permadeath, and there is *not* a save feature.There are some limited loot mechanics (kill monsters, get coins, dump coins in shrines for randomized bonuses) but character advancement is a relatively small part of the game compared to other roguelikes. If you're looking for a more traditional RPG experience, this game probably won't satisfy you. If you're the sort of person who liked Hardcore mode speed runs in Diablo, though, this might be right up your alley.   I've had a lot more fun with this than I thought I would. At first it was *very* frustrating to play -- it took me a while to wrap my head around the permadeath -- but the random elements keep the gameplay fresh and overall it's just really engaging. It probably isn't for everyone, but it's great at being what it is.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun game which requires quick thinking, reactions and a touch of dungeon maze memory. Some good humour and pretty straighforward controls, easier with a controller I found.",
            "review_score": "1"
        },
        {
            "review_text": "An astounding game with very detailed and intricate designs. beautiful game play and character design love it!",
            "review_score": "1"
        },
        {
            "review_text": "fun, but way too many objects to get stuck on. also the camera movement gives me a headache.",
            "review_score": "1"
        },
        {
            "review_text": "Tho i find this game quite easy, i've already completed the normal mode within 2 hours after i bough the game i surley recommend it.  It's very easy to get into. it's easy on the eye. it doesn't really require much concentration.  so; if you have 13 bucks to just throw somewhere for abit of fun fun fun, this is where you should throw them!",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually really neat, so far I haven't escaped but I'm really enjoying it.",
            "review_score": "1"
        },
        {
            "review_text": "Very Fun game! Casual experience traversing the dungeons with fun monsters and interesting and 'useful' traps!   I see it's a new game, so content is a little slim... But give the Dev some time, it looks like they have LOTS planned... ",
            "review_score": "1"
        },
        {
            "review_text": "This game is good but the cheap blows are so real. I played for 40 minutes and did a ten minute boss fight. And i got killed by a stupid nuke creature.  but. This is a great game because once you learn what to do or not to do, the game becomes somewhat easy. it is lacking things from most roguelike games but its still really fun.",
            "review_score": "1"
        },
        {
            "review_text": "An addictively quirky dungeon crawler that makes you feel badass beating up cute, but ugly enemies! It doesn't feature specific classes but in doing so makes each run feel unique by having the ability to buy random upgrades each level, so your play style can change per run. Also has an engaging soundtrack with music that suits each level environment and doesn't disturb the feel and excitement you get from leading pea brained enemies into traps.  Controls are simple and easy to learn, as well as having controller support for players less comfortable with mouse (but lets be honest here, you wouldn't be using steam if you weren't capable of playing games using a mouse and keyboard to an extent?)   My best run highlight: &gt; activate skeleton event thing for a level &gt; watched giant rock dude beat up giant skeleton dude &gt; go to next level to find a 'real' boss &gt; run around in fear before reking the boss who kept running away &gt; jump around like a champ with all my gold  &gt; open gate to get to the next level &gt; suprise demon suicide bomber appears and kills me. &gt; *slow clap to devs for being evil in the right ways* ",
            "review_score": "1"
        },
        {
            "review_text": "Tinykeep is a topdown hack and slash Rouge like, featuring a lot of physics elements, traps and monster factions that battle eachother. While that sentence makes this sound like a must buy, it has some issues preventing it from reaching it's full potential.   1: The phyiscs objects keeps getting in the way, and at some point the massive piles of bodies just make it a sludge getting through rooms. I had to walk to the farthest corner to despawn the ragdolls during one level, because the corpses was lagging my game to a crawl. Floor traps sometimes break and fall off, i'm not certain if that is a bug or a feature. 2: The maps are confusing, and the lack of locked rotation meant i got lost at many points. The map screens paint function makes reading the map quite difficult. The 3D enviorments sometimes gets in the way of seeing the character and the monsters he is fighting. 3: The game is structured like a rougelike, with random level generation, random monster placement, and semi random powerups. However, the structure of the game dosen't really support this: There is nothing to do on a second run. All rooms are functionally identical, either containing traps, enemies or not. There are no special rooms, or random powerups to find, and very little reward for exploring but more enemies that might yield gold. You pay for the powerups using coins, but these are plain, and unintresting. Faster movement when your holding a shield, running backwards faster, jumping higher, increased damage towards certain types of enemies. Nothing that will change the way you do your run, and most runs you will simply have most powerups at the end anyway.     But having it a rougelike means no save function, which means that if you die you have to start over. Which is fine, except 90% of the game is very very easy! There is really no problem defeating the first three 'bosses', they are no harder then regular enemies. The last boss however, can basically kill you in a 2-3 hits, especially when your acid sword hits you both, making you slow and draining your health. If you die then, you have to play through 90% of the content.  Which i just did.  'Fun.'  You could also jump ahead at try to defeat him with the starting sword and none of your powerups. Which kinda defeats the point of the rougelike anyway. Why not just have a save system?  Still, worth the 3 euros, fun if flawed little experience.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game.",
            "review_score": "1"
        },
        {
            "review_text": "This has so much potential to be brilliant but it falls just short of ascending. The Characters have a Nintendo quality that is familiar and charming. The hack/slash block jump/run are fairly standard controls. They get more responsive as the game progresses but at no point do they evolve into more complicated moves. You're stuck just hacking away... it gets a bit repetitive and at higher levels, outright boring.  I picked it up for $2.50. For what it is, it's brilliant fun. Levels 1-4 are fairly straight foward, The monsters don't vary too much after that- the bosses are kinda disappointing in that they behave just as regular monsters do- come at you swinging wildly.   _______________  Now for what it could be, that's a whole different story. Add a fighter class with a great axe, a wizard class with a staff, an Elven thief with a bow and a viking Princess with a spear and make it all multiplayer and we'd have the Gauntlet we wanted instead of the ♥♥♥♥♥♥♥t gauntlet we got. I love the monster gates tearing open and streams of enemies attacking both other enemies and the player- it adds a great deal to the environment when you can sieze the opportunity and wait till the weaker baddies weaken the tougher baddies. The four icons lined up slaughtering a horde of fire breathers would be tons of fun...  But we didn't get any of that. We got a single player Gauntlet. It's fun. It doesn't take a great deal of commitment. Doesn't demand a great deal of attention- it just clocks time. It's not disappointing at $2 bucks- I'm not walking away feeling cheated- but after seeing what it is and what it could have been,.. I'm left wanting the later.  ",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the most okay game i've ever played.  It's fun every once in a while., but doesn't keep you enthralled for too long.  At full price, don't get it. However if it is on sale for like 5 dollars or so, why not?",
            "review_score": "1"
        },
        {
            "review_text": "TinyKeep is not at all a Roguelike game despite what the developers and others might try to convince you, in reality TinyKeep is a straightfoward action game with RNG elements. That's it.  So let me explain by TinyKeep not qualifying as a roguelike game, it only has procedural generation and permanent death that can even barely and I mean barely qualify itself as a roguelike. The reason for this is simple: Permanent Death can be removed from the game once a certain item is obtained which removes a huge staple of the roguelike genre. Secondly procedural generation means jack in this game. Yes the dungeons are 'randomized' but if they always consist of the same things for each level, in my opinion it should not count as procedural generation.  Now let me explain why it should not count as Procedural Level Generation. In the Binding of Isaac as a popular example, each floor has a semi-random amount of rooms with random enemies, a random boss, a treasure room with a random item, and two secret rooms for the bare minimum. The only floors that stay somewhat consistent are the last two floors along with the floor for Mom's Heart.  In TinyKeep the first level will always involve Floor 1 - Prison, find Sword/Shield, only Archers/Brawlers with 1 Treasure Chest Floor 2 - Prison, Boss at the end once you reach the door note with 1 treasure chest and 1 throne Floor 3 - Prison unlock the 3 colored doors, unleash the skeletons, go to door and beat the big skeleton Floor 4 - Dodge stone guy and hit the end everyone is orcs Floor 5 - Orcs with 2 stone guys, 3 colored doors, unleash skeletons Floor 6 - Skeleton Boss, super short with nothing in it Floor 7 - Flames n demons have to have fire proof perk Floor 8 - Flames n demons w/boss Seriously I can go on. Every floor is the same. I can't qualify this game for being Procedurally generated if every floor has the exact same qualities barely moved around. TinyKeep also has a whopping total of 6 enemy types (I'm not counting the fact that there's a goblin/skeleton/human archer as three different types, let's face it they're all reskinned versions of the same thing). And you know what floors you face which.  I don't believe only having a floor layout randomizer should ever qualify as a roguelike, which is all that TinyKeep has.  At any rate the game suffers from far more than the two elements I listed above. The only 'power up' of sorts in the game involves buying blessings for either 15g, 7 - 100g, 1 - 500g, and 2 - 750g. (The latter two are endgame). The 15g blessings can be bought up to at least 15 times in a row, at a complete RNG chance as to which of many skills it can give you will power up. The 100g blessings can only be bought one time each and are easily the most needed blessings that every player needs, and the last three (500g/750g) are for secret/broken powers. Here's the problem with these blessings. Most of them are worthless at the 15g level,  -There is one for running faster which has diminishing returns because you only need to move so fast -Multistrike which is worthless past level 2-3 -Serrated Edge which is an RNG chance of doing more damage -Arrows to Ether which is an RNG chance to dodge an arrow -Able to run backwards faster -Run with a shield faster Out of all of these the only TWO skills that aren't complete garbage are the Tank skill and the Lightning Reflexes skill. None of the other skills are even worth leveling up but since it's RNG it'll probably happen if you want it or not. Also RNG only exists to screw you over in this game.  -Chests can be empty for no reason -No vase spawns in a level -RNG for any of the 15g blessings  Another problem with the game is the inclusion of a physics system of sorts, where walls will blow out throwing blocks on the floor, and enemies bodies will become obstacles when you kill them. It just gets frustrating especially in the latter levels of the game with the amount of clutter everywhere. Especially when the giant skeleton bodies seem to never go away getting me stuck numerous times.  Finally one of the last problems is that 'farming' exists which essentially completely breaks the game. Essentially levels 1-4 are the scariest part of the game because it's so hard to get your hands on money, at that point in the game it's possible to only have around 300 coins. Once you hit level 5 you can get every single 100g power up and level up most of the 15g ones to 10 with ease. This is because the skeleton invasion never ends and you can infinitely farm them for however long you please.  Overall the game acts like I'm having more fun than anyone could ever possibly have. It's really not fun to play through this game more than a single time and the game expects you to play through multiple times. The game is downright confusing with some of the 'secrets' such as the cauldron which is completely ignored until the loop begins. This makes no sense because there is another shrine which was kept out of the early levels to not confuse beginning players. Why this was included is beyond the scope of my knowledge. If this game had done the blessings differently I might not have such a problem with it, perhaps make them like Isaac to where they are powerups you can find throughout the level. Maybe even make it to where you could CHOOSE which one you wanted instead of rolling the dice each time.  The game should also stop being so persnickity about secrets. It's cute that you want to include secrets, and I think most games should do more of them BUT it's stupid that the second half of the game is locked behind a 'secret' of sorts and I know most people who have reviewed the game probably don't even realize it exists.  The bigger problem with that is that the second-half of the game is complete garbage. Again too much clutter and ♥♥♥♥ flying around everywhere making progress a chore. Furthermore it's even sillier that if you make it to the 2nd half of the game and die, you are forced to replay through the first half just to get back to the second half. Secrets can be done reasonably without being such an annoyance. The demon secret in this game for example was a good choice. The acid cauldron on the other hand was a very poor choice.  All in all for 3$ on sale it ISN'T THAT BAD of a purchase. I just can't find any redeeming qualities to this game that feels like I could have played for free online. You will only get a few hours of playtime max (between 2-6 hours), and you'll probably not even want to finish out the game because of how frustratingly annoying it is.",
            "review_score": "-1"
        },
        {
            "review_text": "i think this roguelike is okay? you can have somewhat a character creation. have to buy skills, collect money, you are in a dungeon, escaped prisoner idea is nice but im not sure if it gets boring fast. music is nice, graphics are nice. Controls are okay. top down 3D view i give this 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game, guantlet with a little zelda feel.  It spikes in difficulty quick with some 'leaders' and is permadeath so that can be a bit annoying making it hard to advance without repeating things many times (like the good old frustrating days) just slightly different since its radomly generated. Fairly linear for upgrading anything too.   Good graphics, good gameplay and good price esp if you catch a sale tho, based on all that - 7/10",
            "review_score": "1"
        },
        {
            "review_text": "A great indie game with great gameplay and adventure. However, I do feel that the game needs more content and I get frusturated at some levels where there's simply too much mobs in one place. Its still a great adventure game nonetheless, I'd recommend it to any adventurer looking for a nice game to play. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "disspoiting and boring",
            "review_score": "-1"
        },
        {
            "review_text": "as not good as not bad...",
            "review_score": "-1"
        },
        {
            "review_text": "TinyKeep is an interesting game that I honestly really wanted to like. It has a cool art style, its gameplay is quick and full of action, and the controls are snappy. When I first started playing, I honestly thought I loved the game! Then, after awhile, I beat a couple levels, and realized I was SO BORED.  TinyKeep is a 'rogue-like' in that you have to make muliple runs through the dungeon/prison you are escaping, learning enemy types and traps, and honing skills that you will need to complete the game. The problem is, there isn't enough of those things for you to stay interested in playing and there aren't ANY permanent elements that carry over between plays (until you beat the game)!   Enemies/Traps There are only something like 10 enemies in the entire game, and a few of them play identically to each other. That being said, it gets worse because only a couple of those 10 enemies are actually any threat past your first play through! After only a few hours, you will easily defeat or avoid all enemies and really the only reason you might die is if you are trying to grab some tricky loot. The traps are exactly the same: ~10 different types, a few are nearly identical, and only 1-2 actually pose a threat.  Upgrades/Items There are NO items past the sword and shield you get in the beginning (I am NOT counting items you get after you beat the game). The main way you defend yourself is by buying abilities/buffs at shrines with gold you have collected. There are different level shrines and about 20 different buffs. The problem here is threefold: 1. the abilities/buffs do not improve the gameplay in any significant way, 2. the buffs are completey random, and 3. the buffs are not permanent through multiple play throughs. Problem number one is the biggest. A couple buffs give you special abilities, but overall, you will be playing this game exactly the same way in level 20 as you were in level 2. Most of the upgrades just beef up your character so you can take damage from enemies. Problem number 2 is very annoying, because buffs cost money and they are completely random, I have spent 300 coins to get the same one THREE times! Granted, some buffs stack, but the game should prioritize new upgrades with a higher probability when purchasing. Finally, problem 3 is actually no that big of a deal, since you can become OP by level 5 (out of 20) and never have a problem for the rest of the game.   What TinyKeep boils down to is grind. For the first few hours you will have genuine fun as you figure out the gameplay mechanics and storyline, but after that its the same experience over an over: attack monster, bait monster into trap, avoid easy trap, collect coins, buy repetitive upgrades, rinse, repeat...  Get it on sale...",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like this, and I tried, but the lack of environmental/enemy/gameplay variety, clunky controls, and general feel of the game put me off too much.  Another case for a 'maybe' recommendation option.",
            "review_score": "-1"
        },
        {
            "review_text": "concept is ok but the execution is janky",
            "review_score": "-1"
        },
        {
            "review_text": "Unresponsive, 'floaty' controls ruin the game for me.",
            "review_score": "-1"
        },
        {
            "review_text": "this is almost certainly one of the greatest adventure games i have ever played, i reccomend it to anyone who decides to read this review.",
            "review_score": "1"
        },
        {
            "review_text": "Quite Clunky. Low diversity. Turning awkward with camera.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is great. Easy enough once you understand what you're doing. The experienced player can get going quick and power up yet still hard enough to make you pay attention not to get cornered by baddies as you manuever.   My kids love watching me run the dungeon and bait enemies into traps with clever commentary. Or set myself on fire (once fireproof and strengthened) and hug the monsters or bump into them as I run by saying 'Tag you're it!' Or run up to the exploding demons and kiss them to start their detonation sequence before running away.  Have I beat the final level boss? No not yet. But that's OK. A full run to the end takes 90 minutes to 2 hours once you know what you're doing and you want all the powerups.  And yes, permadeath. Quit yer crying, grab your sword and get to work. ",
            "review_score": "1"
        },
        {
            "review_text": "Freaking awesome rouguelike. I love that the physics in this game add an element of comedy to the experience. Chaotic fun and challenging, I like to think of this as dark souls for people who just want a shourt burst of dungeoneering without all of the investment.",
            "review_score": "1"
        },
        {
            "review_text": "My Review for Tiny Keep shall be as short and sweet as possible.  This is a top-down style dungeon crawler. Its has many rougue-like elements, with perma-death and randomly-selected upgrades for your characters. In terms of how polished the game is, it could have been better in terms of physics and graphics, but besides that the game is as good as its gonna get.  In my travels (only about 2.5 hrs of play as of this review, but growing) i've found every part of tiny keep exciting and fun. I started as a weekling, found some lucky loot, and started slashing my way through hordes of enemies. On my third try, i made it all the wayt to the end boss, only to slip up once or twice and get mercilessly squashed. Thus, i had to start over. While thats a huge bummer and a solid 2 hours of my life i shall never get back, i had lots of fun playing and will definitley play again soon.  Overall, 8/10. Would be higher if there was a bit more to the game, (only about 20 5-15 minute levels). The Pros that give it this high score are: High Re-playability (unless you beat the game 100% on second try like i almost did. depends on the skill of the player) Fun Dungeon crawling interesting upgrade system Solid plot that got my head right in the game.  Highly recommend.",
            "review_score": "1"
        }
    ]
}