{
    "app_id": 278810,
    "name": "LA Cops",
    "release_date": "2015-03-13",
    "developer": [
        "Modern Dream"
    ],
    "publisher": [
        "Team17 Digital Ltd"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Action",
        "Strategy",
        "Indie"
    ],
    "achievements": 13,
    "positive_ratings": 81,
    "negative_ratings": 64,
    "price": 10.99,
    "description": "LA Cops is a fast, action packed 3D top down shooter set to a theme of 70s Cops in LA trying to do a tough job in a tough town.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/278810/header.jpg?t=1549535579",
    "minimum_requirements": "OS: Windows 7 Processor: i3 or equivalent Memory: 2 GB RAM Graphics: NVIDIA GeForce 9500 GT or equivalent Storage: 2 GB available space Sound Card: Windows Compatible Card",
    "recommended_requirements": "OS: Windows 8 Processor: i5 or equivalent Memory: 4 GB RAM Graphics: NVIDIA GeForce 9500 GT Storage: 2 GB available space Sound Card: Windows Compatible Card",
    "reviews": [
        {
            "review_text": "I really enjoyed LA cops. The action was smooth, the cut scenes are fantastic and I found the AI to be fine.  Not sure if this is due to a recent update but I didn't experience any of that have been mentioned in the negative reviews.  All in all I can recommend LA cops, especially if you like handlebar moustaches and shooting people in the face. ",
            "review_score": "1"
        },
        {
            "review_text": "it is a good game wish they were more levels to be played hopefuly in an upate they will add more also like the cop show kinda style there got going in the game.",
            "review_score": "1"
        },
        {
            "review_text": "I see a lot of negative reviews for this game, hell even the cynical brit himself gave it a slating during his wtf is section, but I think it's time I say what everyone is thinking; These people need to GIT GUD.  There is nothing wrong with this ♥♥♥♥ing intense fast paced donut scoffing simulator!  If you are dying all the time, level up, get some better guns, upgrade all your ♥♥♥♥ and see just how EASY normal mode is!  I've played through the majority of the game already I just have the last level to do, and at the time of writing this I've spent a mere 2.8 hours in this glorious game and yet people have spent longer than I in the game than I have and can't get past the first level?!  It's not that they can't, it's that they need to rethink their tactics, synergise their weapon choices and even use below the belt tactics to make their bust.  One example from total biscuits video was when he placed the AI partner in line with a door ready to shoot enemies as they come through, he leaves the partner in direct line with the doorway, therefore he will get gunned down because he is in a vulnerable position, now if he had been placed to the side of the door he would have less chance of being spotted and his cone of fire would be directed where it needs to be, with a Shotgun equipped this is lethal!   I'm sure there is plenty else people do wrong, but once you can pass level 1, replay it arresting 3 or 4 of the perps to get an A grade, that's 4 XP points, each tree is 20 points so you need to do a fair few runs to reach max level, but it's worth it because you will one shot most npcs on normal mode with a pistol.  I think this game is awesome  Soundtrack 5/5 Game play 4/5 Graphics 4/5 Storyline 3/5  It's a short game for sure, but I like the challenge of beating each level on increasing difficulty and maxing every characters stats. ",
            "review_score": "1"
        },
        {
            "review_text": "7/10",
            "review_score": "1"
        },
        {
            "review_text": "Your greatest enemy will be the controls.  The idea is great.. however... 1. Sometimes enemies will ignore a gunshot right next to them, while at other times a single shot will sent all opponents piling into the same room as you. 2. Enemies can shoot you from outside the screen and their range is far greater than that of your AI partner. 3. The view makes it hard to know when you've lined up a shot correctly, especially given the hectic pace of game-play.  4. The story excerpts are completely unrelated to the game-play or each other. 5. There are some clipping issues where you can shoot repeatedly and have your shots be absorbed into the corner you're hiding behind, while the opponent you are targeting takes the same shot and kills you instantly.",
            "review_score": "-1"
        },
        {
            "review_text": "Already loving this 2D isometric shooter!  The badass retro 70s visuals, wicked Sabotage soundtrack and dual-partner mechanic are fresh additions to this genre. Difficulty curve is similar to Hotline Miami, but rewarding all the same.  Definitely recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game but I have to disconnect my joystick to play because, the game thinks it's a controler and sends a message every five sec's to change to the controler. really annoying",
            "review_score": "1"
        },
        {
            "review_text": "Can I Get A REFUND?",
            "review_score": "-1"
        }
    ]
}