{
    "app_id": 27920,
    "name": "Booster Trooper",
    "release_date": "2010-04-23",
    "developer": [
        "DnS Development"
    ],
    "publisher": [
        "DnS Development"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 260,
    "positive_ratings": 91,
    "negative_ratings": 94,
    "price": 1.69,
    "description": "Booster Trooper is the future of multiplayer platform shooters. It provides tons of fun with its fast paced action and larger-than-life weapons. You can run or fly around the map, blasting your enemies to bits with bullets, rockets, grenades, magma and other weapons from your arsenal.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/27920/header.jpg?t=1478109080",
    "minimum_requirements": "OS: Windows XP Sp3, Windows Vista Sp2, Windows 7 Processor: 2 Ghz multicore or higher Memory: 2 GB or more Graphics: 512 MB, Shader model 3.0 or higher, NVIDIA 7800, ATI X1800 or better DirectX®: DirectX®: 9.0c Hard Drive: 800 MB available Sound: DirectX 9.0c compatible soundcard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Holy daaaayum. Booster Trooper. This game would be hella fun if there was an online community. The sixteen hours I have put into this has purely been single player.   It may not look much, but the side scrolling action arena that is on offer here is bloody fun. Fast paced, action packed style gameplay with a little bit of platforming involved. There is plenty of different weapons...but you are going to want to go with the mini-gun, my god, this weapon is siiiiiiiiick. I found myself getting kill streak after kill streak with this thing. The regular rifle is good, but jeez, I was actually shouting and jumping in my seat with enjoyment while playing.  Other reviews seem to slate Booster Trooper, but I reckon if you get a few of your friends playing it, you will have a blast.",
            "review_score": "1"
        },
        {
            "review_text": "Really entertaining multiplayer sidescrolling gun blasting mayhem! Except that there is no one playing it. If you can get your friends to play it with you, it's a blast. Does have a bot support too, but beating bots gets really boring, really quick.  You choose a main weapon, secondary weapon and a grenade you start with. Then you rampage across the map, blasting your guns, throwing grenades, collecting power-ups and defeating the lower beings. The screenshots pretty much tell the idea. Different maps and different guns call for different play styles. Use of jumps and the limited time of jetpacks can make you a very hard to hit target and a fast predator, or you stand your ground and give all you've got with your minigun that doesn't work in the air.",
            "review_score": "1"
        },
        {
            "review_text": "The game is pretty basic and generic, but it feels like a nice 16 bits era game ; it is worth it if you are into Smash Brothers kind of games and if you make sure you will have friends to play it with. Do get a bundle.",
            "review_score": "1"
        },
        {
            "review_text": "Heyyo, a neat little sidescroller jetpack-based multiplayer shooter. It's pretty fun to play with bots since there's not a lot of players.",
            "review_score": "1"
        },
        {
            "review_text": "Not as polishied as I expected, Virdict: Pass",
            "review_score": "-1"
        },
        {
            "review_text": "Well, yeah... This is, like people before me has said, a shameless copy of the old classic 'Soldat'. And I would be fine with that, if Booster Trooper would be as good as Soldat. But nopes! Booster Trooper is about as fun as slowly tearing your own skin off with a dull spoon. 10/10 would not play again.",
            "review_score": "-1"
        },
        {
            "review_text": "Hours of addicting gameplay for a very low price",
            "review_score": "1"
        },
        {
            "review_text": "payed for a 4 pack, does not open correctly for me.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a masterpeice at its best! It has the best heart warming story line and the most immersive gameplay I have ever seen and by putting the two together, makes a near perfect gaming experience. Also for your infomation, this game is the biggest pile of pig vomit I have ever played, don't bother getting it unless you have 59 pence to spare, you could buy a lollipop with that money.",
            "review_score": "-1"
        },
        {
            "review_text": "Multiplayer doesn't work. No reason to even try or buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is unplayable. Cannot play in single player or online. Have to alt f4 out once it locks itself in a loop.  Edit: After switching to death match from CTF I was able to play single player enough to unlock 100 achievements in a few hours.",
            "review_score": "-1"
        },
        {
            "review_text": "why would you waste good money on this, glad i got this crap as a gift",
            "review_score": "-1"
        },
        {
            "review_text": "Epic but MP-Server down",
            "review_score": "1"
        }
    ]
}