{
    "app_id": 27940,
    "name": "Dead Horde",
    "release_date": "2011-07-27",
    "developer": [
        "DnS Development"
    ],
    "publisher": [
        "DnS Development"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Zombies",
        "Indie"
    ],
    "achievements": 28,
    "positive_ratings": 206,
    "negative_ratings": 406,
    "price": 4.79,
    "description": "As a survivor of the mutant virus, make your way through the city and wipe out the hordes of flesh eating mutants. Teamwork is the key to survive the DEAD HORDE...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/27940/header.jpg?t=1447354462",
    "minimum_requirements": "OS: Windows XP Sp3, Windows Vista Sp2, Windows 7 Processor: Intel Core 2 duo 2.4Ghz or higher Memory: 2 GB RAM Graphics: Shader 3.0 or better,  NVIDIA 8800 GT 512MB RAM or better, ATI 3850HD 512Mb RAM or better DirectX®: DirectX 9.0c Hard Drive: 1 GB Space Free Sound: DirectX 9.0c compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "35%  I'm going to be honest with you. I sat down to write this review for Dead Horde the top down, run and gun shooter from DNS development, but I had a tough timeplaying this game for the 18 hours I put in to get 100% completion. Iit's not that the game has complex themes of survival that are hard to sum up or anything like that, it's just that it's such a boring paint by the numbers experience that I often had trouble remembering just what happened during my time with the game.  From blockbusters like Dead Rising and Left 4 Dead to indie darlings like I made a game with zomb1es 1n it!!!, there are a lot of zombie games on the market, and you're going to have a hard time finding one as bad as Dead Horde. It's predictable, has no personality and does nothing that the...excuse the term...hordes of zombie games has done before it.   Dead Horde places you as one of the lone survivors of a zombie apocalypse and your job; your only job is to shoot and blow up as many zombies as you can to survive. Sound familiar? Dead Horde employs a top down view that finds you holding down one button to shoot and another to move forward and that's it. Sound familiar? It should. It's all been done before in games like Zombie Apocalypse and I made a game with zomb1es 1n it!!!, but the key is that those games did something to inject the formula with a novel feeling. Zombie Apocalypse for example featured four player co-op (as opposed to 2 player here) and I made a game with zomb1es 1n it!!! was just plain silly, here we get none of that.  And there we have the key problem with Dead Horde. It's obvious that the developers have played the key zombie shooters of this generation and have lumped all of their key features into their game. For instance there's an almost carbon copy of Left 4 Dead's Boomer in the game. It's a pretty widely accepted fact in the gaming industry that the zombie shooter is a dated and stale genre and it's titles like these that offer absolutely no new ideas that are the perfect example of that.  Throughout Dead Horde you'll gain the option to upgrade weapons at certain points and while it's a cool addition, in reality it does nothing for the gameplay. All of the weapons feel the same and lead to the feeling of merely grinding through each section from beginning to end. There's no real reason to explore, and you'll find yourself holding down two buttons and moving in one straightforward direction (well, except when you'll have to back pedal from enemies). You know, it's funny - I never thought that the zombie apocalypse would be this boring.  If Dead Horde had a saving factor it would be the vehicle sections which do tend to offer a break from the monotony of the game. It's quite fun to mow down the undead in a jeep or utility truck - the first few times, but when it happens again and again, it loses its appeal quickly. It's also important to note that the vehicle controls never really feel as tight as they should, and they often feel like you can't get control no matter what you do.  You've already played Dead Horde, even if you've never touched the game - it's all of your favorite parts from all of your favorite zombie games, only here they aren't done as well and have no personality. Dead Horde is an obvious attempt to grab a piece of a large yet dwindling audience. There are a ton of great zombie shooters on the market; hell there are a lot of competent zombie shooters on the market, why choose this one?",
            "review_score": "-1"
        },
        {
            "review_text": "As a zombie fan craving for zombie games I would say Dead Horde is a huge disappointment. Not quite the Dead Nation that I was expecting! Maybe I was expecting too much... maybe not since Dead Nation is also an indie game...  Aside from the poor graphics and art style, my main concern with the game is the gameplay itself. The shooting kinda feels tedious as the weapons sound bland and have a low rate of fire. Also, killing bullet sponge zombies is just unsatisfying even when the weapons are upgraded to their fullest.  The most satisfying parts of the game are when you get the opportunity to drive armored vehicule as they allow you to take down hordes of zombies with a mounted machinegun. Unfortunately, the horde setup feels terribly uninspired as pack of zombies always appear after picking up ammo, money and health boxes laying on the ground.  Overall, Dead Horde offers no sense of danger and terror that would come with a zombie outbreak setup. The lack of work on the environment makes every level generic at best. Not to mention the poor storyline which give no sense of progression.  If you want to play this game because you can't play Dead Nation on PS3 then restrain yourself and do everything you can to get a hold on Dead Nation. I'm dead serious.  Rating : 4.0",
            "review_score": "-1"
        },
        {
            "review_text": "A cheap, glitchy, laggy, poorly made zombie survival game. However, I did find it somewhat enjoyable. Although, if it didn't have the co-op aspect, there wouldn't be much of a reason to play it. Only buy it if you got a buddy that's going to play it with you, or if it's on sale.  My Rating: 4.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "If your looking for bad game machanics, a poorly optimised game, Then this is for you!    The enemys look like, other games enemys, IE the bloat from Killing floor is in there, and other mini bosses.    Setting up the game it glitched many of times and said a buddy got hit by an enemy when they were far away, you can and will shoot your friends alot cause of the crappy camra system! But if your looking for ♥♥♥♥♥♥ starting weapons and the game getting harder and harder, being caught in the invisiable wall box, and over all hating your friends for when they do something stupid cause of the limitation of the game its self. Yeah, fun.. Would never ever recommend. xD sorry boys, i know you spent, one 'year' on the game, -from what the copy right says- but it just wasnt that great! another crappy version of a zombie game. If you've ever played it, you'd never want to again...",
            "review_score": "-1"
        },
        {
            "review_text": "Just play alien swarm.",
            "review_score": "-1"
        },
        {
            "review_text": "This garbage wouldn't even make a good free flash game. Awful mechanics, the zombies are faster than you, you can't stray too far from your partner or neither of you will be able to move, zombies take too many bullets to kill. This seems like someone's poor attempt at their first try at making a game.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible. Really all there is to say. Pretty upset i bought this game.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this pile of dead kittens.",
            "review_score": "-1"
        },
        {
            "review_text": "My review can be summed up in one word: 'Meh'. Not worth buying. Choppy and dull gameplay. If you need a top-down zombie shooter, buy Nation Red instead.  This does have co-op, but even that can't save it.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst result of impulsive spending in my life on a video game. I'd literally pay steam $10 just so they could remove this game from my library so I don't have to see it and become reminded of the bad choice I made.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad game.  Cruddy graphics and plot",
            "review_score": "-1"
        },
        {
            "review_text": "Dead Horde is a basic game. The game mechanics are flawed, the hordes often too large and a definitive focus on co-op make the game largely difficult for a single player. Weapons wise it has barely any to speak of and the complete bulletsponges that the zombies are make it difficult to actually recommend this game.  Play it with a friend if you're bored.",
            "review_score": "-1"
        },
        {
            "review_text": "Iam playing on Normal but i would recommend others play on easy because its a frustrating game, mostly becuase of the controlls are slugish the dude runs so slow and weapons dont really do much damage. (Before you ask: Yes i have upgraded weapons) The game was for me brutal even on NORMAL.  Gfx and sounds are ok but gameplay feels slugish and slow. The game Is playable in portions, probarly more fun with a friend than singleplayer.  Final note! I do enjoy it in portions but i still thinks they should have focused more on gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is like Zombie Shooter 1 &amp; 2 but without any of the charm or fun or delightful cheesiness.  Wait, I gotta reload. . .  Gameplay is repetitive; it's occasionally passable when it lets you drive one of the oversized vehicles. Seriously, the operable vehicles are out-of-proportion with the rest of the game.  Sound quality is poor. The soundtrack is almost laughable--they could have made it so bad it's good, but instead they chose to rarely use music at all. That being said, you know you're about to run backward shooting a bunch of zombies whenever trashy techno bleeds out of your speakers.  That's the core gameplay mechanic. Run backwards shooting, then turn around and keep running while you wait 7 seconds to reload. Please don't interrupt the reload animation until you are certain you have a fresh mag, or your avatar will have to start over. There's also a jump button, kind of. Red barrels explode when you shoot them. Eventually.  Still reloading. . .  There are different zombie types, but they don't change the gameplay the way they do in, say, any other zombie game.  None of the weapons are satisfying. You can upgrade the weapons, but I struggled to notice a difference in DPS or power. Yes, your assault rifle will shoot faster, but that just means you have to reload more often.  The game might be marginally improved if played via co-op, but it doesn't accomplish the twin-stick shooter feel that suits couch co-op so well. I never bothered, but I can imagine you get the benefit of seeing the reload animation twice as often, so BONUS!  Still reloading. . .",
            "review_score": "-1"
        },
        {
            "review_text": "Do I like this game? Yes. Would I pay $9.99 for it? No. But is it worth it on a Steam sale for $1 or $2? Hell yea! I grew up with shooters like this from Ikari Warriors, to Total Carnage and Smash TV, to console games like Reloaded so I know how games like this are supposed to be.   What I did I like about the game? I found the simplistic nature of the game very straightforward and basically a lot of fun. It doesn't really boast anything more than it promises other than casual Zombie shooting. I found it to actually be very similar in nature to games like Yet Another Zombie Defense. It's fun, with progressing difficulty and power ups. It's mindless fun entertainment that satisfies the need to kill zombies!!!  What I didn't like about the game? The horde music is repetitive and annoying at times so I just turned it down so it was barely audible so I could still hear when a large swam was attacking. There wasn't a lot of variety of zombie types and why must every game after L4D have a fat zombie that vomits?? The game while visually simplistic seems to give low to mid end video cards a hard time. I found that my ultrabook and XPS gaming laptop could barely play at medium/low settings while those same systems can play L4D2, CSGO and other graphically superior games without issue. I even found a bit of stutter on a 4GHz i7 with a EVGA 680SC that plays BF4, WatchDogs, and Crysis 3 on ULTRA high settings with no effort. The zombies are so fast that sometimes a large horde can overrun you even if you are running away and dive/rolling to get further distance.  It's a good game but to be a great game these glaring issues need to be resolved.",
            "review_score": "1"
        },
        {
            "review_text": "atleast it looks fun.... to bad it doesnt work!",
            "review_score": "-1"
        },
        {
            "review_text": "If you like top-over view zombie shooters, then this is the game for you. It's not bad for it's age. 3/5.",
            "review_score": "1"
        },
        {
            "review_text": "its a good co-op game, but in single player mode it sux.  3.5/5",
            "review_score": "1"
        },
        {
            "review_text": "Beyond bad,, PLEASE save you cash, watching grass grow is more exciting and has better options. The dev's should be spending more time on development and less on promotion.",
            "review_score": "-1"
        },
        {
            "review_text": "Single player mode is too hard for a fun, casual experience. No one plays this online. I am disappointed, not because it sucks, but because I wasted money on a game I can barely enjoy.",
            "review_score": "-1"
        },
        {
            "review_text": "control of satan,sound of satan, aim of SATAN, view of satan  create by satan but mickael bay lore friendly",
            "review_score": "-1"
        },
        {
            "review_text": "poorly made",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Generic zombie top down shooter... Uneventful, unimaginative and uninspiring... Should've been called 'UN'Dead Horde :P  I consider this one neutral, not good nor bad. ",
            "review_score": "1"
        },
        {
            "review_text": "Like skyrim with guns. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "this game is simply boring. decent gameplay, but boring in the long run  decend gfx, but boring in the long run decent sound, but boring in the long run  basically not a bad game, but you can have many many more interesting experiences  end of the review.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not get this game, It's the most bland setting you've seen with cookie cutter zombies and the same way to fight all of these zombies, This is a good example of what not to do in a top down",
            "review_score": "-1"
        },
        {
            "review_text": "This game has wasted enough of my time already that I can't be arsed to waste any more time writing about it.",
            "review_score": "-1"
        },
        {
            "review_text": "I've spent some very good Dark Nights with this game. Graphics and details are good enough for an immersion and objects moves when you hit them. It is very simple WSAD top down shooter with LMB or RMB weapon, with no perk but weapons upgrades to buy at checkpoints.  It is not NATION RED. Few weapons and bullets to choose wisely, but enough to fight with, and it's not Arenas, but corridor path type and slow pace with a heartbeat noise and rumbling of the threatening zombies around to come. When the time comes to action, hard rock music pushes you to make bad decisions. It's a more about feeling the atmosphere of an outbreak while hanging around in a wasted city with the fear like an adventure game, until ... you feel the heat whith quick close fights coming in strong waves.  The Cons : You can only save at checkpoints and it becomes hard at the end, so it can be boring to do again and again from the start some levels just to finish'em.  It's a good game if you know what you are buying. If you don't know, it's gonna be a .... 'S U R P R I S E ' !",
            "review_score": "1"
        },
        {
            "review_text": "needs an actal save feature spent about 30 mins or so made decent progress got a check point and i go to play again and im back at my old check point from the previous time i played other than that its a fun little game",
            "review_score": "1"
        },
        {
            "review_text": "Another game in my library that will never get finished or played again.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't even think it's nice game! it isn't ! It's worst game i bought. Boring, ugly animtions would be acceptable but perfeormance ? This game Have about 5-10 fps on my Computer while on lowest settings and it looks like game made in 90's....",
            "review_score": "-1"
        }
    ]
}