{
    "app_id": 279480,
    "name": "Abalone",
    "release_date": "2014-04-23",
    "developer": [
        "Games Up"
    ],
    "publisher": [
        "Asmodee Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Cross-Platform Multiplayer",
        "Steam Trading Cards",
        "Includes level editor"
    ],
    "genres": [
        "Casual",
        "Strategy"
    ],
    "tags": [
        "Board Game",
        "Strategy",
        "Casual"
    ],
    "achievements": 27,
    "positive_ratings": 56,
    "negative_ratings": 46,
    "price": 5.19,
    "description": "Discover the new look of the famous strategy game. The goal of this tabletop game is simple: push your opponent’s marbles off the board.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/279480/header.jpg?t=1542041219",
    "minimum_requirements": "OS: Windows XP Processor: Petium III 1gh or equivalent Memory: 256 MB RAM Graphics: 32 mo DirectX 9.0C compatible DirectX: Version 9.0c Storage: 25 MB available space",
    "recommended_requirements": "OS: Windows XP Processor: Petium IV 2ghz or equivalent Memory: 512 MB RAM Graphics: 128 Mo DirectX 9.0C compatible DirectX: Version 9.0c Storage: 25 MB available space",
    "reviews": [
        {
            "review_text": "I've always loved this board game! It's sort of an abstract sumo wrestler strategy thing where you're trying to lure opponents to the edge and use their momentum against them. The weight of the pieces as they clack along the track and against each other was just perfect.  This adaptation does a great job of capturing the physical feeling and the controls are just right. It's also nice that you can try out moves and undo them without the opponent seeing, rather than having to imagine the outcome and poker-face.  Matchmaking finds me an opponent within about 30 seconds and seems to do some amount of matching based on skill. Since lag and language isn't an issue it can easily pull from the worldwide pool. There's no chat features... I wish there was at least a selection of emoticons so I could congratulate good plays. After each match you can watch the full replay at fast speed. In about 10 games I've never seen anyone rage quit when I'm clearly at an advantage.  I haven't tried the single player vs AI or non-traditional layouts. But it has a nice interactive tutorial and several simple practice levels of increasing difficulty to teach the game.  My only complaints are the missing chat feature, a way to see the total online pool of players searching, and the stupid chime sound when you knock out a piece. Otherwise I'm really happy with this version.",
            "review_score": "1"
        },
        {
            "review_text": "There's not too much to review as this is the same as the board game. The only bad thing is that you have to click on the bottom right part of the screen to end your turn, you can not set a hotkey or anything. Also it takes like 4 hours for all the cards to drop, which is bad with broken achievements. I gave up playing to idle after 2 hours",
            "review_score": "1"
        },
        {
            "review_text": "Achievements are broken and developer does not care. Tried to contact on facebook, given a copy and paste answer, just don't bother",
            "review_score": "-1"
        },
        {
            "review_text": "An absolute steaming pile of shovelware. Launching the game brings up a black window. You have to change the resolution of your desktop to 1024x768 just to run the game.  Even then the display settings cannot be changed without the game crashing to desktop and not saving the settings.  Don't waste your time with a game that the developers clearly don't care about their customers, only the literal pennies it brought in.",
            "review_score": "-1"
        },
        {
            "review_text": "Fortunately I only blew a buck on this game through Bundle Stars, but it pretty clearly says XP only, and I'd have saved my buck if I had bothered to do the homework. It looks like an interesting abstract game, but I guess I'll never find out for sure unless it gets fixed. Disappointed with quality control all around here.",
            "review_score": "-1"
        }
    ]
}