{
    "app_id": 279560,
    "name": "Dracula 4 and  5 - Special Steam Edition",
    "release_date": "2014-05-29",
    "developer": [
        "Koalabs"
    ],
    "publisher": [
        "Microids"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 36,
    "negative_ratings": 18,
    "price": 5.59,
    "description": "A cargo ship carrying a valuable collection of artwork for the Metropolitan Museum of Art sinks. A few months later, one of the paintings resurfaces in Hungary. Will you be able to solve the mystery of the Dragon?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/279560/header.jpg?t=1498468021",
    "minimum_requirements": "OS: Windows XP,Vista,7,8 Processor: Intel Core 2 Duo 2Ghz Memory: 2 GB RAM Graphics: 3D Graphic Card - 512 Mb DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows XP,Vista,7,8 Processor: Intel Core 2 Duo 3Ghz Memory: 3 GB RAM Graphics: 3D Graphic Card - 1 Gb DirectX: Version 9.0c Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "Old school adventure game in a good way. great story and well calibrated difficulty even if I stuck in one or two tricky puzzles. Special congrats to the musics.",
            "review_score": "1"
        },
        {
            "review_text": "Before i start my review Dracula 4 and 5 acts just like 1, 2, and 3. It takes aways half of the puzzles making it easy for other people. The interface is nice but the old one, was way better!! If you never played 4 and 5 you could enjoy it but with all of the objects highlighting it just makes the game to easy. If you like dracula and its old roots just buy the series on gog website. Promise you, you will get the same game on how it comes on cd along with all the puzzles and video clips! Also its not as easy as this one!  PROS: - Two games for the price of one - Both games actually look okay graphically. - Nice interface - It has a nice soundtrack.  CONS: - Very bad storyline -Half the game is a missing with the puzzles just like all of the dracula games - Whilst graphically decent and some attention to detail the environments still feel somewhat empty - Puzzles are far too easy and tedious ",
            "review_score": "-1"
        }
    ]
}