{
    "app_id": 279500,
    "name": "Nicolas Eymerich - The Inquisitor - Book 1 : The Plague",
    "release_date": "2014-04-30",
    "developer": [
        "Ticonblu"
    ],
    "publisher": [
        "Microids Indie"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click"
    ],
    "achievements": 40,
    "positive_ratings": 43,
    "negative_ratings": 25,
    "price": 3.99,
    "description": "A will of steel, a heart of stone, intelligence as sharp as a knife, and wisdom as deep as oblivion. Play a remorseless character to live an original story inspired by the famous novel of Valerio Evangelisti.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/279500/header.jpg?t=1478598307",
    "minimum_requirements": "OS: Windows® XP/Vista/Seven/8 Processor: 2 Ghz Memory: 2 GB RAM Graphics: 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended) DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "What an obscure point&amp;click -game. The puzzles aren't really all that hard, but some actions have to be executed in a certain (sometimes cryptic) order, which makes it hard to complete the game without resorting to a walkthrough here and there. Navigation is fuzzy. The animations and characters are so unbelievably ugly they're almost endearing. There are so many easter eggs it's enfuriating - just as you think you finally found a pixel that's useful it's yet another dev team logo or a pointless Monkey Island reference.  On the plus side, the story is intriguing, the historical setting is okay, the way they pronounce medieval latin sounds convincing enough, and the protagonist is a bit of an a-hole to say the least, which is certainly something different. The dialogue is the best part of the game. I'm saying thumbs up, because my inner hipster is equally confused and delighted.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much nice adventure, allthrought I must say I did get nicely surprised monamastery and then disapointed in the end. Its pretty much impossible to finish it without manual since game itself doesnt help you much and sometimes blocks completely legit actions- which are required to proceed further anyways in later stages.  6,5/10",
            "review_score": "1"
        },
        {
            "review_text": "Another game where I wish steam would allow us a rating out of ten, rather than plain good/bad.  If this had been a whole game (as opposed to no 1 in a series) I'd be recommending it wholeheartedly. But on finishing the game you will be annoyed to discover that it is chapter 1 in a series of... I'm guessing..... at least 4 games.  I have just noticed chapter 2 has been released and so now there is hope that the plot might be completed. So fingers crossed, one day the whole game will be available. At that point I would recommend it. It is a dark, well written, story rich point and click with some complex characters and good puzzle design.  I can't recommend it now as lots of us are really annoyed at episodic games that never get finished.",
            "review_score": "-1"
        }
    ]
}