{
    "app_id": 279800,
    "name": "Grim Legends 2: Song of the Dark Swan",
    "release_date": "2015-03-26",
    "developer": [
        "Artifex Mundi"
    ],
    "publisher": [
        "Artifex Mundi"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Hidden Object",
        "Adventure",
        "Casual"
    ],
    "achievements": 29,
    "positive_ratings": 761,
    "negative_ratings": 27,
    "price": 6.99,
    "description": "Save the feuding kingdoms!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/279800/header.jpg?t=1530538887",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 1.5 GHz Memory: 512 MB RAM Graphics: 128 MB VRAM DirectX: Version 9.0 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 2 GHz Memory: 1 GB RAM Graphics: 256 MB VRAM DirectX: Version 9.0 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "On its own, this is a good hidden object game. Puzzles are detailed and beautiful, the storyline is well worked out and, while lifting on a well-known fairytale, still has twists. All screens are partially animated, making the world feel alive, and the cinematic scenes are the developer's best work yet.  Compared to its predecessor however, Grim Legends 2 disappoints a little. Voice acting is of a lesser quality, with even cases where the subtitles and voice dialogue don't match. Gameplay wise, there is only one kind of optional collectable to the previous games' two kinds, and you can no longer opt out of a hidden object puzzle for another kind of game: you now only have the option to use the hint button instead.  Fortunately both have standalone stories, so you won't necessarily need to buy '2' for story reasons.  Good is that the companion idea from the previous game returns, with now not just one critter helping you, but a new one per chapter. They are also used more, and feel more relevant to the story. There is also more variation in the puzzles this time than just combine A with B or slide puzzles, so there is less idea of repetition here. You also backtrack less than in Grim Legends 1.  Overall Grim Legends 2 is a polished game well worth playing, but I feel more could have been done with it to make it a proper sequel to the first game. Taking it as a standalone though, I can definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I bought Grim Legends 2: Song of the Dark Swan in a Bundle a while ago and I don't regret it.   Before we Start the Review let me say that you don't have to play the first one as both of the stories are not related somehow and the main character seems to be different as well.  Grim Legends 2: Song of the Dark Swan is an amazing Point &amp; Click / HO Game made by inhouse Artifex Mundi, the Artwork is great and the atmosphere amazing as always! However in this Title some of the Voice Actors where actually a bit awful to listen to.  This Game also comes with the Collectors Edition although it does not say so on Steam.  The Puzzles were mostly okay, challenging but not impossible. A few of the Puzzles however were absolutley stupidly difficult and I could not get passed them. But if you are good in Math you might find this hurd rather less annoying.  Although I had my difficutlies with this Game I still love its Story and its vibrant colourful Art Style.  I do recommend this game to people that are good in math or like mathmatic Puzzles. I also recommend this people to Achievement Hunters and to people that like HO / Point &amp; Click Games.",
            "review_score": "1"
        },
        {
            "review_text": "As a fan of hidden object games, especially point &amp; click adventure games from Artifex Mundi, this one is good! Great graphics and story. Also a fast travel map which is always a bonus! One of their best ones to date.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun hidden object game with puzzles and a fine little tale in a magic fantasy world.",
            "review_score": "1"
        },
        {
            "review_text": "I was not a big fan of the first Grim Legends. I was confused most of the game. This game seems to be a lot more focused and I also like the graphics a lot. They look like a painting. They are really very good looking. The sound is also another plus.   The puzzles again are sort of hit and for me mostly a miss. Most just are not a lot of fun. The Guardian footprint puzzle is a good case of what are they thinking? Match the footprint with the animal. Does anyone know what a dragoon foortprint would look like? I didnt. Skip.  The story is interesting and like I said before the gameplay is more focused. I do understand where to go and why I am going there. You get to have different helpers in this game including a bird and an otter and others. This is a great idea. I like it a lot more then say just having one animal. So great graphics, great sound and an interesting and cool story. This is a good hidden object game. A lot better in my opinion then Grim Legends 1.",
            "review_score": "1"
        },
        {
            "review_text": "This game was nowhere near as interesting as the first one. I got through it in 5hrs and the puzzles were ok, but I was disappointed with the story. Only buy when on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Second installment of the Grim Legends series and it takes a more lighthearted, fairy-tale approach than the first one. No demon wizards and transmogrified princes, but an evil queen-mother, a heroic kind king and a mute cursed queen. A story guided along by the solving of puzzles, some of which are kind of confusing and obtuse, but nothing insurmountable.",
            "review_score": "1"
        },
        {
            "review_text": "called it",
            "review_score": "1"
        },
        {
            "review_text": "Like most Hidden Object games from Artifex Mundi, GREAT, would recommend it to anyone",
            "review_score": "1"
        },
        {
            "review_text": "Very entertaining and relaxing.",
            "review_score": "1"
        },
        {
            "review_text": "High-quality art style and animations as well as Hidden Object scenes that aren't too difficult. A few of the puzzles gave me some grief, but otherwise they're fun with a bit of a challenge. This game was definitely not as long as the first installment, but still a good length, at least a few hours of entertainment with an alright plot. I like my HOG plot's to be a bit creepier/darker, but not necessarily scary, but aside from pushing the envelope further plot-wise for a series called, 'Grim Legends' it's an entertaining game, especially for the price.",
            "review_score": "1"
        },
        {
            "review_text": "Whilst not as good as Grim Legends, it's still a solid entry in this genre. Again, you play a female protagonist (this time the unnamed healer) as you amble through a retelling of a fairy tale, although given the choice of fairy tale this renders certain elements of the tale quite nonsensical.   Compared to the others by this developer I found this one relied a little too often on obscuring items with immovable objects which made them awkward to spot, but none of the puzzles, hidden object or otherwise, are too hard. The bonus chapter is set before the story but has no real relationship to it. I've gotta say I barely noticed the soundscapes, and where Grim Legends had a cute kitten, it felt like they'd tried to improve on that by offering you a variety of helpers throughout the game, but with such a short game and such infrequent use of the various companions it was hard to be too attached. Still they were all cute and the game is just fine. I suspect the it was the mangling of one of my favourite childhood tales that irked me slightly with this one.  Oh and the pronunciation of 'ginormous.'",
            "review_score": "1"
        },
        {
            "review_text": "Yes i highly recommend this game,very challanging and allot of fun plenty of twists and turns, i hope they bring out more games like these",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed the game's storyline, puzzles and beautiful art. It's hard to stop once your start playing so make sure you have a few hours free :)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good point&amp;click, artwork was amazing!!",
            "review_score": "1"
        },
        {
            "review_text": "As with the previous game I found it fun! A great version of a beloved fairytale! Some of the puzzles take me a little while but I really like the challenges. I will keep playing as long as Artifex Mundi keeps making them. Looking forward to the next Grim Legends.",
            "review_score": "1"
        },
        {
            "review_text": "This is not 'yes', neither 'no', maybe more 'umpfh!'. Good music, nice graphics, nice story, but a few poor dialogues, and already seen puzzles. Some are even ridicolous (the seed near the grid, seriously?) I liked playing it, ma it's nothing special.",
            "review_score": "1"
        },
        {
            "review_text": "Nice Artifex Mundi Game!  The Story is very nice if you like Fable's. The grafic is getting better and better.  The Achivements are good to get, if you have a little patience ;-)  I wish me more of the Grim Legend Series.  For more Information have a look at the Review of Smiledozer! There's nothing to add ;)",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the play style of this game and how the story slowly unfolded. I am a big fan of Grim Legends and I would recommend it to others.",
            "review_score": "1"
        },
        {
            "review_text": "A good game with nice puzzles and nice atmosphere",
            "review_score": "1"
        },
        {
            "review_text": "A cute and lovely story taking you away from your everyday life :)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun story, amazing soundtrack and art style which I think is the most important part about point and click games  Would recommend all Artifex Mundi games",
            "review_score": "1"
        },
        {
            "review_text": "It's a good story and a great challange! At least it was for me. Was a breeze for my 12 year old.",
            "review_score": "1"
        },
        {
            "review_text": "This is my first game from Artifex Mundi series. It was recommended by a friend of when she saw me playing a similar type of game. So I try and choose this 'Grim Legends' Series. I fond of this particular fairytale.  The game is well-made and such beautiful artwork/graphics. The story can be follow easily as you progress in the game. You can used a map to go to a particular area fast, although I prefer to walk along the area for clues. The puzzles are quite interesting and it sometimes provide 'depth' to our character (As a healer/herbalist) and to the story. The bgm are really good make you relax and concentrate on solving the puzzle.  Everything is great but the voice acting... just little bit off but you can ignore it. When you listen there will be few dialogue that are 'Being READ by the voice actor' not 'ACTING on it' a way.  Anyway, I do recommend this for those who are into fairytales and puzzle solver. Worth for your time and mind. ",
            "review_score": "1"
        },
        {
            "review_text": "A good second offering for the Grim Legends series. The previous game was a bit longer, I felt, and the inventory a bit more engaging, but this is a good time waster too. I always liked the fairy tale this one is based on, it's odd to present the story as a mystery if it's as well known as this one.",
            "review_score": "1"
        }
    ]
}