{
    "app_id": 279990,
    "name": "Bridge Constructor Playground",
    "release_date": "2014-07-02",
    "developer": [
        "ClockStone"
    ],
    "publisher": [
        "Headup Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "Casual",
        "Simulation",
        "Indie"
    ],
    "achievements": 21,
    "positive_ratings": 118,
    "negative_ratings": 59,
    "price": 6.99,
    "description": "Bridge Constructor Playground offers people of all ages an introduction to the topic of “bridge building”. This game gives you the freedom to let your creative side run riot – nothing is impossible. Across 30 innovative levels you have to build bridges over deep valleys, canals or rivers.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/279990/header.jpg?t=1536823723",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8 Processor: 1,8 GHz Memory: 1 GB RAM Graphics: DirectX9 compatible with Shader Model 2.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The concept is simple: build a stable bridge that will successfully withhold large quantities of weight. Connecting platforms to balance the weight and avoiding stress is the key solution to completing a level.",
            "review_score": "1"
        },
        {
            "review_text": "A sweet little physics/bridges game to pop during free minutes. Tiny and not simple enough to make one keep going. Playground part of the title is very true to it's nature - well, you are supposed to do this-and-this but hey, nobody said you have to.",
            "review_score": "1"
        },
        {
            "review_text": "A Succint Review: Too easy Too short Too simple Too little to do Too little to even review.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this free from a Humble Bundle. If I had paid money for this I would be incredibly sad, especially at a $10 price point directly from Steam.   First Impressions  This looks like a bad iPad game written in Unity. Probably because it is.    Controls  The entire UI is clearly based around a touch screen, with the cursor acting as a glorified finger. You can't adjust sound levels in the game, I had to adjust them in Windows mixer because it screams at you. You can enable/disable the horrible music with a button on the start screen, that is the extent of the options menu. There are only a couple keybindings, and none are really useful except for undo.    Further Play  So after beating the Tutoria l  missions I wanted to try some of the harder ones. Nope, I have to replay the tutorial missions to get 25 'badges.'   Badges  Badges are horrible. It's literally impossible to accomplish all of them in one run, and for the two budget-based ones there are one, maybe two solutions for each. It's infuriating how low the budgets are set, you genuinely do have to do it EXACTLY like it wants you to otherwise you go over budget or load.  If this was a iPad/Android Tablet game it would be subpar. On a computer this is just horrible. And it's a ripoff of  Bridge Project , which is vastly superior.",
            "review_score": "-1"
        },
        {
            "review_text": "This feels a lot like West Point Bridge Designer.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a complete waste of your time and money! it wont even work on mac! just get it on the app store and dont bother with this game. Its absolutely aweful :(   I dont know whether it works for windows but i would recomend other games such as Rollercoaster Tycoon. Theyre old games but much better than this awefull game!",
            "review_score": "-1"
        },
        {
            "review_text": "More of the same, really. The removal of a budget and the stress level indicator are a nice touch. It seems like this game is more meant for kids. If you already own the original game, this isn't really worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "You build bridges, it's fun. Good mechanics, cute graphics and the medals aren’t to hard to get.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game. I've played other bridge building games and this one seems like a better one because it has more freedom in building, more dynamic physics and objectives to complete. I'd recommend this but only if you can get it cheap (5 euro)",
            "review_score": "1"
        },
        {
            "review_text": "Fun little puzzle game. Well done, simple to use, worth the dolllar or two that I payed for it.",
            "review_score": "1"
        }
    ]
}