{
    "app_id": 280,
    "name": "Half-Life: Source",
    "release_date": "2004-06-01",
    "developer": [
        "Valve"
    ],
    "publisher": [
        "Valve"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "FPS",
        "Action",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 3767,
    "negative_ratings": 1053,
    "price": 0.0,
    "description": "Winner of over 50 Game of the Year awards, Half-Life set new standards for action games when it was released in 1998. Half-Life: Source is a digitally remastered version of the critically acclaimed and best selling PC game, enhanced via Source technology to include physics simulation, enhanced effects, and more.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/280/header.jpg?t=1530046549",
    "minimum_requirements": "1.2 GHz Processor, 256MB RAM, DirectX 7 level graphics card, Windows XP, Mouse, Keyboard, Internet Connection Recommended: 2.4 GHz Processor, 512MB RAM, DirectX 9 level graphics card, Windows XP, Mouse, Keyboard, Internet Connection",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Half-Life vs Half-Life: Source",
            "review_score": "1"
        },
        {
            "review_text": "It's Half-Life. You like it or you're wrong.",
            "review_score": "1"
        },
        {
            "review_text": "Made a mess in my pants. The legendary classic redone in the source engine. It's basically the second coming. Do buy.",
            "review_score": "1"
        },
        {
            "review_text": "This game is basically HL1 but ported to source(with a few hilarious glitches). If you want a REMAKE,you should go for Black Mesa.",
            "review_score": "1"
        },
        {
            "review_text": "brillient gameplay, some bugs but who cares! improved graphics, physics and sound. this should have a game of the year edition of its own!!!!   im a big fan of half life and valve plz make HL2 EP3 and HL3.   thanks",
            "review_score": "1"
        },
        {
            "review_text": "Still waiting for Half Life: Global Offensive",
            "review_score": "1"
        },
        {
            "review_text": "I bought this because I want to get every Valve game with time. I recently got CS Complete and Half-Life GoldSrc.  I must say this version is not that different from the original, aside from the water, ragdolls, and somewhat changed lightning. That's it. The ability to spawn monsters, though, has given me a lot of fun in Surface Tension map.  You can spawn monsters in GoldSrc by using the Spawner mod.  But still, about this game. I have not encountered bugs so far, but I'll see in the future.  It's, good. Although when using the HD Content some of the reload sounds aren't there. Fixed this though. PM me if you want to know how.  Recommend it anyway. If you're a die-hard Half-Life fan that is. If not, just get the original. Nothing is really changed.",
            "review_score": "1"
        },
        {
            "review_text": "  It's Amazing",
            "review_score": "1"
        },
        {
            "review_text": "Go and buy the original version, this version is kinda of broken. Other than that, pretty good game.",
            "review_score": "-1"
        },
        {
            "review_text": "First of all this is not a remake (like Black-Mesa), it's a remasterization. Well this is the same old Half Life we all know, except that now it has some improved textures, mainly the metalic ones (incluiding floors), overall lighting, color intensity and all of the character models. The weapons are better looking too as well as your H.E.V. suit (it has nice details on your hands and arms. I recommend it, yes, but only to people that don't own the original or die hard fans like me that would take up any excuse to replay this masterpiece.   The thing that bugs me (ignoring the glitches) is that this remasteriztion feels incomplete. Despite they added physics and the death's are more realistic and satisfying (plus the bullet impact splatter and the bullet holes on characters are a nice detail too) now you CAN'T hit them with the crowbar, it just passes through. The only way to 'hit' the body is hitting the surface were it is and through the bodu. Only then it'll start moving and it is weird because the hit sound it's still the surface one. If they are re-releasing this too, they should have added something extra, like achievements or cards. I also hate that the impact sounds of the crowbar, even when you are smacking wood, it's METAL-HIT-LIKE SOUND. WHAAT????  Finally, I have to say that I played Black Mesa. That is a remake, it has the essence of this game but changed some maps and things (the leechers on the water are gone and the enemies act and react different to the weapons, for example). I liked it and it was a good excuse to travel to Black Mesa again. I still prefer the originall one, but I salute the developers for making an outstanding job at it.",
            "review_score": "1"
        },
        {
            "review_text": "At least water here is transparent thanks to Source Engine.   You can rek dat icky without going underwater.   Also, skyboxes are pretty nice!  0.01/0.1 Some things still need to be fixed",
            "review_score": "1"
        },
        {
            "review_text": "A graphical update, that's all. If you liked Half Life, you will enjoy this cleaner version.",
            "review_score": "1"
        },
        {
            "review_text": "What is Half-Life: Source? It's Half-Life with Half-Life 2 graphics.  Better grab original Half-Life for original experience of Half-Life or Black Mesa if you want remaster of Half-Life which obviously better than Half-Life: Source. It's good game, but you better don't buy this game seperately. Better buy with Valve/Half-Life complete pack only.",
            "review_score": "1"
        },
        {
            "review_text": "played 1000000 hours before the advent of steam) BEST. no coment",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life: Source is the original Half-Life ported to the source engine. The source engine gives the game a slight graphical update, but it also causes some performance issues not present in the original game, such as longer loading times. It's also not entirely one to one with the original because of the source engine, but I still think it's overall faithful to the original game. Give it a try unless you can't dare to play anything other than the original version.",
            "review_score": "1"
        },
        {
            "review_text": "You might be asking, why would one buy the original Half Life after they purchase this game? This game is a direct port over to the Source engine sure. But the original Half Life has several hundred fanmade modifications created for it already, with many more being developed. But this game allows you to play on Half Life 1 maps in Garrysmod and use the models for your posing delights.  So my recommendation is to buy them both, it's quite worth it in the long run.",
            "review_score": "1"
        },
        {
            "review_text": "Even after fourteen years, this ugly thing is still a beauty to play.",
            "review_score": "1"
        },
        {
            "review_text": "A higher graphics verion of half life.  its a very very interesting game, i was suprised how into the story i got even though its pretty basic, the shooting is solid adn the veriety of weapons are wierd and solid and they feel like the have weight and hit hard.  the puzzle solutions make sence but are sometimes really hard, say i spent 2 hours trying to get past the are with radioactive barrels and a river or radioactive waste yet wtill felt into the game.  also this game can be punishing auto saves can be far apart and if your unprepaered you can be destoyed by enemys.   this game is amazing i recamend it to any puzzle or fps fan  8/10    aslo plz ignore any spelling mistakes, also im bad at rating /10 just accept this game is amazing",
            "review_score": "1"
        },
        {
            "review_text": "I do recommend you to play this game,but to me i think the original version is far more better than this,poor port of Half Life into Source engine,but I did get to finish the game in 8 hours long,because i've played Half Life on my PS2 for multiple,multiple times,till I memorized every step on where to go.  PLUS I FREAKING HATE THE GRENADE'S THROW PHYSICS.",
            "review_score": "-1"
        },
        {
            "review_text": "Half Life 1, one of Valve's first games to come to the Source engine.  Common question I get asked, what's the difference between the 'source' and 'non-source' versions?  Really, not a whole lot. Textures look the same, lighting, story, all that. Only things that you will be able to pick out is that the puzzles towards the end are wired differently. This is why I would have someone play the Source version over the goldsource one.  Should you play it? Yes. Do you have to play this to call yourself a PC gamer? Yes. Is it really required or a 'must play'? No.  Many people would not be able to deal with the graphics, puzzles and 'lack of heart pounding action'. Sad to see people turn a title down due to those reasons.  Speaking of graphics, you should be able to run this without problems. If you can't, get rid of Steam. This is as low as the bar gets set on detail and polygon counts.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Really buggy, I'd rather play the original Half Life..",
            "review_score": "-1"
        },
        {
            "review_text": "Half-Life: Source is possibly the biggest flop Valve has ever put out besides ricochet. There's really nothing different between this and the original 1998 Half-Life besides Realistic Water and a new Physics engine. Infact this game doesn't really 'Enhance' it at all. You could think of it as worse considering the amount of Bugs this game has and the fact that the recent Steam-Pipe update ruined everything and messed up the Shiny Shaders. I would totally not reccomend this game to anybody for the sake of it being worse than the 1998 release of Half-Life.",
            "review_score": "-1"
        },
        {
            "review_text": "I would not say its better then the original Half Life but the ability to go 1920x1080 beats it.",
            "review_score": "1"
        },
        {
            "review_text": "The controls are really fast! You often overshoot what you wanted. It's and old game and it shows in the graphics, but it is still fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life: Source  Run, Think, Shoot, Live.  Developed by Valve and released in 1998, Half-Life was at the time considered the finest first person shooter (fps) of its generation and still remains today one of the best games of all time. After the release of Valves Source engine, like many other of their games, they decided to port Half-Life to it, updating some graphics, fixing bugs and introducing new gun models.   When a mysterious alien artifact is tested at the Black Mesa Research Facility, a Resonance Cascade occurs ripping holes in the fabric of space and allowing aliens from another dimension to pass through to Earth. Awaking in the test chamber Dr. Gordon Freeman must fight his way through Headcrabs, Bullsquids and the powerful Vortigaunts as well as the U.S. Army who has been sent dispose of the Aliens and witnesses.   Half-Life’s plot, although not readily apparent, is extremely complex and dense. It does explain clearly why you need to go from point A to B, however the backstory can be very confusing and still, some of it, remains unresolved to this day. It’s this complexity and mysteriousness that makes the game so much more effective.   Gameplay is one amazing aspect in Half-Life. Being both a puzzle game and an fps, Valve has equality weighted these two genres with lots of little puzzles throughout the game, some hard and some not, as well as lots of fun alien and solider blasting in-between with a large range of cool weapons. Your signature weapon that is now an iconic symbol for the Half-Life franchise is your crowbar, which although not as lethal as a rocket launcher or crossbow, is useful to complete small task like breaking a window or ventilation shaft casing.   The soundtracks in this game always suit the environment and never fail to add to or significantly change the atmosphere of some scenes. The soundtracks consisting of electrical and techno sounds go extremely well with the chapters played in the border world Xen, The creepy number played at the start of the game while in the tram, blew the suspense factors through the roof and nothing goes better with the satisfactory of completing Half-Life than the iconic end credit soundtrack. Unfortunately, after most of the “feel good” soundtracks start you will pass a checkpoint that will que the next sequence and stop the song.   The level design in this game is truly ahead of its time. There is not only significant attention to detail and lots of optional interactivity with the environment, but the game is constantly catching you off guard with jump scares from Headcrabs or collapsing bridges. What contributes to the level design more than anything are the elite graphics. In particular the water in various levels is amazing and hasn’t gotten much better in modern games nearly 20 years later.   Overall this game is an artwork. The storyline is great and only gets better in later games, the gameplay is exciting and fun and the game is made exceedingly better with the incredible soundtracks, level design and graphics. I would recommend this game to anyone but in particular fps gamers as it is a classic and arguably one of the best fps’ of all time. If you buy this game...  Prepare for unforeseen consequences…  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, great graphics with an absorbing storyline.  ",
            "review_score": "1"
        },
        {
            "review_text": "WOW WOW WOW - WOW... sorry i just.. this game is amazing!!!!!!!!!!!! Like any other half life, best game ever, go ahead and play it! (better with linux)",
            "review_score": "1"
        },
        {
            "review_text": "Half Life Source is yet another 90's game. Although it is a first person shooter and a bit creepy, it is a classic game and a must-have for any true Valve fan. I've played Kings Quest 8, Tomb Raider 1, and other 90's thirdperson games, and I have to say that Half-Life Source definitely deserved the 'Game of the Year' award in 1999. ;)",
            "review_score": "1"
        },
        {
            "review_text": "This is basically Half-Life 1 except it's ported straight to the Source Engine; no graphics enhanced, nothing special. There's nothing new here other than ragdolls are now in the game. So far I saw scientists sitting on their chairs by their legs, not their rear and it's not going to get fixed anytime soon. But what's the point? It's literally Half-Life except on the Source Engine.  You better off play the original Half Life (GoldScr Engine) or the actual port: Black Mesa.",
            "review_score": "-1"
        },
        {
            "review_text": " Half-Life: Prettier Twin Sister   Pros: Classic, Dialogue, Gameplay, Graphics Cons: Platforming  Originally released in 1998, Half-Life revolutionized the FPS genre, winning award after award. The narrative within evolved as allies and enemies would spout little tidbits about the calm, quiet protagonist. Gritty and realistic, gameplay involved a myriad of enemies and traps. Although a completely linear game, the setting varied from huge desert cliffs to claustrophobic air vents.  At the time, most games heavily involved platforming and Half-Life was no exception. Small annoyances can still be found, for example, trying to move along some ladders. Younger crowds might find the graphics outdated and clunky. But these faults are fairly insignificant for a game published more than a decade ago.  A classic, revolutionary title that all FPS fans, serious gamers, and appreciative players should own.  10/10",
            "review_score": "1"
        },
        {
            "review_text": " 9/10 - may Gaben be with you.   Hey, it's Half-Life. It was ahead of its time when it was released, but has it aged well? In terms of mechanics, not really. Graphics? Meh. The story, however - holy ♥♥♥♥! I forgot how much I loved this game, and loved it with good reason too. The story is nothing short of amazing, and it's pretty obvious why people are begging for an edition to wrap everything up.  If you want to get into the series, HL: Source is the way to go. Updated physics and a few graphical changes may not mean the biggest difference in the world, but it's enough to get noticed.  Are there things I'd argue are flawed? Sure - but overall the plot is so enjoyable that you'll accept the game's age for what it is and still have a great time.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent buildup to Half Life 2. TBH, I would recommend you buy the Half Life complete, and not the games individually. You'll save a ton of money, and on sale it's fairly cheap.  The story is excellent, the game is a bit on the hard side. There were points in the game that I had to beat without getting hurt once, because I had ~3hp. In one section, I had to clear out    about 12 soldiers and a tank    to get to the next area. It's really good. Sometimes a headcrab would pop out at me and give me a jumpscare.  The source version is buggier than goldsrc Half Life, So I recommend Half life more. (non-source)  7/10",
            "review_score": "1"
        },
        {
            "review_text": "After the SteamPipe 2013 update, Valve put this game to garbage and now it's only worth for curiosity and GMOD NPCs.",
            "review_score": "-1"
        },
        {
            "review_text": "It's just Half-Life with ragdolls. Still awesome  10/10 even adds NPCs for Garry's Mod.",
            "review_score": "1"
        },
        {
            "review_text": "I ended up playing this game several years late. Despite the fact that there were more technologically advanced games available when I played it, I still found myself immersed in both the universe that the game was painting, as well as the mechanics of the gameplay itself. Sure, some things leave a little to be desired (looking at you, ladders), but the fact that people still talk about, play about, and modify this game (see: Black Mesa) should be testament to its timelessness.",
            "review_score": "1"
        },
        {
            "review_text": "non stop action and puzzle solving. loved it",
            "review_score": "1"
        },
        {
            "review_text": "I should have listened to the reviews that mentioned all the bugs. I managed to keep playing through the seemingly minor glitches all the way up to the On A Rail level. Halfway through, I get off the tram to fight some people, and when I come back it's gone.  I thought I just came back to the wrong part of the track, but I ran all the way up and down the track, and around all the turns, and just couldn't find it. Game breaking bug.",
            "review_score": "-1"
        },
        {
            "review_text": "9/10 - Just the legendary Half-Life with slightly improved graphics. Get one or the other, but don't waste your cash on both (unless you get the Complete Valve Pack like I did)",
            "review_score": "1"
        },
        {
            "review_text": "Great   this game only has one con: compleatly horrable ragdoll physics",
            "review_score": "1"
        },
        {
            "review_text": "Black Mesa Source Beta 111/100",
            "review_score": "1"
        },
        {
            "review_text": "It's just the same game but corpses have physics. Also does anybody actually prefer the MP5 to the M16? I mean come on.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is incredible.",
            "review_score": "1"
        },
        {
            "review_text": "This game's worth it to play for the nostalgia, but it is showing its age and it's also incredibly difficult compared to Half-Life 2 and beyond. It can feel pretty slow at times, because the environments aren't super engrossing or anything; however, if you've got about 6-8 hours of game time to spare, spend it honoring this classic that started it all.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME LOOKS LIKE IT WAS RELEASED IN ♥♥♥♥ING 1998. HORRIBLE OUT OF ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "A tad pointless addon, Black Mesa is more fun. But at least with this you get Xen. :P",
            "review_score": "1"
        },
        {
            "review_text": "It's the classic FPS that introduced me to PC gaming, but is now powered by the Source engine giving the game some nice water effects",
            "review_score": "1"
        },
        {
            "review_text": "As of today 2/27 this game is weird. It seems buggy as heck  I dont really understand, from what Im reading the game was fine when it came out? But now its near completely broken I think. There are glitches EVERYWHERE and other weird going ons. I don't really understand how Valve could have broken so much in this game with updates?  Technically speaking there are supposed to be very little changes, controls feel like you would expect in Source and are good and accurate when compared to how the old GoldSrc games control today which can take some getting used to but isn't bad. The way everything is rendered and shaders are diffrent, things look a bit more crisp but all models and textures are old. They actually look uglier to me than the standard HL1 non-hd models which I feel are the best to me visually. Ragdolls are added but thats really the only physics addition. Everything else from gibs to med packs uses the old HL1 physics where it simply falls or for gibs bounces and bounces. The water looks nice but does not fit in when everything around it looks cartoony. It ruins the dam scene for me atleast. Also they made some small changes in areas that I wasn't a huge fan of, mostly just looks related stuff and nothing big or something worth whining about. But of all the ports of HL1 I have played, which is only the PS2 and Source port, I like this one less. Atleast the PS2 version was objectively better than the original on PC when it came out in 2001. The orignal was released in '98. The Source port came out in 2004 and has none of the new content found in the PS2 version including the Coop expansion, Half Life Decay. I have not touched the Dreamcast version nor have I ever owned or played the Dreamcast aside from maybe one time at a family friends...maybe..its been probably near a decade since that. I also have not played the Linux or Mac ports but honestly I have no reason to ever want to us Mac OS. Linux is gaining ground though.Also the expansions are not present. Just basic Half Life 1.  Present in this current version there is a huge problem with hit boxes on tanks, helicopters, and enemies of that type. The Gonarch also seemed to not take damage alot of the time when I was hitting it. Its just iffy and I want to say broken. Also with source some of the design decisions that were taken with Half Life 1 just seem awful. Vorts never missing even though it feels like your moving like Speedy Gonzalez just feels like bs and Xen still sucks. Yeah, Xen always sucks. I hate it so much until you get closer to the end and fight the nihlanth/final boss.  But Half Life is still half life and its still fun. But this just isn't better in any way than the original aside from a few negligible graphics points.   Black Mesa Source is what this game should have been, except for the fact that they did change alot of the game and removed some points and added others. This game should have just been Half Life but graphically updated with some small gameplay upgrades. Its just not what it should have been and falls short of the original.",
            "review_score": "-1"
        },
        {
            "review_text": "I think it would be a good game if I played it....also boobs.",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game for years, 17. And it's still one of the best. I have purchased at least 10 copies of this. Thanks to steam I only had to buy it once more. :D",
            "review_score": "1"
        },
        {
            "review_text": "The same as the original but in the Source engine (looks nicer, better engine physics and such, runs better, etc.), also this game has inexplicably swapped the 9mm pistol for a Glock 17 and the game also swapped the SMG for an assault rifle style gun.  15/15 'Improved on the original'",
            "review_score": "1"
        },
        {
            "review_text": "One of the best FPS I've every played. Great Atmosphere, balanced weapons, challenging but not un-fair obstacles, everything that a good game should be.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fairly well made remake, but don't expect the world. The game is, overall, nicer looking and it's also a lot smoother. On the other hand it's filled with new sorts of bugs that would happen from time to time, nothing game breaking, just be prepared to encounter dumb A.I. and issues with the hit detection here and there (not sure if that was in the original Half-Life as well due to me not encountering any of this sort in my original playthrough.  To sum it all up, it's just a prettier, faster and more polished experience. If you have the original Half-Life just stick to that. If you find Half-Life: Source on a discount, it's worth it, otherwise, just get the original as mentioned above.",
            "review_score": "1"
        },
        {
            "review_text": "Just get the orginal Half life.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the all time classics!",
            "review_score": "1"
        },
        {
            "review_text": "Meh. Buy it if you have some strange urge to, but If you want a source remake of the original Half-Life, just look up Black Mesa. This isn't really worth it at all. Just buy the original Half-Life if you're gonna buy this.",
            "review_score": "-1"
        },
        {
            "review_text": "Would have been more fun for it's time.",
            "review_score": "1"
        },
        {
            "review_text": "“digitally remastered”",
            "review_score": "1"
        },
        {
            "review_text": "Was a good game back then and it is good to see a source engine port of the beloved Half-Life game. Though I am late to the party, I have to say I'm fairly dissappointed as the HD content is glitchy, only improves models and sounds and the reloading sound for the MP5 (Submachine Gun) is broken/missing. There is added physics in the game but not a lot of Source Engine's full potential of physics. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of the best games I have ever played. Half-Life is a classic that should be played by anyone who appreciates FPS's. In fact, it's your obligation to play this game, because it was the first to do so many things in video games. There are many games that have heavily leaned on the format, gameplay and story telling strategies of this game. The game is very dated, and it shows, but Valve did implement the Source engine which gives it a more polished, free-flowing look. I was able to disregard the dated graphics, because I knew that this was such an original and classic game.   The first half hour of the game is brilliant, because nothing is really happening, but there is an ere tone and feeling that lets you know that something's not right. Some subtle foreshadowing occurs when some of the computers break, and a scientist says the power is going to be switched on to 105%. It's show-not-tell things like this that make the game so gripping and immersive. It's something we don't seem to see in many games anymore.   Anyway, during the first three quarters of the game, you're running around, collecting new weapons, killing aliens, and soldiers sent there to kill you, (a perfectly executed plot twist) solving puzzles, picking up more of the story, riding on rails, launching rockets, blowing up helicopters, storming military bases, navigating mine fields, annihilating green, bangy, tentacle thingies, electrocuting, and blowing up giant, blue flamethrower monsters; the list can go on and on. Basically, you're just having a lot of fun. The constant change of objectives really keeps the player immersed in the game. You never feel like you're repeating the same things over and over again. This is a staple in the Half-Life franchise. Once you start getting bored of something, it changes it up so that you're doing something different and more exciting. The pacing in this game is also phenomenal. It usually goes in the order of: Action event, slow puzzle event, action event slow puzzle event, with some events that feature action and puzzle at the same time, and story exposition sprinkled around and mixed in through everything you do. It's constant fun that never frustrates you or makes you feel cheated.   The subtle rise in difficulty is more subtle than, you know, just changing the color of the monster. It's realistic, and makes you feel the tension rising around the Black Mesa facility. The first three quarters of the game are nearly flawless.  In my opinion, the only downside to this game is the last quarter where you play in the alien world, Xen. This segment of the game really breaks up the immersion. The gravity is toned down, so everything you've gotten used to in the first part of the game is scrapped for a floaty, hard to manoeuvre, way of moving. It's also very slow. From a story telling perspective, it's mind blowing, but from a gameplay perspective, it's quite dull and frustrating. During the chapter Xen, you're just platforming, trying to figure out where to go. Gonarch's Lair was just an annoying, frustrating, slow paced boss fight, But the REAL kicker was interloper.   I hated this level. It was way too long, way too difficult, way to confusing, and way too frustrating. If there was an enemy I could have removed from this game it would be those flying baby thingies, but they were everywhere here and they would respawn all the time! There's never enough health, energy, or ammo for you, so you have too eek by in this extremely hard level. In most levels, if it was hard, it was because you needed to change your strategy. It was your fault if you died. But in this level, there are just way too many overpowered enemies. You're trying to save your health and running out of ammo, and BOOM! You're hit with ten million, flying babies, and bee shooting giants, while being hit with vortigaunt lightning from every corner. The only way to get through this level is to set the difficulty to easy, and die a million times before you memorise where each enemy will be and when he will attack. That's no fun. That's just drudgery.   Nihilanth was just a giant version of those annoying flying babies. Great. To be honest, he was just mediocre. Okay, I do hate how all the Zelda bosses, for example, have huge shiny targets on them that show you exactly where to place a bomb or shoot an arrow, but at least they help you figure out how to defeat it. In Nihilanth, I had no idea how to defeat the monster. shooting it did nothing, and it kept sending me away to these weird caves by throwing portals at me. I was completely lost. I had to go on youtube and see how it was done before I even knew how to kill it. It was still too hard too kill it though. If you play it the way it was intended and jump up onto those cliff things, it's really hard, and he will keep sending portals at you. If you're cheap like me and just hid behind the spiky rocks, then it's easier, but it's painfully repeditive and tedious.  Boss fights in this game were not good with the exception of the green tentacle thing. I will cut it some slack though, because it was kind of a 90's thing to have bosses in your games, and this was a very hard game to put bosses into.  In the last chapter, you're given a monologue from the mysterious G-man, who you may have noticed stalking you throughout the game. He makes you go through a portal, and then the credits hit, reminding you how good the soundtrack in this game was.  All in all, Half-Life was a classic, and should be played by anyone who likes video games. If you like steam you should play this game to show your respects to Valve. It was the first game they made. Half-Life rose to my personal favorite video game franchise after the Metroid Franchise was ruined by Other M. Anyway, just play this game. You have no excuse not to. Oh, and Gabe, PUHLEEEZZZE MAKE HALF-LIFE THREEEEE!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very good, I barely ran into any bugs. The graphics are much more enhanced, now we actually have shiny objects. However there is not a lot of mod support nor do people try to mod this game. I'd stay away from this one and play it safe, just get the original Half-Life. Also Half Life Source does not have a multiplayer function built into the game. Instead Valve decided Hey let's split up the game into two so we can make double the money hehehehe. So not only with the original are you getting mods, you're also getting multiplayer. That's my review thank you have a good day, if you have any questions on this review just send me a steam message or something.",
            "review_score": "-1"
        },
        {
            "review_text": "Has bugs the original Half Life doesn't. Don't bother getting this one. It just looks nicer, but really, it's not worth having the bugs.",
            "review_score": "-1"
        },
        {
            "review_text": "1998, I was 18, Id been weened on the Spectrum, then the Amiga. I got my PC in 1996 and for two years played pretty ropey demos, and sometimes good stuff, like Theme Park. Then I picked up half life. Lifechanger.  What can I say? The intro scene setting, the journey in on the monorail, the voice welcoming you to your working day, the sound design... THE SOUND DESIGN. I think thats what got me. Im a music producer by trade and even 18 year old me was blown away by the score, and sound effects. The levels on Xen, the sounds made, the voice of the Nihilanth, it was all too perfect.   This game holds up today, yep, graphically its a little jaded, but i still play, and I mean this source version, not the Black Mesa update.   ",
            "review_score": "1"
        },
        {
            "review_text": "Good. Bad Graphics Scary Gman Head crabs Xen Mr FleaMan i wuv it &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "now i can push around corpses without destroying them",
            "review_score": "1"
        },
        {
            "review_text": "i killed a testicle with legs",
            "review_score": "1"
        },
        {
            "review_text": "It's tasty.",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is still the best Until now and will always be the Best",
            "review_score": "1"
        },
        {
            "review_text": "Not Worth Buying.Its pretty much the same as the original.",
            "review_score": "-1"
        },
        {
            "review_text": "The original game upgraded to Source, yo!",
            "review_score": "1"
        },
        {
            "review_text": "What exactly did you change valve?",
            "review_score": "-1"
        },
        {
            "review_text": "this game sucks you can't use mods",
            "review_score": "-1"
        },
        {
            "review_text": "What can i say? This is the remastered version of Half-Life, with Source engine include it, so yeah i think you should play it.",
            "review_score": "1"
        },
        {
            "review_text": "Its just ♥♥♥♥ theres way to many bugs and glitches just stick to either Black Mesa or the origonal Half-Life",
            "review_score": "-1"
        },
        {
            "review_text": "A complete remake of Half Life. Definetly a must play!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Waste of money if you have Half-Life already. Nothing is really changed. The water is upscaled and pretty good looking, and theres ambient lighting effects par Half-Life 2 as well as ragdoll effects, but everything else remains unchanged from the Original Half-Life.",
            "review_score": "-1"
        },
        {
            "review_text": "Well is just as bad as every body says it because well some it has bugs like in one part of the game a npc is hovering above a chair in the orignal he is in the chair and some of the differnt npcs are not suppose to be there in some scenes and the replace source walking and doors and all sounds i would rather get the original Half-Life that runs the gold engine on steam or disk if you wont",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game (unless your rich and have money to waste). Valve did not even try to recreate Half-Life, This is Half-Life 1998 ported over to Source creating more glitches. The only difference is that the radiation and water looks real compared to the original, appart from that its just a more ♥♥♥♥ed up version. For the best experience buy the 1998 version or the BLACK MESA version.",
            "review_score": "-1"
        },
        {
            "review_text": "  Always a classic, even in Source mode.",
            "review_score": "1"
        },
        {
            "review_text": "wtf is this this is like half life 1 but with more glitch ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I play for 10 seconds I wait 5 minutes I play for 10 seconds I wait 5 minutes I play for 10 seconds I wait 5 minutes I play for 10 seconds I wait 5 minutes and so on... I'll just stick with the original.",
            "review_score": "-1"
        },
        {
            "review_text": "They just ported gldsrc into source. I expected more from this. No significant changes.",
            "review_score": "-1"
        },
        {
            "review_text": "By the time I picked this game up back in 2004 it was already a old game, but HL is single handedly responsible for me getting back into gaming, and switching from console to PC.  Back when I was a kid I always prayed that one day they would make a videogame that was like a virtual reality where you could move around a real enviornment and interact with objects. Prior to Half-Life I had only played Woffstein3D and doom for PC. Doom was great but it wasn't really interactive or very realistic.   Half-Life was a dream come true and it will always be my favorite PC game of all time.    For all those youngling's out there who grew up with Call of Duty and the like, you probably won't like this game. The graphics are old now, and the pace is slow. However if your still relatively new to gaming then please do yourself a favor and try it. Hell it even has a training room for those who don't have experience controlling a character in first person.   The only difference between HL and HL source is that source has slightly improved lighting and textures in certain areas. Its worth getting over the stock version, but then again if you really want to experience the game as it came out back in 1998 then sure get the original.",
            "review_score": "1"
        },
        {
            "review_text": "Wow I can't believe how bad these graphics are, when did this game come out? The 1990s? 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly, you shouldn't be playing this game unless you want the 'full Half-Life story experience'. It really hasn't aged well, first-person platforming is horrible, and the enemy AI has pretty terrible power scaling (any time an enemy is in your field of view it just aimbots you, meaning you can't actually have fights without taking massive damage). It's a good history lesson, but I don't think this game deserves high reviews. Play HL2 instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Half-Life is among the great landmark shooters and if you are a fan of science fiction or first person shooters you owe it to yourself to play this gem. Yes the graphics are dated, but that is to be expected from an old game. Half-Life: Source is just the original Half-Life ported over to the Source engine after all.   Great game. Play it. Tell your friends.   It is an old game as I have said so be mindful of older design conventions and judge accordingly.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best FPSs of all time. At some point in your life you must have heard about this game, or it sequel. Every game in the genre borrows some elements from this one, guaranteed.   The arms you with a handful of weapons you mst make your way though a ridiculously big research facility overrun with aliens and military forces. A non stop action package with zero cutscenes.  The story is explained through small chats with the surviving members of the facility and paying attention to enemy conversations. You can also gather some extra details by cautiously examining the environment.  All the enemy soldiers have an instantly recognizeable scruffy voice while the friendly NPCs sound more calmed and soft, for the most part. This game also has some os the most well known scores for PC games (like the Nuclear Mission jam), and the weapon sounds are very well made.  Although this is a remake of the original release for the source engine the graphics were not enhanced at all, so don't expect brilliant quality. Some users also say this version is inferior to the original because it added extra bugs and other issues, but I encountered none during my playthrough. Your mileage may vary though.  Overall, this game is a classic and a must play for anyone who enjoys videogames.",
            "review_score": "1"
        },
        {
            "review_text": "If you love VALVE then get this game it has some impressive water details believe me i was wondering the water details for quit a bit.   don't mind my time playing with my previous account i also got the VALVE COMPLETE PACK and played evey game i guess for over hunder hours if not more including this one.   GET THIS GAME THE ♥♥♥♥ING WATER IS VERY IMPRESSIVE        Time to choose Mr.Freeman",
            "review_score": "1"
        },
        {
            "review_text": "I missed out on this game for far too long. Do yourself a favor, and buy it. It's worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Its been years since I've watched my Dad go through this game, and I've finally found time to truely tackle it.  Some gameplays elements are obviously incredibly outdated, but the game is very good up until the 'Xen' alien home world section, where for some reason, the game takes a nose dive.",
            "review_score": "1"
        },
        {
            "review_text": "I just finished the game and let me tell ya, it's such a great game glitchy, but REALLY fun. I recommend anyone who loves scifi/aliens/guns/zombies anything like that, 3 words, GET THIS GAME! PS: Halflife has won over 50, yea thats right 50! game of the year awards!",
            "review_score": "1"
        },
        {
            "review_text": "I'm writing this review because i'm wating to watch football and I can so ♥♥♥♥ YOU WORLD. Also it's a great game 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "cool game.one of da best games of all,and best franchise ever. 10/10=buy the game now",
            "review_score": "1"
        },
        {
            "review_text": "Apparently Gordan Freeman acceled in his crowbar and shooting classes at MIT, CAUSE I HAVE YET TO HEAR A SINGLE ♥♥♥♥ING SMART THING COME OUT OF HIS MOUTH!",
            "review_score": "1"
        },
        {
            "review_text": "Lacks achivements. A bit buggy at times. Still good tho.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this clasic",
            "review_score": "1"
        },
        {
            "review_text": "Did they fix that floating scientist yet?",
            "review_score": "1"
        },
        {
            "review_text": "I don't suppose we'll see this one ported over to Source 2???",
            "review_score": "1"
        },
        {
            "review_text": "I like this game cause it brings out the childhood memories and its fun with the scientists and security guards going crazy and stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the BEST game I have ever played. Beats Halo, Killzone, Starcraft, WoW, anything. Its so beast that the multiplayer had to come seperate due to the chance of OD'ing on uberness.",
            "review_score": "1"
        },
        {
            "review_text": "Terrible. Everything I hated about the origional half-life but now on the source engine.  bleh.",
            "review_score": "-1"
        },
        {
            "review_text": "This game isn't amazing simply because of nostalgia. It's incredibly immersive, atmospheric, and well designed even by today's standards. The source engine is a nice touch and breathes even more life into the game. Love this.",
            "review_score": "1"
        },
        {
            "review_text": "every valve game every made has been unbeleivably awesome......Except this. (in my opinion of course). Half life is my favorite game of all time, period. But this is just the same exact game in a different engine, and i actually prefer the classic look. If you never played half life you will definitely enjoy this. Only other situation recomendded would be if you buy half life complete, it comes with that, so its a nice little bonus.",
            "review_score": "-1"
        },
        {
            "review_text": "Been waiting for this to go on sale but dont feel bad if you cant get it on sale it's still great! The fact that the game is still fun and enjoyable years and years after release speaks for itself. Nice change of pace to have to no quest markers and other trademarks of mordern games. Love it it's great go buy it!",
            "review_score": "1"
        },
        {
            "review_text": "im shocked frankly! How did they ♥♥♥♥ up a game i played so much as a teen! back in the day when i was just a weeee little 13 year old, i used to pirate half life,  after a while my grandparents bought me half life source and death match source, and i liked it, i got this game right around the time freeman's mind was coming out,  the game was good i liked it, it was stable looked nice, and ran decently on my ♥♥♥♥♥♥ hp pavilion slimline running vista,  then my account got hacked and i lost the game,  now year's later im 21 and decided to buy this game again to relive some old memories,  i shouldn't have, this game has some how along the line gotten worse, what was once a decently put together game ported to the source engine is broken,  so here are some good and bad additions,  THEY FINALLY ADDED THE HD PACK!  bad news,  they added the HD pack.  took them long enough but its worse than anything, textures look strange and inconsistent, the hev suite has wear on it, and so do all the armor on the barneys.  Sounds are missing from various weapons when you turn it on,  They never fixed the crow bar making one sound on every surface, (who knew it sounded like hitting a pipe on metal when you smack soft sand)  There’s this strange inconsistent shiny texture i cant turn off, looking at freeman’s mind i dont see that, and i dont remember it, its annoying and only on specific parts of the gun,  Ive made it as far as residue processing and ive just stoped. the strange shinny texture glitches here and splinter’s off, almost like how raggdols would noodle in fall out or world at war, they just shoot off and splinter across the map, and this covers the entire screen,  The AI in areas is broken, head crabs wont lunge at you when you stand right in front of them, good thing for those who play on hard mode like me!  Sounds all over break, sometimes they just dont play as if there’s not enough sound channels.  Thats all i can name after spending a good portion of my day playing this game,  There’s no reason to play this game, and almost no reason to buy it outside of garry’s mod assets,  But hey, at least its on the source engine, and that makes it all better riiiiiiiiiight *just go buy black mesa already*",
            "review_score": "-1"
        },
        {
            "review_text": "This game is simply the original Half-Life ported directly onto the Source engine. I would recommend you just skip this if you have played the original Half-Life because it's almost exactly the same thing. However with the Source engine you get ragdoll physics, much better water, better looking hit decals including blood on the NPC models now, 3D skybox, and shaders that pretty much do nothing but change water. That's it, it's pretty much the exact same game. Also the player movement in this game is so slippery, kind of like walking on a slippery puddle the whole game. I also noticed some game breaking bugs that affect progression such as not being able to defeat the helicopter on the Surface Tension chapter of the game. And I also noticed some corrupt textures on old models versus the HD models. Your better off to just play Black Mesa TBH.",
            "review_score": "-1"
        },
        {
            "review_text": "That player must've been hallucinating all night. Wait, if I'm playing as Gordon, does that mean I'm virtually hallucinating?",
            "review_score": "1"
        },
        {
            "review_text": "I've never played the original half life, and all my friends have been telling me to play it, but primarily the source version. It looks just as good as the original game (I know this because ive seen youtube videos of the non-source version) A lot of action, and a little bit of Sci-fi horror, combined with awesome graphics for its time and updated to have ragdoll physics and updated sounds.  If you like the Half Life series or like valve games in general, why the hell don't you have this game yet?",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this game. Buy Black Mesa. It's worth the extra money.",
            "review_score": "-1"
        },
        {
            "review_text": "it uses the same textures as half life 1 just in the source engine. if you want a good remake in the source engine, get black mesa.",
            "review_score": "-1"
        },
        {
            "review_text": "I have no clue why people don't like source as much as the original. Anyway's 10/10 BEST GAME EVER CREATED IN THE HISTORY OF MAN #HALFLIFE3CONFIRMED  But seriously, this game is terrific.",
            "review_score": "1"
        },
        {
            "review_text": "Who needs a social lafe when you have Half-Life?",
            "review_score": "1"
        },
        {
            "review_text": "This game is what started it all. The game is amazing and has really nice shooting mechanics and the graphics were great for the time. Highly recommended if you haven't already played it",
            "review_score": "1"
        },
        {
            "review_text": "For all of those who like the original Half-Life, I can't recomend this game. While it has the HD pack, and it has better graphics, the Source port just feels awkward and broken.",
            "review_score": "-1"
        },
        {
            "review_text": "its a awesome game.its so awesome i say its a must buy",
            "review_score": "1"
        },
        {
            "review_text": "If you want to play HL1 in the old graphics style buy this. If you want to play HL1 with better textures, models etc buy Black Mesa.  So it depends on what you're expecting of this game but due to the fact this is a great game I'd recommend buying and playing both :3",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game",
            "review_score": "1"
        },
        {
            "review_text": "Still playing this game in 2016.  My main problem with Half-Life is that I've started playing this game several times but I never managed to finish it. This time I intend to complete this game. This is probably what I like about this game, even after many attempts of trying to finish it I have not given up the hope to finally do it and I never got bored of it. This game looks very stable, despite one level where I experienced texture pop ups. Other than that this game is great!",
            "review_score": "1"
        },
        {
            "review_text": "This is the definitive version of Half-Life.  The entire game ported into the Source engine. So, that includes awesome physics. AND RAGDOLLS. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Just get the Original Half-Life. Half-Life: Source doesn't give the original justice at all, Its clunky and akward to play and just feels rushed.",
            "review_score": "-1"
        },
        {
            "review_text": "Fix this, i cannot finish it, i would rather be able to finish it than have better models and textures. at this time buy the original no source version.",
            "review_score": "-1"
        },
        {
            "review_text": "All I'll say is that if you are a fan of the FPS genre, this game is a must play. Such a classic, great feel even to this day.",
            "review_score": "1"
        },
        {
            "review_text": "Best game to play when I'm in a nostalgic mood. :D",
            "review_score": "1"
        },
        {
            "review_text": "The original Half-Life with a new graphics, and physics engine. (SOURCE).",
            "review_score": "1"
        },
        {
            "review_text": "HL:S is a fantastic game. However, I do not enjoy playing it. 'But Dimbus,' you ask. 'How can you not like playing the game and still call it fantastic?'  I was first introduced to HL via Freeman's Mind when it was still a Machinima show. I decided to buy HL after watching it, and was instantly turned off by the lack of any and all Ross Scott.  Recommended, but play before you watch FM. It'll ruin the experience.",
            "review_score": "1"
        },
        {
            "review_text": "NOT what you'd expect. it is just HL1 with Source light and source water. no up res textures, no new models, nothing.   Get Black mesa source, it is what this whould have been.   5/10 (this score is not dependant on the Original score I gave Half Life, the Game is still Great, just this version is not worth it, or is only if you do not have HL already)",
            "review_score": "1"
        },
        {
            "review_text": "Great game is even more fun with the source engine. Would buy!",
            "review_score": "1"
        },
        {
            "review_text": "its gitching out a lot can you stop it cause its buging me a lot just stop it valve.",
            "review_score": "1"
        },
        {
            "review_text": "If you never played half life and dont care for the graphics, this is a great game :)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games back in the day, now revamped with Source!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun, but nobody plays Deathmatch. Only 816 people reccomended Deathmatch..",
            "review_score": "1"
        },
        {
            "review_text": "gandalf freeman and his science adventure with bill nye the science guy is the best game ever made",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games PERIOD! If you're a real gamer then you should play this older gem. Its that simple. I've played it through so many times on all the difficulties. Also I was able to finish it on EASY with only the crowbar, Glock, and 357! Also check out opposing force, blue Shift, and Half Life 2 with all the Episodes! So go buy it at this super cheap price and enjoy the experience that is Half Life!",
            "review_score": "1"
        },
        {
            "review_text": "First entry i played trying to get into the series and wow. Playing through the second game is nothing like this one. I prefere all of the Half Life games before Half Life 2, they are truely one of a kind and I loved every moment of each of them. Half Life, Blue Shift, and Opposing Force are all amazing games. Played each to get up to Half Life 2 and when i finnished them i felt kind of dissapointed. I felt that the first 3 were way better than i could have ever expected.",
            "review_score": "1"
        },
        {
            "review_text": "Quality game, even by today's standards...the HD pack adds lot and the difference to textures, people and weapons is quite stark. The HD addition does seem to be unfinished though as the sounds to some weapons seem to be missing, such as reloading. Still though, it is worth it overall for everything else that it brings to the table.  Well worth a play.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommend. An FPS classic full of action, puzzle solving and fast paced, difficult gameplay that still stands up today. Definitely get the Half Life or Valve Complete pack to get the most bang for your buck, or wait for Black Mesa (the community created revamp of Half life with improved graphics, etc).  Only difference between HL Source and HL is some improved audio/textures and stuff I cannot name off the top of my head.",
            "review_score": "1"
        },
        {
            "review_text": "Half Life Source is amazing. I first picked it up last year and I loved it. I still love it. However I'm playing it again now and I'm experiencing a TON of bugs. Like in the part in Residue Processing with all the conveyar belts the map is really glitching out making a bunch of things I clearly don't remember seeing making it really hard to navigate. Another is the securrity guard from blast pit who yells 'EAT LEAD YOU OUTERSPACE OCTOPUS!' doesn't get killed from whatever that thing is called making it not pay attention at all to you etc. I'm not saying this is a bad game at all in fact I highly reccomend it it's just it kind of needs to be fixed up a bit.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best remake of a classic game I have played so for. I would highly recommend this game to anyone",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it already.",
            "review_score": "1"
        },
        {
            "review_text": "This is basically an updated version of the original Half Life.. No graphics change though if that's what you are thinking. ",
            "review_score": "1"
        },
        {
            "review_text": "The game who started it all.. Valve's proud. one of the best games i've ever played in my life, it's this: Half-Life.  A game unlike any other you've ever played. Stronly reccomended to play. It has an awesome story, sound, levels and gameplay.   Back then this was THE game to play among with other real-time classics like Deus Ex and System Shock 2.  Now i play the Source version, but i still know how good the classic one is. It's not been my childhood, i've discovered this game since i got Steam back in 2009, but man, i'm glad i've found this out.  So i got to play it and as i said; it's one of the best game i've played.  Go play this, you really need to, because you miss one hell of a classic game if you don't play it.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life: Source is the same thing as Half-Life only with better graphic quality and yes there props and ragdolls and if u get this game and not half life then ur not a clasic gamer and that just makes me sad :'( but if u get the original Half-Life 1st and then this then ill be happy :) Cost: $10 Rating: 98/100 Awesome",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever with physics and ragdolls. Best hero ever with physics and ragdolls. Best story ever with physics and ragdolls. Best boss ever with physics and ragdolls. Worst Xen ever with physics and ragdolls. ",
            "review_score": "1"
        },
        {
            "review_text": "It half-life, the greatest game ever, with the source engine physics.",
            "review_score": "1"
        },
        {
            "review_text": "you need to love the game form the past it is cheep a fun and all the mod for it",
            "review_score": "1"
        },
        {
            "review_text": "Good old shooter with nice interiors and suspence. Good guns especially hornet.  = 8/10 =",
            "review_score": "1"
        },
        {
            "review_text": "If you like shooting things, playing in singleplayer, and TAKING DOWN A FREAKING HELICOPTER! Then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "This is the one game you always get but never play.... WTF is up with that?",
            "review_score": "1"
        },
        {
            "review_text": "I can't remember why I played this so much.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS EPIC",
            "review_score": "1"
        },
        {
            "review_text": "Bearded mute crowbar wielding jesus is back....  RELOADED AND BETTER THAN EVER SOURCE EDITION 1902184184/10",
            "review_score": "1"
        },
        {
            "review_text": "Decent port. Physics add to the fun. But you should understand, that models and textures remained the same.",
            "review_score": "1"
        },
        {
            "review_text": "Ah Half life, possible one of my favorite game and game series of all time. I decided to pick up the old half life and try playing through it again on hard mode and it was quite a challenge for me, but a fun one nonetheless. If you have not played this game yet and are considering buying it, ask yourself this: Do i like shooters? Do i lke survival horror shooters? Do i enjoy a game with fast paced action, linear movement of story, easter eggs, fun, and a game that is just so good that i cant possibly resist playing it? If you answered yes to any of those questions then this game is right for you. A word of advice though, this is the source version so while osme textures are improved there are an abundance of bugs, glitches, and new errors. if your willing to look past all that (which is easy to do) then buy this version. If not then just buy the original half life. Either way I highly recommend this game as it is easily a lifetime classic.",
            "review_score": "1"
        },
        {
            "review_text": "So this is like half life but on source and with achievements, wow.",
            "review_score": "1"
        },
        {
            "review_text": "love the game if your looking to begin your half life saga definatly go with the original,it has my hiest recomendations.I have had it and played it sese i was 10.",
            "review_score": "1"
        },
        {
            "review_text": "awsome ",
            "review_score": "1"
        },
        {
            "review_text": "I really liked the game until mid way through it glitched out and the controller thumbsticks stopped working i wouldnt care much if i handn't spent the entire game so far with a controller. a little thing to complain about i know but i have played and purchesd meany old classcs on steam that deserve respect and most of them dont even work eny more please valve sort this crap!",
            "review_score": "-1"
        },
        {
            "review_text": "If nothing else it's a good excuse to replay a game you already love.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a mod some kid made in middle school that took the Half-Life textures and models, recompiled them for the Source engine, and copied and pasted the original coding with NO BUG TESTING. Just read the curator review: 'Dont expect anything its Half life 1 with ragdolls and better water.' well thats exactly what it is. Only you have to skip chapters or cheat to get to some parts. All in all, get Black Mesa, a free HL2 mod with recreates this game in HD, excluding the 'Zen' chapter. If you want to play Half-Life, get the Original GoldSrc or play Black Mesa.",
            "review_score": "-1"
        },
        {
            "review_text": "I do wish they did an actually remaster instead of making a few minor changes and making it run on a different engine. Get Black Mesa, a legitimate remake by fans. You only need Half Life 2 to get it.",
            "review_score": "-1"
        },
        {
            "review_text": "beard",
            "review_score": "1"
        },
        {
            "review_text": "Bringing back the original. Supa happy fun time!",
            "review_score": "1"
        },
        {
            "review_text": "Like the original half-life, but improved. Simple as that",
            "review_score": "1"
        },
        {
            "review_text": "Just get the original otherwise you'll be missing out on its better spin-offs: Blue Shift and Opposing Force.",
            "review_score": "1"
        },
        {
            "review_text": " The black sheep of the Half-Life series",
            "review_score": "-1"
        },
        {
            "review_text": "Steam should offer Black Mesa as compensation for those of us who mistakenly purchased this game thinking it would look, play, feel and sound newer than the original, which we also paid for.  One of the biggest rip-offs since Running With Scissors debacle of Postal 3.  Sorely disappointed, but we know Steam doesn't give a hoot as long as the money keeps flowing. I strongly recommend gamers wait for Black Mesa to be fully bug-free completed (with Xen chapters) and stay well clear of this.  I award Half Life: Source minus 100 stars.",
            "review_score": "-1"
        },
        {
            "review_text": "Just buy it. You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "I think this is a good game but there are a few bugs because when I was in the room where the scientists were while they were testing (spoiler ahead) before they died there was a dude who was floating above a chair but he was in a sitting position I have screenshots if anybody wants to see them",
            "review_score": "1"
        },
        {
            "review_text": "The graphics may be slightly improved and have ragdolls, but on someparts, I've had glitches with graphics and honestly, they're really aren't that many differences between this and the original, in terms of graphics. Get the original Half Life 1 for faster load times and less glitches.",
            "review_score": "-1"
        },
        {
            "review_text": "While I liked HL2 this game is not for my taste too old and buggy",
            "review_score": "-1"
        },
        {
            "review_text": "Half-Life, now with better graphics and level skipping!",
            "review_score": "1"
        },
        {
            "review_text": "great game very original",
            "review_score": "1"
        },
        {
            "review_text": "This game has made history.",
            "review_score": "1"
        },
        {
            "review_text": "This game is freaking amazing. Enough said.",
            "review_score": "1"
        },
        {
            "review_text": "For some reason Valve decided to update Half-Life: Source and fill it with lots of bugs and issues, and unsurprisingly doesn't give a ♥♥♥♥ about it anymore and won't fix the problems either, so i recommend to either buy the orignal Half-Life or get the old version of Half-Life Source some where else.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm sure I don't need to boast the quality of this game; Half Life is a classic, and any fps enthusiast should play through this at least once. The Source version did demonstrate some difficulties. Music stops at level change. Certain textures are missing (towards the end, the white spluge turns into black squares when landing). There is a level where the aliens simply don't attack me. There is a boss (the one producing the crabs) that is completely unaffected by arrows. Some of the trampolines at the end simply don't work sometimes. I don't know if the original version is available on Steam, but I'd recommend looking into it.",
            "review_score": "1"
        },
        {
            "review_text": "The begining of the most epic game stories. You just must to check it out.",
            "review_score": "1"
        },
        {
            "review_text": "This is basically  Half-Life  with an actual physics engine. As it is, this version is more for people who want to experience Half-Life with some more modern conceits. (The Source version of Half-Life Deathmatch is  separate .)  The physics engine in question is Valve's Source engine, which means adjustable field-of-view, higher resolution displays, ragdoll physics, and more realistic water that you can see into somewhat (which  kind of  ruins the scenes with the Icthyosaurs, kind of). There is also Oculus Rift support.  The MP5 functions slightly differently: it bounces up and down more in your hands when it fires, and the bullets fly accordingly. The weapons, IMO, are even more satisfying overall than in the original version.  The port itself isn't stellar. There are some texture, scripting and AI glitches that you may or may not experience. I clipped out of the tram in the beginning once!   Aside from an optional HD texture pack, the ability to use certain game assets in Garry's Mod, the ability to start a new game from any chapter, and animated menu screens displaying scenes from the game...that's it. Those are the only things separating HL: Source from the original game. It's interesting overall, and I think it  feels  great if not better than the original game, but this is by all means more of an enthusiast purchase. Ross Scott used it to make  Freeman's Mind  [www.accursedfarms.com] , at least.  Others were more disappointed after the initial release. That spurred the development of a fan-made recreation called Black Mesa, which is much more of a modern remake. It's free for download  here  [www.blackmesasource.com] , and a paid version with Steam features is available on Steam  here .",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend to get this game if you have not played half life and you have been playing on another source game like gmod and cs, if not then you should get it because you need to get used to the source engine for half life 2 and the episodes.",
            "review_score": "1"
        },
        {
            "review_text": "Bwomp, bwomp, BWAH! Bwomp, bwomp, BWAH! Bwomp, bwomp-",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good remake of the original, (which I would rate a 10/10) and aside from that floating scientist at the beggining of the game it's amazing. A must play for anyone's library.",
            "review_score": "1"
        },
        {
            "review_text": "A really good game, really enjoyed my time playing it. Only encountered 2 bugs, one game breaking. The game breaking one being that after Freeman got captured, I spawned outside the map, however reloading an earlier save fixed the issue. Another being a graphical glitch that happened a few hours into the game where the textures were messed up and spazzing all over the place, but I managed to get out of that area. And also near the end of the game, the final Gargantua didn't chase me around a room for some reason. It was just pacing back and forth, ignoring me firing led into it.  But other than that a great game, got stuck at several points because I'm not the best with seeing the obvious but whatever. Worth the buy in my opinion and experience.",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "I dont like this game for 2 reasons, the rouch ymovement speed and the fact that when your running and then crouch you skid allong the floor. This makes many points in the game annoying to play and sometimes allmost impossible. However the rest of the game is flawless in my opinion half life 2 is far better in every way",
            "review_score": "-1"
        },
        {
            "review_text": "When they invented the atomic bomb they were afraid it was going to catch the atmosphere on fire and burn up the whole Earth, but they did it anyway. That took balls. Not us, though. The only people taking the risks were the ones who didn't understand them in the first place. We're not brave, we're just stupid.",
            "review_score": "1"
        },
        {
            "review_text": "This game is as good today as the first day the origonal was out. Could and often do play over again. Great story and deep enviroments.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life with better physics? Hell yeah! Let's jump into pros and cons  PROS  Great soundtrack Amazing story Great gunplay Good physics  CONS  Some animations may be missing, ie looking at hands after putting on HEV Suit. Really boring tram bit at the start Earthquake causing space turkeys? MIT did NOT prepare me for this!   But really, if you like the half life series, or you just like Valve in general, get this game right now.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life is a classic; it holds up really well, and helped define the FPS genre. It even spawned Counter-Strike. If you don't own it, do yourself a favor and buy it, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "  This game is the same as the original but with a different source engine that well i got to say i kinda liked more than the original but on a scale of 1 to 10 i'd give this about an 8",
            "review_score": "1"
        },
        {
            "review_text": "So this is the first time I have ever played a Half-Life game, and in my first 2 hours of playing, I can say that this game is fantastic. It does not have 10 to 20 minute cutscenes with loads of dialogue, nor is it a team multiplayer that you respawn in several times per round, but it is the beginning of the fps with a plot and the chaotic environment of Portal 2, which coincidentally both use valve's Source engine, albeit rougher image quality in Half-Life because it has been ported to this engine while it was in its early days. It does become a little addicting once you start playing because you start at ground zero and have to work your way out of  hell  the facility to escape while others around you are much less fortunate. It isn't the prettiest game out there, nor is it one with a story so intricate that writing it down would result in a book larger than the Harry Potter series, but it is gripping enough that just by playing the first game, (and Half-Life can never be mention without mentioning Half-Life 3) I can understand why fans want a Half-Life 3. Plus the whole series is available for less than $10 during sales (I got mine during the Winter 2016 sale).",
            "review_score": "1"
        }
    ]
}