{
    "app_id": 28000,
    "name": "Kane & Lynch 2: Dog Days",
    "release_date": "2010-08-17",
    "developer": [
        "IO Interactive"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Co-op",
        "Third-Person Shooter"
    ],
    "achievements": 59,
    "positive_ratings": 2822,
    "negative_ratings": 1919,
    "price": 7.99,
    "description": "Pure adrenaline of non-stop action in Single Player, Online Co-op and Multiplayer. Double the pleasure and mayhem with new multiplayer DLCs!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/28000/header.jpg?t=1478892197",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: Intel  3.0 GHz or AMD 2.5 GHz or higher Memory:  1 GB (XP), 2 GB (Vista) Graphics: Nvidia 7800 / ATI X1800 or better (Shader Model 3.0, 512 MB Video Memory) DirectX®: 9.0c Sound: DirectX 9.0c Compatible Sound Card Controller Support: Xbox 360 Controller",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you can look past bugs, textures, enemy AI, and the cover system. You'll find a game that clearly had a lot of love put into it, unfortunately, the budget given to them didn't allow for the full picture.  I would definitely recommend picking this up whenever it's next on sale. If you keep in mind that this is a low budget title, you might be surprised what you find. It probably has the most unique soundtrack for a shooter you're likely to find. It really helps punctuate the main-character's mental illness and the insanity of the events that unfold over the course of the game's story.",
            "review_score": "1"
        },
        {
            "review_text": "Despite its linearity, Kane &amp; Lynch 2 offers memorable (although fantastically gory) action sequences. There's a highly crowded environment that wants to be discovered, the main characters feel both unique and real, but the story mode is extremely short and somewhat unfinished. The sound is breathtaking and the difficulty is extremely high, so... It's definitely nice, but limited to hardcore gamers (with that being said, the original multiplayer is long time dead).   As you might understand, it offers too few hours of fun, so the price/quality balance might not be that attractive until you find a sale... c(;",
            "review_score": "1"
        },
        {
            "review_text": "At first I really liked this game, but the aiming is so broken beyond repair. I'm not talking about going full auto on a 10m away enemy and miss every shot (that's of course understandable). I'm talking about unloading all the shotgun shells on an enemy at a point blank range and he wasn't even scratched - I got killed instead. Tested repeatedly on the same enemy, I always consistently missed point blank shots. This is not realistic shooting anymore, this is broken shooting and it's irritating me. I had to stop playing after like the second level or so (the first level doesn't seem to suffer from this erroneous aim issue) I was looking for fun, not annoyance.  For those who complained about shaky camera, there's a setting to turn this off in 'Controls'. This game has issues, but shaky camera isn't one of them.",
            "review_score": "-1"
        },
        {
            "review_text": "What makes this game so disappointingly bad is not all of its bad qualities, but all the good ideas that were executed poorly.  The game's unique 'amateur Youtube video' style is one of the most unique aesthetics choices I've seen in a while. There is a healthy dosage of shakicam, the screen has artifacting, the video lags when you are near explosions, and there are light streaks from very bright lights.   Unfortunately, the problems this game has will make you forget those things. The shakicam is very disorienting, both during combat and when trying to figure out where to go (a strangely common problem in a linear cover shooter). Furthermore, the actual combat is too basic and the enemies don't really change besides what they are using. Lastly, all the automatic weapons have terrible recoil and spread, which makes the rifles and shotguns the weapons of choice.  Lastly, the game is short. It took my friend and I 3 hours to complete it on Medium. It's not worth buying even on a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Kane &amp; Lynch 2 is what the first game should have been. I played the first Kane &amp; Lynch all the way to its conclusion and knew what the developers were going for, but they never really hit the high notes with their first effort. Kane &amp; Lynch 2 is completely different in that respect as this game is raw, brutal and very violent...   It still has a host of missed opportunities gameplay wise regarding controls that could have been tighter; the cover mechanic work but only just and the weapons; while most feel good, there are a few that don't really feel under powered. The game also suffers from a very short story mode that severely hampers the overall product on offer.   The positives do make up for the negatives above in some respect. The story maybe short but what we have is two desperate men fighting their way out of China's criminal underbelly. From the first mission where Lynch needs to 'talk to someone’; the whole scene is turned on its head in seconds. What entails is a desperate struggle for survival for our two main men. Although the quality of dialogue varies it is still nice to hear Kane and Lynch communicate with one another. Lynch, who has deep lying mental problems, can be heard talking to himself more frequently over the course of the game. Kane tells him to pull it together has he knows what a loose cannon he can be but this fuels Lynch even more. Also, when the s**t does hit the fan, the characters sound like they are clearly fuelled by adrenaline when talking... This is a very nice touch and in some fire fights, it adds momentum to the scene. Graphically, this is where the game stands out to me! The handheld video effect is amazing and adds the grit that this story needs for player immersion. When you see naked people or shoot someone in the head, the camera goes blocky just on the 18+ parts. The brutality of the killings is better overall and I was pretty bored with other games that had gratified enemy’s heads exploding up walls. With this kind of game, this sort of graphical execution is great and differentiates it from the pack.   There is other stand out moments in the game but I wanted to just mention Arcade mode and multiplayer. On PC the multiplayer is dead which is a shame has the modes on offer where great and a lot of fun to play. However, if you and your friends have this game, you can do coop through arcade mode and story mode using HAMACHI (program that lets you connect to friends over the internet but tells the game you are playing it through LAN). Arcade mode is fragile alliance which is a great and it will keep you busy for a while. It's a bank heist with 8 other players, AI or friends and you; the mission? To escape with the money but friends can turn on you at any point in the level. It’s nice being on edge all game as an alliance in one round can be forged by helping a team mate out if they are caught in a sticky situation, however; due to the nature of the levels you can sometimes shoot a heist member accidently meaning you are labelled a traitor for the rest of the round. It is a stand out feature but is lacking further development as the 7 levels can be completed in around 5 hours. The only drawback to such a feature is the guns that you unlock as you gain new ranks.   In conclusion it is a package that should have been developed better as a single player game with the multiplayer additions adding weight to the product. Instead, what the game has is a under developed single player and good foundations for multiplayer. Combined it is a game that would be a good pick up from the bargain bin for under a tenner given that the online multiplayer is dead. The single player game is worth a run through twice if you like collecting achievements but a once through is suffice. I do like Kane and Lynch 2 I just wish the single player had a few more chapters and because of this, it gets a good 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the definition of gritty, disturbing crime underworld and how easily you can ♥♥♥♥ up just in seconds. Neo-Noire just as it is. First you've met with your friend and now both of you are canvas for a knife. Seconds ago you're going for the deal and now you in the backyard of some flat saving life of chinks girl. Dirt and constuction sites, narrow streets and backyards of Shanghai, no sun at all and rain all the time. In firefight you screaming name of your teammate just to check is he alive or not, because you're really afraid to be alone in this ♥♥♥♥. Most gruesome and disturbing experience i've ever had.  Camera effects and chinese elevator music just add up those feels Underrated\\10",
            "review_score": "1"
        },
        {
            "review_text": "Great co-op and a lot of fun =D",
            "review_score": "1"
        },
        {
            "review_text": "Play it in coop to have fun and not to struggle and multiplayer is dead by the way and that is sad.",
            "review_score": "1"
        },
        {
            "review_text": "Serious game about serious business. Kane &amp; Lynch 2: Dog Days is a realistic shooter about chinese gang wars. Graphics are pretty cool, characters are memorable, charismatic and just awesome. Storyline is not so interesting like in first K&amp;L game. But game is still badass and characters are ♥♥♥♥ing psychos. Very nice.",
            "review_score": "1"
        },
        {
            "review_text": "wow such criminal many guns china very co-op much action so stylish cool gameplay plz play  Doge Days",
            "review_score": "1"
        },
        {
            "review_text": "This is a vastly underrated game easily worth the current price tag of about 10 bucks.  Whether you will like it or not, though, might mainly depend on how you will feel about the camera perspective - a shaky hand cam following your character around. I for one came to love it. Yes, it does need a bit of getting used to, but then it provides a remarkably authentic feel of actually 'being there'. There's no other TPS with this unique atmosphere. Also, considering the game is from 2010, the graphics did age surprisingly well. (Edit: I just became aware of the fact that you actually can make the camera more 'steady' in the options, so if you're put off by the default camera, this might let you reconsider.)   The shooter mechanics we get are competent. There's situations where your char will not use the cover like you'd intend him to do, but that's an issue encountered in almost all cover shooters. Also, I can't remember any other game where the impact of enemy bullets into your cover feels equally menacing.   The story is nothing to write home about, but more important IMO is that the two lead characters are interesting and - in their special way - likeable. I find they are much better than those we got with GTA V. The story mode is not very long, but quite replayable because the Shanghai settings are fun. If you're even remotely interested in third person shooters, you should absolutely get this.",
            "review_score": "1"
        },
        {
            "review_text": "Great sequal that is a lot better than the first game. I wish the controls were more fulid and not so clunky. But even though the controls it is still fun to play and see how deep Kane and Lynch are in being in China. I do hope theres a 3 just with no horrible online that this game had.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, severely under rated. This is where Payday stole their conccept from.",
            "review_score": "1"
        },
        {
            "review_text": "Made in China",
            "review_score": "1"
        },
        {
            "review_text": "KANE &amp; LYNCH 2 DOG DAYS... YOU NEED TO LOVE THIS GAME!",
            "review_score": "1"
        },
        {
            "review_text": "Horrible Multiplayer. The Network Lag is unbareable when playing with friends.",
            "review_score": "-1"
        },
        {
            "review_text": "How the ♥♥♥♥ can a game be this bad?",
            "review_score": "-1"
        },
        {
            "review_text": "Best puzzle platformer i have ever played. Tons of guns, very large online community, and downloadable hats. Easily the best game of 2011.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is your normal third person shooter with your cover mechanic. But it has that gritty gangster style you see in movies like Heat and Public Enemies. Good ♥♥♥♥!  It's short and online is dead.",
            "review_score": "1"
        },
        {
            "review_text": "Im sure im not the only one annoyed IQ Interactive cancelled Kane And Lynch 3.",
            "review_score": "1"
        },
        {
            "review_text": "meanwhile in shanghai",
            "review_score": "1"
        },
        {
            "review_text": "this game is really underrated it is the funnest game you will play i actually cant stop playing this games.  ps. if you thought the shawshank redemption was good story then you will love this masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "One Hell of a 3 Hour Thrill Ride!",
            "review_score": "1"
        },
        {
            "review_text": "  While a finished review won't be coming anytime soon, i'll say it. I really enjoyed this game. It contains an absolutely superb storyline, except for its ending. It was very shocking and disturbing, even with the game's censorship. Good multiplayer, storyline, the final parts of the campaign were awesome, both in storyline and gameplay (Except for the ending scene), and a great vibe and style, surely, a very good game, only let down by some gameplay problems, and the ending scene.  8.5/10 ~Fun times, amazing times too.",
            "review_score": "1"
        },
        {
            "review_text": "Horse ♥♥♥♥♥ from the start till the end.  Here's what you can expect from the game.    Terrible filters overlay    Terrible camera work    100x Opening doors cutscenes    Awful FOV, seriously wtf    Running gives you motion sickness from the low fov and for the shaky camera    Shooting and cover system blows    BOT partner turn out to be useless. (who knew!)    Better than the first but still pretty awful  ",
            "review_score": "-1"
        },
        {
            "review_text": "I'm sure this would be a decent game if I could keep it up and running long enough to really enjoy it. With the small amount of game play I've got in I've had numerous crash to desktops and a few bug that stopped me in my tracks. Literally. My character is standing there getting shot while the audio from a cutscene plays in the background.   No recomended. Sadly. And I had such great hopes.",
            "review_score": "-1"
        },
        {
            "review_text": "Safe your money!!!",
            "review_score": "-1"
        },
        {
            "review_text": "As a Dane who loved the original HitMan from Danish IO Interactive I also eventually decided to like the original Kane &amp; Lynch Dead Men. I didn't want to buy this title at full price due to the mixed review but years after i picked up Dog Days on a discount from Steam.  In my view there are two original aspects in the game - the shaky cam and the brutal nude-level. You can either love or hate it but at least it's not medicore or generic like the rest of the game. There is so much wasted potential in this unsatisfying game.  You will hate the generic enemies coming at you in endless waves and if you have played the original the missed oppotunity in regards to the story will be down right insulting. Actually the story is insulting even compared to a generic shooter as the ending sets a new standard for 'worst ever'.  While the original also had broken game mechanics you came to accept this as a 'factor' in the fights. In Dog Days it's even worse. At the end of the day I'm sad to say the game is not worth your time.",
            "review_score": "-1"
        },
        {
            "review_text": "48 Hours of hell !!!  That what the creators of hitman promise and unfortunately they delivered. To bad it's S%&amp;* to play.  4.9/10 Verdict: Just take your schizophrenia pills and avoid this Game",
            "review_score": "-1"
        },
        {
            "review_text": "Playable but horrible. No directions no map you have to sneak so no idea of view or sightline to see who can see you and bonus no map. If you want to die many times doing simple things made difficult only because of these missing elements this might be fun for you. If it's a dollar it's almost worth it. There is realizm and then stupid this is firmly in the stupid camp.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is just a generic 3rd person shooter. It looks good, feels good shooting people and contains lots of explosions and gunfire, the story is ok-ish too. Apart from that, there is nothing this game offers other than a very short playthrough. Each level of this game is the exact same thing, no real objectives or puzzles, just shoot away until the end. I enjoyed playing this game, but it should only really be bought on sale for £4 or less.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of people didn't like this game, for whatever reason, and it does have the worst multiplayer server lobby setup ever. But, it is pretty damn awesome and pretty damn difficult.  Much like the first, the story is pretty grim and gets more ridiculous as it goes on. The boards are pretty rough and the selection of weapons is pretty awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Has a sickeningly wobbly camera like a drunk with parkinsons following you with a camcorder. Thankfully you can turn it off in the options, problem avoided. Otherwise it gives me a really bad headache.The shooting system is only decent, but still manages to be satisfying when you figure out which weapons are horribly innacurate (useless) so you can avoid picking them up unless you are out of ammo and have no choice which normally isn't a problem. There's no time to ♥♥♥♥ around with garbage weapons when you get downed in only a few hits. As far as everything else? I love it. Super violent, plenty of attitude, and it is dark and gritty, even as dark as Max Payne 3. Kane &amp; Lynch are really awesome badass characters, some of the best I've ever seen in any game. If nothing else, pick it up for some solid movie-style fun. And give us a K&amp;L 3, you A holes.",
            "review_score": "1"
        },
        {
            "review_text": "Like the first game this one is pretty good. It has about the same problems as the first, but as you don't control teammates the bad AI isn't that much a problem, and checkpointing was greatly improved. Overall much better than the first. The camera system is made to feel a bit like an amateur movie, and that's a bit distrubing at the first but once you get used to it, it's good. A lot of effects to reproduce this, like lens flares or 'bleeding' lights, but it's ok because there's a reason. Unlike most FPS that uses lens flares. SP is very short but nice. Good game.",
            "review_score": "1"
        },
        {
            "review_text": "  The good things:",
            "review_score": "1"
        },
        {
            "review_text": "I never was able to play the first game in the series, and went into this game knowing nothing about it or its background.  I can't say very much for the story. It is violent, but I can't get a hold of the story. I'm a believer that you should be able to glean even a bit of story if you jump into a sequel, but there is none of that here. It almost seems as if you're just re-enacting a bunch of gunfight scenes from a bunch of different movies.  One thing I noticed is that a lot of the game seems similar to those 'carnival-style' games where you have to shoot the ducks as they pop up behind obstacles.  Another criticism I have is the lack of jumping. You have to crouch, then press a combination of forward and uncrouch. It's a 21st century 3D game, how hard is it to add jumping over obstacles?  The graphics are fairly good, but I hate the way the camera moves. I get that its supposed to be mimicking a handheld camera, but it really goes over the top, and it makes it very hard to play the game. Also, the very-close over the shoulder angle is very difficult to play by.  As for sound design, I found that in some of the cutscenes the background sounds were loud enough to encroach on the spoken words, and I had to rely on subtitles.  I just don't think this is very much of a game. I guess if you're a fan of the series you might be able to make more out of it, but to me it just seems awful. ",
            "review_score": "-1"
        },
        {
            "review_text": "I finished this half baked game with a co-op partner and I was cursing the every moment of it. Lots of bugs and game feels very very rushed out. Kane &amp; Lynch 1 was really a good game and was a follow up of the freedom fighter 1 on pc for me. It's a shame that K&amp;L2: DD is nothing like that. on the other hand game is long and hard. Never found anyone to try the multiplayer parts. what a shame.    p.s. there is a naked mission in game!   ",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME. IT DOESN'T HAVE LOCAL CO-OP (NO OFFLINE MULTIPLAYER)",
            "review_score": "-1"
        },
        {
            "review_text": "i don kno who kane n lynch are but it hav dogs in this gam",
            "review_score": "1"
        },
        {
            "review_text": "Very good but i hate the camera in this game",
            "review_score": "1"
        },
        {
            "review_text": "You run naked through the streets.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the biggest piece of ♥♥♥♥ you will ever play. Imagine taking a huge steamer, wrapping it in a box, sending it out to consumers, and having them put that steamer into their computer. That's what IO Interactive, Eidos, and Square Enix did with Kane &amp; Lynch 2.",
            "review_score": "-1"
        },
        {
            "review_text": "The 'Extreme' difficulty is actually challenging. **** Snipers. **** Shotgunners.",
            "review_score": "1"
        },
        {
            "review_text": "I liked this for Arcade mode only , has AI bots looting and you can either side with then or back stab them in the end to take all the loot . Aside for story , its the least part of the game and didn't enjoy it at all . Overall if its on sale i recommend for Arcade mode offline , really fun!",
            "review_score": "1"
        },
        {
            "review_text": "Stop playing after 3-4 hours.  Main reason because every enemy can hit you while run and shooting from hip. Another reason because camera placement is so bad, if only i can play this game in first person mode. Cover system sucks, I never use it because when in cover mode, i can't aim properly.   ",
            "review_score": "-1"
        },
        {
            "review_text": "The first game finished so badly (one of the ending anyways) that it had to continue with Kane &amp; Lynch 2. Thats a good thing, right ? Nope. Not here. The story uses the same overused theme thats been done in movies and games since the beginning of games...revenge. Its predictable from start to finish which is kind of boring if you think about it. Theres no more character dept and Kane stops Lynch from learning more from each other right from the start, Personally I think its the biggest mistake that the devs made.  For the gameplay, I have to be honest what impressed me the most are 2 things. First is the enemy AI...It's brutal. If you take cover and don't look around you, the enemy will come up to you and ♥♥♥♥ you up. That is impressive since most AI will just stay behind cover and shoot you endlessly without anything more to do.  Second is the cover system. Far from perfect but at least this time I press C to activate it so in a very wierd way...its works. Since Kane &amp; Lynch : Dead Men, the cover didn't work almost all the time.  The game forces you to change weapons since enemies don't use all the same weapon so its possible you'll run out of ammo for a specific weapon so you'll have to change. I personally don't mind that because it forces you to change strategy to kill your enemies (don't snipe with a shotgun) and you have to think about ammo conservation as well.  Level design is the most absurb thing besides the story of course. What you see is only Shanghai city...its the same view you get from room to room, to buildings to ... well everything looks the same. So level design is just really bad, boring not appealing at all.   Story doesn't make any sense to me, why the hell are they staying in Shanghai ? Everyone in the city goes after them and the only thing they have in mind is...complete the transaction...stay here. WTF ??? It's just an excuse to use the same textures over and over....and I completed the game in 4 hours...shorter than the first one.  Sorry but this is not recommended. If at least they would of done a great job with the level design I would of recommended this. If you add everything with the bad levels, the game becomes unacceptable.",
            "review_score": "-1"
        },
        {
            "review_text": "I started this game up with my friend. Changed the mouse sensitivity from 2 Fast 2 Quick to a slightly reasonable speed. Skipped the real story to make our own. In the briefcase/luggage was a cake. It was a cake for a mans birthday. Alot of people wanted the cake so we played laser tag. They didn't die they just excepted I was better then them. Came to the guys house. Saw some censored bits. Thanked god the graphics were really... pixelly.  Finally got to the guy. He was so proud he fainted like everyone else. I then challenged my friend to make a TF2 KOTH map. He had until I figured out what happened. He's still working on it now.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun but like my review!!!",
            "review_score": "1"
        },
        {
            "review_text": "Has never worked... Piece of ♥♥♥♥ &amp; I want my money back",
            "review_score": "-1"
        },
        {
            "review_text": "very addictive!",
            "review_score": "1"
        },
        {
            "review_text": "Kane &amp; Lynch 2? More like Whopping Pile of Number 2. This game is everything wrong with gaming. Incredibly short? Check. Horrible writing? Check. Luckluster combat, vomit enducing design choices, and generic level design? Check, check, and check. You wanna know what this game boils down to? Hey, ♥♥♥♥, Kane, ♥♥♥♥, want to ♥♥♥♥ing help me with this ♥♥♥♥ing last job? Why the ♥♥♥♥ not, Kane? *2 hours later* Oh ♥♥♥♥! What the ♥♥♥♥, we got to get the ♥♥♥♥ out of here ♥♥♥♥! ♥♥♥♥ ♥♥♥♥ ♥♥♥♥ ♥♥♥♥ity ♥♥♥♥ ♥♥♥♥! *1 &amp; half hours later* Black screen. That's it. They do a job, it turns to ♥♥♥♥, they get away. The most innovative and creative thing in this game? You play a level where Kane and Lynch are slashed, beaten and naked. Yeah. Awesome. Breaking ground here Eidos. Shame the game is shot like a badly directed Youtube vid with pixelation. Dong physics would have given innovation 10/10.  ♥♥♥♥ this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I like the grittiness and adult theme, but the extremely shaky camera as well as the extremely repetitive gameplay of just plain hordes and hordes of enemies makes this not game not worth mentioning.",
            "review_score": "-1"
        },
        {
            "review_text": "this is a really fun game",
            "review_score": "1"
        },
        {
            "review_text": "If ever there were a time to recommend Kane &amp; Lynch 2, now would be that time.  With the sudden glut of shooters focused on characters going mad, the darkness of the average video-game player-character, and what I see as the start of unique artistic approaches to games (see: Routine, Tangiers, etc), it should be clear that this game was well before its time.  It was critically derided, despite being Spec Ops: The Line's nasty older brother. The censored headshots turn a stomach far faster than the gory over the top madness of any other game that comes to mind. The visual style is bright, eyepopping, unique, will never be seen again due to gamers not being ready for the game when it was released.  This game is worth a playthrough if you want to taste blood, smell sweat, hate yourself. That is in no way a point against it as a game -- it is uniquely visceral, and we will have a hard time seeing another game willing to go so far until the critical backlash from it is forgotten.",
            "review_score": "1"
        },
        {
            "review_text": "Can't go wrong with $5 bucks. This game is definitely worth $5 so long as you have a friend to play it with. The great thing about this game is the COOP storymode. Let me know if you want to play through the game with me. I've already beat it twice with other friends but the experience was enjoyable enough to warrant multiple play throughs with different friends.",
            "review_score": "1"
        },
        {
            "review_text": "I like the story that goes with this and also the multiplayer modes too",
            "review_score": "1"
        },
        {
            "review_text": "the story is good but game play and guns are bs we need to shot a dude 20 bullet with ak to kill him really ?",
            "review_score": "-1"
        },
        {
            "review_text": "dont buy it i played this game for 5 minutes and got cancer  take your money elsewhere",
            "review_score": "-1"
        },
        {
            "review_text": "Who in there right mind would recommend this game? Its terrible. Cover mechanics is terrible and outright doesnt work most of the time. The game is short and not worth playing. There are a ton of better FPS out there at this high price. Terrible game do not buy this. I have saved you. I must be a hero!",
            "review_score": "-1"
        },
        {
            "review_text": "Definitely crosses over the 'so bad it's good' threshold; a shame the storyline isn't more cohesive and the campaign a few hours lengthier because the actual shooting is some of the best out there and the game just oozes its own unique style. I also applaud the developers for having the integrity to set the game in Shanghai when so many other mediums these days are too afraid of offending that commercial market, and end up caving to the overly-demonized North Korea (Homefront, Red Dawn, Interstellar). You will literally gun down hundreds of Chinese cops, SWAT, army, and gangsters, not to mention a slew of accidental civilian casualties as this pair of dysfunctional, out-of-shape psychopaths shoot their way out of every conceivable situation. Many will find extreme discomfort in the hand-held camera style, distorted graphical effects and surreal soundtrack, but I like the way the art design gives the impression of an endless, feverish nightmare. Definitely not for everyone; fans of Michael Mann's filmography will feel right at home.",
            "review_score": "1"
        },
        {
            "review_text": "Censord violence? ♥♥♥♥♥♥♥_T_H_I_S_S_H_I_T.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros:  - 'Realistic' and well made combat  - Not buggy at all - Fun arcade/multiplayer mode - High FPS at max graphic quality (over 100 for me, which is rare in a game) - Headshot system finally works  Cons:  - Extremely short, took me 2,5 hours to complete single player at Hard mode - No location variety, always the same chinese scenario - Lack of story - DEAD multiplayer - Characters lost some charisma since the first game - No endings at all - Lack of character costumization in arcade/multiplayer modes",
            "review_score": "-1"
        },
        {
            "review_text": "Con's: 1:Can't aim for ♥♥♥♥ 2:Camra angle gives me vertigo and makes me want to vomit 3:Longest loading(buffering) time everrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr 4: Hard as balls 5:Blurred out in an M rated game  Pro's 1:Best drunk simulater ever  10/10 would buffer again",
            "review_score": "1"
        },
        {
            "review_text": "for 10 dollars you can buy this game or for 10 dollars you can buy a box of thumb tacks and put them all in your finger  ill take the second option",
            "review_score": "-1"
        },
        {
            "review_text": "Dont even attempt to play this game even on normal difficulty. AI cheats hard. I am serious.",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy it if you ate lunch and want to keep it down or don't have a friend to laugh at it with.",
            "review_score": "-1"
        },
        {
            "review_text": "100x worse than the first game. Couldnt even get past the crappy lens flares and horrible shaky camera",
            "review_score": "-1"
        },
        {
            "review_text": "The game is so bad, I would rather be Jennifer Lawrence in the Fappening right now than be playing this abomination.",
            "review_score": "-1"
        },
        {
            "review_text": "Pile of trash. The shaky camera gives headaches.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is completely garbage",
            "review_score": "-1"
        },
        {
            "review_text": "  bad game  - when you run you will feel vertigo",
            "review_score": "-1"
        },
        {
            "review_text": "I used to play it on Playstation 3 with my brother and we went kinda far in the game, 5 years after, I decided why not try it on pc since I saw it on the explorer tab from the store, OHHH BOYYYY I don't remember that this game is soooooooooooo bad... Poor graphics quality, crash each time I alt+tab and go back in the game (fatal error), insane amount of glitches, how many time my character went glitched in some kind of invisible wall, and no way to get out of it except restart (in only 30 minutes of game), and the camera moves WAY too much!! I do not enjoy this game at all.  The only good thing I can say is the overall sound quality (except gunshots) and the voice acting.",
            "review_score": "-1"
        },
        {
            "review_text": "Awful Graphics and gameplay",
            "review_score": "-1"
        },
        {
            "review_text": "Its the most impressive visuals I ever seen. It doesn't have high res texture or poligons, but the 'documentary' effect and feel make it so believable that if you stop at some places to see the environment you can fool someone into thinking that is a homemade movie. It's so real... so real. Amazing.. Its a shame that some people didn't get that.",
            "review_score": "1"
        },
        {
            "review_text": "Do You Like Bad A.I? Do You Like Headache Inducing Shakey Cam? Do You Like Generic Gameplay? Than You Love This Game.  3/10",
            "review_score": "-1"
        },
        {
            "review_text": "John Kerry and Joe Biden team up in this rambunctious adventure where two starcrossed friends become passionate homosexual lovers in a battle to imperialize China for their mother country, North Korea.",
            "review_score": "1"
        },
        {
            "review_text": "bugged purple light everywhere which they tried to pass off as deliberate. a good story but too short lackluster gameplay and feels more like DLC for the first game 4/10 for story alone. my advice if you have a console rent it you will be done in less than a day not constant play or just find a lets play your not missing out on much",
            "review_score": "-1"
        },
        {
            "review_text": "Crash, crash, and crash again",
            "review_score": "1"
        },
        {
            "review_text": "Enemies were invincible when we aimed down our sight.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very short game, but that doesn't necessarily make it bad. Although you can finish the singleplayer in a day, the characters and action make it something everyone should try. I've never seen a game with such a unique set of characters that make you love them and hate them at the same time. The faux video camera style of the game is really something to be seen.   The multiplayer is also fun for a couple of rounds, but it really isn't anything to keep you playing for days.  Is it worth $20? No.  Is it worth $5? Yes.",
            "review_score": "1"
        },
        {
            "review_text": "As a game it doesn't pack much more than shooting repetitively, but at least it does it with great care for providing a darker indie action movie like atmosphere. In the end the only thing that matters is that this game was enjoyable from start to finish, even if for a short 4 hours.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this with no expectations. Apart from an annoying wobbly doco style camera work, I liked it. But be warned, you will probably hate it. Its crappy and don't expect much if you get it. I HESITANTLY recommend this game as ITS ONLY WORTH IT IF YOU EXPECT NOTHING AND PAY LITTLE.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥ on a rusty platter.",
            "review_score": "-1"
        },
        {
            "review_text": "This game makes me want to contact Steam support and ask them to remove it from my library.",
            "review_score": "-1"
        },
        {
            "review_text": "Can I have my money back. Really. This game is pretty aweful. I mean I have played ♥♥♥♥♥♥ games before but come on, You really are going to peddle this ♥♥♥♥ off as a game?",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, recommend to everyone.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun with some awesome visuals, but unfortunately it's a bit on the short side.",
            "review_score": "1"
        },
        {
            "review_text": "If you like rectal discharge then I highly reccomend this game!",
            "review_score": "-1"
        },
        {
            "review_text": "Between the awful sound track, motion sickness, and not so great hit boxing, I barely even noticed the shallow story or lack of characterization.  I'm not trying to just get on the hate train, but there are plenty of great third person shooters out there, so I really fail to see how this one is worth your time or your money.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best third person shooters I've ever played! All the environment, graphics and all the design of the game, it's perfect for the story line... I love the camera effects (dirt, flares, etc) in my opinion, far ahead of it's time!",
            "review_score": "1"
        },
        {
            "review_text": "When I think of spectacular third person shooters, the first game that comes to mind is Kane &amp; Lynch 2. Just kidding. Kane &amp; Lynch is an amalgamation of the oh so fun elements of eye bleeding, headache inducing and nausea causing and insane frustration put into one game. Never before have I struggled to follow a character as they ran in and out of cover. Also the guns....holy geezus buddhist god of sanctity, I swear, on many occasions did I shoot a guy IN THE CHEST at least multiple times only for them to pop right back up from the ground and promptly gun me down! Nonetheless, 6969/10 would totally watch blurred/censored cutscenes and throw up again. But really....I'd much rather chop off my nuts",
            "review_score": "-1"
        },
        {
            "review_text": "Somehow they managed to make it even worse than the first one.  Nonsense shallow story, terrible gunplay, pixelated censoring (I am not kidding), bullet sponge enemies.  Don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "Not even worth buying... Game is repetitive, bluriness is among imaginable, and enemy bots spawn randomly everywhere when you least expect it. Worst of all, the whole game revolves around killing the same soldiers dressed in army uniform over and over, from start...to the end...",
            "review_score": "1"
        },
        {
            "review_text": "Had to stop playing. I don't normally get motion sickness but this game made me feel physically sick Wouldn't buy",
            "review_score": "-1"
        },
        {
            "review_text": "just don't waste money on this garbage",
            "review_score": "-1"
        },
        {
            "review_text": "Devs stole my money, refuse to refund even though game wont work. Horrible, hope china nukes em.",
            "review_score": "1"
        },
        {
            "review_text": "its a good game i have to say,but mulit seems somethingwrong in my place.",
            "review_score": "1"
        },
        {
            "review_text": "Got this game with a magazine and installed it to see if the stories were true.. They were. 10/10 would lawsuit magazine company again",
            "review_score": "1"
        },
        {
            "review_text": "I was in the mood for a Third-Person-Shooter this weekend, so I loaded up this game, because I haven't played through it since it came out in August 2010 (man, over 6 six years ago already. time really flies...).  The first thing I turned off was the shaky camera, because I would get motion sick from that. So, thankfully it can be turned off in the options menu. I started the game and I have to say I was pleasently surprised by it. I really like the setting, it's not a space station or a futuristic planet or New York City for once, but instead dark and dirty back alleys in Shanghai, China. I really like that, because it feels fresh to me (haven't played Sleeping Dogs, though), but I can't tell if it's anything like the real Shanghai at all, because I haven't been there yet. The visual style of the game is also very unique: it has a weird filter all over it. For example, a light on the ceiling is not only there, it creates a bar of light all across the screen. And there are some other strange effects like that. It works here with the setting and all that, but I don't think it would work in many other games. The gunplay is pretty solid and satisfying, but nothing to stand out. The cover system is acceptable. It works most of the time, but it feels a bit clunky and unpolished.  The campaign is shockingly short, I've beaten it on normal difficulty in 3,5 hours. That's REALLY short, but then again, I personally don't mind playing a shorter game that I can beat in one sitting. The story starts out pretty interesting, but gets more confusing as it goes on. It's just not told very well at all. What really sucks is the ending, which is very abrupt and leaves a lot of questions unanswered and a lot of things unresolved. Also, the game is absolutely 100% linear, which again, is something I don't mind. There are enough open world third-person-shooters on the market. Besides, I think linear games keep the pace up better than open world games. I haven't tried the coop mode or multiplayer because from what I've heard it's pretty much non-existent anymore.  So, would I recommend this game? Tough call. I enjoyed playing through it and liked the setting. But Space Marine, Splinter Cell Blacklist, Red Faction Armageddon, Tomb Raider, Sniper Elite V2 and Spec Ops The Line (especially that one) are all probably better third-person-shooters than this one. And Kane &amp; Lynch 2 has some rough edges and shortcomings. But if you don't mind these and are looking for a few hours of mindless non-stop action, then (and only then) I would recommend that you play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Runs very performant (144 fps vsynced) on my Windows 10 and GTX 770, everything maxed out. Good 3rd person cover shooter. If you don't mind an arbitrary story progression and rather linear maps, this will suit you. Well worth the 10 bucks, even if it is a bit short.",
            "review_score": "1"
        },
        {
            "review_text": "Just doesn't have enough soul to make me wanna play it twice. A charmless, dark affair with some strong visual design but unrewarding story. A potential cult classic?",
            "review_score": "1"
        },
        {
            "review_text": "It does have potent... Too bad it falls short on story and doesn't provide much anything new when compared to first game. Where Dead Men did the story wrong by adding too much everything, Dog days failed by giving nearly nothing expect annoying helicopter-ride.  I've heard rumors that co-op is the best part and only reason why you should have this game. Honestly story ain't much. 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "This one is a mixed bag. All I can tell is that it is really underated. The game has an amazing graphics with detailed environment and an unique graphics style. Every scene in the game is rendered like the effect of a shaky, entry-level camcorder, even in the gameplay. Some may feel frustruate, others consider as challenges. The game is strongly brutal, but most of them are censored. Again, not everyone loves that. The story itself is just like a great movie which is a bit complicated. Its gameplay is pretty basic cover point style, which seems okay in general. Talk about the game as a whole, some might love it, other would hate it, but surely you won't see that kind of game coming out often.",
            "review_score": "1"
        },
        {
            "review_text": "hard core asian gansta shoota",
            "review_score": "1"
        },
        {
            "review_text": "One of the worst games I've ever paid full price for.  Terrable...   Not fun to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Lots of fun with two idiots , kind of like the writer here .  I loved this game , two stoner like guys going around shooting people up ( We all like that right ? )  It has a story that can have you wanting to keep playing .  Graphics ? sub par ....Controls ? buggy , till you adjust .  5 / 10",
            "review_score": "1"
        },
        {
            "review_text": "This one is controversial, but I recommend it since it provides a unique experience... and goes very cheap on sales.  Yes, the game is very short (3-4h) - but it goes very well with the intensity of the gameplay and the unique camera work.  The game is presented as if it was shot from a hand - the screen wobbles all the time, there are tears, artifacts... and pixelization of victims/nudity/mutilation. It can be nauseating (I had to make a break and finish the game on second evening), but it also provides a oddly realistic feel. Paired with some disturbing scenes it can be a strong experience.  Gameplay is very hectic. We often have to push forward to avoid being overwhelmed - the covers are not impenetrable and we'll often get flanked. The enemies are rather dumb, but there's not much time to wonder about that.  I had a great chance to play the game in co-op with a friend who already finished it once and it clicked with the game's plot - he was playing Lynch who lived in Hong Kong for some time, while I played Kane who was fresh from the airport :)  Short, but very intense.",
            "review_score": "1"
        },
        {
            "review_text": "78/100",
            "review_score": "1"
        },
        {
            "review_text": "Kane&amp;Lynch 2 is a bad bad game. It is as bad as the first game. The game is only about shooting shooting and shooting. You move from one point to the next one just to keep on shooting cops. You don't do anything else in the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I can see why this game did not do great in reviews.... It's a short, cover based shooter that does not have the greatest of stories. The cover shooting does not work all that well and on occasion you are in your own line of sight thanks to the camera.  However the graphics are nice, the voice acting is great and the atmosphere is fantasic (if you suffer from motion sickness, don't play this game)  If you enjoyed the first one, you should probably give the second one a go.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent graphics, brilliant animations, fanastic artistic camera cinematics on par with legendary youtube and even a fantastic 'on-crack'-like feel to how fast the characters move.  Also you get to run around a shopping mall in Shanghai naked.",
            "review_score": "1"
        },
        {
            "review_text": "Kane and Lynch are great characters in good story. Interesting visual but average gameplay and bad designed multiplayer. But still is K&amp;L one of my favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "Kane &amp; Lynch are gross pieces of meat and this game is totally trashy. A fun 5 hour romp.",
            "review_score": "1"
        },
        {
            "review_text": "yyyyowza this game OWNS",
            "review_score": "1"
        },
        {
            "review_text": "Count me as one of those who like this. Although it can get repetitive and the combat could be more involving and lethal, it otherwise evokes a Michael Mann feel and for some cinematic, mindless shooting action it's pretty decent.",
            "review_score": "1"
        },
        {
            "review_text": "Funny humor, terrible gameplay, awesome environment, multiplayer is a ghost town. Get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing 2 players cooperative game",
            "review_score": "1"
        },
        {
            "review_text": "It's ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, this is not very good.",
            "review_score": "-1"
        },
        {
            "review_text": "Coop is dead fun",
            "review_score": "1"
        },
        {
            "review_text": "the game is kinda good... the only thing i was expecting is a little bit more of history exploration....",
            "review_score": "1"
        },
        {
            "review_text": "c'est une ♥♥♥♥♥, cassez vous ... go away of that bad game",
            "review_score": "1"
        },
        {
            "review_text": "Its ♥♥♥♥ed, i Hate it.",
            "review_score": "1"
        },
        {
            "review_text": "Boring and short. Cover and shoot and a crappy story...was worth it in a bundle but definitely would not pay 9.99 for it.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, drama packed single player, and a unique take on online multiplayer giving you much more freedom than most game.",
            "review_score": "1"
        },
        {
            "review_text": "The amount of camera shake made me feel ill. Oh and also the game is bad.",
            "review_score": "-1"
        },
        {
            "review_text": "This is good third person combat game. Not very long, not addictive, not the best, He is not at all inescapable. The multiplayer is dead unfortunately. I recommend it only if you like that kind of games.",
            "review_score": "1"
        },
        {
            "review_text": "After all that you really do have to ask yourself if it was all worth it...   of course it ♥♥♥♥ing was!",
            "review_score": "1"
        },
        {
            "review_text": "NEVER BEFORE DID A GAME ♥♥♥♥ MY SENSES SO HARD THAT I HAD TO PUKE... WANNABE HANGOVER; KAAAANNNEEEEE &lt;.&lt;",
            "review_score": "-1"
        },
        {
            "review_text": "Short game, it’s like a dirty Max Payne. Recommended if it's a few bucks.",
            "review_score": "1"
        },
        {
            "review_text": "Old,but still good :)",
            "review_score": "1"
        },
        {
            "review_text": "Incoherent story with ridiculously useless A.I. Coupled with the terribly glitchy gameplay, I wish I had 2 more hands so I could give this game 4 thumbs down",
            "review_score": "-1"
        },
        {
            "review_text": "Took me and my friend 20 minutes to find the jump button.  10/10 Would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Trying to justify why this game is good would be like trying to justify why making a cake out of ♥♥♥♥♥♥♥t would be a good idea.",
            "review_score": "-1"
        },
        {
            "review_text": "I originally played this game back in the day (late 2010) on the Xbox 360. I was pleased with this game to a greater extent than I probably should have been in regards to the heavy atmospheric elements that were present throughout the entire single player experience. At the time, the gameplay felt like a less organic version of Gears Of War. The story is by no means a complex one and can mostly be summed up as Lynch screwing things up for everybody and blaming everybody else but himself while dragging a reluctant Kane in tow as hell rains down around them.   The delivery of this mediocre plotline is where this game truly shines. It honestly feels like Andrew Kevin Walker (writer of Se7en, 8mm) and Michael Mann (director/writer of Heat, Collateral) teamed up to save this turd from sinking in development at the last minute. Unfortunately, five years later, playing this game now feels more tiresome than enjoyable for me. Perhaps I have just become more picky and bitter as a gamer since 2010.   Whining aside...if you enjoy a great atmospheric experience, can look past uninspiring gameplay and find this game to be at a tolerable risk buy price-point then by all means give it a whirl.",
            "review_score": "1"
        },
        {
            "review_text": "7,0",
            "review_score": "1"
        },
        {
            "review_text": "This game is an alright shooter but doesnt offer anything special but it is an ok coop shooter if you want something to play with a friend but this game is fairly buggy and suffers from an awful camera that often puts your character in your reticle and you aren't able to see what you are aiming at. I wont recommend this game as the only decent feature is the coop and it brings nothing unique to the table, just another bland 3rd person shooter.",
            "review_score": "-1"
        },
        {
            "review_text": "Like any open minded person out there I like to give games a chance despite mixed criticism by others just mostly because I would much rather play it myself and form my own assessment on it. But heres where I crossed the line with Kane and Lynch... The very first thing I noticed about playing this was the camera.... Its like someone just chugged down vodka and some idiot thought 'hey lets use THIS drunken ♥♥♥♥ faced guy as the cameraman what a great idea!' Even painfully worse was the choppy lighting effects... sure they may be pretty to look at but after a couple minutes it gets ridiculous its even worse than a Michael bay film but at least the constant explosions are better than this! Even sadder they used semi-detailed environments in this game but failed to utilize that in the game. 'Why' you may ask? Its because you are in constant gunfights like a roid raging midget on a really bad temper tantrum thats why. But even this it can be appreciated for its grade A concept for a crime thriller. Even then its a total F on the execution effort. Like oh I don't know a predictable story line? Like seriously wtf?! Whats the point of keeping the player guessing if you just keep going on repeat business of what usually happens in most similar games like this. Like GTA4 for instance but heres the thing GTA4 was actually GOOD they did what they were supposed to do to make it like what it is. Anyway I can be very mistaken about this entire review because I have only played this for an hour so it is what I got out of it on this game. If anything I'm not trying to say its an overly ♥♥♥♥♥♥ game its just that I wouldn't recommend this to a friend much anyone really. Its just the fact of what you as the person thinks about it. Me personally I don't like this game much and so thats why I went on ahead and got myself a refund otherwise its just going to sit in my library of being no use except for garbage essentially. And for this review in particular I'm just sharing my personal experience and input on this and to hopefully inform and make this a little humorous to read. So if you are just here for a rating number i'd give it between 5/10-4/10 anyway I'm done criticizing this you all get the main points of this review. Anyhow cheers to all of you! :D",
            "review_score": "-1"
        },
        {
            "review_text": "Cool game for coop. Enemies have good AI. This game is nice to have.",
            "review_score": "1"
        },
        {
            "review_text": "singleplayer sucks, but i had a great time in multiplayer. in my opinion with how cheap it is, the multiplayer is so worth it if you can find people.",
            "review_score": "1"
        },
        {
            "review_text": "Two guys go on a business trip to Shanghai but what they don't know is every man in the city owns a gun and have it out for the two fellas. Even the dogs get in on the fun! This is one wacky adventure for the whole family.  Edit: Extremely short game.",
            "review_score": "1"
        },
        {
            "review_text": "Kane &amp; Lynch 2: Dog Days played on Extreme difficulty should be considered a form of art.  Damn dogs....                                    The game itself has so many problems, and my initial bits up above are incredibly pretentious. You feel dirty when you play Kane &amp; Lynch 2, it's like a ♥♥♥♥ed up porno that your weird friend showed you in high school while he laughed and you looked in disbelief. The harsh noise field recording style soundtrack, the VHS/digital aesthetic that doesn't let up, not to mention probably some of the most brutal, genuinely unsettling cutscenes ever put into a video game. It all comes together into one truly disgusting piece of work. Maybe I'm just looking too much into it and the devs just put out a crappy game with a few pretentious dialogue pieces, but there's something else going on in this game that I just feel people should look into.",
            "review_score": "1"
        }
    ]
}