{
    "app_id": 2800,
    "name": "X2: The Threat",
    "release_date": "2006-07-21",
    "developer": [
        "Egosoft"
    ],
    "publisher": [
        "Egosoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Space",
        "Strategy",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 212,
    "negative_ratings": 50,
    "price": 4.99,
    "description": "X²: The Threat is of a new generation of space simulator games, you play the role of Julian Gardna who continues the story set by X: Beyond The Frontier. The updated graphics engine gives the universe a fresher feel with newly designed ships and stations adding to the complexity of the universe.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/2800/header.jpg?t=1512663843",
    "minimum_requirements": "OS: Windows 10 / 8 / 7 / Vista / XP / 2000 / ME / 98SE Processor: Pentium III 800MHz or same grade Memory: 256MB RAM Graphics: 32MB 3D card compatible with Direct X 8.1 DirectX®: 8.1 Hard Drive: 1200MB available space Sound:",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Economic simulator IN SPACE! You will HATE this game if you expect to fly around blowing stuff up like a bad Wing Commander clone and I will laugh at you for it. This game is for people who extract joy from maximzing profits as they dominate the market on space weed and use their illicit drug money to build an armada to destroy entire races because a transporter from a neighboring sector bought all the energy cells for their worthless wheat farm.  Do you like spending long hours establishing your empire? Do you like big learning curves? Do you like working a second/third job? Do you want to wreck the economy?  If you answered yes to those questions you will enjoy this game, otherwise just go away before you become another one of those people who just doesn't get it and hates the X series without really knowing why. Unless you hate Rebirth, that's different.",
            "review_score": "1"
        },
        {
            "review_text": "I've only played for a short amount of time, can't give a solid opinion yet",
            "review_score": "1"
        },
        {
            "review_text": "Good graphics, even for a 10-year old game. excellent sound and music. Immersive game-world so far.  The story (from what I can make out), centres on there was a spaceship five years ago and an unidentified spacecraft was loitering around it. They arrested the pilot. He spent five years in jail and when this prisoner was being transferred to another place, the boss of the people transferring him said were going to take charge of the prisoner, so they do, and they bring him down to a planet and that is where the game starts. ",
            "review_score": "1"
        },
        {
            "review_text": "If you're into space sims this is a good one. It emmirses you in space and you don't know where to go first.",
            "review_score": "1"
        },
        {
            "review_text": "Although old, this game is still compatible with modern machines, and still fun. In my view, this particular game is the last one in the X series that's worth buying. All of the x3 games, and x4, were missing many of the features that made this one such an immersive and enjoyable experience.  Accordingly, I would suggest that a space gamer buy this game... and skip all the rest. Egosoft's time as a producer of worthwhile space sims seems to be finished, but x2 will not be forgotten.",
            "review_score": "1"
        },
        {
            "review_text": "This isnt from the folks who made them Eve Online games, or the other countless (Explore, Expand, and Exterminate games. But another very interesting company that (quotes 'It wanted to make a space epic that will last a long time')  Most people want to just blow thru a game, and then maybe if you have the money to do it) Buy the newest game upgrade(see episode) then you have to dish the Mulla out.  NOT here folks. Theres some product placement in game(But its usually in form of a company joke: EG . you have to play the game to hear the humorous sound tracks in the background while docked at Space Stations:  A female voice says: EgoSOft thanks you for your recent purchase. Simple nature in the missions is when you visit them they are quite realistic.  As you go off the 'beaten track: Explore til you actually get to where you need to go.  A challenge is getting your Cargo to your destination (whether it be a Diplomat or civillian etc... , or some strange Cargo);or save up for a large transport(which takes time) Outrun, Outgunning(If you have the latest technology installed) or just Out smarting  pirates...arrgh.  Worth the time invested. Worth the less then *5 dollars at the time. The next best thing to the original game from the nineties: Elite, Wing Commander, and EVE of course. ",
            "review_score": "1"
        },
        {
            "review_text": "What can I say about this game . The game is what you look for in a space sim , you can do what ever you like , trade , fight , even piracy  open world , so you can play it for ever . Now when you start off it can be hard , it might make you want to say screw it and leave the game alone, but  do not dispare folks , the lack of tutorial is but a small problem in such a great game , I learned by searching how to play so just google it or go to forums from egosoft , it will be very helpful as well this comes with the players guide by right clicking it in your library on the left hand side and choosing the games manual, when you get the hang of it , it will get better , much better , going from having one small fighter , to building stations for trading , for resources makes this series the best so far. so far 75 hours in and I have not even explored half the systems or met all of the races",
            "review_score": "1"
        },
        {
            "review_text": "A realy nice game which conquered my childhood (If you ask why I only have 66hours playtime -&gt; I played the game on CD, but the CD broke :/). The In-Game Menus aren't that easy to handle, but after a few mins/hours of playtime, you should have figured out how to use the menus, and play the game how its supposed to be. Its a really nice space simulation game (as expected, cuz its a game of the X-Series).  -I recommend to buy it IF you have got the time to play it, cuz the game consumes alot of time (unless you cheat - use the Script Editor). Enjoy the game! (or not, depends on whether you buy it =p )",
            "review_score": "1"
        },
        {
            "review_text": "Lanky Dong Superconglomerate wages genocidal campaign against The Split.  Boron 4 lif",
            "review_score": "1"
        },
        {
            "review_text": "A bit old but its the best game in the entire X Series! Loads of fun and no problems/bugs like the newer ones.",
            "review_score": "1"
        },
        {
            "review_text": "Top game a massive sanf box Love it",
            "review_score": "1"
        },
        {
            "review_text": "I wouold like to preface this by saying that I am a picky person when it comes to PC gaming. If I can't customise it to play the way that suits me, I wont play it. That's partly why I became a PC gamer, because most games give you that freedom.  This is not one of those games. You can only rebind about eight actions in this game, and in particular the throttle and joystick axis are not rebindable.  So far, the awkward controls have kept me from enjoying the game.",
            "review_score": "-1"
        },
        {
            "review_text": "The tutorial is confusing, and the controls are not customizable.",
            "review_score": "-1"
        },
        {
            "review_text": "It sucks. Dont waste yer money on it if you want to keep your sanity intact! Mouse and Keyboard usage is OUT the window for any kind of stability flying... and the manual sucks too!",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunately this game is dated too much for recommendation. It's not only problem with the graphic which feels more like minecraft, but also speech is odd and does not really connect to characters. Not to mention how boring actors are in their litteraly reading of dialogu. Characters look like they are yawning, while their voices echo later.  GUI looks so boring and unfriendly that I just don't feel motivated to explore prices or markets. Now I like economy games, but considering how time is valuable, fact that X2 requires a lot of time to get into, it feels like waste of time. I will just move along to X3 and try newer game. Or newer games in general.  That's what you get when buying on impulse, seduced by great reviews by people who had very warm feelings of the game when it came out.  Mental note to self: I will never again buy old games as experiment to try-out new genre.",
            "review_score": "-1"
        }
    ]
}