{
    "app_id": 280140,
    "name": "Millennium - A New Hope",
    "release_date": "2014-04-25",
    "developer": [
        "Aldorlea Games"
    ],
    "publisher": [
        "Aldorlea Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "RPGMaker"
    ],
    "achievements": 52,
    "positive_ratings": 231,
    "negative_ratings": 77,
    "price": 4.79,
    "description": "Traverse through rich, detailed environments, recruit colorful characters and fight your way through dangerous hordes of enemies in this exciting old-school RPG incorporating 40 quests, 26 secret rooms, 8 animal kings and countless secrets and items to discover.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/280140/header.jpg?t=1544356345",
    "minimum_requirements": "最低配置: 操作系统: Windows XP/Windows Vista/Windows 7/8 处理器: 1.6 GHz 内存: 128 MB RAM 图形: DirectX 9.0 Compatible DirectX 版本: 9.0 存储空间: 需要 100 MB 可用空间 声卡: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Overall, I really enjoyed Millennium - A New Hope. It's a solid RPG with a good blend of challenge, interesting characters, story, secrets, large dungeons and a bit of humor. If you hate RPG Maker games, you won't like it no matter what I write here, so keep that in mind. For the rest of you, I'd say there's a lot to like in Millennium.   The game itself is a 5 part series, so keep that in mind when buying it. If you're thinking about the Millennium series, you should start with this one (obviously). You're then allowed to export your characters (with their inventories) to the next game after beating it. There's at least 20 hours of gameplay here, I think I finished it in hard mode at about 25 hours. I normally never play games on hard mode, but I did with Millennium and I enjoyed the challenge and extra achievements. There are a number of interesting and challenging achievements for this game. There are 24 secret rooms scattered throughout the world, 40 quests (both main and sidequests), and a lot of hidden things.   Combat is fun and challenging. The boss fights are pretty epic and there are optional tough 'animal kings' for you to fight as an extra challenge after beating the main boss. Level design is well executed. The secret rooms are challenging to find and some of the dungons are HUGE with lots to explore. Luckily, there is an option to have arrows occasionally point you in the right direction if you wish. Unlike some other Aldorlea RPGs, you get the option to have enemies visible on the map instead of random encounter pop-ups after so many steps. The plot is solid, if not ground breaking and keeps you on track. I would say the plot speeds up and becomes more complex in M2. The music was enjoyable as well.  I only have a few complaints that are pretty minor. Early in the game, gold is pretty rare! You'll need to be a bit careful with your purchases. The economy is tight so don't expect to buy 99 of every healing item, etc. My only other complaint is that there is an achievement for beating 30 quests with the last character you recruit for your party. In order to get this achievement, you need to actively avoid completing any quests for most of the game and then come back to them after beating the main boss. This is a bit anticlimactic. If you don't worry about this achievement, it's not a problem, however. Other than that, it's an excellent RPG that's well worth your time. If you're on the fence about this game, there's a free demo from Aldorlea's website that lets you play the full game for an hour to see if you like it. I hope this review gets you excited to try the Millennium saga!  ",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy the game from the Aldorlea Games. It seems to be their main style of RPG, but each of their new game is not like the previous one. Millennium - A New Hope-the best of the game, just as the incentive of five parts of the millennium, and since you bought and held the first part, then you should also play in the other, you will not regret it! It is worth noting thoughtful story, panache and music.",
            "review_score": "1"
        },
        {
            "review_text": "I can't tell the difference between what's a secret path and what's a legitimate map glitch. The music, which is already pretty bland, has managed to not trigger during scene transitions three times now. And I managed to nod off during a pointlessly labyrinthine dungeon looking for grapes.  I guess as an RPG, it does what it says on the tin, but it's a very (and that very has 20 syllables in it) paint by numbers one. There's not a lot of charm to be had in the time I've spent with it. And it's so hilariously boring. If you've ever played an RPG that tasked a simple youngster with an epic quest, you've already played a better version of this.  And for god's sakes, there's already four sequels. So I'm not expecting any sort of satisfying conclusion to this game.",
            "review_score": "-1"
        },
        {
            "review_text": "love this game",
            "review_score": "1"
        },
        {
            "review_text": "Good old school rpg  ",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! The only downfall is the music.. It's stupidly cheesey. Other than that, it's a pretty decent RPG. I'm glad I bought it.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's a rather short, if fun little RPG. Those who might be put off by the length should remember that it's the first entry in a series of five separate games. Another thing to note for players keen on immersion are jarring moments when the 'tone' of the game becomes very humorous and tongue-in-cheek, almost to the point of self-parody. This contribues to the game's charm, but it can be irritating to some.",
            "review_score": "1"
        },
        {
            "review_text": "Played this originally in mid 2014 and just bought them all again. Looking forward to the Mellennium series all over again!",
            "review_score": "1"
        },
        {
            "review_text": "Script is Hanging bug occurs frequently at startup of this game.  Have tried alternative rgss dll files, sound settings on my computer system, disabling sound completely in the millennium.ini file, the usual plethora of known workarounds (run as admin, compatibility settings) and still came back to the 'script is hanging' prompt.  Time not spent on the game was in Google learning the basics about the game maker program used to create this item, and that my rudimentary knowledge of Ruby would prove more useful there then it has trying to get this program running.  Dev is not so nice in not including the raw project files so people like myself could recompile it with the current version of RPG Maker.  Yes I also redownloaded this item in steam and disabled the steam overlay.",
            "review_score": "-1"
        },
        {
            "review_text": "This game does not support anything but 4:3 ratio screens. If you have a 1080p monitor (or anything not from the 90’s) you’re out of luck; you must either go out of your way to figure out how to force the aspect ratio to not stretch to fit the screen or deal with the stretching during gameplay. If you manually (there is no in game option) change the settings from fullscreen to windowed mode then the window is unplayably small. There is no options menu at the start, no keybinding, no support for anything other than keyboard (unless you manually change the .ini file to enable a mouse). I can't comment on gameplay, because I couldn't bring myself to look past the abhorrent laziness in development that slaps you in the face just in the few first seconds of starting the game. Sure, it's a cheap (inexpensive) game, but does it really have to be cheap (low quality)?",
            "review_score": "-1"
        },
        {
            "review_text": "Boring story and gameplay. I have no pros and cons its plainly boring and I shouldn't have bought it.",
            "review_score": "-1"
        },
        {
            "review_text": "An rpg maker game. Graphics are the same as every other game made with the same tools, music is amateurish and the combat is laughable. You get the monsters standing in front of you - twitching to imply they're attacking. Your party members are presented as avatars and are not otherwise visible. A fantastic game to get 3 cards from and then to delete it with passion.   While writing this review I noticed there's a limit that you have to play the game at least 5 minutes before posting a review so I'll waith for the first card before pushing the 'Post review' -button.",
            "review_score": "-1"
        }
    ]
}