{
    "app_id": 280200,
    "name": "Eterium",
    "release_date": "2014-04-15",
    "developer": [
        "Rogue Earth LLC"
    ],
    "publisher": [
        "Rogue Earth LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Space"
    ],
    "achievements": 12,
    "positive_ratings": 37,
    "negative_ratings": 40,
    "price": 3.99,
    "description": "In this fully 3D, real-time space flight simulator, you will play a pivotal role in the war between the United Earth Alliance and a vicious alien threat known as the Revi. Strap into the cockpit, get your joystick ready, and join the fight in this retro space sim inspired by the games of the '90's.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/280200/header.jpg?t=1447360455",
    "minimum_requirements": "OS: Windows Vista, 7, 8 Processor: Core 2 Duo or better Memory: 2 GB RAM Graphics: Shader 3.0 or better DirectX: Version 9.0c Storage: 500 MB available space Additional Notes: Does not work with most integrated graphics cards",
    "recommended_requirements": "OS: Windows 7, 8 Processor: Core 2 Quad or better Memory: 2 GB RAM Graphics: Geforce 570GT or better DirectX: Version 9.0c Storage: 500 MB available space Additional Notes: Joystick or Xbox 360 Controller highly recommended.",
    "reviews": [
        {
            "review_text": "Okay, so in my hundreds of hours spent gaming via Steam I have never felt the urge to write a review for anything I've bought, until now.  Basically I was playing TIE Fighter when I decided to go on the hunt for something a little more modern. A quick (and generally disappointing) search through steam and Eterium came up. I wasn't totally convinced but decided to gamble the ~$15 and am glad I did.  Right away controller support is excellent. With my Joystick and Throttle in storage I hooked up the xbox-esque controller and it recognized it right away and mapped out the crucial controls in a well thought out and useful manner. For saving me the time of figuring out important controls and experimenting with mapping them that's a major +1. This being said this game deserves to be used with joystick and throttle (and oculus!) and I can't wait to try it again with those.  Okay, so the simple graphics that make the interludes between missions is excessively basic and the story is pretty 'blah' but the game picks up as soon as you're ready to fly. I love the fact they've included launch and recovery to be handflown. Okay, well, you can't really screw it up but the fact it's even there is great.  Combat is simple but addictive and so far the two different fighters I've used have distinctly different fighting styles and handling. The interface (while cartoony) is a throwback to Wing Commander and does it wonderfully, allowing for easy weapon selection and giving you the right amount of information that keeps your eyes moving around but not excessively so.  Is this the next great space flight sim? No, but it is highly entertaining and there is a lot of promise here and I can only hope they build and expand upon what they're offering now in the future. If you've got a spare $20 and loved TIE Fighter or Wing Commander you owe it to yourself to fire this one up.",
            "review_score": "1"
        },
        {
            "review_text": "Great game that will surprise you on a lot of the little details. You just have to get yourself past the anime characters",
            "review_score": "1"
        }
    ]
}