{
    "app_id": 280930,
    "name": "Battlepillars Gold Edition",
    "release_date": "2014-04-28",
    "developer": [
        "Hitcents"
    ],
    "publisher": [
        "Hitcents"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "Indie"
    ],
    "achievements": 43,
    "positive_ratings": 252,
    "negative_ratings": 38,
    "price": 3.99,
    "description": "Battlepillars is a real-time tug-of-war strategy game in which you command caterpillars armed to the teeth with flamethrowers, sticky honey, mines, machine guns, and more!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/280930/header.jpg?t=1478112442",
    "minimum_requirements": "最低配置: 操作系统: XP/Vista/Windows 7/Windows 8 处理器: Dual-core processor (Intel Dual Core 2.0 GHz or AMD Athlon X2 5200+ 2.6 GHz) 内存: 1.5 GB RAM 图形: DirectX 9.0c compatible 网络: 宽带互联网连接 存储空间: 需要 500 MB 可用空间 声卡: DirectX 9.0c compatible sound cards",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "WOW, easily the best 2 pack ive ever bought.. great price and even better game, simple yet deceptively complex. A solid campaign with tons of unloackable upgrades. When I post d about addtional multiplayer modes in the future, they responded quickly and positively. We picked up x2 twin packs and have been playing it head to head and switching opponents between the four of us. I am hereby recomending this game to all my friends. I will also be checking out other games made by these Devs. the gameplay reminds us all of Swords &amp; Soilders, which has been one of our favorites since we got in the Wii like 5 years ago. When we saw that game on Steam we picked it up and enjoy the online multiplayer modes in both of these games. REAL online multiplayer done right... we look forward to buying any DLC for this title the moment it is available. Also we hope they add 2vs2 multiplayer ASAP. Swords &amp; Soilders sadly never did. Bravo Devs! Battlepillars Gold Edition ROCKS!",
            "review_score": "1"
        },
        {
            "review_text": "Battlepillars who have guns, and shoot at other battlepillars. Then next level som more battlepillars who shoot at battlepillars and even more battlepillars who shoot at battlepillars. After a while there is a giant battlepillar who shoots at you, and you have your battlepillars to shoot at him/her (or hen as the Swedes say).",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game ! Just started playing this, but already think it's great. Lots of customation, replayability - great concept, and reasonably prized ! Definitely recommended",
            "review_score": "1"
        },
        {
            "review_text": "While simplistic in its stratagy, Battlepillars is a game that has orginality on it's side. There is nothing so satisfying as having your base being bombarded and then turning the battle right at the end. The graphics are delightfully cartoonish and watching your battlepillars bounce their way to their doom is fun. The game suffers slightly from 'repeat-itus,' but it is something that can be looked over if you are a fan of strategy games.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Nice game for a few hours!",
            "review_score": "1"
        },
        {
            "review_text": "I normally don't play this type of game, but this one held my interest well while only being mildly addicting. The late game could use some balance tweeks, but overall I would say my purchase was a bargain.  3/4. A nice distraction; well worth the dollar I spent.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a good strategy game with action. You can customise your army to make it your own. You can battle against your friends in a epic fight for dominance or try your hand at the single player campaign. Buy BattlePillars now and march(do caterpillars march?) your way to VICTORY!!!",
            "review_score": "1"
        },
        {
            "review_text": "Definitly one of the better indie games out there. Kind of like the mobile game called cartoon wars. Might be a few too many trading cards though. Quick summery - Its like Skyrim, but with caterpillars.",
            "review_score": "1"
        },
        {
            "review_text": "On sale? buy it. Not on sale? Buy it.  Add rocket launchers to your Battlepillars cuz yolo. Call in your bird allie to ♥♥♥♥ on your foes also cuz yolo.",
            "review_score": "1"
        },
        {
            "review_text": "oh gosh my butt! 10/10",
            "review_score": "1"
        },
        {
            "review_text": " I don't recommend or reject this game. I wish there was a 'neutral' button, not because the game's bad, because it's casual.   +Funny game +Well-made casual +Nice upgrade system +Lots of armors, weapons +Achievements  -A little  'gay'  -There are free and funnier games -Weak online gaming   PROS   1. Funny game  The game's much funnier as it looks like, believe me! I bought it at a 75% discount and for the first ten or or fifteen minutes I thought  what the f'ck am I playing? Don't even believe I bought it. Just gonna give a chance then leave . But turns out that the experience was better than I expected and I'm completely sure I wasn't the only one who thought like that.   2. It's a well-made casual  Every single detail was well drawn and well thought. The leaves falling on the ground, the 'pillars crawling to attack, the weapons animations, everything. It sounds stupid - but it's not, having a well created game, even if the concept is not good  (not saying this game concept is bad, just giving an example) , boosts the gaming experience a ton times.   3. The upgrade system is cool  It has a very nice upgrading system where, unlike almost all other games upgrade trees you usually afford useless (sometimes expensive things) to reach the stronger ones, this game allows you to focus on what you need.   4. A considerable amount of armors and weapons are available  Lots of weapons and armors are available! Lots of them! Thus, the game is way more personal and less linear, you can evolve the way you want and follow the upgrades you want. The upgrades can be related to 'pillar skins (generally armor or life upgrades), 'pillar segments (support and attack upgrades) and various others, such as increasing leaf regen or you tree maximum life.   5. Ingame achievements  The game has Steam and ingame achievements (the golden leaf). Earning any ingame achievement earns you more money to upgrade your soldiers, upgrading them probably will give you more achievements and so on.    CONS   6. A childish interface  Despite the game being awesome, its interface is waaay too childish - even though is a more complex strategy game than it looks. The point is: there's no problem for you if you intend to buy this game but if you do so you'll probably want to play alone. If you have roomates or relatives constantly passing close to your computer there's a very big chance (if not certain), that you will be mocked. You shouldn't even discuss this game with other people that are not close friends, or else there's a possibility they may guess you're a little childish, or even gay (not saying it's a bad thing, okay, just poiting this out). This is, in my opinion, the most important topic of this game. If you urge to buy it please consider this topic 6 strongly.   7. Free and funnier similar games  Yea, despite this game's great there are other free and even funnier games! One of them is the [/i]Epic War[/b]. Here are some of their best games with the same line of thought of Battlepillars and even better graphics, made of Flash:     Epic War 3  [www.kongregate.com]      Epic War 4  [www.kongregate.com]      PalaDog  [www.kongregate.com]      Epic War 5  [www.kongregate.com]      Miragine War!  [www.kongregate.com]  They're all casual and more funny than 'pillars.   8. Weak online rooms   I've been playing since a long time and I've never (I repeat  never !) seen an online room to play with. That's not a problem and does not change gameplay but you should at least consider it if you will to play with someone or earn all the achievements.  ",
            "review_score": "1"
        },
        {
            "review_text": "I Have no idea i have this.. IT WAS ON SALE OKAY!",
            "review_score": "-1"
        },
        {
            "review_text": "Wow I'm glad different people like different games cause it gets a lot of positive reviews. I don't like tower defense games or casual games so this certainly is not for me so if your like me, think twice before buying. With my backlog, I just don't have enough time to invest in a game like this.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is very random but also a ton of fun. You build segmented catepillars (segements might have legs=extra speed, miniguns, grenade throwers, etc etc) and fight incoming catepillars with the objective of getting to their tree first and destroying it. I'd say if you can get this game on sale, buy it.  Pros: -Simple -Fun -Random  Cons: -Mildly repetitive -Difficulty varies drastically (like one level might be hard but then next super easy)  Rating: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Its a game about worms murdering eachother with machine guns and lasers. thats about it. Also bird ♥♥♥♥",
            "review_score": "1"
        }
    ]
}