{
    "app_id": 281060,
    "name": "Reversion - The Meeting (2nd Chapter)",
    "release_date": "2014-07-08",
    "developer": [
        "3f Interactive"
    ],
    "publisher": [
        "3f Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 25,
    "positive_ratings": 96,
    "negative_ratings": 37,
    "price": 3.99,
    "description": "You’ve escaped the guarded hospital holding you prisoner to find Buenos Aires in ruins. Memories still missing, you must beat puzzles and collect clues to find a mysterious stranger who may hold the truth to what happened 20 years ago.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/281060/header.jpg?t=1536701624",
    "minimum_requirements": "Минимальные: ОС: Windows XP or later Процессор: Intel Core™ Duo or better Видеокарта: DirectX 9 compliant video card Место на диске: 400 MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Part2 of the Argentinian Point &amp; Click adventure series. Again quite amusing and interesting. Now you figure out who you really are and that your opponents have stolen a time machine. I'm excited about how the story wil continue ...",
            "review_score": "1"
        },
        {
            "review_text": "I played the first, so I knew what to expect. This is more of the same. It's a very simple game to proceed through, with some simple discovery and problem solving. I bought it in a bundle so maybe paid less than US$0.30 for it (Indie Gala Monday #38, was $1.89 now $2.19). Definitely worth the money in that situation, but if someone paid $5.99 I think they would be unhappy.   There are some glitches in the translation from Spanish to English, but for an indie, that does not bother me much. If you can find it for USD$1 or less, I think it is if you like point and click adventures. I think that someday the whole set will be in a reversion bundle of some sort, and that might be something to consider.   5 / 10 @ under $1  Note: If you are an achievement hunter (I am) then this is 25 in about an hour of play, so it is likely a higher score. There are also cards so it was essentially free for me.",
            "review_score": "1"
        },
        {
            "review_text": "While I do recommend this cute little game for a good timewaster don't go in thinking you will find a resolution to the story after the first chapter. It ends on a cliffhanger. Since this game came out in 2013 there doesn't appear to be a sequel in the works to tie up loose ends. I still don't know what happened. But for 50 cents during the Steam Halloween sale I think it was worth it. Just wish they would have finalized the story.",
            "review_score": "1"
        },
        {
            "review_text": "Short, not too complicated and quite interesting game.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty nice Game.",
            "review_score": "1"
        },
        {
            "review_text": "Okay first of all loved the story and plot up until the whole time travel thing, I hate time travel as a plot for games, movies, shows, anime and etc. Also here is one consistant problem throughout the game, I dont think he double checked the dialogue, subs and the words over the objects in the game. In the part with the car if you take the car battery then he spelled it 'batery' in the subtitles. Also in pablo's hideout when you use the U.V. light he says that the word starts with an a S and all I see is a giant ♥♥♥♥♥♥♥ F as the first letter, its not even close to S. Also the movement animations are so freaking dumb its hilarious. When the chubby soldier unrealistically moves while holding his ♥♥♥♥, when the maria chick runs and when you mass click an object your character has a spaz attack XD. Over all like in the last game I liked the art, the background and I like how it has some historical aspects to it. But the dialogue, by that I mean the voice acting sucked, other than the main character, they messed up on trying to sound emotional and just made it kinda awkward. I would rate 7/10 just because how hilarious this game was but also the developer needs to fix the steam/pause glitch. I was curious if some of the information he used in the game was accurate so I paused the game and went into a steam window and when I came out of it my cursor would not appear. I couldnt even select anything when I got into the game, all I could do was save and restart and that didnt even work. I almost beat the game and the only save I had was the glitched out one, so I had to restart all over again and finish the game. All together it was a pretty good game glitchy as hell, but freaking hilarious.",
            "review_score": "1"
        }
    ]
}