{
    "app_id": 281410,
    "name": "Ubersoldier II",
    "release_date": "2014-03-25",
    "developer": [
        "Burut CT"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "World War II"
    ],
    "achievements": 0,
    "positive_ratings": 253,
    "negative_ratings": 95,
    "price": 6.99,
    "description": "Deal another deadly blow to fascism!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/281410/header.jpg?t=1464639379",
    "minimum_requirements": "OS: Windows XP sp2 or Vista Processor: Pentium IV 2,8 GHz or AMD Athlon 2800+ Memory: 1024 MB RAM Graphics: GeForce FX 5900, Radeon 9600 or higher DirectX: Version 9.0c Storage: 6 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "inside gaming played it 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Just like Crash Time is a bad cop film, this is a bad WWII film. Again, heart has gone into making this game from Russian Team Burut CT, but the dialogue and voice acting are hilariously cheesy.  It looks alright - the indoor environments are well fleshed-out, and the shooting mechanics have a bit more weight to them than say, modern Call of Duty games, but the controls are a bit clunky, the gameplay can get rather repetitive and the story isn't very engaging.  It's not a BAD game, but I'd recommend it only as a bit of a guilty pleasure and even then only if it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Gemerican soldier and inappropriate music for its era makes this game a great one. At least it's playable unlike Dementium II. $.99 well spent.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: + Charecter levelup. + WW2 weapons +Return to castle Wolfensteinish feel  Cons: + Clichéd dialouges, + Predictable linear storyline + Seems unoriginal and the weapon models ould have been made better + Non-ambient OST.  Verdict: Playable but dot keep your expectations too high.",
            "review_score": "-1"
        },
        {
            "review_text": "The game begins with a dreadful chase scene with one of the worst music loops. I had to turn the music off later on in the game because it seemed to be the same 5-10 second loop everytime enemies appeared. I hated the fact, that the stamina meter and the shield meter were the same. Shooting enemies didn't feel very satisfying either. Also not a lot of variation on the enemy types.",
            "review_score": "-1"
        },
        {
            "review_text": "Not bad, buyed for 0,99€  :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is actaully well done despite being cheap.",
            "review_score": "1"
        },
        {
            "review_text": "This is the new 'Bad Rats'.  10 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "OK so this cost me a whole $2.11 so I wasn't expecting much. And that is just what I got, not much. Just another CS style run around shootin' zombies? I guessing they are zombies. Did this for about 2 minutes and then trashed it becuase after all it was only $2.11.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is incredible bad. Graphics, gameplay, everything is just very bad. There are so many free FPS games which are way better than this one that there is no reason to waste your time with this.",
            "review_score": "-1"
        },
        {
            "review_text": "World war 2 truly was a great tragedy; it inspired The Worst Game Ever Made, ubersoldier II  Still better than any anime rpg though  triggered? pls coment",
            "review_score": "-1"
        },
        {
            "review_text": "Its an old school fps shooter with nazis do you need more to enjoy a war game? GFx is really good for the age of this game. I run everything maxed wich i couldnt do when it was released a couple of years ago. Gameplay is fun and you level up your character as you progress in the game. And you can use maxpayne mechanic to slow down time fun fun fun...  GFx 8-10 Must say i enjoy the gfx in this game... SFx 7-10 Good sound is allways important and they suite this game. Music is kinda arcadish but yeah who cares... Gameplay 7-10 The only complain is the running does not feel like running.Anything else works fine...  Multiplayer can be fun with friends that just want have som fun. Dont expect anyone playing it but just start your own server for some fragging fun with friends.  If you want a fun arcadish fps shooter in world war classic standard GET THIS!... Recommended YES!",
            "review_score": "1"
        },
        {
            "review_text": "Ubersoldier II is bad. Has very funny moments of awfulness. But it's also annoyingly difficult. I say stay away.",
            "review_score": "-1"
        },
        {
            "review_text": "Winner of the 'Ghost Shark' Award",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty bad game. The guns have ridiculously low accuracy, something like 10% at 1 meter distance. If you manage to get 4 headshots, you go into 'uber sniper' mode which gives you good accuracy, infinite ammo, invincibility and slow motion for 10 seconds. Similarly there's 'berserker' mode for knife kills. You also get experience points which you can use to upgrade your health, powers and accuracy.  The story is told in the cartoon cutscenes and in text during the loading screens, but it sounded stupid and uninteresting, so I skipped all of that. Something about evil robot nazis.  Good:    Levels are reasonably varied    Standard set of WW2 weapons    Some enemies are female  Bad:    Enemy AI    Graphics    Default controls    Voice acting    Boss fights    Music    Weapon accuracy and reloading time    Story    Sound balance    Countless small annoyances   There is no reason to play this game, even if it were free. You'd be bored and annoyed.",
            "review_score": "-1"
        },
        {
            "review_text": "If you don't love this game, you love Hitler.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 better than infinite warefare",
            "review_score": "1"
        }
    ]
}