{
    "app_id": 281610,
    "name": "Homeworld: Deserts of Kharak",
    "release_date": "2016-01-20",
    "developer": [
        "Blackbird Interactive"
    ],
    "publisher": [
        "Gearbox Publishing"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Sci-fi"
    ],
    "achievements": 48,
    "positive_ratings": 2734,
    "negative_ratings": 743,
    "price": 29.99,
    "description": "A ground-based RTS prequel to the classic Homeworld games. Assemble your fleet and lead them to victory on the shifting sands of Kharak in this compelling strategy game for PC from Blackbird Interactive.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/281610/header.jpg?t=1507912407",
    "minimum_requirements": "OS: Windows 7/8/10 Processor: Intel Core i3-2100 (3.1 GHz)  /  AMD A10 5800k (3.8 GHz) Memory: 3 GB RAM Graphics: GeForce GT 440 (1024 MB)  /  Radeon HD 4890 (1024 MB) Storage: 8 GB available space",
    "recommended_requirements": "OS: Windows 7/8/10 (64-bit) Processor: Intel Core i7-950 (3.0 GHz)  /  AMD FX-4300 (3.8 GHz) Memory: 8 GB RAM Graphics: GeForce GTX 770 (2048 MB)  /  Radeon HD 7770 (1024 MB) Storage: 12 GB available space",
    "reviews": [
        {
            "review_text": "I don't usually write reviews, but for this one I just felt I have to.   First of all let me super straight - the game brought a lot of positive memories from my past when I spent dozens of hours playing Homeworld, then Homeworld 2 and then the Complex fan-based modification. The graphics, the music, the gameplay, the story, the general vibe of a Homeworld game - it's all there.   Unfortunately there're a lot of other issues with the game that I found rather disappointing. All of them seem to align with what other not-so-excited reviewers are writing.   First, campaign length. I've spent about 10 hours playing campaign only. I've tried to obtain every resource available on *all* 13 missions and it only took me less than 10 hours to get this done. I felt quite disappointed when I realised this is it.   Second, the AI is just, well, dumb. There's no real challenge here. Just built dozens of AA units and fear that AI will send ground units only? Don't worry, they'll keep on sending those fighters.   Worry an enemy AA unit will rush to help his friends being bombarded 100 meters away? Don't worry, the AA battery will just nicely sit there, waiting to be eliminated by your ground troops once you clear the area around using air units.   I haven't lost a single mission in this game. Hell, it was more of a... cakewalk.   Third, just five maps in skirmish mode? Really?   So tl;dr;. Would I spend €46 for this game knowing how short my satisfaction would be? Probably not. Would I recommend it to a die-hard Homeworld fan? Probably yes, but only if you're really willing to spend this amount of cash for a game so short.",
            "review_score": "-1"
        },
        {
            "review_text": "The best RTS Ive played in a long time, hands down.  The campaign is an absolute masterpiece. Great atmosphere, immersion, visual style and music. SUPERB mission design. Every mission is very different without being gimmicky, and offers a wide variety of strategic play. The game favors strategy and tactical control over twitch micro, much like previous Homeworld games. 10/10  While somewhat slim on multiplayer features at release, DoK has already had 3 major patches, with a fourth coming this month. The developers continue to support this game with new maps, multiplayer features and balance changes, and DLC. The MP community is rather small, but very friendly and welcoming to new players.  If I had to find fault with the game, its the occasional bugs in the Public Lobby for custom games. Sometimes there are issues with p2p connectivity, but you can generally resolve them with a restart.   If you like RTS, Homeworld, or Sci-Fi, buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Full disclosure: I'm one of those people... a 90's PC gamer that was blown away by the first Homeworld. It's been propped up in my mind as one of the greatest strategy games of all time. I've gone back and played it ad nauseum... yadda yadda yadda. I'm one of those types.  People like me will tell you that Deserts of Kharak has mighty big shoes to fill. And... It doesn't quite live up to it. How could it? Homeworld is more or less an 'ideal' at this point. But I'll also tell you in the same breath that Kharak is a game worth playing. The art is stylish. The graphics retain that sense of scale that made the original so impressive. The story is decent; more about representing a sense of place than of character development (very sci fi). Most importantly, it feels like a Homeworld game.  Like I said though, it falls short. The game is over much too quickly, and the pacing is inconsistent. Kharak is a road trip game, but its jerky flow makes it seem like you're missing out of huge swaths of the game's story.  The gameplay is flashy and nice. The vehicles are awesome but you'll find yourself falling into a successful routine and ignoring the game mechanics that are introduced later in-game. There's just not enough space to breathe and explore these new styles of play. Kharak lacks the replay value of the previous games.  While I honestly can't see myself revisiting the game on it's current merits, I feel Blackbird took a step in the right direction. It ain't a retread. Ground-based combat was refreshing. It opens up new avenues in the future.  Luckily for us Homeworld fans, Deserts of Kharak sold well enough. That's the takeaway for me. The game is a servicable successor, but most importantly, I haven't been more excited about the future of the franchise in a very long time.",
            "review_score": "1"
        },
        {
            "review_text": "the game does not allow rebinding of keys, so virtully unplayable given I need a specialist keyboard.  no pause function in SP. terrian is a big part of this game, but the group move, ect takes no account of this.  these are small but nessersary issues that need patching out, DO NOT BUY untill theses basic issues have been fixed",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, especially for fans of the original 3 games. I strongly recommend it if you like RTS campaigns or mature sci-fi stories.  + Good story. Playing this after LotV reminded me that RTS campaigns don't actually have to have garbage plot and characters. + Excellent music and audio, especially the dynamic unit chatter. Why can't all sci-fi strategy games do this? + Excellent art design as one would expect from this series. Nice graphics overall, once I figured out I needed to manually tell NVIDIA to activate my video card (the game defaulted to integrated graphics) + Comes with HW and HW2 remastered for free! + Solid gameplay. Compared to HW2, elevation and line of sight partially make up for the loss of the z-axis. Heavy units aren't as overpowered as in HW2, while turrets and motherships are far more interesting.  - Poor long-term value. I would have liked a longer campaign with more factions and the skirmish mode is bare bones with few options or maps. Devs have promised more content for free, we shall see. - No in-game pause, only pause to menu. - No official modding support as of yet.",
            "review_score": "1"
        },
        {
            "review_text": "Have been playing through the campaign and also some little skirmishes. In my opinion the game is okay, but far from being good enough to be recommended at the current price.  + unique and nice setup + some very good ideas for battle overview &amp; unit handling  - a lot of bugs/crahes - no key rebinding (really?) - tactical overview is cool but it is annoying to enter/leave it via a key, it would have benn better to automatically enter it when zooming out - You can zoom in way too close but not far enough out - really classic scissor-stone-paper principle for the units. This is okay so far if the other faction didnt just have other skins for the exact same unit type. A bit more variety would have been cool. - the campaign is pretty shallow. Especially the end is frustratingly short´ - AI is crap ",
            "review_score": "-1"
        },
        {
            "review_text": "&gt;this review may change in the future. &gt;1/25/16  This game is an absolute must for any RTS fans out there, especially ones that plays RTS for the single player. The Gameplay is the typical homeworld style, only this time, its on the ground. Unlike space where there is nothing to get in the way, the new enviroment this game is set on, offers a fun and great experience, especially since its homeworld.  The campaign may be short in RTS standard. but its the missions offers something great. Keeping the same units you built since the beginning was fun, it always ♥♥♥♥♥♥ me off to see my high ranking units get destroyed (mostly because of poor decisions). I reccomend playing it on classic mode (hardest difficulty) while the AI may not be great, the mission designs somehow finds a while to keep the challenge. In short, the single player campaign is fun.  Now for skirmish. like I said before, AI is not great and there are only five maps. Hopefully BBI or Gearbox will release free DLC maps very soon and allow modding for this (lots of potential for great mods too. Mad max Mod anyone?) You may have heard this before in the discussions of this game. Bad AI, five maps. In an RTS game that is a big nono.  Multiplayer is, like usual, the best one. Downside, region lock. So far I have been only been able to find 1v1 matches 2v2 and 3v3 takes forever, that the only way to find larger matches is through the public server browser, but thanks to the region lock, you barely find anyone (usually juse one match/server is open) I hope they fix this.  The game has some weird optimizations, if you have a good computer, a great PC? You will get stuttering, no matter what option you set in the game. hopefully in a patch they fix this. Not really surprised that the game will have optimization problems, people did say, Unity Engine (which is what this game is using) has problems running smoothly.  Would I recommend this game? yes BUT, with the very few features it has (like usual, bad AI, short campaign, five maps) the price it has right now, is not worth it.  IF YOU REALLY WANNA BUY THIS GAME. you're better off waiting for a sale or looking to other retailers/sites that offers a lower price, like ♥♥♥ or something similar   If they fix all these issues, mainly the multiplayer region locking, AI, and the fact it has only five maps. It would be great.   +Great campaign +beautiful artstyle +Good gameplay +Good Story +Use of terrain/utilizes full 3d enviroments +Challenging single player (on classic)  -Short campaign -poor optimization -five maps on release -bad AI -region locked multiplayer -Price of the game despite how very little features it has",
            "review_score": "1"
        },
        {
            "review_text": "While the campaign only has 13 missions they are all very fun and varied, the story is very interesting and has the distinct homeworld feel. Multiplayer is good and the community is friendly and welcoming. I hope the devs will continue to update and support this great game",
            "review_score": "1"
        },
        {
            "review_text": "Take Homeworld's fleet management, combine it with Ground Control's tactical use of terrain and unit abilities, and you've got Deserts of Kharak. Set in the period of time leading up to the rediscovery of the Hyperspace Core, it acts as a prequel to the original Homeworld, and has all the atmosphere you'd expect from a Homeworld title.  While the campaign is short (I finished in approximately 14 hours, in no particular hurry), the plot is enjoyable and did manage to spring a surprise on me, and the missions throw you the occasional curveball, such as commanding a team operating independently of the main body, with no production facilities. Overall the gameplay is fun and engaging, although I cannot comment on multiplayer as I'm terrible at RTS and just stomp computers while watching pretty explosions.  Unit designs and animations are generally quite good: enemy units explode most satisfyingly, Light Attack Vehicles catch air off the tops of dunes when using speed boost, Baserunners open hatches to drop turrets and sensors, and the carrier launch and recovery sequences have an intricate detail that I just can't help but zoom in to watch. This does make the lack of resource harvesting animations a bit disappointing, however. Sound design is superb, especially the chatter. During a slow period in an early mission I heard the engineering crew of one vehicle have a friendly argument with their commander.  My only real complaint is that the main camera doesn't let me zoom out as far as I'd like, so I spent much of the game in sensor view rather than enjoying the desert landscapes, but the developers appear to be taking an active interest in feedback and player suggestions, so there's a good chance this may be fixed.  If you liked Homeworld and/or Ground Control, you should buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "It is definetely a Homeworld game. Fun, challenging and rich with plot.",
            "review_score": "1"
        },
        {
            "review_text": "Although this game falls short when it comes to multiplayer because of the lack of maps and factions to play, it still holds up against other RTS games. The storyline is great and the multiplayer can get pretty intense and is just as fun as Homeworld: Remastered. The battles can last a decent amount of time and the AI loves to keep rushing you with small attack groups.  You have to pick this up if you're an RTS fan and also Homeworld: Remastered if you don't have it already.  It started with two playable factions and they have just added another with a very affordable DLC. I would expect more to come really soon.",
            "review_score": "1"
        },
        {
            "review_text": "OK. I've played through mission 5. No plot related spoilers ahead, but I like the game and the background story a lot so far.  First, the desert environment is beautiful-- dangerous, also, since the enemy AI seems to like to have swarms of a half-dozen units each patrolling around. Recon in force works better than sending out smaller groups to scout.  Rachel is in the game as a 'Baserunner', which is an engineering unit, but hers can capture enemy units like salvage corvettes used to. The generic baserunners can also build turrets for ground and anti-air, as well as mines and sensors. Rachel can make sensors, but her mines can be manually triggered or used to demolish structures for salvage.  There's LAVs, which are light scouts; there's tanks (AAVs-- armored assault vehicles?), there's long-range sniper units called railguns, there's support cruisers which repair others and act as the delivery point for resource collectors. There are likely to be bigger attack-oriented cruiser types coming, but I'm just now getting some air units.  Combat is fun and reminds me a lot of Ground Control, which is a pretty good thing. I think I'd like a bit more variety of units, but I'm only a third of the way in. Micro matters a little-- not so much in big battles, since unit AI chooses reasonable targets by itself-- but if you have a railgun plinking away at you from max range, having your LAVs use their speed boost ability can end the threat more quickly.  The camera is great and you can zoom way in if you like; focusing on a unit works better than in Homeworld-- perhaps the ground helps give a more familiar perspective when comparing tiny LAVs to the huge carrier. For that matter, the zoom out to tactical map showing the landscape in 3D with your units having a glowing blue sensor in taken directly from HW also (including the sound effects). Seems to work pretty OK.",
            "review_score": "1"
        },
        {
            "review_text": "Could have been a great rts, the campaign is very short, and quite good. But it is too short.   Multiplayer is a boring mess. Recent patch to address region locking is a good step in the right direction though.  All in all, I can't say get it until its dropped in price. Its not worth the full price.",
            "review_score": "-1"
        },
        {
            "review_text": "Hello.  After playing the game for a good bit I have come to the point where I have to admit that the game does not live up to to the huge expectations most people have from a homeworld game.  It is a good game. A well made game. It has a very nice homeworld feeling, the devs really made an effort here.   Why now a thumbs down? Like many people I find myself wishing for a neutral button right now but in the absence of one I have to choose thumbs down.  The lack of real unit varity and the rather shallow tactics are my major negative points. The missing pause function is ( if you ask me) a really stupid design decision.  The main problem is that the pure awesome feeling of drifting spcae hulks and massive explosions, flickering laser light and the depressing emptiness of space is missing.   It is a nice rts, it makes many things right. But it misses epic by a good mile.",
            "review_score": "-1"
        },
        {
            "review_text": "First of all I will preface this by saying I love all the Homeworld games and bought/played them when they first released all those many years ago. I also own the remastered editions and enjoy those as well. I also wish this review system allowed more than just a Up or Down ... but since it does I have to give it a Down because I WOULDN'T recommend this game for its full price.   So let's start off with the good. The graphics are great. They aren't taxing or mind-blowingly realistic, but for Homeworld they really fit. The cinematics in the game fit well, and are a step up from the previous games. They feature actual animation and fit in very well to the atmosphere of the game and the setting. The music is very solid and has the normal Homeworld vibe to it. The Rock/Paper/Scissor system used for the units is a bit standard but at the same time the units offer some more advanced options for abilities that allows greater strategic uses of unit. Nothing crazy in-depth or complicated, but enough that you can do things like hit and run with some units. The amount of units comes off as a bit limited at first but eventually you unlock a few more through gameplay, very similar to the other Homeworld games. The carriers themselves are great additions to the game. They're more than just your base of operations, they are slowly moving super units in and of themselves. There's a system for changing up what you want your carrier to do by diverting limited power to weapons or repair systems, ect. Still, it's a nice change from Homeworld where the mothership was little more than an anchor around your fleet's legs.   So why the 'No' recommendation? Sadly it comes down to the amount of playability I got out of it. For $50 I kind of expected more than a 9 hour campaign. Now I know you can play multiplayer but that's not really my thing. I bought this game today and finished it by tonight. I didn't rush through anything, either. I'm fairly meticulous when it comes to the Homeworld games, to the point that I NEED to get every resource before I leave to the next level. So my 9 hours could quite easily be closer to 7 for the non-OCD types.  The game was great except for that. I enjoyed the story, although I already knew the end (duh) and it was a bit predictable. There just wasn't enough meat in this sandwich to garner the $50 tag.   TL;DR: I recommend putting this on your wishlist for a sale. I'd say a $25 to $30 price point is fair for this game. I'll amend my review if it comes out with more content, but I really doubt that's going to happen.",
            "review_score": "-1"
        },
        {
            "review_text": "It was always going to be a tough act to follow the massively successful Homeworld franchise yet Deserts of Kharak copes admirably. Set on Kharak - the HW series planet of origin, the latest installment is an excellent prequel to the events of the homeworld series. Set on the harsh desert world of Kharak, the sands of said planet are in a very odd and unexpected way interchangable with the cold vacum of space from the original games; both are hostile environments inhospitable to man. This is why Deserts works so well, it retains the feel and massive scale of the homeworld universe, the art style, the lore and backstory but fleshes it out for ground combat. Would recommend for anyone who enjoyed the original HW games or to anyone who enjoyed Dune in its many multmedia guises, similarily if anyone was thinking about buying HW remastered start instead with Deserts of Kharak, then migrate into space - the RTS equivelant of doing ME 1, ME 2 and then ME 3 and keeping the same character throughout!",
            "review_score": "1"
        },
        {
            "review_text": "WARNING: JUST BECAUSE ITS A 'RECOMMEND' PLEASE DON'T TAKE IT LIGHTLY (Cons Section)  THIS IS MORE OF A NEUTRAL REVIEW  Just like many i have been a fan of the Homeworld series for a while, the lore and the gameplay mechanics used are pretty interesting and do a good job at immersing players (especially those who enjoy RTS and Science fiction). Deserts of Kharak, although being land based game does a good job (in the campaign) at using some of the mechanics it inherited from its pre-decessors and at keeping the Homeworld lore interesting, for that reason alone i would recommend this game to anyone interested in a compelling story although i would recommend playing the original Homeworld first since it fills in some of the blanks even though Deserts of Kharak is a prequel.   Pros: +Beautifful to look at graphics +Impressive artistic style used for the cinematics +Interesting story +Units and resources that are lost or kept during a mission will affect the next one during the campaign (inherited from previous Homeworlds) +Easy to learn User interface +Tactical Map +Interesting units and factions +Terrain level (sand dunes, cliffs, etc...) can be vital during a battle +Unit gouping is essential for the limited available micromanagement  Cons: - Multiplayer is region locked so public game lobby is a bit barren - Global chat seems to fail to update sometimes and your left with what was typed 30 minutes ago - Multiplayer synchronisation errors (happens often) - No display of player's ping (so people know who is causing the connection issue if it's not the actual game that is the problem) - Unknown errors (e.g. During a match one team randomly gets a message that they won the match and can only leave the game while the other team is still able to play) - Skirmish synchronisation errors (only happened twice) - Poorly optimised matchmaking - Hosting a match can sometimes be impossible because for some reason the start button is locked (happens a lot) - Skirmish AI doens't provide enough challenge with the exception of the highest difficulty where its feels like slightly borderline cheating (campaign AI is a bit more competent but best played on highest difficulty) - Lacks unit formations like previous Homeworld games -Multiplayer and Skirmish are limited to 5 maps  Neutral: = Short Campaign = Only 2 Factions available = Low unit capacity which can limit micromanagement (although it makes unit choices a bit more important) = No refresh button on public game lobby (its more of a personal con since to me its a stress button)  = Ground units sometimes fall from the sky (e.g. first campaign mission and my carrier drops from the sky into the docks)  Just as i said above i recommend this game for those interested in a compelling yet slightly short story but at the moment i can not and will not recommend this game for those looking for a good multiplayer RTS experience.   Deserts of Kharak tries to bring forth some life into a barren planet but the question is how long will that life last in such arid conditions and will it be able to adapt or evolve or will it end up being forsaken just like many others.",
            "review_score": "1"
        },
        {
            "review_text": "one of the most superior games I have ever played, great storyline almost had that last days of Krypton feeling. The action is great I never got bored at all.I hope they come out with Homeworld 3",
            "review_score": "1"
        },
        {
            "review_text": "Stay away from this unfinished, buggy game where patches make things so much worse.  The performance is abysmal even on fairly powerful hardware. I get a nice 60 fps on my i7-4770k, 16 GB RAM and ASUS 980 Strix. But... yes there's a big 'but'... I get frequent stutters and other annoyances like the camera refusing to zoom in/out at times. All the signs of a pile of unoptimized code rushed out the door.  The game's nice visuals, audio and atmosphere is ruined by technical incompetence on every thinkable level.  The latest patch wiped out my save games and persistent fleet data. How much more insult can you throw at your customers? How much incompetence can you willingly put out for the world to see?",
            "review_score": "-1"
        },
        {
            "review_text": "LOVE IT &lt;3 It has the soul of a real HW game, planetside! HW fans will enjoy this like candy!  PROS: - Everything!? From gameplay to visuals. - The graphics and smoothness between cinematic and in-game, amazing. - Such a realistic smoke from explosions, it's eye candy. - Map verticality, having an advantge shooting from top of the dunes.  CONS: - Campaign covers such a nice story, yet you end up craving more! - It's little but I wish the carrier would 'grow' or show it's researched addons/modules like the Mothership does, being able to target and damage specific systems.  Wishes: - More story in future expansion/games/dlc? Would be awesome to see the beginnings since the day the Khar-Toba crashed. And the initial developments to build the mothership! Maybe an animated movie??? - COMPLEX mod for this!  Hopes: - A prequel were you play the ancient war between the Hiigarans and Taiidans, then end up exiled.",
            "review_score": "1"
        },
        {
            "review_text": "The best single player RTS in years!",
            "review_score": "1"
        },
        {
            "review_text": "Kind of short beat it within 10 hours but still a good game. Not worth $50 though wait for it to go on sale. Otherwise great addition tot he story live of homeworld but not as epic. I look forward to where they go with it next.",
            "review_score": "1"
        },
        {
            "review_text": "I reluctantly requested a refund on this one today, even though I very much liked the overall graphics, the gameplay, and pretty much everything about it. Unfortunately, the one thing that I didn't like was the proverbial 'game killer' for me.  Here's the thing: You've got a good variety of units, all of them with very nice graphics, the combat effects are quite nice - great explosions and so on -- but you can't zoom out your view far enough to really see what's going on. To do that - to zoom out to a range where you can get a large enough picture to let you make solid tactical decisions, to see where the enemy are, and intelligently direct your forces to properly respond to the attacks -- you have to switch from the nice graphics that make this so nice to the eye into a high altitude radar-like view where all the units are little colored dots or hollow triangles moving around on a flat 2D map. Take a look at the FIVE video clips shown on the Steam store page. You can go through almost all of all five of them and what you see are almost exclusively shots of the good looking unit graphics, a few cut scenes, and more nice closeups of units showing how nice they look. BUT to see what you'll be looking at for at least 50% of the time, jump to the 21 second point of the fifth video and you'll see the dots and hollow triangles that are what you see every time you pan out to get a larger tactical of the full strategic view.  Yes, they make it easy to swich between close up and zoomed out - just touch the space bar - but they have to make it easy, 'cause you have to spend so much time in the zoomed out view, it has to be easy to access, right?  Why, oh WHY, make a game with such pretty graphics for their units, and their buildings, and then make you constantly switch to the view that robs the game of all those loveingly crafted components? *sighs heavily*  So - when someone posts a mod that lets you zoom waaay out and still see the decent graphics (they can even be tiny little units!) instead of dots and hollow triangles - someone email me and I'll re-purchase this one. I really, really wanted to like it (played both of the Homeworld games for years) but...honestly if I wanted to watch little dots moving around on the screen, I could get something made back in the 1980s.  Sorry, Devs - you made a very pretty game -- too bad you can't appreciate how nice the graphics are for over half the time you're playing.",
            "review_score": "-1"
        },
        {
            "review_text": "This review is based on the opinion of someone who has played all of the Homeworld games, including Cataclysm. So yes, I love the story and the world setting. I have very fond memories of the vast universe created by Relic back in 1999, so my review will reflect that sometimes.  To put it simply, if you like your RTS games coupled with a good story then you will be very satisfied. The 10-15 hours campaign is very well made, fun missions that focus on slick action and pacing, with a very interesting story to boot. The conflict between the Coalition forces (the player) and the religious Gaalsien is fascinating to watch as they are two very different factions, each with their own very original and very pleasing audio-visual cues. Story progression is done through in-game cutscenes and gorgeous, incredibly original, animated scenes that highlight the more important events in the game. Although the ending is a bit abrupt, the story on the whole is deeply satysfying, with frequent nods and references do the older games in the series, specially Homeworld 1.  Speaking of which, the graphics in this game are gorgeous. They are simple, elegant, and don't tax your computer heavily. Watching the land-carriers and their fleets work and intereact with each other and the enemy is a joy to watch as their animations are very well made and detailed. I love the aircraft animations in particular, as they use somewhat realistic engineering with the launch catapults and all. The larger vehicles are downright imposing and menacing, and the smaller ones give a sense of intimacy and scale that really reflects part of the reason I play RTS games: To watch and play as large armies collide with one another.  In terms of audio this game is way above the competition. The music is awe-inspiring, creating a sense of tension and wonder that is rarely matched by other games of the genre. The soundtrack is composed by arabian-indian inspired sounds and instruments, lending the game a very exotic and mythic feeling. Sound effects are also incredibly well made, form the hum of the Battle-carriers to the thumping of large-calliber weapons. Playing this with a headphone is highly reccomended.  Gameplay is incredibly fun as well, as the huge battles reminded me of a sci-fi Mad Max, as dozens of vehicles duke it out in a fiery storm of explosions deep in the desert. The player's fleet is centered on the huge Land-Carrier, a giant transport that serves not only as the production center and home base, but also as a fearsome weapon when needed. This is, in my view, a very interesting twist on the Homeworld formula. In previous games, Motherships were incredibly innefective in battle, depending wholeheartedly on their fleet's support, whereas in this game the land-carrier is a lot more independent. You don't have to babysit it all the time. As the game progresses your arsenal of vehicles and weapons expands, and each unit serves a purpose. I believe the variety is just right, enough to be complex without overwhelming the player with vehicles you'll never use.  Multiplayer is still in development and could certainly use more maps and a third faction. But as it is, it is very fun and well made. Skirmish matches are also offered, but the AI could use some tweaking. It is not bad, but it's not that bright either. I believe Blackbird will tune it up with future patches, making the game even more fun.  To sum it up, this is a very well made and elegant game. It looks and sounds amazing, with a very distinct and pleasing aura around it. I have played 15-16 hours as I write this review and I loved every minute of it. It is not an RTS made for the competitive SC2 guys. Deserts of Kharak is made for those who like a grand, epic story, with a very distinct and original feel to it. Sci-fi fans will love it. The gameplay is very fun, very original, and the two distinct factions offer a lot of gameplay options. I haven't had this much fun in Skirmish mode since Company of Heroes 2!   Al in all, I highly reccomend this game. It is a 10/10 for me, and that is rare. I seldom write reviews, but I feel like this gem of a game deserves it. Roll on HW3 or more expasions for this game!   ",
            "review_score": "1"
        },
        {
            "review_text": "Loving the transition to ground vehicular combat, very enjoyable. The campaign is surprisingly good with great little cutscenes connecting each mission, some great writing on the dialogue and the art style is fantastic, it's incredibly immersive and the radio chatter is amazing to listen to as it's so varied. Small niggles about the annoying camera controls, your viewpoint feels too close to the battlefield especially when hills and mountains come into view, it's missing vital features which every RTS cannot do without and several other things they need to tweak and fix, but judging by their official forum they're already hard at work on more maps and fixes and improvements.  It's a good solid return to the brilliant setting of Homeworld and I hope BBI continue to add and improve upon it. It's a safe addition to the Homeworld series but I just wish BBI did more with the time they spent on this game, it's good but not as great as it could have been.  So, basically. What's great is the story, voice acting, dialogue, music, gameplay, immersive both visually and through its audio and easily replayable either through mastering the harder difficulty of the campaign because the gameplay is so enjoyable or multiplayer to see how cunning other Homeworld fans can be!",
            "review_score": "1"
        },
        {
            "review_text": "Overall, I give Homeworld: DoK a score of 8.5 out of 10.  While it may not be a revolutionary RTS, there are some excellent tactical elements to this game that look like it will have some longevity.  Before the launch of this game, a lot of people were complaining about the number of maps and units in the game. While it is true that there are not a lot of each, this game has done a good job with adding some depth to standard RTS elements to give what the Homeworld series was originally known for - tactical strategy.  The individual units in the game can level up, increasing their power, armor, etc. Research also allows for various special abilities, so the base units in the game can really be customized and used in a variety of ways.  The mobile carrier that is your main base is an interesting change to traditional RTS where you have to build stagnant bases. This is where you build your fleet and research, but you can also customize the abilities of the carrier to make it tougher, a repair hub and/or a strong defensive base.  I'm only about 1.5 hours into playing the game so far but wanted to give my initial review. Personally, I'll be keeping this game. While it may not be worth a full $50, I got it with the remastered package, so all together they are well worth it.  I do hope the game will expand with some additional content in the coming months - more map variety and maybe a few more units couldn't hurt. However, I'll still be happy with this game without it.  Honestly, my biggest complaint about the game is the graphics. They're not horrible but they're not great either. They don't feel like an A+ title in 2016 (close-up shots during the cutscenes show gradients realy bad, for example). However, during normal gameplay, the graphics are decent and have a nice feel.  Overall, if you enjoy RTS games (especially if you like on-the-go combat) and/or are a fan of the Homeworld series, I would recommend DoK.",
            "review_score": "1"
        },
        {
            "review_text": "Definate feel of the Original spacebound Homeworld games. Though lacking some of the depth in settings. No ability to modify Fleet size in game options... 125 units is one size fits all. Also with only a half dozen maps.... the views are limited.   On the up side... the views are AMAZING. Absolutely beaufiful feel of the game and vehicle movements. All the tiny variations in elevations have an in game effect on lines of sight and the weapons that require it.  The in game campaing and story line were nicely done and quite entertaining.  Ideal patch/update would have  Deathmatch Resouce Deposit adjustments (size and frequency) HUGE maps - what's the point of having spectacular landscapes if you can't enjoy them Night time mode or ability to pick time of day for games (one map is set in dusk - definately has room for more options here)  A must have for Homeworld fans.",
            "review_score": "1"
        },
        {
            "review_text": "This is my first experience with an RTS, and I just plain loved it. The story was cast as a quest for this people's history, and was very well-done and engrossing: I eagerly looked forward to each ensuing mission. Graphics and sound are excellent, and the gameplay is fascinating -- there's something about moving tiny vehicles around a map that brings back feelings of playing with tonka trucks as a kid! Kharak is a wonderful game, I highly recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing art and music! True inspiration",
            "review_score": "1"
        },
        {
            "review_text": "True this is hanging on the coat tails of the Homeworld series. But this is a genuine new expirence that integrates the brilliant RTS element to show that Homeworld was and always has been the best RTS on the market.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, diferent from the original, but has the same feel.",
            "review_score": "1"
        },
        {
            "review_text": "Ahhh.. i can't remember the last time i played such an indepth, fast paced RTS in a LONG LONG time... Enough said going to play some moreeeee.",
            "review_score": "1"
        },
        {
            "review_text": "Its homeworld... enough said. Ok, to be fair... I really like this game. Its got some unique challenges, terrain, and units that the space based Homeworld games do not. Also, the campaign has a super intriguing story, just like the originals. I have been waiting 16 years for THIS game. I really like it and I cannot wait till I finish it. The balance is really well done and hoenstly its a nice breath of fresh air in the RTS genre.",
            "review_score": "1"
        },
        {
            "review_text": "For thoe who still harbor fond memories of Homeworld 1 &amp; 2, the ambiance of this game will be familiar and comfortable. Great story, campaign could be longer so I am hoping for more DLC oriented towards single-player. Skirmish &amp; Multiplayer is fun once you finish story, however, starting from scratch leaves one feeling chained and so far the matches move so quickly, tech-tree so long to build that one feels hobbled. The music is defintely awesome and worth the purchase, most of the reason why the game is so comfortable for old school fans.  Love this rendition, look forward to more from GearBox on this and hopefully larger space-based games set in the Homeworld Universe.",
            "review_score": "1"
        },
        {
            "review_text": "Ok.. The good, the bad, and the ugly... The Good. The game was fun to play, pretty pictures, nice maps, cool concept. The Bad. The game WAS fun to play... The Ugly. Well folks, looks like the Devs consider this game finished... so whats wrong with that. well for one the replay value isn't there. the skirmish maps are very few to choose from. the AI is a mess. Two games on easy the first I win because after the first attack they never really came after me again. The second game still on easy I get rushed in the first few minutes before I can even establish myself and after the first game I got a good feel for what to do... or so I thought. It seems the AI could use some work and I waited and waited and it never happened. And I wish Steams ranking system was a little better because it is.. was fun... but needs work. So I am left with giving it a big 0 because I can't give it 100% and can't rank it somewhere inbetween.",
            "review_score": "-1"
        },
        {
            "review_text": "I've never imagined Unity engine could achieve this massive battleground with Michael Bay explosions while the vehicle dynamic got so well simulated. Bringing the immersive gameplay just like I was there in the deserts of Kharak.   And the Expedition Guide was definitely the best eBook I've ever read. The character intros, the storytellings, the 3D viewers, the galleries, the films, the dev logs, totally fantastic!   I'm really glad the Homeworld title was brought back to the hands of its original creators. Every effort focusing on the details made the game so distinctive and so touching.   I think it's a good start for Blackbird Interactive and I'm eagerly hoping they could bring more and more fascinating contents in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Getting refund due to lack of ability to rebind hotkeys and other dev abandonment",
            "review_score": "-1"
        },
        {
            "review_text": "Very good Storytelling, interesting Missions.",
            "review_score": "1"
        },
        {
            "review_text": "Sublime. No other game makes me feel like I am experiencing the sublime as well as a Homeworld game. I was nervous about Deserts of Kharak--the developers haven't made a Homeworld in twelve years, and the last one they made was in space. Could Deserts of Kharak be any good?  Yes.  Yes it could be.  I don't know about Multiplayer or Skirmish--I don't play Homeworld for that--but this is totally a Homeworld game. All the mechanics that really mattered are here, and, to be honest, they make creative, worthwhile use of the terrain in one of the most innovative ways a developer has ever done. Great story, great gameplay, great campaign.  It's Homeworld.",
            "review_score": "1"
        },
        {
            "review_text": "Deserts of Kharak really brings me back to Homeworld -- the look, the sound/music, and the story are all great. There are a few points that are kind of iffy, though:  - Playing it is a little bit of a pain in the ♥♥♥. The regular camera doesn't zoom out as much as you'd like, control groups are a little wacky, unit formations can be suicidal, and so on.   - The story is pretty short. Eight or nine hours on normal difficulty. There's skirmish and multiplayer, but the skirmish AI is not very challenging and I'm not really interested in multiplayer.   - There's really not a ton of variety in the way that missions play out. Sometimes you have to collect an artifact or place some turrets, but basically a couple big control groups attack-moving will carry you through the game.  - No unit variety between factions that I could see. Obviously they look different, but each of the two factions share the few basic unit types. The DLC factions are really minimal reskins of the two standard factions -- don't bother.  With that said, for $25 I feel like I got my money's worth, but at the regular price of $50 I'd feel kind of ripped off. In general, it's just how I like RTSes -- a little more sweeping and 'arty' than StarCraft, not too much boring macro (Planetary Annhilation), and the great Homeworld feel. I just wish it had more and more varied missions.",
            "review_score": "1"
        },
        {
            "review_text": "while not the equivalent of the original homeworld games, it's still a good game. Was not originally supposed to be a homeworld title. Price maybe a little high, but wait for it to go on sale. Would be nice if this got enough sales that they made a real homeworld sequel. Campaign is kinda short but the story is good and the gameplay is good. Like i said maybe not worth full price for everyone, but if it goes on sale for $10-$20 could be worth it.",
            "review_score": "1"
        },
        {
            "review_text": "The concept was sound....the carriers are a awesome idea. But something seems missing...hence the lack of replayability. Everyone should play it once if the love RTS, but wait for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Like homeworld but on the ground. Compared to Homeworld..  Pros: -Game mechanics are executed really well. Line of sight and artillery are excellent additions that add another dimension to combat. -Unit types feel well balanced against each other both in single- and multiplayer. -With smaller maps and 2 dimensions, the pace of the game feels a bit faster  Cons: -Campaign is short (~8h) and not terribly polished. -Fewer unit types, and none feel terribly impressive. Models seem less detailed despite higher resolution/polygons. -Camera cannot be zoomed out nearly far enough.  Worth picking up on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Its very Nice on how the devs kept the feel from Homeworld 1 and 2. And he units still needs micromanagement for effective use. You can see this as a bad thing. but it keeps you focussed, and it forces you to keep a balanced army. is also nice that the units gain experience, and can level. so you need to keep the units alive.",
            "review_score": "1"
        },
        {
            "review_text": "The general mechanics at work here are really nice, and the campaign is a real blast to play. There's just about enough units to keep it interesting, and it's just about long enough as a campaign that I don't feel cheated at the sale price of £10.19. Visually it's nice but it stutters at a regular interval, which is weird considering I'm on a 1080 and have no such issues in any other game. Can't speak to the story as I've never played a Homeworld game before and it was of no interest, so I ignored it. The glimpses I caught didn't impress, mind.  The CPU AI players in skirmish mode are either absolutely dreadful or cheat, so there's very little replayability there, and there's not much of an online community it seems. So at full price, this seems a very raw deal, as while the campaign is good, it's not £29.99 good, and is pretty much the only aspect worth paying for given the skirmish/multiplayer issues.  Overall the campaign in and of itself *is* good fun so that's why I'm recommending it.",
            "review_score": "1"
        },
        {
            "review_text": "As a veteran of the RTS genre and a huge fan of the Homeworld series I was very excited 3 years ago when this game (under the title Shipbreakers) was announced. Over the years I saw the game gain momentum and change names and now that it is out I have to say it was worth the wait. From the intuitive commands, cinematic visuals, and updates to RTS genre’s core elements Homeworld: Deserts of Kharak is the next gen RTS fans have been looking for.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  Great game, incredible graphics and attention to details.  Gameplay is easy and similar to any other RTS game. Good story that will keep you inerested right till the end.  Cons: VERY SHORT!!!  Was very disappointed when i completed the game in 8 hours!  My advice, wait until its on sale and buy it.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game on the 2016 Summer Sale, along with the 2 multiplayer factions DLCs. I've seen the game did lack some important features like replays on launch, but that had been fixed before I got the game, so I have no issues with it as it is right now. If you're looking for a short answer: yes, I highly recommend this game. If you're looking for the long answer, keep reading.  I played the original Homeworld quite some time ago. I enjoyed the story and aesthetics, so I was very excited to play this prequel to the lore. While I haven't yet completed the campaign, so far I'm loving it. I've also played a few skirmish matches against the AI, and I can't wait to play against other players (there seems to be an organized MP community which makes it very easy to find people).  First of all, the aesthetics. Each and every unit is amazing in design. They're heavily based on real life navy ships and submarines, except they move on tracks, wheels or gravitic drives and have an abundance of railguns. To someone like me, who loves the concept of landships, these units are very lovable and worth a 3D print or LEGO build, and the camera controls allow great angles and unit tracking. Visual effects are superb too: sonic booms from railguns, realistic fungus-shaped explosions, wreckage left on the ground, aircraft sent down in flames to crush into the ground and spread scrap all over the place... When combined with the sound, the atmosphere is very believable: units talk casually between themselves, send thanks for support, advise on sensor warnings... It feels just like an aircraft carrier operation.  And it plays like one too. Each unit has its own role, and it excels on it. For example: LAVs are very fast and great against slow guns like railguns, but can be defeated with area-of-effect weapons or heavy armor. Railguns are meant to attack slow, armored targets at great range. Support cruisers repair units, and aircraft perform surgical strikes on designated areas (gunships in particular circle around their targets shooting laterally as if they were C-130 's!). Line of sight is vital: you will want to keep your units on top of dunes, especially railguns, and you can activate a heigth map by pressing V to find the best spots: for me, it makes the game into a nice mixture of macro and tactical RTS. As with other Homeworld games, you can activate a zoomed out view of the map in sensor mode, by pressing the spacebar, which is of great help to keep an eye on everything.  There is no basebuilding. Your carrier is your most important unit: you lose it, you lose. It produces the vast majority of units, if not all of them, deploying them in a similar way a real life amphibious carrier would: this also contributes a lot to the feeling of managing both an aircraft carrier operation and a desert tank battle. As with everything else, it is mobile and can defend itself, although you will have to choose which subsystems to activate on it. Resource collecting is done by sending collectors to scrap metal locations, and breaking down spaceship wrecks into collectable scrap. You will want to support your collectors. Resources (there are 2 of them) are spent on units and research, which is done in your carrier, for improving your units.  There are 2 factions in the vanilla game: the Coalition and the Gaalsians, which act as protagonists and antagonists of the campaign. While similar, they are played completely differently: Gaalsian units are hovering and thus much more mobile, and can deploy Production Cruisers that build other units anywhere on the map... but are also the only way to produce these units. The Coalition produces all units in the Carrier and is less mobile due to wheels and tracks, but are sturdier and can deploy turrets and sensors.  The 2 multiplayer faction DLCs add the Soban and the Khaaneph, to use in multiplayer matches. They can be considered as subfactions of the other 2, with similar yet different playstyles, as well as models and voices. They bring quite a good variety to MP matches,so I highly recommend them if you are interested on playing against other players or the AI, outside of the campaign that is.  So: if you like RTS, desert vehicle combat, navy-like science fiction, landships, the Homeworld series, and a great and unique atmosphere, you will definitively enjoy Deserts of Kharak. And if you are very interested on the multiplayer aspects of it, the 2 MP faction DLCs are highly recommended as well. I suggest to wait for a sale, though; full price is a bit too high in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely loved it! Reminds me of the original Homeword - just draws you in with a great story and challenging missions that have multiple ways of 'beating' the enemy. Yes, too short - but obviously (Hopefully!) they are planning multiple expansions. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "One of the finest RTS games i have played. Short but beautiful Singleplayerstory and every MP-battle is fun. If you are into RTS games this one is a must have.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. It holds true to the epic narative that it has always had and delivers on the feeling of total control over your units that every RTS should have. The terrain design is brilliant allowing you to utilise your units perfectly throught the story. The attention to detail is absolutly amazing, such as the landing gear on the aircraft actually deploying and compressing during landing sequences.  The only problem i have with this game is the feeling of claustrophobia during skirmishes. I just feel like the maps are too small, but that could be a result of me being a fan of other RTS's such as Supreme Commander and Wargame where the maps are huge allowing for games to go on for hours at a time.  But overall I would recommend this game to anyone that has any sort of interest in RTS games or Homeworld in general.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for great story and tradational RTS game play, then look no further. If you want to get that same feeling as when you played Homeworld 1 &amp; 2, or any of the orignal Command and Conqure games for the first time, then get this game. This game was fantastic, I would highly reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "A game worth the 'Homeworld' franchise title, really impressive! =)",
            "review_score": "1"
        },
        {
            "review_text": "Homeworld: Desert of Kharak is a great game a fantastic spin-off for the Homeworld franchise.  Singleplayer campaign took me about 12 hours on the hardest difficulty setting, I got wrecked by the AI a few times and had to restart or reload from a save multiple times. The story is well written and executed, it is mostly fed to you through cutscenes and animatics. Even for fans of the original titles (who kinda know how the game is going to end, after all it`s a prequel) there are plenty of surprises!  Multiplayer/Skirmish is fun but it suffers a bit from the low map choice (5 maps at release). At least in 'Artifact Retrieval' mode (basically capture the flag) the AI can be very, very challenging actually, I can not confirm the experience of some reviewers here. Note that keys can not be rebound at the moment, though the standard layout of the quickbuttons is okay and usable.   Performance was good on an i3 and a GTX 650 Ti, FPS did only drop in very, very, very intense situations (lots of units and boom). No major bugs encountered, except for an UI bug that caused returning from the options menu to be quite a wait (30 secs+). Only ever had a single crash so far, this occured right before loading a new mission.   Although the title obviously still needs some work I am satisfied with this purchase and excited for upcoming new content (free maps have already been promised, further DLC are 'in the pipe').   8/10 would recommend",
            "review_score": "1"
        },
        {
            "review_text": "its Essentially Yellow Big wheels Vs Red Hovercrafts.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "i am a huge command and conquer and warhammer fan and this game fits right in i love it",
            "review_score": "1"
        },
        {
            "review_text": "This is a RTS with a new perspective of the Homeworld universe more of a prequel as it tells the story of an expidition force scowering the deserts of their planet for the salvation of their people. Your base is basically an aircraft carrier on treads called the Kapisi, you can reasearch, build and upgrade units from it and as you progress through the game it will also be one of your most powerful weapons (cue tomahawk missle). The bulk of your forces will consist of various attack vehicles of many roles and sizes but the best part is when you get aircraft. Nothing beats playing the song Dangerzone while launching fighters into enemy territory! The AI in the campaign is ok, but skirmish is where things are much to be desired. You'll be rushed quite a bit in the beginning with quite a few units, but as soon as you pick you balls up and build up a sizable the AI starts ♥♥♥♥♥♥♥♥ itself it just.... you win... basically, you walk your army to it's carrier and blow it to hell.  The Good - the story is good for homeworld players - the unit designs are good - the art in general is amazing - the voice acting is good quality - combat is fluid  - units have a reasonable rock-paper-scissor mechanic  The Bad - AI needs more work - Story feels a bit short  The Verdict This is a is good game but it's still kind of a diamond in the rough, it has the ability to be a top notch RTS game it just needs a couple more updates to skirmish to make solo play all the more enjoyable. I give it a 7/10, I can't lie it was hard putting down $50 but overall I don't regret it. ",
            "review_score": "1"
        },
        {
            "review_text": "Shed a tear of joy and awe during tutorial mission.   Therefore, I don't know sh*t about high terrain and unit types.  I don't care.   I am back on Homeworld. Homeworld is back.",
            "review_score": "1"
        },
        {
            "review_text": "I am one of the 700 people who backed this game as a Prospector in 2013 when it was first announced, because I'm a Homeworld nerd and loved the idea of the spiritual sucessor of Homeworld. I even tracked the progress of this game all the way to release because I believed so much in this project.  Almost all the other reviewers here have ticked the typical checklist: the game is beautiful, the interactive manual is meaty and full of the lore goodness which has been missing from games, the campaign is great but...  The multiplayer aspect doesn't work.  The devs kept on talking up the MP aspect of the game and how amazingly competitive it's going to be, but it doesn't work. To make things worse, on the rare off-chance the MP works and you are able to wait out the 15-minute matchmaking timer, the players are horrid. I've had people banzai-charge their carriers into enemy lines, I've had roleplayers spamming chat with RP while doing nothing in the game but sending 4 LAVs to die. I won't mind the trouble of waiting for the multiplayer function to be fixed if the community is great, but it's worse than the '♥♥♥♥ ♥♥♥♥♥' and 'putang ina mo' spammers in CS:GO and Dota2. But no, this game has no longevity as long as the MP function doesn't work, and the devs have not said a single peep on intending to fix it.  And oh, it's not worth it to even play Skirmish with AI because the AI is pants-on-head ♥♥♥♥♥♥♥♥.  As much as I want to like this game, I cannot in good conscience recommend this game to fellow gamers.  tl;dr the game is cool but has no longevity because multiplayer does not work. Do not buy unless it's $15 on a future Steam sale.",
            "review_score": "-1"
        },
        {
            "review_text": "[reviewed review ^^]  Okay, so..one lazy ♥♥♥ point is that if you're looking for some story mode...man this is noooot the place...finished it in normal mode in about 10hours..i guess there is the hard mode but you know...doing the same story..nah..i wish i knew, would've gone straight for hard mode..  Didn't try Multiplayer yet..we'll see.  Although, since Prebought, the game gave me access to the 'old homeworld 1 and 2'.. And they are quite fun to get used to. Okay so i'll make a reviewed reviewed review after my multiplayer session to tell you guys.. Take care ladies !!  [1ST review] After 10 hours of gamaplay, i've got to say the game's got his own caractere. Which is good. The story is cool. Graphics are ok. As for the gameplay itself, i've got to say that it requires so habit, it's not so intuitive and a bit 'robotic', sometimes the units just do stupid stuff, especially airplanes, but that's somehow a habit in strat games..  I recommend it but for me some improvement has to be made. I guess that will come with time, the game came out 10 hours ago ^^ but again, not an early access or a beta so i hope it happens fast. The building system is a bit weird, needs some getting used to. You're almost always on edge with ressources, which requires you to move your base almost all the time. Good to have a huge carrier ^^.  Anyway, i might review this edit after a while, to see if with experience i find it more fluid when i play, less 'struggling' toget things done.  Later cheeks !",
            "review_score": "1"
        },
        {
            "review_text": "*Review has been updated below with regards to the Expedition Guide DLC*  At the time of writing this review, I have finished the Campaign on Normal difficulty and played a couple of skirmishes against Hard AI. Not tried Multiplayer yet or the Classic Campaign, may update review later if I try them. I played the Remastered Collection to completion and know the storyline of Cataclysm.  Pros:  Fantastic visual design and art. Cutscenes are beautiful, artwork is beautiful, maps are usually beautiful, but occassionally not to the same standards of Sup Com 2 and similar titles.    Music is as good as the originals I'd say, definitely the same feel.    A few nice gameplay mechanics - such as acquiring new resources and artifacts from destroying wreck bulkheads, Carrier power systems, etc.  Meh:  Unit design is nice far out, kinda flat when zoomed in. This is an RTS though, you get most of the pretty factor focused away from the very expendable, very numerous units. Unit combat has a few visual bugs such as firing angles being messed up, and units hit by heavy weaponry sometimes do somersaults. Aircraft that are shot down will bounce as though they are made of rubber sometimes, but look very cool at least.    Couple of frame freezes in big battles but game ran smoothly for the most part.   Cons:  Story is a bit barebones. I know Homeworld is very much about saying a lot with very little, but it seems like they only managed the very little part here; it comes close to capturing the feel of the story but misses the mark a bit. There's quite a few points where something is mentioned and never expanded on too. I think I might need to access that Expedition Guide DLC and see if it has the missing pieces there, but it feels like a lot of the additional lore and background for this game is simply not present. I'm also not really satifised with many of the wrecks present in the game; a couple of them especially feel like retconns, well, nearly all of them are iirc besides the Khar-Toba. A couple in particular are very questionable additions in my view though, and the ending itself was a little underwhelming. There's little characterisation in the game and little exposition.    Combat is very Rock, Paper, Scissors. A lot of the time it boils down to 'Does the Enemy have AA?'. If not, use air. If yes, use a Cruise Missile and ask the question again. If still yes, then send in the ground troops; otherwise, you'll be spending more money rebuilding troops than you spend on Cruise Missiles blowing everything to kingdom come. On Normal difficulty, I spent the majority of the game sitting on a surplus of least 40K CU and 4K RU, patiently waiting for a challenge to come that'd need me to rebuild. It never did, because Cruise Missile &lt;-&gt; Air ---&gt; Ground Troops is the solution to everything.    Enemy AI is braindead. The Enemy will never react to your actions smartly, if you use air often, it'll never build more AA than it otherwise is preordained to. This makes air the solution to every problem in Skirmish mode, and most of your problems in the Campaign too. In Campaign, it'll send cookie cutter attack waves that are easily predictable due to how sensors work and the complete lack of stealth mechanics. Normally they can be dealt with by air, sometimes you'll want a Cruise Missile instead. Sometimes you'll just bludgeon them to death with a souped up combat powered Carrier. The enemy never seems to use abilities, and difficulty is more of a setting of 'How much shall the AI cheat?' with regards to their resource collection. The Enemy will rarely retreat, if ever, even under overwhelming fire or fire it cannot fire back upon. It will either sit there and die or chase you blindly and die.    Unit AI is a bit off at times. Nothing co-ordinates their attacks intelligently, such as splitting their fire if they know they will kill the enemy in a single attack. This leads to entire airstrikes being wasted on a single light attack vehicle when a cluster of assault vehicles are behind it, and artillery fire being massed on singlular points rather than covering an entire wave. So you are forced to micromanage your artillery and air, to prevent your most powerful assets being wasted on the weakest units. Everything aims for overkill, and everything targets the first thing in sight, not the most dangerous or most relevant to their preferred target class.    Controls are strange and un-rebindable.    The 3D aspect of the game doesn't see much facetime due to the skewed balance towards air. No high ground is higher than the sky. But besides that, a lot of the time it requires finicky micromanagement to make proper use of it due to the lack of a Company of Heroes style click and drag movement control. Trying to organise units into a formation facing in one way in this game is a nightmare. Formations in general in this game are nightmarish to manage, the default unit layout is abysmal and will lead only to defeat and despair.     No targetable subsystems on larger vehicles or the Carrier itself, nor much unit variety beyond some simplistic balance where basically smaller direct combat unit is the counter to bigger indirect combat unit (if it survives long enough to reach it) which is counter to similar sized direct combat unit which is the counter to smaller sized direct combat unit. I.E. LAVs &gt; Railguns &gt; AAVs &gt; LAVs and their cruiser cousins appear to follow the same pattern but ground combat is unneccessary against the AI by that point as you have air units. Abilities are generally uninteresting beyond the AAV smokescreen which is actually both useful and interesting. There are no units comparable to Destroyers or Dreadnoughts though. Just fighters, corvettes and frigates really.   Conclusion:",
            "review_score": "-1"
        },
        {
            "review_text": "If you enjoyed Homeworld this is a must. If you enjoy RTS then you should highly consider this. If you enjoy games of any kind it's worth looking at. If you hate RTS it's not going to change your mind. I found it wonderful in every way. Loved every second of the campaign. Looking forward to doing it again.",
            "review_score": "1"
        },
        {
            "review_text": "cannot build enough units with playing against the computer",
            "review_score": "1"
        },
        {
            "review_text": "It is all that I expected. Great visuals and story. Has the same feel of the orginals but on the ground :)",
            "review_score": "1"
        },
        {
            "review_text": "I just finished the game on the highest setting, Classic Difficulty (the name of which amuses me, due to the fact that the 'classic' game only had one difficulty...really freaking hard). The journey took me 12 hours of gameplay at this point. I loved the ambient music of the game, and am seriously considering buying the soundtrack. Now, to put it simply here are my views.  Pros: Extremely thematic music. It's a desert, but they keep the terrain interesting. Each unit has its uses, and they keep the number small enough that you don't wonder why they put units in. I've always loved persistent fleets, and the veterancy makes it even better. Excellent story, and quite good voice-acting as well. The power shunt system for your carrier is amazing.  Cons: It was too easy to beat on the main difficulty. Your best bet is to get as many resources as you can to build a fleet, and then alpha-strike the main objective in a single massive attack to finish things. Otherwise you just get killed by the death of a thousand cuts due to your opponent not needing resources to produce vehicles. The AI is less than stellar, but makes up for it due to campaign scripting. Leaves lots of questions unanswered. Admittedly, primarily because they were answered in the other Homeworld games, but still. Skirmish maps are lacking in number.  Overall: I recommend the game to Homeworld enthusiasts. I recommend others wait for it to go on sale. Unless modding tools come out for it, at which point this is ripe for modders to turn it into something absolutely amazing.",
            "review_score": "1"
        },
        {
            "review_text": "This is like how I remember homeworld. Great Sound Engineering! Gorgeous detailed graphics. Its a bit of work to play... the campaign but rewarding :)",
            "review_score": "1"
        },
        {
            "review_text": "Crashed a few times but I suspect that'll be fixed promptly. Love the feel and the very familiar interface.",
            "review_score": "1"
        },
        {
            "review_text": "Exceeded my expectations in every way possible I would highly reccomend this game. Initially I was skeptical about buying this considering the play style but I found it was in all honesty the strategey game I had been seeking for a long time. If you are looking for a game that merges mechanized, naval (in a sense), and airborne combat all into one game then this is the game for you. However I strongly suggest you watch some gameplay of it before making you decision as this isn't your average strategey game.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, revisited Homeworld tatical RTS, only negative aspect is a short campaign hope dlc's will come...",
            "review_score": "1"
        },
        {
            "review_text": "I really like the old command and conquer series of games so I really enjoyed Deserts of Kharak. I hope they build a whole lot more followup games along the same theme. My only criticism is that the game shifts to cinematic scenes too much, interrupting the game play. It would also be nice to finish off the existing enemies and tasks once the main objective has been accomplished instead of the game ending. Other then that, awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "I run right over this one in a few days, 3 stars on every mission. a well designed game but by staying true to the first two games they have tranfered the errors of old to the new verison sad. maybe next time they should have just keep the old format but improve the ingame information and add more races and units to increase unit cobo. thus allowing the users to make up there own mind as to whats is best for them. 3/5 good try very very fun and wild ride but too easy and too short!!!!!.  Ps. Support for two screens would be very nice, maybe have a map on one srceen and the close up battle on the other srceen. meaning no more zooming in and out.",
            "review_score": "1"
        },
        {
            "review_text": "Was that it??  I expected an epic journey akin the the other Homeworld games, but this was over in a flash. Where's the rest of the game?  I bought it on sale and still feel a bit ripped off. :-/",
            "review_score": "1"
        },
        {
            "review_text": "10/10 exceeded expectations. Sure its not a homeworld space game but the campaign, voice acting, unit detail are amazing.  No unit formations or key rebindings though....",
            "review_score": "1"
        },
        {
            "review_text": "  **** For some reason Steam thinks I had a promo copy of the game - I did not ****  It's a beautiful game, it FEELS like homeworld, it's every bit as hard.   + Gorgeous graphics throughout + Good use of realistic terrain advantages in combat + Keeps you thinking at all times - boredom just doesn't happen  - Multiplayer is built around rush tactics - don't expect to have a long match against AI or Players - No resource trading makes teamplay somewhat superficial - Defense oriented players are doomed - mobility is key to survival, you must always be on the attack  I loved Homeworld; I once stonewalled a Vagyr invasion for an entire hour while my teammates built up for a win. This game isn't suited to my playstyle alas. If you can grasp the hit-and-run nature and the constant balancing of resources you'll love this. If you're stuck (like me) in a traditional RTS mindset you'll struggle and rage-quit a lot.  It's a great game and I wish I was better at it. Hopefully Blackbird will find a way to balance it so that the less adaptable amongst us can keep up, before too many leave the game behind as a flawed gem in the desert sand.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a die-hard Homeworld fan, you've probably have played it already. Going back to Kharack is still exciting, as everything (visuals, sounds, UI) try to give you the 'homeworld' feeling. But despite all this, HW:DoK is still a very basic RTS when it comes to gameplay.  Once the singleplayer campaign completed, which is rather cool but not unforgettable, I'didn't find myself going back to heavy comp-stomping or multi, because of the basic gameplay. All-in-all, not a bad game, but still really under the high standards that Homeworld franchise have always set before.",
            "review_score": "1"
        },
        {
            "review_text": "I've only played a few space - or futuristic - RTS games. Those being Earth 2160 and a bit of Starcraft II. Me being a huge Command and Conquer fan, I thought I'd add another space RTS to my collection, that being this game.  I have to admit, I'm a little disappointed in the game since I thought you would be base building but you're not. It reminds me of Command and Conquer 4: Tiberian Twilight more than anything but that's alright. I love the concept of this game and I love the gameplay. The maps are absolutely beautiful at max (and my video card is a cheap 2GB one) and the game is challenging. So my disappointment in the lack of base building is irrelevant.  I recommend this to anyone who likes RTS games and doesn't like micromanagement (base building) very much. In this game, you command a carrier which deploys units and where you research upgrades and units to build from your carrier. I've only played Skirmish so far so I can learn the systems and whatnot, but plan on trying the campaign very soon. I will update my review then.  In the mean time, I recommend this game. From my experience, I don't recommend the two Fleet DLCs as they are basically two retextured fleets of the base ones. I played about 5-10 minutes as Soban and I don't think I noticed anything different from the Coalition. If someone can explain the DLC more in-depth to me, please do so. I will update my review.",
            "review_score": "1"
        },
        {
            "review_text": "BE WARNED!! DONT BUY this game crashes every 20 mins and while the story was okay definetly not worth my money in the long run.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Worth it during a sale just for the story, it's as good as the original Homeworld.",
            "review_score": "1"
        },
        {
            "review_text": "After many years, this is the 1st review I've posted on Steam. The things I've always loved about the Homeworld games is that for me they deliver the whole package... top notch story, immersive campaign, gorgeous visuals, and some of the best music in gaming period. While I also play skirmish and multiplayer, for me it's all about the story and campaign. I've played through the 1st 5 missions of Deserts of Kharak and I'm grinning from ear to ear... all the elements are here again, and they just fit and feel right and deserve the title 'Homeworld' . Hands down the best money I've spent on a game in quite some time, so if these sorts of things interest you in a game don't hesitate, dive in. You'll be glad you did.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "This prequel installment of the homeworld series breaks from the roots of 3d space operatic RTS to create a strongly hard-counter based land RTS. Balance is slightly asymmetrical- not all options available to one faction are available to others. DLC factions are interesting takes and variations on the core ones and not merely cosmetic. Those familiar with previous homeworld titles will find the interface minimally adjusted with the exception of updates and elimination of 3d movement as this is a ground RTS with limited air units. Combats are quick, brutal, and and based on a mix of micromanagment and unit choice. Reacting to your opponent or opponents with the right units in the right place is critical to success. Spamming one unit type will get you defeated in a hurry, even against the AI. Campaign is good, builds tension, and feels right at home in the lore of homeworld. It might not be the game we asked for, or even realized we could want, but it manages some cool things on simple mechanics and sharp visuals. Ongoing support is hoped for, would like to see some full-scale expansion pack type stuff in addition to the optional but more than window trimming DLC's we've gotten thus far. Those not into dropping additional cash for DLC could likely hold out for the big box pack or a steam sale- game comes in at a fairly low base price to begin with, and on sale, well worth the price of admission.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible soundtrack and is very rich in exploring the backstory behind an amazing franchise. This definitely re-energized this franchise and is the best RTS put out in years.",
            "review_score": "1"
        },
        {
            "review_text": "If you thought Homeworld could not remain true to the original if it wasn't set in space, you were thankfully mistaken.  Having played the original Homeworlds years ago, like many I looked at them with rose tinted glasses. But In prearatin for Deserts of Kharak I started up homeworld one, and I have to say, it still holds up. It delivers an atmosphere and an experience of play oonly great games manage. And homeworld shipbreakers Manages both.  The aeasthetics are not only sunningly beautiful, but they remain true to the original. Be warned though performance is lower than expected from such a game.  The sound design, a known high point of the series also does not disappoint. Not only are the tunes perfectly in sinc with the action and visuals, but the constant unitchatter prowides an undeniable sense of presence. And I haven't heard a piece of repeated dialog for three hours into the game.  Mechanically, this is a competent RTS. It brings no great innovation, but what it does it does well. The small number of units may initially seem a drawback, but I've never found myself looking for any functionality that wasn't present in some way. Pathing appears good, and units respond well to orders. The game is set on a series of hard-counters, andthey are mercylessly enforced. So if that's not your thing stay away from it.  The multiplayer I didn't explore much, so I can't provide criticism.  TL.DR.:  Homeworld: Deserts of Kharak is a game true to it's predecessors. Stunning visuals and superb sound-design support a competent but non-innovative story driven RTS with prominent hard-counter mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "DoK was fun, I enjoyed it and I would recommend the game to others.  However, there are many minor quibles that slightly spoiled the experience.  1) no 21:9 support 2) I can't seem to use SuperSampling 3) the AI is terrible and doesn't addaption  4) I rarely play RTS games and I only had to restart a stage three times. And two of those times was a game breaking bug, not allowing me to complete a stage. And the only time I did have to restart the campaign was when a mission-critcal unit got stuck on some scenary and died. So, it's a very easy game, even for noobs such as myself.  But in the end, yes I enjoyed myself and thought it was money well spent. Will I play it again though? Probably not.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  Good campaign Nicely paced Effective yet simple gameplay mechanics Insane ambiance, OST and just sound design in general Visual details and Graphics top of the line for RTS'  Comes with a handy and well written guide/unit stats/lore/artwork digital manual etc.  Cons: terrible skirmish AI no customizable hotkeys only 5 multiplayer/skirmish maps with even less options for game modes",
            "review_score": "1"
        },
        {
            "review_text": "Fear not folks, this is a through and through Homeworld game without a doubt. The feeling of going up against an unrelenting enemy or a lone journey through vast emptiness (only in a desert planet this time, duh) is still there.   I love the art direction, the graphics, the sound design (radio chatter between your units is fantastic and very very reminiscent of the Homeworld games of the old). The game is beatifully well done.  Apparently the campaign is not that long (albeit crafted masterfully) and the game is very thin on content. Also the AI is pretty much non-existent, and as a result the game is quite easy even on the hardest difficulty setting. Scripted campaign makes a very good job of hiding this and engrosses you completely but that seems like that is all there is for now. I don't think competitive multiplayer will be a thing and skirmish mode in its current state is not satisfying thanks to the AI. The campaign will not disappoint you but whether it is worth the price tag depends on the personal preference. I'd say it is worth the full price for a fan of the series.  All in all, I'd recommend Deserts of Kharak to any Homeworld fan.",
            "review_score": "1"
        },
        {
            "review_text": "There is a few thing I dont like about this game:   - the resources that I can't pick up becouse i finished objectives first  - after the fourt or fift mission I stop producing light vehiacles becouse they were not on any use exept harvester afcourse :)  - The final animation was a little short, to me it was not a god ending Still I would recomend this game to everyone it is a great strategy and a have a lot a fun playing it :). Hope that there would be more Homeworld games in the near future. Thanks Blackbird Interactive and Gearbox software for making and revivig this franchise.",
            "review_score": "1"
        },
        {
            "review_text": "Would i recommend it? Yes! Story, Gameplay, Atmorsphere, it´s all really good. As good as Homeworld 1 or 2? No. But it´s good nonetheless. Buuuut:  I have 9,1 hours on record, that includes replaying one of the longer missions just because i wanted to harvest more ressources. And I´m done. On hardest difficulty.  This game is really, really easy. And it´s all because of the awful AI, which is, as many others have mentioned aswell, awful. Really really awful. And some of the scripted attacks and movements aren´t that great either.   You can win most 'destroy that enemy carrier!' Missions by sitting around in your comfy and well defended Base bacause the enemy takes the exact same route all the time and is therefore perfectly predictable, making him an easy target for missiles and bombers.  I´ll go and play Homeworld 1 now, the remastered edition looks amazing, and is still better than this in any way, which just shows how good the original is.",
            "review_score": "1"
        },
        {
            "review_text": "I Recommend this game but only in the fact that its fun and it has a great story! i liked the controls and combat and i think they nailed the setting.  however its been less than a week since launch and i already completed this game!   13 missions total seems kinda lacking, i would like another campaign with another faction or something, however more games are coming out soon so i can focus on that.   i think its more of a 25 dollar game than 50 but if you like homeworld you will enjoy this but be warned its about a 12 hour game.",
            "review_score": "1"
        },
        {
            "review_text": "An alright campaign that lasts just over 10 hours doesn't justify its $50 USD price tag. The replayability comes from skirmish and multiplayer.   Skirmish has awful AI that is the worst I've seen in an RTS in recent years.   The Multiplayer, while balanced and fun for the most part, has awful servers. The last 5 games I have played have resulted in myself or someone else disconnecting and ruining the game. The lag is also unbearable and a result of BBI's laziness and greediness when it comes to investing into decent servers. The lead game designer himself said multiplayer is extremely important in RTS games and then goes on to release a game with servers so bad that competitive play is impossible.   Gameplay: 8/10 Graphics: 7/10  Multiplayer: 4/10 Campaign: 7/10 Replayability: 5/10 Skirmish: 4/10  Overall score: 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "&lt;3 &lt;3 &lt;3 LOVED THE GAME!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! I fell in love with homeworld day one. I felt the same here. God damn i missed you",
            "review_score": "1"
        },
        {
            "review_text": "Bloody beautiful. Top 5 soundtracks ever.  Wish people were on multiplayer though :c",
            "review_score": "1"
        },
        {
            "review_text": "Story wise, the game may have potential, at least I liked what I saw 6 hours in, but gameplay wise it's nothing but hard counters and micromanagement against endless waves of enemy designs, which I find digustingly dull. Add to that the inability to change unit formations from a staggered box, let alone formation direction which is quite important in a game that has both line of sight and terrain elevation bonuses, you get not only a boring game but a frustratingly incomplete game one at that.  I can only hope that the original Homeworld's gameplay is radically different to it's successor, because I could only just barely consider this a real time strategy game.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game. Please...need expansion!",
            "review_score": "1"
        },
        {
            "review_text": "NOT WORTH $50.00!! Otherwise it's pretty cool....",
            "review_score": "-1"
        },
        {
            "review_text": "As a long time fan of the Homeworld franchise (I remember getting the original for Christmas when I was in high school) I am sadly wishing I could get a refund... but unfortunately I have spent 5 hours with the game and can no longer do that.  The good:  -Interesting story- just like the other Homeworld games. -Very strong art direction (looks and feels like Homeworld) -Good visuals (it can sometimes be hard to discern what units are what when not in overlay mode though) -Good UI and game mechanics feel solid.  The bad:  -Laughably weak AI for skirmish. The devs should be embarassed by how incompetent the Normal AI is. The only reason the Hard AI is 'hard' is because it is given a resource advantage and just kind of throws units at you.  -Only 5 skirmish maps (2 2-player maps, 2 4-player maps, and 1 6-player map) -Very condensed game space and very small fleet cap. The one place this game does not feel like Homeworld is in its scope- battles tend to be much smaller tactical affairs.   Honestly, I don't even know if I will finish the campaign. I would almost rather just play HW: Remastered or Planetary Annihilation: Titans.  Since I already had HW: Remastered the game was $40 instead of $50.",
            "review_score": "-1"
        },
        {
            "review_text": "very good game first time playing homeworld game i liked it for the command and conquer feel it gives, the campaie is very good not really replayable becuase there isnt any and unlock progression if your like me and just like single player then online then its probly a one or two play but the game it self is very good 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Mkay, so im rolling over the dessert in a giant carrier with tracks on. Still trying to get used to that fact :)  That said, this is Homeworld in every way. Just rolling in a carrier insted of a mothership.",
            "review_score": "1"
        },
        {
            "review_text": "Love all the Homeworld games.  Wanted to love this.  Didn't happen.  Graphics - Great, top-notch Sound - Also very nice. No complaints. UI - Mediochre. Needs work.  Gameplay - Fail.   So here's how every mission will go.  The game will most likely drop you into a senario where you have about 5 seconds to react and setup your forces before you start getting pounded or have to go meet some timed objective. Oh and remember, there's NO PAUSE feature so forget about doing any planning or strategy. You will then proceed to move into a defensive formation around your carrier. That is pretty much the last you will move your ground forces for the remainder of mission (with the exception of maybe sending out scavs). They will just sit there turtled and defending.  Why? Well a number of reasons.  Computer has infinite resourses and units. You do not. sending out your units is pointless since even if they win a skirmish, the enemy will get new units in 5 seconds for free. Eventually you will lose all your units and will have accomplished little to nothing. Ground forces are just defensive turrets for your carrier.  Also the game does not allow a high enough unit cound to field and offensive and a defensive team. If you use your units on offense, your carrier will be undefended. The only real offensive units are your aircraft. They will do ALL the work and they will do it better and more efficiently than any of your ground units.  Another thing....your units in this game are WAY too fragile. It's absolutely stuipid how fast units die.   Another downside to the game is mission design. Whoever was in charge of this, you really need to go back to flipping burgers.  Almost every mission is exactly the same. They pretend to be different, but in the end I played almost every mission exactly the same, had the same triggers, had the same outcomes.  Only variety to this was when the game would randomly take units away from you for ....reasons. My favorite occurance of this being when you carrier arrives to a misson BEFORE all you other units/crusiers/etc. Um ok, your carrier, which is basically the slowest, lumbering beast in your entire task force, by some miracle, managed to arrive at the combat site a full half day before all these other units which are faster.  Sure makes perfect sense.   Another gripe...  Research.  So for the first handful of missions you get to research a few things at a time. Than at one point in the game you suddenly get like 50 things to research (basically all of the tech left in the game). Even though you are really only about half way through the game.  There's a veterancy system in the game but good luck with that. I acutally went through the trouble to farm units for a LONG time to build up veterancy in many of my forces. Only to have these forces instantly obliterated later by...oh any host of things. It doesn't matter. Your units pretty much die if anything larger than a gnat hits them.   For a game that claims to be an RTS, it is by far the worst RTS I've played in a LONG time.  But quite frankly, it's really not an RTS.  So there's my rant. Sorry if it's a bit random but I tend to just spew thoughts.",
            "review_score": "-1"
        },
        {
            "review_text": "Worth the wait... now if they could make another for space :) I have nearly 3 hours in and I am loving it. I like the carrier design and the unit mix. So far really liking the ability to capture enemy units, wish they would have allowed me to capture cruisers early.... Like you could have with salvage units in homeworld 1... I dont generally write reviews. But I love this game. If they can make more of this type, with a single player focus.... that would be the dawn of a new pc age.  Update... Still amazing, but feels short, I would love more to do in this game! I spent hours playing homeworld and the ability to keep expanding was awsome. I think they need more dlc and more missions.",
            "review_score": "1"
        },
        {
            "review_text": "a great prequel to the homeworld franchise,great visuals,sound,music and gameplay.  campaign is great but feels short,   and skirmish is lacking on pretty much everything, only 5maps,AI is either dumb or cheating, theres an option for different skins for your army but no options save the default one.  seems to me that the game should have been antoher 6months in production due to the lack of content.  and the asking price of 45 dubloons too pricey.   devs have stated that they will only realese modtools if the demand is high enough....if anything this game can only become better with mods. homeworld 2 anyone??skyrim??dawn of war and so on became so much more thanks to the mod community  great rts i can recommend for all but wait for a price drop",
            "review_score": "1"
        },
        {
            "review_text": "A+ I've been looking for a game like this for a while now. Well polished and nice story. No previous RTS experience required. I'm going to be playing this game for a long time.",
            "review_score": "1"
        },
        {
            "review_text": "As an avid Homeworld fan I can easily say this game captures the essence of the origials extremely well. Guiding your carrier and continually growing fleet of units through the great deserts of Kharak really brought me back to the days of playing Homeworld. The campaign is done well, with great cut scenes connecting missions together in manner that tells an interesting story. Each mission is varied, much better than the usual 'destroy all enemies' type missions other RTS games can suffer from. I've completed the campaign on normal in 11ish hours and now I'm going back in to do it all again on classic level. I've played a few skirmish games and found them fun, but they move a little fast for me. For that reason I'll probably be skipping multiplayer. That being said, I found great value in the campaign, making the game well worth my purchase. I think Homeworld is in good hands with Blackbird Interactive. I look forward to seeing what they and Gearbox can offer us next in the Homeworld universe.",
            "review_score": "1"
        },
        {
            "review_text": "great campaign. Very Homeworld.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  Viuals and audio fit the Homeworld theme and are well done. Prequel tie-in arc decently ties into original narrative. Cutscenes are fantastic. Pretty pretty pretty Terrain tactics a good idea, but...  Cons:  Terrain tactics in this RTS style micromanagement hell Otherwise generic RTS The discovery of the artifact was supposed to UNITE the clans. Sajuuk was just a Macguffin from Homeworld 2 and serves no purpose here. Ending anti-climactic Everything is brown. A pretty, pretty brown. Suddenly Ion cannons  If you like Homeworld, get it. Otherwise, meh. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "As a massive Homeworld fan I'd love to post a positive review but this game crashes my entire system constantly, it's unplayable. SSD, i7 4770K, 32GB RAM, AMD R9 380 4GB.",
            "review_score": "-1"
        },
        {
            "review_text": "It has nothing to do with the old homeworld games.None of the atmosphere,the cutscenes etc are banal boring feely woman researcher point of view.  The story is weak,no developments,i thought the game was gonna really kick off when it ended instead.This was not so in homeworld.It is almost an intro for a story.  I don't know what everybody is going on giving this positive reviews but it has a 8 hour sp campaign,nothing special about it.  I guess people are supporting for old time's sake and another homeworld game.But it is plain old strategy game on par with old command and conquer games.Yeah the only difference is the base is moving.It's graphics are good,gameplay is not boring.It could have been better with a better story,But the elements incorporated are weak.The dev's should have seen it on the board that they were lacking,but alas.Honestly hire a few new graduates out of the school and let them go for it.It's a very bland story,it just doesn't work.  Haven't tried multi yet,but I wouldn't buy it at sales prices,not suggested.",
            "review_score": "-1"
        },
        {
            "review_text": "I would recommend this Game but there are many bugs that make the game No fun. -Options bug, whenever I go to options an increase texture to medium instead of low it doesnt save at all, it glitches back too low -esc isnt the pause button F10 is  The game itself is fun too play even with really really bad graphics until homeworld changees it too were I can actually turn up my graphics quailty to high or medium then this review is iffy",
            "review_score": "1"
        },
        {
            "review_text": "Great Homeworld game. Nice to see prequel of the best strategy ever made, Homeworld, it has this great homeworld atmosphere, mostly caused by soundtrack, plot and overall design. For it's best sides, soundtrack is great, plot is interesting, and gameplay, while not really something new, and because of obvious non-exsiting Y battlefield axis not as good as in previous Homeworlds, it's still fun, strategic and for most of the time chalenging (though last mission is damn too easy). I just wish it would last longer, won it after 9 hours, but Homeworlds never were very long so that's not a big problem.",
            "review_score": "1"
        },
        {
            "review_text": "Not as intense as the original, more along the lines of homeworld 2, but still worth a buy.",
            "review_score": "1"
        },
        {
            "review_text": "This one was FUN, i really liked playing it. The story, the atmosphere, the AMBIANCE is brilliant and trys to find its equal.  I recommend playing SP in hard mode (classic) due to the fact that the AI has its problems. (MUST BE PATCHED) As do the key bindings (unchangable at this moment) , that needs to be changed.  Small BUGS (as in every game these days 'ppl pls bring back finished games')  If you are a FAN of Homeworld, or of any RTS, pick this up. For generic RTS, i would say this is the best one out at the moment.  ",
            "review_score": "1"
        },
        {
            "review_text": "First off I have always loved the homeworld series. Played them since they came out when i was a kid. And, i think this game and its background story as told in the expadition guide are incredible and i want more. There is a serious feel and connection to the old homeworld games that is distict. Ground Homeworld I feel is an AMAZING idea which needs to be repeated. That being said, there are many points about this game i like...  Pros - Guard Command in this game is one of the most useful tools in this game. Allowing automatic battlegrounds that work really well. - The line of sight tool in this game works very well and that combined with the move command allows for simple and intresting game play - LAND CARRIERS HOW FREAKING COOL IS THAT!!! - Units look like they should work in real life and i havent noticed any clipping in the models themselves - The Battle Chatter is AMAZING! - Music is PERFECT. Its something thats many times over looked but it sets the scene and this games music does it well. - The Deserts themselves are very well done. The rolling dunes look real and the desert walls look so realistic. - Vehicles move very well as far as ive noticed. - waypoint setting is very intuitive - Once again if you read the expedition guide you find the story is SOOO rich its incredible. Very much worth touching on again  There are however a few big things that i dont like  Cons -  - TEXTURES ARE HORRIBLE and ill tell you why... if this where any other game id say what ever its an RTS. However this game is trying to focus on massive scales (not to mention being a series which always pushed the bounderies of graphics potential). As i play this game i find it very hard to realize the sence of scale because when i zoom as close as i can get to get a good scenic view the SAND LOOKS FUZZY AND UNDEFINED. This combined with the vehicles own textures being rather blurry results in making all the units look smaller.   - SCALE COMPARISIONS are few and far between. with the sand and units hull detail lacking there is not much else to help you visualize the true scale being represented by the units under your command. Id like to see more human sized representations if not in some cases humans standing on the units walkways.  - Terrain Shadows are not crisp even on Ultra which also separates me from the world immersion.   - Weapons Fire seems very random. It would seem the units movement across the dunes means nothing. They could hit the target while on the move or miss by a mile while standing still. If your trying to sell the units as having future tech I don't see how you could miss by as much as some of these units do while they aren't moving.  - Both teams units are basically the same exact things. As Ive heard it put so well, one teams units hover the other teams dont. Other then that they might as well be the same thing. Gotta switch it up. Every good RTS game ive ever played has done something to make the two teams really stand apart. Ground Control 2, all C&amp;C games, War Craft and Star Craft are all examples of this. Also, all Total War games inately have this as well (because they seek to emulate real life)  All and all dispite my gripes, I really like what this game is trying to do and its original concepts and story are fresh and inovative. I dont nessisarally think this game recaptures what i felt when i played homeworld &amp; homeworld 2 for the first time as a kid. However, although i may not find it to be the best made Homeworld game its still a good game if your just looking to play a game. I think maybe if they kept up on this path and didnt abandon it this titles predesessors will be truely amazing. For that reason i have to vote this game up.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect. FIlls the old void Cataclysm left, where three or four ships can make or break your entire attack force's effectiveness. Really focused on strategy more than it is lobbing thousands of units at things.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed it. Pretty good overall, I personally enjoyed the setting, the graphics and the voice acting. I'd reccomend picking it up when its on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I first was like 'The Spice 'salvage/artifacts' must flow!'  To expensive for what you get, totally ripped off :/  Like zero content, who did they pay for those reviews! Cause like only 20 people every play online.",
            "review_score": "-1"
        },
        {
            "review_text": "just got done playing gotta say i love the style and the story, it was a bit short but as a homeworld fan its a work of art. as always",
            "review_score": "1"
        },
        {
            "review_text": "Unpolished, camera locks, no key reassignment.  I can't believe i payed so much for this game.  Feel ripped off.",
            "review_score": "-1"
        },
        {
            "review_text": "Previously I recommended this game but after having completed it I have to say No. Don't get me wrong the gameplay, graphics etc are excellent, but there is a lack of content. Also the Multiplayer is near non-existant. I was able to get in 1 game online, that was it. The missions are good but there isn't half as much content as there should be for the cost.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like Homeworld you'll like this, but its very buggy on Mac. Crashes on average once an hour for me.",
            "review_score": "-1"
        },
        {
            "review_text": "I usually do not like prequels but I really enjoyed Deserts of Kharak. The mission variety, unit types and the general nostalgia of Homeworld is all there along with a great story.",
            "review_score": "1"
        },
        {
            "review_text": "Homeworld: Deserts of Kharak is a decent Homeworld game. It's surprising how the general flavour of Homeworld is represented in this game, despite the move from a space-based setting to the surface of the desert world of Kharak. The various units are visually similar to the space ships of the earlier games. The cut scenes are made in the same style. The voice acting is as good as in the earlier games.   A central mechanic in the game is line of sight. You won't be able to target enemy units that are hidden behind a sand dune, for example, until you actually crest the dune and bear down on them. This adds some interesting stuff to the action, where you can also hide from enemy units' fire by staying behind obstacles. Some minor micromanagement is added to the mobile base that forms the heart of your land-based fleet in that you have to allocate power to different systems. For the rest, though, the game plays essentially like the earlier Homeworld games: protect your mobile base, harvest resources, pump out new units, and purchase upgrades.   The problem is that it hasn't manage to really grab me. I'm partway through the campaign and I don't really care about what's going on. The environment never dramatically changes: you're always in the desert, and you're essentially fighting the same enemy in every mission. There's a steady trickle of new friendly and enemy units, but they're essentially varieties of things you already have: another quick light vehicle, another type of tank.   It looks good and it sounds fantastic, but in the end all it really makes me want to do is fire up Homeworld or Homeworld 2 again. The remastered versions of those are great, especially with the recent patches. Deserts of Kharak is certainly well made, even if I had quite a few crashes (especially after I finished a mission and am shown the menu again). Stylistically it's entirely in keeping with the other games in the franchise, but it simply hasn't gripped me in the same way. In Homeworld and its sequel, the campaign continually pushes you on and throws new things at you. Here, I just can't be bothered.    I'll recommend the game anyway, but it's more 50/50 than anything, and don't buy it unless it's for sale.  It's well made, but there's simply not much here. The skirmish mode and multiplayer are afterthoughts, which is not surprising: Homeworld is one of the few RTS games where you play basically for the campaign. So don't buy the (overpriced) DLC; it's multiplayer/skirmish only. Maybe at some point in the future I'll try the campaign again and I'll be gripped by it. You might be entertained by it from the get-go.",
            "review_score": "1"
        },
        {
            "review_text": "I would grudgingly recommend this game. It's pretty to look at, and it does have moments where it really does shine. It does, however, also have some fairly significant drawbacks as well, which really spoiled it for me.   As a massive fan of the original Homeworld, the first and most glaring issue I had with this game was the story - the new developers have taken some horrendous liberties with the original story, despite the fact this is supposed to be a prequel. Now, instead of just one starship buried in the sand that lead the people to Higara, the desert is littered with hundreds of derelict star ships, many of which are Taiidan, the people responsible for sending the people (Kushan) to Kharak in the first place. Also, for some reason, there's an orbital weapon above the planet that everyone seems to have forgotten about by the time the events of Homeworld came round. The massive changes to the story bothered me, but if you're not a fan of the original it's probably not as big of a deal to you.   Second major glaring issue is the voice acting. The story follows one Rachael S'Jet on her journey to find the wreck in the desert, and her voice acting is the most flat and unenthusiastic performance I've seen in a major title in years. In fact, with the exception of fleet command, all the voice acting is fairly sub-par. Deserts of Kharak has also done away with the neat hand-drawn cutscenes of Homeworld for the most part, so you have no choice but to focus on the voice acting, so why they shipped it with such a poor show, I've no idea.   Last major complaint is the difficulty of the game. If you're a fan of the original Homeworld, and things you needed to do in order to be successful (making sure you mine all resources before leaving, for example), you will find this game extremely easy. Having just finished the final mission where I was warned to show 'extreme caution' I literally just sent my fleet to the enemy carrier and won effortlessly. No planning, no tactics.   So, in conclusion, I can't NOT recommend this game. Despite my major issues with aspects of it, the game was enjoyable enough. But, if you're looking for another Homeworld, this sure isn't it.",
            "review_score": "1"
        },
        {
            "review_text": "Good RTS game! Story is good for 14 hours of game play and in normal difficulty very well balanced for the experienced RTS player.   But of course I bought this game for the online multi-player. I have the feeling I will be enjoying this game for a few more years to come. It will probably replace C&amp;C Generals as my 'play every now and then' skirmish RTS game.  Thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "This is not a fun game.  You're supposed to do real-time strategy with a persistent fleet, but your units die in seconds to enemies that pop out of nowhere to kill them. They lampshade this by saying your enemies have hover technology which makes all their units faster? That doesn't make it less frustrating.  To have any situational awareness at all (including 'what is this unit I'm looking at') you have to spend the entire game in sensor mode which is blue + wireframe symbols, so any screenshots of a desert world with 3d models is a trick. You never see that. This also means you don't get some basic things like health bars on units, and the elevation is really hard to read in sensor mode so you're going to screw that up a lot too.  Resources are very finite for you, but infinite for your enemies as far as I can tell. And there doesn't seem to be any rhyme or reason to anything that happens. You'll spend an hour slogging methodically through the mission with everything mostly working out fine, and then BOOM. Suddenly all your units are dead and it's time to start over.  #$%^ this game. ",
            "review_score": "-1"
        },
        {
            "review_text": "The game is good and very similar to the first Homeworld game.  I would recommend it to anyone, especially fans of the previous games. On my experience of the game however, I have recieved some low FPS rates on cutscenes and gameplay, I dont know if this is the game or my computer, however.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful garbage.    Lack of pause button removes strategy from this game. You can't analyze the battle, and figure out the right commands. There's no time for that. You can either flounder around, losing way too many vehicles, or you can play a mission enough times that you have the coreography memorized. That's not RTS. It's essentially no different than dance dance revolution.   A good RTS gives you time to thihnk. Sometimes that means a PAUSE feature, other times it means how the battle is paced.  Time to think isn't facilitated by ape-ing the beginning levels of the OTHER 3 homewolrd games, where you're frantically escaping from something. What makes it brainless apeing, and not 'payiing homage'...? In the other Homeworld games, running out of tme was a clever illusion you're meant to see through. In Deserts of Kharak, you are ACTUALLY running out of time, ticking clock and all. DEVS. MISSED. THE. POINT.    ",
            "review_score": "-1"
        },
        {
            "review_text": "7 hours. Thats all it took to complete. That amount of campaign time would make even a console game blush with embarrasment. For a PC game? Dear gods... I'm glad I got it cheaper having bought the remastered set in the past (and long before than the original two games....)  I could see it coming, the pace at which you get given new units is fast. Many researches... it doesn't feel like long before you have everything.  This said, it feels like Homeworld, the sounds, styles, most of the gameplay (obviously being on land changes things somewhat!) the unit icons indicating what class something is etc  TL;DR&gt; If you love Homeworld, you'll probably love this. The problem is that just as you're starting to fall in love with it, it goes and breaks your heart and ends.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: expedition guide, cinematics/story, visuals  Cons: everything else    I really want to like this game, I kept giving it a chance, and I will probably continue to do so becasue im a sentimental idiot about homeworld 1 and 2. But there are too many little things keeping it from being good. As it is, it can be enjoyable at times, but it is no homeworld.  The unit control is terrible. Airstrikes are easily wasted at no fault of the player - they almost made air units work in a cool way, but they didnt pull it off by what I can only assume is laziness. You can't even save groups for air units - once they dock to reload, any grouping is gone, so you either have to waste a lot of time whenever you launch something, or let the ai waste their single shot on whatever they see first.   Units get stuck on each other. Units have to be babied or else they will get stuck behind hills, potentially not contributing to a fight at all. There is no way to control what formation your units take, and there is no way to move a formation to face the way you want it, meaning your guys will run in one at a time in a line rather than as a wall unless you take a ton of time to set them up manually every single time you want them to move together correctly. Also, if you have units of different speeds in a formation (so more than one type of unit at all), they dont match the slowest speed, but instead rush in one unit type at a time rather than as a full force. Combat often boils down to an ugly point blank mess within seconds regardless of what you do, usually resulting in the bigger force winning. There is a way to make it feel like combat is random and frantic and unpredictable, and I doubt that is what they were going for here but regardless it doesnt work.  Also everything is extremely rock-paper-scissorsy, and not in a good subtle way like the previous homeworlds. The way damge is handled and how this-unit-ALWAYS-beats-that-unit feels more like starcraft or command and conquer, or some old 2d rts. That type of game may have its place, but I dont feel that place should be in the homeworld series.  The camera sucks. You can't rotate or zoom at the same time, or rotate and move, etc. When you rotate, it doesnt keep your mouse position where you left it, so if you rotate ~45 degrees, youll be on the edge of the screen when you let off, making you pan, which gets really annoying really fast. Also, as far as im concerned, the camera doesnt zoom out far enough without going into the sensor overlay mode. The entire game feels too close nomatter what is happening. It feels like someone copy-pasted some crap code off a unity rts camera tutorial and said 'good enough' becasue suckers like me would buy it, and paid youtube dumbasses would sell it to people who have never heard of homeworld.  There is no mod support as far as I can tell, though I havent looked into it much. Considering how well Gearbox did with the remasted version of Homeworld 1 and 2 and implimented the steam workshop, its kind of lame they didnt do the same here.   Multiplayer is extremely limited, and the AI is horrendous so dont even worry about skirmish.  Unlike the rest of the game, the story and cinematics are very well done and are what you'd expect from a homeworld title. The visuals give a feeling remnicent of homeworld 1 and 2 despite being in a desert and on the ground, and were often the only reason I remembered I was playing a homeworld title at times. Also a big plus is the expedition guide, which goes into detail about the history of Kharak, and its really nicely set up.   Despite all the problems, it can be fun at times, but it's the same enjoyment that can come from any generic game. There is way too much getting in the way of it living up to its title, which is a shame becasue the potential is there.",
            "review_score": "-1"
        },
        {
            "review_text": "Will switch to positive if Linux happens.",
            "review_score": "-1"
        },
        {
            "review_text": "  oh, it's very good. everyone should buy it. Epic, cinematic and a work of art to boot. also, the feels in the closing moments of the final cutscene.",
            "review_score": "1"
        },
        {
            "review_text": "It's homeworld, but on the ground...  Yep, that's all.     Actually, no.  First off, it's a LOT faster than original homeworld, since you got no slugging spaceshuips (Well, you kinda have cruisers, which are impressive, strong land vehicles with lots of firepower). There's a lot more going on. At some point, it even felt a little bit like C&amp;C Generals (If anyone remembers that game). And yes, that's a weird and probably wrong comparsion to make (atleast according to some people), but the speed and action reminded me of that game.  I miss some things, especially from the Remastered version of Homeworld. Battles are not as customizable as they were before. I can't change the population limit or ressource density anymore, which, since I like long and drawn out battles, really is a bummer. Also, it feels like there are less units available, so you feel limited. That's not really true, because you got your awesome carrier that you can upgrade into a truly powerful battlewagon and Aircraft is just amazing.  The graphics are absolutely stunning, BUT... if you zoom in and take a close look at your carrier or other vehicles, you notice some low res textures, but since you not often have the time to watch a battle errupt, that's not that bad.  The sound, oh man, the sound. It's brilliant. I love the sound design. Explosions have a good amount of *WAAM* in them, aircraft flying by your ground troops sounds like in a movie. Perfect. Just perfect.  I, personally, instantly fell in love with it. I hope to spend more time with it further on.",
            "review_score": "1"
        },
        {
            "review_text": "A satisfying RTS that feels situated within the Homeworld universe. I enjoyed being exposed to the fully-fleshed out world of Kharak as previously only found in the companion guide to the original Homeworld. The art, sound effects, and graphics are all excellent and very reminiscent of the original Homeworld; the campain is fast-paced, fluid, and fair; and the writing dovetails into the plot of the first Homeworld. There are several Easter Eggs for old-school Homeworld fans, which are great. Unfortunately, issues with the writing keep this from being a masterpiece: key plot points are glossed over, the characters aren't as absorbing as the writers intended, and the latter third of the campaign feels rushed and incomplete. Additionally, the DLC's so far have focused on introducing units for multiplayer, rather than fill in more plot for the single-player campaign. The Expedition Guide is nice, but a PDF version would be nicer, so that I wouldn't need to launch a standalone app to read its contents. Finally, a few bugs persist (such as camera zoom occasionaly getting stuck on a unit until the camera is panned), but I didn't encounter anything that distracted too much from the experience.  Overall, this is a solid single-player experience - I would pass on the DLC's except the Expedition Guide - and hopefully the devs release a DLC that fills in more of the campaign. A sequel would also be great!",
            "review_score": "1"
        },
        {
            "review_text": "Am loving it, feels nice have up and down terrain.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really test your skill on units and resources management. Love it very much. Well done gear box and BBI",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to like this game but its horribly unoptimized. No matter the settings it still has this bizarre microstutter. I think the game looks beautiful despite everyone saying otherwise, the art style just makes it work. Now if only it ran better. guess I'll go back to Howeworld remastered while waiting for future patches.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was the biggest dissapointment. They reskinned another game and called it Homeworld. Missions are incredibly boring and provide little to no challange. I'd consider it nothing more than a under developed Alpha. The maps are weak, unit styles and usage are weak.   The fact that there are DLCs that just reskin current build is outrageous.   avoid this game at all costs.",
            "review_score": "-1"
        },
        {
            "review_text": "I have an i7, 16gb of RAM and a 970. Game wouldn't let me change my graphics settings above 'low', saying it would cause system instability. Also, I could not change keybindings.  Other than that, The game was rediculously underwhelming. I don't even know where to start. Actually, that's not true...I just don't care. This is the first and only game I've ever requested a refund for, and I own damn near every RTS since Red Alert.",
            "review_score": "-1"
        },
        {
            "review_text": "bad AI, not a lot of content, can't skip cut scenes (very frustrating)",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself was quite good. I played it whenever I had some free time. All in all, I managed to finish the game on the highest difficulty setting within ... 18 hrs. For a 49 EUR game it is a joke, really. Multiplayer is weak at the best, skirmish mode - I tried it, played a couple of matches, all of which I had won easily on the highest difficulty setting without any trouble. And I am not THAT good a player.  Was the game worth buying at the current price? No. Definately not. Would I recommend buying it with at least a 50% discount? Yes. A price range of up to 25 EUR would be fine. As a 49 EUR title the game is much too short. Less than 20 hours of play for such money should not happen.  My recommendation - wait until the game is much cheaper or on sale and then buy. Not before.",
            "review_score": "-1"
        },
        {
            "review_text": "this game doesn't have multi sreen support on mac",
            "review_score": "-1"
        },
        {
            "review_text": "I expected a lot more from these people. Being a fan of HW, Relic and RTS games all I would say is that it's a good game, but not what it should have been. The original HW was flawless in so many ways, this game is just average in everything.",
            "review_score": "-1"
        },
        {
            "review_text": "the graphic is so awful,dont have its' own characters,not recommend",
            "review_score": "-1"
        },
        {
            "review_text": "The game seems poorly optimized. Running a gtx 1080 and i7 6700k the performance is very choppy and stutters often. 60 fps to start which seems nice but later the game handles poorly as more and more units are added to the screen. Luckily I noticed this by trying out skirmish mode 3v3 before the 2 hour mark. Sadly I decided to refund it rather than put up with it.   It's a shame because I really wanted to like this game, and otherwise the gameplay was fun enough and the game looks pretty great.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I requested a refund on it allready. It is very lacking in features and full of bugs. Only thing that felt complete is the campaign, and that alone is not worth the 40-50 dollar price. It really saddens me to see such a good series in the past do so poor now.  The camera controls were buggy, units lacking, ai just dumb as bricks, and the amount of skirmish maps I can count on my hand is pathetic. Individual unit behavior is pretty bad too. The entire high ground feature is more of a gimmick and ends up hindering your units are they are too dumb to move half a foot to crest a hill to shoot enemies and instead stare at the small hill while the rest of the selected units get shot up. I don't know if they were rushed from gearbox or the ip transition was too difficult for a small team, or what happened, but this game is bad. 4/10 just for the good cut scenes and campaign. 2/10 for actual gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "As far as strategy simulation games go, this is a crappy movie. You can't even skip the horribly long-winded and incorrect buzz-word filled dialog. 'The gate is full aperture, she's all yours captain.' What? I'm driving the gate now? C'mon.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is literally unplayable right now. I can't load into anything without crashing.  All of this during a sale... Are you kidding me?",
            "review_score": "-1"
        },
        {
            "review_text": "Ugh. That's the last time I spend $50 on a Steam game.",
            "review_score": "-1"
        },
        {
            "review_text": "Having played a lot of Homeworld with its finelly tuned control scheme, H:DoK control scheme surely is not. Right clicking puts the mouse in view mode rather than interpreting it as a move order. Control-dragging often results in a selection rather than an attack box. The alt-click and alt-drag to focus from HW is sorely missed, instead click F to focus on selected unit(s) together with a hit-and-miss selection function (it is more difficult to select units than one should expect from an RTS.  - Story is fine so far.   - Graphics (except the lo-res stuttering cut scenes used sometimes instead of game engine cutscenes) is what I expected and wanted from the HW devs and art directors.  - Sounds and music are as good as HW.  - Controls are so irky, quirky and sub par, I don't want to ruin my experience by continuing until the game has been patched. I hope it's not a Unity engine issue but only an unfinished, untuned release.  In the state the game is now and for the current asking price I unfortunately cannot recommend the game. I got everything I expected except from the control scheme that is neither up to HW nor RTS standards.  Will come back after a patch or two though and promise to change my No to a Yes. I wan't to believe ;)",
            "review_score": "-1"
        },
        {
            "review_text": "A piece of crap made by asian interns at gearbox, who had thair parents bribe admissions at UCLA to escape their miserable chinese/indian motherland.  Unplayable.  A step back in everything that was Homewrold. To start off- it's flat. It's 2D strategy about a time when 'clans' fight each other over getting to the ship that in the original lore then entire planet joined whole race's resuorces to get to. The story stomps on the Kaharkian exodus seeing as now they're not scientists that were stiffened by Taiidan invaders, but merely a-holes that fought each other over their own destiny and escaped to space barely making it in the game of mutual self destruction. It not only screws up its own timeline, but also one of the greatest settings and stories ever told - the original Homeworld. And it does so in the most demeaning way possible. Starting with even the simplest things like 'pay-for-lore' and the fact that Sjet has an english name 'Rachel'. Pathetic.  This is after relic developers and writers made it a point to make sure the names in the lore sounded as unearthly as possible. Next-up - Kharak has an election between republicans and democrats and 'evil Russians from space' ruin everything.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like Homeworld you will like this. Although short, I want to see what the next installment has in store. Bug free gameplay with well-done map management and resources. Good job keeping the old relic feel to the series and the art/sound style. Campaign is short, but extremely well presented.",
            "review_score": "1"
        },
        {
            "review_text": "Nice little Strategy, I'm a big fan of Halo Wars and can soo some similarities.",
            "review_score": "1"
        },
        {
            "review_text": "Short and not too sweet..",
            "review_score": "-1"
        },
        {
            "review_text": "Played House Harkonen, Killed Mua'dib. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun but kinda short. Each map was just about the same. Would like to see more to the story.",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent game, well worthy of the Homeworld name. Likes: 1. action 2. graphics  Dislikes: 1. Weak enemy AI",
            "review_score": "1"
        },
        {
            "review_text": "This Game here is by far my favorite RTS, and has great audio, as well s agreat story. I enjoyed the first game that was really good to play but now going onto the deserts of karack, this was the icing on the cake :D   The only issues I have with game it needs to be optimized, if they do it they will get a lot more great feedback, and will have a 10/10 from me!!",
            "review_score": "1"
        },
        {
            "review_text": "Overall 7.5/10 The bad: -While the elevation system is very cool the lack of ability to put units in formations largely makes this system difficult to manage and implement without microing every single unit -As per above no ability to put units in formations or change the direction they're facing even. That is like a Ground Control 2000 feature and i'm really having a hard time wrapping my head around why the developers omitted this feature. -Lack of character development and background story. I realize there's a DLC for this but i'm not going to pay for something that should have been shipped with the game. At least give me an opening cinematic that gives me a good idea of what's going on in this world. Also if you're going to put a face to a character then you should probably develop them out to be more tangible and relatable. 'Fleet Command' in the original Homeworld didn't have a face and I still related more to them. -Some of the earlier units lose their purpose in the later missions. The Good: -The game does do a good job of setting the stage for the original Homeworld. It was always puzzling to me how a civilization that was exiled to a planet on the far side of the galaxy then basically started again from the iron age were able to challenge the Taiidan on their first exploration of space.  -Music is pretty good -Some very cool units -The way your 'mothership' acts as more than just a unit producer and can hold its own unlike in HW and HW2. It's more of a HW: Cataclysm ship.",
            "review_score": "1"
        },
        {
            "review_text": "picture CoC: tiberium sun only 90000 times better...this games fun as fook",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, great sense of scale like in the other homeworld, sensible and very tactical. Lacks a bit of what the other hoeworld have, that is the sense of loneliness and silence, and a certain mysticality. It gains in tactical options and RTS design though, and keeps the same depth. Makes you want to play the old homeworlds again...",
            "review_score": "1"
        },
        {
            "review_text": "Homeworld is the best RTS franchise I have ever played. Started back in 1997.  This is a MUST-HAVE franchise that everyone should have. Deserts of Kharak is a good introduction to the story.",
            "review_score": "1"
        },
        {
            "review_text": "If youre a die hard Homeworld fan you'll like the story link. However if youre a die hard fan youre most likely pretty tasty a strateg and wont find it a major challenge.",
            "review_score": "1"
        },
        {
            "review_text": "A few rough edges, but it's as close to a perfect Homeworld game as a heretic concept of 'ground-based Homeworld' could be",
            "review_score": "1"
        },
        {
            "review_text": "  6,5 / 10",
            "review_score": "1"
        },
        {
            "review_text": "nice game. but you must be Homeland fans",
            "review_score": "1"
        },
        {
            "review_text": "SO FAR the campaign is worth the price of admission alone in my opinion. Skirmish is fun but the AI is mostly pretty weak. Campaign is awesome though.",
            "review_score": "1"
        },
        {
            "review_text": "Story mode is ok. multiplayer is limmited and not many units to keep game interesting. Its polished and good singleplayer game. Although it drip feeds units all of a sudden you get everything. Some tactics make the game too easy. This game needs more units. Wait till its on the cheap to buy.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a huge fan of Homeworld... For years, I have been dreaming about this universe, its atmosphere, and its splendid music acompagning every actions in space and time! I loved replaying the HW campaign from the Remasted edition, and I essentially wanted to play HW:DoK for its campaign, hoping to find the same things that made me dream as a kid...   Well, I just finished the solo, and I absolutely loved it! Everything, every single mission, every single unexpected development in the scenarios. Tthat was epic, great and magnificient! Thank you a lot BBI!  You loved HW? You want to play a nice STR with an original background? Then don't hesitate a single second.  I don't plan to try multiplayer games. I'm not playing in that Universe for that, but the campaign worth every penny you will put on this game.",
            "review_score": "1"
        },
        {
            "review_text": "It has been years since I saw some backstory that is so cool. 'A carrier in the desert, really?' I thought. But the execution is impacable. All the details in physics and graphics offers the suspension of disbelief. The structure is so cooooooooool.  I knew very early that this is a game that got its gameplay design first and then pasted the Homeworld theme on. So I didn't put much faith in it. But the gameplay itself is fun. It does have the unique vibe of Homeworld series and also feels new and refreshing.   I just wish it could have a small window or support a separate screen so that I can sending order and checking status while seeing beautiful details of the units in combat.",
            "review_score": "1"
        },
        {
            "review_text": "Great love the cut scenes alot the artistic draw is a must watch alone the story is good ame play one of a kind desert setting, but the game is short and leves me wanting more..... heres hoping for a second",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding RTS. Has the old feel of the classics, with the refinement of control of new RTS. Just one downside though, and it's that the campaign was a little short.",
            "review_score": "1"
        },
        {
            "review_text": "This game was a pleasure to play. Feels like Homeworld.",
            "review_score": "1"
        },
        {
            "review_text": "6/10 I am a big fan of the Homeworld series. This game fits well.   Storyline is way too short.   Why are there so few maps for skirmish/mulitplayer?   This is desert terrain, should be able to procedurally generate skirmish maps.  Great gameplay, decent graphics, runs well. Sadly it really lacks in content. I bought it on sale, but still feel a bit cheated. Was looking for a professional level game, this one is overpriced for what little content.   DLC isn't worth it, as there is little to no reason to play multiplayer/skirmish atm.",
            "review_score": "1"
        },
        {
            "review_text": "Firstly a disclaimer... I love the homeworld games. I played the original back in 98 and cant understand why this hasnt been a more successful line. I recently played the remastered versions of the originals and enjoyed them all over again and I have to say I enjoyed this too. The campaign has always been the Homeworld strong point, but like the originals they are frustratingly too short. Hopefully now they are on Steam, more missions will be added. The ending of DoK is very abrupt and cries for more story. The game mechanics are great and the amount of missions don't really let you explore each units special ablility but I'm hoping these are all available in the multiplayer which I dont have much experiance with yet.  This really feels like it should be a beta realease with more content to come... fingers crossed.",
            "review_score": "1"
        },
        {
            "review_text": "  Its a very good and indepth game, i would prefer Homewolrd Remastered, but this is a great Homeworld aswell.",
            "review_score": "1"
        },
        {
            "review_text": "Meh....  Has the look &amp; sound of the homeworld series so I'll give them points for that.  But beyond that you can't skip cut scenes if you want to repeat something or just get to it. Can't queue production or remap control keys. You just park on the resources, set your rail guns up in the back row with a healer in the front &amp; let them come to you. 5 missions in and I'm just not feeling it.",
            "review_score": "1"
        },
        {
            "review_text": "Undeniably Homeworld!",
            "review_score": "1"
        },
        {
            "review_text": "Would like to highly reccomend this RTS game. Blackbird showed attention to detail here and althought just starting out at this point first hour has been enjoyable and a reminder of those great RTS games played in the past.... Everything about it done right. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I love the feel of this game, and it really challenges you, the player to spend your resources wisely. Also in the campaign whatever resources and units you had continue onto the next mission which really makes you plan ahead to make sure you always have the best possible outcome. In all a great and beautfully designed game with stunning cinematics and an interesting story of how the first homeworld came to be.",
            "review_score": "1"
        },
        {
            "review_text": "To start out with, I liked this game, but did feel it could have been something more. For reference, I am far more interested in the single player campaign than multiplayer/skirmish.  Positives:  -The feel of the game was very reminisent of the origional Homeworld game. Everything about the art style and the music was very much in keeping with the orgional. - Going along with this was the quality of the vehicle and fleet designs and compostion. I did not feel like there were any useless units, and overall the game felt well balanced. - The game was fun. Both the story and the gameplay were generally immersive and fun.  Negatives/Improvements  - As mentioned elsewhere, the campaign was short. In general, the whole game felt smaller, not as grand in scale, as the origional Homeworld Games. - A lot of interesting things happen off screen. The inclusion of the 'Feild Guide' was a nice piece of worldbuilding, but some of the things in it would have made for great missions, or would have made the reasons for some in game events make more sense. I would have liked to see more of the guide included in the actual game. - The control scheme is a bit basic. Something as simple as the ability to rotate your arrival points would have been greatly appreciated. In general I thought the controls were adequet, but were a bit dated.  Overall  As noted, I liked the game, and as a huge fan of the origional Homeworld I REALLY liked it, but for most people, wait until it hits $20.  *Still waiting for a remake of Homeworld: Cataclysm though :(",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic new style RTS - 90/100  Pros: -Great Single Player (all I really wanted from this game) -Story is up to par and similar to Homeworld 1 and 2 -Desert terrain mechanism for sight is fun -Units have rock/paper/scissor counters and you definitely need to whatch what units engage and retreat -Graphics and sound are fantastic  Cons: -When mission ends, the left over resources are lost including artifacts. It would be nice for a continue after mission ends to gather these. So save often. -Storyline is predictable, but it barely matters. Would have loved additional backstory of the other clans etc.  Final Thought: I personally loved this game as a 'campaign only' purchase. I tried multiplayer a few times and it did seem to have very redeeming gameplay. However, since I play a TON of other games I have sidelined the multiplayer till other friends buy the game.",
            "review_score": "1"
        },
        {
            "review_text": "A word to the developers: Thank you. Not only for a beautiful game. You cannot imagine what it means to me at least, to see the Somtaaw insignia on the wreck of Khar-Toba. How unfortunate that the source codes of arguably the best game in the series is declared lost. We are waiting for a sequel. You know it. And please, next time don't forget the PAUSE button.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but it lacks content of a full priced one. Addiotional factions must be purchased as DLC's if you want to play those in skirmish. Don't know how thing is with multiplayer. Campaing was good, but rather short and lacked epicness of a previous Homeworld games. There might be some optimizing problems in the game as framerate dropped sometimes to 20 even tough I have well equiped computer.   I would recommend this game, but not with 45€ price tag.",
            "review_score": "-1"
        },
        {
            "review_text": "Imagine Homeworld but faster and on a planet. And by faster I mean it no longer takes 20minutes to cross a map with units in formation.   Story is good. It does wrap up really fast. Only down side.",
            "review_score": "1"
        },
        {
            "review_text": "They still got it.",
            "review_score": "1"
        },
        {
            "review_text": "A very intense RTS game, it reminds me of the good old classis RTS era (Starcraft, Red Alert, Tiberian Sun, AoE and all). Various units, good balance, epic battles, good story.   However the game does not worth the full price for it is very short (the campaing was only 16 hours long). I bought it with 50% discount, that is the amount of money I didn't regret for it.",
            "review_score": "1"
        },
        {
            "review_text": "Great RTS with realistically scaled unit sizes, awesome sound effects &amp; music, nice graphics and, last but not least, a fantastic story that... ends very poorly. It's difficult not to let the end of this game overshadow the fun to be had whilst playing through the campaign, but there you go. A solid 8/10. One more thing, this game allows you to make mistakes and still win through audacity and/or cunning - VERY well balanced.",
            "review_score": "1"
        },
        {
            "review_text": "Completely underrated game!",
            "review_score": "1"
        },
        {
            "review_text": "This is arguably the best single-player campaign RTS experience I've ever played. It's hard to make the story of an RTS game engaging, but this game nails it. It's a very narrative heavy RTS game that actually made me feel. I was stressed and anxious, when I was put in a mission with limited resources. I was excited, when breakthroughs were achieved. I felt scared, when the narrative took twists and turns.  As far as gameplay, everything felt balanced, thoughtout, and polished. It plays very similarly to the original Homeworld games, which I played and loved, but I could never fully wrap my head around operating in 3 dimensions on a large scale. The more compact and 2 dimensional space of this game was perfect for me. Every mission felt like a challenge, but a surmountable one if I was fast and clever enough. The voice-chatter of units in the game MUST be set to the maximum setting. The level of immersion that is created as your units are calling out to each other and different subordinates are feeding you reports and updates is awesome (honestly my favorite aspect of the game). There wasn't a single time my immersion was broken as a result of voiceover; all of it was very well-done.  Cannot recommend highly enough. 10/10 will play again on hardest difficulty",
            "review_score": "1"
        },
        {
            "review_text": "Brings back the magic. Same controls, same vibe, similar units. Only difference is it's literally on a level playing field. Works well still.",
            "review_score": "1"
        },
        {
            "review_text": "The PERFECT RTS. Its amazing how the game looks works and feels. What is like especially is that in the campaign you retain troops from earlier missions. So if you take the time to carfully plan attacks to prevent casualties you will be rewarded with a nice starting army for the next mission. All in all i havnt gone too deep into the game but I am more than confident in giving this game a 5 star review! ",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Why the negative review? Because they charge you for the lore that used to come included with the game. No joke. Check out the $6 'Deserts of Kharak Expedition Guide' O_o",
            "review_score": "-1"
        },
        {
            "review_text": "A huge thank you to Gearbox for being Fans of the original team and game and buying the IP when THQ tanked, and then letting the original group who was working ona kickstart type funded game which turned to being this. I can only hope that we get more games and more great story telling from such an amazing group of game developers!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, really expands on the Homeworld lore, and it really feels true to the feel of HW despite being 2D planet based. Beautiful looking environments and art. Gameplay felt a little too rock, paper, scissors and I did run into a bug where I had to restart a mission from the start but otherwise a fantastic experience if you love Homeworld.",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot of negativity surrounding this game. Mostly because of the silence from the development team. Lets get this straight first, yes this is a bad move on their part. But we're not here to review the development team. We're here to review the game as is.  With that out of the way, let's look at the game.  VISUALS  Graphically speaking this sticks to the Homeworld format. Massive levels of zoom, incredible detail on the units and lots of nice whizbang effects for weapons and explosions. The camera is a touch finnicky to say the least. Without it automatically tracking units its easy to get lost in the desert. It can be argued that this is where the tactical map comes in, but I'd still like an out of the box solution for selecting my carrier without doing key rebinding. This also scales really well on your hardware too, I'm running a lower end PC and get a solid 50+ FPS on a GTX 560Ti.  GAMEPLAY  Fast, frenetic and fun. Theres a little niggle here for me though. CU's and RU's. There simply aren't enough RU's in the game to make this worthwhile having as a system. I love shipbreaking and being able to snag more, but even still 100-200 RU's per deposit simply isn't enough unless you want an army of LAV's and Railguns. Nut honestly, thats my only real complaint gameplaywise. Its great to be able to just pick up and play, its a very basic, no nonsense RTS that allows you to jump into a turbulent time in the Homeworld universe.   FINAL WORD  So, is it good? Yes. Is it worth full price? No. I picked this up on sale and I'm glad I did, the game is fun but I'm not certain it warrents the full asking price. If you're loking for a simple, fun and story driven RTS pick this up.",
            "review_score": "1"
        },
        {
            "review_text": "Admittedly am not very far into the game but enjoying it so far. Not sure why there is all the hate, yes there is a bug in mission 4 but this is very easy to overcome",
            "review_score": "1"
        }
    ]
}