{
    "app_id": 281860,
    "name": "RefleX",
    "release_date": "2014-03-27",
    "developer": [
        "SITER SKAIN"
    ],
    "publisher": [
        "Nyu Media"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Shoot 'Em Up",
        "Indie",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 159,
    "negative_ratings": 22,
    "price": 5.59,
    "description": "The second chapter in one of the most loved and respected Japanese shooting game series ever: The Tale of ALLTYNEX by Japanese indie developer SITER SKAIN. Carefully crafted play experiences, destructive fun, and absorbing gameplay have made the ALLTYNEX trilogy renowned in shooting game communities.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/281860/header.jpg?t=1450301946",
    "minimum_requirements": "OS: Microsoft Windows 2000 / XP / Vista / 7 / 8 Processor: Intel Pentium4 1.4GHz or better Memory: 128 MB RAM Graphics: DirectX 8.1 or above and Direct3D with 64MB or more of VRAM Storage: 200 MB available space Sound Card: DirectSound-compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Reflex is a older Bullet Hell game that was recently ported to Steam.  Graphics are similar to the 16-bit era, rather simplistic but still appealing.  The music is, like a lot of BH games, highly addictive. Personally, I feel that Angel Dust (Entropy battle) and Air (Stage 6) are the best in game, though The Scorpions Poison (Scorpio Battle) is a close runner up.",
            "review_score": "1"
        },
        {
            "review_text": "great japenese indy shooter everytime you play you go a bit further with its great learning curve graphics are great loved playing iti would give it an score of 8 out of ten  ",
            "review_score": "1"
        },
        {
            "review_text": "A great shmup with a distinctive, easy-to-learn, hard-to-master mechanic: You can activate a temporary shield to defend yourself from enemy shots. Blue bullets, lasers, and orbs can be reflected, dealing massive damage to enemies. Shots are very clear (except when intentionally unclear), thanks in part to well-drawn sprite art. A very dark story if you choose to follow it -- and you will be able to, even if you're no good at shmups (like me), because it gives an extra continue every time you game over. The music is great, too.  (Disclosure: I acquired this game as part of the Indie Gala October bundle.)",
            "review_score": "1"
        },
        {
            "review_text": "Gonna keep it short and sweet, plenty of history out there online if you care to find it. This game is fantastic, most people claim Kamui to be the best of the trilogy but I disagree. There is a certain style behind all of the Siter Skain games that flows throughout (even if it is less apparent in A2) and I really like the feel of these games but at the same time each game in the trilogy also completely rips off a larger commercial shmup. The balancing act between what comes from them and what comes from somewhere else is what makes this title stand out to me out of the three since it focuses on the shielding mechanic made popular by Gigawing and made better by Mars Matrix. Unlike Kamui which takes from a personal favorite of mine, Rayforce (Galactic Attack USA, Layer Section PAL I believe, get it on the Saturn if you don't have it), I don't enjoy Gigawing or Mars Matrix so I was completely open to their take on the gimmick. To me, RefleX doesn't feel like a copy-cat while Kamui does making this the definitive Skain title (I also don't care for Silvergun and other games like it but A2 still couldn't sell me on the concept). Keep an eye out for Kamui and A2 soon because despite sounding like I don't care for it I really do think Kamui is a masterpiece but it refined something great for me rather than breaking new ground which is still a great thing and a lot of mainstream gamers tend to dig the Silvergun style of shmup that A2 offers and does pretty well.",
            "review_score": "1"
        },
        {
            "review_text": "It's difficult to recommend this game, as the review system requires, simply because of the age. The game doesn't scale well for modern systems, being well over a decade old. It runs windowed, and has minimal configuration options. Because of the age of the game, and being aware of much newer games of the same genre.  However, if you do enjoy bullet hell games, and don't like the new ones, it's playable on Windows 8.1 with no serious issues (the control scheme, however, cannot be customised).",
            "review_score": "-1"
        },
        {
            "review_text": "Responsive movement, interesting mechanics, highly visible bullets.",
            "review_score": "1"
        },
        {
            "review_text": "I rate this game 3/5. Okay, but this can get frustrating to play.   This is a fun bullet hell spacey top-down view late 1980's styled arcade shooter which will be fairly familiar to anyone who's played Crimson Clover or Raiden III. However the various weapons systems of your spacecraft can take some getting used to (they are quite a bit more complex than in most other shooter arcade styled games of this kind) and this game is quite a bit more challenging (and can be frustrating) than many other games of this type. The levels and enemies are fairly creative and the action is intense though.",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty good Danmaku game, and sports an interesting shield mechanic. This requires quick reflexes to take full advantage of the shield. This meaning you can't hold down the shield button, or it will deplete. The shield allows you to reflect bullets at your enemies, and of course protect yourself; it also helps that the OST is pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "A very good game, but it often throws a bunch of BS difficulty at you near the end. let's just say you shouldn't get used to having more than 1 health. Still a good game, and I love the difficulty regardless of the bits of frustration here and there.",
            "review_score": "1"
        }
    ]
}