{
    "app_id": 281840,
    "name": "4PM",
    "release_date": "2014-07-09",
    "developer": [
        "Bojan Brbora"
    ],
    "publisher": [
        "4PM GAME"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Walking Simulator",
        "Female Protagonist"
    ],
    "achievements": 0,
    "positive_ratings": 74,
    "negative_ratings": 155,
    "price": 1.99,
    "description": "4PM is a short, narrative driven game, made by one person as an attempt to tell a real, thriller story in the form of an interactive experience. It has high production values and a cinematic style. It is, with your support, a first in a series of smaller, narrative driven experiences, that spare no expense on audio-visual style.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/281840/header.jpg?t=1447360528",
    "minimum_requirements": "OS: Win 7 Processor: 2 Ghz Memory: 4 GB RAM Graphics: DirectX 9 compatible with 512MB of Ram Storage: 4 GB available space",
    "recommended_requirements": "OS: Win 7 Processor: 2.5 Ghz Memory: 8 GB RAM Graphics: DirectX 9 compatible with 2 GB of Ram DirectX: Version 11 Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "Drunken girl simulator that is mehhhhh.. The gameplay is bad and the story is so-so.  The game is quite big 3GB in size and took you only 30 minutes to finish the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, i could not advise to buy this game. Even if depicted story is very uncommon in the video game, this is a far too short. 30 min of game... And even the main character story is barely evocated.  My main const on this game is that it could has been really more developped. for example playing several days instead only one, with increasing loose of caroline (first days could be quite good, and the things could go worse). And also it would be possible to have Jame story from his mind. Here also having several days to let the things go bad. ",
            "review_score": "-1"
        },
        {
            "review_text": "WOO-W-W-W-W-WOOOO-W-W-W-WO-WO-WOOOOOO-WOOO-WOOOOOO  this game gotta twist that would make m. night shyamalan jump (bc jump in game lol).  i couldn't believe my ears when that twist was revealed to me. the girl (in the story) was dead the whole time.  pros: - Eastern music is good cons: - film school  after this game i really started thinking about suicide and where those who commit suicide go. when you think about it, all we all is energy and energy never goes away so it's like wen u die you're still here. so ♥♥♥♥ it. hahaaaaaa.  notha review in the books!   btw, the girl has short term memory loss and the guy had many affairs with her without her knowing. it's not really that great. 10/10 :KneelingBow:",
            "review_score": "-1"
        },
        {
            "review_text": "Despite the negative reviews, I enjoyed 4 PM. Rather than thinking of it as a game, think of it as an interactive movie. Although the story is just thrown in your face, you somewhat get to know a little of our troubled heroine. It was an interesting game, puts more of a realistic take on the consequences of alcohol addiction and the choices people make.",
            "review_score": "1"
        },
        {
            "review_text": "I got this in a bundle today, having never heard of it before. But, I like 'artistic' games; I've enjoyed such works as 9.03m so I decided to try it. The '0.5 hrs on record' you see above is my total play time, from beginning to end, beating it. Plot aside (there is one, but it's not very well fleshed out), the execution of this game fails on every level. Optimization is poor, response is sluggish, interactive items only work when it's time in the 'story' for them to work, character models look at least ten years old, voice acting is mediocre, and even the subtitles are poor (for example, 'lose' is misspelled as 'loose'...twice). One 'stealth' section of the game is laughably (and worse, frustratingly) bad, and all of these things get in the way of what should have been an interesting and meaningful experience about alcoholism and depression.   It's hard to believe this is a 2014 release. '4PM is a high production value, cinematic experience aimed at people interested in interactive story-telling,' the game's press release reads. Yes, all those things would be true --if it were 2004. It's not, and this game is far too many years too late to be worth the effort of muddling through it. What a shame.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this game unless it's under $2. That's all it's worth. This is basically like watching a short film, except that you have to click a few times to advance the story. I don't know why they bothered to make this game interactive, the choices you have to make are rudimentary, and have no bearing on the outcome except at the very end when there are two endings. The one challenge (sneaking past somebody) is more awkward to complete than it should be, and is made more frustrating by the fact that there is no 'skip dialogue' button. The interface is really quite annoying, with its 'blurry drunk' simulation, it also was quite jerky on my machine even with settings cranked down. It's not in the same league as Dear Esther or The Stanley Parable and feels very amateurish. Worth a brief look but I would rate it only 5/10.",
            "review_score": "-1"
        },
        {
            "review_text": "  I like lots of one-man projects...",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this game.  Maybe a few years down the line Bojan Brbora will be able to deliver a great storytelling experience. 4PM is not that. As far as I'm aware it was his student project at the National Film and Television School in the UK. That's so blatantly obvious throughout my stint with this game.  It's 30 minutes long, with bad writing and voice acting. The two gameplay sequences are frustrating with most of my playtime coming from failing them a few times. The story's premise isn't inherently bad but the short length forces it to unfold in a half-baked way that just seems absurd and the 'twists' are unearned. By the time the credits were rolling (which are actually probably one of the best parts), I was just laughing at how completely inane at what transpired in the past half hour.  Visually there's a decent aesthetic with this almost-blur but it's ruined with quite low quality and badly designed assets. It's an indie game, I know, but the character models are so deep in the uncanny valley it's kinda scary at times (seriously that boss guy aaaaa). Sound quality varies but voice acting is middling to terrible. Sound effects sound mostly stock so they rarely sound like they actually fit. The subtitles have grammatical errors in them occasionally which is nitpicky but come on.  There's a decent message hidden under 4PM, and some interesting themes. It's just not a well made product. Give this man more money and a more talented team to produce a longer story and he'll be miles better than David Cage. That's faint praise, I know.  P.S. Press Q to be a white girl and go 'WOOOOOOO WOOOOO WOOOOOOOOO'. If only this had Heavy Rain's 'JAAAASON' glitch and you could do that at any time.",
            "review_score": "-1"
        },
        {
            "review_text": "Blurry graphics that can't be disable (they must use it to hide graphicsl flaws it might have); It's 20 minutes long or less (I was playing a mini game on the cumputer for a few minutes); Poor gameplay (just have to walk and click LMB which is enough to finish it); Poor optimization (even has very poor graphics, I can play Dying light on minimum better than this one); Even if I tried to enjoy the story (It seemed interesting), in 20 minutes with that blurry, cheap, graphics, I really can't. I saw somebody saying it's like Heavy Rain, it can be only the same about it's genre because it's nothing like it, shorter (REALLY) and boring. I don't like to give bad reviews but here's one of mine. I got this game on a bundle.  Score: 4/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Yes it has 'high production values' and looks quite good but it's not a game. I would have no objections to watching a whole movie where all you can do is move your mouse to change the view. That would be an interesting way to watch a movie. This though puts choices and one gameplay part into the 'movie' and that ruins it. The gameplay part is clunky and far too hard and every time you fail it you have to sit through a cutscene over and over.   I also didn't find the story very interesting. Yes it's 'grown up' but it's not interesting.   I found an English actor saying 'Pacifier' very jarring too. He would have said 'dummy'. I suppose it's possible the game is set in America and the character is just using Americanisms on purpose but it sounded wrong.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has potential.  I know it's not supposed to be a 'A' class game and all, but the blur and post processing covering the 'poor modeling' is too much. Yes i know it was made to portray the drunkenness, but in my opinion it still too much.   I also had to play 2 or 3 times to understand the story. Maybe it's my English, maybe the history telling is not very well constructed. I don't know.  I think it needs to be polished a little more. But they are in the right track. Keep up! I'm willing to give a good recommendation in the next sequences!",
            "review_score": "-1"
        },
        {
            "review_text": "I can see what this game tried to do, and I appreciated the effort. But while on the technical side it can be forgiven, being a 100% indie project, it really needed a designer. A real game designer I mean.",
            "review_score": "-1"
        },
        {
            "review_text": "If I've spend 30 minutes by beating my head into a wall, it would still have been a better experience than playing this buggy game!  The movements in this game is almost the worst I've ever seen, and it's a god damn walking simulator?!?  The story was... I don't even know, and don't really care :P",
            "review_score": "-1"
        },
        {
            "review_text": "That was horrible. I can't stress enough how boring this game was. Even though I was told it was only a half-hour long, I couldn't make it all the way through.  On top of being boring, the graphics are poor.   The worst part was the movement scheme. The camera wobbles around so much that playing for fifteen minutes made both myself and my girlfreind nauseous.   Beware  ",
            "review_score": "-1"
        },
        {
            "review_text": "Not interesting, crap graphics, nearly nonexistent story.",
            "review_score": "-1"
        },
        {
            "review_text": "I like story-driven games, the kind that some people don' teven think of as games because there's no 'winning' or 'losing' or even scoring involved. Ever since I played 'Dear Esther' I've been looking for as many first-person, story-driven games as i can find. '4PM' is one of the best I've played in a long time.   The graphics aren't necessariliy great, but they get the job done without getting in the way of the story or gameplay. The voice acting is better than in most games. I especially liked the option of jumping forward to the next part of the game. If you like minigames like trying to sneak out of the office, you can play thtough them. But if you get stuck in them, as I did in that part, it doesn' thave to stop you from reaching the end of the game.   If there were more episodes or chapters of this game, continuing the story, I'd definitely go along for the ride.",
            "review_score": "1"
        }
    ]
}