{
    "app_id": 281820,
    "name": "Explodemon",
    "release_date": "2014-03-25",
    "developer": [
        "Curve Studios"
    ],
    "publisher": [
        "Curve Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 20,
    "positive_ratings": 45,
    "negative_ratings": 17,
    "price": 6.99,
    "description": "An explosive homage to SNES-era platformers from the makers of Stealth Bastard Deluxe, Explodemon is non-stop action mayhem like you've never seen before.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/281820/header.jpg?t=1456243433",
    "minimum_requirements": "OS: Windows XP, Windows 7, Windows 8 (Not compatible with Windows 10) Processor: Dual Core 1.6ghz+ Memory: 2 GB RAM Graphics: DirectX 9, 512MB Video Memory or Greater DirectX: Version 9.0 Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game deserves a lot more attention than it currently gets. The writing is hilarious, gameplay is great and very reminiscent of classic platformers (like the Mega Man X series) but maybe with a slightly more forgiving level of difficulty. Besides being an homage to such platformers it's a great game in it's own right. Good controls, interesting mechanics, good level design and can be played both as an action platformer and a puzzle platformer. If you're going for 100% there will be some puzzle solving, but any% doesn't require much in that department.  Additionally, it seems like an ideal game for speedrunning, but sadly no one seems to have picked it up.",
            "review_score": "1"
        },
        {
            "review_text": "At first sight it may seem like a watered down Megaman, but... No wait, it is actually a watered down Megaman... But I like it. If retro platformers are your thing, then this might be a good game for you. It has nice mechanics, graphics and music. The only irritating things are the constant conversations/tutorials and some earrapey sounds.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "I was expecting some kind of Megaman, maybe because of that i was a bit disappointed when i played it. But nevertheless it is a good game that made fun playing it. Some tricky Jump'n'Stuff parts, but really a game i would recommend ;)",
            "review_score": "1"
        },
        {
            "review_text": "Standard 2D plateformer with amusing gameplay mechanics. Not that difficult given the numerous checkpoints throughout the levels and the short duration of the game. For me, not worth returning a second time, even for the achievements. Speaking of which, I still don't get how to S rank a level. I happened to get one randomly, but I replayed level 1-1 about 20 times, killing all ennemies, getting all items (if you miss one, you'd better restart because sometimes you won't be able to go back in the level), having a completion time of 5 mins, always getting a A rank. Oh and the speedrun achievements are very hard too. All in all I wouldn't really recommand this game unless you're a fan of the genre with money to spare.",
            "review_score": "-1"
        }
    ]
}