{
    "app_id": 282050,
    "name": "MX vs. ATV Supercross Encore",
    "release_date": "2015-10-27",
    "developer": [
        "Rainbow Studios",
        "THQ Nordic"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Sports",
        "Motocross"
    ],
    "achievements": 29,
    "positive_ratings": 282,
    "negative_ratings": 280,
    "price": 24.99,
    "description": "Rip, jump and scrub your way to victory with over 35 tracks in this vastly extended version! Only the Encore edition features the brand new Rhythm Racing mode, extra outdoor Nationals tracks, and exclusive Waypoint races in open world maps.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/282050/header.jpg?t=1533041037",
    "minimum_requirements": "最低配置: 操作系统: Windows® Vista, Windows® 7, Windows® 8, Windows® 10 处理器: Intel® Core™ 2 Duo @ 1.8Ghz / AMD Athlon 64 X2 equivalent 内存: 2 GB RAM 图形: DirectX 10 compatible graphics card like Intel HD 3000, NVIDIA GeForce GTS 240 (1GB VRAM) or ATI Radeon HD 4600 (1GB VRAM) DirectX 版本: 9.0c 存储空间: 需要 5 GB 可用空间 附注事项: Recommended: Xbox 360 Controller | AMD Crossfire™ and NVIDIA SLI is not supported",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "At first coming from reflex, I hated this game with a passion. But after having over 2k hours on reflex over the years, it was time to look for something else. 1st impression, no feel for the bike, couldn't turn, coudln't whip, could barely make any of the jumps. And why is the camera panning sideways in 3rd person? This of all things really screwed me over, this panning of the camera sideways in every turn, made it very easy to run off the track in every turn. I felt limited it what I could do.   Quit and played reflex some more, but the hours were wearing me down. Started playing Encore again when I heard KTM's were released as DLC. This time I gave it an honest try with an open mind, not allowing the sea of negativity to influence my opinion before I gave the game an real try. I would play to get to a point where I could get some clean laps in and start pushing, because this is where racing games come alive, when you are on the gas!   The biggest difference for me between liking and hating this game, (other than the KTM's), was forgetting about 3rd person and playing in 1st person. After I started getting some basic lines down it really felt like Encore was designed to be played in 1st person, not 3rd. The game just felt so much more fluid in this view, much closer to what I've come to expect from an MX vs ATV game. Looked way better and played better as you feel the bike more as you actually have a feel for the front of the bike. 3rd person by comparison feels very, VERY stiff and static.          YouTube™ Video:  Mx vs atv supercross Seattle practice laps&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "i would like to say that this is one of the best MX VS ATV game i have played i do have to say that its my first one i have ever played on PC but still it has alot to offer    ",
            "review_score": "1"
        },
        {
            "review_text": "ALOT of people will probably disagree, but I think this game is better than Reflex. There, I said it.  There are two major things about this game that annoy me.  The first is obvious; the framerate issues. From the poor console port of Reflex from 7 years ago, until now, these games have had poor framerate issues (and graphical issues on Reflex for some cards including mine). Whenever you're by yourself on a supercross track, the framerate is almost always above 60fps on newer hardware. Anywhere else (nationals, free ride, rhythm racing), it drops considerably. The developers have said that this is due to the trees, and the lag everywhere else is due to the dirt physics and terrain deformation. I kinda halfway believe that this is the case, but whatever.  The second is the clutch kick. It is WAY too strong. Yes, it gets you out of terrible situations whenever you don't hit a rhythm perfectly, but in no way should it be that strong, especially on hard packed dirt. Once they tone that down a bit, I'd say this game is pretty spot on with its physics.  Also, the track scaling is pretty big compared to real life like it has been for previous games (except Alive, which was rebranded to this. The smaller tracks in Alive had perfect scaling IMO), but I remember seeing an interview where a developer explained that this is because they want the game to have the pick-up-and-play aspect and that the game isn't too hard. Eh, I can live with that.  If the problems can be fixed in a timely manner, this game gets a solid 8.5/10 from me. If not, it's staying at a 6/10. I can still recommend this game based on its potential and current playability.",
            "review_score": "1"
        },
        {
            "review_text": "Update changed everything, no regrets for buying this for sure rite now :) !",
            "review_score": "1"
        },
        {
            "review_text": "After the last patch, this game has improved significantly. The textures and environment look crisp and the game runs fairly well. There are still some optimizations issues that need to be worked on, so for those of you who are considering buying this game, YOU HAVE BEEN WARNED.  ",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome but for some reason wehn i play i get into lap 4 or 3 and it just goes into my home screen i dont know why",
            "review_score": "1"
        },
        {
            "review_text": "GREAT GAME!!!!!! LOVE IT  ",
            "review_score": "1"
        },
        {
            "review_text": "awesome i can play whit my xbox controller ",
            "review_score": "1"
        },
        {
            "review_text": "adhd approved",
            "review_score": "1"
        },
        {
            "review_text": "The game looks nothing like the quality of the images on the store page. Very blurry on a high end PC that I own. After being a huge fan of REFLEX, I was looking forward to this game. early access was pretty poor but that was then, Loaded the game up as of recent as I been playing REFLEX again, this game is still as poor as it was in early access.  If you enjoyed REFLEX, you wouldnt like this title, even ALIVE I would say is a better play than this.",
            "review_score": "-1"
        },
        {
            "review_text": "well i have played this and mxvs atv reflex and reflex is still better in my opinion.  cant play game on high even with a 8 core 4.0 processor a gtx 760 graphics card so horrible optimization and every time i try to preload before a jump it trys to wip me and i dont wanna wip. so nordic horrible release",
            "review_score": "-1"
        },
        {
            "review_text": "The worst performing PC game i have played in years.  Just bought the game and wish i hadn't. Honestly what the hell is going on with this game?. Its hardly a looker in the first place but i'm getting as little as single digits in some of the outside tracks, The indoor tracks run anywhere from 40-80fps. It almost seems like the engine is broken and won't use more than 50% of your gpu and cpu because Afterburner shows that my gpu never goes about 50% and my cpu cores are in the 40-55% range at all times.  My Specs -  Q9650 Quad @ 4.0ghz 8GB Ram Overclocked GTX970  Oh and before someone says 'thats an old cpu, maybe its bottlenecking your gpu', i can get 99% gpu usage on almost every game i play, including maxing out games like Witcher 3 (minus hairworks) at 60fps, Battlefront max at 60fps etc.  In fact i have not played a game, since i got my 970, that i couldn't max or close to max at 60fps. Not this game though lol.  It made me think that maybe my game didn't update because i read about performence updates that had been released, but Steam is set to 'always keep this game up to date', so god knows how the game used to run before these updates!!!.  I'd get an refund if i could but i bought the game off Bundle Stars and i'm not sure if you can refund with them sigh.  Honestly devs, i know its not an easy job but f''k me, this game is a joke.",
            "review_score": "-1"
        },
        {
            "review_text": "As most have stated this is a downgrade if you have played alive, reflex. I would even recommend MXGP2 or MXGP vs ATV Supercorss Encore. Game looks like crap on a GTX980 @ 1440p, unrealistic characteristics. 0/10 This game seemed like it would have been great and waiting for the next MX vs ATV game, and it's a total disappointment. I bought into this game during beta/early access and reviewed it then as a DO NOT BUY and things have not changed DO NOT BUY",
            "review_score": "-1"
        },
        {
            "review_text": "I own 216 games on PC, this is the only game I have gone out of my way to ask for a refund. This game series has not progressed at all since the last two installments. Animations are terrible. People only buy this game because MX and ATV game choices are limited. Buy at your own risk. Also, I bought this game when it was 75% off. Meaning it is so bad I did not feel it was worth $8, let alone $30.",
            "review_score": "-1"
        },
        {
            "review_text": "I've been a big fan of the MX vs ATV series since I was a child but this is just an all round dissappointment, not at the gameplay but at the fact the game is one of the poorest performing PC games I've seen in a while. Along the line they released several 'optimisation updates' which were meant to improve FPS but the reality is it did nothing for me and many other users. even though Nordic still know this is a problem, they have released £78.54 worth of DLC. It's annoying because on consoles this is a fantastic game but the PC support is appauling.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a real joke !!!   Mx vs Atv Reflex has more realistic graphics and physics and it's 7 years older than this ♥♥♥♥ !!!   Nordic Game what the ♥♥♥♥ is this game ? Are you serious ? You have the better license of Mx game and you do this ! I think and hope it's a ♥♥♥♥ing joke.",
            "review_score": "-1"
        },
        {
            "review_text": "this game dont even work. running i5 4670k, 4gb 760 gtx windows 7 64 bit and msi z87 g45 board with 8gb ddr3 ram lol. wont even get a black screen. just says running and then syncing and back to nothing. only got it to work with a cracked copy of the game and ran sucky so tried updating the game. now wont work again..... DO NOT BUY!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Literally ♥♥♥♥ing ♥♥♥♥ console port with ♥♥♥♥ load of dlc.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME  it is a horrible follow up to reflex. it ditched relfex's physics and controls. you cant whip and 450's cant even make a tripple. yes there are more tracks but they all look hideous and the graphics are on par with games released a decade ago.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is meh. Then they pulled this nonsense with the DLC with what most consider a meh (or worse) game. There are many better alternative options for this type of game. Go with one of those. I'd recommend this game when the game and complete DLC is under $10.   *We are really reaching DLC mania overload. Soon, if you want to launch your game, you will need to purchase separately the 'Launch DLC'.",
            "review_score": "-1"
        },
        {
            "review_text": "Dont buy this game!!! Worst graphics ever... very limited configuration, no oem bikes, you need to pay extra!! I'm running it on a i7 with a Nvidia Geforce GTX 860 with 16gb in RAM and still sucks!!! If they give me 5 bucks but I'll erase it. As a RL Motocross racer this game has nothing to do with reality. Worthless... this looks like a scam. Steam shouldn't accept this kind of games. It's an insult to the gamer community.",
            "review_score": "-1"
        },
        {
            "review_text": "Had I know it only works with xbox controllers I never would have bought it.",
            "review_score": "-1"
        }
    ]
}