{
    "app_id": 282100,
    "name": "Fearless Fantasy",
    "release_date": "2014-05-15",
    "developer": [
        "Enter Skies"
    ],
    "publisher": [
        "tinyBuild"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Action"
    ],
    "achievements": 24,
    "positive_ratings": 388,
    "negative_ratings": 100,
    "price": 4.99,
    "description": "As Leon, the world’s most dangerous bounty hunter, you embark on a mission to slay the world’s weirdest creatures, and save a girl from an awful marriage.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/282100/header.jpg?t=1447360544",
    "minimum_requirements": "OS: Windows XP and up Processor: 1Ghz and up Memory: 1024 MB RAM Graphics: A toaster Storage: 200 MB available space Sound Card: An average one Additional Notes: Not suitable for trackpads or trackballs. The game might run slow in power saver mode on laptops, be sure to disable visual effects if you experience that.",
    "recommended_requirements": "OS: Windows 7 and up Processor: 2x 1Ghz and up Graphics: A shiny toaster Sound Card: A good one Additional Notes: A good mouse is recommended. Touch screens are also supported and provide the best experience.",
    "reviews": [
        {
            "review_text": "Do not come into this game expecting the next final fantasy and you will be okay. It is more or less a straight grind of challenges of enemies. The battle system is fun and different, the characters are entertaining and the voice acting is adequate enough for the game. Its not the next big RPG but it is entertaining and fun",
            "review_score": "1"
        },
        {
            "review_text": " Fearless Fantasy  does well at what it sets out to do, offering a weird but likable aesthetic backed by a whimsical premise and quirky cast of characters. The streamlined design works to its advantage with a hands-on battle system that does a nice job of getting the player more involved. While the software itself is soundly designed, however, the omission of touchscreen technology support is quite glaring and would have enhanced the game’s tightly focused battle engine. The use of mouse, while functional and serviceable, takes away from the true potential of the gesture-heavy gameplay. As it stands now, though, Fearless Fantasy is still a nicely streamlined role playing battle marathon.  Look to the 'Troll' move, which attracts the enemies' attention by performing signature dance moves from Gangnam Style.",
            "review_score": "1"
        },
        {
            "review_text": "The combat in this game is built for touch devices - something that makes gameplay on a desktop much less fun.  All other things considered, this is a great, albeit short game - grab it during a Steam sale!   Pros: Art style Music Light-hearted satire Easy to play  Cons:  Combat controls",
            "review_score": "1"
        },
        {
            "review_text": "Unplayable with a mouse. Weird voice acting, and mechanics.",
            "review_score": "-1"
        },
        {
            "review_text": "What a great surprise. This turn based jrpg rhythm game (sort of) is a whole lot of fun. It's challenging and not soul breaking. It handles humor well and the story is good. The artwork and the overall look of the game is the star though. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "One of the more interesting mechanics I have played in a long while, Fearless Fantasy is, if anything, unique.  The main mechanic is through the movement of the mouse, in the way you would expect to swipe your finger in a mobile game. The story is not something that you necessarily play this game for, and it feels as though this game is was never meant for PC. It feels like this game was always meant for mobile, and that it was a last second change over to Steam. This game could even very well be for mobile (I haven't researched it), and if it is, I'm sure it is a great mobile experince. The experience on PC is actually quite good for it as well, if a little odd. The enemies are easily the oddest part of the game, with enemies I cannot even begin to describe because they are entirely unique to this game.  This game is solid, if bizarre. Given a bit more marketing, this could easily gain a cult following for being something you will never play anything like again  8/10",
            "review_score": "1"
        },
        {
            "review_text": "v2.0 (see v1.0 below ) Pros Improved up on a lot of things  The menus of the game look a lot nicer then the previous version  Story is basically the same  The battle system greatly improved. the timing was responsive and it was easier to controll  Voice acting is nothing special to be honest though the sounds when using an item in battle are a bit annoying  cons  He took away the difference between the weapons when buying them. Though i remember reading something about the dev saying he is improving the way it was so it wil probebly be back in the next update   v1.0  Pros  Had stats differeance between weapons (developers says) hes working on improving what it was)  a small short story that simple yet entertaining. Game is challenging yet fun and that is hard to do  cons  Jimmery biscuts (you hear this a lot) :P  Animation was barly viewable though it was good it just seemed like it could be a lot better  Timing of the actions where sometimes off and sometimes did not respond at all to what i was doing.    all in all worth the money 8/10",
            "review_score": "1"
        },
        {
            "review_text": "At first I was too sceptic about this game because of the images on Steam store and because the game was bundled already. But then I've bought it and played it. What can I say... So  much FUN ! Thought it would be your regular turn-based RPG like those made with RPG Maker combat system. I was so wrong. The combat mechanics are innovative and make Fearless Fantasy really addictive. I liked that when you level up a skill a new attack option appears in it's combo. You should try it to understand. The art is weird and trippy, the sound and the music are made greatly. The baddies, like those shrooms on screenshots look adorable, but when they attack it seems kinda disturbing. Really good game in it's unique mix of genres.",
            "review_score": "1"
        },
        {
            "review_text": "First let's get this out of the way. No, you don't need a touch capable screen to play the game at all. However, having said that, having a touch capable screen will definitely make doing the combos and input sequences much easier than a mouse because of how visual and directional they are. Using your finger to literally trace the directions exactly as they are as opposed to using your mouse to guess and estimate with your entire hand can have a great change in you performing ok and performing amazing.  With that out of the way, the story is both humorous and entertaining and certainly not completely implaussible as far as actual rpg storylines go. I really wish they had added a sort of training mode where you could practice some of the sequences as some of them do appear quite quickly in veteran and give you only a short window of time for inputs. I think potential alternate input methods such as keyboard inputs could be a potential option or setting that could be alternated to.  Overall though for the price I think I got my good share of fun and entertainment and would certainly be interested and look forward to more releases like this one.",
            "review_score": "1"
        },
        {
            "review_text": "its turn based like an old jrpg but a mobile game. wasnt designed with a mouse in mind i dont think. it works ok though. its pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game, with unique gameplay. It's hard to describe what other games it is similar to. It's a turn-based RPG, but you have to use timing and mouse movements to get the most out of your attacks (which reminds me a bit of the Penny Arcade games). Your skill/armor upgrades are somewhat basic. There's no exploration, you just follow a path set for you. I actually think it would be more fun with a touch screen than a mouse.",
            "review_score": "1"
        },
        {
            "review_text": "Soundtrack=Worth",
            "review_score": "1"
        },
        {
            "review_text": "As fun as it looks but a little slower",
            "review_score": "1"
        },
        {
            "review_text": "I played this game from start to finish in an afternoon. The story has about 13 chapters/levels. This doesn't mean the game is bad however!  Funny Characters, nice cutscenes, engaging (but annoying if you aren't nimble with a mouse/using a touchscreen pc) battle mechanics. I played on the normal difficulty and can't wait to run through again trying to get the ultimate iron man achievement.",
            "review_score": "1"
        },
        {
            "review_text": "Looks like Sonny in some ways, but the game is just as great as it has some major improvements. The game asks for some skills with the mouse and is simple enough to be greatly enjoyable ! It may lacks a superior difficulty level but it is good as it is.",
            "review_score": "1"
        },
        {
            "review_text": "There is no reason this touchpad designed game belongs on steam. This is a mobile app that required finger swipes on a touch screen and is awful to play with a mouse.   Shame on the developers for dropping this obvious mobile shovelware on steam.",
            "review_score": "-1"
        },
        {
            "review_text": "What a ♥♥♥♥♥♥♥t. Looks like a crappy mobile game. Also, I spend more than 15 ♥♥♥♥ing hours to take all trading cards. Huge minus.",
            "review_score": "-1"
        },
        {
            "review_text": "Weird af tablet ios port.",
            "review_score": "-1"
        },
        {
            "review_text": "Very funny story, and an interesting approach to combat.",
            "review_score": "1"
        },
        {
            "review_text": "This game is as mediocre as a RPG can get. Throw-away story, flawed leveling up system, amaturish artwork, non-existant character development, mundane battles, uncreative items, cheesy voice acting and worst of all, ridiculously short playthrough. It only took me 2 hours to complete the whole game. Thank God I got this game for free because there's no way I'm paying full price for this game.  It's a good time waster, I'll give the game that but unless you have a crap tonne of money in your wallet, don't waste it on this game. Buy something else more worthwhile. Giving this game a thumbs up simply because it successfully made me pass the time.",
            "review_score": "1"
        },
        {
            "review_text": "this very F*CKING f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking f*cking crezy game //// pls call 911 ..... 215 out of 10 coc*s",
            "review_score": "1"
        },
        {
            "review_text": "At first glance it may not look like much. Friend of mine made this game and im a sucker for RPG type games and turn based combat systems. Purely the fact of the arrow battle system makes this game way more for a touch screen type of gameplay. Playing with a mouse you gotta keep on your toes. Getting in that force of habit with usual turn based games, you do your stuff and kinda space off, gets me EVERY TIME. If you play games like this regularly or know ways to take advantage of beta games and such being a tester myself as well it's not TOO difficult. If you want a hands on rush I suggest diving in to the deep end, 3 star battles all the way. No little girl starting stuff :p.  To my anon. friend, gratz on the release hope people love it like I do &lt;3.",
            "review_score": "1"
        },
        {
            "review_text": "Fearless Fantasy might be the weirdest rpg you might have encounter so far, but it's definetly worth it. Your Leon a bounty hunter with a gunblade (tell me that doesn't ring a bell) rescuing a princess by the name of Amelia from an arranged marriage, now on a quest to stop the evil king's plan. The combat system is quite simple you fight wave after wave of enemies, when you attack or use a skill you're required to move your mouse cursor through some arrows, the better you at that the more damage you inflict, there's a total of 13 levels so the game can be beaten in an hour or less. But you can replay them again on veteran difficulty for a harder challenge. The game got a lot of comedic moments between the characters, and there's also some funny monsters to be found, also your taunt is gangnam style dance, how can you not like that?. The game lags a bit every now and then due to poor optimization but nothing game breaking. At 7$ this is a must buy for a rpg fan, if you're not that much into rpgs then wait for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "I think Fearless Fantasy is a great game, and I'm going to tell you why. But always remember: This is my point of view, and only my opinion.  On first glance, Fearless Fantasy looks realy strange. Some screenshots may even look poorly made, and unfinished. You aren't realy sure what type of game it will be. I was first sceptic, about how the game will be and if would have been worth the money. I started playing and soon played an hour.  The game starts with a nice little video sequence to get the story starting. Then you find yourself fighting against a few dudes. After this you learn your second Character and the Story gets started.  The game itself has a nice amount of levels. You get 39 Levels. That doesn't sound very much at first, but a level can be realy long. As you fight your first enemies, you will soon see the unique fighting style. Everything you do requires precision. I only played on Casual mode, to get to learn the game, but the game is realy challenging. The further you go, the harder the enemies become, and you need more tactics. It's basicaly a usual turn-based game with a interesting way of declaring attacks and casting speciall attacks. The better you get and the better you precision gets, the harder you hit. The Game is quite fun to play, and challenging for a casual gamer.  The story is realy okay, and it progresses quite fast, as the game goes on. The story is simple but still good, and the characters are realy funny. The dialogues are also pretty funny to listen to.  The Price of the game isn't high so it was totaly worth the buy.  This is my review of Fearless Fantasy. To make it short: Good Gameplay, Funny Characters and interesting Story. I would recommend a buy, for the little money it costs.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for a casual, fun, not too hard but still challenging RPG, this should be your choice. Totally original character design (enemies), very nice drawing-animation, great sense of humour, gesture based fights. Best played on a tablet. I really want to keep you away from this game. Not! :D",
            "review_score": "1"
        },
        {
            "review_text": "finished the game on 100% achievements.... the artwork quite cool... if only i have touch screen monitor... it will be much much easier.",
            "review_score": "1"
        },
        {
            "review_text": "good game, good story, too short btw -_-",
            "review_score": "1"
        },
        {
            "review_text": "consider this: this game have only an interesting and innovative battle system and a colourful and peculiar graphic style. I'm not saying those are the only good things: I'm honestly pointing at the fact that there in nothing more in the whole game.  But....but aspects are amazing, so if you want a 10-hours challenge based on tactics and precision, this is a great game.  If you are searching a game with amazing CGI-video and a deep story, this game is not for you.   And...the soundtrack is absolutely amazing!",
            "review_score": "1"
        },
        {
            "review_text": "This game deserves a lot more attention. Nevermind the gameplay looks like it was designed for phone. I played the phone version too, and it's as playable as pc version. A like playing it on pc even a bit more.  Pros: - nice visual - glorious bizarre monsters - original gameplay - great music - lot of fun and jokes  Cons: - absolutelly nothing - I want Fearless Fantasy 2",
            "review_score": "1"
        },
        {
            "review_text": "  Honestly, it isn't too bad. I wouldn't say it's amazing, or hilarious however it's definitely one of the more unique games i've played.   Pros and stuff: It's unique. Using the mouse to go through all these gates (or whatever you call them) is a pretty different idea of attacking. There are some radged enemies m8. Good voice acting. A splosh of humor. Level up system, granting skill points. Shop to buy dank armour and weapons. Coolio. Different difficulties.  Cons and stuff: It's quite difficult at first, to get the hang of the gates. Characters can only wear one piece of armour. Limited skills. Can get repetitive. It's a rather short (2 hours to complete game on casual) game.  Overall, it's a good game. You either love it or hate it.",
            "review_score": "1"
        }
    ]
}