{
    "app_id": 282560,
    "name": "RollerCoaster Tycoon World™",
    "release_date": "2016-11-16",
    "developer": [
        "Nvizzio Creations"
    ],
    "publisher": [
        "Atari",
        "RCTO Productions"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Workshop",
        "Steam Cloud"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Building",
        "Management"
    ],
    "achievements": 30,
    "positive_ratings": 1182,
    "negative_ratings": 3585,
    "price": 10.99,
    "description": "RollerCoaster Tycoon World™ is the newest installment in the legendary RCT franchise. This next-generation theme park simulation and building game includes fan-favorite features along with incredible new advancements!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/282560/header.jpg?t=1480604211",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 (64-bit) Processor: Intel 2.3 Ghz Core i5 or AMD equivalent Memory: 4 GB RAM Graphics: GeForce GTX 460 or AMD equivalent DirectX: Version 11 Storage: 10 GB available space Additional Notes: Subject to Change",
    "recommended_requirements": "Requires a 64-bit processor and operating system",
    "reviews": [
        {
            "review_text": "So I got the Beta test and, well it was a Beta test, there were some bugs but all in all I think the game has a pretty solid base. The new Coaster builder is a little confusing at first but once I got the hang of it I had a lot of fun.  To those who are demanding refunds, at least give it a chance and wait until release before wanting your money back. They released this beta test for a reason, to find bugs in what is likely the buggiest part of the game, so at least have the faith to give them until release to judge it.",
            "review_score": "1"
        },
        {
            "review_text": "I took a second glance at the game. Not as bad as I first thought, fun actually. After getting used to the spline editor, the game became much more fun. I would recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Beta Week One: Seems Like What Ive Been Waiting For, Now If The Make The Lod Distance Work, and Less Taxing On Your System. Might Be Like The Good Old Times ------------------------------------ Update 31.3.16 -------------------------------------- I think the game still needs a lot of work, but i wouldn't write it off",
            "review_score": "1"
        },
        {
            "review_text": "GREAT POSSIBILITIES  That being said, it is currently unplayable in its current state. Beta or not, there are no options to adjust graphics for performace issues, the coaster builder is an amazing idea, but its just wierd and difficult to use.",
            "review_score": "1"
        },
        {
            "review_text": "I like the Coaster Builder needs tuning. It needs a fixed grid opiton for building paths, Buildings, and Track. Im praying Atari fixs all the bugs by Dec 10th. They might need to push closer to X-mas.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent so far, just need to iron out some bugs. Very powerful coaster designer.",
            "review_score": "1"
        },
        {
            "review_text": "It's a decent game but it no where near matchs the same amazing game that was RTC3",
            "review_score": "1"
        },
        {
            "review_text": "This review here currently is based completely on Beta 1, I have a video too if you wish to see more in-depth and footage to back it up. So basic rides and normal buildings are turned off for this, paths, decorations and the main meat of the game, coasters are there. Now I have to say the coaster editor is HUGE, you can change the track styles, the type of rollercoaster, the pitch, turn, edge and speed of your tracks. Have a massive drop and then make sure you can fix it at the end or bye bye humans. Its fantastic the amount of sheer detail to a tiny little detail can do. Paint it whatever colour you want, have multiple carts and more!   I had a blast and its great to see RollerCoaster Tycoon return and with a bigger editor than ever!   The vide link can be found here -         YouTube™ Video:  Smash Look! - RollerCoaster Tycoon World Beta 1 Gameplay&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Ever since this game came out many years ago, with the three add-ons, I have enjoyed playing the game. This new version is a bit different from the first. The peeps all walk down the middle of any path in this new one, before they walked random as people do. I still have the refresh problem as I do from the first RCT game. I have updated my computers memory to it's full and still have this jerking, the more I add to my parks the slower it becomes and jerks. To compair this to the new Planet Coaster, I like this the best. By the way, the old RCT you could change the music at each ride, this one you can not, nor on Planet Coaster. These are some bugs that should be taken care of so the game is more enjoyible.",
            "review_score": "1"
        },
        {
            "review_text": "The new update of this game now it better than the old look.   Good thing that it won't slow down fps and crash.  Story mode is way cool and so many unlock items in this game.   Not to say this, But I'll enjoy RCT World until I get a new PC to play Planet Coaster due to the Running then end up saying Syncing and go off.  Now it become a good Atari Game.  ",
            "review_score": "1"
        },
        {
            "review_text": "Well after 19 hours played and having played Planet coaster as well I would have to rate this game slightly better. Theres more content to the game. Does this game have some bugs? Yes, it does with loading screens, but a simple close and reload fixed that. I enjoy all of the extra content this game has compared to Planet Coaster. It has more meaning and shadows as well. Planet Coaster has more 'Objects' but most of those objects are just for show and have no effect in game.I do want to add also that the tutorial for this game is also fun and not one of your typical tutorials. I would rate this game a high 3 low 4 right now with planet coaster a 3.5/5. Either way both games you get will have that great Theme Park/Coaster Simulator.",
            "review_score": "1"
        },
        {
            "review_text": "Finally worked!",
            "review_score": "1"
        },
        {
            "review_text": "This is my first review I feel so strong about this I felt I had to say this STAY AWAY FROM TRHIS GAME!!!   -The only way to be creative is to use third party 3D modeling softwear -The level of detail is the same as a $10 game made in 2005 yet they ask $35 in 2016 for it -They rushed out of early access to beat another roller coaster game coming out less then one day after this one ",
            "review_score": "-1"
        },
        {
            "review_text": "Like many others that have played the Roller Coaster Tycoon series I was super excited when this game was announced and that excitement continued, up until I was first able to play the Early Access version. I was not impressed then, and i'm still not impressed today after converting to the full version of the game. Had I known then what I know now, I would have saved my money and bypassed this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Release Review 11/18/16: Game blacks screen while starting, I know this going to happen and decides that Planet Coaster and Parkitect is the best games beside this pile of crap. Atari hired the wrong guys to do this game and ruined a game series that almost runs through two decades and people love. Once again, DON'T BUY THIS GAME and go and buy yourself Planet Coaster made by Frontier or if you have a machine that can't handle it then go Parkitect which is made by a small group of indie devs. Remember that you can also buy RCT2 on Steam and install OpenRCT2. NOT WORTH THE $35!  Review Update (4/2/2016): So I have played the game again when it came out as early access and they added flat rides into the game but it doesn't meet any of my expectations. The coaster builder is laggy and physics are so horrible. The game crashed on me when I have my park while in load of 1,950 guests which is total disapointment, I had that problem on RCT 3 most of the times on my older machines. I run a PC with a GTX 760 2GB VRAM, 16GB of RAM, and an 2nd Gen Intel Xeon and it would lag like crap while building a coaster.   October Beta Weekend 1 Review (11/2/2015): This is probalay the worst game that you would buy for $50. I feel like they are rushing to push this game out and they have over a month left to complete and polish it so it looks like $50 but not this piece of unstable crap. When I test ran my coasters that it will crash on random parts of the track. Yes, this game doesn't have any sense of physics what so ever. When I put tight banking that I get a message 'slope too steep', this is the first RollerCoaster Tycoon games to not introduce grid building. The game will crash and freezes at times and I guess it has something to do with the camera modes.  Well, I can't really expect or recommend this to be good just for the $60 I have spent (I have bought the Deluxe Edition) if there's any improvements. If this game came out this way then I will feel very turned down and regretting myself buying this game that won't work at it's price. If you want a good roller coaster management game then try to get either Parkitect if you like RCT 1 &amp; 2 style or if you have the money then go and get Planet Coaster Early Bird or else wait.   PROS: +No grids unlike the other RCT games. +Different size stalls +Curved Paths +A bit of good lighting  CONS: -Poor phyisics on the guests, coasters, and flat rides. -Coaster builder can be very laggy. -Game will crash if your park is in heavy load or the game won't handle the graphics. -Limited music selection -The lack of objects to build buildings with scenery. -Coasters would fail if not built correctly. -Brakes can have a very strong force into them. -Terrible Graphics and Shadows",
            "review_score": "-1"
        },
        {
            "review_text": "Wont work and no one will return my messages for a refund!",
            "review_score": "-1"
        },
        {
            "review_text": "I thought I'd give it a spin on the release date but it doesn't even start up anymore. I'm officially completely done with RCTW. Such a waste of a nice franchise name, and a big part of my childhood. I'm going back to playing Planet Coaster.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game a year early and wish I would have known about Planet Coaster before then. I have now uninstalled this game and have no intention to ever revisit it. I wish I had never even seen it to begin with. I would rather play RC1/2/3 than this forever beta sim.",
            "review_score": "-1"
        },
        {
            "review_text": "It's terrible. They ruined the franchise. Buy Planet Coaster. Not this.",
            "review_score": "-1"
        },
        {
            "review_text": "I kinda want my money back.... This isn't what I paid for.",
            "review_score": "-1"
        },
        {
            "review_text": "In agreement with the majority..had high hopes, but unfortunately the game didn't deliver. Compared to RCT3...yes, it's an improvement IMO. Compared to PC, ha! Not even in the same ball park. PC blows this out of the water and it's not even released yet.",
            "review_score": "-1"
        },
        {
            "review_text": "Hmmm wanted to like the game - really did - but - as like the others I did get a black screen, but waited a couple minutes and then it took me into the game.   I have to be honest here, I'm not too impress with the graphics. After playing Alpha/Beta on Planet Coaster I got spoiled - RCTW isn't nearly like PC - and RCTW kinda reminds me of a 'Facebook' app game or a table/phone app type of game. Sorry but it's the honest truth. Check out Planet Coaster.",
            "review_score": "-1"
        },
        {
            "review_text": "Please do not support the developers of this game. It is unplayable at release, just as bad as before. If you are interested in games similar to this, go check out Planet Coaster.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is very buggy, laggy and does not run on the specs specified. The graphics are poor for this year we are in. Very gutted about the game as I was really looking forward to it. RCT 3 was much better.",
            "review_score": "-1"
        },
        {
            "review_text": "worst game ever created in the name of rollercoaster (even the ipad game's were better)",
            "review_score": "-1"
        },
        {
            "review_text": "Have you ever heard about one of those botched abortion horror tales where the baby survived, mangled and in pain until it died?  That is RCTW in a nutshell.",
            "review_score": "-1"
        },
        {
            "review_text": "I played every single RCT that came out and I was actually excited for this game. I am sorry to say that it was a huge let down. Yes it is pretty and can be fun for the first hour but after that, it just falls flat... Not enough things in it to keep me busy. I keep hearing good things about PC, so I may go to that one. It just sucks to see this one go down the drain. Maybe, just maybe, the devs will improve this a lot. I will update this if the game changes...   ***UPDATE***  - I will no longer be updating this review about RCTW as I have given in to buying PC and was not let down. I will just say that if you were a fan of RCT1 and 2 then I will have to say that I am very pleased that PC was the exact direction in which the series was supposed to go! I would rate PC 100/10 if I could. You will not be dissapointed. As a matter of fact I would have paid $60 for PC! Happy Tycooning!",
            "review_score": "-1"
        },
        {
            "review_text": "It is sad to say that the day has come that I say no to rollercoaster tycoon game, but alas it is here, though i know they have said that they are working on content.......there arent enough rides, the only thing they have a lot of is, is rollercoasters, and thats becuase you can custom make those. Anything other then that and they fall flat on their faces, i find myself getting bored very quickly becuase im tired of SEEING THE SAME STUPID 15 OTHER RIDES!  there is no varrity and what is ever worse is that they must have known that compation was coming with the other game planet coaster, yet they go and release something like this.  Save your money and go buy planet coaster.",
            "review_score": "-1"
        },
        {
            "review_text": "The development of this game has been a rollercoaster of high intensity and nasuea. Originally intended to be released late 2015, they have switched to releasing it now as early access. For many (including me), the game suffers from performance problems. I do want to see if the game is improving, but I'm still behind a performance wall. Many have given up on this game and looked towards some similar alternatives (like revisiting the older games), but a small sliver of me is still curious about the fate of this game.  When I'm able to play this game to a better extent, I'll re-review it. But for now, don't buy it (especially for such a high price).  Update Nov. 17th: I can't review a game I still can't play. Don't make the mistake I did and avoid buying this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I am quite dissapointed with this product. While the game in itself is great and fun to play, the program is buggy and unstable.  For instance : a save game will not load, causing the game to crash or the game gets stuck on loading screen and entering the game world is impossible. More rencently, the game wont event start as it crashes even before the menus.  I would also like to point out that the music is not impressive, we are a farcry from RCT 3's 'Summer air'.  However, the Coaster editor tools are powerful, intuitive and really fun to use.  This game is so buggy, I will definitely try Planet Coaster to see if the grass is indeed greener on the other side.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this a long time ago with high hopes, and in all honesty it just hasn't done the franchise justice. I kept giving it a chance since it came into Early Access (which was nothing more than a way to cash in during the delayed release.  As a fellow developer I can understand how hard they've worked to live up to the hype in such a short amount of time, the problem is with Atari. I can't help but feel sorry for Nvizzio, but it will no doubt be the developers that take blame.  As with all other reviews, the true follow up to the RCT series comes from the developers of RCT3.  RCTW is Top Gear with Chris Evans, Planet Coaster is The Grand Tour.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like this game, really I did. I've been a fan of the RCT series since the 1st one, and I spent god knows HOW many hours playing RCT3. Rollercoaster Tycoon World was showing some promise when they release the first beta. It had lots of problems, but the devs were SO open to the community's feedback and input. However, I think this project just got too large for them--either that or this game became the perfect example of what happens when you try to please everyone. What's left is a game with far less options for creativity than any previous RCT game. Their coaster creator is promising but suffers from some awkward UI issues. And despite having some nice visual elements (I do like many of the coaster aesthetics), there are many laughable or groan-inducing design elements as well (let's pretend those park guests were never made). While Nvizzio no doubt did their best, this project got the best of them and fell flat on its face.   If you're a fan of the previous RCT games, this one will definitely disappoint you and send you back to the old entries in the series or, more likely, head to that 'other' roller coaster/theme park sim that just came out.",
            "review_score": "-1"
        },
        {
            "review_text": "I had such high hopes for this game, buying it right when it went into early access,, It was a mess back then and now.... It's still a mess. Nothing like the older RollerCoaster Tycoon games. Even with a Nvidia 1070 with 16 gig ram the framerates drop to unplayable.. Horribly optimized and i'm shocked that it's actually been released as a finished game. It's garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "im ♥♥♥♥♥♥ the mac version isnt out i bought this months ago and couldnt play because they still havent released it like they said they would",
            "review_score": "-1"
        },
        {
            "review_text": "This is the same review as i posted on the RCTW forums. So it might not be fitting for a steam review. TL:DR at the end  I want to say at first that i am a HUGE RCT fan.  I played RCT1 when i was like 7 and i loved the francise ever since. Even RCT3 which alot of people dislike i found still amazing.  Now the the World Beta.  The graphics are really good i have to admit. But come on. No graphical options?? Are you serious? Not even sound? I literally threw my headphone off when i launched the game. How can you give us a beta without these small options. I was lucky enough that i could turn off AA and such in Nvidia options. But i still got around 40-50fps with NOTHING in the park. I will post my specs and the end of the thread.  Another thing is the RAM usage. I hope this improves because 5-6gigs of RAM when you only launch a game that is in a beta state is pretty bad.  Now to the game itself.  The scenery is pretty good. Just where are the custom buildings that you make wall by wall? I reckon they will be in the full beta but if they are build the same as fences it will be a living hell to make a decent building. The fences are SO bad to place. You cant make a decent fence unless with the grid. But with the grid you cant place em next to curve pathes. And no end pieces. Your fences end with an open spot.  Pathes are good. Nothing wrong with them. Easy to place easy to use. Though a few options of queue pathes? Must be intentional i guess but still. And no curved queues? Why is that?  All the foliage is really well done. Bit few options on shrubs and flowers but that will probably change on full release with the workshop. Trees are fine in my opinion. More palm trees would be nice though.  All the other path addons are fine. Trash cans, lights etc. They look good, are good to place and nothing wrong with that.  Now to the coasters  First off all, the color options are so low. Where is the create every color palet?? You would expect a game from 2015 to have atleast a color palet that lets you make the colors yourself? (Red, Green, Blue sliders from 0-225 or something) I guess this will be better at release although i dont have my hopes up for that.  Now to the building of the coaster.  Its awfull. Dont get me wrong here. Controls are pretty good. The way you control how you edit the coaster with your mousewheel etc. works good. A few bugs here and there like a coaster has 0degrees roll and is still banked. And a few other small things which i know for sure have been reported already. If not i will report them later in the bug tracker.  The spline based building (without the grid) is not working at all. Atleast not for me. You cannot make a good lifthill without the hill being a little bit off to the left or right. Which is very unrealistic since lift hills are perfectly straight. Then there is the marker under the track that shows how 'Safe' the coaster is. Its not accurate at all. How is a left turn that is banked inwards safer than one banking outwards?? How seriously dont understand how that works. Maybe i am just stupid and dont know at all how coasters work at about 5000+ hours across all the three previous games and after visiting alot of real life coaster. But for me this is wrong.  You added the ability to edit the coaster on the spot itself where there is need of adjustments so you dont have to remove the whole track. It sucks. The moment you add a new edit point (the green bulb) you have it locked to your mouse immedietly. The track instantly goes up or down a little and you have a little bump in it. No matter how i try it keeps happening. I might not be used to it yet but after about a 100 times i think i should've known how if there was a way to do it right.  There is no real way to make a good looping are any other element. Sure you can let someone else make it for you, download it from the workshop and add it in your coaster. But what is the fun in that. I want to make them myself. Its just SO hard to finetune the track pieces because of the issue above (the green bulb issue).  Since when are block brakes wheeles? Seriously guys. Where you drinking to much whisky that evening? You have normal brakes that look like brakes. And block brakes are wheels. Also, the Accelerator Coaster doesnt have a launch track. Only the tiny piece at the start that you cant drag out so why even conisder putting it in the beta? Same for the Dive Coaster, there is no Dive element (the Holding Brake). So why add this one aswell? And where is the normal B&amp;M Sitdown. You add all these unique coaster types (Wing, Accelerator, Dive) But you forget the most basic one. A Hyper Coaster doesn't make inversions. I reckon its not that hard to think about that. And that while you guys even cooperated with Six Flags.  TL:DR  This game needs ALOT of work. And to much to be do-able in 40 days. This game needs so much work it probably needs to around end Q1 2016. Buggy (i know its a beta but to much stuff isnt working correctly), bad coaster builder. The grid system back in RCT1-3 was SO much better. There werent many options to tracks as there are now for sure. But they worked perfectly and were always right. The overall game as it stands now is awfull. As it is now i wish i didnt buy it and instead bought Anno 2205 or Planet Coaster as Anno will never fail and Planet Coaster is cheaper and as far as dev blogs go really promising. I hope you guys (the devs and forum users) understand my frustration about the game in the current manner and hope that my feedback will be taken into consideration because you have atleast one sad costumer as of right now. As i stated earlier i love the RCT francise and was so excited for this game. Its just bad as it is.  Greets,  Azrail",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend passing over this game and instead buying Frontier's Planet Coaster. It's not the game we deserved, but the one we needed. So we'll buy it. Because Frontier can take our sales. Because they're not our hero. Frontier is a silent guardian, a watchful protector. A true sequel.  This game does not live up to the RCT name. It would take at least twice as much development as it currently has to get anywhere close. If you're crazy about theme park simulation games, you might find some enjoyment from it, but let me go over the good and the bad.   PROS:  Not limited to a tile system like the previous titles Coaster builder has piece by piece functionality, although limited   CONS:  No piece by piece structure building like in previous titles No water rides, transport rides etc Coaster builder is extremely challenging to work with  --&gt; It uses your camera's orientation and mouse position to orient new nodes  --&gt; Clicking on a node moves it  --&gt; Often tells you that smoother curves are impossible and forces bad track design  --&gt; View of nodes is obstructed when adjustments are deemed illegal, making it hard to fix  --&gt; No smoothing or straightening track functionality  --&gt; Coasters don't slow down due to friction as much as you would expect  --&gt; Coaster supports are unrealistic and don't reappear if removed  --&gt; Brakes don't work properly, causing coasters to fail  --&gt; Block brakes don't work properly, and multiple trains often cause coasters to stop working  --&gt; Height limit is unrealistically low (80m) Coaster types  --&gt; Missing kiddie coaster, wild mouse, corkscrew coaster, looping coaster  --&gt; Spinning coaster spins irradically, causing high intensity ratings no matter how realistic  --&gt; Launch coaster catapult is too short and launches to height limit (80m) at slowest setting Peeps are not properly implemented  --&gt; An unrealistic number of peeps visit your park (300+ with just a carousel)  --&gt; Zooming out causes peeps to turn into a slideshow  --&gt; Zooming in fully does a weird blur thing (fake DOF?) causing peeps to disappear  --&gt; Peeps puke, pee, and litter an unrealistic amount, making parks look like garbage Paths are difficult to work with and not properly implemented  --&gt; Snaps to nodes at the center of pathways rather than the outside edges  --&gt; Ride queues cannot be curved  --&gt; No stairs  --&gt; Cannot place stalls/rides right next to the path, must create a short path connecting each  --&gt; Elevated pathways often clip through the ground  --&gt; Elevated pathways cannot contain path objects like benches  --&gt; Connecting to other path nodes can be extremely laggy Theming is more limited than previous titles  --&gt; Restricted to generic, western, sci-fi, adventure Staff is poorly implemented  --&gt; No staff zoning  --&gt; Staff ignores buildings, fences, etc, preferring to phase through them like ghosts Deleting is poorly implemented  --&gt; No auto delete for scenery when building coasters/paths  --&gt; Delete tool is extremely laggy when mousing over objects Filling in parks with rides causes FPS tanking (I went from 60 to 14 after building 4 coasters)  tl;dr there are more cons than pros",
            "review_score": "-1"
        },
        {
            "review_text": "Plain awful game. Wasn't anywhere near what I had hoped that it would be. I have been playing this series since its release when I was alot younger and I was hoping for it to revitalize itself through Rollercoaster Tycoon World. Needless to say, it sucks. Take my review's word for it as well as every other person writing a negative review for this game. Stay away, its not worth your time or money. If you're wanting a good theme park game where you can burn hours on end feeling like a kid again, stay away from this one. Check out Planet Coaster or Parkitect first.",
            "review_score": "-1"
        },
        {
            "review_text": "Sorry atari... i dont have the hopes up for this one.  as the other reviewers for this says: it is pretty but it is broken  and i that had so much hope for this game  leave the rollercoaster games to frontier",
            "review_score": "-1"
        },
        {
            "review_text": "Just dont buy it  I paid 15 dollars for it and it wasn't even worth that  Pros: Cool coaster builder  Cons: Everything else, notably  Deleting things -still has to be done on an individual basis, trees and shrubs override rides and coasters  Framerate: Was decent on my 280x at start of early access, at release it is unplayable at times at the lowest settings  Campaign: 'Place flat ride (Type: Merry go round)' - Most boring campaign I have ever played, no depth or challenge  the game is ♥♥♥♥  My pc's specs are AMD fx-8350 12gb 1866 cl9 Ram r9 280x 850 evo ssd",
            "review_score": "-1"
        },
        {
            "review_text": "As someone who played RCT 1, 2 and 3 multiple times I was very excited. In the current state the graphics are not that great compared to RCT 3.  The coaster design tool is not properly streamlined and thus makes it very difficult to build a roller coaster. I understand that this is a Beta version, but the could have atleast made this part a bit better,  I feel like they tried and make it more like Themepark Studios and failed!!! It does not feel like an RCT experience at all.  Eventhough its advertised as a Beta, it felt and seemed more like an Alpha version and as such has a loooong way to go before it can be released.  The best part about this Beta is that Steam refunded me the price :D",
            "review_score": "-1"
        },
        {
            "review_text": "too bad i can't refund",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely horrible! Many bugs, no signs that devs are going to fix anything, some bugs break the game. You lost your touch devs, for shame, im going to go play planet coaster now, now THAT was worth my money. P.S, i want a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "WOW THIS GAME IS REALLY POOR, EVEN IN BETA THERE IS SO MUCH WORK TO BE DONE.",
            "review_score": "-1"
        },
        {
            "review_text": "Well what to say? I Know this is just a beta. Builing a rollercoaster is advertised as being simple and easy, i promise you it is not and it is really complicated. it must have taken me 10 minutes to figure out how to add more to the track and then how to change the height of the coaster. if you deleate a track then it just joins on and then you cannot edit that part of the track.  My first thoughts on this game is that it is awful if this is how they plan on making us build coasters there in for trouble: Too many buttons doing different things. Nothing is simple. Nothing is obviouse on what to do. The controls feel sloppy. Basically i just gave up and left it.",
            "review_score": "-1"
        },
        {
            "review_text": "OK, background first: I loved RCT2, played it tons and just wanted a newer up to date version on that.   The beta is not this!  There are 2 main issues that probably won't be resolved because I disagree fundamentally with what they have done.  1. The Artwork resembles any bland MAC application with some grey boring icons and grey paths, grey coasters, low colour vibrancy where there is colour. It's like they looked at RCT2 and thought 'No, we dont like colours. We like grey and black and white. Borders? No, we don't like borders, we like MINIMAL feel'. End result: the game has no soul, no feeling of Theme Parks, you are like an engineer or town planner, NOT MR Eccentric Tycoon with a funny moustache and wacky clothing! And the game is called TYCOON, you would think the devs would know this, but apparently smart people can be stupid!!!!!  2. The coaster building is slow and fiddly. There's a number of reasons for this, but it's never going to be fixed as there's no QUICK way to build coasters like in RCT2. You have to do tests and after waiting 3-4 mins for the carriages to get to the corner in question, only then do you find out if it works or not. Then you spend the next 5-10 mins trying to minimise the g-force (which is the usual issue), but you have no idea if you have done enough until you do a test! This feels like a 'Pro Mode', or Kerbal Space Program, with realistic physics, and no way for you to easily tell if your track is ok. And I'm no idiot, I built 3 coasters today and first one only took 15-20 mins, but it was just stupid the effort I had to put in!!  No-one should fork over money for this if they liked RCT2. I loved that game, so the choice is yours. If you want a bland simulator then buy this game, if you want a game that is, you know, FUN, then play something else.",
            "review_score": "-1"
        },
        {
            "review_text": "its mostly a yes and no recommend the no part is : there is no graphic settings so it automaticlys puts you on max or high settings idk and the coaster making is hard tbh but i got hang of it sort of now the yes part is : even tho its beta it good so far and i like the new coaster station design buildings and how the coaster works and to the developers on next beta weekend in november you should make graphic settings available",
            "review_score": "-1"
        },
        {
            "review_text": "planet coaster!!",
            "review_score": "-1"
        },
        {
            "review_text": "Highly do not recommend this game.  you can't build anything with spline track building. you cannot do peice by peice anymore. Atari should have stuck with frontier and keeping to the same based system they used for RCT3.  R.I.P RCT.  all i have to say. Roller coasters have Brakes, and block brakes and lim launches and chain lifts etc, but since when does block brakes look like Transport tires that go through the track that also stay static?  the building of coasters need to have Piece-by-Piece. because within the length of the peice you've placed how are you supposed to change a little bit of track if you've removed the entire peice by peice.  my eyes will now stay on RCT3. this is no dig at the developers, but we all know that mattlab has a great interest with theme parks and the rct franchise, but since roller coaster tycoon world. its gone down hill. you are missing all of the theme park and roller coaster aspects.   RCTW is done hill from here. i'm sticking with RCT3, NoLimits, NoLimits2, Planet Coaster.",
            "review_score": "-1"
        }
    ]
}