{
    "app_id": 282660,
    "name": "Easy™ eSports",
    "release_date": "2015-09-10",
    "developer": [
        "EasyAntiCheat Ltd"
    ],
    "publisher": [
        "EasyAntiCheat Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Cross-Platform Multiplayer"
    ],
    "genres": [
        "Utilities"
    ],
    "tags": [
        "Utilities",
        "Free to Play"
    ],
    "achievements": 0,
    "positive_ratings": 1996,
    "negative_ratings": 875,
    "price": 0.0,
    "description": "Keeping games fun! Play fair with the leading third-party anti-cheat client for Counter-Strike, used in competitive leagues and tournaments. The Easy™ eSports client is required for joining those game servers.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/282660/header.jpg?t=1553783989",
    "minimum_requirements": "OS: Windows XP SP3 Processor: 500 MHz Memory: 96 MB RAM Graphics: 16 MB",
    "recommended_requirements": "OS: Windows 10 Processor: 1.2 GHz Memory: 512 MB RAM Graphics: 32 MB",
    "reviews": [
        {
            "review_text": " BY USING THIS SOFTWARE YOU AGREE TO THE FOLLOWING TERMS: 1. EasyAntiCheat is not compatible with other anti-cheat programs, therefore you must not run EasyAntiCheat if you wish to play with any other anti-cheat at the same time. The user is fully responsible in case his/her game account or cdkey gets banned or refused by the game, EasyAntiCheat or any other anti-cheat.  3.  EasyAntiCheat will take screenshots of your game screen  [eac.krond.org]  and  upload them on public servers, viewable to everyone  [eac.krond.org] . The author of this software and EasyAntiCheat Solutions takes no responsibility of screenshots captured outside the game screen. If any personal or harmful information is captured into a screenshot, the user is fully responsible of the happened incident and any consequences it may result in. (In case this happens to you, please inform your server provider to remove unwanted screenshots from the server.)  5. This software is distributed 'as is' without any warranties whether expressed or implied. The creator of this software and EasyAntiCheat Solutions take no responsibility for possible damages or consequences caused by the use of this software. The user is fully responsible using this software in any way. no thanks",
            "review_score": "-1"
        },
        {
            "review_text": "EAC is a reputable anti-cheat and works with Krond Solutions. They are monitoring and saving chat messages permanently(!). They can spot players that use multiple player names. They are making screenshots every ~5 minutes, saving your location and much more. Read clearly their terms of service and agreement before you use it.",
            "review_score": "-1"
        },
        {
            "review_text": "The biggest bs on earth . Does not even do anything, just plain stupid.",
            "review_score": "-1"
        },
        {
            "review_text": "stupid ♥♥♥♥ is always unconnected and unavalible. never works ",
            "review_score": "-1"
        },
        {
            "review_text": "Currently easiest 'anti cheat' to bypass.",
            "review_score": "-1"
        },
        {
            "review_text": "useless, cheating even with EAC",
            "review_score": "1"
        },
        {
            "review_text": "Cancer for cancerous game.",
            "review_score": "-1"
        },
        {
            "review_text": "Won't work, so bad",
            "review_score": "-1"
        },
        {
            "review_text": "I cant even turn it off. Even closed steam and turn it on againg and it is still on.",
            "review_score": "-1"
        },
        {
            "review_text": "Makes sense, I still think C.U.N.T.S are cheating though...",
            "review_score": "1"
        },
        {
            "review_text": "(○̮̮̃•̃)",
            "review_score": "1"
        },
        {
            "review_text": "This program is perfectly useless ...  It does not work for anything ^^",
            "review_score": "-1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "stupid thing..",
            "review_score": "-1"
        },
        {
            "review_text": "This is a good tool to use but has its ups and downs but still very good.",
            "review_score": "1"
        },
        {
            "review_text": "the best antichet ever",
            "review_score": "1"
        },
        {
            "review_text": "'It's so easy, even kids can do it!'",
            "review_score": "1"
        },
        {
            "review_text": "Really good software to catch any suspicious attitude in Counter Strike: Global Offensive. ",
            "review_score": "1"
        },
        {
            "review_text": "I Personally Made This Program So That Sixx Doesnt Get Detected",
            "review_score": "1"
        },
        {
            "review_text": "Florin Salam is Power!",
            "review_score": "1"
        },
        {
            "review_text": "Nice for Counter-Strike: Source. 9/10!",
            "review_score": "1"
        },
        {
            "review_text": "good anti cheat",
            "review_score": "1"
        },
        {
            "review_text": "how i remove top corner no connection in csgo",
            "review_score": "-1"
        }
    ]
}