{
    "app_id": 282620,
    "name": "The Battle of Sol",
    "release_date": "2015-07-01",
    "developer": [
        "Bit Planet Games, LLC"
    ],
    "publisher": [
        "Bit Planet Games, LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Workshop",
        "Stats",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Action",
        "Indie"
    ],
    "achievements": 17,
    "positive_ratings": 56,
    "negative_ratings": 35,
    "price": 6.99,
    "description": "The Battle of Sol is an intense space action game where you participate in epic capital ship battles, thrilling dogfights, space station raids, and much more as you liberate humanity's solar system from enemies determined to bring us to its fiery end.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/282620/header.jpg?t=1454440365",
    "minimum_requirements": "OS: Windows XP (SP3), Windows Vista (SP2), Windows 7, or Windows 8 Processor: 1.8Ghz Intel Core 2 Duo / AMD Athlon X2, or equivalent Memory: 2 GB RAM Graphics: DirectX 9.0c compatible, 256 MB of VRAM;(NVIDIA GeForce 7600 GS, ATI Radeon HD 2400 Pro 256 MB) DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX 9.0c compatible, 16-bit",
    "recommended_requirements": "OS: Windows 7 or greater Processor: 2.0Ghz Quad Core Memory: 4 GB RAM Graphics: DirectX 9.0c compatible, 512MB of VRAM; NVIDIA (GeForce GTX260 / ATI Radeon 4870) DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX 9.0c compatible, 16-bit",
    "reviews": [
        {
            "review_text": "I don't normally do this so I apologize in advanced. I will try to be as nice as possible.... 1) Game looks pretty nice, cap ships look cool and at first I thought 'wow this is gonna be cool!'  2) Hotas support is a real pain. I don't want to go into too much detail here but it took me hours to setup. I gave up trying honestly cuz I bought this game a few days after release. Now finally today I dedicated another 3 hours to trying to to setup my Hotas. I have CH fighterstick and CH pro throttle. It is SOOOO complicated with about 40 different axis choices and it doesn't sense any axis so you must do this manually. Would be easy without the maybe 15 or so subcategories for axis. I have never seen anything this complicated and I have played many space sims. Feels like they just threw HOTAS support in for us and said 'you figure it out!'. In the end of a 3 hour setup run I finally stopped trying to designate my throttle and rolls to any axis. I just shut them off and found out how to designate those controls to the keyboard. In other words, old school 90s wing commander style play from here out, Stick and keyboard. Still, I was determined to give this an honest try.  3) Sounds Really rough here. When overheating you hear a loud 'ping!'. Thought I could turn that effect down by turning sound fx down and leaving music and master volume up but nope. Just turns down other sounds but that damn ping sound stays loud as hell! The weapon sounds are also really bad here. No real gun sounds and no real missile sounds. One good thing I will say is the voice acting is pretty cool. Well done in that department.  4) Gameplay. Really simple, boring fighting. Made it 10 missions in. Only way you can tell you are being attacked is a red color in the corner of your ship. No feel of impact or sound effects to help you know. Also on the flipside it's hard as hell to tell you are hitting the enemy ship other than they visually take damage. Even after all the HOTAS nightmares the joystick randomly rolls while making fast movements. The CH Fighterstick CANNOT ROLL so this is a software problem with the game. This never happened in any space sims I ever played before. Very annoying. Also everytime to fire your guns the whole screen blurs up and shakes like crazy. Not cool man....  5) Summary Guys, I thank you for trying to make a fun single player space combat game. I miss these types of games dearly as a big fan of the glory days of Wing Commander, Freespace, X Wing and Tie Fighter. However, this time...mission not accomplished. I am very sorry to write a review like this. But the fact that I paid money for this game is a damn shame. I have played fan made mods of Wing Commander and Freespace games that are honestly 10 times as good as this. Those were made by non pros. Examples would be Wing Commander Saga, Wing Commander Standoff, and about a dozen Freespace mods. I do however hope you guys try again sometime soon. But you need to take your time and make a good game. Make the game interesting. Instead of just checkpoints all the time give us real destinations. The guns need to feel like guns. Missles need to be improved greatly. The art style you guys used was awesome. IT LOOKS SWEET!! Also, next time you build a space combat game, make it with the HOTAS in mind from the beginning. Don't just tack in on after the fact. Space combat games died with Freelancer and I think a big part of that was the fact that this is the beginning of mouse space combat games. Alright, that's all I have to say. Once again, I'm really sorry to the creators if this sounds harsh......but it's all the truth. I respect you a lot for trying but this has been a terrible gaming experience for me.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like flying a jet this game is for you. If you like the scene from Star Wars when Luke blows up the death star this game is for you. If you like making paper airplanes and throwing them this game is for you. If you like flying jets in Battlefield this game is for you. If you like great graphics this game is for you. If you want to fly on a dinosuar this game is not for you but you should check out ARK. I might have little hours but I have done 5 missions and it was amazing. If you watch Firefly this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "A very nice space shooter for fans of Freespace, Wing Commander, etc. who wants a mission-based space game rather than an open one.",
            "review_score": "1"
        },
        {
            "review_text": "I really want to like this game, unfortunately, controller support is terrible. I'm using an X52 Pro and am unable to bind thrust. I did research, and posted in the forum, but it's been twice now that the devs haven't answered my post. The binding menu is unintuitive due to a lack of visual ques, that is to say, there is nothing showing you that the menus are scroll enabled, and the game defaults to a joystick setting that causes your ship to just spin. I've fixed that problem, but in researching it, I found others having that same problem.   Being unable to thrust makes this game unplayable, so I can't give it a good score, but please don't take this as a review of the game itself, it is still a mystery. I have respect for devs, but not being able to play is really annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "Mouse acceleration is a crime and the auto aim is strong in this one  graphics look pretty bad even at the highest possible settings  feels like a port, probably is a port, a poorly made one at that.   Didn't like the story, rather cliche and the fact it jumped between the two sides just made it more annoying. Stick with one or the other please. OR at least confine it to two seperate campaigns.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game because I wanted the Freespace-feeling. This is not it... Controls are crap, the story is loose and wierd. I'm going to uninstall it now.",
            "review_score": "-1"
        }
    ]
}