{
    "app_id": 282860,
    "name": "Masterspace",
    "release_date": "2015-06-15",
    "developer": [
        "Master Technologies"
    ],
    "publisher": [
        "Mastertech"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Steam Workshop",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "Action",
        "Simulation",
        "RPG"
    ],
    "achievements": 11,
    "positive_ratings": 53,
    "negative_ratings": 121,
    "price": 5.79,
    "description": "Masterspace is a game about mining, creating and exploring, featuring fully destructible environments and spaceships that allow you to travel between different planets. Use explosives to mine metal ores or watch your newly constructed home get smashed to pieces by a meteorite impact.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/282860/header.jpg?t=1447360594",
    "minimum_requirements": "OS: Windows XP 32-bit Processor: Dual Core Memory: 2 GB RAM Graphics: NVIDIA GeForce 8600GT / AMD Radeon HD3850 * DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1 GB available space Additional Notes: *Integrated graphic adapters such as Intel HD Graphics are not officially supported!",
    "recommended_requirements": "OS: Windows Vista 64-bit Processor: Quad Core Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX480 / AMD Radeon HD5850 * DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1 GB available space Additional Notes: *Integrated graphic adapters such as Intel HD Graphics are not officially supported!",
    "reviews": [
        {
            "review_text": " UPDATE  (temporary one untill i get more free time):  The game has been abandoned unfortunately (afaik if you have a bug the Dev still provides support though). As it stands now, it is a nice voxel sandbox building game but there is really not much to do besides mining resources, building things and flying to other planets to.... build some more.  IMHO this is still better than some other abandoned EA games like Starforge unfortunately despite some nice ideas (like unusuall skill point system) it is clear that the game is missing the endgame.   In summary - i would still recommend this but only during sales (&lt;5€)    EA review  ______________________________________ A really nice game, recommended if you have a powerful PC (and no mainboard integrated graphic card).  - One of the better feeling game in the recent voxel dig/craft/build genre attack + feels more complete in comparison to games like Blockscape, StarForge, Xenominer, Vox, Realm Explorer  The good: - as usuall -&gt; lots of digging, searching for resources, building and crafting - a well thought building system - nice skill points system - the more you build the more points you get (to unlock skills/perks/cratfables) - not bad graphic (compared to pixel voxel games) - perks/skills to swim/build faster, etc. Also to unlock new crafting items. - cool game modes in development - build a spaceship and fly do another planet! - cool water system /pipes, pumps  The bad: - very demanding on pc (poorly optimised, memory leaks/etc) - crashes are often, some people cannot get the game to start - still in development -&gt; patches are not very often, can break things. The Dev is deploying hotfixes though. - not much to do yet once you unlock all craftables and fly to planets - small planets  In overall, a recommendation from me.",
            "review_score": "1"
        },
        {
            "review_text": "abandoned game is abandoned  now they release it still incomplete and buggy as hec.",
            "review_score": "-1"
        },
        {
            "review_text": "left mostly uncompleted this game falls far short of expectations. it feels like the developers just gave up and moved on which is a shame since it had potential to be great.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is confusing hard and you have to have a good computer otherwise it is laggy. I do not suggest this, masterspace is not as fun as the video makes you think. Also this game is not finished and will never be finished.",
            "review_score": "-1"
        },
        {
            "review_text": "Anytime the developer, publisher, and name of the game contain the same word....it's probably crap and not worth your time. I put a great deal of hours into this POS considering the quality of game it is. Very little progress made between the updates it had, and then it was released claiming to fulfill all EA goals. Not worth more than $5. 2/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "Broken and abandoned. DO NOT PURCHASE!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I've got to admit, I took a bit of a gamble when I bought this game, and I don't usually Take gambles. But it paid off once I got the hang of the game. sure there are bugs and glitches everywhere and the devs are almost hibernative, But Ride it out, and you get wrapped up in Masterspace.  Pros: Great game Idea, Sandbox, fun to goof off in, Simplistic,   Cons: Devs Almost Inactive, Glitches and bugs, Requires High-end PC to run properly.",
            "review_score": "-1"
        }
    ]
}