{
    "app_id": 283020,
    "name": "The Campaign Series: Fall Weiss",
    "release_date": "2014-05-30",
    "developer": [
        "Wastelands Interactive"
    ],
    "publisher": [
        "Wastelands Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "World War II"
    ],
    "achievements": 64,
    "positive_ratings": 23,
    "negative_ratings": 41,
    "price": 10.99,
    "description": "Set during the early events of World War 2, Fall Weiss is a new successor to the Panzer General",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/283020/header.jpg?t=1501139512",
    "minimum_requirements": "OS: Windows XP Processor: 1.2 Memory: 1024 MB RAM Graphics: 256 MB DirectX: Version 9.0c Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows 8 Processor: 1.8 Dual Core Memory: 2048 MB RAM Graphics: 512 MB DirectX: Version 9.0c Storage: 800 MB available space",
    "reviews": [
        {
            "review_text": "Fall Weiss covers the German invasion of Poland. Starting September 1 1939 the game allows players to control the Germans, Polish or the Russian forces. Players have 122 turns (each representing one day) to either conquer Poland or hold against the invaders. Each of the three factions has its own victory conditions:   German: Defeat Poland and Peace with/or defeat Russia  Poland: Hold against the Germans Russia Defeat of Poland and Peace with Russia  (NOTE the following has been fixed by the developers and custom games are now working) There also appears to be the option of playing a custom game. Which gives the player the ability to decide which of the 10 countries they control and to set difficulty levels for each. NOTE I have not gotten this option to work, getting a scenario is not compatible error. But it makes no real difference since most of the other countries play little role in the game  While I like the game it is not perfect by any stretch of the imagination. The biggest concern is lack of manual or tutorial; (NOTE THERE IS A MANUAL IN THE GAMES INSTALL FOLDER) why the developers did not include even a short description of some of the mechanics for the game is beyond me. Luckily for those who (like myself) have played other Wasteland games the basics are easy to get. of course I still have no idea the effects of HQs and supply depots  Game play  The game takes place on a huge (141 x 133) hex map. Players are also greeted with a large number of units; one example can be seen in the German army starting with 178 infantry regiments. With such a huge map and so many units it is a bit over whelming. And this is where I think the game is turning a lot of people off.   I personally like the game but it clearly is not for everyone. You go into this game with the knowledge that you got to have a plan. Now that can be said for any game of this type but Fall Weiss takes it to a whole new level. A good part of the game is about encircling your enemies and to do this you got to know what troops you are planning to head in each direction. Without the ability to buy new units (only re-enforce losses from starting units) planning becomes all that more important.   You got to plan your breakthroughs, decide which units will go through the gaps and where they will hook up with others units (from other gaps) to encircle and cut off the enemy supplies. I am not going to lie and say it is all fun and easy but it can be rewarding to see your plans come together  CONS  No tutorial or manual   UPDATE: ANother player pointed out there is a manual in the games folding. It gives a little information on the use of HQs and suooly   If you play as Russia you spend the first 17 turns watching the Germans and the Polish fight while you wait to be allowed to cross the border   Pros  get to play all three sides. Of course there is probably little possibility of the Poles winning   developer talking about mod support  Is it worth it  That depends, if you do not want to try your luck at planning the battles of an entire theater of operations I say walk away now. I believe the German campaign will take around 6 hours, let's assume the Poles and Russians take four hours each; that is 14 hours of game play. Not mentioning the changing some settings like French attacking in the west. In the terms of game play time it is worth the $20 dollars  For those who may already own Panzer Corps and its DLC, feel this games a little too deep or looking for a bit more, I would suggest waiting till it goes on sale.",
            "review_score": "1"
        },
        {
            "review_text": "0.7 Hours spent trying to get the game to work. Try and use compatability settings in Win8.1 results in a steam API error. Try running in windowed mode and it doesn't load the game at all, just hangs on the splash screen. Run in full screen and when you start a game it CTD when the load bar fills up.",
            "review_score": "-1"
        },
        {
            "review_text": "why",
            "review_score": "-1"
        }
    ]
}