{
    "app_id": 283080,
    "name": "Super Chibi Knight",
    "release_date": "2015-06-24",
    "developer": [
        "PestoForce"
    ],
    "publisher": [
        "Armor Games Studios",
        "PestoForce"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 72,
    "positive_ratings": 227,
    "negative_ratings": 33,
    "price": 3.99,
    "description": "The Kingdom of Oukoku is threatened by the spicy influence of General Tso. Citizens have placed their hope in a small knight who fits the requirements of ancient legends. Which path will the Chibi Knight choose...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/283080/header.jpg?t=1511395689",
    "minimum_requirements": "Mínimo: SO: Windows XP, Vista, 7, 8 or later Procesador: 2.5 GHz Memoria: 1 GB de RAM Gráficos: Direct X9.0c Compatible Card Almacenamiento: 100 MB de espacio disponible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Easily the most charming game I've ever played. I understand that the concept art was done by an 8 year old (the designer's daughter), so it has a very childlike, whimsical feel to it. The girl also did the voice work for the main character. I played this with my 6 year old and we both enjoyed it very much. It's simple enough for him to play, but still very enjoyable that I can play it as well. Great little indie game.",
            "review_score": "1"
        },
        {
            "review_text": "There is nothing to dislike, everything is adorable! Father and Daughter (8) succesfully made a Kickstarter-Game! And its epic!",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot of love put into every nook and cranny of this game. (And I should know...)",
            "review_score": "1"
        },
        {
            "review_text": "Very cute graphics, an efficient leveling up system, a good but not overly complicated story and a lot of effort make this a very recommended game.  Do yourself a favor and try this game out if you are an RPG fan.",
            "review_score": "1"
        },
        {
            "review_text": "Very cute graphics, an efficient leveling up system, a good but not overly complicated story and a lot of effort make this a very recommended game.  Do yourself a favor and try this game out if you are an RPG fan.",
            "review_score": "1"
        },
        {
            "review_text": "Unlocked all the achievements ( even the secret ones ) got everything in the game and im still playing it :D it's an amazing game with some wonderful replay value and i really recommend it to any parents kids and others Super Chibi Knight is an amazing sequel and a great casual game on it's own quite frankly it's a 10/10  Score: 10/10  Description  Amazing game for kids and others  Amazing sequel  P.S: can't wait for the third one :)",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to my review in which I´ll carefully analyze the game Super Chibi Knight.  If you´re feeling lazy to read all the review you can just go to the conclusion and read a summary.    Characters",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game, it's definitely something easy enought that I can let my nephews play it. One note if you have a web brower open while playing this game it causes performance issues for some reason. I'd recommend anyone get it who is looking for some time to kill and is not expecting a overly in depth 2d side scroller.",
            "review_score": "1"
        },
        {
            "review_text": "I played this while flying, I may have crashed and killed 40 people, but it was fun and worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I feel i should like this, but the game lags in about 2 second intervals for me,",
            "review_score": "1"
        },
        {
            "review_text": "I mean I guess it could be good... For, like a flashgame or something, you know. But I wouldn't really spend money on it...",
            "review_score": "1"
        },
        {
            "review_text": "I played the first chibi knight game for free, it was origional and fun in a way I had not experianced before in a game. this game is something else entirely and I regret buying it.",
            "review_score": "-1"
        },
        {
            "review_text": "It's alright, but you could buy a better game for 8 euros.",
            "review_score": "-1"
        },
        {
            "review_text": "warning: may include spoilers     i remember playing the first game a long time ago and i really liked it so then i found a sequel and thought, 'i have to get this game'. then i got it and it took a while to download, but it really wasn't much time to download so i thought that it would be a small game. then i saw the intro and thought that it would be a good game.  well I cant change my gender, guess i'm done for.  then I kill a pile of trash. (but did i really have to?)  later I'm outside and I kill some giant wasps in few seconds and apparently that was supposed to be hard.  i kill some more guys and end up with some 3 orb things and i go to some well and find some random floating thing and he says something like 'hey dude thanks for the orbs kbye' and he flys away and gives me a giant bag and i think that im TOTALLY gonna use the xp cause the enemies are so easy in this game  then i go into a desert and kill some sand worm thing  then i kill guys in a forest and put some guys lamp bright again.  then i eventually go to a desert and find some super slash thingy that you can use to fire a beam thing that would be TOTALLY useful  then i go in a pit and do some thing with a lever by using the beam to reach it  a door opens and i go through it and about 30 seconds later im fighting a boss  i kill it with rocks  then i get a kid and i bring him home and realise i was only just doing a quest  i go in the desert again and then go through a red cave  then i kill some yellow orc and get his blood, god i wasn't expecting that  i get a keycard and go in some spacship and a snake puts the key card in  then eventually after the same annoying as hell enemies i get to some room filled with stuff in jars  i break a jar cause i hate everything in this world  then a flying wombat comes out and craps every where  the same thing happens with the orc, i kill it and it turns into jelly and i take its blood  then i get some dust on my sword and help some drunk guy with the blood  i use the dust to cut down some rocks and go into a temple  i kill everything and i also kill a guardian at some point and free birds and kill them 5 seconds later and be a horrible person and take their eggs  then i go past a door and a huge eagle takes me to some edgy island with dragons  eventually i go and fight a thing and i get a chicken  then i fight another thing and i get something else but i think it was the buffalo thing  i talk to some cool kids and they give me some edgy rhino  then i have to get medicine and its really boring and this person isn't even sick  they are instantly better when they drink out of the dirty bucket which makes no sense and i go through some rocks on my edgy rhino and i find some purple dragon and i free it and explode it with my beam and ride it away  then i get some fruit to put in a medicine  i have to go on my most epic quest in the whole game just to get a carrot, some water, salt, a bucket and some sacred fruit that grows probably every century/millenium but they don't care, they're daughter has a cold and you have to help them. it would not be nice medicine and i think it would actually make you more sick due because you mixed SO many things together and its just, ew  then they have the medicine and are instantly better  i find a vault and look up the code to get in and i find the code online and type it in  i get a crap ton of xp  then i get some jump skill thing  some time soon i break a door with my dragon and my hometown is destroyed  yay i love this sight everybody is DEAD (or they are probably hiding in the pit)  hiding from the FAT BIRDS!  the bird somehow came back to live and are edgy as hell  the only hard enemies in the game i am facing right now  i rk them and go in the final area  later i fly over a bridge  i get to my final boss and all the guys aren't dead and they came cuz i did they're quests and they rk the boss's health  i eventually get on the point and its really freaking boring because they only have 5 attacks and spam them in the same order over and over until eventually i kill it  when i thought it was over i had to go in his mouth  i eventually fight his heart  wow that was easy  then i get vomited out of him  the end  this game is awful, it has no replayability or purpose whatsoever and it lacks difficulty and it REALLY is not worth spending about $10 on it  wait what when did i have 13.6 hrs? i never even play this!",
            "review_score": "-1"
        }
    ]
}