{
    "app_id": 283230,
    "name": "Spoiler Alert",
    "release_date": "2014-06-30",
    "developer": [
        "MEGAFUZZ"
    ],
    "publisher": [
        "tinyBuild"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Adventure"
    ],
    "achievements": 10,
    "positive_ratings": 843,
    "negative_ratings": 288,
    "price": 1.99,
    "description": "Spoiler Alert is a video game that tests your platforming skills… in reverse. It’s a comedy platformer that you play backwards.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/283230/header.jpg?t=1482340532",
    "minimum_requirements": "OS: Windows XP and up Processor: A basic dual core Memory: 1024 MB RAM Graphics: Integrated Storage: 27 MB available space Additional Notes: Works with Xbox controllers",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The game's entire gimmick is that you play it entirely in reverse. You unkill enemies, uncollect coins, etc. It sounds interesting and novel but after 15-20 levels, it gets rather boring. The levels are VERY short (like less than 10 seconds short), and the hit detection is atrocious and inconsistent.   It plays like the original Super Mario Bros on NES (and that's a generous comparison), but a super lite version.  Your character moves on his own (backwards) at a set speed and the only control you really have is the up arrow to jump. The length of holding up doesn't appear to make a difference in your length of jump. On one level (out of 100), you can actually make him change directions... again, only on one level. On a handful of levels you have to catch a projectile with z (to unfire said projectile). Each level must be completed a specific way, so there is no experimenting, exploring, or even figuring something out. You cannot choose whether to collect a coin or not, or kill this enemy or not. Each level is essentially press up 2-5 times at the exact moment the game wants you to; Succeed and go to a new combination or fail and do it again until you don't fail.  A nitpick is that the levels actually get harder as you get closer to the beginning of the game, which makes sense in a progression sort of way, but doesn't in a  I'm getting close to the very beginning of the game  but either way this would be difficult to manage.   Bottom line:  the game takes maybe an hour to 100% complete it, getting all of the achievements. It takes longer to get all the trading cards to drop than to complete the game. It does come with a level creator but I did not mess with it.  If it's under $1 and you want to add a perfect game to your achievement list then by all means get it, but I really cannot recommend it to anyone looking for fun. 0.5/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "Spoiler Alert is a nice little game and sort of refreshing. Basically, you are a chili pepper fighting aliens and what have you. However, you start at the end and work your way back through time to the beginning. Other than that, it's basically like Super Mario as far as gameplay, only you are obviously doing things in reverse, which often entials intentionally missing enemies and coins rather than trying to gather them. The very beginning (i.e. the end of the game) is kind fo funny and makes the hour long journey all worth it lol.  Very nice, game with seamless gameplay. Does what it sets out to do in stellar fashion.  8 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "+ Fun take on the platformer genre + Simple controls  - Short - Unchallenging/Too easy  [Rating: 63/100]",
            "review_score": "1"
        },
        {
            "review_text": "Spoiler Alert is a platformer played entirely in reverse. You start at the end, having already beaten the game, and then progress backwards to the first level. Take all your classic platformer tropes and they're most likely represented here, albeit with a twist.  I had brief moments where I enjoyed Spoiler Alert, but there's not enough of it and what is there isn't polished enough to really merit playing. It's a highly creative concept but, ultimately, a gimmick that doesn't quite work as a game.  Game: 5.0/10 Graphic: 6.5/10   100% Achievement :   Easy  | Medium | Hard | Very Hard",
            "review_score": "-1"
        },
        {
            "review_text": "I just finished the game 100% in 40 minutes - and now I'm waiting for it to drop all the cards. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I understand the gripes that others have mentioned. Indeed, the game is very short and it's nothing but level memorization. But its heart is in the right place and 'unplaying' the game is a refreshing take. But the authors have said that what they were really hoping for is that people will come up with their own levels. I don't have the patience for that, but I can see where someone with some good level-making skills can make multi-pathed levels that can be a challenge. The $3 price for that isn't a bad deal, and it's a rather non-offensive way to kill some time. I'd rather have that $3 go to an indie developer who's at least TRYING something new than as 1/20th payment for the latest 'Sports Game That's The Same As Last Year 201x' or the newest first-person, militaristic grey-a-thon.",
            "review_score": "1"
        },
        {
            "review_text": "I 100%ed this game in less time than it took to get the trading cards to drop.   It's not too expensive, but there's not a lot of content.  I don't think there's any real replayability, the graphics are newgrounds circa '97, and the controls are also not as tight as I'd like Also, if you take the conceit of the game seriously, the design makes no sense. I realize that games are supposed to get harder as you go, but having the 'first' boss be so significantly harder than the 'third' really bugs me. I do think it'd be interesting if the game could be played forwards and backwards, and it might have forced some different thought processes in the developement.   This game isn't terrible, and if it's cheap enough, it's not really a waste, but I can't recommend it.  (I found it pretty annoying that the person who's game I was 'unplaying', was so bad at video games)",
            "review_score": "-1"
        },
        {
            "review_text": "I've beaten it, completely, 100%, in 53 minutes.  The good: + Congrats on trying something unique! + Originally made in 12 hours for a game jam, months later it became this full game. + Full mouse and joystick support. + Has several extras in the game directory, including concept art, comic book and the original version from the game jam.  The not so good: - Gameplay is very simplistic, most of it consists on hitting the jump button at the exact time. Considering this is also a mobile game, it is not very surprising. - Several levels require some kind of trial-and-error until you understand how to beat them. - A bit boring. - Seems locked to 45fps. Either that, or the game is so un-optimized that it can't run at 60fps on my Core i5 with nvidia GPU.  Do you want a short game? A game that doesn't require learning many controls? A very simple game? Then go for this game!  If you expect something more, you may want to pass this game, or wait for a sale or a bundle.",
            "review_score": "-1"
        },
        {
            "review_text": "While there are some interesting ideas presented in the game, the set jump height and inability to alter your movement speed makes many of the puzzles much more frustrating than they need to be. The story is also lacking, with everything being fairly plain from the start without any real twists on how it developes. Despite what is implied by the title, the game also follows the same format as most other platformers, starting with the idyllic green area and moving toward darker and more ruined landscapes. Overall, there is a lot of potential for this type of game, but this particular one did not deliver on what I wanted or expected.",
            "review_score": "-1"
        },
        {
            "review_text": "A fun platformer that isn't too long, it ends before it gets tedious.  Every level is the perfect lenght so it doesn't become overly frustrating.  Has replayablity for the people whom care about getting all achievements/want gold on every level.  Pricing is realistic for the lenght of the game, good to see some developers looking for balance in everything.",
            "review_score": "1"
        },
        {
            "review_text": "Love it. Great concept for a game. Some parts can be frustrating, but what games aren't?",
            "review_score": "1"
        },
        {
            "review_text": "A short, simplistic, infinite runner with the gimmick of moving left instead of right. Can literally be beaten before it drops a second trading trading card if you are at all interested in doing so.  Also there is literally only one joke in the entire game, so don't let the comedy tag trick you either.",
            "review_score": "-1"
        },
        {
            "review_text": "Silly concept, but it just doesn't offer enough to be worth it, as it honestly feels like a free flash game from newgrounds.",
            "review_score": "-1"
        },
        {
            "review_text": "(This review was written with a playtime of 1.6 hours for the Collector's Edition)  ?emag oediv a taebnu ot detnaw reve uoy evaH… ok I am sure someone has already made that joke.  Have you ever wanted to unbeat a video game? Is that a “No” I hear? Well now you can, thanks to Spoiler Alert.  Spoiler Alert is an auto-running 2d platformer where unlike any other game, you play through it backwards (thus the name Spoiler Alert). It is a decent casual game that took me about an hour to beat the main 3 worlds (all gold ratings), the extra mariachi levels (all gold ratings as well), and unlock all the Steam achievements. When you beat the main 3 worlds (or rather unbeat), you unlock the aforementioned mariachi levels and a speed run mode which allows you to play through all of the main worlds at once trying to obtain the fastest time possible. While it is short, there is Steam Workshop compatibility with the collector’s edition that allows you to create and download user created levels. The sad part is I couldn’t load the Workshop maps, and when I tried to make and save my own it crashed the game :( . RIP level… but anyways…  The game, like 10 Second Ninja, is designed to be comical. The art style is nice. The gameplay seems too slow, repetitive, and kind of boring. All you basically do throughout the whole game is jump. I would recommend that if you purchase this game you get the standard version unless you really want to make levels, have some wallpapers/game art, and have the games soundtrack.  I rate this game a 5/10 (The speedrun mode makes this somewhat more enjoyable)  ~bottlehead  PS-My first time playing speed run mode I got 21:19, so feel free to try and beat it if you own/purchase the game!",
            "review_score": "-1"
        },
        {
            "review_text": "One tiny thing peevs me... That there's no manuel Restart Option.  This game is an ol'styled platformer where you need good timing and trial &amp; error to beat.  Baby steps in comparison to Bossi doh :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, perfect entertainment for about an hour",
            "review_score": "1"
        },
        {
            "review_text": "It's a short and sweet game that I'd recommend. Nice ending, btw.",
            "review_score": "1"
        },
        {
            "review_text": "Yet another mobile port... First of all Retro/Grade did 'unplay' way better than this. The gameplay is somewhat interesting at first but falls flat quickly. I would argue that even at 2.99 is way to much for this since there are many better games for 3€ and there really isn't that much more to this game when you played it for a few levels. There is almost no challange and way to little content and almost no variation in mechanics. And it doesn't realy play that well either, with clumsy controls and a hitbox that fells way off. 100 levels? Yes, but you will get gold star in every single one of them in about an hour or so. Avoid unless you get it in a bundle or for &lt; 1€ on a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "The concept of the game is kinda cool. You play the game in reverse.  Pros: Easy to 100% It's something different  Cons: Ranking system on levels feels pointless. - See below Huge hit boxes Controls don't feel responsive at times.   Ranking System - Creating a 'Time Paradox' in a level results in a level failure. You can retry the level and you get ranked based on your retries. There aren't any checkpoints in the levels, so you are always playing from beginning to end. The only way to complete a level is to beat it in one life. To gold rank a level, you have to beat it one attempt. Backing out to a parent menu and re-trying the level treats it as one attempt.  It may sound confusing and I'm having trouble explaining it. Essentially to get a gold on every level you have to add an extra step and 10 seconds of load time to beat the levels with '1' retry. ",
            "review_score": "-1"
        },
        {
            "review_text": "Yet another mobile port... First of all Retro/Grade did 'unplay' way better than this. The gameplay is somewhat interesting at first but falls flat quickly. I would argue that even at 2.99 is way to much for this since there are many better games for 3€ and there really isn't that much more to this game when you played it for a few levels. There is almost no challange and way to little content and almost no variation in mechanics. And it doesn't realy play that well either, with clumsy controls and a hitbox that fells way off. 100 levels? Yes, but you will get gold star in every single one of them in about an hour or so. Avoid unless you get it in a bundle or for &lt; 1€ on a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "This game, is without a doubt, very mixed.  It is a good game to play to pass the time but don't expect anything more from it, it is also only worth like a dollar anyway. It had a lot of potential but it's only for those who want a quick game or easily 100% a game in under a hour.",
            "review_score": "1"
        },
        {
            "review_text": "Okay so I just 100% Achievement this game in like two hours. The other two hours are from Idlemaster. For $3.29, I wouldn't recommend this game. As part of a bundle or on 90% sale, absolutely. Easy game to 100%, basically just pressing one button, for jump. A different kind of game so I'll give it a bonus for the unique style. Overall, quick easy game, you won't get many hours from it, but something for the Library on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Good idea, bad implementation. Weird controls, no content.",
            "review_score": "-1"
        },
        {
            "review_text": "Very enjoyable, especially for platformer fans. Definitly worth picking up when on sale!",
            "review_score": "1"
        },
        {
            "review_text": "  Pretty nice short game, its worth for an hour of funish gameplay",
            "review_score": "1"
        },
        {
            "review_text": "While I like idea of playing a 2D platformer backwards, I feel the game is too simple, short, easy and restrictive since all you can do is jump and you can't control your speed since your character movement is automatic. Also the price for this game should have been a dollar or 2 since I feel the standerd price for 7.99 is too steep for this game.",
            "review_score": "-1"
        },
        {
            "review_text": " Summary:",
            "review_score": "-1"
        },
        {
            "review_text": "Spoiler Alert is a great addition to the platforming genre. It's fun, challenging, and even though it has 90 levels, it leaves you wanting more.  This is partly due to the fact that most of those 90 levels are very, very short, and very few have more than 3-5 enemies and stage hazards, which I have to say would dock a point if I were to give it a number/letter score. However, I do say that the base game is *definitely* worth the $3 and strongly recommend you pick it up.",
            "review_score": "1"
        },
        {
            "review_text": "3/10.  Real score-Turd/10.   This is a platformer that you play backwards. Interesting idea, but terrible execution. Levels are boring and empty. Graphics are from microsoft paint 1996. The real problem is the gameplay. Instead of moving backwards and playing like an actual platformer, this game has you only being able to press jump. The game moves your guy while the screen is continuously moving. Then, even worse, you can't choose when to jump. Because since you're playing backwards to you have to jump on every single guy that's dead or get/avoid every single coin or you lose the level. This makes it the opposite of a platformer where you get control, and instead basically a QTE game. The problem is with the terrible floaty inaccurate jumping you never know where you will land, leading to trial and error. Other times you don't know what you should do. All in all its not a platformer, but a game where you have 0 control and just press the right button or lose the level, and rinse and repeat.  ",
            "review_score": "-1"
        },
        {
            "review_text": "The most frustrating part of Spoiler alert is the star mechanic. A much better way they could have done it is allow you to mess up and not restart but at the cost of a star. Rather than having to quit the level then choose the level all over again",
            "review_score": "-1"
        },
        {
            "review_text": "Alright Spoiler Alert! is a casual platformer but with a twist. The twist is that your playing the game backwards. Now im going to get on to the pros and cons of the game then my personal opinion.    Pros:  + Great music +Unique Idea +Very Casual and Fun +not too hard or too easy +Built in level maker  Cons:   -Sort of short   My personal opinion:  I think that Spoiler alert is an awesome game. It is super fun and unique in gameplay. Although some people think its too short. I like to think of it as short and sweet. Now should you buy this game? YES!!!! Its short but it is one of my favorite platforming games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very short to complete. BUT, that doesn't mean it's bad! It's SO good in fact that I rank as one of my top 10 games I like of all time on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful idea with some pretty decent artwork. While a fun game, it doesn't offer much to do. This game can be 100%'d in around 40-50 minutes and it relies on community made levels outside of that. It's a quirky little thing that I definitely enjoyed my time with but it could be so much more. I'm torn between giving this a thumbs up or down. It's definitely not worth much more than the $1 asking price during a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting idea for a funny little game! All you need is good reflexes. A little short though. ",
            "review_score": "1"
        },
        {
            "review_text": "While the concept is very intersting the actual gameplay comes to jumping at right time for 90% of the game and then pressing/holding Z at the right time for remaining 10%. I'm not sure if that's enough to classify as platformer game, feels so much closer to QTE.",
            "review_score": "-1"
        },
        {
            "review_text": "Had an hour to play random games, it took me 45 minutes to beat this, good to fill gaps in time when you don't have any idea what to do, I enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is based on a very neat idea of playing a game backwards. IMHO the idea has a lot of potential, but wasn't very well executed. The whole gameplay revolves around pressing the button in the exactly right moment.  The game is very short, I was able to complete it in 2.3 hours while winning all the medals and getting all the achievements. If you don't care about achievements, you can complete it in 1 hour tops.  It's not worth your money unless it's on sale or in a bundle.",
            "review_score": "-1"
        },
        {
            "review_text": "Short but fun game, not worth the full price tho, so wait for a sale if you wish to get it.",
            "review_score": "1"
        },
        {
            "review_text": "Game won't run (Missing executable). No support from developer. Don't buy.",
            "review_score": "-1"
        },
        {
            "review_text": "I recomend it!!!",
            "review_score": "1"
        },
        {
            "review_text": "A bit of a boring platformer whose quirk is that you're playing the game from the end to the beginning in rewind mode. It's fairly easy and just a bit tedious. Graphics are poor really.",
            "review_score": "-1"
        },
        {
            "review_text": "it's an one hour to two hours story thing but for the 70 cents that i got that it was a good deal for 1.5 hrs",
            "review_score": "1"
        },
        {
            "review_text": "a Really funny game ... and you find the princess !!! ... bouh !!",
            "review_score": "1"
        },
        {
            "review_text": "Very cool little (and I do stress this right off the bat...took me a little over an hour to 100% story mode and achievements, just FYI but if this doesn't turn you off completely then read on) platformer ala classics like Super Mario Bros but with the very big twist being...well...it's completely in reverse.  Start at the end of the story and traverse past level after level killing enemies that were previously killed and collecting coins previously collected all the while avoiding the ones that weren't hit and thus also dodging pesky time paradoxes in the process (because those are never good for time travel...right?). Along the way you'll also re-collect a unique power every world that was lost through a death (because hey...none of us are perfect, right? ;) ) like shooting fireballs, chucking hammers (Hammer Bros, anyone?) or rolling up in a ball to get through tight spaces. Long story short I definitely recommend it if you can pick it up in a bundle or during a sale. There just isn't an awful lot to do after finishing the story mode which is why I recommend a lower price point. There's an extra set of 10 'Mariachi' levels and a speed run mode unlocked after story, besides these and a level editor for custom levels (if that's your sort of thing) there isn't anything else to do unfortunately. That said the only real downside honestly was that the short story just left me wanting more now...but I suppose there could be worse problems.",
            "review_score": "1"
        },
        {
            "review_text": "First off, the best parts of the game are the ending (beginning) comic and the concept itself. It's a great idea for a game, but fails in implementation.  I'm glad I finished it, but I almost didn't. I was really bored, and the jumping is frustrating and really floaty. It's good that you restart immediately if you fail, because some of the levels are just about impossible to do on the first, second, third, or even fourth try. There's nothing funny in the game apart from the concept and the ending (beginning).  I was about to quit, then I saw I was just about done, so I finished the last few levels. I wasn't going to touch bonus content though. It's a good thing the main game is short, or I never would have finished it.  I can't even recommend it if you get it for free or as part of a bundle. The ending might have made it worth the half hour of my life, but I'm not sure about that. One thing for sure: don't spend money on it.",
            "review_score": "-1"
        },
        {
            "review_text": "really interesting idea, fun followthrough as well. playing the entire game in reverse was fun. the ending.. or i guess begining was a little predictable though.",
            "review_score": "1"
        },
        {
            "review_text": "  I would recommend this game to you, its worth it.Its a completly different kind of a game, you dont always get stufff like this, its not your usual game. Also its has a level maker for more fun.  Basically you are playing a story thats already finished, obviously its no serious story, its just a really lame thing, like Captain Underpants! Your rewinding the story as you play, instead of playing the game, you are 'emag eht gniyalp'.   Graphics- Sketchy kind 3\\5 Difficulty- Not easy not hard either 3\\5 Character - I love donuts and chillies 5\\5 Overall- 4\\5",
            "review_score": "1"
        },
        {
            "review_text": "10/10  Would not unfinish again",
            "review_score": "1"
        },
        {
            "review_text": "Imagine Adventure time now take a My little pony horse and a Pencil Insert the my little pony in your ♥♥♥ and drive that ♥♥♥♥ing pencil into your eye like the Joker in The Dark Knight.  Stop making crap.",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game, if you are or want one of the following: 1 - You like games made on flash, and plataformers even more so. 2 - A game with easy achievements to boost your '100%' list. 3 - Are going to gift this to a young kid.  It's silly, and it's not worth full price. For some reason the jump button (the one of two buttons you will be using the most) sometimes felt irresponsive, the leaderboards and custom levels wouldn't load for me. It feels poorly executed, like the order of the levels was backwards design wise, in a game that uses backwards design... that means, it uses linear design when it shouldn't. It is a good, cute game, but all I see is a lot of wasted potential. Trying to get gold on speedrun mode would be the one thing to make this game gain much more value, but without an achievement to go with it, you'll be ok with getting a bronze.  I don't know what time restraints (I feel like this would've been amazing for a game jam) or budget this game was made on but I feel like this could maybe develop an interesting sequel, if more time was spent on plot and design... Aaaand about 6 more worlds of content.",
            "review_score": "1"
        },
        {
            "review_text": "Nice songs, fast game and creative levels.",
            "review_score": "1"
        }
    ]
}