{
    "app_id": 283290,
    "name": "Nosferatu: The Wrath of Malachi",
    "release_date": "2014-03-06",
    "developer": [
        "Idol FX"
    ],
    "publisher": [
        "Funbox Media Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Horror",
        "Action",
        "Vampire"
    ],
    "achievements": 0,
    "positive_ratings": 1880,
    "negative_ratings": 312,
    "price": 2.09,
    "description": "It is a misty evening in the year of our lord 1912. The Pattersons, a poor but proud aristocratic family of the British nobility, and some of their closest friends, arrive at the castle Malachi residence of a wealthy Romanian Count.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/283290/header.jpg?t=1530529924",
    "minimum_requirements": "OS: Windows 98/2000/XP/7/8 Processor: Pentium III 733 MHz Processor Memory: 128 MB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is my favorite PC game.  I've grown up with games like Resident Evil, Silent Hill, Fatal Frame etc. Then i discovered Nosferatu: The Wrath of Malachi. This game is for me a synonym to survival horror game. It has perfect atmosphere and suitable weapons against Evil.  WARNING! This game has bad graphics and sound. It's buggy as hell. Hit detection screws you over.  Have fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is a delightfully old-school experience, with a managable difficulty setting and great features that will keep you coming again.  I first played this when I was a kid, and it freaked me out a lot. It was scary back then, before the HD era. Nowadays, sure - it looks really outdated. But it's systems are not. Part roguelike, part metroidvanian FPS survival-horror experience, this game is sure to keep you engaged for quite some time. Even after all of these years, with the automatic upscalling and all, the game looks pretty good on a modern monitor.  The graphics glitch out sometimes, but it's not something a game restart can't fix.  Even now, in 2015, you can see all the work that went into this - it oozes with atmosphere and the creep factor never drops. Even all the typical moments of the old times seem cute now - like struggling to find your path because of 'logical' game design (this castle Malachai's architect is probably the same one who designed Dracula's). Puzzles are never too easy, neither too hard. The hardest thing is memorizing the environment, as it's a large Castle and, well - you have no map, which actually adds to the experience in my opinion. The game's 'Random Castle' perk is probably one of it's most notable features - each time you start, the castle is different. And the difficulties do a lot to change up things too.  There's a lot to discover, a great challange and ... well, I'm not gonna spoil it.  If you're into horror and you don't mind it beeing old and not super-high-spec-HD, get this game. If you are a fan of old-school horror movies, you should try it also. The game is absolutely modeled after the Hammer-era horror movies.  This game is a FPS metroidvania and it's awesome for being just that. When I was a kid, this is what I expected the 'new' Castlevania games to be like. They weren't, but hey - this game is still awesome. I absolutely recommend it!  All in All:  + Random Castle in Each New Game + Great Atmosphere + Still Holds Up + A thing that I should not spoil but it's awesome and you will know what it is if you play the game + Fun! + Good scares, different each time!  - It looks outdated, mainly because of the low res options - It's a hard game, even on easy, in the beggining, until you get the hang of it - Graphical glitches on newer hardware  Overall, as a old-school fan, I rate this a solid 8/10 for awesome atmoshpere and fantastic fun factor! If you are not a old-school fan and you want to try it out, consider the rating to be a 6.5/10 - it will be fun if you manage to get into it.",
            "review_score": "1"
        },
        {
            "review_text": "We need a HD remake of this game!  many scarejumps, scary sounds and everything.   9/10",
            "review_score": "1"
        },
        {
            "review_text": "Really interesting spooky shooter with slight random gen elements. Some rooms and the location of family members change in each playthrough. Big complaint is that you cannot adjust the resolution but thankfully you can find a hack out there that lets you do just that. GOod game, worth the 10 bux",
            "review_score": "1"
        },
        {
            "review_text": "Picked up a medkit at 36 hp Vampire jumped from the roof and fell on me, and after killing him I had a remaining 2 hp Heard a yell, turns right Half naked vampire girl glitched through the floor and kills me  10/10 would ♥♥♥♥ myself again.",
            "review_score": "1"
        },
        {
            "review_text": "+ Very atmospheric; + Nice and fitting soundtrack (also really scary); + Random generated events; + Well done overall classic vampire style; + You can use a cross as a weapon;  - Graphics are kinda dated and some animations are kinda clunky, but hey, it's a 2003 game (that doesn't bother me, but if you are a graphic ♥♥♥♥♥ stay away from this game)",
            "review_score": "1"
        },
        {
            "review_text": "Slender before Slender II before Amnesia.! Actually the game is great because its ten years old and the systems and gameplay still work in it! Its as good to me as System Shock 2. And like any roguelike... its REPLAYABLE! The time mechanic and quest of saving family is simillar to Dead Rising games. Great game and REALLY hoping the devs comeback to make a truly modeern sequel. No game captures the style of Nosferatu even today!",
            "review_score": "1"
        },
        {
            "review_text": "Great training for taking care of the elderly.   10/10 would escort Aunt Sophie down the stairs again.",
            "review_score": "1"
        },
        {
            "review_text": "A nice game. Despite its age and poor graphics, it manages to be kind of scary in its own way--or at the very least it instills a sense of dread. Fun to search castle and rescue randomly placed relatives. Ten bucks is a little steep, though. I would try to grab it on sale for around five.",
            "review_score": "1"
        },
        {
            "review_text": "I'm sure you'd buy this expecting to be mauled by vampires, devil dogs, and whatever else Satan has locked away in his fun zone but no... the true killer of this game isn't the terrifying nosferatu, or the savage werewolf, they are easily dispatched with a few pugilistic strikes to the face and/or torso, but is a creature so immensely evil that uttering it's very name sends shivers down the spine of even the most hardened survival horror veterans, that's right! I'm talking about the dreaded DOOR!!!! -shivers-",
            "review_score": "1"
        },
        {
            "review_text": "Very Fun, Still good even though its over 10 years old, not scary but certainly tense.",
            "review_score": "1"
        },
        {
            "review_text": "An old horror classic, Nosferatu will shiver your bones and legs so much it will seem funny!  The game is based around the early ages where horses where used instead of cars, and the storyline itself is quite awesome. It runs really well on all PC's since its an old game, but never judge a book by its cover. Even though its quite old, it still doesnt fail to give scary jumpscares with tense moments. I myself am not a very easily scared person but the game still managed to accompish its goal.   The graphics seem simple, but for me thats what makes the game beautiful. It gives me, and (potentially) you a classic sort of old horror movie. The black and white ones where the television had just started to come out.  Unlike other horror games, Nosferatu gives you the ability to fight off the devils and monsters. There is a variety of weapons, each with very different purposes.   I got the game for free, and spent about 2 hours on it which is a rare thing for me to do so on a single-player game.  This game is so unpredicted that the cheesy graphics and the buggy animations and bots might even amuse you instead of giving you a scare!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Better dog simulator than COD",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly enjoyable horror/roguelike/FPS, especially if you can get it on sale. Also surprisingly scary, too, even with graphics straight out of, well, 2003. Also the first horror game I know where I can punch both dogs and vampires to death, with my bare fists, in the same game, at the same time. Bonus points for exploding floorboards.",
            "review_score": "1"
        },
        {
            "review_text": "HOLY ♥♥♥♥ this game is scary. Minor bugs the game has really make for a unpredictable and terrifying experience. This game will scare the ♥♥♥♥ out of you but is also a lot of fun with great replay value.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very scary game, even for being so old. The Horror genre used to be good. This game is one of the scariest games that I have ever played. The fantastic music and atmosphere always has you on edge. The combat is decent. The enemies are terrifying. I do have a big issue with running the game smoothly though. I am not sure why but it hitches a lot. Overall I would give this game like a borderline 8. Very nice game to pick up on a sale if you're undecided on it. Check it out for yourself!",
            "review_score": "1"
        },
        {
            "review_text": "Nosforatu: The Wrath of Malachi is a great throwback to classic Universal and Hammer horror films and borrows heavily from the silent film classic Nosferatu, including the film's take on Dracula, Count Orlok. It has chilling atmosphere and music, neat-o enemies that abide by the usual vampire rules, and plenty of ghoul killing weapons. The main goal of the game is to rescue your family, who, along with items, are randomized, so replay is a plenty. It is a bit buggy but not annoyingly so. If you're a fan of classic horror films or just want a spooky game, check it out.",
            "review_score": "1"
        },
        {
            "review_text": "this is one old game but is very good that gives you so much puzzles and it is hardcore (for some people)",
            "review_score": "1"
        },
        {
            "review_text": "Game of my childhood!",
            "review_score": "1"
        },
        {
            "review_text": "Kind of scary game! I like it! All of you need to try it ;) Nice job!",
            "review_score": "1"
        },
        {
            "review_text": "10/10, got to shoot Nosferatu in the face.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game on a sale for less than a dollar and boy was it worth it! I was pleasantly surprised by it's old school visuals and soundtrack yet modern controls and overall 'feel'. It's not a very long game, but it has some replayability due to it's semi-random generated castles. If only there were more games like this...",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ MY PANTS WHILE PLAYING THIS, GOT A NEW FETISH 11/10",
            "review_score": "1"
        },
        {
            "review_text": "It may look old, bugged, dated, bugged, scary, jump-scare driven, bugged and dated once more,but it's worth it. There are notorious silly bugs like dying while walking through a door, dying going down the stairs for no reason, losing all your bullets you had left on your clip when reloading, monsters becoming completely invisible for no reason, but it doesn't take back from the fun you get watching the npc you save fall down the stairs while running towards you, the dog feeling like going up against a bunch of ghouls for the sake of your safety, vampires levitating half a meter away from the floor when falling down, or the extremely lack of courage of pretty much anyone you save ('Here take this crucifix, but don't ask me to hold you a torch and step away while you fight in a monster infested hallway, that's too dangerous')  +Pros:  So bugged it's funny or irritating, depending on which bug you encounter Good Story Good gameplay Once you know the map, it has a replay value just for the sake of trying to save everyone The dog is more brave than the other 12 rescued Still good fun  -Cons So bugged it's funny or irritating, depending on which bug you encounter Graphics are so bad you can barely see anything sometimes Bosses are too easy Too limited ammo until you get to the last castle The people you rescued pretty much stay put and don't help you",
            "review_score": "1"
        },
        {
            "review_text": "it was the first game played on PC many years ago  it`s awesome  every times u start to playing new game again many things such walls doors ، npcs place ..... changing",
            "review_score": "1"
        },
        {
            "review_text": "Seeing how all the negative reviews get 0 out of whatever for the reasons unknown to me, i don't expect my review to be welcomed any differently, yet i'm gonna speak up regardless. Yes, i don't understand how this thing keeps being called great, awesome, cool, with great storyline, great graphics. etc. And no, i don't get it how this horrible abomination of a video game even has what, 4 stars out of 5? It's a great mystery to me.   First of all, i'm no way into bashing old games for being... you know, old. I'm an old fan(g) myself. I play a lot of old games. For example, i just re-played Clive Barker's Undying for like... 10th time because of nostalgia. I keep returning to Undying because it offers a unique and interesting gameplay, different ways of approaching it, something new every time. One of these games that you can replay over and over again and everytime you would discover something new, something you haven't noticed before. Creative stuff that used to prevail in old games, you know, some really creative interesting ideas. And it's even older than this one. But i know for sure, i won't be returning to Nosferatu, no way.   So i was looking forward to a game to satisfy my strong urge to play a good old school shooter. And i saw this, i saw all the good reviews and i thought: 'Hell, how could i even miss it back in years?!'. Now that i've seen what it was that i thought i missed... Oh boy, was i thankful i did. So, what do i start with. Boy, oh boy, the choice is wide. First of all, the very first thing i didn't like was the menu. It's simply uncomfortable. Pressing 'ESC' doesn't return you back to game or a previous part of the menu. That's uncomfortable. No video settings? You gotta be kidding me. Control settings? Please, there's almost nothing to customize. For some reason, you can run and jump, but you can't crouch. Dafuq, really?  Combat system, absolute joke, from the start we have a sword cane that just looks like a simple medieval sword. I have no idea where they saw a sword cane here. Movements are clumsy, they stutter. There are only 2 'types' of attack with that 'sword cane' and they stutter as hell and look very poorly animated. Mechanics... I don't get it. The protagonist can run like a cheetah for a few seconds but unable to perform anything but two pathetic looking sword moves? Dafuq? You see, do you already see that thin line that's been broken, right? A protagonist that can on one side do something... extraordinary where most people would suck a huge dog's ♥♥♥♥ but on the other hand can't do something simple? Nah, i'm not buying it. Then, when (IF) you get a first firing weapon... Yes, in this game you don't just simply find new weapons, you gotta work ridiculously hard to earn'em, which is not a compliment in that case. Even on Medium! The firing and reloading animations are horrible. They're just horrible, hands down. They lack. The game is so bugged, half the time bullets don't even hit the target unless you manage to make a straight line of a couple of meters between you and an enemy, they stuck at doorways; stuck at furniture; plus there is no areal damage. Doesn't matter where you aim-to the head or leg, you'll get the same result. There's no aiming (ironsights) btw and mostly no alternative attacks, so yeah, your right mouse button is pretty much useless most of the time, animation is very broken and again, it 'stutters', literally. Comparing to Clive Barker's Undying, this game simply seems poorly made in general.   Enemies. Mostly the same all the time, appear randomly. Ugly, bugged, move and attack too 'sharply', too 'fast' in terms of movements, there's no smoothness. Environment? Now i have no idea whose idea it was to make the castle somewhat random all the time, but it doesn't help at all. If it was supposed to make the gameplay somewhat new with every new game, this idea has failed hard. It pisses off much more than keeps you interested or entertained because with every new game there's just more randomness, annoying backtracking and mess in general cause you simply don't understand where to go and what to do since there's no map or hints of any kind. AI is horrible. I spent good 15 minutes trying to escort some old nag down the stairs cause the damn thing literally kept stopping at every corner saying the same damn thing.   Don't get me wrong, i absolutely LOVE old atmospheric games like Call of Cthulhu, Clive Barker's Undying, Cold Fear, Quake, Scratches, Penumbra, Dementium II, Gorky 17 etc, i freaking love them, the unique atmosphere they provide. I love all these old places, survival aspect etc, but this game is just broken beyond repair, it's terrible. It looks terrible and it plays terrible. One of those rare cases when a video game just plain straight ♥♥♥♥♥♥ me off.  I could keep on and on forever mentioning other broken aspects like an absolutely useless ability to pick up health packs even at full health, therefore wasting them - Dafuq?; the fact that they are all different sizes and there's absolutely no way to tell which will it be: small one, medium one or large one until you actually pick up one and see how much health it restores - Dafuq?!; or compass being useless in constantly changing environment; the timer that keeps ticking, oh the timer! If you didn't know, there are several family members that are being kept as hostages in an old mansion and if you don't save good half of them in like an hour and a half of REAL TIME the game ends. I read it on Wiki, since i was too sick of this game to actually test it out myself. Yeah, just like that, apparently it's called a storyline here. Needless to say how much this approach to a gameplay encourages players to explore the place rather than just run like crazy through the levels... Oh wait, that's what you gonna be doing; or the ability to reload your weapon even if it doesn't need reloading - DAFUQ?!?! No, really, even if your weapon is loaded, you can still reload it, therefore wasting ammo, i'm not joking... And the list keeps on going.   So, if you are feeling nostalgic, like i was, try Clive Barker's Undying or AvP 1999 for that instance, they are so much better than this broken crap. 3\\10 at best IMO. I fail to see what all the good reviews are about, people will just buy anything these days.  P.S. Oh, i remembered why i gave up on this game. Last time i tried to enjoy it, i got killed by an opening door. The horror, indeed.  P.S.S. Steam says i can't post a review until i spend 5 minutes in a reviewed game. Well, good, tell me how am i supposed to spend 5 minutes in a game that won't start from a library? I have to start it from an exe. file from a ♥♥♥♥♥♥♥ folder. Do i have to launch it and watch it crash for 5 minutes? The horror, the horror!!! C'mon man, DAFUQ?!",
            "review_score": "-1"
        },
        {
            "review_text": "Step 1: Download game Step 2: Get in game Step 3: Click New Game Step 4: Get Jumpscare in first minute Step 5: Scream like a little girl Step 6: Quit game",
            "review_score": "1"
        },
        {
            "review_text": "This game is really nice.Its old game but i really like it.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS ♥♥♥♥, ♥♥♥♥ THIS IT GAVE ME ANAL CANCER&lt;3",
            "review_score": "1"
        },
        {
            "review_text": "I Just Peed In My Pants ((( 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Me and my sister loved this game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Well the game really pulled me with music and making me question wether something is lurking or if its safe to go into a room. Having all these weapons to fights for specific monsters and the game even in the begining is unforgiving, its so wonderful! If its ever on special, it is a must grab.",
            "review_score": "1"
        },
        {
            "review_text": "Spooy",
            "review_score": "1"
        },
        {
            "review_text": "Really not fit to run on new hardware,not in the same league as any other games from that era or genre like clive barkers undying.won't run at any decent resolution,crashes,very basic gameplay,not as advanced as wolfenstien 3d which looks better and can be made to work at 1080p and never crashes,this game is sXXX",
            "review_score": "-1"
        },
        {
            "review_text": "  Jesus would be happy ",
            "review_score": "1"
        },
        {
            "review_text": "Played this game while sitting on the toilet, never have my bowels felt cleaner..",
            "review_score": "1"
        },
        {
            "review_text": "Old-school and fast-paced horror fun. I somehow completed it once. Very good, quite scary.",
            "review_score": "1"
        },
        {
            "review_text": "Its good game :)",
            "review_score": "1"
        },
        {
            "review_text": "-Get this game free- -Run Steam Idle Master to get cards- -want to see what the game is about- -looks at the screenshots- -say: I didn´t know this is a horror game!?!- -wrights this Review- -Done-",
            "review_score": "1"
        },
        {
            "review_text": "I don't get what all the reviews are about. Obviously terrible graphics which is to be expected, but then no resolution options besides a hack you need to install online. No saves whatsoever as you have to remember to quicksave or all progress is lost. There is no story, you just wander around a castle and try to find your family. There is no map and no indication for where people are, you just pick one of the 5 ways to go and then backtrack and go the other way till you find them. There are many gameplay problems. You pick up health even when you cant use it and it makes it wasted. You also can pick up ammo, even if you cant use it, again wasting it. You can only carry 15 bullets for your pistol which makes no sense. The combat is just terrible. You use your fists or a sword and just mash attack and sometimes it hits them and sometimes it doesn't due to the poor hitboxes. Sometimes while you're hitting you they can suddenly also attack you and sometimes that can't, showing the lack of any consistency in the system. And since each hit does like 20 damage and you will be fighting 2-3 guys in a row its just stupid. There are spawners that just keep popping out guys and the only way to destroy them is attack the portal, but you have to kill the guys or you die, but they keep coming. Its annoying and poorly done. Also the guys take 20 hits which makes combat tedious and long without reward. I get it that the game is trying to be survival horror, but I have played games that actually accomplish it and they don't need to make terrible combat and way too strong enemies and a lack of being able to hold ammo and wasting resources. You die so quickly and easily, but since you can't sneak or avoid people..... you just die, hope you saved, reload, and repeat. Apparently weapons can randomly be in spots so just based on luck you can have guns sooner or not, which is dumb. Also I was playing on medium, not even hard. I don't know if it's just for nostalgia's sake people rate this because they have fond memories from childhood, but like many old games there are dumb and poorly implemented and outdated mechanics. You also find a bunch of gunpowder and bullets but you can't do anything with them at that point of the game. Not to mention your family can die and you lose the game and there is nothing you can do but restart the game completely since you can't beat it. Having the built-in timer is annoying and further ruins the game because instead of being able to play the survival horror at your own pace, you have to run quickly or you lose. Always having to hurry and pay attention to the timer ruins the atmosphere. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Game stuck in bordered window. It's a piece of ♥♥♥♥ing ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Enjoyed it for 7 minutes. It's a pretty good game.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics from the early 90tys. Audio from the 80tys. Game play worse than than any Comodore 64 game. Unadvisable purchase, cards not withstanding.",
            "review_score": "-1"
        },
        {
            "review_text": "Sure this game would of been fun in 2003 but in 2016 its not very exciting, no jump scares, very weak storyline not much to keep you interested for a long period of time but . . . the trading cards are good definatly play it for the trading cards :)",
            "review_score": "-1"
        },
        {
            "review_text": "The game is really confusing and hard to get into. It combat is awkward and barely fun. The game is old which doesn't help it. It's story seemed to be good but the game is so confusing, I needed to use a walkthrough just to get through the beginning of the game than I decided to quit cause I hate when games force you to watch a walkthrough of a guy struggling just as much as you to figure out what to do.",
            "review_score": "-1"
        },
        {
            "review_text": "▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄  ████▌▄▌▄▐▐▌█████  ████▌▄▌▄▐▐▌▀████  ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀",
            "review_score": "-1"
        },
        {
            "review_text": "What a load of dribble.. I've played old games, and really appreciate games like XIII etc, but this is just horrid... no wonder this game was being given away. 1/10 for me",
            "review_score": "-1"
        },
        {
            "review_text": "one of the baddest game ive ever seen. no audio options, no video options, nothing. its very atmospheric, but the sounds are teribble and fckin loud, cause you cant turn down the volume, cause there arent any options.",
            "review_score": "-1"
        },
        {
            "review_text": "Old vampire horror shooter....If you don't mind playing an acient game its not bad.",
            "review_score": "1"
        },
        {
            "review_text": "Ver atmospheric and fun. It is also short enough to be played in one sitting without getting annoying or over-done.",
            "review_score": "1"
        },
        {
            "review_text": "ty for scaring the **** out of me 9.94743272/10",
            "review_score": "1"
        },
        {
            "review_text": "WARNING! When I started this game, the game had som kind of seizure. The whole screen was flickering and stuff, it was very far from playable. Luckily, here's a quick fix for that, aswell as resolution problems:  www.wsgfmedia.com/jackfuste/Nosferatu/DR/Nosferatu.7z  (Creds to RandalMcdaniel)  Allright, that issue aside it's not a bad game actually.  # Not that much enemy variety but enough to surprice you from time to time. The enemy types differ from eachother in pretty significant ways aswell. If it looks different, it's gonna act different, you're gonna have to deal with it differently.  # A little odd that an old game like this would have this long loading screens on a modern system. They're definetly bearable on the PC's of yesteryear but... I'm gonna let that speak for this buggy and pretty badly optimized game.   # The game has a randomly generated castle, but not as random as people might try and tell you. That said, you can't Ace this game by memory, but you might have constant hunches on where to go if you've played it before. Nevertheless it can get challenging so it's still a very appreciated feature.  # The game has really ugly graphics and not any options regarding it. As far as I know, it hasn't got a strong community behind it so I doubt there's any mods like Hi-res/HD texture packs or anything of the sort. And by the way, there's a really annoying noise-filter covering the screen which could really bother some people. Look at theese screenshots and know that Doom3 was actually released the following year.  # The game has a scarce ammo system so you won't be running and gunning. You're gonna want to make your shots count.  # It's oldschool without the 'regenerating health'-system or some modern 'oh-no-there's-a-monster-nearby-so-if-I-look-at-it-for-too-long-I'll-instantly-die-without-any-logical-explanation'-system like most horror games have. You're really gonna be stuck in situations where you are being kept on your toes scavenging for health, ammo and.. yeah.. survival - really hoping no god damn monster will show up and kill you.  It's far from the best game ever, but it's definetly more of an actual Game than your average slenderman/scp-ripoff counterpart you can get for free on the internet. So it boils down to this: Do you want a Game that's gonna last a few hours, or do you want an experience that's gonna last a few ten-fifteen minutes of collecting papers? Nosferatu is definetly a cheap-looking game and I'd recommend most people to get something like Amnesia or Outlast over it, but still, it's an oldschool game - with guns - you can kill the monsters - but's gonna be really hard if you crank up the difficulty, especially if you're low on health so you might aswell run for your life anyway.  This game has a nostalgic value to me and I'm therefore extremely pleased to have it. I bought this game the first time back in 2004-2005. The disc got lost. From time to time I've tried to get a new copy of it but no luck. Last year I found it on a website costing about 3€. Just about an hour ago I found it on steam for 2,24€ (Discs sucks nowadays and I like my games on one and the same platform. Steam rocks!)  Anyway...would I recommend you buying this? It's actually a very fun game. Oh, I'd advice you all to get this game on sale if it interrests you. Mainly because it runs and looks like crap and for the original 8.99€ pricetag I think you can get far better games. Then again, I posted a fix for the graphic seizure... and I've paid for this game three times by now.. xP  Cheers!",
            "review_score": "1"
        },
        {
            "review_text": "Honestly I feel this game has great jump scares even though you really expect them anyways, the semi-shakey first person camera adds to the horror and suspense feel and its great. Not to mention the great weapon mechanics when fighting with a sword or shooting a flintlock. Overall the total atmosphere and gameplay itself are great, a highly recommended game.",
            "review_score": "1"
        },
        {
            "review_text": "this game doesn't really seem to be that good, but what other game is there where you can shove a crucifex in a monster's face and yell 'THE POWER OF CHRIST COMPELS YOU' and it actually does something?",
            "review_score": "1"
        },
        {
            "review_text": "3spoopy5me  better than RE 6",
            "review_score": "1"
        },
        {
            "review_text": "Retro review time!!! If Bram Stoker`s Dracula had a baby with the Castlevania series during a roguelike honeymoon this would be it. Random castle areas full of classic European monsters, and all the tools from stakes and holy water to silver bullets and crosses to kill it. Also as a Romanian (the homeland of Dracula and vampires before they sparkled) I LOVE the atmosphere of this game. Save your family and banish the monsters forever, learn each of they`re weaknesses and exploit them. Grab your monster hunter hat and be the Van Hellsing of your family.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game for people that like good old games. not that difficult, not that long either. there are certain problems in the game like walking down stairs and sometimes you die when opening doors, your family members too and Buster ''the dog'' sometimes jumps off small bridges. i still recommend the game i give it 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I now know how to kill vampires, ghouls, spectrals and all other demonic creature. Still... a door thats being closed kills me :/",
            "review_score": "1"
        },
        {
            "review_text": "This game actually scared the poop out of me a little bit. It's an old school horror FPS/adventure/puzzle game and it's actually pretty good considering it's more than 10 years old now. Got this game for free and I am very pleased.",
            "review_score": "1"
        },
        {
            "review_text": "Wow! Its really good. I recommend this to anyone with a low end laptop because it runs great!",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game, the devs were heavilly influinced by ID soft's earley FPS work running on a 'wolflike' engin, play this get the nostalgia going, the gameplay itself is verry fun its a castle brawler, a verry suspenseful one at that creepy's waiting to scare the hell out of you from hidden places with well timed creeper music and decient combat mechanics, deffinatley made me unnerved a few times.",
            "review_score": "1"
        },
        {
            "review_text": "My real name is Malachi, so play my game. It's awesome. Not really, but play it.",
            "review_score": "1"
        },
        {
            "review_text": "Although obviously the older title, Wrath of Malachi comes off to me as 'Depths of Fear with Vampires.' That is to say, an indie horror-ish game with proceedurally generated levels, an actual story and endgame (in stark contrast to the endless parade of Slender clones and 'find the exit and get jumpscared' shovelware that makes up most proceedurally generated horror titles), slightly wonky physics, and lots of bugs.  There's not much to say beyond that with this one, as Nosferatu: The Wrath of Malachi is a very, very basic game with a very, very basic story. You play James Patterson, a very British man with a very British family of wealthy aristocrats who travel to a remote Romanian castle to see your sister wed to an enigmatic count. Said count turns out to be - to the surprise of no one who read that last sentence - a vampire, who intends to sacrifice your sister and the rest of your family in order to unleash the eponymous Malachi, who is in essence the vampire god and is sealed beneath the castle.  You arrive a day later than everyone else, and realize almost immediately (mostly because the narrator outright tells you) that something is seriously wrong. This is confirmed when your family's priest is thrown out a nearby window, at which point he quickly exposits to you the entire plot of the game (namely explore the castle and rescue your family) and if you could also find the family doctor before he bleeds out in the next half hour that would be swell.  From thereon the game is pretty straight forward: wander the castle, fighting jumpscare-enthusiast monsters in roughly every room, find family members and escort them back to the entrance so they can open up their luggage and give you some new gear (or just some ammunition or a unique single-use buff if they're jerks), rinse repeat. There are three wings to the castle, each with a boss or two intent on sacrificing one of your family members to Malachi.  However, said bosses are ♥♥♥♥-easy if you saved the priest. Or his acolyte. Or your brother. Or your lawyer. Because any of them allow access to the Ancient Grail, which is the most broken weapon in the game by far. It deals massive damage to any supernatural target besides the Count (INCLUDING the vampire god final boss!), killing even the toughest targets in two or three splashes. The only non-boss enemies immune to the grail are dogs and gypsies, the two weakest enemy types in the game. It attempts to balance out by only holding five splashes worth of holy water, but given that you can bless any source of water in the game with your crucifix, it becomes the only ranged weapon in the game with infinitely renewable ammo.  The game has a few growing pains in the beginning between the rushed exposition of the opening which makes you figure out the mechanics on the fly, but once you get into the swing of things it becomes a fairly enjoyable experience, and an absolute breeze when you get your grandfather's machine gun two thirds of the way through. It's also not without its bugs, including fairly awful physics that can lead to you randomly bouncing off of any slope you walk over and the occasional random death caused by some sort of glitch when stepping through a doorway, but it's playable enough if you can work past those issues.  All in all I found it quite a bit of fun, nothing spectacular but I bought it with the loose change in my Steam wallet for like a buck, so I'm not exactly demanding a game changer. Maybe wait until it's on sale but it's plenty worth the cost of a soda to keep you entertained for a few hours.",
            "review_score": "1"
        },
        {
            "review_text": "Cons first :  1. Horrible Resolution support had to google for about 20 minutes to find the right fix.  2. Steam doesnt run it as admin by default, causes a ton of issues.  3. Sometimes runs but doesnt drop cards in the meantime.  4. Tries to fight with stuff on my PC (I have idea what) causing frequent freeze ups for 0.5 sec per 5-6 mins.  5. Poor hit detection and too much of phasing through stuff. Bad animations. Horrible AI.  6. More laughable than horrifying. Only thing that spooks me in this game is the horrible character movement and hit detection.  7. Enemy spawns are extremely random and different for every game yet VERY predictable.  8. Game switches to windowed mode everytime till you use another Fix from the internet.  9. Mediocre storyline.  Pros :   1. Game is pretty DECENT for the time it was released.  2. Crappy Animations are still better than Guise of the Wolf The Game Animations, and that was a 2014 game.  3. Great weapon, cross, holywater concept.  4. Great level designs for the time of the game.  5. PERFECT atmosphere. The dark has the right amount of lighting for the right place.  6. Is kind of like Blood II but a bit better than that game.  5/10, Generic - Buy during a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a great game but it isn't a bad one either. It's just a simple shooter with a random environment and enemies. In the end I got so frustrated playing this game on medium that I played it on easy so I could just finish it. It isn't very long but you can buy the game for a buck and change. There isn't much to say about the game honestly. It has little to no story although there are some jump scares from the enemies. I don't enjoy games that have time constraints that are tedious and map designs that are just plain strange. I'm glad its over with so I can play something else.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. The graphics are kind of a turn off, but still scary. It will keep you on the edge of your seat.",
            "review_score": "1"
        },
        {
            "review_text": "This is my nightmare, my nemesis.. this is the game for lonely drunk nights, where you barely see the screen and just want to dumm yourself down even more into a different world. I challenge you to dring a bottle of whiskey thru it. Your butt will be gangraped by those low polygon stereotypical monsters such as goblin.. goblin who shoots, a vampire.. dog.. the dog actualy scared the sh*t out of me in that hallway.. it didn't make any sound and then it was just there out of the darkness.. of which this game is full. The hit detection.. well.. i don't know.. you need to be drunk to like this kind of stuff I guess. I enjoyed it.. I payd 60euro for good games and I pay 1.60 for a poor one.. but this one.. this will stay in my collection like that strange only philosophycal book in my library to which I will come back when I feel like I need to remind my self of the purpose of the life in the most abstract way possible. I'd say Schopenhauer would agree with me on this one..",
            "review_score": "1"
        },
        {
            "review_text": "An 'old school' style horror game. This is fun, and you can find it for pretty cheap so I'd recommend it! Fun for people who don't care about graphics!",
            "review_score": "1"
        },
        {
            "review_text": "8/10 cant stop screaming '-'",
            "review_score": "1"
        },
        {
            "review_text": "Very Top Nice. Good Buy",
            "review_score": "1"
        },
        {
            "review_text": "Y'know those old skool b-movie horror or spaghetti westerns? This game is the same kind of bad, just so bad you find yourself smirking with just how *bad* the game is. I had this werewolf (?) attempting to lunge at me behind a bridge, and its animation would play, and then whip right back to its original posistion, making for a hilarious effect. Oh, and random deaths were hilarious. For cheap, I recommend, anything more then that isn't.",
            "review_score": "1"
        },
        {
            "review_text": "Well the game really pulled me with music and making me question wether something is lurking or if its safe to go into a room. Having all these weapons to fights for specific monsters and the game even in the begining is unforgiving, its so wonderful! If its ever on special, it is a must grab.",
            "review_score": "1"
        },
        {
            "review_text": "Old school all the way.",
            "review_score": "1"
        },
        {
            "review_text": "What a game!. I wish there were more games like this one.",
            "review_score": "1"
        },
        {
            "review_text": "When I got this game I enjoyed it all of three hours just messing around. Now it will not load and I have waited weeks on answers from the makers. Nothing has changed during this time and I've deleted it and redownloaded it fresh. Was cool for the short while I got to spend on it. I would reccomend it for the nostalgia and for vampire lovers. Maybe it will work for you.",
            "review_score": "1"
        },
        {
            "review_text": "Horror fans, this game is a wonderful addition to your survival game library you may have. Otherwise, if you're looking a top quality graphics, fully responsive NPCs that follow you to the end and no time limits, this game isn't for you.  First person view, a survival against vampires and demons, stamina to manage, a library of good old fashion vampire killer tools; stakes, crucifix, silver cane blade, holy water with good old fashion black powder guns, a colt and a mighty machine gun from the beginning of the 20th century. Here's your arsenal! Now go and hurry to save your family before midnight or they'll begin to die! Rebecca, your sister, needs you or she'll be sacrificed by the count!  There's no intern display resolution changes, so you'll have to deal with the graphics of 2003. But the gameplays is entirely worth it! You like challenge? If so, then buy this game and go impale vampires directly in their coffins before they rise! Beware of surprises...",
            "review_score": "1"
        },
        {
            "review_text": "  it was too spoky 4 me",
            "review_score": "1"
        }
    ]
}