{
    "app_id": 283370,
    "name": "Marine Sharpshooter II: Jungle Warfare",
    "release_date": "2014-04-03",
    "developer": [
        "Jarhead Games"
    ],
    "publisher": [
        "Funbox Media Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "Sniper"
    ],
    "achievements": 0,
    "positive_ratings": 171,
    "negative_ratings": 364,
    "price": 2.09,
    "description": "In this follow-up to the hit Marine Sharpshooter, you'll be a lone operative fighting to restore democracy in an African country. The President of Burundi has been taken hostage by rebels and mercenaries.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/283370/header.jpg?t=1530529920",
    "minimum_requirements": "OS: Windows 98/ME/2000/XP/7/8 Memory: 128 MB RAM Graphics: 32 MB DirectX 9.0 compatible video card with Hardware Transform and Lighting Sound Card: 16bit DirectX 9.0 compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Absolute rubbish in every sense of the word. Where do I even start. Budget shooter from 10 years ago plays even worse than it sounds. Graphics are from 1999, not 2004 when it was released. You use the exact same bolt action sniper, pistol, and knife the whole game. Cannot pick up other weapons. The levels are super linear and look terrible. Bushes in the jungle block bullets and you can't move through them, basically making them blocks which makes no sense for a game called 'jungle warfare' Enemies just run forward blindly or stand around while their teamates get shot. On the other end of the spectrum they always know where you are so if you try and sneak it basically will never work. Ammo is not picked up off bodies but in certain specific spots the developers chose. You face ridiculously high amounts of enemies each part where you just headshot them from far away, sometimes which doesn't kill them even though it hits them in the head. I got to a basically unbeatable sand level where all the problems of the game came together. The level is super linear and you cannot go through buildings or open doors. The stealth does not work. The game tells you to stay away from the streeets but there are enemies standing on it and you cannot go any other way but the linear way. When you shoot 1 guy 10 guys come. After having killed around 60-80 guys I just ran out of ammo on my main gun and pistol, and since the developers have no tents or buildings you could find ammo in since it wasn't on the street I just lost. My mo-ron teamate also didn't help, as he died one of the times I made it past the guys. Your teamate is worthless. He runs out into the open, never kills anyone (mostly because his sniper does absolutely no damage for some reason) he will not follow you sometimes. He also will stand there and take a ton of damage and then not use his medkits even though he needs to, for some unexplicable reason. The only redeamable features I can put is that this is in fact technically 'a game' and that fun is too be had whenever your spotter partner says to sneak around or not engage with a group/area, and I just fire away and slaughter them all as if to say 'fuuuck you' to my mo-ron AI teamate. That was the only fun I had. This game has negative reviews for a reason, trust them. 3.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥♥ SPACEBAR TAKES SCREENSHOT!",
            "review_score": "-1"
        },
        {
            "review_text": "The worst game i ever played in a long time",
            "review_score": "-1"
        },
        {
            "review_text": "Well it's still better then the Call of Duty franchise.",
            "review_score": "1"
        },
        {
            "review_text": "Uriel's Chasm in First Person.",
            "review_score": "-1"
        },
        {
            "review_text": "Saw this game on indie gala Thought it had trading cards so i install Sees it has no cards Quits Game changed the resolution of my screen Go to control panel and fix it 8/8 would go to control panel again",
            "review_score": "1"
        },
        {
            "review_text": "The graphics are simply horrible, and I have to put up with getting a screenshot everytime I hit space.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I really like this game, for sure: no crosshair on sniper rifles when aiming, random guys jumping in the wall, and still enjoying!!! 0/0 IGN Buano Notte! EDIT: after restarting my PC, I finally have a crosshair on my sniper rifle! But, sadly, it doesn't change the fact that the game is boring, and I forgot to mention that if you jump, you take a screenshot via Steam o.O What the hell, I don't even ask...",
            "review_score": "-1"
        },
        {
            "review_text": "What the hell is this game? Who approved of this games design? I have seen better, in fact way better. I'm glad I got this for free. I would highly recommend you save yourself the trouble of playing this trash, and avoid it entirely.  1/10 EPIC FAIL!",
            "review_score": "-1"
        },
        {
            "review_text": "10/10  Would noscope again. The story is very inspiring. IT made me wet. Even tho i kinda cried at the last moments, but we noscoped together &lt;3.",
            "review_score": "1"
        },
        {
            "review_text": "Quickscoped out of some colours",
            "review_score": "1"
        },
        {
            "review_text": "One of the very worst first person shooters I've ever played... Booted it up, friendly NPC told me to stay low and wait for the patroul to pass, I charged them, shot them down and had to wait for the hardcoded NPC to get back off and start sneaking. NO GUYS JUST NO!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is really boring and poorly made. Graphics are bad, variety of weapons is extremely limited, enemy AI is stupid, level design is repetitive and linear, and voice acting is god awful. Maybe in 2003's standards this would have been about a 5/10, but today it is about a 2/10. The only good thing I can say about this game is that I did have some fun in shooting everyone when Cooper told me not to, but apart from that, there is very little fun to be had, and a lot of time to be wasted.",
            "review_score": "-1"
        },
        {
            "review_text": "GAME IS BROKEN AS ♥♥♥♥ !! not because it's old or the graphic but the mechanic, sound and the AI...need to be fixed. ▂▃▅▇█  final judgement : 10/100  █▇▅▃▂ ....................../´¯/)  ....................,/¯../  .................../..../  ............./´¯/'...'/´¯¯`·¸  ........../'/.../..../......./¨¯\\  ........('(...´...´.... ¯~/'...')  .........\\.................'...../  ..........''...\\.......... _.·´  ............\\..............(  ..............\\.............\\...",
            "review_score": "-1"
        },
        {
            "review_text": "I found a way to fall off the level and die within 8 minutes and my sniper rifle can't pierce a leaf, great game!",
            "review_score": "1"
        },
        {
            "review_text": "The most dank shooter you'll ever see. RETURNING FIRE!",
            "review_score": "1"
        },
        {
            "review_text": "What in the ♥♥♥♥ is this ♥♥♥♥? This is the worst game on steam",
            "review_score": "-1"
        },
        {
            "review_text": "Run,hide,find cover,aim and shoot right through the enemy's brain, the guy next to him is soo dead before he even knows what happend to his comrade. Its that easy and fun. Always kill the first and second patrol. don't ask why :P. you will like that scope xD. Sound track is brilliant. graphics are kept simple but you will experience a intense gameplay. you love it when you play it. Definitely worth having in your library.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is so bad that it would be good enough to go on one of the Angry Nerd's videos",
            "review_score": "-1"
        },
        {
            "review_text": "Just horrible, bad graphics, messes up your pc resolution, a complete mess.",
            "review_score": "-1"
        },
        {
            "review_text": "Despite all the negative reviews, I decided to go ahead and buy this game. I mean, 'Marine Sharpshooter'? That sounds like my kind of game!  I don't know why everyone is complaining about it. I personally loved every second of the mission where you uninstall it and hide it from your library.  So if you love uninstalling games, I highly recommend this one!",
            "review_score": "1"
        },
        {
            "review_text": "World War I &lt; World War II &lt; This game",
            "review_score": "-1"
        },
        {
            "review_text": "Best game 2k16. I recommend for every people who like good gaem.",
            "review_score": "1"
        },
        {
            "review_text": "sorry but this game soooooo bad.Did they really think actually possible sell this game ?.This is look like 3 grade college student project",
            "review_score": "-1"
        },
        {
            "review_text": "12/10 would take screens with spacebar again",
            "review_score": "-1"
        },
        {
            "review_text": "Worst Game Ever like from my character im new game player not like 1985 games but i like 2015 games more so yeah",
            "review_score": "-1"
        },
        {
            "review_text": "Screenshot Simulator 2004  Also - A game from 2004 auctually found a way to look worse than Half-Life 1. Bravo.  IGN 10/10  ",
            "review_score": "-1"
        },
        {
            "review_text": "Please don't waste your money              No seriously don't",
            "review_score": "-1"
        },
        {
            "review_text": "1/10 Best game ive ever played -IGN",
            "review_score": "-1"
        }
    ]
}