{
    "app_id": 283330,
    "name": "Desert Thunder",
    "release_date": "2014-03-19",
    "developer": [
        "Brainbox Games",
        "Hip Games"
    ],
    "publisher": [
        "Funbox Media Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Tanks"
    ],
    "achievements": 0,
    "positive_ratings": 80,
    "negative_ratings": 139,
    "price": 2.09,
    "description": "Desert Thunder is an arcade-style action tank game for the PC. Ripped from today’s headlines, the storyline immerses players into the heat of a desert-based military conflict. Players will tear through desert, urban and industrial settings in their experimental battle engine, the Abrams M1A6 Advanced tank that’s loaded with awe-inspiring...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/283330/header.jpg?t=1556110722",
    "minimum_requirements": "OS: Windows 98/ME/2000/XP Processor: Pentium III/750 MHz Memory: 128 MB RAM Graphics: 32 MB DirectX 8 compatible video accelerator",
    "recommended_requirements": "OS: Windows 98/ME/2000/XP Processor: PIII/1.4 GHz Memory: 256 MB RAM Graphics: 64 MB DirectX 8 compatible video accelerator",
    "reviews": [
        {
            "review_text": "It is ♥♥♥♥ and short",
            "review_score": "-1"
        },
        {
            "review_text": "   M1A6 Tank Simulator...back in the 2000s.",
            "review_score": "-1"
        },
        {
            "review_text": "it ripped off ut2004 sounds  why couldn't it rip off any of the good stuff in ut2004  like, say, fun",
            "review_score": "-1"
        },
        {
            "review_text": "Older graphics but still not horrible on the eyes that games that just aren't made properly are. Controls are fine and I am not even a person that likes drive vehicles in games. In regards to AI well if you sit around in range the tanks will hit you and as for the guys firing off rocket launchers they mean business. They are accurate with their shots. Oh and when you hit the enemy their deaths are rewarding despite the older graphics. The soundtrack to me totally fits the game and is a plus. The destructable environment is nice and hey if you hit a landmine you are going to feel in terms of being damaged. I think this game is a nice game to have in my library as it straight up gives me something different from other games I have. I think this would be a nice addition to others gaming libraries too. Now as for what I would pay for it well I think it is all up to the person and quite frankly I don't want to put a price on the fun I had. I can say yes I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Glad I got it for free! 8.99$ is wayyy to much! Really bad game! Menu works hardly at all... I dont know what to say more... I dont find any positive things about this game...",
            "review_score": "-1"
        },
        {
            "review_text": "12312412414",
            "review_score": "1"
        },
        {
            "review_text": "Seeing as you all know I'm a large fan of the great game Desert Gunner (which I also made a review about, go check that out and buy the game it's amazing), I am also a huge fan of Desert Thunder. Although this game has quite some age, being released in late 2003, it is a very HIGH QUALITY game. It consists of high intensity, strategy, and lots of patience. This game should only be tacked by the top of the line gamers. If you're not a huge gamer, don't even worry! I'd still recommend purchasing this wonderful game. Overall, this is one of my favorite games, tied with Desert Gunner (which if you don't already own, you should purchase as well). Seeing as the price is right for only $9.99, I encourage all steam users to purchase this game. If I had to rate this game out of 10, I would give it a rating of atleast 10, if not beyond such as an 11 or 12. It is very exciting and gets you wanting to play for hours on end. This game is very addicting and great to play amongst your family and friends when together. Although it isn't multiplayer, it is a great way to have fun with friends whether you are with eachother in real life, over the phone, or on an online chatting mechanism such as Skype or Teamspeak. Once again I highly encourage all steam users to purchase this game. The graphics are great, the controls are on point, and the fun is non-stop.   Hurry! Don't wait, you never know when prices might go up. And if you already haven't checked out my Desert Gunner review, please do so.   Great development from BrainBox Games. Well planned out. Much better than many games which have recently been published and released.",
            "review_score": "1"
        },
        {
            "review_text": "In Desert Thunder, you are controlling a tank and are the last line of defense to save a country from terrorists. The story is very cliché with no redeeming qualities.   Let’s jump straight into the problems:  The menu. The mouse is sporadic and gets “stuck” on random parts of the screen. I’ve never seen anything like this in a game before. There’s no way this wasn’t noticed before releasing.   The controls. The tank has sluggish controls with an annoyingly huge turning radius. Going in reverse while turning doesn’t reverse the controls (like backing up a car) so you have to unnaturally keep holding the direction you want to go while backing up. Also, the turret DOES NOT turn 360 degrees. What kind of experimental tank design is that? It really hinders the ability to shoot enemies.   The gameplay. It’s terrible. There are 8 missions total.  Two … Two  of which are 20 minute forced defense missions where you go around in the same loop shooting the same guys until the timer runs out. The other missions have you driving through the desert shooting tanks and people until you reach the end. After the first mission I realized you didn’t even need to shoot anything that doesn’t immediately block your path. Just keep driving until you reach the end, that’s it. The gameplay is also extremely repetitive. Play the first level, you’ve played them all. Same enemies, same tanks.   The game tries to mix it up adding power-ups along the way to your machine gun and turret. They do adjust the damage of your gun, but I never bothered to get them after initially trying them out. The terrible tank controls combined with the small hitbox for the power-ups just leads to frustration. Hitting enemies with your regular gun does just fine.   The AI. It’s bad. Sometimes they’ll notice you, sometimes you have to hit them first until they engage you. Even the final boss tank is laughably easy. Funny enough, the hardest enemy in the game are the mines! They are generally hard to see and deal a ton of damage. Watch out for those :)    Pros  +Short (trust me, this is good) +Voice acting isn’t terrible +Bullet drop gives some strategy to the game   Cons  +Glitchy mouse in menu +Bad controls +Terrible gameplay +Two 20 minute forced levels out of 8 total levels +Repetitive enemies and level design +Bad AI +Cliché and empty story  Probably the worst offense this game has is the price. The current $9.99 price is insane. Stay away from this game. If you must have it, wait for it in a bundle or free giveaway.    2/10  Very poor",
            "review_score": "-1"
        }
    ]
}