{
    "app_id": 283350,
    "name": "Eurofighter Typhoon",
    "release_date": "2014-05-02",
    "developer": [
        "Rage Software"
    ],
    "publisher": [
        "Funbox Media Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Flight",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 46,
    "negative_ratings": 148,
    "price": 2.09,
    "description": "In Eurofighter Typhoon, you are flying the famous Eurofighter on top of Iceland to fight against Russian troops which invade the country and prevent the outbreak of World War III. Quickly outnumbered, the ICEFOR has been abandoned by NATO but has been able to deploy a small number of the new Typhoon aircraft.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/283350/header.jpg?t=1530529888",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: P 226 or Better Memory: 64 MB RAM Graphics: 8 MB Graphics Card or Better",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It is not so bad, but I can't recommend it.  The campaign mechanics is very interesting, you control a group of 6 pilots in Iceland during a Russian Invasion (Tom Clancy Style), you can choose a pilot to control and you can change to other pilot at any moment, this is useful because there are simultaneous missions, this can be overwhelming at first but is simple.   The campaign is huge apparently, I played more than 5 hours and I cant see the end of this, the campaign is in real time starting a 8:30 hrs on day 1. and you can speed up the time 10x, I have played the equivalent to 16 hours in game time.  The graphics remembered me Ace Combat 3 Electrosphere. The gameplay is a little complicated in my opinion even after reading the manual, the success rate of the guided missiles is low even against non-moving targets, is possible to control the fighter with the mouse but I think this is too unconvenient in the dogfight, in addition you dont have ruddle control.  It works perfectly on windows 8.1 64x  In conclusion, a very interesting concept but not a very functional implementation.",
            "review_score": "-1"
        },
        {
            "review_text": "Awful, Just awful. A completely worthless game.",
            "review_score": "-1"
        },
        {
            "review_text": "i killed everyone on accident i hate the chef smug ♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "I like it. When you have got the manual, the game it's very interesting and realist. I recommend the game.",
            "review_score": "1"
        },
        {
            "review_text": "Got it to work for a few hours of gameplay. Now it crashes everytime at the same point in game Day 2 00:38hrs. Tried getting in touch with Support, no help so far (Would be happy to change my review once this gets fixed) Love this game and wish there was something like it, just can't play it anymore thanks to the game crashing.  *Update* Got in contact with someone directly. Downloaded DRM version and works fine. Probably an error due to not being able to launch from steam and having to edit the registry for the game. Hoping a fix comes along in the future for other to enjoy this awesome but very old game.",
            "review_score": "1"
        },
        {
            "review_text": "Tell me.What's this? Map? Mod? shenmegui!!",
            "review_score": "-1"
        },
        {
            "review_text": "You need a very old computer for this game",
            "review_score": "-1"
        },
        {
            "review_text": "Very bad quality + you cannot see what you have to do. I do not recommend buying this , this is not worth your money!",
            "review_score": "-1"
        }
    ]
}