{
    "app_id": 283430,
    "name": "Litil Divil",
    "release_date": "2014-03-19",
    "developer": [
        "Gremlin Interactive"
    ],
    "publisher": [
        "Funbox Media Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Retro"
    ],
    "achievements": 0,
    "positive_ratings": 201,
    "negative_ratings": 229,
    "price": 2.09,
    "description": "Welcome to the Underworld, where you guide Mutt, the bad luck Litil Divil, through the Labyrinth of Chaos to retrieve the Mystical Pizza of Plenty. Our “hero” takes a fateful step through the Mortal Portal to prowl five hellish levels of treacherous tunnels with more than 50 raucous rooms of gameplay.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/283430/header.jpg?t=1530529917",
    "minimum_requirements": "OS: Windows XP/Vista/7/8 Processor: 1.8 GHz Processor Memory: 512 MB RAM Graphics: 3D graphics card compatible with DirectX 7",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A well made labyrinth game. I Remember seeing my neighbor playing this game in 1999 (Game was released 1993)! The game is a huge challenge. The entire game you will be running in this maze collecting utilities along the way and dodging traps. Objective to the game is to retrieve the Mystical Pizza of Plenty, but you must find out the riddles to all of the doors which makes this game hard. Each riddle will be fustrating and you will end up dieing and dieing but thats what makes the game challenging. Each room has a unique level/puzzle feel. Game can be beatin anywhere from 3 hours to 15hours.  Pros Challenging game More than 40 rooms when afk you day dream (funny) Animations are pretty good for its time   Cons Controls you must figure out yourself No controller support  ",
            "review_score": "1"
        },
        {
            "review_text": "It's just... bad. I grew up in the age of DOS games, and I wouldn't have played this as a child, either. After ragequitting twice, I discovered the following:  Direction controls: Arrow keys or 2,4,6,8 on the numeric keypad. Fire buttons: Z and X.  It fails to mention that you need to press the direction you want to attack, to attack, but with the poor controls aside, the playability is low. The labyrinth is hard to navigate and the visibility of traps is poor. There may be a lot of nostalgia for people with this game... but I'll never play it again.",
            "review_score": "-1"
        },
        {
            "review_text": "Not bad... Awesome Old-School game :D  But when you play this game... it's really weird. 7.5/10!",
            "review_score": "1"
        },
        {
            "review_text": "Let me explain the first minute of gameplay as my review.  I was a red devil standing beside a drawbridge who was summersaulting towards a green orc with a club.  If this is sounds like a '...' situation to you, get this game.",
            "review_score": "1"
        },
        {
            "review_text": "Some quality control on Steams part would be nice.  Feels like one of the worst MAME32 games. Not worth a single cent.",
            "review_score": "-1"
        },
        {
            "review_text": "Unplayable. No info on how to play, cannot even start. Sucks!",
            "review_score": "-1"
        },
        {
            "review_text": "Best game ever, tho i can't figure out what todo 1337/10",
            "review_score": "1"
        },
        {
            "review_text": "According to my Steam client's recommendations, this game is similar to 'Grand Theft Auto V'. I don't.",
            "review_score": "-1"
        },
        {
            "review_text": "Boo! This was a fav of mine back in the Amiga days so why release a classic in less than its original state? I can let the graphics not being updated but the controller support... well... It sucks. I think I saw mention from another reviewer on this issue. Sure I could use the keyboard but I want to use my controller just like I did when I played it all those years ago. The problem is I am running a Windows 7 system and whoever released this did so by using the floppy disc PC version released after the Amiga version and use DOSBOX emulator to try and pull this off with minimal effort on their part. I feel like the Amiga CD32 version had some issues but I played it pretty far using a controller. I then bought the PC version a few years later. Then this is released on Steam and by now everything must be working if not improved because decades have passed. Not. Would have loved to say thumbs up and worth the memory. Nice try. I just think its clear that the fans would be the first do come and check it out and... Well... It is what it is.",
            "review_score": "-1"
        },
        {
            "review_text": "Release Date: 1 Jan, 1993",
            "review_score": "-1"
        },
        {
            "review_text": "Plenty of old games are really good. But this one is just not worth it in my opinion. Got it free but don't feel like putting the effort to play it. It looks cute but no fun.   -0/10",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to start this at least 10 times, I can't manage to run it. The DOS Box won't display the game correctly (big black bar at the bottom, top of screen isn't visible) and I can't do anything accept of moving the guy. I read that I'm not the only one with this problem, didn't find a solution though.",
            "review_score": "-1"
        },
        {
            "review_text": "I have not played very much, this is what I think for now  ok lets go straight to the point this is an adventure game, the gameplay is a maze with a bunch of minigames  +Its creepy and disturbing -easy to get lost, and I know it is a maze anyways still being not a good thing for the game -your life bar is used for many different ways, Its weird  -musics are too cute for such a game -the hud is extremely HUGE, it gets old in minutes  7/10",
            "review_score": "1"
        },
        {
            "review_text": "  When Publishers Just Want A Quick Buck...",
            "review_score": "-1"
        }
    ]
}