{
    "app_id": 283660,
    "name": "Rabbit Hole 3D: Steam Edition",
    "release_date": "2014-04-25",
    "developer": [
        "Somi"
    ],
    "publisher": [
        "Zero Rock Entertainment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Action"
    ],
    "achievements": 18,
    "positive_ratings": 199,
    "negative_ratings": 118,
    "price": 2.09,
    "description": "Rabbit Hole 3D: Steam Edition is a minimalistic retro puzzle game. The game features 3D word puzzles based on Chapter 1 of Alice in Wonderland by Lewis Carroll. Players must navigate through keywords from the book’s initial chapter.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/283660/header.jpg?t=1528763993",
    "minimum_requirements": "OS: Windows XP Processor: 2 GHZ or higher Memory: 256 MB RAM DirectX: Version 9.0c Storage: 65 MB available space Sound Card: DirectSound compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Like The Collider, but with the slight twist of needing to slip through the letters needed to spell Rabbit Hole thorugh a short story about Alice and the rabbit... there are a couple more twists, literally, that increase the tension of this runner.  on sale for 74c US and I played it for like 7-8 hours straight...  8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game to pick up if the price is right. Many setbacks though, this game was one the most difficult to get all of the achievements on I've ever attempted.  Pros:  Tells a semi-interesting story Decent visuals Cheap Trading cards and achievements (100% is possible with a lot of practice) No lag, glitches, or bugs noticed   Cons:  Huge learning curve Creepy voice over Repetitive 3D effect, flashing, and spinning may cause headaches/dizziness if played for a long period of time Extremely challenging   I recommend this game if you are a decently skilled gamer and are not phased by motion sickness.",
            "review_score": "1"
        },
        {
            "review_text": "I was concerned that this game was going to suck because of the MIXED reveiws it has.But I was suprised just by how good the game truly is! Its a fun little game. I bought it with a coupon that I got and there is no sence in wasting it.So I used it and it was much much worth it. I give thi game a 7.8/10 rating.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed playing this game. It is an easy simple game, and I had fun playing it.",
            "review_score": "1"
        },
        {
            "review_text": "meh. I was expecting too much of this game, even though I purchased it for less than a dollar. The reading: it's depressing, and not the good kind. I won't hold my personal feelings against it, though; the game plays okay.",
            "review_score": "1"
        },
        {
            "review_text": "If Super Hexagon was 3D, it would be this.",
            "review_score": "1"
        },
        {
            "review_text": "i got this for free. and it was awsome!",
            "review_score": "1"
        },
        {
            "review_text": "Oddly fun to play, however music and commentary can get annoying so just play your own music and mute the game.   Also does lack some kind of reward other than trying to get all the letters but is still rather fun and entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "Dunno why all the hate, sure there could be more control options, and the music could have been better, but it's not that bad of a game, and there are always trading cards to get :D",
            "review_score": "1"
        },
        {
            "review_text": "Here is a game that will test you. It brings a wonderful way to see the story of 'Alice in Wonderland'. It's challenging, but fun. The game has you flying through the words of the story. you can ether play the game by Stages or go for broke and try to play the whole thing. Playing the whole game is the better way. give this game a try, and see how 'Alice in Wonderland' can be so much fun!",
            "review_score": "1"
        },
        {
            "review_text": "I've only played it for a few minutes, but already dislike it. Truth be told, I didn't know what to expect, I likely got the game in a bundle somewhere.  The idea of this game isn't bad, but the graphics are coarse and unrefined, the music and speech is OK.  However, what annoys me most is that the 'tutorial' does NOT introduce you to the game. In the game, you move constantly. In the tutorial, you only move after you confirm having set the block (representing Alice apparently).  Quite a difference, especially since the game didn't seem it necessary to inform me of this.",
            "review_score": "-1"
        },
        {
            "review_text": "Sluggish unintuitive controls, with repetitive music.",
            "review_score": "-1"
        },
        {
            "review_text": "★ ★ ☆ ☆ ☆",
            "review_score": "1"
        },
        {
            "review_text": "I wish I had a rabbit in a hat with a bat And a six four Impala   ",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS THE PINNACLE OF STEAM. PRAISE ALICE AND THE RABBITS HOLE.",
            "review_score": "1"
        }
    ]
}