{
    "app_id": 283680,
    "name": "Astebreed: Definitive Edition",
    "release_date": "2014-05-30",
    "developer": [
        "Edelweiss"
    ],
    "publisher": [
        "AGM PLAYISM"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Anime",
        "Mechs",
        "Shoot 'Em Up"
    ],
    "achievements": 40,
    "positive_ratings": 1104,
    "negative_ratings": 129,
    "price": 15.49,
    "description": "Climb into the cockpit of an otherworldly war machine and fly into battle against a horrifying alien race bent on eradicating humanity to preserve their own civilization.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/283680/header.jpg?t=1553249065",
    "minimum_requirements": "最低: OS: Windows XP/Vista/7/8 プロセッサー: Core 2 Duo or faster グラフィック: Shader Model 3.0 compatible, GeForce 8600GT (2007 model) or better DirectX: Version 9.0 追記事項: Controller recommended",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I want to make love to this game. It successfully combines the hot awesome lock-on of Panzer Dragoon with the mega fast mech shooter action of some other game I can't think of right now.  You're in this suit and all these Japanese anime characters start telling you about how dire everything is but that's okay because you can kill your enemies with ten million bullets. The graphics are smoking hot sexy goodness, the likes of which is seldom seen in a Japanese hybrid-genre shooter on the PC.  The game's controls give you the chance to slide and glide like one of those ♥♥♥♥♥♥♥s from GunValkyrie but there's no reason to blister your thumbs in the process.   If you're like me and want to be the hero without having to endure the tough as nails nature of most shooters, give Astebreed a try.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic refinement and expansion of what Edelweiss started in their fun but flawed Ether Vapor. Astebreed is mechanically solid, easy to read and a joy to play for shmup fans. For newcomers to the genre Astebreed can work as a fantastic introduction. The game features a fantastic prologue chapter that functions as an in-game tutorial. There is also a gallery that demonstrates the various abilities and how to execute them with video and interactive tutorial segments. Finally the difficulty levels are well scaled, providing challenge and fun to all skill levels.   Once you learn the mechanics and beat the game it doesn't stop there. Astebreed features deep and rewarding scoring mechanics on top of all the other great features, so if you enjoy score chasing and leaderboards there is a lot of meat here.  Finally the presentation is about as flawless as you could ask for in this type of game. The anime stylings perfectly capture the feel of 80s and 90s mecha and space opera anime, much like Ether Vapor before it. The music, audio and visuals in game are top notch. This game is a tour de force for shmup fans and a triumph for Edelweiss' particular design concepts.",
            "review_score": "1"
        },
        {
            "review_text": "Not your typical bullet dodging shmup title. You have an hp bar that regenerates so it's not going to ♥♥♥♥ on you for the smallest little mistake. Also you have a sword option to quickly dispatch enemies, and 4 different shot types simultaneously.  Increased firepower comes with way more enemies than I expect from even this genre--entering shooting and exiting the screen far more rapidly than I expected. The dynamic camera and directions you fly through each level make this game feel way more immersive than being trapped in the same one flat plane for an entire level (just about every shmup ever).  Crimzon Clover sets the high bar for shmups on steam but this is a worthy contender and completely worth trying out if you're a fan of these games.",
            "review_score": "1"
        },
        {
            "review_text": "English (US) One of the best bullet hell shooters I've ever played, rich mechanics, nice 3d visuals, a rare thing in side scrollers shooters.  PROS: - Nice graphics - Really good combat mechanics, you can shoot, shoot with dispersion, bomb, and cut with a hurge sword, each of them can cancel a enemy type of attack - Bosses are well made, with good stratefy - 2 types of mecha  CONS: Small, only 6 stages :(   Portugues (Brasil) Um dos melhores bullet hell que joguei, mecânica rica, gráficos excelentes em 3d, coisa rara em bullet hells, que geralmente são 2d.  PROS: - Gráficos excelentes pro tipo de jogo - Jogabilidade muito boa, com riqueza de interatividade, pode cortar com espada, atirar, atirar com dispersão, e bombar a tela, e cada um consegue destruir até um tipo dos 3 níveis de ataques inimigos... - Boss são muito bem feitos, boa estratégia e jogabilidade - 2 tipos de mecha, que vai te fazer jogar o jogo pelo menos 6x, como cada mecha em cada dificuldade.  CONTRAS: Pequeno, somente 6 fases :(  Nota 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Zone of the Enders in a straight up bullet hell shooter. The perspective changes are surprisingly smooth and add just that much more to the tempo. Most fun I have ever had playing a shmup.",
            "review_score": "1"
        },
        {
            "review_text": "This game is exactly what I wanted in a mecha game. The high speed, intense action really satisfied me in ways that Zone of the Enders just couldn't. When I think of a mecha game I think fast paced, high action, amazing moves, and an awesome looking robot to annihilate enemies in. I did not think I would love this game as much as I do now. 10/10 would bang again.",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING shooter. not as hard as most bullet hell games, so anyone looking to get into this game will be able to pick it up fairly quickly. its much more forgiving in that aspect. graphics are great, and the plot feels like your playing thru an episode of your favorite mecha anime. its easy to over look this game but give it a chance. its a bit pricey at 20 dollars if you missed the sale but IMO its well worth it. you might want to look up Ether Vapor Remaster. its a game similar to this and much cheaper at 5 dollars if u wanna see what ur getting into. but it doesnt have the fantastic angle changes and as varied scenery and gameply that this game offers.",
            "review_score": "1"
        },
        {
            "review_text": "If you like playing shoot 'em up games that has you playing as a big fighting robot going against waves of robot enemies and eliminating anything the game throws at you just so you can increase your high score then this is the game is for you. It has a story but nothing interesting that you'd see in a saturday kids cartoon, the gameplay however is better than slice bread.",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely terriffic Shoot 'Em Up. Fun, fast and frantic gameplay kept me hooked until I 100%d the entire game.",
            "review_score": "1"
        },
        {
            "review_text": "Certainly one of the best shmups on Steam awesome production values. It has:   A) A very kickass soundtrack B) Sexy waifus. C) Combat that changes angles and perspectives D) Melee/Shooting/Lock-on-whatever-you-call-it-from-Panzer-Dragoon gameplay E) An awesome framerate F) Did I mention a very kickass soundtrack? G) Fully-voiced Japanese dialogue with adequate subtitle translations H) Variable difficulty settings that actually reduce the difficulty   Anyway, if you like the genre, buy the game. It's as simple as that.  ",
            "review_score": "1"
        },
        {
            "review_text": "Astebreed is a good mecha shoot'em up game that has a reasonable amount of content and one of the first I have played. The gameplay is pretty fun and it's easy to learn the basics even without the guidance of optional tutorials. In combat, you have plenty of options like simply shooting bullets, lock on enemies to shoot them with bullets, cut your way through with a powerful blade, and heck using a quick short insurmountable blade dash. Although the story isn't so amazing, the fact that most of the dialogue is spoken during the game can become an annoyance since you have to focus on destroying your enemies but sometimes you may feel the need to read the English subtitles (dialogue is in Japanese only) and that may be a bother (not so much for me personally). The dialogue is not terrible though, the voice actors did a good job voicing each character. Another thing that must be noted is that once you start the game, you have to finish it completely because you cannot load from where you left off. However, there is a Chapter Select option that allows you to play chapters you have at least completed but if you care about certain achievements then you would have to stick to playing the game in one go. You can play the game on Easy, Normal, or Hard but be warned that Hard mode is really challenging (I tried and failed miserably). One last letdown is that the game is rather short, I was able to beat the game in about an hour and I really wished there was more to play.   Despite the negatives, Astebreed is still a good game to try out. Aside from the great gameplay, the art done in this game is great. Speaking of art, this game offers extras that allow you to see in-game art, concept art, 3-D mecha art, and more. The characters in the game are tolerable and you can also know more about them in the extras along with pretty much anything. To me, the price seems a little reasonable considering what the game offers so if you're a fan of shoot'em ups, mecha, and anime then I would definitely recommend picking this game up. Before I wrap up this review, I also highly recommend using a controller to play the game.   That concludes my review on Astebreed, looking forward to hopefully seeing more of this game in the future.  ",
            "review_score": "1"
        },
        {
            "review_text": "The true successor to both Ikaruga and Zone of the Enders in game play. If the story were toned down a little bit, this game would have surpassed both of them.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty wild colorful fast paced shmup. Get ready for some mind bending ariel maneuvers. Either the story doesn't make much sense or the frantic action just keeps you too busy to follow what really going on. The PS3 style graphics are nice, especially considering most shmups on STEAM are awful, some may call it pixel graphics, but I think its just an excuse to sell you lazy ports. If you enjoy shmups and mechs at all, you owe it to yourself to pick this one up.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Engaging gameplay and variety. It is a good combination of shoot-em up and mecha robots, with great voice acting and design.",
            "review_score": "1"
        },
        {
            "review_text": "Astebreed is a very satisfying bullet-hell 2D scroller in a 3D world. The sound design and graphics work together perfectly to really make the combat feel tight and very exciting. While the graphics aren't AAA incredible by 2015 standards, the style of it all more than makes up for it. The drama unfolds nicely, but becomes more and more difficult to follow as the level of danger increases in the later levels. The music keeps the energy up, and the voice over acting seems well performed. The game is short enough to make you want to get a higher score and go for more achievements.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't beaten this game yet (as of writing) so I'll give my impression on what I think up to the what I believe to be the last level.  1. If you like bullet hell type shooters, this is definently for you. 2. If you like a challenge, this may also be for you. 3. Playing through on Normal (when you start it's either Easy or Normal) and wasn't a challenge until the last couple bosses.   There is a story in this game, which is pretty good, that I've managed to piece together when I'm not dodging the: - 10+ enemies on screen - Rockets - Lasers - Armored enemies - Charging Lock-on laser - Rapidly smashing the blade attack button  It's really hard to pay attention to any of the dialogue when you have a ton of things to watch and pay attention to so you don't die. It's fun though. Fairly easy up to the last couple levels where the bosses can be (for me) frustratingly difficult. Voice acting is good, music fits and is high tempo, and the graphics are wonderful.  Got as part of a Humble Bundle but if you're a fan of this genre of games, I would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what's going on other than that I love me some shmups (and that I am terrible at shmups). But this one is quality.",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥ is this rad!",
            "review_score": "1"
        },
        {
            "review_text": "game very hard on the end boss = = but fun for fight and kill enemy  i like it  take score 9.0/10 !   *character is so cute ! asto &amp; fio =w= i love youuuuuu ♥ =...=",
            "review_score": "1"
        },
        {
            "review_text": "Beat the game. Replayed the prologue over and over (Best part of the game in my honest opinion). Stuff goes banana's on hard difficulty. Very short game but the story is great for what ever its worth. Wouldn't mind seeing this turned into a Anime or OVA series, great room for potential expansions. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": " ONLY  recomended for those who want to master the game or can deal with it difficulty. The game is heavily focused on give the player a 'Bullet Hell' (bullets filling your entire screen, inclusive in normal difficult) so gamers that can't deal with these kind of shooter could have some problems with it. For the rest, the game looks pretty good, have good sounds and music and decent controls.",
            "review_score": "1"
        },
        {
            "review_text": "Astebreed is arguably one of the best Bullet-hell games/Shoot em ups in existence. It is technically very basic and the story is told mostly through the dialogue (so if you only speak English you will probably be mashing buttons while you read the text), there is no customization, minimal variability in terms of actions and simple projectile mechanics (can be blocked, and can't be blocked). This however isn't a complaint as it makes the game more accessible and although definitely on the easier side, for even novice gamers the experience is not diminished. The game offers first and formost impressive visuals, both models, backgrounds and cutscenes for its genre. The combat takes place in a variety of styles (top down-, behind-, third person views), that all mesh together nicely unlike some games where it seems forced. These mechanics add to the immersion along with the winding environments and dramatic pauses done by the camera and mech making everything one cohesive experience.   The story is moderately good although relatively vague, it leaves much to the imagination and seems rushed, mostly in terms of execution. Its not often one desires more padding, but they could have easily through in some generic missions to stretch out the experience. That is really the only gripe with the game, that it is too short, and within 2 and a half hours you will be done and wanting more. Its a solid ride and is on par with playing through a cinematic experience/movie, but it needed more content. Overall a full recommend for fans of the genre and the uninitiated alike.",
            "review_score": "1"
        },
        {
            "review_text": "This game let me down. It promised a Star Fox type experience, but then it pulled the rug out from under me and was like 'Haha! It's just a bullet hell! Have fun dying on level 3 to a bunch of enemies!' And that's exactly what happened.  9/10, not enough Star Fox.  (The joke is, I'm IGN)",
            "review_score": "1"
        },
        {
            "review_text": "First off, this game plays pretty well, it's graphically great and there's lots of options, the dynamic positioning works great going from 3d to top down to sidescrolling, but it's hard for me to recommend this to any casual player due to some things i felt were glaring issues.  First and foremost, the game is almost rediculously short, i played through the whole thing twice in a little over an hour on normal mode, and i'm not exactly the best at these kinds of shooters. Yes the game is only 15 dollars, but it's literally only got 6 or 7 missions that take a few minutes each. only reason it took me so long was because one or two bosses are really annoying and the ability of the sword to destroy incoming projectiles is... inconsistant sometimes.  Another really annoying thing is the story is fast and feels rushed, there is almost no downtime whatsoever, there's almost nothing between missions, you just start the next one and 'BOOM SOMETHING IMPORTANT' finish mission MORE IMPORTANT STUFF and then MORE IMPORTANT STUFF DURING BOSS, the story is told via small chat boxes in the bottom left corner, which is both good because it doesn't get in the way of gameplay, but that also makes it really annoying, as i was honestly interested in the story, and i ended just spamming an invincibility move going back and forth accross the screen while reading the tiny chat boxes and ended up finishing half of the levels that way without even paying attention. Especially with how much i tried to understand what was going on, the fact that they just kept throwing plot at you constantly with almost no break, in the middle of trying to dodge bullets in an incredibly short game made it feel even shorter than it already is.  A huge gripe of mine is the 'hyper' move as well, it's really cool to have a screen clearing attack, or to be able to target melee everything you've locked onto, yet about 1/3d the time, the move doesn't work for me. I even went through the tutorial 5 times and still can't figure out what's up. I would love the 'screen clearing bullet shield' swipe to be it's own button while the lock on attack was independant, because very often in some of the bosses, you pratically have to use the lock on, but want to use the shield just to survive. It doesn't help that the blade's ability to deflect projectiles is occationally very sketchy, i can do the same thing against a boss 3 times and twice take no damage and the third die in under 10 seconds.   Though i have a lot of little gripes with this game, it is still very well put together and if you want just a fairly cheap, very good looking game, i'd recommend picking it up, but i don't think it's worth it's short length to the average player. I recommend anyone who really wants a challenge to play the game once on easy mode and just read the story, then immediately switch to hard mode and go from there. Just consider easy mode a slightly longer tutorial with some interesting, if not cliche'd story. and hard mode the actual game",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic Mecha gameplay with a variety of weapons and a variety of scrolling attack veiwpoints.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, never I like a SHUMP like this.  In this game, you have [Shield] so you will not go down in one shot and the shield can even regenerate if you destroy enemies, making the player doesn't get held back in BIG action throughout the game. Boss battles and the story are also great moments throughout the chapters  Moreover, the camera is changing over and over, this makes the game feels so refreshing each time. Camera could take you left to right, then change to FPS-like, then change again to bottom to up, and even right to left with marvelous transision each time.  For the developer, if you ever make this to PS4 I'll gladly buy again in that platform day one.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, never I like a SHUMP like this.  In this game, you have [Shield] so you will not go down in one shot and the shield can even regenerate if you destroy enemies, making the player doesn't get held back in BIG action throughout the game. Boss battles and the story are also great moments throughout the chapters  Moreover, the camera is changing over and over, this makes the game feels so refreshing each time. Camera could take you left to right, then change to FPS-like, then change again to bottom to up, and even right to left with marvelous transision each time.  For the developer, if you ever make this to PS4 I'll gladly buy again in that platform day one.",
            "review_score": "1"
        },
        {
            "review_text": "This isn't a bullet hell shooter, it's a game which wants to be one. Instead of the slow, intense patterns of well telegraphed bullets the genre is famous for, Astebreed simply spams the screen with huge numbers of bullets and enemies. The patterns change so quickly and the enemies and bullets move so fast they're mostly impossible to avoid. To compensate, the game give you a huge shield which regenerates quickly, meaning that despite taking damage pretty much non stop, the game is actually very easy until the final boss.  It looks nice enough, if very generic, but the music is utterly forgettable and the dialogue is incessant and literally never shuts up. The characters babble on about nonsense for the entire game, and of course, it's all in Japanese.  Ikaruga is a bullet hell masterpiece, a game with such precise, intelligent, and logical design as to be something which despite being brutaly difficult can be mastered with practice. Astebreed by comparison, is just a mess of random, incoherrant design from people who just don't understand what makes a good shooter.",
            "review_score": "-1"
        },
        {
            "review_text": "Closest thing to nirvana.",
            "review_score": "1"
        },
        {
            "review_text": "PewPew Overload: 9/10 GameFlow: 11/10!",
            "review_score": "1"
        },
        {
            "review_text": "I beat this game.  Look up at my play time.  olol  ",
            "review_score": "-1"
        },
        {
            "review_text": "Got to the final boss on my first try (without even going through the tutorial). And of course the hardest difficulty level isn't unlocked from the start. Garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "astebreed wants you to breed with the anime girls.",
            "review_score": "-1"
        },
        {
            "review_text": "A decent shmup for those who just want to spend some time on something. Don't expect anything too hardcore though, the difficulty level is much softer compared to many of the games shmup fans are accustomed to.",
            "review_score": "1"
        },
        {
            "review_text": "Ohhhhh man. As a kid who grew up in the '80s and early '90s doing typical '80s-'90s kid sh*t, I obviously love a) shooting games, and b) mother. f*cking. mechas.  I happen to also be a huge 'shmup' / 'bullet hell' fan, so this is more up my alley than you can possibly imagine. If you even THINK this game might be something you'd like... it probably is!  I have only beat the first few missions thus far, but this game is just so completely brilliant in every way it deserved the review!",
            "review_score": "1"
        },
        {
            "review_text": "Has gameplay that does pretty well in making you feel like jesus yamato Story was sub-par though",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic! Very smooth gamefeel; fantastic visual; a few really neat ideas; small, but fun story; awesome character design. It's got a lot going for it.  It makes for a great introduction to the bullet hell genre. Playing on normal is pretty easy for most of the game. So it eases you into things. Once you unlock the next higher difficulty, it gets pretty tough. But, either way, the visuals are beautiful the whole way through. Which definitely helps to keep you engaged.  The extras are also very fleshed out. The way the story is presented in game, you might feel like it's a bit sparse. But if you like floods of information (think Mass Effect codex), then the extras are pretty fun.  At $14.99, I'm not sure if it's quite worth it. With a hard mode playthrough I suppose it might be (I haven't finished that yet, as I have way too many other games I'm playing right now). But if you can pick it up on sale then it's definitely a good deal.",
            "review_score": "1"
        },
        {
            "review_text": "Eidelweiss really impressed me with this one!  Used to play Ether Vapor (though not on Steam, but I will get the Remasterd Edition soon!) and instantly got that feeling of immersive faced paced action again when I tried out Astebreed.  -Pros- -Mecha designs are amazing! If you're a hardcore Japanese mecha fan, you'd love this. -Great graphics -Multiple abilities to make use of, so you can play the game your way. -Bosses are challenging and has their own sequence of attacks.  -Cons- -Barely enough room to fit all those effects, sometimes even to the point that you literally see nothing but bullet fire and explosions on your sceen.  -Story is too short. I honestly would like to know more about the characters and the universe of Astebreed.  One thing this game lacks is the story-telling, i'm really interested in it as it has a rather intriguing plot that could possibly be made into an Anime.  -Voice acting for Daniel needs to be redone, parts that should be him shouting loudly sounds like someone just put their mouth too close to the microphone and saying their script with an over exaggerated slang to it. (LOL)  Other than that, get this game if you love Danmaku (Bullet hell) games like Touhou Project. You won't be disappointed with the amount of destruction it offers!    ",
            "review_score": "1"
        },
        {
            "review_text": "Best game, it is soo intense it will make you fap while playing at a very fast pace",
            "review_score": "1"
        },
        {
            "review_text": "If this were an arcade game, I could plug a lot of quarters into it.  Understand this is a shooter in the gradius/r-type style. It's a lot of fun! The design in both looks, and enemy placement, is sweet to fly around in.   Difficult enough to let an average shooter player, like me, be in danger and pull through, you can raise the difficulty up, too, if you want--though it is pretty diffcult!  It's actually quite fun, and is worth a round!",
            "review_score": "1"
        },
        {
            "review_text": "pro bullet hell player : ' ... ' *silently finishes the game on hardest difficulty without taking damage' casual player : 'ok I know his pattern now i'm going to beat this boss' me : 'OMG I CANT SLASH THIS PROJECTILE WHAT DO' *furiously mash the shoot and slash button*   I wish this game had a longer story.  But 11/10 robots and 11/10 girls ",
            "review_score": "1"
        },
        {
            "review_text": "Worth. It. Don't even decide if it's good or not. Just play it. It's story rich and isn't something you'd come across for everyday. This is literally a gem right here. No, don't even continue reading this. Scroll back up and buy the game. Midway you can cry, no one will even judge you. It's just that good for a short story. I wish it was longer though, like, dude;     IT JUST CAN'T END LIKE THAT IT NEEDS MORE!!    No, it's enough. Get it. Just do it.   Trust me.",
            "review_score": "1"
        },
        {
            "review_text": "Hack and slash your way through a bullet hell cutting down literally thousands of enemies in your mechsuit to high-tension music as you travel through top-tier locales that prove the graphical capacity of the game is less important than what you DO with it. 9001/10 why isn't every game ever based off of this game?",
            "review_score": "1"
        },
        {
            "review_text": "A really, really good bullet hell/SHMUP game with excellent gameplay, graphics, and sound. Story is also nice, simplistic but it does the job. Also handles camera shifts extremely well, they blend in perfectly and it doesn't ♥♥♥♥ you over, at all. Others have said much better praise for it than I so I'll leave it at that. Definitely recommended.",
            "review_score": "1"
        },
        {
            "review_text": "nice look and feel to the game the 2.5D keeps the game play fresh. I have only played for a shot time but I'm hooked.",
            "review_score": "1"
        },
        {
            "review_text": "Hell yes I would recommend this game! It's basically Code Geass the game, it's badass. Simply badass.  The story is interesting, the game gets in and out within a few hours, the visuals are stunning, the gameplay is fluid and easy to get used to, especially with a gamepad. I got this game for $4.49 and I could not be more pleased. I truly hope there is a sequel in the future, but even if there is, this will still be able to be played as a standalone title. I love it.   My suggestion would be, pick it up on sale if possible, if you're a fan of Shoot 'Em Ups, or Touhou, you may be willing to pay full price, and it's worth it.   I absolutely love this game, and I'm sure I'll be coming back to this game again and again, and try to get all the acheivements.  As of writing this review, I have beaten the game on Normal difficulty, there's a little humour here and there, and the combat is simply spectacular. Good job Playism!   Short Version: Shoot 'Em Up witth excellent graphics and gameplay, a little short, but that's not necessarily a bad thing, it gets in and gets out, and is amazing every minute of it. Pick it up on sale, or if your a fan of games like these, pay even full price, trust me, it's amazing.   I give this game my official rating of a Fio out of 10, A little confusing at first, easy to get used to, and also very lovable and fun, may come across a little cold, but it's a fun experience and enjoyable too. I give it a 10 out of 10. Great game! Pick it up if you can!",
            "review_score": "1"
        },
        {
            "review_text": "imagine mobile suit gundam on rails you get this, great game",
            "review_score": "1"
        },
        {
            "review_text": "i was aware of this game when it was a doujin game and it looked very promising.Since i played that though they have improved it a lot has a really good scoring system really amazing graphics and sounds great to boot.As far as space shooters go it has more then most with cutscenes voice overs unlockable extras and even a tutorial.But will give one note of caution it is very very short (even by space shooter standards ) only has 6 levels so really if you are addicted to getting a high score then this is well worth a buy for everyone else would wait for it to be reduced in price a bit",
            "review_score": "1"
        },
        {
            "review_text": "Lets say you like sidescrolling shooters... Or games like galaga, but more fast paced, or a behind the back bullet hell? Rest assured, Astebreed has what you need. In Astebreed, you control- Oh wait, can't say much without spoiling... You control a mech, with your assistant, and shoot the hell out of stuff. Sound good? Heres more on the subject. Pros: -Good story -3 different attack types: Sword, Machine gun, and Shotgun. -By bullet hell, I mean bullet hell. Seriously. Cons: -Story can be hard to follow at times -Pretty much need to play the prolauge -You can easily lose yourself on the screen This game is definitely worth a buy for anyone who loves bullet hells, I personally loved it, so theres no excuse for you not to. Besides the fact your not me.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun. . . Real fun. I don't play much of this genre but i've enjoyed this game greatly. It has this cool dynamic camera that changes the angle (and thus gamplay) often during the levels. It took me about 3 hours to go thru all 6 levels on normal difficulty (Take what you want of that. I don't play this genre often.)   One complaint though, is that if you don't understand Japanese, you'll have no idea what's going on. The voices are all in Japanese with English subtitles. While that works for the cutscenes, I found that I was too busy focused on the gameplay to bother reading the dialogue. The gameplay is great though, so its really a minor issue.   Really this game is pretty awesome. Dynamic Camera, Giant Mecha, Swords, Lasers, and High Scores. I would highly recomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first bullet hell game I've played in a long time and it's fantastic!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and addictive. It's reminiscent of old school arcade shooters!  Full Japanese voice acting, a great soundtrack, good controls.  A little weak on story, but it more than makes up for it with great gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "Controls are fixed and inflexible. No support for keyboard.   Other than that game is good.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game. Astebreed is horizontal 2-D shooter. You pilot a Mech with two means of attack, guns and a sword. your guns will work as any traditional scrolling shooter. There is a spread shot and a focus shot. Both have the ability to lock on to enemies. The sword can be used to slash enemies or destroy some enemy bullets.  The Gameplay in this game is fantastic. There are wide wide variety of enemies that that have many different attack patterns. On Easy you can just shot and slash mindlessly through the game with little problems. But on the harder difficulties, You will have to fully utilize all of your various attacks to make your way through.  This also has some really good graphics. All the environments in this game are very unique. There is a lot of attention to detail in the background. The shooting effect also look nice. The music in this game is good, nothing very special, but not bad.   The only downsides are that this is a short game that is also very easy to beat. I would have been nice if they added a even harder difficulty mode. It also would have been nice if this game had more content, such as time attack or boss rush.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Bought this during a steam sale, reccomend buying it and playing this during another sale. Ok so ou already know I like this since this is a yes vote, but anyways. The story, honestly confused me, but is interesting. The Action is Suberb. Does this get hard, hell yes it does, but its challening and when you complete you will feel great, or maybe I just suck :P. sword and lasers what more you could ask for as a robot thing destroing other robot things lol. The differnt enemies and differnt combination of these enemies cause you to manuver and rethink your attack patterns in case you lose too much health when you reach a boss, or just get creamed by the baddies. I'd say it is easy to get the hang of the controls, but it also gets difficult at times, like when your trying to avoid hundreds of missles and lasers from a giant robot.... xD. So I say this again, it was fun, a good buy as a steam sale game, Buy it during a steam sale, or if you just want to play it so much because my review won you over... :P buy it now and enjoy, cry and rage at this brillant game.",
            "review_score": "1"
        },
        {
            "review_text": "I liked this game. As a mech enthusiast, it really tickled my fancy, and I got a few hours of playtime out of it. A few grievances I have with it.  -little short -anime story is kind of annoying -slowdown on higher settings -not many choices of mechs, thoug that might be a story-related issue  Other than that, this game is worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best stg I've played in the last decade. I seriously cannot reccomend this enough. The fast paced melee combat is a breath of fresh air in the genre and is well implemented to boot. The difficulty curve eases you in well but the game is insanely hectic and difficult to master. I reccomend using an arcade stick if you have one available as simultaneous usage of blade dashing and lock-on shots while still pouring out a hail of bullets is incredibly difficult on a traditional gamepad.. And yet there's nothing in the game's mechanics that prevent you from doing just that; unleashing a full storm of locked on time-warping homing bits while you zero-shift around the screen tearing enemies to shreds all the while pouring an endless stream of shots out of your mech.  This game is an absolute blast. Astebreed is absolutely worth your money if you dig shmups.",
            "review_score": "1"
        },
        {
            "review_text": "Very well made good game. It reminds of the Thunder Force days and few other 3D rendered shoot 'em ups back in the 90s-early 00s and nice little story to go with it like an jrpg or Visual Novel. Would be great if it was much longer and added stages but its worth the money hows it very well made. Shoot 'em ups must be made like this in the coming future games for the current generations.",
            "review_score": "1"
        },
        {
            "review_text": "This game is exciting. Its a side scrolling action shooter with a very fun combat system. It has good replay value.",
            "review_score": "1"
        },
        {
            "review_text": "very good space shooter! full on mecha action! really gives the feeling like you are in an anime!",
            "review_score": "1"
        },
        {
            "review_text": "A good attempt at a different kind of mech game. Enjoyed the story but the game could use some better optimization with clunky feeling at certain parts",
            "review_score": "1"
        },
        {
            "review_text": "Such a neat game I wish there were more like it. Wish this game were a bit more complex with more moves and the ability to upgrade and change designs but hey I'll take what I can get. Keep up the good work fellas.",
            "review_score": "1"
        },
        {
            "review_text": "I had absolutely no idea what was going on with the plot. At all. But it had fun gameplay and a lot of cool lasers and robots. Get it if it's on sale and you're a huge weeb.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty cool.... if it weren't crashing all the time and forcing you to start from scratch all over again and again. Couldn't go further than Chapter 4",
            "review_score": "-1"
        }
    ]
}