{
    "app_id": 283940,
    "name": "Freddi Fish and the Case of the Missing Kelp Seeds",
    "release_date": "2014-04-17",
    "developer": [
        "Humongous Entertainment"
    ],
    "publisher": [
        "Humongous Entertainment",
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Point & Click",
        "Adventure",
        "Family Friendly"
    ],
    "achievements": 0,
    "positive_ratings": 288,
    "negative_ratings": 13,
    "price": 4.99,
    "description": "Help underwater detective Freddi Fish and her finny friend Luther solve the case. Explore underwater caves, deep canyons and colorful reefs, and discover fascinating places like King Crab's Castle and A Sunken Ship Out of Time, in an effort to save the reef.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/283940/header.jpg?t=1554314954",
    "minimum_requirements": "OS: Windows 7 / 8.1 / 10 Processor: 1.0 GHz Processor Memory: 512 MB RAM Graphics: 100% DirectX compatible graphics Storage: 512 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "recommended_requirements": "OS: Windows 10 Processor: 1.5 GHz Processor Memory: 512 MB RAM Graphics: 100% DirectX compatible graphics Storage: 512 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "dont trust the Ray, he sells drugs to little kids.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not going to try to write a 'real' review for Freddi Fish and The Case of the Missing Kelp Seeds, because at this point it seems rather unnecessary. Originally released almost two decades ago as an easy, semi-edutainment children's adventure game, it was among the very first PC games I ever played and I still have quite a few fond memories of the numerous hours I spent trying to solve the mystery which now seems so utterly simple.  Flash forward to today and I'm once again joining Freddi and Luther, only this time I'm not playing in accompany with my three year old niece, who can barely use a mouse but found the colorful world of one of Humongous Entertainment's most enduring games utterly engrossing. I wouldn't have expected it to hold up in modern day, nor hold any interest for kids anymore, but to my surprise it became a great moment of uncle/niece bonding that has now renewed my fond memories of the game and added some new ones.  If you have no nostalgia for Freddi Fish and are just looking for a decent adventure game you probably won't get much out of the experience, but personally I was pleasantly surprised just how entertaining it still was for new and old audiences alike. I also discovered it was headed by Ron Gilbert of all people, a fun fact that just makes me love the game all the more.",
            "review_score": "1"
        },
        {
            "review_text": "During the late 90’s/early 2000’s Humongous Entertainment released an absolutely fantastic stream of “edutainment” point and click adventures for children. These titles focus on a range of light academics including basic geography, basic to upper elementary level mathematics, logical thinking, critical thinking and puzzle solving, topped off with reinforcement of good manners and polite social etiquette. At the lower end of the age spectrum, they may require some adult supervision and supportive guidance, but there is no better series of games for a child’s first venture into PC gaming.  If I recall correctly, I didn’t get into Freddi Fish until I had already become fairly invested in Putt-Putt. Because of this, I don’t have the same nostalgic tie to the franchise. That being said, there are still scenes of this game that upon replaying, were as vivid in my mind as the day I first played them. The Missing Kelp Seeds was the first Freddi Fish game I played and I enjoyed it immensely. The change in scenery helped keep me engaged and also broadened my academic interests as a child.",
            "review_score": "1"
        },
        {
            "review_text": "The Citizen Kane of video games.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say about Freddi Fish? This was my first ever computer game. I remember running this gem of a game on my old Windows 95 computer. Oh, how the time flies. At the time, I was so in love with this game. I was a very young child then, so, the nostalgia factor is extremely strong here. Now that I'm older and have played it again, it has certainly taken me back to my childhood. Are the graphics and effects all that great? Nah, but, that is to be expected of early 90s games. I guess you could say that this was the computer game that started my PC gaming addiction for me. Kids nowadays probably won't appreciate this game all that much, considering that they have been spoiled by modern day games with crisp and HD graphics. I think that us 90s babies are the ones who will appreciate this game the most.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this because of the dank fish comment. Loved every minute of it. All 45 of them that it took me to beat it.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever! Took me 17 minutes to win, yet i got 5 hrs on it! :O",
            "review_score": "1"
        },
        {
            "review_text": "What are you doing reading WORDS when you could be PLAYING MORE FREDDI FISH!",
            "review_score": "1"
        },
        {
            "review_text": "This is how you hug your childhood.",
            "review_score": "1"
        },
        {
            "review_text": "A good source of fun and protein...if you cookem just right.",
            "review_score": "1"
        },
        {
            "review_text": "Took me weeks to finish as a kid, now i finished it in 5 mins. RIP money",
            "review_score": "1"
        },
        {
            "review_text": "I have not played this game since I was a little kid, and the pure nostalgia joy I got from playing this again was fantastic. This is a great, short puzzle game for any kid that I would highly recommend. I also have to commend the creators for making Freddi a surprisingly legit detective. In the course of my quest to stop the mob from performing a total takeover of the local economy, I worked with a drug dealer and bribed a local official. Good stuff for a kid's game.",
            "review_score": "1"
        },
        {
            "review_text": "A simple, unremarkable point and click adventure game with beautiful visuals and massive nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "Has cards...good enough for me fam",
            "review_score": "1"
        },
        {
            "review_text": "i can't see the mouse it is invesible.",
            "review_score": "-1"
        },
        {
            "review_text": "My 4yo loves Freddi. It's a pretty simple point-and-click adventure. The settings are a bit difficult to manage. (You have to remember that Alt+Enter is the fullscreen shortcut that everybody knew in the 90s.)",
            "review_score": "1"
        },
        {
            "review_text": "my life has been changed for the worst because two greedy fish decide they want to monopolise the kelp industry",
            "review_score": "1"
        },
        {
            "review_text": "This...This is what life is for me now",
            "review_score": "1"
        },
        {
            "review_text": "*Childhood relived again*  Wow, emotionally moving. Really on par with the popular games out there today. Yet another Fantastic Visual Novel Cute little Freddi saves everyone's lives  Peanut butter jelly time: 9999999999/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game from childhood. No doubt a defining title in the genre.",
            "review_score": "1"
        }
    ]
}