{
    "app_id": 283980,
    "name": "Spy Fox in \"Dry Cereal\"",
    "release_date": "2014-04-17",
    "developer": [
        "Humongous Entertainment"
    ],
    "publisher": [
        "Humongous Entertainment",
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 258,
    "negative_ratings": 14,
    "price": 4.99,
    "description": "The super-suave agent, SPY Fox, must find Mr. Udderly, rescue all the cows, and stop William the Kid from depleting the worlds supply of milk. Using ingenious SPY gadgets, keen wits, and daring moves, SPY Fox, jumps out on an udderly exhilarating adventure!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/283980/header.jpg?t=1554320222",
    "minimum_requirements": "OS: Windows 7 / 8.1 / 10 Processor: 1.0 GHz Processor Memory: 512 MB RAM Graphics: 100% DirectX compatible graphics Storage: 512 MB available space Sound Card: 100% DirectX compatible card or onboard sound Additional Notes: Got milk?",
    "recommended_requirements": "OS: Windows 10 Processor: 1.5 GHz Processor Memory: 1 GB RAM Graphics: 100% DirectX compatible graphics Storage: 512 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "Pretty good. Just make sure you bring your own milk.",
            "review_score": "1"
        },
        {
            "review_text": "After playing Spy Fox in 'Dry Cereal', I was horrified to discover that all the games in my library are now much more disappointing now that I've played this game.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game a lot when I was a kid. I'm personally not sure if I was able to complete any of these to be honest since when I got in the secret hideout, I was confused. But for the first time I managed to completely finish the game and finish the game in another way (the one where you don't dance the Tango with Russian Blue) and I was surprised. I was stuck on it for an hour or two LOL. But this game is still amazing how the story/the stuff you have to do is never the same. This game is a must for those nostalgic feelings.",
            "review_score": "1"
        },
        {
            "review_text": "Nominate for the 'Game Within a Game' award! Go Fish!",
            "review_score": "1"
        },
        {
            "review_text": "SpyFox is bit of a cult classic to those that played H.E. games as a child back in the mid-late 90's to early 2000's for Wins 95, 98, and X (Vista and later requires a Emulator, which the steam releases provides).  Able to play this again was a huge nostalgia trip for me, and discovered a few gags I never saw before, somehow, or references I didn't understand as a child. It has aged well, and is great for kids or anyone new to adventure games.  In this game, SpyFox has to stop a goat named William the Kid from ruining the dairy market by replacing cow milk with goat milk. You're sent to a fictional greek island to met the rest of your team: Monkey Penny, Prof. Quack, and maybe a bug named Walter Wireless.  There are alternate paths that are designed everytime you start up the game: How to get from point A to B, what characters you'll see, how you'll interact with them, and what you need to do to beat the game, along with a hidden way to get the true ending (with a fixed solution). There is some puzzle solving with two mini-games: Run-and-gun side scrolling 'Happy Sub Time' and the famous Go-Fish with Mr. Big Pig, whom never lost, yet.  This game and other majority H.E. adventure games are short, since the target audience was for children, afterall.  Get the Spy Fox complete set or the H.E. complete set if you liked the other franchises from H.E., or to share your child hood experience with your children with games that are actually meant for their age group, and not give them CoD and/or an Xbox like any bad parent would do.  -----  Check out more games I see that deserve more attention from my curator group:  BluePaw's Underrated Games List  Join and/or follow if you wish.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best humongous entertainment titles",
            "review_score": "1"
        },
        {
            "review_text": "Now i can relive my childhood over and over again on my computer. Never signing off again infinity/10",
            "review_score": "1"
        },
        {
            "review_text": "Like James Bond, but with furries. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is blast from the past when things were much simpler.",
            "review_score": "1"
        },
        {
            "review_text": "What does the fox says?",
            "review_score": "1"
        },
        {
            "review_text": "Definatly gonna have to rate this one a Booby Corey/ shmoney dance                                 and chewy is some hat tigers hat tigers",
            "review_score": "1"
        },
        {
            "review_text": "If you played this game as a kid, you won't regret replaying it as an adult. The writing and voice work are excellent, the art and animation are great (despite the low resolution) - for a kid's game at its time it was way ahead of the game. You'll see how much you missed as a kid (the PUNS, the REFERENCES, and the JUST PLAIN FUNNY STUFF THAT YOU DIDN'T GET BECAUSE OF UNDERDEVELOPED VOCABULARY). This game is awesome and hilarious. I think I'm enjoying it more, in fact, than I did as a child. I'm clicking on everything, because I want to hear every piece of dialogue (there are about three witty phrases for everything you click on). Also, the story changes every time you replay, into three(?) randomized configurations, AND they just made the UK version available to everyone (which I hear is just as funny, if not funnier, than the US version). Replayability is sky-rocketting. Just buy it. Play it. And don't reconsider the purchase until then. Like I said, you don't be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "I beat the Pig in Go Fish! Fun times!",
            "review_score": "1"
        },
        {
            "review_text": "A silly Humungous Entertainment point and click problem solving game. Fun memory from the 90's.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game. your children or future children will thank you. this game (at least for me) is pure nastalgia in a white tuxedo.",
            "review_score": "1"
        },
        {
            "review_text": "Spy fox in Dry Cereal is the first in the triology from my younger childhood. A great sense of nostalgia and a whole lot of fun.  Pros: 1.Puzzles were always interesting. Whether you were knockin aligators unconcious with the power of food or solving lazer-mirror puzzles they were always fun. As a teen now with a little bit of rememberance puzzles were easier but still fun. 2.Interesting gameplay mechanics. One aspect of the game was interrogating characters about other characters for information. Timed minigames were also thrown in causing some trouble to even the older of players. Gadgets are interesting and fun. 3.There are 2 endings. I've only completed one as of now. So I'll be back after completing the rest of the series again. 4.Humor. There are lots of puns, jokes, and James Bond references of which I was quite fond of. Also WANNA SEE MY TATTOO  Cons: 1: Go Fish. Really the only con. Go Fish was one of the minigames. Basically I bought a Jar of Trinkets and used them to gamble with this fat pig. We had to play Go Fish. I swear that pig had a dwarf hiding in the one sided mirror disco ball feeding him info on my card stack with a earpiece. Either that or he was psychic. Too many frustrating tries came out of this. Also guess what your reward is. Nothing. You get jack ♥♥♥♥! It was supposed to be a fun minigame but it was not fun. So if you play this game. Stay away from the ♥♥♥♥ing pig. There's no point to deal with annoyance. Edit: Nevermind what I said. You have to beat him in one of the paths.   Story: This time Spy Fox is up against William The Kid. He's a goat who wants to steal all the cow milk right from their udders.  How does he plan to carry this heinous deed out? Well first he kidnaps Mr. Udderly, a cow that milks cows for milk... What the ♥♥♥♥ mate. That's like me farming woman's ♥♥♥♥ for milk so I can sell it to lil kids. Oh ♥♥♥♥ I think that is a real thing. Anyway he then plans to flood the world with all the milk so that he can send out tsunamis of the milk onto the world to kill everyone. Then he'll point his finger at the cows blaming them for it so they end up in jail. These cows will have to deal with Prison ♥♥♥♥ for the rest of their lives. Taking it in the backside in Alcatraz for an eternity. Then he'll make everyone drink goat's milk. Which honestly the last part doesn't sound half bad. I quite like Goat Cheese.  Anyway like usual you and your fursona: Spy Fox have to stop him. To do so we must turn of his Milky Weapon Of Destruction (Sounds like a killer name for a ♥♥♥♥. Kappa.), free the cows, and throw this goat ♥♥♥♥♥ into Alcatraz! It's fun.  Play it especially if you played it as a child and are looking for a nostalgasm. If you're a furry then maybe this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "In this gripping tale of espionage and conspiracy, you play as one Agent Spy Fox, top notch secret agent and lady's man. You are sent on a mission to Acidophilus island to investigate the strange disappearance of the entire world's milk supplies. On this island, you must search for clues and speak to the natives to find out who committed this heinous crime. +Solid Gameplay +Gripping Storyline +Very fun minigames +Many interesting puzzles  - Kind of short overall 9/10 its gud",
            "review_score": "1"
        },
        {
            "review_text": "Does not work for new OS",
            "review_score": "-1"
        }
    ]
}