{
    "app_id": 283920,
    "name": "Putt-Putt® Joins the Parade",
    "release_date": "2014-04-17",
    "developer": [
        "Humongous Entertainment"
    ],
    "publisher": [
        "Humongous Entertainment",
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Family Friendly"
    ],
    "achievements": 0,
    "positive_ratings": 183,
    "negative_ratings": 15,
    "price": 4.99,
    "description": "What does it take to be in a parade? Hard work, a bright shiny chassis and a little help from your friends.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/283920/header.jpg?t=1554317012",
    "minimum_requirements": "OS: Windows 7 / 8.1 / 10 Processor: 1.0 GHz Processor Memory: 512 MB RAM Graphics: 100% DirectX compatible graphics Storage: 512 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "recommended_requirements": "OS: Windows 10 Processor: 1.5 GHz Procesor Memory: 512 MB RAM Graphics: 100% DirectX compatible graphics Storage: 512 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "A great port of the first video game I ever played, starting a lifelong obsession. As a child this game was adorable, funny and amazingly responsive, everything you cared to click would play a little animation.  Playing the game again was a wonderful nostalgia trip.  With no sense of irony: thanks for selling me my childhood again, Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Played this game when i was only 6 years old in pre-school (or prep for us Aussies) and now i'm playing when i'm 19 years old. And i've had the same fun as i did, all those years before. What a nostalgia trip this was. I highly recommed this game to children or toddlers, even adults alike.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "If your thinking of buying this game Heed this warning.. Putt Putt is a massve singlle player MMO RPG and it is not for the weak of heart. This game is an esstiental traning game for DOTA players. Putt Putt is a crimanal who steals free bird sead and magnets without a second glance. In this game you must go down dark allies and into horrific caves to find possibly rabid dogs to take into a parade. Putt putt also brings up many political issues like lowering the minum wage to one penny. Obviesly this game is highly controversial. The playthrough is brutal but the end is very worth it. This parade will probably be the most exiteing moment of your life.   10/10 best game Putt Putt is high on putt pot",
            "review_score": "1"
        },
        {
            "review_text": "The finest lawn-mowing simulator that 1992 tech could allow.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. Intense story. Gameplay was magnificent. 69/10",
            "review_score": "1"
        },
        {
            "review_text": "its perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Its a very simple introductory adventure game for young kids from the early 1990s. Can be completed in less than a hour but still it is pretty well made and should entertain kids for a short time.",
            "review_score": "1"
        },
        {
            "review_text": "Crayfish, also known as crawfish, crawdads, freshwater lobsters, or mudbugs, are freshwater crustaceans resembling small lobsters, to which they are related; taxonomically, they are members of the superfamilies Astacoidea and Parastacoidea. They breathe through feather-like gills and are found in bodies of water. Some species are found in brooks and streams where there is fresh water running, while others thrive in swamps, ditches, and rice paddies. Most crayfish cannot tolerate polluted water, although some species such as Procambarus clarkii are hardier. Crayfish feed on living and dead animals and plants.  The name 'crayfish' comes from the Old French word escrevisse (Modern French écrevisse). The word has been modified to 'crayfish' by association with 'fish' (folk etymology). The largely American variant 'crawfish' is similarly derived.  Some kinds of crayfish are known locally as lobsters, crawdads, mudbugs, and yabbies. In the Eastern United States, 'crayfish' is more common in the north, while 'crawdad' is heard more in central and southwestern regions, and 'crawfish' further south, although there are considerable overlaps.  The study of crayfish is called astacology.  In Australia (on the eastern seaboard), New Zealand and South Africa, the term crayfish or cray generally refers to a saltwater spiny lobster, of the genus Jasus that is indigenous to much of southern Oceania, while the freshwater species are usually called yabby or kōura, from the indigenous Australian and Māori names for the animal respectively, or by other names specific to each species. Exceptions included Western Rock Lobster of the Palinuridae family found on the west coast of Australia; from the Parastacidae family Tasmanian giant freshwater crayfish found only in Tasmania, and the Murray crayfish found on Australia's Murray River.  In Singapore, the term crayfish typically refers to Thenus orientalis, a seawater crustacean from the slipper lobster family. True crayfish are not native to Singapore, but are commonly found as pets, or as an invasive species (Cherax quadricarinatus) in the many water catchment areas, and are alternatively known as freshwater lobsters.",
            "review_score": "1"
        },
        {
            "review_text": "Such a nostalgic game :D Very short, you get to mow lawns and get car washes and whatnot :)",
            "review_score": "1"
        },
        {
            "review_text": "Putt-Putt® Joins the Bolshevik Party",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best game I have played all year. Nostalgia was spewing out of my eyeballs the whole time as I spammed the horn over and over with my good bud Pep the Dog. 10/10 GOTY",
            "review_score": "1"
        },
        {
            "review_text": "It r teh best game",
            "review_score": "1"
        },
        {
            "review_text": "Best part of the game was going up to a robot what told me the time looking at a clock and laughing because it was right! 10/10 game of the year!",
            "review_score": "1"
        },
        {
            "review_text": "'That was the most fun I've had all day'",
            "review_score": "1"
        },
        {
            "review_text": "Well, this is the oldest of the Humongous adventure games so naturally it's a bit of a rough start. For one, the game is incredibly short. There's also only one thing that really changes between playthroughs, as well. And the puzzles are answered for you almost every time. There's a bit of interesting interface use but aside from that, not much worth anything here. MIDI-tastic music, bad voice acting, plot so basic that it might not exist... yeah, I can't fault this game for being as basic and bad as it is since 1992 and all, but there's no reason to buy it. I never played this one myself so that could be part of it? But even then there's so little there.",
            "review_score": "-1"
        },
        {
            "review_text": "Childhood! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "I played this game as a kid, and now I let my kid play it :-)",
            "review_score": "1"
        },
        {
            "review_text": "I grew up with this game and playing it again was very nostalgic. 10/10 would buy again, oh wait I did on steam.",
            "review_score": "1"
        },
        {
            "review_text": "This game is outstanding and is truly an amazing gaming expirience.",
            "review_score": "1"
        }
    ]
}