{
    "app_id": 284050,
    "name": "Sanitarium",
    "release_date": "2014-10-29",
    "developer": [
        "DotEmu",
        "DreamForge Intertainment"
    ],
    "publisher": [
        "DotEmu"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Horror"
    ],
    "achievements": 20,
    "positive_ratings": 319,
    "negative_ratings": 17,
    "price": 6.99,
    "description": "Originally released in 1998 for PC and Adventure Game of the Year Winner, this timeless point-and-click horror game is a must-have for adventure game fans.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/284050/header.jpg?t=1447360671",
    "minimum_requirements": "OS: Windows Vista, 7, 8 Processor: Pentium 4 2.4Ghz Memory: 1 GB RAM Graphics: Intel HD Graphics DirectX: Version 9.0 Storage: 3 GB available space",
    "recommended_requirements": "OS: Windows Vista, 7, 8 Processor: 2 GHz Dual Core Memory: 2 GB RAM Graphics: NVIDIA GeForce GT 640 DirectX: Version 9.0 Storage: 3 GB available space",
    "reviews": [
        {
            "review_text": "This is one of the reasons why 1998 was 'The Ultimate Year' of gaming. You must be insane if you haven't visited Sanitarium yet and you should be treated ASAP!",
            "review_score": "1"
        },
        {
            "review_text": "I played and enjoyed Sanitarium back in early 2000 as a kid, and let me say this: The game has aged just fine. Although rough-looking for a game in 2014/2015, Sanitarium more than makes up for it with its well written AND spoken dialogue, story that is rivaled by few in the genre, and the atmosphere is absolutely perfect.  But before I begin to praise Sanitarium even more, I must warn you of one thing that the game really fails at -- its controls. More specifically, the movement of the main character. You move at a crawl and you really have to shove your mouse with some authority to get the direction you want. In fact, some parts of the game have you crawling around (of course not literally, you're walking) for several minutes if you have to backtrack, which will happen on your first playthrough. I can understand the slow movement may be annoying for people who are used to modern games where characters often have the ability to run around, but not in this game. You're going to have to walk around and backtrack. Sorry.  Anyways, now that the bad is out of the way, a quick list of pros. - Great horror atmosphere. The ambiance, chillingly good voice acting of some characters, the music, the details in areas you'll explore. Good stuff here. - Extremely captivating story. If by the 2nd chapter you're getting bored I'd be surprised. - As the steam description says, '...this timeless point-and-click horror game is a must-have for adventure game fans.' Couldn't have put it better myself.  In short, if you like point-and-click horror adventure games and don't mind a character that moves around a little bit slow, then this game is definitely for you.",
            "review_score": "1"
        },
        {
            "review_text": "Men when you play games like this, you know that it's something big because you are feeling it.   -Unique Graphics, just amazingly surprising because you don't need those but this game is in another level. Insane how you feel the madness of the people and other things around you only because the story is amazing   -Gameplay, point and click in a map full of puzzles, an unknown story. The characters around you will help you to discover what's next. And believe me or not, they will screw your mind. A little bit hard sometimes, but this is what i call a living experience (or something like that, i don't speak english)   Anyway there's more   -Story, Sanitarium is the craziest thing ever. It's a MAD HOUSE! You're trying to talk with crazy people, you're sane and no one likes you, because they aint normal persons. Just discover what's the matter! Why all around you are trying to hide like WTF!   -Atmosphere, this is my personal section, this game IS ATMOSPHERE that's right!   For it's age, i highly recommend this game like one of the games i have ever played.   Masterpiece 10/10  -metacritic 2013-",
            "review_score": "1"
        },
        {
            "review_text": "Let me start off by saying the weird stuff. I hadn't played this game for years, all a sudden it popped into my mind this morning, and I began to google old school reviews on it. The next thing I do is visit the Steam front page, and what do I find as a new seller? Sanitarium. If that doesn't call me to purchase this game, I don't know what the hell else can.     For those looking for a trippy adventure title, look no further.    The game came out late 90s but I picked it up early 2000 and played it on one of my first PC's I owned. Was quite an experience to say the least.      I remember staying home from school sick with a bad cold due to allergies, popping some drowsy medicine, and playing Sanitarium.    I think the meds helped enhance the overall atmosphere of the game because it was impossible for me to put down. Even as sleepy and tired as I was, I kept chugging away at this game throughout my sick day off and neared completion.   The game has you playing a man who is basically out of his mind. Not sure what is real and what isn't and you are basically playing what's in his head, good and bad.   I don't want to get into the story or spoilers, but I'll leave it that I think the 2nd chapter stood out as one of my favorites because of all the creepy children and the overall environment. The game has an awesome atmosphere that doesn't let up.    Sure this game is old, but it's still a gem and now on Steam, I highly recommend picking it up. I own the original discs still and liked to add this to my Steam collection so I got it here as well. ",
            "review_score": "1"
        },
        {
            "review_text": "I played this game for the first time in 2010 and it instantly became my favoritie adventure game. It has a wonderull atmosphere with a great amount of variety and weirdness. The puzzles are fun and the story is great. I whole heartedly recommend it to anyone that likes adventure games. It's the kind of game that inspires you to go in to making games, to learn modeling so you can remake it. It is a real shame so few people know about it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a long time fan of this game, and for a good reason! The story really kept me curious the whole time, and for every bit of unsettling horror there was great voice acting to go with it. Many characters still shake me up (in a good way!) getting to hear them speak again. Some of the puzzles are very bizzare, and there's still one or two that can trip me up. I genuinely feel bad for the main character as his plot unfolds, and it's very dark. Very satisfying to beat as well!   I think there's even secret keyboard commands to make the characters say silly things. I remember I used to make Olmec laugh. HA. HA. HA.  I also love having this game on steam now, as I re-bought the original twice in the past. Too many discs! So I always lost them. I'm glad it's still playable, and still as enjoyable as the first time I picked it up!",
            "review_score": "1"
        },
        {
            "review_text": "WARNING: This review may have spoilers, please read at your own risk.  I've had this game on my wish-list for a long ♥♥♥ time. I loved watching people do video walkthroughs of it over and over and I finally got it and finished it!  So here it is folks, my review of Sanitarium.  STORY: You play as an amnesia stricken patient in an insane asylum dealing with the various psychologial issues he has.  As you go through various crazy levels such as a town where theres nothing but mutated children and overgrown plants, an island circus, and an alien world filled bugs, cybernetics, and cyclops, you will know more about the character you're playing and it smoothly helps the game along.  For me I thought the story was very excellent. The levels help correspond and relate to the characters memorys/issues and it works well. The only issue I have is the voice actors are okay/below average at best. 8.5/10  GRAPHICS: Now of course I'm gonna get this out of the way. This game came out in the late 90's, of course the graphics are gonna be dated.  Other than that I will say though that the game looks nice for its time and it didn't really bother me that much. 8/10  GAMEPLAY: This is an isometric click and point adventure game. Some puzzles in my honest opinion kinda sucked, some were a bit too easy and others were in the right amount of difficulty for me.  There are 13 levels to go through and depending on how good you are at puzzles this game will probably only take you a few hours to beat unfortuantley.  For the average adventure gamer I would say this game will probably take you longer.   Also SLOW MOVEMENT. 7.5/10  VERDICT: Sanitarium is a nice psychological horror game.   Granted its not gonna spook you to death, but it brings in a great story, nostalgic graphics and fine gameplay.  Just remember though its dated okay?;D 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Sanitarium is one of the cult classic point and click horror adventure games from the late nineties. Player takes a role of an amnesiac guy that wakes up in a weird old looking mental asylum. He has to find out who he is, where he is and what has happened. Amnesia is a pretty common plot device in video games, but player shouldn't let it bother, because the story is very good and interesting. Also, the creepy and horrific world of Sanitarium is very atmospheric and compelling.  The graphics and sounds are very 1998. That's okay for me — I love the looks and sounds of the games from that era. It looks aged, somewhat dated even, but I like it. The voice-acting is pretty decent, even though the main protagonist sometimes sounds a bit like he's reading his lines. The haunting ambient backround sounds fit well in Sanitarium's mood.  The controls are basic point and click stuff. You talk to people, look at things, pick up stuff, use things. Moving the character is a bit clunky and could be a bit tricky at first.   The Steam release of Sanitarium has some technical problems. I had some difficulties because the game kept crashing all the time. If you encounter stuff like that, you should read the forums. There's some really helpful stuff. (At first I gave Sanitarium a negative review, because I found it unplayable, but thanks to Steam forums, I managed to fix it.)",
            "review_score": "1"
        },
        {
            "review_text": "I spent the last hour trying to figure out how to get gas (I know you get it from the car) in the 2nd level. Turns out you have to click on the 'gas cap'...♥♥♥♥ this game, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "an old classic game i still enjoy playing today. still own the disc version that came out in 1998 but unfortunately it does not work well on modern systems. the adaptation is good and works well on modern systems. just moving the character with the mouse is relaxing and easy to do.  the voice acting is poor though, especially that of the young girl, but the story is interesting and each level is unique with its own story that has to be solved but also explains more of the protagonists life as to how he ended up in this stage he is in. packed with good, at times funny puzzles, you will be wondering around, exploring each section of the levels to solve the mystery. it is a mature P&amp;C adventure game.   it is a slow game so it may not be for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "scarier than soma",
            "review_score": "1"
        },
        {
            "review_text": "I played this for the first time when I was like 7 or 8 (an older cousin had it), and although I didn't finished it It just got stuck in my head. I couldn't remember the name then It got realesed on Steam and everything came back, all the creepiness, those characters, that story... MAAAN that story. I just love it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a classic game for sure  -a scary point and click adventure (not for kids really) ( and it challenging well for me at least)  -its pretty morbid game and has pretty strange ideas prolly why I like it  -your struck with amnesia and wake up in a menatl hospitle you need to find out whats the deal is  -Do you have the skills and clicks to solve the mystery and claim your sanity?  (I never beat my steam verison but I have beaten it a few times on a non steam version) p.s its from 1998 so don't expect next gen graphics kids but its still beautiful i think -Goombas",
            "review_score": "1"
        },
        {
            "review_text": "A nice and interesting old graphic adventure (1998) that will entertain and even gift you some feelings and emotions..... Overall my judgement is quite positive altough some flaws are present in the game--- Main issue that made me lower a lot the final score is the presence of a good number of annoying puzzles, not impossible ones but very annoying ones, i really hate musical puzzles.... Overall i must say that most of the puzzles were of a good logic, so nothing was impossible. Another relative flaw was the movements of the main character who was moving really too slow and there was no way to move from one room to another in one click, also, sometime, going up or down of a ladder and moving trough different layers of the screen was a bit of a pain, but nothing that can not be forgiven.  My Final Score is     84  /100",
            "review_score": "1"
        }
    ]
}