{
    "app_id": 284180,
    "name": "Magicians & Looters",
    "release_date": "2014-07-01",
    "developer": [
        "Morgopolis Studios"
    ],
    "publisher": [
        "Morgopolis Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 29,
    "positive_ratings": 96,
    "negative_ratings": 12,
    "price": 1.99,
    "description": "Guide three sociopathic apprentices through an open world filled with caves, castles and underground cities as you search for your kidnapped teacher. Discover countless secrets, loot hidden treasure troves, and decapitate your enemies. Or immolate them. Or smack them in the face with fruit.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/284180/header.jpg?t=1447360676",
    "minimum_requirements": "OS: Windows XP or newer Memory: 600 MB RAM Graphics: 1280 x 720 resolution or better Storage: 1500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Art style is beautiful. Animations are fantastic. Combat is fluid and responsive. Story is very funny and well written. There are tons of small touches that really make the difference as well. Coins flying out of dropped money bags, leaves falling from trees as you jump through them, etc. Great game, definitely pick it up!   Don't pay attention to my time played. Picked it up in the Groupees Greenlight 5 bundle and have more time in than Steam has registered.",
            "review_score": "1"
        },
        {
            "review_text": "Metroidvania with a really good balance between combat and platforming. There's a little bit of backtracking here and there but mostly for items and not actually progressing the main quest. The story, characters and script are original but the dialogue (especially among your party characters) can be hit or miss at times. The music score is good. It reminds me of the music in Super Metroid, mostly serving as background environment music, so you'll either notice it or you won't. (Except for the warp rooms. You'll always notice the music there.)  There's little reason to play this game a second time though, unless you're hunting for achievements. And if you're hunting for achievements, keep in mind there is an achievement that requires you to beat the game within a time limit of 2 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Fun metroidvania with very funny writing. You get to switch between 3 characters with special abilities, but unlike Trine you can only do it at camp fires (checkpoints.) Not very long or hard - I finished it in 7.5 hours and spent a bunch of that time looking secrets &amp; missed items. ",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: I usually can't be bothered to beat a game without several endings twice, let alone speedrun it. I did both of those things with this one. I can't think of a higher praise.  Magicians &amp; Looters is a metroidvania, basically a nonlinear action platformer. You can switch between three characters, all of which get several unique abilities needed to bypass obstacles. They also fight in different ways – one is focused on all-out DPS and blitzing (which is basically filling a rage bar and getting buffed for a limited time), one on mobility and special moves, and the last one on defense and spellcasting (however, mana regen is quite slow, so you will be hitting things with his sword a lot anyway).  I have found the gameplay to be fun, with just the right amount of challenge. I also like looking for secrets, and this game is filled to the brim with them. Exploration is rewarded with experience orbs, which level up and improve your characters, items with many unique properties suited for different playstyles, and money, which you can spend to buy more items at shops or to utilize one of several 'Toll-a-Warp' quick travel stations. The variety of moves each character has isn't too big, so combat can become a bit repetitive. The number of enemy types isn't too high either. However, the game is well-paced with combat interspersed with platforming, so none of those become too much of an issue. A special mention goes to bosses, several of whom I have found to be quite original and fun to beat.  The aesthetic is simple and functional, but pleasant to look at. The soundtrack won't blow you away, but the tunes are relatively catchy. The highlight of the game is its writing – while the story isn't deep or complex at all, there is a huge amount of absolutely hilarious dialogue and banter between the characters. The game pokes fun at many different fantasy and videogame cliches. You can choose to switch on an 'Abridged mode', which makes the dialogue less verbose, but keeps some of the fun. There are also 3 randomly chosen beginnings with different dialogue and I recommend you play all of them. I have been playing many 'serious' games lately, and this was a welcome breath of fresh air.  The technical aspect of the game is quite solid. It runs well and I didn't find many bugs. The only issues that I did run into is that an enemy once teleported behind an unbreakable locked gate which required me to beat all enemies in the room to open (I just had to run out of the room to reset it), and a few times the game got stuck mid-room transition. The only solution I have found for that is restarting the game, which results in lost progress. Fortunately, the game is very generous with the amount and placement of save spots, and the issue itself only happened two times in my 10 hours of playing.  Overall I recommend Magicians &amp; Looters to anyone seeking a light-hearted metroidvania with just the right amount of challenge. However, even if you aren't a fan of this genre, there is a lot to like in this game.",
            "review_score": "1"
        },
        {
            "review_text": "I've heard this game described as Metroidvania, but it's really more than that, with RPG elements mixed in with three different characters (and you will have to use all three to progress in the game) with different capabilities.",
            "review_score": "1"
        },
        {
            "review_text": "Great game , remember castlevania !  and it has a good humor :D",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game with humorous writing, fluid and fast gameplay, and three characters you regularly switch between and who all play differently. The game isn't too long, took me about 6-7 hours at an easy pace. The controls are very tight for the most part, and the gameplay is solid throughout. Some of the later boss fights can be a bit frustrating, but with some practice you'll eventually beat them.  Overall, well worth the money for a relatively short and solid experience.",
            "review_score": "1"
        },
        {
            "review_text": "The game itself feels unimpressive. The graphics seem unpolished, the dialogue is childish, and the gameplay itself is simple and not very exciting. Overall, the game seems like it brings nothing new to the genre, and isn't very fun to play.",
            "review_score": "-1"
        }
    ]
}