{
    "app_id": 284770,
    "name": "Enigmatis 2: The Mists of Ravenwood",
    "release_date": "2014-06-05",
    "developer": [
        "Artifex Mundi"
    ],
    "publisher": [
        "Artifex Mundi"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Hidden Object",
        "Adventure",
        "Casual"
    ],
    "achievements": 36,
    "positive_ratings": 872,
    "negative_ratings": 22,
    "price": 6.99,
    "description": "Enter Ravenwood Park and discover the secrets hidden in the mists…",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/284770/header.jpg?t=1460372689",
    "minimum_requirements": "Минимальные: ОС: Windows XP, Windows Vista, Windows 7, Windows 8 Процессор: 1.5 GHz Оперативная память: 512 MB ОЗУ Видеокарта: 128 MB VRAM DirectX: Версии 9.0 Место на диске: 1 GB",
    "recommended_requirements": "Рекомендованные: ОС: Windows XP, Windows Vista, Windows 7, Windows 8 Процессор: 2 GHz Оперативная память: 1 GB ОЗУ Видеокарта: 256MB VRAM DirectX: Версии 9.0 Место на диске: 1 GB",
    "reviews": [
        {
            "review_text": "I don't usually play these point and click adventrures but the story in the trailer had me very intrested, I'll have to say I wasn't dissapointed either. Once I started the game I had no intention of sitting there for the 4 hours that I did. I found it kinda relaxing and the story was actually decent. I found myself actually wanting to solve the mystery and paying attention to the story. The puzzles aren't extremely hard and there is a casual mode if you are having trouble. The graphics were decent in the cutscenes and sceneries and the voice acting was even played out pretty well. All in all I enjoyed it and am getting ready to play the new part I just unlocked. I think its worth the money, especially with the current 30% off.   ",
            "review_score": "1"
        },
        {
            "review_text": "This was a drunk purchase and an excelent one at that. Puzzles that challange and a good story to boot. This runs beautifully on my linux machine. The graphics, the sounds, gameplay, everything is just a solid all around nice package. This is a must if you are into these types of games.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great example of the casual adventure genre. Yes, it is technically a hidden object type game, but there's variety in the types of puzzles. You can do hidden object minigames or mix it up with a type of two of a kind card matching game. There are standard point and click adventure elements, very nice graphics, decent sound and voice acting, and a story that's not too shabby. The story was decent enough that I was a little bit disappointed that the first one in this series wasn't available on steam. There were numerous references to events that happened in Enigmatis 1, which is not available on Steam at the time of this review.  This version of Enigmatis, which is actually the Engimatis 2 collector's edition, contains both the main story (about 4 hours long) and a side story that's maybe 1 hour long. The side story adds a bit of back story to the main, so don't play it until after completing the main game, as it will spoil the few twists in the tale.  My personal opinion on this game, as with all games, is that fair pricing depends on the value you feel it brings. This game has very little replayability as it is story based with little variation in puzzles between playthroughs. The story is relatively short, but it is a great example of a short, casual adventure game. I recommend it, but I wouldn't pay more than $6-7 for it.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly good. The hidden object sequences actually make sense and are fun. Good artwork as well.",
            "review_score": "1"
        },
        {
            "review_text": "Nice point and click hidden object. Worth a fiver.",
            "review_score": "1"
        },
        {
            "review_text": "  Good hidden-object game. I made the mistake of playing it before the prequel though, so I was a bit clueless about the story.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Artifex Mundi games out there! ",
            "review_score": "1"
        },
        {
            "review_text": "While I am new to this genre of game, I really enjoyed it immensely! I have played just basic Hidden Object games in the past, that did not include a story line, point and click, or other puzzles. This game, was amazing. The graphics were surprisingly good, story line kept me interested, and the puzzels were not -overly- hard to solve. I played through on Casual, and it lasted a good 6 hrs. Of course, due to not knowing there were certian things I should be looking for in order to achieve certian other goals during game play, I missed a few things. No worries though, you can always go back through and replay on different difficulties...granted, the story line doesn't change, you just don't get as many hints/clues.  I would reccomend this game to anyone who likes hiddeen object games or puzzle games, and won't mind that there is a story line involved.  Over all, I give this game a 10/10! :)",
            "review_score": "1"
        },
        {
            "review_text": "Artifex Mundi are great developers. Their games never seem to have the kind of bugs that ruin other hidden object games. The hint button always works and most of the puzzles are solvable by mortals. You don't have to be a genius to play and the artwork is very nice.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game during sales, without sincerely double-checking whether it was worth it or not.  To my surprise, it was a rather interesting adventure - Hidden objects hybrid detective game. The plot was quite catchy; Subliminal messages suggesting to the player several interconnections between the characters, as well as possible outcomes. Personally, it took me a (steam) played time of 4 hours to complete the main story and the subplot that unlocks right after.   P.S Overall really pleasant experience.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely loved the story and game play of this, being as I have hardly played any point and click games. I would definitely recommend purchasing this. I also would like to say I hope there is another continuing this story!",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy it",
            "review_score": "1"
        },
        {
            "review_text": "Love how this game isn't just another hidden object. It involves puzzle solving, logic detective work, etc. and a great in depth story line. Hard to not play this and stop. Incredible graphics and animation too.",
            "review_score": "1"
        },
        {
            "review_text": "  Nothing but good to say about this game, i was already hyped to play a point and click game witch reminded me about once i played in my childhood. Great story and way in which the story is told. Entertaining puzzels and somewhat familiar and cozzy sounds/music. just an overall a great choice if you want to play point and click adventure game. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is so cool.But it needs to be longer. because i finished it in 0.5 hours :)",
            "review_score": "1"
        },
        {
            "review_text": "High quality HO game. Good mix of puzzles, story and HO screens. Very few problems. Game seems to get slower if run for a 2 hours or so. Just restart the game. The HO screens where you get pictures of the objects instead of names are not so good. But you can also play an alternative game if you want to skip these. But overall the HO sections are relatively easy compared to some other games. Less challenge, but also less frustration.",
            "review_score": "1"
        },
        {
            "review_text": "urgh. aimed at Mums. Very cheesy.",
            "review_score": "-1"
        },
        {
            "review_text": "Just... amazing. The animations, the story, the characters, the illusion world... all of it. One of the best HOG games I've ever played. It worth every step. Can't wait to Enigmatis 3. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game reminded me how much entertainment you can get from a nicely done point'n'click adventure game - engaging story, very nice gameplay, numerous puzzle types and gorgeous looking graphics. Will play all their other games too :)",
            "review_score": "1"
        },
        {
            "review_text": "Nice point and click. The plot is not that interesting, but the game is well balanced: by the time you get bored or stuck, a hint is avaiable. It is not about being able to finish the game, but rather to occupy some time. Nothing special, but having basically no bug or issue and never being frustrating... it is hard not to recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed the game. My daughter and I had fun with the little bit of creepiness mixed with the suspense. I liked I didn't have to screen the game before playine it around my children.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good sequel that spins on the story from the first game, suprising twists and cool puzzles. Though the puzzles in this one is a bit more easier than those in the firts game.  But that is just my own opinon. :)",
            "review_score": "1"
        },
        {
            "review_text": "10x Better then the first, finding what the preacher actually is, was cool. iz naice, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A very good adventure for casual gamers! Graphics and music are very beautiful, story is intriguing but nothing memorable, puzzles are logic, not so hard, and don't require lateral thinking. It's a causal adventure game, so I suggest you to play it only 30-40 minutes at a time, to avoid the 'more of the same' effect. It's very good to relax your mind: buy it without hesitation.",
            "review_score": "1"
        },
        {
            "review_text": "I really liked this game, good story and I quite liked trying to find the butterflies. Definitely kept me engrossed!",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy puzzle adventures, and this one is no exception. Great artwork!",
            "review_score": "1"
        },
        {
            "review_text": "This is Artifex Mundi's masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "I played through this game today and have very little criticism for it. It's an engaging hidden object game which develops the story of the first game in the series into something much more gripping and interesting. I'm really looking forward to the next game.  Drawbacks: As before the bonus adventure is very weak compared to the main game, with some terrible translation into English, and just in general a less gripping story. However, this has improved a lot since the first game.   Also, you will have to play the main game at least twice through to get all of the achievements, and the game and Steam differ to some degree on counting your achievements. (I believe the game requires you, for example, to find all Illusory Objects and Ethereal Butterflies on a given playthrough, whereas Steam gives you the same achievement even if you find some of them on one playthrough and some on the other. And there were a few achievements I got without being notified, such that I kept trying without realizing they were complete. The second playthrough unfortunately doesn't go *that* much faster than the first.   I would say that total playtime is about four hours for the first playthrough, an hour for the bonus adventure, and three hours for a 'quick' second playthrough to mop up achievements. This may not sound like a ton of game compared to other genres, but it's on par with most hidden object games and presents a reasonably good story.  All in all, if you like the genre or liked the first game in the series, this is a no-brainer.",
            "review_score": "1"
        },
        {
            "review_text": "Long, intense, interesting, adult. One of the best HO games i've played so far. Play the 1st episode before playing this one! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "A nice continuation of the story, Enigmatis 2 not only looks prettier than Enigmatis 1, but also adds a few new things to the mix. Though I found the puzzles to be generally on the easy side, certainly easier than the first game, I liked the addition of finding the illusive objects and ethereal butterflies. At around 7 1/2 hours of gameplay, I think this game is fun and worthwhile, especially if you get it on sale.",
            "review_score": "1"
        }
    ]
}