{
    "app_id": 284790,
    "name": "Nightmares from the Deep 2: The Siren`s Call",
    "release_date": "2014-05-15",
    "developer": [
        "Artifex Mundi"
    ],
    "publisher": [
        "Artifex Mundi"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Hidden Object",
        "Adventure",
        "Casual"
    ],
    "achievements": 29,
    "positive_ratings": 561,
    "negative_ratings": 24,
    "price": 6.99,
    "description": "Answer the siren`s call and defeat the cruel Mayor Murray and his pet sea monster, the Kraken",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/284790/header.jpg?t=1530538932",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 1.5 GHz Memory: 512 MB RAM Graphics: 128 MB VRAM DirectX: Version 9.0 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 2 GHz Memory: 1 GB RAM Graphics: 256MB VRAM DirectX: Version 9.0 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "It's an Artifex Mundi point and click / hidden object / puzzle game! I have no shame in finding these to be a guilty pleasure, because they're a nice change of pace from more demanding games. This one maintains the devs' usual decent standards, with generally good presentation throughout (with some weird exceptions, as though a different artist was roped in at knife-point to fill in certain gaps). The formula does wear a little thin towards the end, and there's a certain sense of going through the motions that's not evident in the first two thirds of the game. You know the drill: explore locations, pick up items, do hidden object scenes to find necessary objects to solve puzzles (in this game, they really like 'swap the pieces around so they form the right picture / match the background'), and listen in horror to some stilted voice acting. It starts well, with much drama and a cutscene that they probably blew half the game's budget on (this probably explains the marionette-like animation later in the game), and then settles into a comfortable formula. Towards the end it actually starts to get, dare I say it, quite exciting! I nearly spilled my tea at one point. The dramatic music helps, and threads begin to wrap up towards the big showdown, but it never really challenges you and feels a bit anticlimactic. If you get 'stuck' it nearly always means there's a new hidden object scene that's opened up somewhere on the map, and you have to wander around until you find it. Frustratingly, there are occasions where apparently useful objects can be seen in the background art, but which are non-interactive (in reality the location of the object you need is elsewhere). It's sloppy. Removing useful objects (like a hammer) and then requiring you to find another one later in the game is also annoying. However, like its terrible voice acting (one actor is wildly inconsistent, seemingly forgetting the character he's playing mid-sentence on several occasions), it comes with the territory.",
            "review_score": "1"
        },
        {
            "review_text": "A typical HOG game (2nd in the series) with an above avarage story which is defined nicely on the Store Page. Features the usual Exploration, Inventory Items used to advance to next area, start puzzles ect., &amp; Puzzles. You can chose between doing HOG's or Mahjong at various points in the game.  It requires 2 playthroughs to obtain all Achevos. 1 doing HOG's &amp; 1 doing Mahjong.",
            "review_score": "1"
        },
        {
            "review_text": "After saving Remington's soul in the Cursed Heart, Sarah Black wrote a book about him and is ready for an exhibition. However, a stranger with a mysterious package shows up one evening, triggering a fight between fishmen and him. He's explaining that his town, which was a heaven for pirates, became cursed because of the mayor and his pact with Davy Jones. A mermaid is captive and your friend wants to save her as he's in love with her. The only person that can correct everything is you....  While the plot is great, I've been less impressed by it, maybe because the enemy is now someone really greedy and without anything to redeem.  The gameplay stays the same: point-&amp;-click, puzzles and hidden objects. Compared to the first game, nothing changed really apart now a search for different objects that are sometimes hard to spot (which is the weakest point of the game). As usual, the difficulty is well-balanced. And the bonus chapter is showing the aftermath of your actions.  The graphics are still beautiful, while you're still on an island, now, you're visiting a village, with its sewers, lighthouse, tavern or markets. People you're meeting aren't necessarily hostile to you, as they're also wishing for peace. As usual, Davy Jones is mentionned. Besides, the ambiance is still a surreal one. The soundtrack stays also good.  It is a great sequel anyway. While the game isn't innovative, it's still an agreable moment you will pass, so, don't hesitate too for that one.",
            "review_score": "1"
        },
        {
            "review_text": "This one was greatly improved from the first game, and I really enjoyed how they tied the story together. The cutscenes were not blurry at all, and the puzzles were a lot more challanging. I also like being able to move from place to place by a click on the map. There were a couple frustrating things, like trying to find the silver parrot and sea horses, but nothing that would turn me away from recommending the game to others. It is a very nice casual game to get out of the norm of other genres and one of my favorites to get into. I look forward to playing the third one of this collection now.",
            "review_score": "1"
        },
        {
            "review_text": "HOGs are my go to genre when I just want to relax from my hard core gaming habit.  While these game are relatively simple, they do require you to use some brain power but in a relaxing kind of way. The good HOGs have an involving story the poor ones simply just have you find objects.  The Sirens call, is a good HOG game. Actually this developer is quite good at this genre and gives the interested gamer a lot for their money. Like its other games, Nightmares from the Deep: The Sirens Call has good producton values, a nice story, good puzzles and generally fair HOG puzzles and music worthy of any AAA games.  This game is a sequel and I did like the emotional story of the first game better, but as far as HOG games go, The Sirens call was a great tale. And of course they set up the game ending with the promise of another sequel. And no, I did not feel cheated. The sequel will be anohter story.",
            "review_score": "1"
        },
        {
            "review_text": "Artifex Mundi games always have beautiful artwork and logical gameplay. The puzzles range from easy to difficult so everybody can enjoy them.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best hidden object games I've played. Most games of this genre do not have adventure, excitement, and the vast number of achievements that this one does. I like that aspect (achievements) because chances are you're going to play it again just to see where you missed that morphing bird or that golden octopus. Well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "I thoroughly enjoyed the first game and picked up the sequel right away. This is a fun hidden object game with a unique setting. The puzzles are good and the story is faily interesting. I will happily purchase future sequels and hope they are working on them. If you like Hidden Object games, get the first one and then pick this one up.",
            "review_score": "1"
        },
        {
            "review_text": "★★★☆☆   'The hidden harmony is better than the obvious.' (Pablo Picasso)   △ beautiful artwork, bugfree, easy to play, nice videos and great difficulty options, better sound quality than part 1, charming story ▽ a little repetitive, cheesy voice acting  ◇ A nice Hidden Objects Game with high production values, very relaxing to play. It shows that the developers love what they're doing. I'm looking forward to play part 3: Davy Jones.  ★★★☆☆",
            "review_score": "1"
        },
        {
            "review_text": "★★★☆☆   'The hidden harmony is better than the obvious.' (Pablo Picasso)   △ beautiful artwork, bugfree, easy to play, nice videos and great difficulty options, better sound quality than part 1, charming story ▽ a little repetitive, cheesy voice acting  ◇ A nice Hidden Objects Game with high production values, very relaxing to play. It shows that the developers love what they're doing. I'm looking forward to play part 3: Davy Jones.  ★★★☆☆",
            "review_score": "1"
        },
        {
            "review_text": "Early Artifex Mundi product.  Pro: Good Art OK Story OK Audio OK Puzzles Steam Cards Low system spec Can be played with #1  Con:  Ending Price $9.99 Repetitive  Overall: 5/10 +1 art, +1 card = 7/10  Grab it on sale and maybe part 1",
            "review_score": "1"
        },
        {
            "review_text": "Kind of a dumb game, but good for relaxing when you feel brain dead. Puzzles are easy enough to float through and there is a story here as well. Low frustration level so you are unlikely to punch your screen. Nancy Drew for grownups, but somehow easier than the HER games. Good for a couple hours of clicking. 7.5",
            "review_score": "1"
        },
        {
            "review_text": "Great guilty pleasure game. Sure, the voice over's are a bit cheesy but the puzzles and hidden object searches are good fun and never overly frustrating.   Want another sequel!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a HUGE improvement over the first game, for a simple reason - higher difficulty setting.  My major gripe with the first game was, that it simply held your hand through the whole game, indicating where the next clue would be found, every step of the way. In this game, you can chose not to have this. This brings in the whole 'adventure'-feel back in the game, as well as a range of other benefits:   - you appreciate the beautiful artwork more, since you actually have to examine it to progress  - The game lasts longer  - You pay more attention to the dialogue and story  A very good hidden-object game, 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "A great game, especially as part of the trilogy.",
            "review_score": "1"
        },
        {
            "review_text": "Fun HOG to play. Again despite not liking the pirate theme I actually had a ton of fun playing this one than the first one. I got this from a discount.  In this Nightmare Of The Deep 2 u will be going into a town to save a Siren and the townspeople from doing somthing bad,   This is the second game from the Nightmares From The Deep series. Let me tell u that everything was improved with this version than the first one.  The cutscenes are 100% much better than the first game. The first games resolution in cutscenes was just terrible. Sound is much better. Music was nice to hear. The voice acting was ok. The graphics are nice just like the first one.  One other thing is that there is a bonud story that was fun to play. The bonus story picks up from when u beat the game. Plus the bonus story leaves of from a cliffhanger.  So in all make sure to get Nightmares From The Deep 2 as I had a lot of fun playing this HOG. Then onward to Nightmares From The Deep 3:)",
            "review_score": "1"
        },
        {
            "review_text": "A must for everyone who played the first. Very entertaining, story lines up and good characters. The game balances puzzles and HOG scenes well.",
            "review_score": "1"
        },
        {
            "review_text": "The game was a bit less intuitive to play than the first one, but after five minutes I was okay.   It's one of those during which you have to collect random images (here birds, octopuses and squids). The one annoying things is that it doesn't show where you got those challenges, so you don't know where else you've got left to visit/revisit. (as it is with the Grim Legends series)  As for the story, I found it interesting. It gets better by the end, though, as we get glimpes of the big bad.  One thing though: they replaced the second workthrough by a bonus part. I almost ignored it, but the unlocked bonus is actually very important. It's definitively needed for the next games. I really don't see why they didn't just add it to the main game.",
            "review_score": "1"
        },
        {
            "review_text": "Today, I am feeling good that I managed to complete this game to it's very end and have now been given the chance to enjoy the bonus content also given at the end of this story,after the main story is over. I will return and do that later on as the game really pulls you in like a magnet and keeps you inside playing out your role till you are able to reach ,some kind of satisfactory progression. I like it for it's interesting story like environment and the range of puzzles available to be solved and objects to be found .There are still some puzzles to be solved and achievements to be unlocked ,so I will be playing it again, even though my main objective has been achieved. This game and story is worth buying and keeping as it is a interesting journey working like a detective looking for all the clues which lead to the end of the story. The availability of different choices of puzzles and the artwork ,the sounds enhance the overall experience and make the drudgery of finding clues and solutions a very enjoyable and rewarding experience.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting story, nice graphics, very enjoyable HOP game.",
            "review_score": "1"
        },
        {
            "review_text": "A great game, especially as part of the trilogy.",
            "review_score": "1"
        }
    ]
}