{
    "app_id": 284950,
    "name": "Pixel Puzzles: Japan",
    "release_date": "2014-04-17",
    "developer": [
        "DL Softworks"
    ],
    "publisher": [
        "DL Softworks"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Puzzle",
        "Casual",
        "Indie"
    ],
    "achievements": 26,
    "positive_ratings": 1870,
    "negative_ratings": 408,
    "price": 4.99,
    "description": "Pixel Puzzles: Japan combines traditional jigsaw puzzle style gameplay with light video-game interactivity.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/284950/header.jpg?t=1544285494",
    "minimum_requirements": "OS: Windows 10, 8.1, 8, 7, Vista, XP Processor: Core 2 Duo Memory: 1 GB RAM Graphics: DirectX 9.0 Compatible Storage: 85 MB available space Sound Card: Generic Sound Device",
    "recommended_requirements": "OS: Windows 10, 8.1, 8, 7, Vista, XP Processor: Core 2 Duo Memory: 2 GB RAM Graphics: DirectX 9.0 Compatible Storage: 85 MB available space Sound Card: Generic Sound Device",
    "reviews": [
        {
            "review_text": "I enjoyed Pixel Puzzle: Japan, for what it was.  This game was exactly what it claimed to be. A Jig-Saw Puzzle Game with the puzzles being pictures from Japan. It's fairly relaxing, due to there being no timer, alowing you to take as long as you need to complete each puzzle.  The game has 19 puzzles. There's not much variety, other than the different puzzle-pictures, &amp; different sized puzzles.  Sizes start at 60pieces, then 112 pieces, 153 pieces, 220 pieces, &amp; the last puzzle has 350 pieces.  There are 26 Achievements, &amp; all are easy &amp; involve finishing all the puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "If you like jigsaw puzzles and have enough patience to spend even a couple of hours until you finish one, then this game will probably be fun for you.  There are currently 19 puzzles to complete (with 2 extra recently added), each of them rewarding an achievement. The difficulty of the picture and the number of pieces scale with level. However, since this game does not have a save option, you might be required to allocate a few continuous hours from your time in order to solve some of the more difficult puzzles.   I also found a bit frustrating the fact that the available pieces move non-stop and stack on each other, making the selection for a certain piece very difficult. Even more so, when you click on a specific piece, the game often offers you randomly one from its vicinity instead of the targeted one.   More reviews on the  Lilly's Corner Curator page  ",
            "review_score": "1"
        },
        {
            "review_text": "A fairly straight forward jigsaw puzzle game, in fairness.  I think I got this game for free from some kind of site promotion and it seemed like a fairly easy game to 100% so I thought, why not?  After all, nothing wrong with a good jigsaw puzzle every now and then.   This is a nice and relaxed game for when you just want to chill out but exercise your brain a bit. (But not too much)  You have 19 main puzzles, which vary in size and difficulty and 2 bonus puzzles that must have been added in later on. The way it works is that the pieces float and move around on the sides of the screen in the water, you pick out pieces and put them together. Simple!  The only problem I had with this game was that towards the end, the bigger puzzles with around 300 or so pieces in the water, it became harder and more tedious trying to pick out the right pieces you want. Although it’s not all that hard to get around so that’s as far as you are going to get in terms of stress.   To 100% the game you just complete every puzzle. That’s it. It’s an easy one.  The scenes are nice Japanese themed scenes, some are harder then others but in general they are all nice to look at.  All in all it’s a nice little game to steer you away from the bigger more stressful games that you may have in your games library.   TL;DR : It’s a nice relaxing little jigsaw puzzle game, it’s pretty straight forward and it’s an easy 100%ed game.  ",
            "review_score": "1"
        },
        {
            "review_text": "At the beggining - it seems ok. Unfortunately in the half it becomes tragic... * too many puzzlez in the pond~ * you can't grab desired puzzle - sometimes it gives you another one...  There are also: * not so many puzzles * poor quality * you can't pair / 'glue' some puzzles together and move them as one big piece, which is sad in a biig puzzles  I would recommend that game for some people, but not for puzzlers.",
            "review_score": "-1"
        },
        {
            "review_text": "Most beautiful relaxing puzzle game I have found. It has alot going for it. Pluses-Nice music.  Floating puzzle pieces that you have to catch.  Nice pictures of Japan that you have to build. Cons-No save. You cannot save your puzzle so you have to build it all at once. It can take a really long time. Such an easy feature that is missing it seems.",
            "review_score": "1"
        },
        {
            "review_text": "  Before starting this review, I want to say that I like making puzzle.  The way you have to fetch every piece is downright frustrating, the music is really bad and bland, and you'll obviously get tired before finishing one, but there's no way to save your progress.  When you're trying to take a piece, be cautious since it's possible you'll take one of the 50 in the area. Unless you get rid of every other piece, you're never sure of taking the piece you want.  The real zen experience was to not ragequit in the middle of every puzzle.",
            "review_score": "-1"
        },
        {
            "review_text": "If you love puzzles, japanese gardens and a casual game that instantly puts you into a relaxed mood, this is for you! The different motives and tile shapes are beautiful and creative. When you put a piece on the right spot it locks in place - which makes it so much easier overall. Sometimes it's a bit tricky to chose a certain piece because they all float in a water basin. So it can be better to just deal with the piece you happen to pick. One by one. Being able to change the background colour is quite useful!",
            "review_score": "1"
        },
        {
            "review_text": "It's just a puzzle game, that's it. BUT that doesn't mean it's not fun, if you like puzzles, get it. If you don't like puzzles, why would you buy a game about puzzles?  I like this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first I've played of any of the puzzle games and I was surprised at how much I got into it. It's great for passing time and relaxing or distressing after a day of hard work. It;s especially great if you like puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first jigsaw puzzle game I've stumbled upon on Steam. It reminds me of the early 2000s Shockwave browser puzzles I really enjoyed in my childhood. It's very enjoyable due to its classic jigsaw elements. I would definitely play more similar games.   +  Jigsaw puzzle  +  Japanese theme pictures and traditional motives  +  Easy Achievements  +  Trading Cards (Emotes/Backgrounds)  -  No actual stack space for pieces     Personal Ranking:   7/10 ",
            "review_score": "1"
        },
        {
            "review_text": "This is the first puzzle game I bought on steam. I bought it when it was on a 90% sale and it gave me around 11 hours of gameplay (without repetition). What I like about this game is that the difficulty increases as you do the set of 20 puzzles. There is however one very frustrating outlier - puzzle nr 12. Across the levels, the puzzles pieces vary in their shapes (e.g. some have 'spears' poking out, others are curved) which keeps them interesting. I like the Japanese music and theme and I absolutely love that you, the monk, grow a beard and your hair turns grey the further you get into this game. Now with all of this being said there are 2 big issues with this game. First of all, there is  no save feature ! I had to leave my computer running overnight to complete a puzzle, because I simply didn't have 2-3 hours straight (and patience) to complete it. Secondly, the puzzle pieces keep moving on your screen, meaning that you will end up picking up the same piece a dozen of times, without wanting to do so, simply because it's on top of others/in the way. All in all, I would recommend grabbing this game when it's on sale and if the negative aspects don't bother you.",
            "review_score": "1"
        },
        {
            "review_text": "If you like puzzles then you will like this game! As the name itself says it has Japanese themed pictures and music to fit the atmosphere as you solve one of nineteen puzzles varying from 60 to 350 pieces per puzzle. As you solve puzzles you also absorb powers that can help you give insight into the puzzle you are solving. Atmosphere is also relaxing and you can simply rest your mind playing this game.  It has achievements, card drops and is simple and epic! I highly recommend this game to anyone who likes puzzles or a simple game to just chill out when you have nothing else to play.   It was free when I got it but even on sale or in bundles it's really worth getting it!  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Very relaxing jigsaw puzzle game, straightforward to play through and the periodic (earned) ability to have the image overlay is handy. Simple, easy to play and don't have to worry about the rotation of the pieces for visual recognition like you do with a physical jigsaw!  Looking forward to DLC packs of more puzzles, and other games from Decaying Logic. :)",
            "review_score": "1"
        },
        {
            "review_text": "First of all, the major thing about this game is the horrible controls and UI. As hard as ruining a casual zen game is, the managed it. Props!  The hardest part about this game is actually catching your needed piece, even when you see it. Your mouse will get anything BUT what you need.   Cons: Moving free pieces that make you fight for the right to pick them up, and not in a good way. Bad ui choices make you looking for the play button, and you click to find out what the other ones do, they dont make sense visually. Puzzles reset when you leave  Pros: At least the pieces don't rotate Piles you make tend to disperse pieces in order of puzzle placing, which is a boon",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoy this game. I love puzzles and I love the pictures of Japan, its so pretty! I would recommend it to anyone who enjoys jig-saw puzzles and pictures of Japan. There is a couple flaws to the game though that you should know before you purchase it.  1. Sometimes when you click on a puzzle piece that happens to be surrounded by other pieces, it may take you 50 tried before actually picking up the piece you want.  2. There is NO SAVING OPTIONS. And this can be a big issue when you need to take a break while in the middle of a puzzle, once you close out of it you can never go back to that progress you made. They really should fix that.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for a moment of peace and zen music this is the perfect game! Lovely sceneries form Japan that keep you busy for a couple of hours. I do recommend this game for those who love puzzles / jigsaw games.",
            "review_score": "1"
        },
        {
            "review_text": "A funny little game with easy puzzle up to challenging. Those people who like puzzle will like this lil game.",
            "review_score": "1"
        },
        {
            "review_text": "Rating: 6/10  Classic jigsaw puzzle game with various shapes and Japanese theme. Process is unlockable, you will go through 19 different puzzles, from 60 pieces to 350 pieces. I'm not sure if it is worth the money, but I enjoyed it playing from time to time. Also, it is a great pick-up for 100% achievement hunters.",
            "review_score": "1"
        },
        {
            "review_text": "Decent puzzle game. I wish that the pieces wouldn't move, as it makes them very hard to grab onto; but if you are patient then it isn't too hard to put the puzzles together.",
            "review_score": "1"
        },
        {
            "review_text": "Puzzle game! Nice to spend time, especially if you like japan! Really worth to get on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and relaxing.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of jigsaw puzzles, you will enjoy this game. Some levels really hard to complete and it takes time. But there is a few annoying things:    Only one music theme through all game. After the third level it bores. And level's environment all the same.    It is impossible to pick up piece of puzzle you need when you play 100+ pieces levels. Doesn't matter how hard you aim, you will pick up everything (even fish) but not the piece, which needed.  Hope these things have been reworked in other games of Pixel Puzzles series.",
            "review_score": "1"
        },
        {
            "review_text": "would puzzle again!!",
            "review_score": "1"
        },
        {
            "review_text": "Fun and relaxing game, have yet to advance to the more complex puzzles were the sheer number of pieces may get messy, but i like it so far. Its on sale now so i'd get it especially if you are like me and had no jigsaw puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Nice relaxing game, relaxing music and nice pictures of the puzzles. You can really see the beauty of Japan through this game,alot of puzzles to complete and pieces increase after each puzzle completed. Recommended 8/10 :).",
            "review_score": "1"
        },
        {
            "review_text": "Granma Simulator... SO RELAXING I'M GONNA DIE!!!  Beware though: at high levels it's gonna blow your eyes out worse then Beat Hazard and Super Hexagon together. And the sound of the water will make you go to the toilets every 5 minutes...",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what is the puzzle in this game... picking up the piece you want or the puzzles",
            "review_score": "1"
        },
        {
            "review_text": "It's a puzzle game. With koi fishies, calm men and wierd sound effects.  If you are like me who likes puzzles but has cats that just ruins the fun by playing with the puzzle, this is the saviour of all time!",
            "review_score": "1"
        },
        {
            "review_text": "It's up there with Dark Souls... Minus the dark",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game, with a relaxing music, even if it's nothing more than a classic puzzle. I just wish it was possible to save the progression of a puzzle, because the bigger ones are a bit long to complete in one run.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a big fan of jigsaw puzzles, and I was excited when I recieved this as a gift. Now... I really hate to write negative reviews, as I try to look at the effort and love that were put in to games. But sometimes there are just games that I can't give a positive review to. And sadly? This is one of them.     =Complete Review=",
            "review_score": "-1"
        },
        {
            "review_text": "The Good: Easy Achievements Nice Japanese music Casual puzzle game  The Bad: Cannot join pieces together unless they're locked on the board. Sometimes the pieces you pick up aren't the ones you meant to pick up Game does not save options.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ i didnt ♥♥♥♥ign want thaT PIECE NOW ITS MOVED AWAY ♥♥♥♥IGN WATER STOP MOVIGN THE PIECES I ♥♥♥♥ING SWEAR TO GOD ILL ♥♥♥♥IGN UNINSTALL NEXT TIME IT DOES THAT",
            "review_score": "-1"
        },
        {
            "review_text": "Pixel Puzzles: Japan is a couple of terrible projecting misconceptions, leading to creation of playable game - but only if you are really obstinate to complete it.  This game is a typical jigsaw puzzle, rarely found on steam (if not unique). It includes around 20 different images. As suggested, all of them are japanese-themed. So, you complete puzzles, and by this you level up this tiny monk in bottom-left corner, from acolyte to someone who looks as if was abducted by aliens. Higher monk levels unlock more challenging puzzles, and he levels up when you complete all but one pictures from tier. Actual game is simple: pick piece from the pond and move it to right location, where it will be automatically locked. While regular jigsaw puzzles allow you to see the complete picture - here it's a bonus. You unlock a glance at the picture by placing pieces in correct locations. Unfortunately - even in the biggest puzzles you can use it 2-3 times. Stated at the beginning - this game is a collection of terrible projecting misconceptions. Firstly - while not a problem at smaller puzzles, try picking specified piece on more difficult ones. It's literally impossible. If the pieces are in swarm (and in this tiny pond they are almost all the time), game picks not the one you selected, but one closer to left top corner (this leads to exploit - check guides at game hub for more info on this). Second thing that bothered me terribly - game settings restart after you turn off the game. It's pain in the butt - mute the game (as the soundtrack and effects are quite annoying) everytime you play. Finally, due to limited access to big picture - some puzzles have to be completed by trying to fit each piece in every place (like in picture with cherry blooms). To sum up, this game is a great example of production with wasted potential. Jigsaw puzzles are scarce on Steam, so it's a shame that game like this is done so badly. Good things? If you try really hard, you may have fun. Plus, achievements are pretty easy to get - completing the game gives you all of them.",
            "review_score": "-1"
        },
        {
            "review_text": "The object is simple, grab jigsaw pieces floating in a pond along the top and side edge of the screen and assemble them into a picture in the middle. No timer. No real special abilities or upgrades. No contrived storyline. Just a neat little way to pass some time and look at some pretty pictures.  Complexity is added along the way by increasing the piece count of new puzzles or by tackling a picture with fewer unique, easily identifiable features, but the most noticeable addition is the actual 'cut' of the pieces with each new stage. Initially we're introduced to the more conventional shapes we'd expect to see jigsaw pieces to come in, but as you progress things are mixed up by having the interlocking segments of the pieces cut into shapes relevant to the picture for that puzzle. So, a watery picture might have pieces with interlocking segments in the shape of waves, for example, or another set might have tiny little temples or trees connecting each piece (though no Godzilla shapes are anywhere to be found, sadly). It's a really fresh take on an old formula that manages to hold your interest and keep you guessing for longer than it might have otherwise, but thankfully this really helps it to stand out.  Another factor which makes it stand out is its presentation. Everything is presented with an air of tranquillity, from the constant gentle twangs of various Japanese string instruments, to the flow and splashing of water throughout that makes you want to go to the toilet at least once every puzzle set. Visually, there's no great flare or anything flashy going on, everything is clean and simple and in keeping with the overall style and tone of the game helping it make for a sedate and pleasant experience.  During my time with the 21 puzzles (19 regular, unlockable sets, and 2 'bonus' sets that are unlocked from the beginning but don't seem to count towards overall progress, oddly), I only found myself having any difficulty with two of the sets, which was partly down to the finale's piece count, but also the lack of distinct features on their pictures, which is one of the few minor complaints I'd have with the game. I know that the colours and shapes in each picture scene has to be kept relatively similar throughout, otherwise you'd find every piece way too easily, but that doesn't mean the images have to be uninteresting. It would have been nice to assemble something that was a greater showcase of Japan and its culture, like pedestrians crossing the Shibuya intersection or some talking toilets or a schoolgirl underwear vending machine. But, instead, we have to be content with some temples or golf courses. Which are OK... I guess.  Another minor gripe I had with it was the lack of a save feature. This isn't a problem for the easier early stages, but towards the end I could see it being a real issue for some as you might want to put an hour or so aside for a couple of the later, harder sets. Another, more pressing pain in the ♥♥♥, though, was actually selecting the pieces from the pond. Again, this isn't so much a concern at the start, but by the end the pond is so full of moving pieces that grabbing one out of it becomes a real problem, to the extent that more often than not the piece I clicked on wouldn't be what came out and I'd appear to have some near by random piece instead, with me having to remove all the unwanted surrounding pieces before finally being able to get the one I wanted. A really strange oversight in an otherwise well made game.  So, while it's not without its flaws, overall I really enjoyed my time with it. Full disclosure, I got the game free as part of a promotion on a bundle site, but even had I paid full price I'd still be happy with it. So if you've got a bit of spare time, a little patience, and some extra money to blow on a throwaway purchase, then I could easily point you towards this game to satisfy your crazy, insatiable jigsaw lust.",
            "review_score": "1"
        },
        {
            "review_text": "Sorry To say that but the game is very BOOORRIIINGG !",
            "review_score": "-1"
        },
        {
            "review_text": "It's quite amazing that a game about putting together jigsaw puzzles with a zen theme manages to be such a stressful experience.  It makes me wonder if the developers ever played with an actual puzzle, as most of the staples of it (ie, looking for patterns among the pieces, setting apart groups of them that seem like they go together, seeing where they fit with the whole picture, leaving the puzzle and going back to it later, etc) are just not possible in this game. Forget about going for specific pieces; you can click all you want on the piece that caught your eye, the game will still give you the piece it thinks you deserve instead. Since they're constantly moving, you'll helplessly watch them drift away from you over and over. The pieces do not `click`, with each other, they just snap to their place on the main grid. So much space on the screen is wasted with useless graphics and blank space that could have been used for much needed game space. The lack of a quick save is a big flaw as well.  The pictures are alright, if a bit uninspired and the shapes of the pieces are all nice and varied. The sounds are fine, but they do get grating after a while, especially since it's always the same, over and over.  The game is still playable, and you'll barely notice its flaws in the smaller puzzles, but it's all uphill from there. I managed to finish it, but that's mainly because I'm an achievement junkie, more than anything else.",
            "review_score": "-1"
        },
        {
            "review_text": "      Gameplay   (3/5)       History   (-/-)       Graphics   (2/5)       Soundtrack   (3/5)       Characters   (-/-)       Setting   (2/5)       Multiplayer / Co-op   (-/-)       Difficulty   (1/5)       Fun   (2/5)     ",
            "review_score": "-1"
        },
        {
            "review_text": "Yep, that's a puzzle",
            "review_score": "1"
        },
        {
            "review_text": "- lovely pics - new and interesting puzzle cuts - okay music, could do with variety - interesting puzzle pool concept, but may need new ideas for bigger puzzles, as pieces tend to overlap, making them hard to catch - no save feature.  - NO. SAVE. FEATURE.   6/10  for no save feature.",
            "review_score": "1"
        },
        {
            "review_text": "Kinda boring. Would not recommend. Received the game by chancery (1 hot random game on ♥♥♥♥♥♥♥) and felt screwed big time. NO NO.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, very relaxing and fun to play while you do something else (ie. watch a twitch stream or listen to music or a podcast in background)  I did get it for free though and would never pay $20 for a puzzle game. Besides the price-point it is a fun game... virtual puzzles without any ♥♥♥♥♥♥ bugs, you can't really mess this up.",
            "review_score": "1"
        },
        {
            "review_text": "Don't really need an in depth review on a puzzle game, but this is pretty chill. 420 n puzzle?",
            "review_score": "1"
        },
        {
            "review_text": "Music could be better, and they could do away with fishing out puzzles as its highly inaccurate and I often ended up picked up the wrong one. If steam had neutral review grade it would be neutral.",
            "review_score": "1"
        },
        {
            "review_text": "now I hate puzzle",
            "review_score": "1"
        },
        {
            "review_text": "Great fun and stunning pictures",
            "review_score": "1"
        },
        {
            "review_text": "I love puzzles and this game delivers",
            "review_score": "1"
        },
        {
            "review_text": "Very relaxing music and decent difficulty on the later puzzles. That being said, I do wish the game had a feature to save your puzzle. On the harder, higher piece puzzles it can take a while to finish. Without a feature to save, you will have to start over. To add to the difficulty, all the pieces move and overlap eachother on the side. This can become frustrating, especially on the higher piece puzzles when you have hundreds of pieces overlapping and moving. That is something that shouldn't happen on a game like this. 78/100",
            "review_score": "1"
        },
        {
            "review_text": "Got it for free at  indiegala.com   It's pretty entartaining and a game you gotta play if you're just relaxing. For me i play this game when my games needs to be patched. XD Anyway pretty fun game. :)",
            "review_score": "1"
        },
        {
            "review_text": "This game interface is bad, some piecies shapes are just awful and the way pieces that match together don't stick to one another is pretty anoying but I was still able to have fun.",
            "review_score": "-1"
        },
        {
            "review_text": "First of all, know that I'm not exactly a fan of jigsaw puzzles. I don't mind playing them sometimes, but I wouldn't consider myself being fond of them.  If you are a big fan of those, maybe the points I'll make won't be negative for you. If that's the case, feel free to disregard my opinion.  The main gimmick to this game is that the pieces move around. It wouldn't be so bad, but the way they made it, is incredibly frustrating.  The pond where the pieces float is rather small. In the beginning it's not a problem, since the pieces are big, and there is not a lot of them. Later on though, pieces get smaller, and there's a whole lot more of them, but the pond stays the same size, which results in hundreds of puzzle pieces being on top of one another, in giant pile that you can't do anything about.  And what's even worse, even if you somehow happen to see in that pile the exact piece you need at the moment, you won't be able to pick it up, unless there is no other piece next to it. That is because the controls are somehow broken, and the game will pick up any piece BUT the one that you are pointing at.  Another big flaw is the lack of saving your progress.  Later puzzles, combined with those broken and frustrating controls, can take several hours to complete, and you have to do that in one sitting or you'll be forced to start over. If you prefer it that way, great. But not everyone has the time and patience to do so, and such not even having the option to save is just bad design.  Other than that, it's just a regular jigsaw puzzle with regular photographs of Japanese scenery, which is why I also feel like I've been lied to a little bit. With a title being 'Pixel Puzzles' I expected, what else, pixel art, and I've got none of that.",
            "review_score": "-1"
        },
        {
            "review_text": "Very simple puzzle game. This is one of those games that you play when you literally don't know what else to do, and every other game in your library sounds boring. Quick time waster. The first puzzles are a bit on the easy side, but I imagine it gets more difficult the longer you play. Is it worth the $6.99 asking price? I wouldn't say so... Is it worth getting in a Humble Bundle like I did? Definitely.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun way to waste your time. Very addicting game!",
            "review_score": "1"
        },
        {
            "review_text": "After about 7 hours and a half in this game I think I can write a proper review for it. It has both bad and good things but it's not unplayable, despite it's flaws.    At first it was really fun, but as you play more and more you start to observe the problems with this game. And they are annoying:   1°) Lack of a save feature (last puzzle has 350 pieces and it took me about an hour to complete). If you are not patient enough, this game is not for you. You could Alt+Tab the game and do something else as a break from the puzzle, but I wouldn't do that to much (in the past I had some problems with some games on steam where I couldn't Alt+Tab because that would break the game).  2°) The music is kind of nice, but it becames repetitive quite fast. You could try to mute it, but that would mute all sounds of the game and there is a little click sound when you place a piece in the right place which I found quite useful.  3°) The images are nice, but have too many similar colors and aren't in HiRes. As the puzzles had more and more pieces it became quite hard to find the exact place where one piece would fit. It's even harder if you have a small screen (I played mine on a laptop and it was very painful and it placed a lot of strain on my eyes). The fact that it doesn't show you a big picture of what the puzzle should look like it doesn't help at all. It does have a little 'hint' thing where it shows you the picture for a few seconds, but it puts the pieces over the actual picture and when you have many correct pieces it became even harder to find where you should put the other pieces (you can move the pieces normal when this 'hint' it's activated). The 'hint' button is charged at random when you place pieces correctly; you need 8 charges and you can get them all in a row or you can place 20 pieces and won't gain a single charge.  4°) Picking the piece that you want from the pond can be really hard. Due to a glitch (or bad programming), if yhere are 2 consecutive pieces overlapped, it will ALWAYS give you the first piece (the left one) regardless of which is on top. This can actually help you to solve the puzzles (it is explained in guides how to do it), but it aomewhat kills the fun of doing a puzzle.    It has some good parts too:  1°) It has a decent variety of piece shapes, but sometimes this can be annoying.  2°) The pieces are always oriented the right way (you can't rotate the pieces). It the beginning it may seem boring, but later on you will be grateful that you don't need to rotate the pieces.  3°) You won't lose any of the pieces like you would with a classic jigsaw puzzle if you are not careful.  4°) Achievements are not hard. 24 of the you will get just by finishing all puzzles. You also have to catch the fish which is moving around in the water (you will probably do this by mistake) and you must the fish in the Shishi-odoshi (I think that's what it's called that water thingy at the bottom left corner).    Overall it's not a very bad game, but it's not worth 7 €/$. If you can get it in a bundle or on a sale (at least 66%) then you should give it a try (if you like jigsaw puzzles of course).",
            "review_score": "1"
        },
        {
            "review_text": "This puzzle game is a great time killer!!!  pros  you can catch the fish nice puzzle pictures that monk doe  cons  bzzz bzzz",
            "review_score": "1"
        },
        {
            "review_text": "A nice relaxing puzzle. To bad you can put your own/custom images yoursef into the puzzle",
            "review_score": "1"
        },
        {
            "review_text": "This game is a pretty straightforward collection of 21 jigsaw puzzles, with each puzzle depicting a different Japanese landmark.  19 of the puzzles are structured into unlockable tiers:  Tier 1 'Initiate' = six 60-piece puzzles,  Tier 2 'Disciple' = five 112-piece puzzles,  Tier 3 'Student' = four 153-piece puzzles,  Tier 4 'Scholar' = three 220-piece puzzles,  and Tier 5 'The All Knowing One' = one 350-piece puzzle.  You start off the game with access to only the easiest group of puzzles, and must complete every challenge in that bracket to unlock the next set of difficulty.   In addition to these tiered sets, there are also two separate bonus puzzles, available at any time from the golden section of the selection screen. They are in line with the higher difficulty settings, one because of its high piece count, and the other because of its unusual piece shapes.   That's one thing I really like about this game, it plays with the overall shape of the pieces and with the interlocking edges. While there are a few puzzles that utilize the traditional silhouette, most of them mix it up with non-uniform sizing and unique key designs (spirals, arrows, prongs, pinking sheared, jagged scallops, etc).  As far as the puzzle gameplay is concerned, the format is simple. You start out with a blank 'sand garden' space where you build your puzzle, surrounded by an L-shaped koi pond that houses your unused pieces. You then use your mouse to pick up pieces from the pond and move them around the game board. When a piece is dropped close enough to the correct placement, a sound effect with play and it will snap into place.   Overall, the game is as basic as it gets. You can change the colour of the sand, you can adjust the volume of the music, and you can switch between fullscreen and windowed, but beyond that there isn't any additional functionality:  - You can't save your progress mid-puzzle. If you exit a puzzle screen, either to the main menu or to the desktop, you forfeit any work you have done so far (completed puzzles stay completed, however).  - You can't turn off the water feature. The unused pieces in the koi pond are constantly floating, moving, and overlapping each other, and the pieces that appear on top of the pile are not always the ones that will be picked up by your mouse. This is not really a problem when you are dealing with 60 pieces, but on the harder difficulties you will spend half of your time trying to fruitlessly and frustratingly fish out the pieces you want from the pond. - There is no zoom mode. The board size remains the same regardless of piece count, so on the higher difficulty tiers it gets harder and harder to see the edges of the pieces. - You are unable to consult even a thumbnail of the image you are working on during a puzzle. - You can't build sections of the puzzle independently and then move those sections into place.  - The 21 puzzles are always the same on every playthrough.   While you are puzzling, you are entertained by occasional snippets of music. There are a handful of motifs programmed into the game, each one no more than 10-30 seconds long, and each one sounding like the introduction to a song rather than a complete melody. Sometimes you will hear a refrain and then 1-2 minutes of silence. Sometimes the game will play a medley of snippets back-to-back. Sometimes the game will play the same snippet back-to-back. It's possible that the music is somehow tied-in to what actions you are doing, but I couldn't discern any predictable pattern or rationale. Honestly, the snippets themselves were enjoyable, atmospheric, and in-line with the cultural aesthetic of the game, but their length, and the inconsistency of how they were played, was distracting and annoying. (What the music thought it sounded like: 'Nostalgic touches of music, liltingly carried on the wind, falling on your ears like leaves falling from trees...' What the music actually sounded like: 'A child haltingly and repetitively trying to learn shamisen in the apartment next door.')  There are 26 achievements for the game, which basically boil down to 'play all the puzzles and mess with the fish.' You will automatically unlock 99% of them in one playthrough.  TL;DR - If you are just looking for a casual and basic jigsaw game with a good number of puzzles, creative piece designs, and featuring postcard-quality images from Japan, then this is 100% the game for you. However, if you are looking for a high-challenge, high-frill game with adaptive puzzles, sectional construction, zoomable game boards, a rocking soundtrack, and advanced save features, then this is simply not going to meet your expectations. For what it is, and what it claims to be, it does a pretty decent job.   I received this game for free as part of a bundle, and got 11 hours of mostly-fun gameplay out of it. I would give it a 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "1234323",
            "review_score": "1"
        },
        {
            "review_text": "A very enjoyable game. it is a good timewaster and quite addicting. The puzzle pieces are different types of shapes every new puzzle making it different and sometimes harder for the puzzels.  I would rate it 7/10 only because it doesnt have many puzzels for you to complete so they need to upgrade it a bit!",
            "review_score": "1"
        },
        {
            "review_text": "A true to life puzzle-game, it'll leave you searching for that missing edge piece until the leave end. If you like puzzles, go for it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty good game. It took 7.8 hours to complete the entire game (19 puzzles) and get all the achievements. There is nothing wrong with the game technically and it works perfectly. The pictures that make up the puzzle are great. There is a lot of variety in puzzle cuts.   The only negatives are the music and grabbing the pieces in the river during larger puzzles. The music is redundant so I turned it off and listened to the radio instead. The game has all of the puzzle pieces floating in a river above and to the left of the puzzle area. When it gets crowded with a lot of pieces in the more difficult, larger puzzles at the end of the game, you very rarely grab the piece you are clicking on. Gets annoying and adds more time to the puzzle. Also, when you grab a piece and don't need it and drop it back in the river it doesn't land where you put it and just disappears and gets mixed up with the rest of the pieces again (so you can't set a piece to the side for later).  If you like jigsaw puzzles you'll like this game and for the price you can't go wrong.",
            "review_score": "1"
        },
        {
            "review_text": "The best of Pixel Puzzles series. If you want only one of them, this is it. Nice relaxing music, beautiful puzzles, interface is good :) it has trading cards and achievements as well. And i am not sure if you can find any other puzzle game on steam. Or, why looking for something else, when there is Pixel Puzzles Japan :) Price 7€ is maybe little high, but it is often on sale, and for 3€ it is perfect game to spend your time, if you love puzzles, and japan as well (soundtrack).",
            "review_score": "1"
        },
        {
            "review_text": "The hardest part about this game is not finding the right place for each puzzle part but to pick the desired parts up. Lose pieces floating around the puzzle might look good - but it takes forever to find that specific part you want to pick up because there are others floating over it and when you push the other parts away (this is possible) you also push the part you wanted to pick up away.  If you do not have enough time to solve the entire puzzle and have some real life duties... bad luck. You cannot save while you're in the middle of your puzzle. Progress lost.  If you find two or more pieces which belong together: you cannot stick them together unless you know the right place on the picture.",
            "review_score": "-1"
        },
        {
            "review_text": "As a puzzle-lover I loved this game. It's beautiful, not too easy (on higher levels) and not too hard. Great game to put your mind off for an hour or so.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ok - better than the ones before it, but still not great. Not sure who was the genius who decided to block off half of the screen with random graphics, jamming all the pieces in the other half. On the larger puzzles, this makes it very difficult to actually click on the piece you want. You normally need to move half of the pieces on the main puzzle to thin out the choices before the game will respond to you.   Pixel Puzzles: Anime has a much improved UI, and is what you should buy if you are only picking one up.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice and relaxing game =)",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome puzzle game like the real Puzzle that you can buy and assemble, the only difference between them is you don't have to worry that you misught misplace some of the puzzle pieces because its all in here intact digitally, and cannot be use during power outtage or brownouts. I really have fun playing this game 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I would've never expected to get so hooked on a puzzle game",
            "review_score": "1"
        },
        {
            "review_text": "Atrocious gameplay. Trying to fish a puzzle piece out of the pond on the higher difficulty puzzles rage-inducing, since the game will give you every piece EXCEPT the one you clicked on.  Puzzles are pretty though.",
            "review_score": "-1"
        },
        {
            "review_text": "Very good,I love music in game",
            "review_score": "1"
        },
        {
            "review_text": "I dig on some jigsaws, so I figure I'll give this a try. Helping the waterhead who dumped all the puzzle pieces in the pond. Should be a good time right? That's what I thought.  The pieces floating around in the pond are a test of patience and ultimately end up being extremely frusterating. Not the kind of thing one expects from a little jigsaw game. Oh but why is it frusterating? This is where the game fails. Say you see this nifty little piece, you know exactly where it goes. The piece is floating right on top even! :happy click: Nope, you didn't get the piece you wanted to pick up, the one your mouse was over. Okay, no big deal, lets try again. :click: Nope, once again you've managed to pick up some other piece you weren't hovering the mouse over. Hey one more time, why not? :click: Yes, the trend continues, picking up any piece but the one you actually wanted.  That's the game in a nutshell. Trying like hell to pick up the one piece you'd like to select, the piece logic says you should select, the piece you'd like to place. Only to find, you pick up any piece but the one you're hoving over.  This is one of those sadistic games that you think will be cool, spend a few minutes playin and relaxing. Only to have it end up being a frusterating experience of head meets wall every time you try to select a piece.   On the plus side of things, you can pick up the fish no problem any time you want and watch it flop around. Even with that bit of playing sadist back to the game, it's not worth it and the fish doesn't have it coming.",
            "review_score": "-1"
        },
        {
            "review_text": "It is just a puzzle game with nice japanese images. No more, no less, which is exactly what I like at this game. You can just relax and solve a few puzzles. However, the click detection is realy frustrating. If puzzle pieces lie on top of each other, It takes quite a lot attempts to get the right one. A larger number of puzzles would also be nice, preferably with randomized puzzle pieces in order to increase the replayability.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best puzzle games that exist on steam",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing and fun altough the music is bad.",
            "review_score": "1"
        },
        {
            "review_text": "The game is poorly coded and is not visually appealing, so the whole experience is really far from the tranquility and meditativeness it must supply. The music and sfx is really good, and the price is fitting (I'm talking, of course, about the offer of getting it for free), but even so the overall experience is not positive.",
            "review_score": "-1"
        },
        {
            "review_text": "After completing all the puzzles and therefore earning all the achievements, I feel competent enough to tell you about this game. But man, it sure is hard to review it. Why is it hard, you ask? Well, if you came here to get a game that allows you to piece together jigsaw puzzles, it's exactly what it is. But still, even a simple game like this can have numerous issues that will ruin your experience with it. And this one is no exception. The first thing and the most obvious thing is the fact that you can't piece together one small part of the puzzle and keep it somewhere to the side so you can use it later, after you make some progress on the 'big picture'. Every piece has its designated place on the board, and you can only put them there one at a time, after which you can't move them anymore. The second thing is the fact that those puzzle pieces float around in the water that surrounds the board. Why is that a problem? Well, on the first few 60-piece puzzles, it isn't. You can get most of the pieces easily or with just a bit of stressful effort. But when you get to those bigger puzzles, then you'll notice this game's main flaw - the inability to properly grab a piece. Whatever could that mean? It means that the game grabs EVERY. SINGLE. PUZZLE. PIECE. AROUND. THE. ONE. THAT. YOU. WANTED. BUT. NOT. THE. ONE. THAT. YOU. WANTED. It is so frustrating that you will be tearing your eyes out after not grabbing your piece for the 20th time. I'm not even kidding, one time I counted how many tries it would take to get the piece that I wanted, and I stopped counting after I had passed twenty. But wait, that's not all. How could it be all? It seems that the developers really wanted to make you feel the water that the pieces float in, so they tried to make this 'splash' feature where, after you drop an unwanted puzzle piece into the water right above some other floating pieces, those floating pieces that were 'underneath' the one you dropped will get moved to some other place in the water. And that is really annoying, because you'll always be grabbing onto unwanted pieces, and when you accidentally let go of your mouse click, the piece that you wanted will be lost within the maze of floating pieces that all look alike. And get this - that piece-grab recognition failure occurs in every puzzle but the last one. The last puzzle is pretty smooth and it just makes me wonder why it couldn't be like that before. It's like the developer knew how to make the piece-grabbing responsive, but decided to troll you the whole time until the last puzzle. As far as music goes, I guess it's okay if you're into that whole Japan-style culture, but I still think it could have been much better. An occasional oriental sound or two with long pauses in between doesn't make a relaxing soundtrack, it just manages to surprise you every time because you totally forget there's even a soundtrack in this game. The puzzles mostly feature japanese architecture, so if you like that too, I think you'll be satisfied. I myself would have preferred a puzzle game featuring animals, to be honest, but that's just my misanthropy speaking. (lol) Oh, and each puzzle has its pieces cut into different shapes, so that's pretty cool! It helps keep each puzzle fresh, in my opinion. But ultimately, I'm supposed to tell you if you should give your money for this game, and I believe you shouldn't. Seven euros is simply too much for a game with this many flaws. I'm glad I got it for free on indiegala, so if you didn't get it there while it was still available and you simply feel the need to get it, at least buy it on a sale or in a bundle. Those seven euros can be spent on better things, whether here on Steam, or in the offline world.",
            "review_score": "-1"
        },
        {
            "review_text": "Bored? Try this",
            "review_score": "1"
        },
        {
            "review_text": "Well... i think it can be good game for fans of puzzle games, but... i'm not fan of puzzle games. First some levels were good, but next, where the're are 112 and 156 pieces were annoying and boring, and on each of this levels i was just waiting for end with my reaction 'finally'. I just want to get cards from this game and achievements and i will uninstall it. Homever, like i said on start, it can be (probably) good game for fans.",
            "review_score": "1"
        },
        {
            "review_text": "The concept of having pieces to a puzzle floating in a koi pond is cute at first, but quickly becomes the antithesis of 'zen' mentality from playing this game that the makers seem to be going for. Once the puzzles have more pieces and the floaters clump together, it becomes more of a game of 'let's see if I can get the piece I need THIS time' as one repeatedly, with frustration and mostly without success, clicks wrong piece after wrong piece after wrong piece... then the RIGHT PIECE!... only to misclick and lose it again.",
            "review_score": "-1"
        },
        {
            "review_text": "Ooooooh! WELLLL!| Pixel Puzzles may seem not very difficult,but at further levels u understand that u were wrong. The last puzzle made me cry:D 5+",
            "review_score": "1"
        },
        {
            "review_text": "this game has been alot of fun",
            "review_score": "1"
        },
        {
            "review_text": "Nice puzzle game. My 3 year old son that the koi was hilarious, especially when it swims across the screen if you take it out of the water. The graphics were nice. However, there is no saving, auto or manual. So, expect to sit down and either complete it in one go or have it running in the background while you do other things. If you exit before you completed all the puzzles, you'll have to restart in your Achievement quest.  I would recommend this game, although I have been told the other Pixel Puzzles are better. I'd try to catch this one on sale since the nonexistant saving gets REALLY frustrating (especially when you want to take a break and play a different game!)",
            "review_score": "1"
        },
        {
            "review_text": "  Who else wrote a rappy review to get a bages. Yeah it was free and has cards. Enjoyable and challanging if u like these type of games.",
            "review_score": "1"
        }
    ]
}