{
    "app_id": 285130,
    "name": "Battleplan: American Civil War",
    "release_date": "2014-07-04",
    "developer": [
        "The Mustard Corporation"
    ],
    "publisher": [
        "KISS ltd",
        "Osprey Publishing"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats"
    ],
    "genres": [
        "Casual",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Casual"
    ],
    "achievements": 95,
    "positive_ratings": 124,
    "negative_ratings": 126,
    "price": 6.99,
    "description": "Battleplan: American Civil War introduces you to fastplay wargaming, a new kind of strategy game experience. Take command of either Confederate or Union troops and fight your way through eleven of the American Civil War’s most famous battles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/285130/header.jpg?t=1447360731",
    "minimum_requirements": "最低配置: 操作系统: Windows XP 处理器: Pentium 4 or Athlon 64 内存: 1 GB RAM 图形: GL 2.1 存储空间: 需要 400 MB 可用空间 声卡: Integrated",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A fun little game for the casual armchair general. Playing out the great battles of the civil is kind of fun when you stick to the tactics that were actually used. The AI has a number of battleplans that they use against you in any given battle, and while that is where the depth ends, it is still enough for replayability. It is a very easy game to learn without taking much time to figure out the controls and it has a great tutorial. I really like the messenger system to give out orders, so it make you have to move around your commanding general in order for the messengers to not be intercepted by the enemy's formations.  There are some problems:   -AI pathing, units walking into the rivers and drowning, or just getting stuck on the riverback, unable to move, when selecting multiple units, they take the route of the unit being dragged around, not taking into account obstacles.  -the aforementioned lack of the AI's ability to adjust to your strategy (which as the battle unfoldes, you adjust your men to theirs, but they seem to lack the ability to adjust to yours). this make the computer very easy to beat after only a few playthroughs of each battle. Once you recognize the AI's battleplan you can adjust your men accordingly, because they won't stray from their strategy  -Artillery is still a bit clunky and unresponsive and needs a bit of work still  -lack of multiplayer. While this game is fun to play, how much more fun would it be to play with a friend? I don't really see how hard it could be to implement something like that.  -This game is centered on three capture zones rather than defeated and routing the enemy. So all you really have to do is to hold two zones no matter what and wait for the time to run out. Makes the game kind of dull and fairly easy to beat.  Overall, i would recommend this game as it is fun and not too hard to learn. But it does require an update for two to make it a real gem. Right now it's a diamond in the rough, just needs a bit of polishing.  ===if you've made it this far, thanks for reading, and I hope this has helped you make your decision===",
            "review_score": "1"
        },
        {
            "review_text": "  The basic strategy element of Battleplan: American Civil War relies on one core mechanic, that of runners who influence how orders are delivered to units, and it fails to accurately represent many other elements that determined the outcome of an engagement.",
            "review_score": "1"
        },
        {
            "review_text": "very fun comander game for a small desktop the game dosnt require the big cpu the game cost alot in condition to that you get.  beneift + alot of oppertunaties + very clever design + you feal a part of the battle +alot of play time  -expensive -graphiqs ",
            "review_score": "1"
        },
        {
            "review_text": "Best way to stop frezzing is turn off in game steam",
            "review_score": "1"
        },
        {
            "review_text": "That's a wonderful little game, a mix of turn-based and real-time strategy. You can literally rewrite the History of the American Civil War. What I like the most is the aspect of order sending, that really help the immersion. I would like to see more RTS games like C&amp;C, AOE and SC to incorporate this mechanic (even though orders nowadays and in future aren't sent by horse riding person it would C&amp;C and SC could much benefit from it)  Well done DEVs I'm looking forward for your next beautiful game!",
            "review_score": "1"
        },
        {
            "review_text": "What a fun little no-frills real-time Civil War Game... that doesn't work. The graphics are kind of bare bones, which is fine with me, and the interface is very simple and easy to use. But it is damn near impossible to consistantly get units to do what you want them to do. (This is as of 1.3).  The major problem with this game is getting units to move is an uncertain affair. There is a kind of cool mechanic where sometimes your orders don't get through, simulating the communication difficulties of the second world war. I can go with that. What I can't go with is when you give an order, it get's accepted, and the unit doesn't move. Even after you repeat the order. Again. And again. And again. And again. Units will just randomly 'stick' in spots and will be essentially worthless for the rest of the battle.  Worse are river crossings. I played Chancellorsville as the Union. Most of my force started across the river. There are several bridges. I must have re-issued my orders three dozen times before I got them across. Meanwhile, the few who stragged over the bridge got savaged one by one, because no one followed them. Most of the game can be more or less played and even enjoyed if you really try, but on a battle like that where you have to cross a river... forget about it. Don’t bother.  Beyond that, the game really doesn’t do a good job at communicating what is going on. The units are represented with boxy little symbols, which is fine with me, but half the time, I can’t even tell who’s firing. Sometimes, my units just suddenly die. No warning, just poof. Sometimes it’s because there is a hidden enemy, but sometimes, they will just randomly panic and flee, even if not under fire. The sad part is there is a really fun game hiding under here. This is one of those games that I want badly to recommend, but cant. I love the design idea, love the genre, love supporting indies, but the game just doesn’t play right. Unless you are willing to put up with some major frustration and love Civil War RTS, I’d pass.",
            "review_score": "-1"
        },
        {
            "review_text": "all it does is crash...rip off!!",
            "review_score": "-1"
        },
        {
            "review_text": "This thing man, IT INSTA CRASHES 5 SECONDS IN! IM NOT EXAGGERATING! I PAID MONEY FOR THIS AND CANT PLAY !!!!!!!!!!!!!",
            "review_score": "-1"
        }
    ]
}