{
    "app_id": 285350,
    "name": "Kingdom Elemental",
    "release_date": "2014-05-02",
    "developer": [
        "Scott Thunelius",
        "Chronic Logic",
        "Tony Porter"
    ],
    "publisher": [
        "Chronic Logic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie"
    ],
    "achievements": 38,
    "positive_ratings": 12,
    "negative_ratings": 11,
    "price": 2.79,
    "description": "Kingdom Elemental takes core game play elements from real-time strategy, tactics, and role-playing games and combines them into a game that is easy to pick up and play. It is designed to be lighthearted and humorous with fun, re-playable game play. Try out the Destiny Mode and challenge levels for more variety.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/285350/header.jpg?t=1447360744",
    "minimum_requirements": "OS: 98/ME/2000/XP/7/8 Processor: 1 GHz Memory: 512 MB RAM Graphics: video card with 64 MB of memory Storage: 150 MB available space",
    "recommended_requirements": "OS: XP/7/8 Processor: 2 GHz Memory: 1 GB RAM Graphics: video card with 256 MB of memory Storage: 150 MB available space",
    "reviews": [
        {
            "review_text": "Although I enjoyed the simple mechanics and fighting battle after battle without needless walking, I simply can't recommend this game.  The game sucks you in with the tutorial offering humor and a satirical view on the RPGs today. The combat is very simple, you unlock units and their skills (you get unlock points in each new level) and then you choose which units will be in the fight by buying them with gold (you get a fixed amount of gold every round). Unit composition, positioning and timely skill use is all needed to win battles.   There is no story and you really have no idea why you fight the enemies that you fight. Although there are some attempts at humor between levels the subtitles lag behind the voice acting, which I found really annoying and disengaging. The lack of story however wouldn't be such a bad thing, since most of them are generic anyway, if only the battles were fun.   But they are most often not. Although genius in it's simplicity, the combat is still lacking. First thing that properly annoyed is that you select units AND give orders to them with the left mouse button which in turn had me repeatedly mistakenly miss to select unit and move the currently selected unit instead.  Even though there is some unit variety, although not much, it's sad that you will need to use swordsman (your first unit) most of the time because of his taunt ability and of course the healer. There are some other units that can immobilize the enemy, but none of them can compare to swordsman's taunt, especially in boss fights since disables except taunt last shorter. Some of the boss fights all come down to taunting them, then moving your swordsman around while your range units poke him, then do the same again and again. That and similar 'tactics' such taunting with two swordsman, making the boss switch between them while you heal your wounded swordsman makes fights more tedious than fun. And you absolutely need some form of crowd control since the enemies move at random to your squishy units and can kill them in one or two blows. And once one or two die, you might as well restart.  Although the game seems to be stable, there are a few bugs with taunt, that cost me a few games, namely taunt sometimes doesn't work, especially when the target was rooted just before the taunt, meaning bosses on which root doesn't last long, simply continue to your back rows and kill multiple units with an aoe attack. With a small battlefield and your slow moving units there is simply no way to save them from being crushed in one or two attacks.   In short: Good concept, not so good execution, with battles being more tedious to fight then challenging and fun.  Also the priest's voice is bloody annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "Buy for the tutorial, stay for the game.   The game narration is all ironic parody but the game is solid tactical real time strategy.",
            "review_score": "1"
        }
    ]
}