{
    "app_id": 285740,
    "name": "Kitty Powers' Matchmaker",
    "release_date": "2015-04-22",
    "developer": [
        "Magic Notion Ltd"
    ],
    "publisher": [
        "Magic Notion Ltd"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Dating Sim",
        "Casual"
    ],
    "achievements": 31,
    "positive_ratings": 588,
    "negative_ratings": 38,
    "price": 6.99,
    "description": "Kitty Powers’ Matchmaker is a hilarious dating simulator with a difference. Manage your own matchmaking agency with the guidance of your fabulous boss, drag queen diva Kitty Powers!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/285740/header.jpg?t=1525361087",
    "minimum_requirements": "OS: Win XP / Win 7 / Win 8 / Win 10 Processor: 2.0 GHz Dual Core Processor Memory: 2 GB RAM Graphics: Integrated Graphics (512MB VRAM and above) DirectX: Version 9.0c Storage: 700 MB available space Sound Card: DirectX 9.0c compatible.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Being a lady with with lady bits I am perticularly good at playing these kinda games. Except I can't tell the difference between hipsters and nerds. Actaully I'm not very good at this game at all. And my friends bully me for playing it. I don't know where I'm going with this. Send help.",
            "review_score": "1"
        },
        {
            "review_text": "Took me about 13.5 hours to beat the game. (With a lot of failing, mind you.)  I must say, this game is so addicting and fun! Such a refreshing game to the steam market.  A dating simulator that supports gay and lesbian couples, has witty remarks, funny restraunt names, and difficult minigames.  For a casual game, it's great. I don't know why it's so fun, but it is.  I even got to set up Kitty Powers at the end! You go kitty! I love you!",
            "review_score": "1"
        },
        {
            "review_text": "Liberty walked into my offices looking for her perfect match. I rumaged through the choices and offered her the top three candidate profiles, all of which sounded pretty lame but it was the best Kitty Powers' Matchmaking Offices had to offer. With absolutely nothing in common except his documented obesssion with blue eyed beauties, Liberty took my advice and went on a date with loser #1. The evening started horribly, Liberty having selected all-American fine dining at its best with real authentic truck-stop flavours. Except Greg, her date, wants some fancy red meat dish with milk and the only thing on the menu is corndogs and french fries. Liberty suffered through Greg's talks of UFO's and internet meme's, eventually realizing through dull conversation that he shared none of her interests such as celebrity gossip or clowns. At the end of the date, Liberty thought she'd give it one more shot by asking Greg out for a second date. Greg is fairly unimpressed at this point and wants Liberty to beg for a second date. Liberty begs. Guess she swiped right after all.  This game is great and doesn't discriminate. It's a fun little memory game with unique profiles for all the clients and date candidates. 10/10 for being Fabulous.",
            "review_score": "1"
        },
        {
            "review_text": "The reputation is unfair. If a date works you only get like +6, but if the date goes horrible you get -30. It's so unbalanced.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, even though it's really simple, I can't stop myself from playing it. It's pretty much about hooking people up and making your stats go up as a dating expert!  I love how you get to see avatars people have actually created, and the choices are endless.  It has mini games, puzzles and goes a lot on the luck side. Do you think you're lucky enough to help people find dates? xD",
            "review_score": "1"
        },
        {
            "review_text": "This game is a bit weird but funny:) its worth, u will enjoy it!",
            "review_score": "1"
        },
        {
            "review_text": "This games is so much fun in the oddest way lol I will admit that it gets a bit repetitive at times with the puzzles but it's overall a good ol' time!",
            "review_score": "1"
        },
        {
            "review_text": "I like playing this game a lot!!!",
            "review_score": "1"
        },
        {
            "review_text": "Fun, awesome, and hilarious, this game is highly addicting and very recommended!",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! Super addictive and fun, with lots of cute and humorous moments. Sometimes it is pretty darn frustrating and difficult - I was taken aback when I suddenly had to remember what my waiter looked like, or remember the name of my date. It basically trains your short term memory to ensure you remember little details. I am STILL trying to figure out what 'type' of person people are - over time, I am starting to recognize certain patterns of interests so I can pinpoint who is 'Edgy' type or 'Geek' type, for example. I'm still lost about Glam versus Chic, though. I can see myself playing this game on and off for a long time because it is so easy to pick up then put back down again.",
            "review_score": "1"
        },
        {
            "review_text": "To tell you the truth . . . i wasn't sure about this game. I have seem others fail trying to do something like this. This was nailed it. You don't go on the dates but you are there watching and guiding responces and playing all kinds of many games. like match it, solts, memory, spin the wheel. YOu have to listen to the date's likes and wants. I wasn't expecting to like this game much but i do. It has a bit of british humor and terms that might be confusing at first but you do catch on rather quickly.   in case anyone is curious . . . no you Don't play as Kitty. you make your own character, She is your boss.",
            "review_score": "1"
        },
        {
            "review_text": "silly and funny game. i love it",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly entertaining. It can be repetitive, but it changes later in the game and has surprises for you as you rise up in rank. This game might not be everyone's cup of tea, but I enjoyed the mention of anime and cosplay as interests for some of the characters. :)",
            "review_score": "1"
        },
        {
            "review_text": "Funny faces, farts and stupid jokes, it's purrfect!",
            "review_score": "1"
        },
        {
            "review_text": "A very fun and exciting game to play with freinds on steam. Making matches galore! Though if you don't get letters from Kitty Powers or MagicNotion about your progress or how your avatar's dating adventure went, then you just have to wait week after week until it finally arrives.  The game is fun and easy and the minigames are fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Matchmaking be hard work. Prunk must pay close attention to learn about character peoples. Then must do math (thank gods Prunk had calculator), use memory skills, and play guessing games to make client date a happy date. Sometimes, it no work out and Prunk lose client when they had three bad dates which make Prunk want to work harder on next one.  A slot/fruit machine give you choices of questions to ask date what they like. You get more choices with career promotions from Kitty Powers. Kitty Powers is cooky fun - Prunk like her style! Game start with a few restaurants to take date on, then you can buy more restaurants which open more fun mini games.  If you believe (Prunk does not) that a person need change to make other person happy, you can buy salon things to change client's hair color, face accessories and so on. Sometimes Prunk changes client hair color to suit date's taste, but not so much other stuff. Many choices to make in game, many fun minigames, and Prunk have fun trying to figure character peoples' personalities.  Tutorial is nice and Prunk lose much time playing game. Game should come with warning that could harm real relationships because love playing game too much, hahaha. Prunk, though, recommend game - very fun game.  EducatedOrc Prunk say:  Fun &amp; Entertaining - 5 / 5 grunts Skill Leveling - 5/5 Action Intensity - 1 / 5 grunts Storyline - 4 / 5 grunts Addictive - 5 / 5 grunts OVERALL - 4 out of 5 grunts",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Big black man partnered up with a scrawny white boi.",
            "review_score": "1"
        },
        {
            "review_text": "Kitty Powers, will you marry me?",
            "review_score": "1"
        },
        {
            "review_text": "This game is quirky and fun to use to pass time. I enjoy it alot and it's a good quality game.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun and highly addictive little game!",
            "review_score": "1"
        },
        {
            "review_text": "Fun but STUPID   I LIKE THE GAME  BUT ITS SO STUPID",
            "review_score": "1"
        },
        {
            "review_text": "this game is actually fun",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious!! Made me laugh many times!  Negative part is that it gets repetetive quite fast but if you really dont mind about something like that then it is really no problem. ",
            "review_score": "1"
        },
        {
            "review_text": "Such a fun game. :) The fun of matchmaking meets memory gaming.  My only complaint is that if you don't log-in for a while your agency gets smaller and smaller. It's disappointing to lose all that progress, but it isn't something I really sweat to the point of not enjoying myself as a matchmaker extrodinare.  All in all, this game is quite addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Kitty Powers is the purrfect little dating game that everyone can enjoy! :)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! So funny and really fun to play in quick blasts.  Kitty Powers is one of the best human beings on the planet! ;)  ",
            "review_score": "1"
        },
        {
            "review_text": "Really addictive game :D  Seriously, once you start, you can not let it go.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. This is without the best game on Steam™. The multiplayer component is breaktaking, I have never felt more connected to my peers. I in fact found love through Kitty Powers' Matchmaker, I have never been happier.",
            "review_score": "1"
        },
        {
            "review_text": "I actually like this game for being a time-passer game.  Lots of mini-game, different things each time.   Need to matchmake client with suitable candidates.  I play this game to not feel upset in life as there are some characters in the game that makes me wanna kill them.",
            "review_score": "1"
        },
        {
            "review_text": "It was a really fun game.. at first It was fun to play and addictive in the beginning, but after a while, it's gets so hard that it's barely enjoyable. ;-; ",
            "review_score": "-1"
        },
        {
            "review_text": "why would u",
            "review_score": "-1"
        },
        {
            "review_text": "Although I've only played this game for 6 hours, I have to say, this game is one of the better dating simulators (at least from what I know). Instead of going on dates yourself, you guide your clients through their date with the girl/guy you think is right for them. You can also choose which restaurant they go to. The restaurants have 3 levels; easy, medium, and hard. You can also change the way your client looks before your date.   If you succeed, they get together. Afterwards, depending on how you acted on the date, they'll break up. They can also get married and have kids if you did well on the date.  If you fail (AKA get dumped), you have to try again with another person. If you fail 3 times in a row, they'll leave the agency, and your reputation will drop.  Sometimes, you'll get stuck in the middle, and have to go on three dates before you succeed (or fail).",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun on going game!",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games! Please update with more clothing and gifts, thank you!!! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "One of my new favorite games... it's fun to play and funny.",
            "review_score": "1"
        },
        {
            "review_text": "I can not get enough of this game, it's got fun memory minigames and it actually keeps you interested. I really used to not be into matchmaking games but this one gave a bit more character to it all and with the colorfulness and individuality of games it makes it 10x better!",
            "review_score": "1"
        },
        {
            "review_text": "This game is downright weird. And yet, for some reason, I keep checking in on it...",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would ♥♥♥♥ing kick devon again",
            "review_score": "1"
        },
        {
            "review_text": "On the surface, this looks like a cheap little flash game that wouldn't offer a whole lot - but I personally found it to be a pleasantly addictive time sponge. Thanks to Ms. Powers' encouragement and memorable quips, I'm already a level 18 Love Doctor.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is super fun. If you like a flash game style with addicting gameplay then this is the game for you. The graphics are not super amazing but it shouldn't be in my opinion. This game was made in a flash game format and has a cutesy art style to go along with. I have played for hours without noticing and the ten dollars is a great price for this game.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! It is fun to play and the crazier the date, the more fun it is.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun! Very detailed and thoughtful! I do recommend this game if you're the love type! The only disadvantage I find with it, is the fact that when you get heart-broken, you're reputation goes so far down; for example, if you get a match, your reputation goes up by 5 or so, but if you fail, you go down 30! It's so hard to get back up, but that just supports the game in it's difficulty! :)",
            "review_score": "1"
        }
    ]
}