{
    "app_id": 286120,
    "name": "QuestRun",
    "release_date": "2014-04-18",
    "developer": [
        "Cuve Games"
    ],
    "publisher": [
        "Digerati Distribution"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Stats"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Casual",
        "Indie"
    ],
    "achievements": 13,
    "positive_ratings": 419,
    "negative_ratings": 355,
    "price": 2.09,
    "description": "Challenging and fast-paced with a modern twist on old school RPG battle systems, QuestRun is unlike anything you have played before.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/286120/header.jpg?t=1447360792",
    "minimum_requirements": "OS: Windows XP Processor: 1 GHz Memory: 2048 MB RAM Graphics: 512 MB Storage: 120 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Basics   QuestRun: a lite-RPG game with turn-based elements.  Featuring bright, colorful visuals with appropriate music, QuestRun boasts to be a 'Challenging and fast-paced' game that 'is unlike anything you have played before.' Does it really deliver on that promise? Let's find out.  Gameplay is simple, offering only a small handful of attack types (Melee, Ranged, Magic). Both the Melee and Magic weapons attack the enemy directly in front of the user, with Ranged weapons allowing the character to assist an ally when no enemy is in front of them. A simple, but interesting mechanic.  Characters also get a Special ability which can directly affect combat via team Heals, charming enemies, cast fire spells, or other abilities. Most also get access to a combat Stance, which can toggled on and off to grant a variety of bonus stats (usually at the cost of others).  Little strategy is really needed due to the game's simple mechanics, with character placement generally being the most important choice you can make. Fortunately, slow combat allows plenty of time to make adjustments during a fight (with an option of 3x game speed for the bored).   There are a variety of stats that can be utilized to improve your combat experiance; primaries such as Health, Defense, Magic Defense, Attack - and others such as Luck, Speed, Special, and Charisma.   After bashing faces in, you can use that hard earned gold in the Meta Shop for stuff such as new characters, pets, and other features.    Done Well       Great Visuals  - Clean, colorful graphics make this game visually appealing.     Gameplay  - Simple, but fun and enjoyable.     Achievements  - Uninspired kill X or do Y, but something realistic to work towards and easy to understand. Good for completionists.     Music  - Nothing amazing, but it fits the game's atmosphere and repetative listening from playing the game won't get irritating. Always a plus for a game.     Cards  - Despite the store page not being updated, QuestRun does support Steam Trading Cards. A nice addition for those that enjoy them.     Where it Went Wrong   Here is where the otherwise pleasent experience breaks down and ultimately sways the recommendation into a negative rating.      No Cloud Saves  - QuestRun makes use of Steam Achievements and Trading Cards, but failed to include an important feature such as Cloud Saves, which becomes important when trying to play on multiple devices or preventing data loss.     Optionless  - Complete lack of game options such as sound volume, game resolution, or even fullscreen/window modes (no fullscreen support). Missing such basic functionality makes QuestRun feel like it was ported from a mobile platform, which is surprisingly inaccurate since the game is  NOT  available on android or iOS.     Poor Performance  - The game suffers from performance issues, often causing severe studdering, slowdowns, frequent freezes, and even memory leaks (that result in crashes)     MORE Bugs  - A handful of other prevelent bugs exist: waves not progressing, characters not attacking, stats not saving, progress being lost, game not installing, game not launching, among others.     Bottomline   QuestRun is a simple, yet interesting game that suffers from a lot of game disruptive bugs which detract from an otherwise enjoyable experience.  Unless the plethora of problems get addressed, I recommend users  avoid  QuestRun.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is really boring. Not much strategy to it, all you do is watch your guys attack enemies. The battles are really uber boring.  There's barely any animations, which makes watching your guys even more boring.  This feels like a flash game, and it's barely worth the time to download. if it was free I would still tell you to avoid it. Steer clear of this piece of crap at all costs.  To sum it up, quoting another reviewer:  ' The battle system is shallow, automated and dull, offering little strategy and none of the satisfaction of issuing direct orders to characters each turn. You feel extremely detached from the 'action' and i was bored with this game in an astonishingly short amount of time, in fact i will admit that i have not given the game a fair playtime i was that annoyed with what i did play.'",
            "review_score": "-1"
        },
        {
            "review_text": "Ouch. I can't add much to all of the other negative reviews, but just want to put another warning sign up in front of anyone thinking of paying for this thing. Choose something else. Please. I cannot deny that this is a game, but I also cannot deny that liverwurst is food. You may find a few people who like it, but mostly people find it to be a stinky mess with no redeeming qualities. At least half of the title of the game is accurate. Run. Run and don't look back.",
            "review_score": "-1"
        },
        {
            "review_text": "Skating the edge of unfairly hard and well balanced. Making it through the main missions and side quests is a balance of getting lucky with level up effects, and making the most of hero powers. With some help from the guides, and a combo of assassin and blacksmith, I was able to make a little progress. After that it felt like there was a 'right' way to progress, which kind of made me lose interest. Bad, lazy reviewer.  Positives: interesting and simple mechanics - swap characters to balance damage, activate powers, and level up. Complete missions for bonus powers, and to buy characters and other advantages. The side quests are tightly balanced, so you won't succeed on the first try or ten, but by the skin of your teeth when you do.  Negatives: feels padded and a bit grindy, for those simple mechanisms. Not all characters and abilities are useful. Significant random element in leveling, and party make-up.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice looking game, I really liked the hero and monster designs and the soundtrack was nice but that was about all there is to this game. There is not many skills involved when playing this game as everything is just luck if you get right items to survive enemy waves or not. There is no story or anything and it is sad. Just artwork alone is not enough to make me want recommend the game but to people who really love turn-based RPG just for the fights, this might be good buy. If I could I would give neutral rate to this!",
            "review_score": "1"
        },
        {
            "review_text": "Don´t waste your money. The game is not worth even for 1 $. The battle system is really terrible like the whole game.",
            "review_score": "-1"
        },
        {
            "review_text": "Only about a dozen levels and it randomizes the hero selection and pet selection you get (forces you to pay for rerolls), which means you get to try out new combinations but waste a lot of time with bad combinations. I regret buying extra pets which just worsen my chance at winning. The game difficulty is such that you need certain combinations to have a better chance at clearing the level so it's annoying you can't pick and choose. However, if they did let you choose, the game would be a lot shorter. This isn't really a full game, just an extended mini-game around a decent concept. As released, it doesn't have $9 of content. Maybe worth it for mobile prices (~$2-3)",
            "review_score": "-1"
        },
        {
            "review_text": "Well to be clear.. i got this game and played only for cards but after 1 hour.. it sucked me in soo deeply that i played another hour to see that game is a pretty nice and enjoyable ^,=,^",
            "review_score": "1"
        },
        {
            "review_text": "at first it looks like nice and addictive little mobile game. but after 30 min you realise that is epicly grindy and repetitive.. last two achievements is ridicolus waste of time. don't play it.",
            "review_score": "-1"
        },
        {
            "review_text": "A game with all the negatives of a f2p mobile app, except priced as a $9 purchase.  Gameplay is very basic. You can buy upgrades, but the prices are insanely high compared to the money that you make per stage. Random chance may be a strong factor; I honestly didn't play long enough to find out  The game just isn't interesting or engaging.",
            "review_score": "-1"
        },
        {
            "review_text": "I first tried it out in Desura when I got it from a bundle... It was a terrible game. There was only 1 level where I could choose what my team looked like, and it was pseudo-random (random but you can reroll ~10 times before it start having a real impact on your wealth). Then I was bored one day and chose 'meh, let's try it again'. What first looked like a pretty stupidly simple game was actually an hidden gem imo.  Now, the only thing that changed between the Desura version and the Steam one is me, and how I played the game, so it has nothign to do with patches and stuff like that. As for the current review, I'll be using Twilight Sparkle's points because the really reflected my initial point of view of this game (until I sank 4-5 hours in it to truly grasp its depth).  In term of combat, it's dead simple. The combat system is wave-based, and you get 1 loot at the end of each wave. You have 4 inventory slots, and each character has 1 weapon and 1 armor slot (+1 rune slot per equipment). The interactions you can do is : move items between inventory slots and/or characters (or pet), move characters, use special skills, activate/deactivate stances, and level up your characters. Each of those are either 1 click/hotkey, or 1 click and drag. Still, I'm finding myself to want more hotkeys to be able to macro faster since unless I drop the x3 speed mode, I'm lacking time to do all the inputs I would require. It's simple but it's deep (good examples would be activating the priest' stance as you're about to get hit, and remove it afterward, so that you receive less damage without losing half of your speed and damage).  Skill system : Each class has 1 skill which charges up as you get hit up to 5 times (some exception have 2 with the 2nd taking like 20-30 hits). Those skills are highly situational (ranges from healing the party to resetting an enemy's action bar to preventing the enemy from attacking magically or even just reducing the enemy's damage and looting an item).  Party : Side quest system has you going in with a predetermined lineup (items, classes, pets... everything) to try and beat that scenario. They reward you with 'crowns', which are used to unlock other quests, and new classes (on top of the usual cash reward). Main quests presents you with a number of option based on what you bought from the shop (at first you have 3 heroes that you can reroll and a choice 4 totems, but you can end up with a shop selling items, 2 profiles per classes, and random pets. The fact that you have a set of 3 heroes that you reroll, from my point of view, allows you to not always take the 1 simplest strategy you found and try out new things (I would always go with priest-inquisitor-tank otherwise, and would be missing on thiefs and vampires). All in all, the replayability is huge in main quests - which you will have to grind a bit to buy everything you can from the 'meta-shop' (aka not the one in main quests) - and side quests present interesting puzzle-y challenges.  Items : Dead simple (fortunately, since this is real-time and you won't have time to ponder about which item is better for long). Basically if you wield a staff, you attack magically (Magic vs M. Def), and if you wield a sword you attack physically (Attack vs Def). Each character has a certain amount of Attack and Magic, so a +1 staff will be as good as a +5 sword if you have 5 magic and 1 attack (which is an extreme case, but will sometimes happen, especially as you level up).  Overall, the 1 gripe I have with this game is its lack of randomness. I would've loved it if there was 2-5 'profiles' per class (a combination of different stats, skill, stance, or items), but we're limited to 2, 1 of which is unlockable (and even then it's more like an entirely different class since it's so different). At $9 it may be slightly expensive, but at 50% or under, it's way worth imo.",
            "review_score": "1"
        },
        {
            "review_text": "This game sucks. Seriously.",
            "review_score": "-1"
        },
        {
            "review_text": "Luckily I bought this game on sale for very little money. The upgrades to your characters are temporary, giving you very little option to customise your characters to make them stronger. Basically your ability to win relies on RNG, which is just time consuming and makes for very boring, repetitive gameplay until you actually find yourself winning.",
            "review_score": "-1"
        },
        {
            "review_text": "I have nice 5 y old Dual core 2 GeForce 9400M 4GB RAM laptop and I tought this will be good little game to play on it, but NO. Without Full Screen this game isn't playable, lags way to much Very Disapointed atleats I payed only 1,04E not full price so thats a little relife",
            "review_score": "-1"
        },
        {
            "review_text": "This should go back to the moble store till they decide to make a real PC version.",
            "review_score": "-1"
        },
        {
            "review_text": "+))",
            "review_score": "1"
        },
        {
            "review_text": "this little game has the elements of what you need to be a great strategos, you will place your units a lot in this game! nice graphics, nice spells,nice menu :) 10/10",
            "review_score": "1"
        },
        {
            "review_text": "THis game ♥♥♥♥ing sucks whoever made this game needs to get mouth warts and genital herpes ♥♥♥♥ u guys dont buy this peice of ♥♥♥♥ ♥♥♥♥ u developers",
            "review_score": "-1"
        },
        {
            "review_text": "9000/10 Got the game for free. Big Thanks to Indiegala. The game has secret trading cards (15 of them). Got 8 cards from drops. Sold the cards. Earned free 16 cents.",
            "review_score": "1"
        },
        {
            "review_text": "F.F.F.F = FAST FUN FOR FEMALES. I love it",
            "review_score": "1"
        },
        {
            "review_text": "Edit: I played one hour (the rest of my playtime is card farming)  I got this game in a bundle so I jumped in it without knowing anything about it. While I really like the graphical style, the game feels a lot like a mobile game (and apparently, it's not, which is really weird).  Cons: No options Repetitive gameplay No depth (to be honest it's the selling point of the game, but I don't like it at all) Poor gameplay : you switch characters around and... that's it... It's basically the only thing you do appart from pushing buttons from time to time (when the cooldown of the unique skill of one hero is ready, when you loot something,...) The store page speaks of rogue-like elements. I can't say it's false, because technically there are some roguelike elements... But saying that is like saying 'there are tetris elements' in Half-Life² because you can move boxes around. The game doesn't feel like a rogue-like (or even roguelite) at all! Everything seems pointless : because you only keep your characters for one level, there's no feeling of progression or joy when you level up / got better gear... Grinding : I said the game feels like a mobile game and it really does. You just grind gold to unlock shop items.  Pros: The graphics are really pretty It's fun for about 10-15 minutes  If you like RPG's but don't like the fun elements in it (adventure, humor, progression, story...), this game is made for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty fun game in my opinion, maybe if they added different options for speed instead of just 3x or 1x, requires strategy for sure, you have to think ahead",
            "review_score": "1"
        },
        {
            "review_text": "Just don't....  QuestRun is a turn based RPG type game where you control 3 characters as they battle various monsters.     The art style is good and seems creative    The animations are limited but that is to be expected with the genre    There is no story (except defeat the dudes)   Here is the ♥♥♥♥ing problem though. It is a horrible mobile port. There is no tutorial, no settings (no changing resolution), no explanation page, no help page, and no 'test this out' page. You can still see the paid currency in the game that you can't buy in the PC version but I can't figure out how to get it and some of the unlocks only use the paid currency so good luck if you actually want to unlock ♥♥♥♥.   The gameplay isn't bad but all the lack of effort in porting the game effort meant that I didn't care so I just quit.",
            "review_score": "-1"
        },
        {
            "review_text": "addictive. annoying. great game. entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "This game feels more like a mini-game. However there is something very engaging.  Granted the game has balancing issues and success relies heavily on RNG. I would still go to say I enjoyed this game much more than a lot of other games I've played, as weird as it sounds. I was aiming to get all the achievements and it took me 11 hours to even finish the first dungeon.  I kept head butting myself to certain monsters without realizing the full potential of my characters... and only later to find myself in 'shop', using the in-game rewarded gold to buy myself a few more characters and starting weapons. However, after unlocking most of the characters it was a very joyful ride.  There is still more to play even after unlocking the achievements -- a dungeon or two and a side quest or two.  Not sure if I would pay 7€ for this game, but if it's on sale... Go for it.",
            "review_score": "1"
        },
        {
            "review_text": "The game is simply unfair. That's all.",
            "review_score": "-1"
        },
        {
            "review_text": "Watch a game play itself with minimal interaction! Fun! No!",
            "review_score": "-1"
        },
        {
            "review_text": "its ok its not for me play final fantasy 7",
            "review_score": "1"
        },
        {
            "review_text": "Nice game for boring night",
            "review_score": "1"
        },
        {
            "review_text": "game with interesting concept, but extremely short 5/10",
            "review_score": "1"
        },
        {
            "review_text": "Nice game.",
            "review_score": "1"
        },
        {
            "review_text": "Its a vanilla JRPG with the usual enemies and storyline. The game is well presented but its missing some options with the audio and display which would have made the gaming experience better. but other than that quite enjoyable.",
            "review_score": "1"
        }
    ]
}