{
    "app_id": 286160,
    "name": "Tabletop Simulator",
    "release_date": "2015-06-05",
    "developer": [
        "Berserk Games"
    ],
    "publisher": [
        "Berserk Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Co-op",
        "Online Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Casual",
        "Indie",
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Board Game",
        "Simulation",
        "Multiplayer"
    ],
    "achievements": 27,
    "positive_ratings": 13243,
    "negative_ratings": 777,
    "price": 14.99,
    "description": "Tabletop Simulator is the only simulator where you can let your aggression out by flipping the table! There are no rules to follow: just you, a physics sandbox, and your friends. Make your own games and play how YOU want! Unlimited gaming possibilities!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/286160/header.jpg?t=1554336055",
    "minimum_requirements": "OS: Windows XP SP2 Memory: 4 GB RAM Graphics: Integrated Network: Broadband Internet connection Storage: 6 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Girlfriend said, 'This game is stupid buy a chess board. 'Oh so you'll play chess with me.' 'No. It's too complicated.' My real life friends don't like games so where else will I find someone to play Yahtzee on a midnight. This is the game that has propelled me to save up for a beefier computer. Sometimes I compulsively buy games that don't quite meet my comp's requirements. Bad habit, I know. With 2 GB of ram out of the required 4, I can still play quite a few games on tabletop right now--ones that come with the product and quite a few on the workshop. Unfortunately, I can't play Cards Against Humanity or Apples to Apples yet, but at least I have my Sorry and Clue.  I haven't experienced a true troll yet, only encountered one person yelling in a room. The community, for the most part, seems really friendly. My opponent had to leave, but when I asked if there was a reset button to put all the chess peices back together, he didn't know but ended up staying to put the board back together manually.  I give this game a 100 out of 10.  Update--since I reviewed this I have a bought a new computer, and now I can play all the mods. I have learned so many new games on here that I have bought or am looking forward to buy. Games I never would of heard of or played until I tried them out on this simulator such as Dead of Winter, Duke, Love Letter and the list goes on and on. Most likely the best game I ever bought and most replayable game too and well worth the value. Also my girlfriend no longer thinks this game is stupid, and now wants to buy another computer so we can play Tabletop together. So here's hoping the community keeps growing!",
            "review_score": "1"
        },
        {
            "review_text": "'If Im going to buy this, will you guys play it with me' 'Oh yeah' 'for sure!' 'Yeah I love that game' Yeah they ♥♥♥♥ing lied to me",
            "review_score": "1"
        },
        {
            "review_text": "This game really does desvered the Game within a Game reward",
            "review_score": "1"
        },
        {
            "review_text": "Great pickup, sale or not. Includes classic games not only pre-loaded, but also from the Steam Workshop.  Settlers of Catan, Monopoly, Battleship, and UNO are great pickups from the Workshop.  Also, table flipping.",
            "review_score": "1"
        },
        {
            "review_text": "Literally got hundreds of dollars’ worth of board and card games for like $20. Oh and and an in-game tablet that let me write this review.",
            "review_score": "1"
        },
        {
            "review_text": "I played UNO with strangers, and then more strangers joined and changed it to a furry porn game.",
            "review_score": "1"
        },
        {
            "review_text": "Poured about 240+ hours into making my own custom campaigns and I have been DM/GMing them with my friends. By friends I mean me...  I have no friends willing to play,  or any at all!  ",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the absolute best purchases I've ever made on Steam - its basically an infinite collection of board games. See a game you haven't played in forever? Play it. Want to know if that boardgame you want to buy is any good? Try it. Have an urge to have a lazy conversation with your gf/wife but want to do something while you talk? Load up a random game and try it out. Feeling down? Join a server and proceed to have shenangins with people.   The only criticism I have for this game isn't even because of the game itself (the developers are fantastic and are (as I type this) updating the features of the simulator. Its the community. Some people enter lobbies and ruin games. Not with all that much frequency, mind you, but enough so that most people now lock their servers. A handful of open (and legitimate) servers are still around, but its like 5% - 10% of the servers listed. So if your planning on playing without a real life friend or two..... I'd still say get the game (seriously its fantastic), but don't expect to play anything but popular card games.   UPDATE AS OF 6/24/16 --  Game is in excellent shape, workshop is alive and kicking, and the content in the game is very nicely set. Honestly, its a complete masterpiece as a game.  On a different note, I'd like to take a minute to talk about the community. Tabletop has probably one of the best communities for what it is: the game attracts essentially only people who enjoy board games. So your playing a game about playing any board game you desire, with a bunch of people who love board games. Its great, like 80% of the time. 20% of the time you'll be stuck waiting (for people to join games), or playing games your not super into, or getting trolls (who are easy to ban). The server issue still exists, about 80% to 90% of servers are locked and at any give time your looking at 15 to around 30ish open lobbies.   I personally think those are decently acceptable statistics. And tabletop is a great place to make friends - I've added at least 30 people in the last 3 months alone from this game. These are people I spent a MINIMUM of 2 hours laughing, chatting and playing with over a game of Risk, Battlestar, Monopoly, or any of over 200 games I've personally subscribed to. The game is honestly a great way to get out there and hang out with people you'd otherwise never meet.   TL;DR -  A Steam Must-buy, especially if you have real life friends who also have the game. 10/10 Monopoly Boards.",
            "review_score": "1"
        },
        {
            "review_text": "Bias: I am a dinosaur. My arms are normally too short to reach a real table for board games. This makes it easier.  In my opinion, one of my favorite games on steam. The ability to play most board games with little clean up and expense make this simulator great. Thanks to friends. I have learned new board games, that I have seen in game shops that looked interesting, but did not want to spend $40+ on and find out that its not fun, too difficult to play, or no real life friends who wanted to play. This simulator has led me to purchase physical copies of games like Catan, Munchkins, Love Letter, Forbidden Island and a few others. And also has allowed me to introduce friends to these game in real life, who have also found them enjoyable.   I would give this game 10/10. It is a game I will continue to play and use to learn new games. Also if you have this, and have not tried Secret Hitler. You should. :D",
            "review_score": "1"
        },
        {
            "review_text": "Very versatile, must have if you love playing Solitaire all alone ;-;",
            "review_score": "1"
        },
        {
            "review_text": "What can I say about this that has NOT already been stated? This is my favorite title on steam.  Why? Lets start with the fact that nearly all my board games that I own are available on here. The ability to play them or to test out different strategies in a quick manner is something that has caused my gaming group to play more together. I am also able to save my games no matter where I am at. So if me and my friends want to play a game that we know we cannot get through, but would love to be able to continue it later, well.... WE NOW HAVE A WAY TO DO THIS! Gone are the 'Take a picture of the board, write down what we had here....'  While nothing can ever replace the physical game, and the enjoyment that a game night with a bunch of local friends, it does provide a great way to play with my friends that have moved away, as well as introduce different people to the joy that board games.  Tabletop Simulator has given me a way to expand my physical board game collection, introduce people to games, play with friends from a far, and test out strategies, all for $20. I recommend this to anyone who enjoys board games, or perhaps are interested in getting started, and want to learn just how different and enjoyable board games can be from video games. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I wish I knew more people who love board games as much as I do... *sigh*",
            "review_score": "1"
        },
        {
            "review_text": "You can have a tablet in the game. Watch pron on said tablet.  When you are playing a boardgame  10/10 would fap again",
            "review_score": "1"
        },
        {
            "review_text": "Great game, lots of great content on the workshop as well. Worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop Simulator is an amazingly simple, enjoyable game. Whether you meet new friends, play with old friends, or meet new friends while playing with your old friends, this game is amazing regardless! Play games you played as a child, find new games you think will be fun, play classic games, and play games you've never even heard of before, with your beloved pals.   Going outside is for normies. With Tabletop Simulator, you can experience the joy of playing with your real friends, online friends, and completely random people while in the comfort of your own home and computer. Play games such as Chess, Checkers, Pictionary, Pool, Poker, Mahjong, Chinese Checkers, Candyland, Monopoly, Sorry!, Dominoes, Jenga, Eels and Escolators, Apples to Apples, Dungeons and Dragons, Black Jack, Roulette, and games you've literally never heard of!  This game is versatile. You can play board games, play all sorts of D&amp;D games and even set up your own boards and dungeons, and learn new ways to have a blast with your friends. Be prepared to flip tables, laugh, rage, and appreciate with this game.  I purchased this game when it was on sale for $10.00. I know that $20 is a bit much for a stupid table simulator game, but it is worth it my friend. I suggest this game to anyone who has or has not friends, because you can always make great friends on this game by joining or hosting servers free to the public.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. Mods allow you to play pretty much any real life board/card game in existence. There's a bit of an issue with DMCA takedowns on the Workshop, but you can still find pretty much any popular title on there.  Especially good for people looking to get into trading cards or tabletop RPGs, since you can literally get entire decks/models for free.",
            "review_score": "1"
        },
        {
            "review_text": " Really cool game, more of a tool than a game but the functionality is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Playing board games are big part of my childhood, playing with various people in my family. This game is amazing it's brought back some of those memories and I'm sure new ones are going to come from it from playing with other people online.  Not only can you play various games you can get new ones via the workshop. There's no static movment there's phyics based motion with give's it a sense of realism. Rolling your die and hitting a another player token never gets old.  Play with people online with up to 8 people.  Filp the table in rage!  I love it!  Buy it!!  ",
            "review_score": "1"
        },
        {
            "review_text": "if you have friends you should have tabletop simulator",
            "review_score": "1"
        },
        {
            "review_text": "I watch porn through the game's ipad. There's no need for incognito because there is no history.  10/8=D",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, never gets old because almost any board game you can think of can be played in this game. Amazing value really.   I only half-heartedly bought it when it was in early access, but this game has exceeded all expectations. I thought it would be hard to get people to obey the rules if they're given an open environment, turns out that wasn't a problem at all. Trolls &amp; griefers are rare, and a host can easily ban and fix any damage done in seconds by rewinding time.",
            "review_score": "1"
        },
        {
            "review_text": "If you love tabletop games, and like many of us, have friends all around the world. This is the perfect way to get together and enjoy some fun sessions of your favorite games, despite the distance. Truly a wonderful tool to bring the love for these games to a new level.  100% recommended",
            "review_score": "1"
        },
        {
            "review_text": "I never actually knew how to play 12 person chess. This game taught me how",
            "review_score": "1"
        },
        {
            "review_text": "This game lets you pretend that you actually know how to be social. It also allows for a large amount of customization. Don't bother with the DLC though.",
            "review_score": "1"
        },
        {
            "review_text": "Best table flipping simulator since Table Flipping Simulator 2006.  Edit: Table Flipper 2012 came close to being a better table flipping simulator, but Tabletop Simulator is still the best.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best investments I have ever made through steam. You are basically paying 19.99 USD for literally EVERY boardgame you could possibly want to play with your friends. From Checkers to D&amp;D there are mods created through the steam workshop for just about any game that can be played on a table. I have played alot of classic games and learned some new ones as well! I am currently addicted to 'Secret Hitler', one of the best hidden identity games I have ever played!   If you like tabletop games and have friends,     BUY IT  ",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever! If you like tabletop, meeting new people, get new friends, lose a lot, then it's a no brainer. In all seriousness this is a great platform to play and try out different games, the community is amazing and yeah it's just a lot of fun.  10/10 Would die in Kingdom Death: Monster again.",
            "review_score": "1"
        },
        {
            "review_text": "Don't get me wrong, I hate all these indie 'simulator' games, too! However, Tabletop Simulator was a huge surprise to me! It's actually a very innovative gameplay idea!   Play on servers with your friends (or even meet new people) and just play some tabletop games! Cards, board games, and trinkets are only a few things capable of being played in this software. Plus, with integrated Steam Workshop support, you're able to create or download your own mods and games that you can play online!   So, what are you waiting for?! Buy this now, and make some new friends! :D",
            "review_score": "1"
        },
        {
            "review_text": "Proving once again that your friends cant be trusted with the simplest tasks.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best value games on steam, $20 for thousands of games (with mods, and if someone with the mod hosts the game you dont even need to download the mod). Any game you can think of that can be played on a table probably has a mod for it for this game. You can also flip the table whenever you're playing with someone who is a damned cheater!  It also looks nice on the vive. I like how you can adjust your size and shrink down and stand on the table surrounded by giant pieces.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is great because the possibilities are endless. Just like the game title says, virtually anything can be played that requires top of a table. The mods is where it’s at. With more than 8,000 mods available you can find a lot of most popular board games, so you can play them for free instead of actually buying the physical copies. But to play this game, you definitely need some friends. If you don’t have any you could probably find people to play with on forums or within the game itself. Tabletop Simulator is an excellent time killer if you want to relax, chat, laugh, and have fun with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "After all this time, I will give this game a thumbs up because I believe this is the quintessential party game everyone that uses steam every other day should have. This game is what you make it. If you chose to not be social, not make a mod, not use other mods, afraid to learn rules, or afraid to host games, You will not get anything out of this game. This game is a great tool to have sit down time with friends and playboard games or even learn new boardgames since the workshop is littered with the biggest selection I've seen in a long time. But due to the game not having a great way to find common interest amongst strangers and a lot of servers are passworded. I'd recommend this game if you are a tabletop enthusiast or a friend wanting to buy the 4 pack.",
            "review_score": "1"
        },
        {
            "review_text": "If you like having a good time with friends online, buy this game and get your friends to buy it too.   Pros:    Includes pretty much every tabletop or board game known to man. Just get them from the Steam Workshop;   Developers are close to the community, hear our suggestions and frequently put out new updates to the game;   Allows you to make your own game (if you have a physical board game, you can even scan the cards/boards and import them into Tabletop Simulator);   Servers are populated with people playing all kinds of games;   Community is generally mature and respectful, and people are usually willing to teach the rules of any game.    Cons:    Ticket To Ride is not on Tabletop Simulator because there is already a PC Game for Ticket To Ride on Steam.   Playing with only 1 computer and other people in the same room is not practical.   Friends not included.  ",
            "review_score": "1"
        },
        {
            "review_text": "friends not included",
            "review_score": "1"
        },
        {
            "review_text": "played a whole game of monopoly... ooOoOOOoooo FUuUUuTuuure",
            "review_score": "1"
        },
        {
            "review_text": "Table flips and good times. spent all night making Betty White and Paula Deen puzzles with my friends. also, pictionary! what more do you need?",
            "review_score": "1"
        },
        {
            "review_text": "Aptitude Test  Play texas hold'em with friends and steal their chips secretly  Did you made it successfully ?  Then, you are ready to be a pickpocketer   10/10 would steal friend's chips again",
            "review_score": "1"
        },
        {
            "review_text": "Bought it to play D&amp;D. Have played 300+ hours of D&amp;D since then. Best $20 I've spent on Steam. Make sure to have at least one friend willing to play with you before buying this, though.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 it's as good as your favourate board game",
            "review_score": "1"
        },
        {
            "review_text": "Great game for D&amp;D and other board games^^.",
            "review_score": "1"
        },
        {
            "review_text": "This is very well made.   Sadly I can´t use it - I don´t have any friends. D:",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game for people who enjoy playing games.",
            "review_score": "1"
        },
        {
            "review_text": "The perfect game if you have no friends.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best purchases I have ever made. I bought this on Winter Sale 2015 for $10 and have definitely gotten my money worth. I thought I would have to convince my friends to get it to have a good time but it turns out the community playing it is awesome. I have yet to find myself trying to find a game and not succeeding. Additionally, it is very easy to host games and people almost always join and play with me!  I've created a few mods which was relatively simple.  My main complaint is that the controls are a little bit difficult to learn and I wish some of the functionality could be mapped to keyboard. However, once you figure it out it becomes second nature and the controls no longer get in the way.  If you're worried about dropping the money to get this and not being able to find people to play with, don't worry, the community is awesome and you will be playing games right away. Additionally, everyone is extremely friendly. However, make sure you have a microphone as it is *almost* required to play most games. There is text chat but very few people use it.",
            "review_score": "1"
        },
        {
            "review_text": "Youll make friends. Youll play with friends. Youll be happier and happier the more you dig into this game.",
            "review_score": "1"
        },
        {
            "review_text": "Did you lose all of your real life friends to board games?  Well guess what ( ͡° ͜ʖ ͡°)  Give your $15 and (╯°□°）╯︵ ┻━┻",
            "review_score": "1"
        },
        {
            "review_text": "Had low expectations, but I was pleasantly surprised! This game is so good that I've spent well over $100 on it already on buying it for others to enjoy. I truly love this game, and got to the 100 hour mark within my first week. If I had more free time, I'd already be up to 1,000 hours. Can't recommend it enough!  If you decide to buy it, I'd recommend learning Secret Hitler, Eldritch Horror, Arkham Horror, &amp; Sheriff of Nottingham; all fun games! I'd be willing to teach you any of them if you add/PM me, that's how invested I am in this game.  9/10, would be perfect if some bugs were fixed, mainly in matchmaking and ping. The issues are usually resolved by entering/exiting the server, and port forwarding helps a tonne. Expect a lot from this game!",
            "review_score": "1"
        },
        {
            "review_text": "Great game that lets you recreate any board game you can think of with its wide use of assets and textures. The community is really friendly and many people are there for a good time. Its like walking into a gamestore with casual players and none of the stigma. You might have a troll every once in awhile and there are a few bugs, but with the communities effort and bug fixes this is the game to get of 2016.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a base for tabletop games, don't get this game unless your friends will get it too. I mainly use this game for running my Dungeons and Dragons campaigns which this is pretty well suited to, there is a variety of tilesets and models on the workshop for the casual user and we can actually have a 3d representation of everyone's characters without having to pay 20 bucks or so for actual plastic models. In short, it's a good tool for D&amp;D, card games, Warhammer 40k (pretty much every army has it's models uploaded so no 3000 dollar models for your army) but remember it is a tool not a game.",
            "review_score": "1"
        },
        {
            "review_text": "Played UNO, Magic: the Gathering, Game of Life, D&amp;D, Monopoly. and Jenga.  BTW, you can play with any Magic cards so have fun playing with $500+ decks with your friends!  Browsed the web with friends  You can use any picture as a Jigsaw Puzzle  Listened to music  Flipped the table  All for $9.99  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Buy Tabletop Simulator if you want to play any board game on the planet.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine every card/board game ever. Then factor in that anyone can create their own also. Infinite games, with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "Problem: You have no friends, but need them to play card and board games. Solution: This simulator.  I cannot recomend this game enough for people who want to have a tabletop night, but can't ever get everyone in the same spot at the same time and have all the games you want. Also, it is kinda like a kickstarter of ideas for any original games you create on it, as the comunity is very polite and helpful. Plus, steam workshop support!  Edit: Will make better eventually, but for now, I'm just getting a badge.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun to play with friends and random peeps.",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it",
            "review_score": "1"
        },
        {
            "review_text": "From playing Blackjack and Poker to the latest Board Games and Tabletop RPGs, this is a wonderful experience and fun money sink for you and friends or relatives abroad when you want to have a 'game night.'  Controls are a little wonky at first, but you'll get a hang of them quickly. Lots of pre-loaded games along with a thriving steam workshop makes this title a perfect utility for your more 'traditional' gaming nights.  10/10 would flip again.",
            "review_score": "1"
        },
        {
            "review_text": "Got banned from Global Chat for saying 'Daddy'  11/10 Best Moderators",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, let's you play practically all board and card games, and more. Lots of games available on the workshop. Frequent updates and lot's of features planned. Great game fun for all ages.",
            "review_score": "1"
        },
        {
            "review_text": "While Tabletop Simulator may occasionally have glitches and no good asian proxy support, it works well enough that you generally forget about it when with friends. The ability to easily add mods or create your own makes this similar to G-mod and a blast. With the constant attention from the developer, this is definetly worth the buy once you get through the teething problems.",
            "review_score": "1"
        },
        {
            "review_text": "Tons and tons of fun.",
            "review_score": "1"
        },
        {
            "review_text": "My friend spawned an Ipad on the table and we used it to look up real porn.  10/10 would have a group wank again.",
            "review_score": "1"
        },
        {
            "review_text": "What is more sad than playing a board game alone? Playing a virtual board game alone online. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game but a bit pricy, so wait till it goes on sale.  Edit: Comma splice",
            "review_score": "1"
        },
        {
            "review_text": "Dope. Great to play Dungeons and Dragons on, and very flexible. Its like a.. tabletop sandbox in some sense. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Be playing 'Secret Hitler' &gt;Waiting for more people to join the game &gt;People start chatting as we wait and some girl talks about how her grandma said her pants were to big &gt;Some dude then says 'And then did you show them a gay porn website?' &gt;*Crickets*  This game can be pretty cringy but is p good, lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Out of all of the selections available on Steam, Tabletop Simulator is my favorite. If Tabletop simulator went away, I would be severely distraught. Having the option to play the physical games I own in an electronic format is important to me. Sometimes I don't have the time or space to setup a physical game. Sometimes I am on the road for work reasons and isn't practical to cart boardgames with me. I can work on my own games or try variants of existing games with a large monetary investment. Tabletop Simulator is my goto game playing program!",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop Simulator! What a great game. It can simulate almost any board game or game that you play on a table. I absolutely LOVE this game and what it's trying to do. It also does what what it does really well, except for a few things. The controls are a little janky at times and also I've had connection problems in the past. However, overall, this is a great game and I highly recommend it to those who enjoy simulation games.",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop Simulator allows me to easily share a hobby of mine with remote, online friends that was previously difficult if not impossible.  It's wonky and imperfect, but it more than makes up for it in flexibility. The amount of mods available is staggering - and you can always create your own. If you have any interest in making a tabletop game, this is an amazing playtesting tool as well.",
            "review_score": "1"
        },
        {
            "review_text": "As of the time I write this review, I've only started to play around with this. I'm a big RPG player, and a big fan of yugioh. Both of these things are available, in spades, on the Steam Workshop. Now, as soon as I can rope some of my friends into getting this game, we will be set for some awesome times XD  Most of the controls are really convenient (WASD panning, solid mouse controls, etc), though I find the menus a bit difficult to navigate at times. This game already has everything you need for a poker night, or any other traditional card game, built in, and has some basics for tabletop RPG's, as well. Although the vanilla RPG resources are a touch scarce, they are plentiful on the Workshop, as intended.  Better than expected physics, and definitely convenient, it has a lot of potential.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 Not Enough BoredGames. -IGN",
            "review_score": "1"
        },
        {
            "review_text": "One of the favourite games in my library. It is very easy to learn the controls and jump into an open lobby, but unfortunately there is basically no variety in public games. After about 2 months you will either have to play the same games you've played multiple times before, or host your own game (but be prepared to teach the newcomers).    While public games are fine, the true enjoyment of TTS comes from private matches. If you can convince your friends to get the game as well, you will have much more fun playing with them instead of strangers. Private matches &gt; Public matches.",
            "review_score": "1"
        },
        {
            "review_text": "This is a must have in everybodies library for the fact alone that you can just about play any bored game you have ever known and loved on it, im a big family person and playing games like monoply and blackjack was always so wonderful for me to enjoy with my sisters and parents, i have friends from other countries and playing those games again with them and making new memories is wondeful. my family is usually too busy to play stuff like that any more but when we are apart and have free time this game is a wonderful way to laugh with them once more, thank you to the creators for brigning back bored games in a cool PC way &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Joined a russian jigsaw puzzle server Made a zootopia puzzle drew wieners 9/10 would do again.",
            "review_score": "1"
        },
        {
            "review_text": "Actually simulates some good f*cking tables.  11/10 Would flip the table to scare my friends again.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far the best community i have ever seen :). Really love this game. Dont be afraid if you dont know how to play any games.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. So many endless possibilities and options for games. This simulator is literally what you make it. If you dont enjoy using TableTop Simulator, you're doing it wrong.",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop simulator is one of the most fun and versatile games out there right now, with extensible tools and work shop support, literally any tabletop game can be recreated in it to be played with people all across the globe.  With the addition of Vive support the game became 100X more valuable, now I can really sit down at a table with some people and play. It's the most fun game for anyone weather you are a hardcore tabletop master or someone who has only played Uno or Solitare.",
            "review_score": "1"
        },
        {
            "review_text": "  I spent more time playing in a room where its just a banana on a table than actually playing tabletop games, that says a lot about the games you make and how arbitrary things you put it in are very important, would recommend the Guess Who? Pepe Edition",
            "review_score": "1"
        },
        {
            "review_text": "  At first I was like.. 'Who would want to play board games on simluator?'  This game runs super smooth and is tons of fun with friends.   You can play The Game Of Life, Chess, Chinese Checkers or any other board game you can think of.  I reccomend this but only if you have 1 or more friends to play it with.",
            "review_score": "1"
        },
        {
            "review_text": "I did a puzzle of a baby sonic from sonic underground, it was the best 30 minutes of my life.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the most versatile game on steam. Literally thousands of games you can play all professional quality. From the biggest names like Settlers of Catan, Ticket to Ride and Magic the Gathering with all of its tens of thousands of cards to games you've never heard of. 9.5/10.   I only take a half off because the user to user interface and ability to find games is severely low tech. A lobby connected to IRC? What is this, the 90s? Nice for global chat but very poor at connecting you to other players for games.",
            "review_score": "1"
        },
        {
            "review_text": "  Amazing how I dont need a deck of cards to play solitare.",
            "review_score": "1"
        },
        {
            "review_text": "A blast to play with friends :)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! It's the Garry's Mod of boardgames.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent platform to play tabletop games with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "This simulator is amazing. You can play with your friends almost everything by just downloading the content on Steam Workshop. But the rules you need to make it, there aren't any default rules for a game.  (For example you can move your opponent's card etc.) Basically it's free to move, you make rules, you choose the game, you play. Oh, and you can flip the table, just in case.   ",
            "review_score": "1"
        },
        {
            "review_text": "Why the ♥♥♥♥ do you even leave your house anymore?",
            "review_score": "1"
        },
        {
            "review_text": "Fun game to play with friends but the recommended graphics are way low from what it requires. it literally shut my computer down if i try to load a complex game.",
            "review_score": "1"
        },
        {
            "review_text": "Whenever you're about to lose simple you just flip the table and leave the server",
            "review_score": "1"
        },
        {
            "review_text": "Simply put, this is the best thing to ever grace the Virtual Board Game market, because it is the ULTIMATE Virtual Board game. You can literally make anything you want with it that has to do with the world of Tabletop Games. Board Games, Pen &amp; Paper Games, Wargames, Card Games, Pen &amp; Paper Board Card Games, whatever you want!  My friends, to this day Continue to have a blast just sitting back and playing Games like Betrayal at House on the Hill, Pathfinder, or just screwing around and watching Youtube Videos on the tablet.",
            "review_score": "1"
        },
        {
            "review_text": "Cancer.",
            "review_score": "1"
        },
        {
            "review_text": "Flip table immediately",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious and fun to play with friends. Unless it's Monopoly.",
            "review_score": "1"
        },
        {
            "review_text": "Game Within a Game.",
            "review_score": "1"
        },
        {
            "review_text": "Literally the best time you'll have yelling at your friends over who is a werewolf or who has the most hotels in Monopoly.",
            "review_score": "1"
        },
        {
            "review_text": " I nominate this game for the 'Game Within A Game' award",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant board game simulator that keeps getting better and better. They keep adding substantial updates for it so it is well worth a purchase for anyone that likes boardgames",
            "review_score": "1"
        },
        {
            "review_text": "10/10 flip tables and play blackjack",
            "review_score": "1"
        },
        {
            "review_text": "This is a way to play any board game online with your friends. It doesn't know the rules of the games. It just simulates a table and provides controls for creating cards and pieces and moving them around. The controls are intuitive. The game mechanics are powerful enough to handle chess, Magic: The Gathering, poker, monopoly, dungeons and dragons, and pretty much any other board game you've ever tried.  It's better than the real thing because you don't need to get all the players in the same room at the same time and there's no cleanup afterward.  The HTC Vive support is immersive and works well, but is less efficient than the mouse controls. It works best when the vive is in room mode. In sitting mode, it sometimes selects awkward head positions.",
            "review_score": "1"
        },
        {
            "review_text": "Allows you to play board games with friends over the internet, often without having to buy the board game itself (exceptions being well-polished DLC that are worth buying, regularly emulating board games in that only one person has to own it to play it). As long you can get used to the controls, an amazing game, one of the best $15 I ever spent.",
            "review_score": "1"
        },
        {
            "review_text": "  Like just get this game I have 1,000 hours + its good it's like Millions+ Games in one can't go wrong  I'm updating this for the steam rewards   All I have to say is Endless Possibilities and Endless Imagination in one game",
            "review_score": "1"
        },
        {
            "review_text": "I like the fact that I was able to upload and get my board game online within the first day. TTS is Simple to learn and is user friendly. I hope to figure out how DLC works soon as I don't intend StratiGem to be free forever. I highly recommend this for prototyping your game and online board gaming in general.   I would like to see DLC options in the uploader though as this would make it much simpler to get it done.",
            "review_score": "1"
        },
        {
            "review_text": "  10/10 would play online chess on tablet while virtual chessboard is infront of me while friend dissaproves.",
            "review_score": "1"
        },
        {
            "review_text": "&gt; Joined server with friends &gt; Spawned tablet onto table &gt; Loaded 'porn hub' 10/10 would watch porn with friends again.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 TTS saves you money, time and allows you to save a board to continue playing another time with your friends, some that is not possible IRL with complex boardgames.    Arkham Horror + Expansion = like 400 Euro TTS + Steam workshop = 10 to 20 Euro  ",
            "review_score": "1"
        },
        {
            "review_text": "Fun and full of friendly people to play loads of board games with",
            "review_score": "1"
        },
        {
            "review_text": "ive lost 3 friends to playing uno in this      10/10 would lose more friends ;)",
            "review_score": "1"
        },
        {
            "review_text": "It's literally games within a game. What more could you want?  Also you can rage flip with no consequence. Gonna let that sink in.",
            "review_score": "1"
        },
        {
            "review_text": "i am the best uno player.",
            "review_score": "1"
        },
        {
            "review_text": "Everytime I play this with my buds the more I hate them. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AWESOME  BUY IT  YOU   MUST  BUY    IT",
            "review_score": "1"
        },
        {
            "review_text": "Flipping the table makes me feel good. Join me and feel good too. ( ͡° ͜ʖ ͡°) ",
            "review_score": "1"
        },
        {
            "review_text": "someone referred me to this as I was looking for a way to play/make some card games, this thing is good",
            "review_score": "1"
        },
        {
            "review_text": "Another way to stay isolated from the world",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play again gotta leave a positive review cuz... reasons,",
            "review_score": "1"
        },
        {
            "review_text": "russians everywhere   suka ♥♥♥♥♥/10",
            "review_score": "1"
        },
        {
            "review_text": "This thing is simply amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Haven't played much yet but from what I played and seen this is a great alternative to normal table top games if you can't afford to buy normal TTG at least you can play most of 'em virtually.",
            "review_score": "1"
        },
        {
            "review_text": "  BUY IF YOU ARE A BOARD GAME HED",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest things ever made.",
            "review_score": "1"
        },
        {
            "review_text": "You can play Cluedo online. I have been wanting this to happen for so many years, and now Tabletop Simulator has made my dream come true :D  Best game ever made i r8 8/8",
            "review_score": "1"
        },
        {
            "review_text": "Cool 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun and full of madness.",
            "review_score": "1"
        },
        {
            "review_text": "You can watch porn. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Combined with the Steam Workshop, it has every game you can think of. It is a Board Gamer's delight.",
            "review_score": "1"
        },
        {
            "review_text": "its like call of duty meets minecraft",
            "review_score": "1"
        },
        {
            "review_text": "if you like card games and board games you'll like this",
            "review_score": "1"
        },
        {
            "review_text": "I started a public poker game and used the in game Ipad to show everyone hentai. 420/69 Would hentai again",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop Simulator is everything you want it to be. Tons of games, and I mean TONS. Great controls, great physics, great internal chat system (voice and text), easy to join and create servers, and overall, just a fantastic way to spend time with friends or people you don't know. We've lost something in recent years: the joy of sitting around a table and playing a good board game. TTS brings it back. It's hard to get everyone together to play a game of Cards Against Humanity, Catan, Pandemic, or Betrayal in real life, but TTS makes it possible to play when you're thousands of miles apart. Plus, being able to play games that you don't actually own is awesome. Still though, please support the board game makers. If you like the digital version, maybe pick up the physical one too.  You will have tons of fun. This is a must have. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "The sheer amount of games that you can play with the simple resources given to you is astounding. It also helps you realise how much you would play these board games if they didn't require the set up and set down times. Everything feels smooth and satisfying.   I still need to play DnD on it.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best investments I've ever made. So many board game and card game options in the workshop and the simulator is very robust. Super easy to make your own custom items as well. Definitely grab this if you are a fan of board games, card games, DnD, or miniatures.",
            "review_score": "1"
        },
        {
            "review_text": "This game could be a lot better with a lot more options and better interface... however, it is still a 'yes' recommendation as-is. Conditional on you knowing people you want to play with. Some in the online community are idiots.",
            "review_score": "1"
        },
        {
            "review_text": "in all honesty, even though i have little playtime on here, this is a game that technically should be at a higher price, you get so many card and board games for such a low price, the only downside is that you meet alot of people who flip the table for no reason, but if you get people who dont and play a good match of cards or whatever you can have lots of fun.   i would donate money to this game. basically to put it to simple terms: if you buy this game you basically get more then 1000 games in one small online computer game.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, neat, and grand and stuff.",
            "review_score": "1"
        },
        {
            "review_text": "I'm sucking ♥♥♥♥♥ for $5 a ♥♥♥♥ suck.",
            "review_score": "1"
        },
        {
            "review_text": "have you ever wanted to play a board game but u have no friends? do i have the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "Good fun when you can actually play with random people. Just had a great game of Settlers of Catan.",
            "review_score": "1"
        },
        {
            "review_text": "Really great 'game'. Gives you everything you need to play thousands of board games. There's something satisfying about actually having to move the pieces, or shouting in disagreement about the rules of a specific game. Just wish more people had it :P",
            "review_score": "1"
        },
        {
            "review_text": "The potential for a true virtual table has been realized. I didn't think much of this when I first saw it, but after seeing the community-created content, I have become a believer in this technology.",
            "review_score": "1"
        },
        {
            "review_text": "If you have friends this is the best game you can get. If you don't, buy it anyway and laugh in any server you find.",
            "review_score": "1"
        },
        {
            "review_text": "A great game for friends to hang out and play any board game you want. Constantly having something new brought to the workshop for endless fun. Wouldn't recommmend buying this alone.",
            "review_score": "1"
        },
        {
            "review_text": "You can flick your friend's pieces off of the table.   10/10 would flick again.",
            "review_score": "1"
        },
        {
            "review_text": "Although the game was seriously buggy at first, it now has matured into a very usable platform.",
            "review_score": "1"
        },
        {
            "review_text": "Freaking awesome! If you have ever wanted to play a board game but had no RL friends, this is the cure!",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "Come and buy this game! *friends sold seppratly* Me: well I wanna buy this but I dont have friends *forever alone*",
            "review_score": "1"
        },
        {
            "review_text": "This game should be included with the HTC Vive. If you have a vive - GET THIS!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ reallife now you can play games like DND or monopoly,,, EVRY ♥♥♥♥ING GAME! for 'free'  just buy this game and you can play EVRY table game you like.",
            "review_score": "1"
        },
        {
            "review_text": "No joke, this game should be on those lists of 'Games everyone should have', like CS:GO, Minecraft, etc. This is a legend of a game, an entire new innovation. The amount of things you can do, and how intuitive it is. Not to mention the devs actually care (which you don't see a lot of nowadays). I highly, highly, HIGHLY, recommend this game to ANY kind of gamer, FPS, MOBA, MMO, RPG, players, everyone should own this.  There's such a humungous variety of things to do and I'm saddened to see that not many people own it, when it is just a brilliant game.",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop games are some of my favorite pastimes because they are fun, accessable to many different ages, and there's just something great about flipping/rolling/moving your own game peices amid friends.  But somedays... the conditions for gaming are not favorable... boxes are everywhere after a move, or maybe you need to save on gas money or your car broke down. MAYBE you're house/pet sitting and you can't leave. Well, this peice of brilliant software solves all that and is the next best thing to real life tabletop gaming.  I would give this 5 thumbs up if Steam would let me.",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop Simulator is a true gem of games that don't follow the norm and really caters as an awesome place to just chill out with your friends and play tabletop games. (and flip tables)",
            "review_score": "1"
        },
        {
            "review_text": "Great game especially for long distance relationships. Some of the snapping could use a bit of refinement but overall everything works really well.",
            "review_score": "1"
        },
        {
            "review_text": "Copy and pasted 'X gon give it to ya' on the tablet till my game crashed 10/10 would recommend",
            "review_score": "1"
        },
        {
            "review_text": "Friends are not included :/ You have to buy them separately!",
            "review_score": "1"
        },
        {
            "review_text": "Lets me write a review of it from inside the actual game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I got to play Eels and Escalators.   10/10  Would play Eels and Escalators again.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and intuitive. Super easy to use and the applications are almost endless.",
            "review_score": "1"
        },
        {
            "review_text": "This is without a doubt the single most amazing game to get on steam. This game lets you do so much and play with so many others that its hard to believe it does not cost more. If you are a family then you should get this game just to play it with your family, and if you have friends thats even better. There is so much to do on this game that it's worth getting just to explore it by yourself.",
            "review_score": "1"
        },
        {
            "review_text": "- Playing MTG on Tabletop Simulator - Join in match with three enemy russians - Xaxaxaxa blyet - Decide to play Hatecrown - 2nd turn Invisible Stalker 1/1 (Hexproof / Indestructible) - 3rd turn equip it with an auraswap ability - xaxaxaxaxa (russians teaming up) - 4rd turn equip it with Aura giving it 11/11, Trample, Defending party sacrifices 2 permanents - 5th turn auraswap card. - 6th turn Celestial card giving it 14/14 total, doubles my life. - Communist mode engaged - Attack xaxaxa #1, 20 life turns into 40 - 7th turn equip it with Flying. - 9th turn life is now 160 - Smell of wodka pouring out of their sweaty foreheads is in the air. - xaxaxa #2 is trying the bambi approach and wants to get a hall pass for the day. - Denied. Please do not pass Go. Do not collect $200 - 3rd creature Bogle hits the field. 1/1 hexproof. - Auraswap it at turn 10. - Turn 10 use 6 mana total to auraswap, give that 11/11, trample, Defending party sacrifices 2 permanents and flying. - Swing with 1/2 to Xaxaxa #1, dead. - Swing 14/14 to Xaxaxa #2, dead. - Swing 11/11 to Xaxaxa #3, dead. - Win game. - Russian yelling only understood by true counterstrike players. - Host disbands the lobby. - Best game ever. 14/xaxaxaxa",
            "review_score": "1"
        },
        {
            "review_text": "Well, pretty good 'system' for board games :) Works perfectly, I couldn't imagine better 'game' for something like that. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "'Joins Server Called Sacrifice Your Soul' 'Theres A Bag In The Middle Of The Table Called Sacrifice Your Soul'  What...  Tabletop Simulator 2016 'Piracy The Game'    Help Im Addicted      ",
            "review_score": "1"
        },
        {
            "review_text": "Its not just a game within a game; its all the games in a game.",
            "review_score": "1"
        },
        {
            "review_text": "I've spent over 100 hours in this messing around with friends playing boardgames and making tabletop adventures! From the frequent dev blogs and updates to the crazy workshop!  Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "This is awesome! Must have!",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop Simulator (TTS) - The game where I can play just about any boardgame I'd like to.   If a boardgame you have in your household, closet, or otherwise, isn't here, then with the right equipment and/or using a Steam Guide, you could put that game into TTS as a mod yourself.  A Warning : If you spawn enough objects in the game (let's say.. 800 Objects or at least 20 full stacks of poker chips,) and keep having them fall off the table and respawn, you'll probably crash the game first, or get to hear the really loud bloop, bzz, and glop noises from all the objects hitting each other.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best way to gather up with friends and play really ♥♥♥♥♥♥♥♥ boardgames, card games, or rpg games. Or you can simply create chaos across the table and flip the ♥♥♥♥ out of the table without it ever becoming broken.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play. 10/10 will flip the table again ",
            "review_score": "1"
        },
        {
            "review_text": "its a game, inside of a game, with more games! YES LAWD",
            "review_score": "1"
        },
        {
            "review_text": "You like playing tabletop games with your friends but are too lazy too meet up with them, or just simply living too far away from each other? Then this is the game for you. What is that? You don't have any friends? Don't worry. You can always just play online with other random people that also have no friends... like me!  Also you can flip tables. That is pretty fun on its own.",
            "review_score": "1"
        },
        {
            "review_text": "Saved me an entire basement worth of space in physical games.",
            "review_score": "1"
        },
        {
            "review_text": "just gor the lol's",
            "review_score": "1"
        },
        {
            "review_text": "Whatever you can think of, this game probably has it. Infact even that one thing you forgot about? Yupp, the workshop has that too!",
            "review_score": "1"
        },
        {
            "review_text": "Perfect for playing your favorite games online with your friends! Social deduction games become a bit more difficult, and the interface takes a while to get used to, but it's a great way to scratch your boardgame itch when all your friends are seperated.",
            "review_score": "1"
        },
        {
            "review_text": "Such a fun way to enjoy tabletop games with friends. The controls for handling objects is pretty fluid, although not always intuitive. For instance, when wanting to move an object, it is not always clear where it will land. For the most part, it's where your cursor is. Depending on your camera angle, however, it can be different which sometimes make certain actions like moving a counter or something across a smaller game board. That is about the only downside that I have seen so far anyway, everything else is very well made! I would enjoy a dark UI option for those late-night game sessions but other than that this a solid game for 'enjoying' a game a monopoly with your 'friends!'  Also: Don't even sweat the DLC for this game, there are hundreds if not thousands of other games available on the steam workshop for free, and actually some of the ones that are DLC are there too. Obviously, the DLC would be better made and have a more professional polish to it, but it's easy enough to recreate if you want to put that much effort into it. Also, only 1 person has to own the DLC for anyone to enjoy its so that's a plus.",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME WITH IN A GAME EVER",
            "review_score": "1"
        },
        {
            "review_text": "Can play many board games with friends online.  Literally so many.  A whole community workshop full of them.  Can even play DnD.  What else would you need?",
            "review_score": "1"
        },
        {
            "review_text": "This is a great program, especially if you and your friends live far apart and you still want to have game night. Not only that but it lets you test out a game to see if you like it before you go and shell out 50+ bucks for it at the store. (Highly recommended that if youfind that you enjoy a game you've played on here, look for it at your nearest gameing shop, already got a list for board/card games I gotta buy just from this one title alone.)",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop simulator rises and falls with it's community. The players create the many games that are available in the workshop for free, which is an amazing way to try out new boardgames. You'll have an amazing array of games to sample from.  This game is also a great tool to connect with friends I have moved away from. We play some boardgames like we used to, talking ♥♥♥♥ and hanging out on VOIPs. It does that job pretty great, even without the included 'turns' system, as long as everyone stays honorable.  The one downside is that the interaction with the board is a bit finnicky at first, but if you check out the tutorial section it starts to make sense pretty quickly. Protip is to learn how to flip cards and zoom in on objects and board.  Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Do you want to play tabletop or card games with your friends but don't have time for the travel and no way to get to your friends? Fear not there is a way for you to avoid all that trouble. Introducing Tabletop Simulator which have a pretty big community which adds alot of different kind of board and card games on the steam workshop.  There is a big selection of games to choose from, you can play up to 8-10 people ish so no problem playing with at lot of friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game is for everybody who wants to play boardgames with friends on the internet. You can find everything and refresh old memoreis and hatred for the games of your childhood.",
            "review_score": "1"
        },
        {
            "review_text": "very nice game!",
            "review_score": "1"
        },
        {
            "review_text": "Great for those lazy nights when everyone wants to play a board game but don't want to leave the house.",
            "review_score": "1"
        },
        {
            "review_text": "Hours of fun",
            "review_score": "1"
        },
        {
            "review_text": "Whenever my friends play this game, we have a set routine.  One person creates the server and loads the game. One person invites the players. One person acts as DM. Host turns off everything except ruler. Host invites me....  No flippy flippy :(",
            "review_score": "1"
        },
        {
            "review_text": "GO DICE ROLL!! so much fun!",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth your money for all the board games and card games you can play! Too busy to meet up at someone's house to play some board games? Have friends who live hours away, but you all wished you could play board games together? No worries! Tabletop Simulator's got your back!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely took me by surprise. This game was under the radar and really blew me away with how strong the community is and how much workshop content is still being made. The devs are constantly seeking feedback to make the game even better than it already is.  If you're on the fence, just buy it. You won't be sorry.",
            "review_score": "1"
        },
        {
            "review_text": "  Literally the most games within a 'game'. Tabletop simulator allows you to play multiple games (including VR) to make you happy.  Ranging from the friendship destroying Monopoly to checkers, this game is 'def' going to win an award!  No other games are like this, and it's one of a kind.  6/9 monopoly has made me lonely",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing, recommended to anybody who likes tabletop games and has a few friends to play with.",
            "review_score": "1"
        },
        {
            "review_text": "The most amazing tabletop simulating game there is on the virtual market. Have had hours of fun of playing games on this platform. Best part is you don't even need to buy the additional DLC to play, just find and download whatever board game you fancy from the Steam workshop and upload it in a room with your pals.  Pros: - Easy to learn - Easy to download different games and play them - Incredible modding community - LAN capability  Cons: - If you normally get dizzy fom games with a 1st person perspective or low FOV, this might create issues for you. - Sometimes buggy interface, assets that don't load properly - From time to time there are connection issues as well",
            "review_score": "1"
        },
        {
            "review_text": "Perfect way to play boardgames online with friends. I use it mostly for DnD and it works wonders. The modding community is amazing. Get this game if you like boardgames with friends.",
            "review_score": "1"
        },
        {
            "review_text": "DnD made easy. Like really easy",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game of games. The workshop is overflowing with various board and card games. And the dlc is always high quality.  Not 100% useful for Tabletops though but certainly doable as well.",
            "review_score": "1"
        },
        {
            "review_text": "For those who love board games, but have no friends near by(or friends at all) to play with.  An online community of board gamers from around the world, combined with a solid simulation of a board game table, makes for a solid buy I'm almost certain you won't regret.",
            "review_score": "1"
        },
        {
            "review_text": "Almost finished a game of Battleship once without flipping the table 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "All the tech in the world. Use it to play eels and esculators.",
            "review_score": "1"
        },
        {
            "review_text": "Prior to the recent update as of today this game was absolutely amazing. Modding community is phenominal and gives an extremely large variety of gameplay.  Now you cant even do the basic controls. Grouping items seems to be difficult to the point of insanity. Camera controls are screwed up and The simplest tasks become confusing and complicated. Wait until the next update so hopefully they fix this, otherwise don't get it.   TL:DR  Version 5.3 Is worse than Windows 8.1   *UPDATE* EVERYTHING ABOVE ME IS NOW NULL AND VOID. THIS GAME MAKES ME NERD ALL OVER MY SCREEN. AND I HAVE A GODAMN TV SO THATS A LOT OF NERDING",
            "review_score": "1"
        },
        {
            "review_text": "This woodland elf bestows his seal of approval upon this game.",
            "review_score": "1"
        },
        {
            "review_text": "It's good.",
            "review_score": "1"
        },
        {
            "review_text": "Simply Awesome",
            "review_score": "1"
        },
        {
            "review_text": "Play any board game. If this community were a little more active, I'd put it up there with Garry's Mod as far as must-have Steam titles go. You can find plenty of randos playing poker or cards against humanity or even Magic the Gathering (if you can agree on Formats and houserules), but ultimately, you're probably better off with friends with headsets to be able to quickly and easily negotiate the goings-on of any particular game.  Oh, and the ability to flip the table can be disabled by the host. That doesn't just happen all the time. It'd be super annoying otherwise.",
            "review_score": "1"
        },
        {
            "review_text": "Fun at first, then it gets kinda boring... until you download a ♥♥♥♥ ton of useless junk from the workshop",
            "review_score": "1"
        },
        {
            "review_text": "played eels and escalators.   10/10   would ride the eel again..",
            "review_score": "1"
        },
        {
            "review_text": "ORIGINAL REVIEW: Infinite games in one. Online multiplayer. MAKE YOUR OWN RULES!?!?!?!?!?!  Why would you NOT get this? YOU BUY NOW! YOU BUY RIGHT NOW!!!!!!!!!  UPDATE: The base game comes with Playing Cards, a Chess Set, a Piecepack, Checkers, Dice, Dominos, Mahjong, and a huge table-top RPG set - and more. Those games alone would be worth the price of admission. (Just look at the price of other chess games and Solitaire packs here on Steam. Granted, there is no AI to play against, but still.)   There is even a CALCULATOR! Do you know much a calculator costs? That's like $1 right there. :)  But seriously, the true value of this game comes from the flexibility and expandability it offers through the Workshop.  Right now at the time of this update, there are over 5,000 items in the Steam Workshop for this game. Over 2,000 of those are full games.   (1,900+ Board Games, 1,900+ Card Games - I assume some overlap between those two, since some physical games could be called both. And I know that there are multiple copies of the same game. So I'm being very conservative in my 2K+ estimate.)  So, imagine of those 2,000 games - you only like 1/10. What price would you pay for 200 boardgames?  And remember - that's just the number of games available *right now*. That number has been constantly growing since release. There's no reason to believe that this is all that is going to be added.  Many of the games are actually game systems - meaning that you can play multiple games with the supplied items. Like a deck of cards, or dominoes. There are far, far, FAR more than 2,000 games playable on here.  In fact, to call Tabletop Simulator a 'Game' is selling it far short. It's not even just a game system. It's a system of game systems. It's really more like a Gaming Platform. A platform to play games on.  Like a table - only virtual.... a simulated table.... or a Ta&lt;CHARACTER LIMIT REACHED&gt;/",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best multiplayer games I've played in a while.  10/10 would table flip again.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play with friends. The steam workshop integration makes this game even better. I think you can play any games that you can think of.",
            "review_score": "1"
        },
        {
            "review_text": "Get a group of friends, have a good time, then realize you ended up drawing something stupid on the table. Boardgaming's best friend, and even though Im not too into board games myself, I enjoy this game. Only some problems, and runs greatly on a pretty decent computer.",
            "review_score": "1"
        },
        {
            "review_text": "Yes i recommend it all because its fun in fact i made my own game with this didnt have to use real life stuff. pros: # LOTS OF FUN # I love sandbox # No actaurly aim (if there was then no dont recommend) cons: # a lot slowler than real life to do things # flip table REALLY NOW imagine a troll going on your server and flipping flipping flipping it all the time that would be annoying!",
            "review_score": "1"
        },
        {
            "review_text": "Just bought a 60 Dollar table top game of Pathfinder Adventure card game(Totally worth it btw) And then... I buy this game a single day later and see the SAME DAMN GAME, AND WITH ALL THE EXPANSIONS",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game. The 'flip the table' feature is quite useful when you're playing with someone and they do something you don't like.",
            "review_score": "1"
        },
        {
            "review_text": "My story: After no luck with the deck building feature of this game i posted saying it was missing, within a few hours the creators contacted me as a reply helping me figure out my stupidity and got it working! Game is solid, staff is solid, would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Great game couldn't fault not played much but will play more! ",
            "review_score": "1"
        },
        {
            "review_text": "Cards against humanity, ISIS flags, naked Stephen Hawking, dank memes &amp; everyone bulling a 12 year old. IGN 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game but not fun alone.",
            "review_score": "1"
        },
        {
            "review_text": "Infinite possibilities but unless you're looking at solitaire, you'll need a few friends or to join a hub to organize some games.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game! Great fun with seemingly infinite possibilities!",
            "review_score": "1"
        },
        {
            "review_text": "was forced to elave a rating",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop Simulator is a fantastic way to playtest board games that you may be tempted to buy, good for playing with friends who don't live in your area anymore, or simply when others aren't available at the time. Another possibility would be to have people gather round the monitor and play a game together in the same room when they don't own a copy of a game. I bet it would work wonderfully with the steam console hooked up to a TV.  Going onto the steam workshop allows you to look for games that you can load into tabletop simulator. If you can't find what you're looking for, maybe you can find someone who uploads games. Or maybe you have a way to create the game and upload it to the workshop.  It also has many old favorites like checkers, chess, connect 4, battleship, clue, monopoly, various card games, etc.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!!! dont buy it unless u know pepole that have it though",
            "review_score": "1"
        },
        {
            "review_text": "Checkers with a small hint of ♥♥♥♥ THIS TABLE",
            "review_score": "1"
        },
        {
            "review_text": "Great game, Very calming to play with some close friends. I suggest having friends beforehand.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun and great! Don't let my tiny play time fool you! Also, im writing this review from the in-game tablet. flip/10",
            "review_score": "1"
        },
        {
            "review_text": "I quite like this game, Its a good way to play any board games you want without leaveing your computer chair, But if you're not interested in board games, Or don't have any freinds to play them with, This game might not be fore you.",
            "review_score": "1"
        },
        {
            "review_text": "Worth it -- if you have a friend with somewhat of an attention span.",
            "review_score": "1"
        },
        {
            "review_text": "Great if you love boardgames.",
            "review_score": "1"
        },
        {
            "review_text": "watch out there is a wild qq master on this game.",
            "review_score": "1"
        },
        {
            "review_text": "Some very nice ports of boardgames and cardgames on the workshop, as well as many interesting other things like the animated rpg pieces. I recomend.",
            "review_score": "1"
        },
        {
            "review_text": "  Really like the versatility of this game. There are so many mods for games that I would otherwise have dish out hundreds of dollars for. I now have access to every magic card out there and have become a pokemon master. Anyways I have a group that used to do game nights every couple of weeks, so it pays for it self. Don't get this game if you have no friends.",
            "review_score": "1"
        },
        {
            "review_text": "Good game if you have alot of online friends, the public servers are horrible.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "An excellent buy. I would highly recommend this game, even without workshop additions or mods its great fun to play poker, chess, or other games with friends.  Also make sure you have friends.",
            "review_score": "1"
        },
        {
            "review_text": "When I was a kid, I usually got several board games for Christmas. They'd usually only be played once or twice before being put on a shelf and ignored until the end of time. I always liked board games, but my family did not. They were just not into that sort of thing, and didn't have time for it. So with no one to play board games with, how would I be able to find others to play with? The answer is Tabletop Simulator.  Now you don't need all those old games taking up room in your closet. You can find most of them in the Steam Workshop for Tabletop Simulator. And you don't need your family to play board games. Now you can play with your Steam friends and other people. You can mess around with physics and drawing. I've actually made a few friends playing this game, and you can too. Sweet. If you like board gaems, then buy Tabletop Simulator during a Steam Sale. Physics are fun. Sauce.",
            "review_score": "1"
        },
        {
            "review_text": "Spent 2 hours trying to build a puzzle with some friends. Best way to waste time 2016.",
            "review_score": "1"
        },
        {
            "review_text": "Friends keeps winning at uno and candyland.  Then they beat me to flipping the table :(",
            "review_score": "1"
        },
        {
            "review_text": "Fun game to play with friends, though honestly it is recommended actually to play with friends as playing singleplayer is basically becoming Noire 2.0  Flip tables, play Monopoly, etc, you can play all kinds of board games here. Even 100% OJ apparently.  If you have friends, definitely recommend this, but if not, it's up to you.",
            "review_score": "1"
        },
        {
            "review_text": "All the board games. All the time. What more could you want?",
            "review_score": "1"
        },
        {
            "review_text": "When I loose I sometimes want to punch my friend in the face.  I guess drawing a huge ♥♥♥♥ on the table will have to do  10/♥♥♥♥ you cain",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Board games! unlimited amount of great board games, bowling, table hockey, bowling, etc! Cons: bad controls, hard to play mechincs and it is hard to play the games.   8/10 would reconmend for board game lovers.",
            "review_score": "1"
        },
        {
            "review_text": "A really great idea executed with simple aplomb. There is an astonishing range of games in the workship; classic titles and user created content are uploaded regularly. Play on your own or play online, but watch out for trolls, who can wreak havok in a very short space of time. Password protect your room and you should be fine. So release your inner child today, so they can again fight with your friends because you suspect them to be cheating.",
            "review_score": "1"
        },
        {
            "review_text": "  You'r friend might be living really faaar away from you, but with this, you can still play table games with him!  And other than that, the workshop games are soo fun!  Dou it still has some problems like... little bugs/glitches in the menu but they are not a big problem!",
            "review_score": "1"
        },
        {
            "review_text": "  fun to flip tables when u lose or win. also fun to draw or play random workshop games. also you can use a tablet in the game for real!. can play a game and watch youtube :) (while in the game) friend gifted me the game.",
            "review_score": "1"
        },
        {
            "review_text": "OK, let me make one thing clear. IF YOU ARE EVEN CONCIDERING BUYING THIS SIMULATOR, DO SO.  This simulator isn't anything like the ones of the past. This, despite it's very apparent humor, is a fantastic program if you want to play any type of tabletop game with either strangers or friends. I played a single round of Blood Rage, and made two new friends that i look forward to playing with again. Make your own games or enjoy an established game and play along with people in real time. Give this game a try, you won't be dissappointed.",
            "review_score": "1"
        },
        {
            "review_text": "Pros- Just about everything; Community, Content, Mechanics, Replayibility  Cons- You may experience: friendship, Too much fun, People creating mods before you, and someone who's an ♥♥♥-hole once in a Red Moon(yes not blue, that's how rare)",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game to play chess and ♥♥♥♥. Discovered Secret Hitler. I missed my daughter's wedding the other week trying to find out whether player green was a slimy fascist or not. No regrets.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "they have eels and esculators 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is superlative. You can play essentially any board game that anyone's uploaded to steam workshop (i.e, just about every board game ever), and with the Unity 5 update it can actually handle all the pieces without slowing to a crawl. If you like playing board games, you should buy this- it is the board game experience digitalized perfectly.",
            "review_score": "1"
        },
        {
            "review_text": "Gave me cold war flashbacks",
            "review_score": "1"
        },
        {
            "review_text": "Only got this recently and all I can say is that I wish that I had got this sooner. I play these sort of games quite a lot but it is not always possible to get everyone in the same location and this really helps. I couldn't believe the range of games that are availiable to play and I have really enjoyed it so far.",
            "review_score": "1"
        },
        {
            "review_text": "SO. MUCH. VALUE. buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop Simulator (TTS) is going down as best game find of the year for me without a doubt. It allows for the play of pretty much any game you would play on a flat surface, regardless of format. Cards, Board Games, Dice, Roleplaying, Wargaming, Bar Games, and more still I'm not thinking of presently I'm sure.  Steam Workshop support is amazing as well. Pretty much any game you can name has already been recreated as a mod and published for free via the workshop. I've played many an obscure game in my lifetime, and have been pleasantly surprised to find most fo them already available to play.  Those couple rare games that I could not find, I've set to work on recreating, which is another point at which TTS excels. The tools it provides to quickly build your own games are very easy to use. If you can provide scans of cards and boards for a game you'd like to create, you can make your own games in a matter of minutes. If your game requires pawns, tokens, or other physical components, I've had very good results downloading 3D models to represent these items from websites devoted to sharing models for 3D printing. This allows you to recreate a favorite game you could not find on your own, or easily prototype and play games of your own design.   Additionally, there is a scripting interface that can optionally be tapped by users with some programming experience. This allows things like automatically drawing a card at he beginning of your turn or moving your pawn forward the number of spaces rolled on the dice. While this can add a nice touch to a game it should not scare non-programmers away from designing their own content... how many games have you played on your dining room table where the pieces have moved themselves around the board or the deck shuffled itself at the beginning of the game?",
            "review_score": "1"
        },
        {
            "review_text": "When this first came out I was excited and got a 4 pack hoping it would be a way to play games with my friends. I was extremely disappointed. Now a few months later they have updated the game and the workshop is loaded with content. It's almost what I want it to be. And close enough to be useful most of the time.   I have purchased a few DLC's and they seem to be quality with things organized fairly well for quick start. Many very good imports on the Workshop that are either well setup or at least have the components that a little time and effort can get things to a place where you can save it and quickly start the game when you are ready. Some of my favorite board games take a lot of time to setup and play and with this I can not only play with friends around the world but I can have the games setup before we play (saving lots of time) save the games when we are ready to take a break (giving the ability to play the longer games) and don't have to worry about losing pieces, bumping the board, and other crazy things.  That said the system is based on a very elaborate physics engine and at times I wish you could just turn it off. You pick up a card with pieces on it and they move a little (I can deal with that) then you try and put the card down and the pieces on it go flying (not so easy to deal with). It can take a lot of time and effort to set up some games so pieces don't fly when they shouldn't. If they can fix that issue this will be even better and easier to use. But it's still very good and if you want a way to play board games online this is a very good way to do it.  NOTE: I have not see anyone use the lua scripting to automate the board games. There are no rules checking scripts I have seen and the games you play here are not like playing a digital version of a board game. This is a tabletop VR simulator. You pick up the pieces and put them where you want just like in real life. It's up to you and the people who are playing with you to stop cheating or breaking rules.",
            "review_score": "1"
        },
        {
            "review_text": "All I can say is it's awesome. Great community. People always willing to teach. Occasional a$$hats, but it's fairly rare.",
            "review_score": "1"
        },
        {
            "review_text": "Hello guys.  my name is Stomedy and today I'm gonna review Tabletop Simulator for you guys. It's a very good game and much fun.   ",
            "review_score": "1"
        },
        {
            "review_text": "It brings me back to my childhood when cards and board games were my sole sources of entertainment.",
            "review_score": "1"
        },
        {
            "review_text": "A decent game, but after the first 10 hours or so, there isn't much replay value.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Definitely suggest buying.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent friend making simulator!",
            "review_score": "1"
        },
        {
            "review_text": "infinity number of games within a game, best value for price",
            "review_score": "1"
        },
        {
            "review_text": "A bit clunky for TTRPGs, but for regular board games and card games it works great. Would definitely recommend if you want to play board games but have no friends in real life who are into them.",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop Simulator is the Gmod of... well... Tabletops!",
            "review_score": "1"
        },
        {
            "review_text": "Why haven't you all gotten this already? &lt;3 Now I can play boardgames with you even if we are not in the same room, or town, or country! (And yes, the it is possible to turn of the tableflip option! &lt;3)",
            "review_score": "1"
        },
        {
            "review_text": "Do you like boardgames? This is for you. Tabletop Simulator lets you play any kind of tabletop game you can imagine. Almost every boardgame you want is up for free in Workshop. I've always wanted to play these kinds of games, but I don't have many friends locally to do so. This lets you play everything from Catan to The Star Trek VHS Board Game with friends. AND IT REALLY WORKS!  I got my money's worth from TTS on my first day. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good, a must buy if you have friends to play it with.",
            "review_score": "1"
        },
        {
            "review_text": "I played a simulation of playing a card game about simulating playing a trading card game. Nice.",
            "review_score": "1"
        },
        {
            "review_text": "One of best steam stuff, I recommend a lot to buy it",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game to play with friends, the workshop is full with stuff, and you can even mod it yourself, if you know some drawing programs, maybe 3D modelling. :) I recommend it to everyone! :D It's even fun with strangers, if you don't have friends, who play this awesome game. :D Buy it, it's so worth it :P",
            "review_score": "1"
        },
        {
            "review_text": "I just missed out on the sale, but I honestly don't care. TTS is an awesome sandbox for board and card games. For someone like me, who has friends all over Europe as opposed to people living nearby, this 'tool' is fantastic for those weekly get togethers (it helps to have some friends who are into tabletop gaming!).  Don't worry about content, Steam Workshop alone has hundreds, if not thousands, of mods that are either recreations, parodies, or emulations of classic and well loved games. There are other places to go too! Also there are plenty of original community made games to play out there.  Given the time, the assets (made by others or yourself), and a bit of patience, you could make yourself the most intricate of board or card game. Axis and Allies? No problem! Set up the board once and save it so you never have to spend hours setting it up ever again! Dungeons and Dragons your thing? There are numerous methods of putting together your favorite pen and paper RPG! Table Hockey? Pong? Monopoly? StarFluxx? Cards Against Humanity? Chance are someone has the game for you!  A great party game best played with friends, much easier than setting up webcams and clearing table space! TTS is a fanatstic goto for hours of fun, well worth the full price!",
            "review_score": "1"
        },
        {
            "review_text": "Didn't know how to play blackjack so I brought the tablet tool into the game and looked up a YouTube video on it. 11/10 best YouTube sim out there.",
            "review_score": "1"
        },
        {
            "review_text": " Tabletop Simulator  is exactly what the name implies- it's a tabletop simulator.  The game is overall amazing and has some amazing workshop content, involving the littlest things that make your games of poker the slightest bits more fun, or the large card games from real life such as  Secret Hitler .  Overall, this game is a 9/10 in my book, and I highly recommend you get it for it's high replay value.",
            "review_score": "1"
        },
        {
            "review_text": "I can finally play UNO and Yu-Gi-Oh! with my online friends and flip the table without consequences or harming those around me. Best $20 I've spent in ages.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, wish they added a way to save custom tables and backgrounds so you could mix and match more, otherwise 10/10 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is such a blast. It's perfect when you've got a hilarious group of friends that lives all over the place, and you still wanna have that boardgame experience with them.   Plus it's great just for messing around. I don't think I'll ever complete a game of Chess, because once someone starts losing, the pieces start flying. :O",
            "review_score": "1"
        },
        {
            "review_text": "It's awesome because you can do whatever you want on there. There are no rules.",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop may seem like just old classic board games but think again. You can do anything you want like knock pieces over while playing with a friend. Google something on the inside game computer. No wonder this game made it to VR gaming.",
            "review_score": "1"
        },
        {
            "review_text": "You can play board games with friends, but online. There isn't much to it.",
            "review_score": "1"
        },
        {
            "review_text": "Really well-made and fun. I was surprised at the amount of games that are available on TTS.",
            "review_score": "1"
        },
        {
            "review_text": "You can play board games with friends, but online. There isn't much to it.",
            "review_score": "1"
        },
        {
            "review_text": "8/8, would play again. Multiplayer is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "it's nice",
            "review_score": "1"
        },
        {
            "review_text": "Great game. If you have tons of free time and the will to learn, you will have a blast. Easy to pick up controls too.",
            "review_score": "1"
        },
        {
            "review_text": "Play board games with your friends without the need for travel.",
            "review_score": "1"
        },
        {
            "review_text": "Flip the table!",
            "review_score": "1"
        },
        {
            "review_text": "Such a good friendly game, or not, depending on who gets Mayfair",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop Simulator is a must have for any board game enthusiast, offering a lot of community content for great times with a party of friends. Easy mechanics allow for smooth control over the game and the game can be saved for those longer sessions. Players can add their own scripting for easier control of games or subscribe to content. If you really enjoy something add it permanently to your game chest full of additional pieces and tools (tablet, calculator, etc.).",
            "review_score": "1"
        },
        {
            "review_text": "not what i thought.. this is more for the design aspect than i thought... i am looking more for create and play aspect... but i think i will learn more over time as i try and create games and use mods ive found of games i love!",
            "review_score": "1"
        },
        {
            "review_text": "get some friends and this game",
            "review_score": "1"
        },
        {
            "review_text": "you can be as mean as you want without getting punched ;)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing fun with friends!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome 'game', the Vive support is great.",
            "review_score": "1"
        },
        {
            "review_text": "I've spent hours playing this game without realizing it, only to be reminded when I find myself hungry after 6 hours of not eating.",
            "review_score": "1"
        },
        {
            "review_text": "The possibilities are literally endless. Either you can find a copy of a game out there to play on the marketplace, or find the rescources you need to build and code your own. It's perfect for someone like me who loves board games but lives on the other side of the country from those i typically enjoy playing them with.  The controls are pretty straight forward, though it takes a bit to get used to changing cameras and manipulating pieces for those who arent familiar with gaming. But other than that, this is pretty much required for anyone who likes traditional games.",
            "review_score": "1"
        },
        {
            "review_text": "Its a good game",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop Simulator aims to be the ideal platform to play games, traditionally limited to physical contact, anywhere in the world with anyone you want. This game has bridged long distance friendships and keeps board game night going no matter the distance. The game just gives you a sandbox to play in and doesn't force any tabletop game's rules on the players, this allows for any complexity of game to be played. All you need is to scan the board game's assets into the computer to play it digitally with friends. Have no idea how to do that? That's OK because one of this game's biggest strengths is it's mod support. Check out the Workshop and you will most likely find what you are looking for. I think this game should be a must have for anyone who enjoys traditional board, card and tabletop games.",
            "review_score": "1"
        },
        {
            "review_text": "Want to play table top games but your too poor to go out and buy them? WELL TABLE TOP SIM IS FOR YOUUUUU!  like games about Hitler; we got it  like games about racial stereotypes; we got it  like chess; we go- acually if you want this game just for chess thats sad  Cant find the game you want? then make it for everyone else.  Tabletop sim, the ultimate friendship ruiner :)  ",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing! Great if you're in a LDR and want to play board games with your SO.",
            "review_score": "1"
        },
        {
            "review_text": "  This is a amazing game",
            "review_score": "1"
        },
        {
            "review_text": "I kickstarted the game on a whim. The idea of a physics engine for tabletop games seemed so cool!  It came out and it is even better than I hoped. I play the game for hours with friends. So many games have been added and some are even directly supported by the devs and game publishers.",
            "review_score": "1"
        },
        {
            "review_text": "Very versitile. The workshop has plenty of great content.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the obvious choice for the 'Game Within a Game' award. As long as you have some friends (I know this can be the hardest step), you get and absolute ♥♥♥♥-ton of potential games you can play with them. If you happen to live far away from your friends but you want to play some good 'ole board games, or just mess around, this is the perfect solution.   I am going to go further and say that 20 euro for a game that offers you so much possibilities is dirt cheap, and it also goes on sales quite frequently.",
            "review_score": "1"
        },
        {
            "review_text": "So many different games to play and many more being added. Well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop simulator flowchart:  Do you like board games? do you have friends? do those friends like board games?  if you answered yes to all of these questions, buy this game, you owe it to yourself.",
            "review_score": "1"
        },
        {
            "review_text": "A deck of cards would have been cheaper, but less fun.",
            "review_score": "1"
        },
        {
            "review_text": "This 'game' allows you to play many tabletop board games, card games and RPGs. Find yourself some friends even if they are around the world and have fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so god damn intense that my friend's keyboard died while we were playing. What a high-pressure, intense game!",
            "review_score": "1"
        },
        {
            "review_text": "Playing cardboard games with my friends in this game. It's like play in real life.  Really enjoy it. Especially can play Granblue Fantasy in-game tablet too.  10/10 Would flip the table again when RAGEQUIT.",
            "review_score": "1"
        },
        {
            "review_text": "Get a group of friends together and you can play this for days, maybe years. Online community is also one of the nicer ones, as most are willing to teach you a new game if you want to try one out.",
            "review_score": "1"
        },
        {
            "review_text": "Great Concept and top notch execution for a thing that let you do a lot freely. Feel a little sad for those board game creator that got plagirize though",
            "review_score": "1"
        },
        {
            "review_text": "A really fun game to play with friend as it houses other fun games inside for hours of endless entertainment!",
            "review_score": "1"
        },
        {
            "review_text": "A really fun game to play with friend as it houses other fun games inside for hours of endless entertainment!",
            "review_score": "1"
        },
        {
            "review_text": "A nice game to chill with you friends",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game that allows you to play board games and miniature games with friends who may not be in the same state or country as you. I also enjoy the many mods of games that people upload to the workshop and the games that have offical releases.",
            "review_score": "1"
        },
        {
            "review_text": "The video makes this game look stupid and a joke, bit it actually has great community support and lots of great scans of current boardgames. Great way to test boardgames before you buy them!",
            "review_score": "1"
        },
        {
            "review_text": "cool beans",
            "review_score": "1"
        },
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "I had to explain to strangers on the Internet how to play Uno. This game is tons of fun; you can play like any board game ever thought of by man.",
            "review_score": "1"
        },
        {
            "review_text": "for a badge, also the table flipping mechanic is the ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "The most fun I've had with friends since actually going to their houses and playing board games.",
            "review_score": "1"
        },
        {
            "review_text": "  i still can't remember how much money to pass out in monopoly",
            "review_score": "1"
        },
        {
            "review_text": "I am Turk so my mother tongue is Turkish but there is minute amount Turkish player which playing this game, so i decided to write this review in English. You can play every board games in this game, for example Monopoly, UNO, Secret Hitler and a lot games like those. I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "  -Tell friends to get game -After 6 months they get it -Play uno  -Sore loser flips table  -Everyone is amazed  -next day play poker -everyone keeps flicking ♥♥♥♥ -next day revokes privileges -Friends are ♥♥♥♥♥♥ so they make there own server -Same thing happens -The cycle gets around to everone -I now have no friends   9.76/10 Would loose sanity again",
            "review_score": "1"
        },
        {
            "review_text": "Played Dungeons and Dragons with friends and got bored waiting for my turn, so I played chess with a friend in the same game  Played a game within a game during another game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A game that holds many games in store for all ages. Reccomended multi player game if you love playing games like Magic the Gathering, Yugioh, Checkers, Secret Hitler, Uno, Chess, bowling and more!  - Physics can be a bit off at times but it's not game breaking.  - It's rather boring playing alone as there isn't really an ai player system for single player, so expect this game to be played with friends near exclusively.  - Has a really neat brush and pencil tool features to decorate the table and the scenery to your heart's content  - The workshop is your lifesavor as it's stuffed full of amazing games to add to the endless experiences.  - Bone/joint binding feature for shenanigans   - Has an insanely wonderful community that is more then willing to help out any questions you have for the game and its bugs if you ever encounter any.",
            "review_score": "1"
        },
        {
            "review_text": "A simulator that takes all the strong points of board games in real life and combines them with the conveniences of online features. Connecting strangers who have similar interests in table top games and bringing them together. Additionally, it carries a strong modding community, with fan made board games -- all for free!",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game NEEDS 64 BIT SUPPORT",
            "review_score": "1"
        },
        {
            "review_text": "Blackjack and daemons",
            "review_score": "1"
        },
        {
            "review_text": "I think this is what heaven looks like when a board game enthusiast dies.",
            "review_score": "1"
        },
        {
            "review_text": "its good",
            "review_score": "1"
        },
        {
            "review_text": "I was here because the impossible game",
            "review_score": "1"
        },
        {
            "review_text": "A must have for fans of tabletop games, like card games, board games, pen and paper RPG, etc.  This is a physics simulator. There is no rules implementation, you can script somethings to help run the game easier. But basically you will need to know the rules of the game you are trying to simulate. Just like on a real world game.  Also the Mod community is amazing. You can find almost any tabletop game on Steam Workshop.    Indispensavel para fãs de jogos de mesa, como jogos de cartas, de tabuleiro, RPGs de papel e caneta, etc.  Esse é um simulador de física. Não há implementação de regras, você pode usar script para ajudar a jogar mais facilmente. Mas basicamente você tem que saber as regras do jogo que está tentando simular. Assim como em um jogo no mundo real.  Além disso a comunidade de mod é incrivel. Você pode achar quase qualquer jogo de mesa no Steam Workshop.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, does exactly what you want it to, controls smoothly (and completely with the mouse if you so wish it), gamepad support is as good as it can get. Can't wait to try it in VR one day. Workshop content has everything you could want and more and the new updates always make it even better. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop piracy made even more convinent. 10/10 love not paying for things.   I usually dont make joke reviews like this, but there is seriously nothing else I want to say about this game. The controls work, the community can be a bit toxic at times but is overall pretty fun to play in public lobbies or friends alike. The only reason this game is in my personal favorites is because it allows me to test out real life tabletop games without having to spend money on them right away. I ended up finding one of my favorite, casual strategy/chess variant games(Input) through the workshop. But yeah, the workshop contains about 95% total disregard for product copyright. You play this to pirate stuff, not to prototype new games like the developers shamelessly advertised it as early on. Please, if you play this game, and you have real life friends to invite over for a night of tabletop games, respect the people who gave you these concepts. Buy the physical games. Or at least buy the DLC and not the ghetto workshop versions of said DLC...",
            "review_score": "1"
        },
        {
            "review_text": "The hardest part of this game is buying more copies of it to give to your friends so you aren't lonely.",
            "review_score": "1"
        },
        {
            "review_text": "If someone can find the images for a card/board game, it can be remade here easily. Control is solid, even though it has physics. A true board game 'emulator,' a word that rhymes with this games only problem, the name. For the love of all things sacred, distance yourselves from the word 'simulator.'",
            "review_score": "1"
        },
        {
            "review_text": "Friends not included.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun and list of games is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop simulator is an amazing game with nearly limitless potential. Whether you're making your own game, playing the classics or playing someone else's creation you're going to have loads of fun. Tabletop simulator provides you with a virtual sandbox to mess around with your friends on the internet. The game's online aspect is a really smooth experience, especially compared to many other games' online multiplayer. The only criticisms I have about the game is occasionally the controls can feel clunky and from time to time the rewind function is a bit inconsistent.  The game is amazing value, easily worth the money. I bought it on sale but I would easily pay full price for this game. I bought the 4 pack and I don't regret it at all. I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "being severely autistic may cause difficulties.",
            "review_score": "1"
        },
        {
            "review_text": "Best purchase I ever made on steam, full stop.",
            "review_score": "1"
        },
        {
            "review_text": "Clunky but the only one of it's type.",
            "review_score": "1"
        },
        {
            "review_text": "I cannot tell you how happy I am to have this. I am the proud owner of many tabletop games such as Netrunner, Dark of Winter, Legendary, and Doomtown Reloaded. It used to be that I could only play these games with my family but once a year while on vacation. Not anymore!  Thanks to Tabletop Simulator we can play anytime. And it truly deserves the world 'simulator' in its name. Much the same way a good flight simulator makes you feel like you're actually flying a plane, Tabletop Simulator makes you feel like you're truly sitting at the table with the cards and dice in front of you. Draw a card, flip it over, roll the dice, shuffle the deck, bump the table.  The only thing that would make this game better is Oculus Rift compatibility. Are you listening, game developers? :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Not only does it give you basically EVERY board game for $20 ($10 on sale &amp; excluding DLC even though the DLC is very unique and TONS of fun), but you can make your own too very simply. And for anyone looking for more advanced tools, it also includes lua scripting for automation and really awesome concepts (like tron!). And you can do all of this online with your friends and IN VIRTUAL ♥♥♥♥ING REALITY where you can shrink down to the size of the minifigures and flip THE ♥♥♥♥ING WORLD (i.e. table). This is my favorite game of all time, and it has a shockingly low price for oodles (yes I said it) of fun. Just. Buy. It.",
            "review_score": "1"
        },
        {
            "review_text": "You have every boardgame and cardgame at your fingertips. Also there are many powerful tools in game and online to build a custom game.  All at an affordable price.",
            "review_score": "1"
        },
        {
            "review_text": "Its Cool Fam",
            "review_score": "1"
        },
        {
            "review_text": "Tabletop Simulator. The legal way to play every game imaginable (and unimaginable) without paying a dime. Take that Hasbro!",
            "review_score": "1"
        },
        {
            "review_text": "Trolling random people on the internet has never been so easy.",
            "review_score": "1"
        },
        {
            "review_text": "Simply the best way to play tabletop games on the computer.",
            "review_score": "1"
        },
        {
            "review_text": "Lets me throw all the cards and flip the table in rage without having me worry about cleaning it up.",
            "review_score": "1"
        },
        {
            "review_text": "It's very spicy.",
            "review_score": "1"
        },
        {
            "review_text": "If you've ever wanted to be able to play any board game imaginable, but either don't have the money or friends to play the real thing, Tabletop Simulator is there for you.  ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Sandbox Game!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great platform for board games with friends. The steam workshop feature really helps in this regard, hosting tools, objects and even full board games (whether homemade or (based upon) an existing one) on it.  I personally used it and will continue to use it to play D&amp;D and a whole lot of card games with friends*. Apparently it works with VR as well, which i never tried but i think that is pretty neat. Also, this is still under development, so bugs are being removed and features being added.  *WARNING: Friends not included.",
            "review_score": "1"
        },
        {
            "review_text": "It is a really fun game, but only if alot of your friends buy it too. So, unless you have friends with the game, I wouldn't recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great buy! My friends and I have never been closer!  Which is hilarious because I don't actually have friends  Please be my friend  I'm so lonely on this game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a Table You play on Top  -Flips the table in Rage-",
            "review_score": "1"
        },
        {
            "review_text": "A game that does what it pomised and made it out of early access.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "Better than real life. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It works really well and you can play boardgames online. Practically any game.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game for one reason and one reason only.  For ages our ancestors have been playing board games without any fun you know me im that guy i join the server for 5 seconds And throw all of your stuff off the table then i leave.",
            "review_score": "1"
        },
        {
            "review_text": "you have a table, its great",
            "review_score": "1"
        },
        {
            "review_text": "Hold Ctrl+C On Something. Now Rapidly Press Ctrl+V. Your Welcome.",
            "review_score": "1"
        },
        {
            "review_text": "If you have some friends and want to play board or cardgames without buying all the real-life games, then this ga,e is perfect for you. You can basically play anygame you can image, like seriously, take a look in the workshop. :D",
            "review_score": "1"
        },
        {
            "review_text": "For only $5(discount) you can get to play with a lot of games and with people over the net, better than actually buying a board game but the only advantage is that you can't play multiplayer if you don't have internet connection.   This game totally worth more than any AAA title out there just to steal your money and leave you unsatisfied, buy this game, it is literally worth more than it should be.",
            "review_score": "1"
        },
        {
            "review_text": "I cant turn it off... like i cant actually close the game. Well its closed but still counts as running... ",
            "review_score": "1"
        },
        {
            "review_text": "its ight",
            "review_score": "1"
        },
        {
            "review_text": "This game is great for getting a group of busy people together to play some Roleplaying games or Board games. I've used this to get people who want to play with my group the ability to participate from their own homes. I love all the features and the dedicated Workshop content that has brought me back some old memories of games that don't exsist anymore.",
            "review_score": "1"
        },
        {
            "review_text": "-Gets invited to a nice game of chess -Goes through 5 minutes of the rules -I go first -I move my Knight -He moves his pawn -I move my pawn -He grabs all his pieces, chucks it onto my side, flips table and says in chat 'CHECKMATE ♥♥♥♥♥!'  10/10 great game - Lionsoda",
            "review_score": "1"
        },
        {
            "review_text": "Almost lost checker...flipped table ez win",
            "review_score": "1"
        },
        {
            "review_text": "Does what it says on the tin. VR support is super neat even in its unfinished state. I scaled myself way up and my friend scaled himself way down and I got all up in his face and scared him and it was great.",
            "review_score": "1"
        },
        {
            "review_text": "hi all is good game low cost but not have menu no have exit no options is good game",
            "review_score": "1"
        },
        {
            "review_text": "9 pimps out of 10 pimps",
            "review_score": "1"
        },
        {
            "review_text": "Used in game tablet to log onto steam and play the game inside the game.... 10/10",
            "review_score": "1"
        },
        {
            "review_text": "So i have played a few hours of this game and here is my take on it:  Likes: - Its really fun with 2 to 8 people.  - There are MANY different games on here - Always something to play with someone - Physics and the like make it enjoyable to just roll dice - Flipping tables  Dislikes:  - Some controls are hard to use - Some people just ruin games and quit - Most playable servers are un-populated - Rules are generally not displayed - Usually only find one good group of people every now and again  Would i suggest this game to people? For the $20 they ask... no, not really. If it goes on sale or if a few friends pitch in for the 4 pack then yes. Its a fun game and you get plenty of play out of it but just like all board games, this becomes kinda boring and if you are anything like me (Fairly low attention span) then you wont get much play unless playing with people you know.  Hope this helped. Happy Gaming",
            "review_score": "1"
        },
        {
            "review_text": "It's really dependant on the quality of the mods you are using, but there are a lot of great free mods in the workshop, and if you love board games then this is easily worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "7.8/10 too much server bans aside from that the physics engine is good",
            "review_score": "1"
        },
        {
            "review_text": "Developers and creators, thank you. This is ♥♥♥♥ing amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best 'bang for your buck' games on steam. With the buy in price you get access to the mod community which is very alive and hard working on converting board games, card games, and table top RPGs to the system. There are so many great table top games that you can play for free with this including Battlestar Galactica, Betrayal at house of the hill, Dead of Winter and many more. Fans have also added in many card games including The Witcher 3 gwent, Final Fantasy 8 triple triad, and of course cards against humanity. The amount of table top activities you can achieve with this game are amazing and its far easier sometimes to find a game online than IRL due to time constraints, money issues, and simply not wanting to set up and dismantle most large games. I recommend this system to anyone interested in tabletop games in any shape or form be they RPGs, board games or card games. ",
            "review_score": "1"
        },
        {
            "review_text": "Loads of fun with friends!",
            "review_score": "1"
        },
        {
            "review_text": "9/11 sim 11/9 - IGN would bomb again",
            "review_score": "1"
        },
        {
            "review_text": "Everyone is a Goat in this game. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "why play cards and ♥♥♥♥ irl when you can do it online with a bunch of random ♥♥♥♥♥♥♥s who's only goal is to flip the table??",
            "review_score": "1"
        },
        {
            "review_text": "Do you wanna play a game within a game? Here you go. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Leaving this here because of a board game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Very nice software! Now I can: - Play board and card games with friends who live far away from me - Try expensive board games before buying them - Prototype and playtest my own game projects easily",
            "review_score": "1"
        },
        {
            "review_text": "Simulates a tabletop very well",
            "review_score": "1"
        },
        {
            "review_text": "Table. Flip.",
            "review_score": "1"
        },
        {
            "review_text": "Worth the buy, enjoyed it, and will continue enjoying it.",
            "review_score": "1"
        },
        {
            "review_text": "  8.5/10 TJBs",
            "review_score": "1"
        },
        {
            "review_text": "its super neato when you are not watchingg furry porn with strangers while red is in the bathroom",
            "review_score": "1"
        },
        {
            "review_text": "All I do is copy and paste bananas everywhere. Well worth the money",
            "review_score": "1"
        },
        {
            "review_text": "Although I only play the game for Cards Against Humanity and Anime Card games, it offers a whole lot of custom game modes and is a necessity for anyone looking for a fun waste of time.",
            "review_score": "1"
        },
        {
            "review_text": "Epic fun, Lot's of Workshop content. Just gather some friends and go play lots of great tabletop games.",
            "review_score": "1"
        },
        {
            "review_text": "Does what it says on the tin and more.",
            "review_score": "1"
        },
        {
            "review_text": "Cant find a old school game you rember playing, YOUR NOT LOOKING HARD ENUF. Has damn near every boardgame i could want to play and if not someone usally ports it in :D whooooo",
            "review_score": "1"
        },
        {
            "review_text": "At first I was all like, woah, the physics in this game are really fun to play with!  Then I realised that the physics engine just simulates sitting round a table, playing games with your friends.  Then I realised that... HOLY ♥♥♥♥, I LOVE PLAYING BOARDGAMES WITH MY FRIENDS THIS IS THE BEST THING EVERRR",
            "review_score": "1"
        },
        {
            "review_text": "Only reviewing this game for the achievement progress, but it's still a good game so I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Are you tired of interacting with people directly? Don't you wish that you could play games that require human interaction without all that pesky speaking to one another? Try this game here. You can have as much fun as you would with a night at grandma's without the grandma.  Flip that table, boy. I won't tell.",
            "review_score": "1"
        },
        {
            "review_text": "8.7/10 love this game, i ts okay by yourself but even better with a friend or two. Never a dull moment, becuase if there is one, you can always throw the table clear across the map",
            "review_score": "1"
        },
        {
            "review_text": "1st game that lets you be hitler and enjoy having fun with friends at the same time. 9/11 would gas again",
            "review_score": "1"
        },
        {
            "review_text": "There's only really a handful of games you can't play online that you can with Tabletop Simulator. But you can flip the table and throw game pieces around so it's whatever.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game , but kind of missing the AI, because not everybody wants to sit around and play with others all the time. other than that I Highly recommend this game because it has all of your favorite board games for it.",
            "review_score": "1"
        },
        {
            "review_text": "You're probably hyped as balls by the trailer, but wondering how viable online multiplayer is with strangers. It's good, don't worry. You can find a game to join within 10 minutes.   I'd recommend fast games like Coup, Bang!, or Love Letter, because things go a bit slower in this game vs real life.",
            "review_score": "1"
        },
        {
            "review_text": "There is nothing better for playing remotely with other players than this game. I use it every week to play with my brother in another town. Excellent product! Only game I've really cared about in the Early Access program, and I'm glad to see them come out of it. This game is worth every penny I spent, and it's still worth it at the higher price, now that they're out of Early Access.  Keep up the good work, devs!",
            "review_score": "1"
        },
        {
            "review_text": "Its a game for playing games with your friends that aren't there!",
            "review_score": "1"
        },
        {
            "review_text": "As someone who never played this before, I bought the 4-Pack so I could share with my friends. I have not been disappointed yet. You get to pretty much play any game from your childhood. Uno, Sorry! Guess Who, Battleship, The Game of Life, and so much more! The game has a bunch of simple games like Chess, Checkers, Reversi, and Solitare built in, but the rest are mods. I don't think there is a game I've not found on the Workshop.  Now, I've owned this game for about a week now and I recently developed my very own RPG Dungeon Crawler. The tools I used to build it were very simple and easy to understand. I was able to complete this massive game in 13 hours straight. Now it's almost been 3 days since release and it has 120+ Subs and 300+ Unique Views. Many more than I anticipated!  Here's  my mod! :D  Tabletop Simulator is a game that should have been thought of about a decade ago. Probably a game I won't over-play anytime soon! You did a great job, Berserk Games!  I'd recommend getting this game especially on sale, but for how massive this game can be, $22 is a very fair price!",
            "review_score": "1"
        },
        {
            "review_text": "Gave away my location on Google using the Ipad the game provides. Now there are people waiting outside to shoot me because I won against them.",
            "review_score": "1"
        },
        {
            "review_text": "Cards against humanity is the best, funniest, and most offensive card game I have ever played you ****** piece of ****.  You can suck my **** if you don't like this ****.  It's too bad that we live in such a bull**** overyly-sensitive *****-*** cultuer that they had to call it 'tabletop simulator' so that a bunch of sjw ******* wouldn't start a twitter/facebook petition that no one really gives a **** about to try and ♥♥♥♥ it down.  10/10 must-buy.",
            "review_score": "1"
        },
        {
            "review_text": "Great for card and board games.   I wouldn't try playing a roleplaying game with it though. Unless you're pretending to be Wash from Firefly.",
            "review_score": "1"
        },
        {
            "review_text": "If you love different boardgames or card games, this is the one for you.",
            "review_score": "1"
        },
        {
            "review_text": "You get to flick balls. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Play any board game you want with your friends. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I ♥♥♥♥♥♥ off my friends by flipping the table    9/11",
            "review_score": "1"
        },
        {
            "review_text": "pros: -not call of duty -not enough simulator  -mods -incredibly realistic graphics perfect for MLG players like me cons: -not call of duty -too much tabletop  10/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "I wrote this from the tablet inside the game.",
            "review_score": "1"
        },
        {
            "review_text": "A really fun and entertain simulator to play with friends or random strangers. Lots you can do especially with the added physics interactions like joins, flicking and general collisions.  A must buy for anyone who wants to play something a bit different from an FPS or ARPG.",
            "review_score": "1"
        },
        {
            "review_text": "became satan and purchased a butt man in the game 'snake oil'   9/10 needs more butt man",
            "review_score": "1"
        },
        {
            "review_text": "Really an excellent way to be able to get that feel of playing a game with friends - even when you can't be in the same room together.",
            "review_score": "1"
        },
        {
            "review_text": "Flipped a card Flipped a chip Flipped a piece Flipped a die Flipped a table  Flipped the table again in mid air  10/10 would flip again.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game with a fantastic comunity. A bad seend every once in a while, but really great overall. I am recomending it to my friend so we can get together and play some games.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game with a fantastic comunity. A bad seend every once in a while, but really great overall. I am recomending it to my friend so we can get together and play some games.",
            "review_score": "1"
        },
        {
            "review_text": "While somewhat cumbersome in its controls and mechanically limited in card ownership, the fact that you can play whatever games people happen to create for it makes it a great deal. Classics like Chess, Go, and your standard card games (like Poker) are all present and available, but the workshop lets you play many more games, including some that people have made uniquely for testing with others. This makes it a great vector for testing your own game with others, if you're a board game designer.",
            "review_score": "1"
        },
        {
            "review_text": "This is a MUST buy for any board game enthusiasts. It's great to be able to play just about any board game with your friends online instead of having to wait to meet up in real life. It's also a good way to try out board games before you buy them. Definitely one of the best games on steam. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Hey, guys, how about fix this RAM leaks already? Great game, but poorly made. I mean I really like this one, I made few mods (private) w\\ my friend, but game keeps constantly crashing because of memory leaks, it's like 3.5Gb with even not a half cards loaded. I know about unchecking 'full size texture' box, but in this case game becomes blurry as hell.  Well, at very least it's still something, but Im looking forward to the new updates of performance, not God damn DLC.  But don't think it's that bad, I'm still haaving fun with this game, just little bit upset in total.  Soz for poor English, folks. Have some fun or something.",
            "review_score": "1"
        },
        {
            "review_text": "The tablet feature taught me how many    eggs    I can fit in my    pan.       10/10 would    fry    again  Han Solo dies. ",
            "review_score": "1"
        },
        {
            "review_text": "&gt;be me &gt;never have played D&amp;D &gt;is told you can do what you want in D&amp;D &gt;forms army of political figures &gt;game looks like a to scale model of the presidential debate (sort of) &gt;realize how great this game is &gt;write a steam review for this game and end it with '10/10 -ign' 10/10 -ign",
            "review_score": "1"
        },
        {
            "review_text": "9/11 would watch porn again while watching 9/11 youtube videos",
            "review_score": "1"
        },
        {
            "review_text": "I love to troll in this game and to talk with small children...  If you care to play with small boys and girls as old guy ? so this game is perfect for you :D U are the best, because your enemies are children.",
            "review_score": "1"
        },
        {
            "review_text": "(╯°□°)╯︵ ┻━┻ FLIP THAT TABLE. ┻━┻ ︵ ヽ(°□°ヽ) FLIP THIS TABLE.  ┻━┻ ︵ ＼\\('0')/／ ︵ ┻━┻ FLIP ALL THE TABLES! ಠ_ಠ bob... ಠ_ಠ Put. ಠ__ಠ The tables. ಠ___ಠ Back. (╮°-°)╮┳━┳ (╯°□°)╯︵ ┻━┻ NEVER! ",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever 9/11 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "i watch porn on this",
            "review_score": "1"
        },
        {
            "review_text": "Porn Pals Simulator 2015",
            "review_score": "1"
        },
        {
            "review_text": "Everyone is a jerk. There are no games you can join where you're not kicked out before you can finish saying hello. You can only play this game with friends, which means I'm out of luck.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is pretty cool.",
            "review_score": "1"
        },
        {
            "review_text": "While the game works as intended, the community is wayy too reclusive. It's impossible to find people for D&amp;D games, or other RPG's. It might be fun to mess around in checkers or chess, but, lets face it.. TTS is capable of much much more.   If you're looking for something to play D&amp;D or other tabletop games, you probably should look elsewhere.  If TTS wants to boost its numbers, and actually connect gamers, I would think it would have to sharply drop is price. Then it would be a contender against Roll20, and other VTT's.",
            "review_score": "-1"
        },
        {
            "review_text": "Currently I cant reccomend this game, the situation of people joining a server and throwing cards around ruins it",
            "review_score": "-1"
        },
        {
            "review_text": "Pros:  -Physics simulators are always amusing. -Tableflip button is a must for realistic tabletop simulating -Lots of games available in the workshop. Cons: -Buggy as hell. Don't expect to be able to just pick up and play with your friends. -Don't expect those workshop games to actually work. -Pure physics sim. Most board games have very little rule enforcement, which can be bad if you don't know the rules.",
            "review_score": "-1"
        },
        {
            "review_text": "I like the premise and I'm sure its fun if you can play it, but they do not publish this games network connectivity requirements so I was never able to access the server browser to play anything with anyone. I was able to direct connect a friend but we could not see or talk to eachother despite us both being in the game together. Their response on the forums is 'turn it off and on again, press reset, unplug and replug everything, remove your router' and while that's a cute IT crowd response to a customer problem, it doesn't help me open ports and poke holes in the firewall.",
            "review_score": "-1"
        },
        {
            "review_text": "When everything works, it's brilliant. All the fun of sitting around a table with your friends, now supporting friends who you are thousands of miles away from. Awesome.  But:   - The UI is clunky. Most importantly to me, this is the 'panning and zooming' aspect of camera controls. If you have an angle from which you can see absolutely everything, it's fine. But usually you need to constantly zoom into different parts of the board to see what's going on properly. You can 'save' camera angles, which makes this less of an issue for certain games, but most games you just cannot pick a couple of angles which will be relevant all the time.   - It crashes constantly. As in, just closes, straight back to desktop, without an error message (and without any error log that I can find). I have been told that in other people's experience, crashes are most commonly related to 'out of memory' errors. I expect that can't be the issue here unless TTS is keeping things in memory that it really shouldn't.   - There is no way to 'pre-load' assets. Card faces are loaded as needed, which brings the entire game to a grinding 'did my PC just lock up completely?' halt while it does such intensive tasks as 'downloading a file' (Is it single-threaded, perhaps?)   - I would not base my review on this alone, because I'm honestly not sure, but: 90% of the Steam Workshop content appears to be no-way-in-hell-was-this-authorised board game rips",
            "review_score": "-1"
        },
        {
            "review_text": "Released with overpriced DLC. R.I.P. My goodwill",
            "review_score": "-1"
        },
        {
            "review_text": "Was very much enjoying the game, however i was not allow to speak my mind in the ways that the golbal chat is too open for inturpretation and could be use for anything, it turns out i was wrong! global now means news about the game, who knew? i am dissapointed with the legal system withing this game and wish to have a formal apology withing 5 hours and 23 minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "Welp, i was hoping for better controls in a simulator game.everything is controlled by your mouse, and its awful.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly a cool idea, but it's essentially a physics simulator, with various game pieces. I really want to give it a good review, because so far I have really enjoyed it, but there are some things that I feel could be worked on before they start devoting their time to pumping out DLC. It's ridiculous that there is no floor, and pieces and the table just fall to oblivion, I mean, is it that hard to have two tables in the same environment, and scale one of them up to room size?   It's hard to like any game whos developers haven't really finished the game, but are already making DLC. The game feels sloppy and has a pretty steep learning curve, which makes games like Betrayel almost impossible to play on it.",
            "review_score": "-1"
        },
        {
            "review_text": "nearly all servers are passworded, unless you have friends who also own this, then good luck.  might aswell buy a real board game.",
            "review_score": "-1"
        },
        {
            "review_text": "Hours wasted in the BUILT IN deck builder trying to make a deck to play a simple card game with my buddies...hours wasted. My time spent in game does not reflect the grueling hours of work put into making a Magic The Gathering deck only to have them turn out completely black every single time.",
            "review_score": "-1"
        },
        {
            "review_text": "Watch the previews... theyre not what the game really is. yes but its hard to manuver obkects and is virtually impossable to do (some) of the things that ar on da trailer. id give it 10/10 4 physics but 5/10 for keeping me interested.",
            "review_score": "-1"
        },
        {
            "review_text": "Kick Banned ♥♥♥♥ ♥♥♥♥ ?  Games Secret Hitler",
            "review_score": "-1"
        },
        {
            "review_text": "no single player, store page is misleading. Dont buy thinking there is 'AI' built in which I thought of when buying.  Deleted game and got Valve to remove from my library",
            "review_score": "-1"
        },
        {
            "review_text": "people always flip the table and ruin ALLL the fun. I cant play boardgames with real people because I have no friends and now I cant even play them online :(",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this as a possible replacement for Roll20 for my weekly D&amp;D game. Nope! Way too clunky to get anything done. Roll20, for all of its UX issues, is still much better suited to RPG gaming.",
            "review_score": "-1"
        },
        {
            "review_text": "Like surgeon simulator but trying to play a board game. Not playable",
            "review_score": "-1"
        },
        {
            "review_text": "This thing ♥♥♥♥ing sucks",
            "review_score": "-1"
        },
        {
            "review_text": "the chat moderators do not like me :(",
            "review_score": "-1"
        },
        {
            "review_text": "It too annoying to even play solitaire on this. I have to remember 4-5 quickbinds just to scan the table and flip a card over. So much potential, 'zero craps given' in execution.",
            "review_score": "-1"
        },
        {
            "review_text": "It's such a fun game! For all of about 10 minutes. Then you get board. Get it? Board? Because all you can do is play Board games that get boring quick just like in reality.",
            "review_score": "-1"
        },
        {
            "review_text": "Roflemao how are even this not suede? Tabletop steal element from boardgame. No skill coders, only hackers in tabletop. Idiotia idea and noob developers only copy paste game",
            "review_score": "-1"
        },
        {
            "review_text": "This game is far too expensive for what its worth. There are only around 20 games that aren't great and then you have to pay extra for the dlcs after paying £15 which is very expensive for what the game should be worth (around £5 in my opinion) I tried playing it with friends and still not that fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Probably the best value for a game I've ever seen other than maybe Orange Box. I'd very highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "thousands of dollars of MTG decks for $20, werth/10",
            "review_score": "1"
        },
        {
            "review_text": "Have fun and make you're own rules",
            "review_score": "1"
        },
        {
            "review_text": "Putting cards into someone else's hand during Uno 10/10",
            "review_score": "1"
        }
    ]
}