{
    "app_id": 286240,
    "name": "Dog Sled Saga",
    "release_date": "2016-09-22",
    "developer": [
        "Trichotomy"
    ],
    "publisher": [
        "Trichotomy"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Racing",
        "RPG",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Sports",
        "Dog"
    ],
    "achievements": 12,
    "positive_ratings": 298,
    "negative_ratings": 27,
    "price": 5.79,
    "description": "As a rookie musher, foster a dogsledding team whose skills will grow if they're treated right. Week by week, get to know your dogs' unique traits, and carve your story into the trails of the Mount St. Something region.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/286240/header.jpg?t=1481748492",
    "minimum_requirements": "OS: Windows XP or newer Processor: 2.0 GHz Dual Core Memory: 1 GB RAM Graphics: OpenGL 2.0 Compatible Sound Card: OpenAL Compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Priced perfectly, great art, and I love the music. Dogs have enough variety in characteristics to give them some personality and make them memorable. Racing could use a bit more challenge and/or variety, but overall it's an enjoyable game.",
            "review_score": "1"
        },
        {
            "review_text": "Great little game , it gets repetetive if you play for long sessions , but its really fun and you bond with your dogs , worth the price",
            "review_score": "1"
        },
        {
            "review_text": "It's good fun, but it doesn't seem to have much more replayability after you finish all the objectives.",
            "review_score": "1"
        },
        {
            "review_text": "For such a simple minigame type of gameplay, it has a ton of things to do, lots of character and passion. Even with no real knowledge of the actual Iditarod this game is fun, fast paced, and very easy to get into but still has all the challenege one needs to curse at the screen wildly!   You can even make puppies and groom them to be the best racing dog, all the while continuing to climb the League Ladder so you can get even more of the cold (very cold) hard cash.   Only negative I could say is it is definitely repetitive, you will be doing the same thing for a long time. I haven't gotten to an ending just yet, but hopefully there is a period on this game, though I am not against it if it goes on forever Rouge-like style.   All in All, Definitely a good buy!",
            "review_score": "1"
        },
        {
            "review_text": "The game is great, but I relised that you have all sorts of dog color variations. However you forgot a Husky in red variation. I would like to see more of the coat variations.Like german shepards can be brown and black or just black. There also might be a albino. Just a suggestion I love the game and I have high hopes for the game.",
            "review_score": "1"
        },
        {
            "review_text": "really nice and also cool",
            "review_score": "1"
        },
        {
            "review_text": "So far, I have played Dog Sled Saga for about 4 hours, just got into league 3, have a 4 dog team (am still training the newbie) and I am looking forward to the future!  All in all, this is one of those games that is more than the sum of it’s parts. At first glance it appears to be just another simple management game, however there are so many little details that really make this one something special! Everything feels like an accomplishment, and skilled game play is rewarded with more money, and happier, less fatigued dogs.   There is a bit of a learning curve as you get use to the timing of the races, but it isn’t to bad, and even in the beginning when you don't really know what is going on, it is possible to make ends meet.  I found all aspects of the game to be well balanced from the start, and as my own skill and knowledge improved the game play did not become to easy or monotonous. You control the pace of the game with how many dogs you own, and what league you are in.  Now, I am trying to save up enough money to expand my kennels, so I can try my hand at breading!  I feel like the fun is just beginning, and I can't wait to see what else this game has in store!",
            "review_score": "1"
        }
    ]
}