{
    "app_id": 286280,
    "name": "Steel Armor: Blaze of War",
    "release_date": "2015-03-05",
    "developer": [
        "Graviteam"
    ],
    "publisher": [
        "Graviteam"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Strategy",
        "Tanks"
    ],
    "achievements": 43,
    "positive_ratings": 156,
    "negative_ratings": 37,
    "price": 22.99,
    "description": "Steel Armor: Blaze of War is realistic tank simulator with tactical elements. The game models Soviet T-62 tank and US M60A1 tank in detail. Each tank has interactive cockpit with crew. Player controls a tank, and commands a tank platoon and attached forces in 4 large scale dynamic campaigns.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/286280/header.jpg?t=1555246363",
    "minimum_requirements": "OS: Windows Vista Processor: AMD/Intel 2GHz, 2 cores Memory: 2 GB RAM Graphics: DirectX 9 Compatible DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX 9 Compatible",
    "recommended_requirements": "OS: Windows 7 SP1 Processor: AMD/Intel 3GHz+, 4 cores Memory: 4 GB RAM Graphics: DirectX 9 Compatible DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX 9 Compatible",
    "reviews": [
        {
            "review_text": "*Disclaimer* Please disregard Hours played, I bought this from Gamersgate a couple of years ago and have clocked up at least 75 hours. Bought the Steam version in order to place this review and to support the developer.  Make no mistake this game is not easy to learn, there are literally hundreds of controls and commands to master, i still find myself referring to the manual mid game, however your efforts will be rewarded. The UI too is a little counter intuitive, it really takes some time getting to grips with it but once you understand it it makes sense. The tutorial is not great either, next to useless in fact but there are players around who can assist you and videos, wikis etc that will shed more light on things if you care to seek them out.  This game doubles as both a realistic Tank simulator and a Platoon level strategy sandbox, you get to design scenarios, deploy your units, set up your tactics and command your men from the comfort of a beautifully modelled tank.  You can occupy any of the tank crew positions, driver, gunner, commander or loader and switch between them, the interiors are beautifully and accurately modelled and no other game manages to recreate the sense of claustrophobia, the feelings of immense power and terrible vulnerability as experienced by real tank crews, in my humble opinion.  There are only two playable tanks but they have been modelled to an exceptionally high standard, it's a case of quality over quantity, the maps too are beautiful with great lighting and weather effects that really succeed in creating a believeable and atmospheric battlefield experience.  Realism is key to this game, ballistics are accurately modelled, as is the damage (or lack of it), shoot the wrong kind of round or even the right kind at a 45 degree thick armour plate and it'll glance off harmlessly into the sky, hit a weak spot square on with armour piercing and bingo! satisfying penetration, the game will accurately calculate whether or not the systems, munitions, fuel tanks or crew etc get damaged or are destroyed. After the fight you can review all the hits and any damage caused.  Tactics matter, the way you manoeuvre matters, unit positioning matters, coordinating your forces well will pay dividends and poor decisions are ruthlessly punished.  In a nutshell - this is a labour of love made by a developer that is passionate about armoured warfare and it shows, get through the tricky first few hours and you'll see just what a great tank sim this is. If you don't mind a steep learning curve and are up for a challenge this game will pay you back in spades.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of crap gets given to Steel Armor - Blaze of War because there are only two operational tank models to use. That is a bit of a misconception. Yes there are only the T-62 and M60A1 to be driven and operated... BUT in most battles you are a part of a tank squad, platoon, company or all three, therefore you are able to interchange between multiple numbers of M60A1s and T-62s. You are also able to give orders to Infantry, APCs, other tank variations like the T-55, Chieftain, and Olifant, Aircraft and other units via the Tactical Map. If you've played Graviteam Tactics, it's basically the exact same thing, so really this game could be seen as an add-on to Graviteam Tactics, or Graviteam Tactics could be seen as an add-on to Steel Armor... I'm not really sure which came first. But yes, you can only control the T-62 and the M60A1 but that is no where near the only unit in the game.   The settings are a bit odd... Afghanastan 1979-1989. Iran 1980-1988. Angola 1975-2002. Most of those areas are not your typical, main stream maps, but once you get into one of the tanks you won't really care.   You could also say that it's not as fun as a World War 2 tank sim would be, and as I would mostly agree with you, the tanks involved in this game are not so advanced as to take away what made WWII an interesting and challenging fight. There are no radar guided missiles, lazer beams, etc. It's still hardcore and fairly straightforward basic combat reminiscent of the battles of WWII.",
            "review_score": "1"
        },
        {
            "review_text": "Supurb tank sim.  Interface needs some work but you should know what your getting into if your a niche sim guy. Highly scalable, plays on my notebook. Combined arms are a sight to behold.  If you love military sims look no further.",
            "review_score": "1"
        },
        {
            "review_text": "Ok i love this sim so much, you get into so much of panic when you look through a scope and then a shell files over you're tank.  My only problem is only two playable tanks, but guess by the full interior of the tank it must take forver to do one tank, but i would love to play the Chieftian.",
            "review_score": "1"
        },
        {
            "review_text": "An awesome tank sim! I highly recommend it. Not as good as Steel Fury or Steel Beasts but not far behind from those.",
            "review_score": "1"
        },
        {
            "review_text": "I have played tank games for as long as computers came out and i have found that this game is as close as it gets to the real thing . As for the controls ,yes it takes time to know what to do and how to use them and if you think it should be just jump in and fire. then you should try and run a real tank not that easy it will take time but it will be the best dam game when you do . Happy Hunting",
            "review_score": "1"
        },
        {
            "review_text": "Best simulator with tanks that i have played!",
            "review_score": "1"
        },
        {
            "review_text": "I play for the bumpin music and cool hats.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a joke. Five minutes into game...Abandon Tank over &amp; over again!. Only a handfull of missions to play and they all suck. Tank wont even fire half the time. The tutorial is so ♥♥♥♥♥♥ it's funny. The tutorial messages pop up on screen while playing and half of them make no sence what so ever. Go ahead and buy it and you will see. Bet you get a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Probbably a Great 'Tank Sim'  -But since it Lacks Nvidia 'Asus 120 Hz 3D LCD support......  -I Loose interest, right a way.  (pitty they diddent go Nvida Style 3D)",
            "review_score": "-1"
        }
    ]
}