{
    "app_id": 286830,
    "name": "Hard Truck Apocalypse: Arcade / Ex Machina: Arcade",
    "release_date": "2014-03-14",
    "developer": [
        "Targem Games"
    ],
    "publisher": [
        "Buka Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Racing"
    ],
    "tags": [
        "Action",
        "Racing",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 43,
    "negative_ratings": 102,
    "price": 3.99,
    "description": "Hard Truck Apocalypse: Arcade/Ex Machina Arcade - is the races through the deserted prairies and canyons of northern America, infected by a fatal virus. You are to find the reasons of the global catastrophe described in the original game Hard Truck: Apocalypse.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/286830/header.jpg?t=1518534224",
    "minimum_requirements": "OS: XP/Vista/7/8 Processor: Pentium 4/Athlon XP 2 GHz Memory: 512 MB RAM Graphics: DirectX compatible 128 MB graphics Storage: 1500 MB available space",
    "recommended_requirements": "OS: XP/Vista/7/8 Processor: Pentium 4/Athlon 64 3 GHz Memory: 1 GB RAM Graphics: DirectX compatible 256 MB graphics Storage: 1500 MB available space",
    "reviews": [
        {
            "review_text": "Boring, a waste of money and it has not a single one of the nice aspects of the old Hard Truck Apocalypse titels in it. A shame.",
            "review_score": "-1"
        },
        {
            "review_text": "This game locked up my system on the first attempt to load, and only successfully started after a second attempt. I really do not care for the way this game runs, and I would advice people to hold off until the bugs are worked out.  BTW, I could never get HTA Ex Machina to load, and because I haven't played it for a minimum of five minutes, I cannot write a review of trhe game.",
            "review_score": "-1"
        },
        {
            "review_text": "i actually got in the game but there was so many toturials that i didnt even wannat try it so DONT BUY THIS PIECE OF garbage game even if it is on sale",
            "review_score": "-1"
        }
    ]
}