{
    "app_id": 287120,
    "name": "Ionball 2: Ionstorm",
    "release_date": "2014-06-06",
    "developer": [
        "Ironsun Studios"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual"
    ],
    "tags": [
        "Casual",
        "Action",
        "Arcade"
    ],
    "achievements": 26,
    "positive_ratings": 439,
    "negative_ratings": 164,
    "price": 2.99,
    "description": "IonBall 2: Ionstorm is an arcade game with a modern 3D twist; re-live the joys and frustrations (in equal measure) of classics games such as Breakout and Arkanoid, in a no holds barred fast action game with stunning 3D environments, awesome effects and a thumping soundtrack.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/287120/header.jpg?t=1447360857",
    "minimum_requirements": "OS: Windows XP Processor: Dual Core 1.6 ghz or better Memory: 2 GB RAM Graphics: Graphics card supporting DirectX 9.0c and Shader Model 3.0 DirectX: Version 9.0c Storage: 2 GB available space Sound Card: Any",
    "recommended_requirements": "OS: Windows 7 Processor: Dual Core 2.0 ghz or better Memory: 4 GB RAM Graphics: nVidia GeForce 8800 or higher. ATI HD 3850 or higher. DirectX: Version 9.0c Storage: 2 GB available space Sound Card: Any",
    "reviews": [
        {
            "review_text": "Holy Moly - after 2 mins I was all  'I CAN'T SEE ANYTHING - HOW THE HELL - BAD REVIEW THIS!!!'  Then I went into the options, dialled the fx down, switched to the overhead camera and it got a LOT better!!  This isn't one of those breakout games where you carefully knock the ball around trying to get that last brick - it's frenetic and BONKERS busy - you will need to zone-in to it - you may want to tune-out the music unless hardroad/metal/bassdrop is your thing (I kinda like it but it repeats a BIT too often)   Once you've gotten that all done - it's really quite good I think!",
            "review_score": "1"
        },
        {
            "review_text": "I have a soft spot for bat and ball games like Arkanoid and Breakout (yes, I'm that old). Ionball 2 isn't the best of them, but it is the hardest! Unfortunately its difficult is mostly down to it being very hard to see the damn ball. There's bling, blam and explosion effects everywhere, plasma trails on anything that moves, a dense background that's hard to see anything against, and sparks whenever anything that moves hits anything that doesn't. I very nearly wrote this off after 10 minutes as completely unplayable, but do yourself a favour and a) turn the graphics settings to Fastest (ie. minimum)... trust me, it's far better this way, and b) select the 'overhead' view from the options. Then it becomes playable and you won't burn your retinas off, although it's still quite challenging due to its speed. Most of your deaths will still come from losing sight of the ball amidst the chaos, but at least you can learn to filter it out.  On the plus side, it has mostly smart level design, the upgrade system is worthwhile, and the periodic laser that blasts stray blocks is a godsend to minimise hunting the last brick syndrome. It's also responsive, the angles work as they should, and the music's pretty good. What can I say?  Still, this is a borderline recommendation for those who love this genre, otherwise I'd give it a miss.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic sci-fi breakout game on crack! Fast action, nice graphics and cool music. Hope you have good reflexes.",
            "review_score": "1"
        },
        {
            "review_text": "Ionball 2 is a really well polished and generally decent Breakout game, there’s enough interesting ideas and customisation in the active and passive upgrades to give you a few playthroughs and still have you enjoy it every time. If you’re interested in a little bit of brick breaking action you can’t go wrong here.",
            "review_score": "1"
        },
        {
            "review_text": "Ionball 2: Ionstorm is one of the countless 'Pong' clones. Compared to the free browser clones, this one does not change anything to the main formula; The power-ups, moving enemies.. it has all been done before.   The only real difference are the graphics, which obviously look better than the browser games I've played. The only problem here is that you sometimes lose track of the ball, because of the use of colours and explosions (once you destroy enemy ships). The space theme and the uplifting trance music fit the game nicely and there are online leaderboards, which might be a reason to play this game more often.  It wouldn't hurt if the game had some achievements but overall Ionball 2: Ionstorm is a musthave for people who enjoy pong clones and don't mind throwing a few bucks around for a Steam version.   At the time of writing the game costs 1,04 euro which is a great price but I wouldn't recommend buying it for full price (7 euro).",
            "review_score": "1"
        },
        {
            "review_text": "It's a truly a next-gen game,one of the best in the industry.",
            "review_score": "1"
        },
        {
            "review_text": "Waste of time and money.... the paddle does not even go all the way to the side of the levels making completing them more luck than skill.... nope, theres better games of this genre out there.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely awful game, I have no idea how this has such a high user rating. The graphics aren't actually all that good while still being laggy even on lowest settings for no good reason. You start out severely gimped with a ball that moves at once too fast and in a really jerky manner at the same time. There is no explanation of the controls, or much of anything. Not using a gamepad? Well, f*ck you then, WE certainly aren't telling you which button does what or letting you change them! Basic input tutorials take too much effort. Accidentally press Escape on the main menu? Dumped back to desktop you get, not even a confirmation dialogue. Whoever made this copied everything that is bad about the 'retro' and 'indie' market.   Go get Shatter instead, it looks at least as nice while being actually fun to play.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to like this game... I want to... but the mouse controls make this unplayable. Not to say you can't finish it, you can, if you are determined enough and can refrain from smashing your computer, but seriously the mouse controls... are.. soo.... bad. sooooooo bad. your movement is never consistent. sometimes the paddle movement lags or stutters. sometimes it goes really fast. Either these designers are ♥♥♥♥♥♥♥♥, or, in an attempt to make a 'challenging' game, did it on purpose. Either way, designer stupidity a challenging game does not make, and this game is unplayable in its current state.",
            "review_score": "-1"
        },
        {
            "review_text": "Addicting and worth it :3",
            "review_score": "1"
        },
        {
            "review_text": "combination of 2 retro game  maybe pong or ricochet + galaxian  very addictive fit for time killer",
            "review_score": "1"
        },
        {
            "review_text": "This game brought me back into arcade action. Enough said. NOW BUY THIS GREAT GAME!!",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░░░░░░░░▄▄░░░░░░░░░  ░░░░░░░░░░░█░░█░░░░░░░░  ░░░░░░░░░░░█░░█░░░░░░░░  ░░░░░░░░░░█░░░█░░░░░░░░  ░░░░░░░░░█░░░░█░░░░░░░░  ███████▄▄█░░░░░██████▄░ ▓▓▓▓▓▓█░░░░░░░░░░░░░░█░  ▓▓▓▓▓▓█░░░░░░░░░░░░░░█░  ▓▓▓▓▓▓█░░░░░░░░░░░░░░█░  ▓▓▓▓▓▓█░░░░░░░░░░░░░░█░  ▓▓▓▓▓▓█░░░░░░░░░░░░░░█░  ▓▓▓▓▓▓█████░░░░░░░░░█░░  ██████▀░░░░▀▀██████▀░░░",
            "review_score": "1"
        },
        {
            "review_text": "I found this game pretty boring. You might not. Im not sure. ",
            "review_score": "-1"
        },
        {
            "review_text": "A fun arcade game if you only have a short time to game.",
            "review_score": "1"
        },
        {
            "review_text": "Remember space invaders from 1970's?  Now I knowl how amazed people felt those days! This is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "An injection of ♥♥♥♥ing ADRENALINE!!! play the ♥♥♥♥ing game feel the frustration of not seeing the bloody ball but at the end stand victorious without knowing how the ♥♥♥♥ happened!!!! Great xp!",
            "review_score": "1"
        },
        {
            "review_text": "PROS rich 3D graphics for an arkanoid type of game, so many levels XP system to buy upgrades cheap  CONS sometimes its difficult to track the ball because of flashy graphics  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I had lots of fun with this game. Nice techno/dance music too.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty much, a remake of the good old 'Arkanoid' game. You got your bat and your ball and you must break the lines of the flying droids and stuff. I'd say that it's a pretty good remake, as it adds some original features into the arkanoid games, as new enemies, abilities a game modes. I do recommend you this game, if you like yourself some arkanoid some time.",
            "review_score": "1"
        },
        {
            "review_text": "You get some really weird bounces every now and then, but you'd be an idiot to expect otherwise from this genre.",
            "review_score": "1"
        },
        {
            "review_text": "glad i bought this game. fun time killer with great gameplay and music",
            "review_score": "1"
        },
        {
            "review_text": "♥ Oldschool Yehhhaww ♥  - this Game is A.w.e.s.o.m.o. / e. :)",
            "review_score": "1"
        }
    ]
}