{
    "app_id": 287100,
    "name": "Chaos Domain",
    "release_date": "2014-05-01",
    "developer": [
        "Holy Warp",
        "Black Wing Foundation"
    ],
    "publisher": [
        "KISS ltd",
        "Holy Warp"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 39,
    "positive_ratings": 243,
    "negative_ratings": 557,
    "price": 6.99,
    "description": "Chaos Domain is a game about shooting bad people in the face. Apart from that, it is also a run and gun platformer, powered by Unreal Engine. The game is highly influenced by games from 8-bit and 16-bit era, including Contra/Probotector series, as well as titles like Abuse and Doom Troopers.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/287100/header.jpg?t=1447360857",
    "minimum_requirements": "OS: Windows 7 Processor: Intel CORE i3 2.6 GHz Memory: 2 GB RAM Graphics: ATI Radeon 5570 1GB/Nvidia GT 450 DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: Intel CORE i5 2 GHz Memory: 4 GB RAM Graphics: ATI Radeon HD 6770/Nvidia GTX 550 Ti DirectX: Version 9.0c Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "The first negative review I've written and certainly not something I take much pleasure in.  Chaos Domain as has been mentioned by many reviewers is a return to the age old Contra formula, static 8 directional shooting (much like the sort a classic D-pad was meant for) with awkward platforming, enemies that can shoot you through platforms that are supposed to be solid objects and ridiculously slippy controls without all the fluidity of Contras double jumping, this game is best left on the wayside.  For those of you like me, who don't own a 360 controller and don't necessarily see it as a requirement for games on a PC- don't get me started, the control scheme is a nightmare. I'm left handed and the standard controls are made with a right handed user in mind so you'll need to go through the borish task of arranging them to better suit you. The keyboard controls are poorly responsive and in a twitch shooting game where dozens of enemies might be shooting at you at once this is unacceptable.  Now on to the basics, I played one mission- that's three sections of a map that are broken up to create a single mission- so three 'check points' as it were. The beginning of the game as you might expect has you running to the right- but not able to return to the left (!) to collect missed pick ups or kill enemies and has you repeat this process three times, all while being shot by enemies through floors and walls, ceilings and anything else they seem to teleport their bullets through, which would be forgivable if you didn't get three lives (and one continue on the easier difficulty per check point) and died when you were hit once.  At the end of the first mission I was faced with a boss that is clearly a rip off of the loader from Aliens and other titles in the same franchise where it might well crop up. You are on a conveyor being dragged towards it while it fires either on a platform above it, or down the conveyor you are travelling on. You MUST hit it in the cockpit, meaning you need to be on the upper platform- not an issue, if not for the respawning guy on the platform above, lobbing grenades down at you that have an AOE far larger than is indicated by the explosion shown on screen.  It was at this point I turned the game off, and cursed myself for even bothering to pick it up.  I'm not going to list pros and cons for this, as I can't be bothered to do so. I'll simply offer my honest advice, keep your money, don't waste your time and don't waste a friends time- unless he/she and you are equally brain dead, by forking cash over for this half baked attempt at a classic and realized concept. Your friendship will swiftly end, your irritation will reach maximum levels in record time and your relatives will swiftly disown you if they learn you have this in your library.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has no theme coesion, the game simply crashes at level 2-2 and the devs never fixed it.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game a while back, and here's a transcript of my thoughts: 'Oh cool, a free game giveaway! Why would they give their game away for free?' -Starts playing the game- 'Oh, that's why they're giving their game away for free...' -Stops playing the game-",
            "review_score": "-1"
        },
        {
            "review_text": "This is first what im gonna say (so you wont need to read the rest if your not intrested).  if you every think of buying the game Plz dont the price is just Money stealing even on sale it's money stealing. this game should be free-to-play (even then you might think why is this on free-to-play when its awful).  this review is for 0.4 min (maybe gonna be updated ) the game try to remind me of contra (but it dint realy work) .  the controls are realy out of shape , they respond some times realy werid when i need to do a fast situation .  music is bad (at beginning was good but after 1 - 2 min gets annoying ) .  I like the guns (were simple).  graphics were ok (even tought i like more 2D style side scroller game than a 3D)  Rifle enemys in the first mission and couple more are just .... DUMB even there shooting is easy to dodge. Grenade laucher enemys were annoying cause radius of explosion is barley visible so i never know if its gonna hit me or not.  and than there are some kamikaze dude who rush towards you with there guns (that they dont shoot with) and spawn fast,and jump realy f@#!ed up way.",
            "review_score": "-1"
        },
        {
            "review_text": "I recieved this game as a gift from a friend. He won it in a giveaway and it wasn't his style of game. That being said, I come from the era of Contra and R-Tyle, etc. This game is a ♥♥♥♥-poor attempt at the frentic run-n-gun platformer genre. I'd love to find something good to say about the game, but I sadly can't. I was only able to play for about 45 mins before I got so infuriated at the controls and general buggyness that I had to call it. The controls are extremely slipshod; you cannot angle your gun 45 degrees without moving, you cannot aim your jumps well, and the general feel of moving the charactor is jerky at best. This is the heart of RnGP's, how can you screw that up, honestly? It's beyond infuriating. Visuals are bland and uninspired, same level designs over and over from what I could get through, same enemies with slight weapon variations, and simply lackluster environs. I could almost forgive that, given the nostalgia twang it tried to invoke, but it's seriosly worse than Simons Quest. The music is repetitive, and not in the good way. I can understand a lazy repetitive score on the older 8/16-bit games, but even if you're going after that feel, there is no excuse for re-using the same boring tune throughout. Do yourself a favor and avoid this title, it simply isn't worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Ever since I saw the thumbnail, it managed to get my attention. Constantly. Even moreso once I saw the screenshots. Then I got it for free in a giveaway.  In 20 minutes, I've played up until the first boss fight.  It does indeed keeps the spirit of old arcade run 'n gun like Contra and Metal Slug, to a degree: One hit kills, 6-directional non-mouse aiming, run left or right, jump, shoot, repeat.  Make no mistake, however: This game is exactly as bad as they say it is.  Level design is bland, not because of the art style (although it's nothing new either), but because of the extremely simple layout (even moreso than the first Contra). You die if you touch enemies. Bullets to the face may also present a threat. Boss fight can be tricky, but it's just a matter of getting used to it. Same goes for controls. OST is not exactly annoying, but after a while you'll want to play without it because it's composed of short loops. I have got past the first boss, and I can confirm that the crash on 2-2 is triggered by a flying robot. This can be bypassed by anticipating the robot's position and shooting it as soon as in enters the screen, although it also may randomly pass by without crashing the game just playing it over and over. Enemies are also 6-directional on their attacks. This may be tricky. You can buy upgrades, but I figured how to open the upgrade menu but le ♥♥♥♥'s expensive so I didn't get jackshit yet. You can also pick up weapons. Graphics are nice. (thank you based Unreal Engine) You can't backtrack most of the time (camera only moves left, so if you miss an item you dun goofed). There are a few exceptions to this, mainly in levels that have two paths.  10/10 it goes beyond bad if you look further into it, but it's so bad that it's somehow good. I actually like it, and intend to finish it. Then again, maybe I am just the rare weird individual who plays awful things and likes it. Perhaps I'm an alien.  Either way, I suggest that you try it out anyways, but only if you get it for free so you can avoid potential pain.",
            "review_score": "1"
        },
        {
            "review_text": "Crappy ♥♥♥ game I got for free. Tries to be like Contra but it's so not like Contra.  Wait it's 10 bucks? Shiiiet ♥♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "I am a huge fan of Contra. While this game was clearly based on it, it has nothing on it.  Watch a video of the game instead of just checking the screenshots, because they wasted the engine on this game. There is no reason not to animate the models aiming in a pseudo 3D environment just to imitate 8-bit games.  The game mechanics are incosistent: Sometimes you can go left, but usually you can not. The basic weapon is horrible and you have to grind a lot by replaying the same dull maps over and over again to upgrade it.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok, let's pro / con this thing:  Pro: Full controller support. Pro: Addictive gameplay. Pro: Upgradable weapons. Pro: Classic platformer style  Con: Painstakingly difficult. Con: Keyboard controls are crap Con: Terrible soundtrack Con: Bad animations Con: No plot Con: Definitely not worth £7 / $10  So overall, I wouldn't recommend spending your cash on this shipwreck.",
            "review_score": "-1"
        },
        {
            "review_text": "Platformer, that doesn't do itself justice. Although using the Unreal Engine, it is fluid and responsive.  The controls are not very intuitive, and not easily grasped.  Not a fan of Drum &amp; Bass, maybe a more rock or metal type genre music would be better suited, but that is my preference.  You die too easily, no health bar.  Jumps are very awkward to do correctly, and get frantic when trying to shoot while jumping platform to platform, making you hit incorrect keys.  Weapons and upgrades are lost when you die.  The concept of this game is great, Egyptian Gods against what seems to Predator from Aliens vs Predator, mixed with run of the mill run and jump shooting platformer.  Want a good story, look elsewhere, this is purely to kill, and destroy your unrelenting amounts of enemies with few choice of weapons and powerups.  Scoring: Graphics: 5/10 Story: 3/10 Playability: 3/10  Total score of 3.6/10",
            "review_score": "-1"
        },
        {
            "review_text": "[2/10] Contra Ripoff as bad as it can be.  9 minutes of gameplay. 9 minutes. That what it took me to start writing this review. This game is pure shaïte. And I give it a 2/10 rating because it was given away to me.  Controls are meh. Contra on the NES had 10.000 better controls and the gamepad had only 4 directions and 2 buttons. Graphics are meh. Millenium Soldier Expendable was almost as bad, and it's 17 years old. Music is meh. Even if I wasn't a musician, I could say that the tunes are uninspired and generic. Storyline is inexistant. Really, I don't think there is even one. Level design is the worst. Even a Lemming could not get lost in those. Chara design is... Why the hell am I playing an egyptian cyber-god? Is it some kind of hommage to Enki Bilal's Nikopol series? Or just a bad choice like the rest of the game?  Listen to all the bad reviews there is on Steam, and don't be as masochist as I. Don't waste your time on this, even if it's given to you with money! And if you still wanna try it, take my advice and wear a XXL super absorbing diaper, cause the cr4p's gonna hit the fan real quick.  Post Scrotum: I forgot... The game crashes on some levels due to a robot appearing in the upright corner of the screen. The only mean to prevent it is to shoot that corner at the exact second it appears. It was never corrected.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is chaos!! X_X",
            "review_score": "1"
        },
        {
            "review_text": "One of the realy worst games i ever played, not fun at like at all! ♥♥♥♥ this game 1\\10",
            "review_score": "-1"
        },
        {
            "review_text": "This game is ♥♥♥♥ for 10$!!! i want a refund!!!! ",
            "review_score": "-1"
        },
        {
            "review_text": "Yeah, I thought the videos looked like a decent contra-esque game. Not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "It might not be a gam e to spend countless hours on, but it's interesting. It depends on the price you get it, I had it for free so can't complain!",
            "review_score": "1"
        },
        {
            "review_text": "✰✰✰",
            "review_score": "1"
        },
        {
            "review_text": "just kidding this game is so bad i downloaded it over again just to be able to warn the world about this game. terrable....",
            "review_score": "1"
        },
        {
            "review_text": "Eeeeeeeeeeeeehhhhhhhhhhhhhhh.....  Whelp, the game lagged quite a bit when there was only like 2 or 3 bullets, and the controls felt very distant and clunky. On top of that, jumping through platforms is glitched, causing me to jump out of my control and costing several deaths. It got pretty frustrating really quickly despite really wanting to like the game and it felt like it took a lot of effort and stress to get through the first level. It's not even a factor of difficulty, I'm a longtime fan of the Contra series and have 1CCed a few run 'n gun games, but the lousy control and framerate issues alone were bad enough for me to near instantly dislike this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Just adding to the sea of downvotes this game already has. If you somehow need a thousandth person to tell you not to attempt to play this game then listen up. This feels like one of those flash games your friends made back in highschool and you all high fived eachother and laughed at how terrible it was.",
            "review_score": "-1"
        },
        {
            "review_text": "Contra-style game with just better graphic, not worth your time.   Read other comments for gameplays.",
            "review_score": "-1"
        },
        {
            "review_text": "Broken game, achievements don't work, story is awful, if it could be called a story. Devs stayed for 1 week after release promising to fix everything but then vanished forever. It's more like failed programing class project than a game which could have a price tag.",
            "review_score": "-1"
        },
        {
            "review_text": "There's a reason people take the time to learn how to use Unreal engine correctly and I only had to spend 12 minutes to see that the people who made this did not. Sound design is pretty bad, music is uninspiring garbage, level design is weak and bland with the same background of crappy spaceship machinery. You might expect good or at least decent graphics in an Unreal game but this is not the case. The graphics are blurry and rather bleak. Controls are weak need a lot of work as well as the AI. I can see where they were going with this make it a possible Contra like game and it's fine if it's difficult but this is nearly unplayable as it was most likely a quick way to earn cash on a terrible game. 2/10 Try harder next time and thank god I got this for free",
            "review_score": "-1"
        },
        {
            "review_text": "Pros:  -Nice looking start up screen and ui  Cons:  -Horrible level designs  -Why is Anubis shooting aliens in space? -Horrible controls, this game really needs controller support to be somewhat manageable to play -Generic boss fights -Pick-ups are placed in bizarre and unreachable places  ",
            "review_score": "-1"
        },
        {
            "review_text": "This game, THIS GAME is so bad, that Aliens: Colonial Marines and Ride to Hell: Retribution are fun. If it's possible, I would rate it -1/100 This GAME should burn in HELL! This GAME is not recommendable at all. If you want to play a really, really bad game, I am totally recommending you to play this crapload of game.",
            "review_score": "-1"
        },
        {
            "review_text": "What they say about controls is true. Even with a controller the controls are clumsy. It crashed and I uninstalled. I wouldn't recommended even if free (my case).",
            "review_score": "-1"
        },
        {
            "review_text": "It would be great... if this was 2005 or something",
            "review_score": "-1"
        },
        {
            "review_text": "No,no,no,no,no....NO! I can't believe this!  You have nice graphics. You have nice music. You have a game that reminds of legendary Contra. You even have a cool dude that looks like god Anubis with guns! And you have co-op option!  And you completely ruin this with terribly clumsy controls and bugs! ",
            "review_score": "-1"
        },
        {
            "review_text": "Game with broken achievements. Don't waste your time, money and ach stats",
            "review_score": "-1"
        },
        {
            "review_text": "First off this is the most played game i have EVER played in my library! I cream when the start up commences. If you dont but this you will never get laid! I was lucky enough at a young age on 45 in a  {LINK REMOVED}  ♥♥♥.com  random key package. The ♥♥♥♥♥ will line up TRUST ME!",
            "review_score": "1"
        },
        {
            "review_text": "Not so good a game. Controls aren't sticky enough to make it good, you kinda float with the jumps and shots and there are times where you feel cheated because of the controls. There are a few bugs that you can reproduce without isssue, you'll be playing and wonder why the game crashes for no reason. After a google search you'll see others are having the same issue.   Could be better if varied bad guys existed instead of just a handful, upgrades suck and the way to upgrade sucks and the game is just boring.",
            "review_score": "-1"
        }
    ]
}