{
    "app_id": 287200,
    "name": "Wildlife Park 3",
    "release_date": "2014-05-12",
    "developer": [
        "b-alive gmbh"
    ],
    "publisher": [
        "b-alive gmbh"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Strategy",
        "Casual"
    ],
    "achievements": 41,
    "positive_ratings": 192,
    "negative_ratings": 178,
    "price": 6.99,
    "description": "Do you have what it takes to be a zoo tycoon? You are responsible for your very own and unique zoo. Choose from numerous types of enclosures, park buildings and plants to design an environment appropriate to each species. Take home a part of wilderness with Wildlife Park 3!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/287200/header.jpg?t=1549964123",
    "minimum_requirements": "OS: Windows 10/8/7 Processor: 3 GHz Intel Pentium® D, AMD Athlon™64 3000+ Memory: 1 GB RAM Graphics: NVIDIA GeForce 8600 GT, ATI Radeon X1800 or better (min. 256 MB Video- RAM, DirectX®9c, Shadermodel 2.0) DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 10/8/7 Processor: Dualcore CPU (Intel E4300, AMD Athlon™ X2 3800+) Memory: 2 GB RAM Graphics: NVIDIA GeForce 8800 GTX, ATI Radeon 3870 or better DirectX: Version 9.0c Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "I've played this game for a few hours and ultimately I've decided that it's just a bad game. The limited animal selection is boring, the campaignes are tedious, and the park leveling system is incredibly stressful.   The interface is also incredibly complicated and awkward to use. The music is monotonous and the voice acting incredibly tacky.  If you want a time decently fun time waster, I'd say you could go for this game. Definitely only get this game if it's on sale, though. I got it for around $3 and I'm glad I didn't spend any more. It's not worth $10.",
            "review_score": "-1"
        },
        {
            "review_text": "Wildlife Park 3 is a fantastic continuation of the series, I will sum up the pros and cons for readers that want to skim through it and quickly decide on purchasing.   The game has a huge selection of different animals with their own needs and enclosure requirements, The graphics overall are pretty good for a game from 2011, Ground, building and misc textures are of a high quality and the shadowing effects look great but the graphics truly shine on the animals themselves,   You can see the fur on each animal, not just as a texture but as a realistic effect, visitors and staff have acceptable graphics overall, but some of the textures for them could be a little sharper.   The animations for the animals are another fantastic aspect of this game, they truly act and sound like their real life counter parts. The campaign has voice acting which isn't the best but is done to a reasonable standard.   I find the UI to be hard to see since a lot of the icons blend into the button but that could be my gamma settings. I highly recommend this game for fans of Sim games, like Zoo Tycoon and, of course, the older WildLife Parks games.  Pro  * Large variety of animals * Good Graphics * Large assortment of enclosure items and customization * Voice acting of acceptable quality * High-quality sound effects and animal noises * Good amount of visitor attractions * Fun Campaign * Helpful tutorial  Cons * Hard to see UI ( might just be me however) * Could have better character textures * Small learning curve (for some but not many)",
            "review_score": "1"
        },
        {
            "review_text": "I really, really wanted to like this game. I loved Wildlife Park 2, but I think I will stick to number two. Everything was so clunky and drab, I just couldn't get into it. Zoo tycoon games are great, and I'd love to see more of them! But this one just doesn't hit the mark. It doesn't feel polished or complete, and feels like a slight downgrade from the last game in a lot of ways.  I did like the value score and aging of different animals, and how you could select better quality animals based on age and health- a cool addition. I did also like some of the other added features, but I just wish I could have fully enjoyed it.",
            "review_score": "-1"
        },
        {
            "review_text": "Enjoyed the game, but honestly, the UI feels cluttered, and the controls tend to feel clunky.   Other than that, it's a great game--for the price (bought it on 15% sale).   Don't buy assuming it'll play like Zoo Tycoon, or Zoo Tycoon 2. The only thing in common both titles have is that they're both zoo management simulators.",
            "review_score": "1"
        },
        {
            "review_text": "It's good but wait for Wildlife Park 2 to be released on Steam. BTW Valve did Deep Silver get back to you yet on their personally shameful project. Seriously its a Hidden Gem and should be publicized more not thrown away.",
            "review_score": "1"
        },
        {
            "review_text": "Only game my mom wants to play with me, yay.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game for free in a giveaway but it is terrible. The gameplay sucks, the graphic sucks , even a 6-year-old will have nightmare playing this empty game. I bet the devs spend more time in drawing the loading screen than the game itself.",
            "review_score": "-1"
        },
        {
            "review_text": "it is not for mac! please make it for mac",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of Money!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is literally SO TERRIBLE that I downloaded Unity today and am learning how to make a 3D game in hopes of making something better. Don't buy it. It isn't even worth $1.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried playing the game but the UI is really confusing, and even with a somewhat descriptive tutorial, it gives names to buttons with pictures. While I am a big fan of the Zoo Tycoon series, the UI of this game is a huge bother for me, and I just can't continue because the buttons are all... well I don't know what the campaign is even asking me to press.",
            "review_score": "-1"
        },
        {
            "review_text": "Wildlife Park 3 is a great game for animal lovers, the missions arn't too hard and the freeplay lets you do what ever you want with however much money you want. The game could use more animals or some expansions like in Wildlife Park 2. The graphics and animations are pretty good while it can be quite weird seeing the people talk without moving their mouths. Overall a pretty good game 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Good for a while, then after your park gets half full, the framrate drops dramatically to ~2fps. I can play skyrim smoothly on 'ultra' so something is not coded well in this. It is effectively unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to give this game the benefit of the doubt. I loved the second game, and its DLC despite its own problems. However, I found this one absolutely unplayable. No matter what I did, I could not get this game to do more than chug at 10 fps when I moved the camera. I'm often rather fond of clunky UI, but this one had the distinct air of someone not caring about the actual game. The animals looked nice, I liked where they were going with it, but it's so poorly optimised that even on the lowest of the low settings, my laptop, which can easily run Skyrim, struggles, even with a frame limiter on to try to give it some easier time of it. I hate to give this game a bad review, but if you have Windows 10, good luck, mate, because it wouldn't work for me. The purple glitch at the beginning of the game should have given me a hint of the times to come, when it nearly refused to change resolution into something my computer agreed with, but I tried it, and I wanted to love it... but I just couldn't. I nearly got motion sickness just trying to move the camera.",
            "review_score": "-1"
        }
    ]
}