{
    "app_id": 287260,
    "name": "Toybox Turbos",
    "release_date": "2014-11-11",
    "developer": [
        "Codemasters"
    ],
    "publisher": [
        "Codemasters"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "VR Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Racing",
        "Multiplayer",
        "Local Multiplayer"
    ],
    "achievements": 16,
    "positive_ratings": 889,
    "negative_ratings": 160,
    "price": 11.99,
    "description": "Codemasters reboots the classic table top racing experience in Toybox Turbos! Collect &amp; customise 35 vehicles, take on 18 crazy tracks &amp; send your rivals into a spin with awesome power-ups, including mines, machine guns &amp; giant car-mounted hammers!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/287260/header.jpg?t=1447360862",
    "minimum_requirements": "OS: Windows Vista, Windows 7 or Windows 8 Processor: Intel Core 2 Duo @ 2.4Ghz or AMD Athlon X2 5400+ Memory: 2 GB RAM Graphics: AMD HD2600 or NVIDIA Geforce 8600 Network: Broadband Internet connection Storage: 1 GB available space Sound Card: DirectX Compatible soundcard",
    "recommended_requirements": "OS: Windows Vista 64 bit, Windows 7 64 bit or Windows 8 64 bit Processor: AMD Phenom or Intel Core i3 Memory: 4 GB RAM Graphics: AMD HD5000 Series or Nvidia GTX400 Series Network: Broadband Internet connection Storage: 1 GB available space Sound Card: Direct X compatible soundcard",
    "reviews": [
        {
            "review_text": "TL;DR Surprisingly solid, enjoyable game. Graphics are spot on, handling is just right, difficulty has challenge without being too hard. Features 4-player local/online multiplayer with plenty of options and tracks. Also top-down retro view for fans of the old Micro Machines games. Would recommend to people who like fun!  I've spent the past year looking for modern-day Micro Machines-alikes but nothing comes close to the originals, I found myself replaying those instead. When I saw that CodeMasters were making a new game (albeit with the license), I was incredibly excited but also very weary. Turns out though, that it's a fantastic little game.  The difficulty is not overboard like the old ones tended to be but still challenging enough, I often found myself tantilisingly close to a higher place on the online leaderboards too, which added some extra life and replayability to the game.  I realised all too late that you were able to change the camera view to a retro-topdown one but I was surprised actually by how much the new camera view suited the game, I'm usually strictly retro-isometric but I'd happily play this game as-is!  Altogether, this is a well put together title which has clearly had some love lavished upon it, especially considering the low pricepoint. You aren't paying the triple-A money of the original games but you certainly get the quality. The graphics are just right, the handling is great and there are several noticably nice touches in the track design.  I've yet to try out the multiplayer but that is usually where Micro Machines games shone so I have no real worries there.",
            "review_score": "1"
        },
        {
            "review_text": " A fantastic game for fans of old games such as Micro Machines or Micro Maniacs",
            "review_score": "1"
        },
        {
            "review_text": "Great game, my 7 y.o. is getting the hang of it. We spent a good couple hours laughing away playing it on a rainy day. Very worth a few dollars.",
            "review_score": "1"
        },
        {
            "review_text": "Toybox Turbos is a game where you play with toy cars on various location such as kitchen sinks, school tables, toy train sets and more. The game provides 35 cars and 18 tracks and there are various game modes but they are for single player only. For some reason multiplayer has Elimination mode for both local and online multiplayer.   The game has 7 tiers of cars, the first tiers are a bunch of taxi, london cab and buses while the second tier are a set of off road vehicle which provide SUV, moon buggy and even a monster truck. The cars gets faster every tier, the final tier of cars are race cars which provides a classic F1 car, dragster, sportscar (which looks exactly like a low poly GRID 1 and GRID Autosport drift Mazda RX7) and a hot hatchback.   The cars feels very floaty and all of them drive similarly, they are a bunch of Micro Machine scale toy.  In the single player mode, there a total of 7 cup and each cup has 5 race. Each cup are restricted to specific tiers of vehicle and specific set of races. There are 6 type of game modes here, Classic Racing, Overtake (like the ones in GRID 2), Escape, Elimination, Time Trial and Countdown.   Classic Racing also includes weapons, weapons can be used to overcome your opponent. There are a few weapons in the game such as hammers, EMP, rifle, turbo boost, mine and magnets. Magnets could pull you closer to your opponent cars, hammers lets you wreck your opponent cars and EMP could slow down the cars around you.   Overtake mode requires the player to overtake a bunch of cars around the track which acts like traffic. The player wins by overtaking an amount of cars set by the game.   Escape mode has a wave of water or force field like thing chasing behind you, the player requires to drive the furthest distance possible before your car being covered the water or force field.  Elimination mode is also the boss race in the single player mode, weapons are provided in this game mode as well. This mode plays a bit like NFS Underground 2 outrun mode, the player requires to drive as fast as possible until your opponent car is not seen on the screen and the player loses when the car is not seen in the screen, got destroyed by weapons or flew off the track. A score is given when the player wins and 1 score taken away when you lose, the player win this race by filling up the score bar. If the race takes too long to end with constant plus and minus 1 score from you and the opponent, the game will starts putting mines around the track and losing will no longer deduct a score but every win still adds 1 score.   Time Trial mode ask the player to clock the fastest time on the track but the tracks has mines to disrupt your racing line.   Countdown mode is similar to Time Trial mode, the tracks has mines placed around it as well. The difference is the player requires to pick up 'clocks' to add time to their timer, the player lose when the timer ran out of time and wins by reaching the finish line with most time left.   The single player AI starts off to be very easy and they dont seem to use the weapons they pick up at all but it gets better and faster as you progress through the cups.   One of the problem for the single player is the lack of proper quick race mode, you cant pick a set of cars and track combination you wanted to do a race or any other mode. The special game modes are restricted to the 'Single Player' section which act as the career but the local multiplayer can be used as a 'quick race' mode. You could start a local lobby yourself and the game will fill the opponent with AI, you could chose the tier of cars you and tracks you wanted to race but the multiplayer is resticted to Elimination mode only. The hard AI in the game is pretty challenging and could provide a couple more hours of fun.   The game provides both online and local multiplayer up to 4 players, the only game mode for multiplayer is Elimination mode. It plays the same way like in the single player mode but instead of having 1v1 you are having a 4 player elimination race.   I'll highly recommend this game if it goes on sale for around $10, the game length is really short. It took me 4 hours to finish the game with all stars and all achievement (the achievement are super easy though). For the full price Codemasters is asking for now, it is still pretty good if you are a fan of top down racer, likes the toy cars feel with bright colours and casual racing.",
            "review_score": "1"
        },
        {
            "review_text": "Remember Micro Machines on NES? Well I do. It's one of my all time favorites. I've been saying for years that it needs to be remade. Well guess what? This is it! Made by the same company that made the cult hit for the NES, Toybox Turbos is everything you loved about the old classic made new. Lots of cool little cars to collect, fun tracks, and the same tight gameplay bring back that old school fun without breaking out the NES. Fans of the NES classic or fans of racers in general are gonna find a lot to love about this. 14.99 did seem a wee bit on the pricey side to me but I still paid full price and don't regret it at all. Sales are always around the corner so if you're unsure, certainly pick this up then!",
            "review_score": "1"
        },
        {
            "review_text": "I think this is great, the singleplayer campaign may seem too easy at first, but believe me it gets difficult later. I had some fun playing this, really reminded me of an older game called  'Mashed' . Multiplayer was really fun, but sadly I only got to play it once since not many exactly still play this. A fun little arcade race game, recommend to buy it during a sale or in a humble bundle. Also it doesn't require some overly dedicated fan to get all of the achievements, which is personally a plus for me.  This game has a toy Tommy Gun in it. (+0.25) 7.75/10",
            "review_score": "1"
        },
        {
            "review_text": "a true micro machines remake! with multiplayer!",
            "review_score": "1"
        },
        {
            "review_text": "Wanted to try a level before playing with friends, beat half the game... Also, made me nostalgic for having a marble track again! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Best use of oculus rift in a game seen so far, absolutely love it.  Well done Codemasters",
            "review_score": "1"
        },
        {
            "review_text": "I can't think of anything I didn't like about this game. Fantastic 4 player local multiplayer, great graphics, loads of charm, even the music is... appropriate. This really is a finely polished product. Maybe there could be a few more categories of vehicle (no boats for example) but what's there will give loads of play time. Me and 3 friends had a great time with this. Recommended.   And I didn't mention Micro Machines once!",
            "review_score": "1"
        },
        {
            "review_text": "Good little game with nice and bright decent graphics, similar style to the old school micro machines, but with some other fun modes to play aswell. Easy to pick up and play.",
            "review_score": "1"
        },
        {
            "review_text": "If pure, unadulterated joy sounds like something you'd be interested in, you might be interested in Toybox Turbos.  For those inexplicably unfamiliar with the old Micromachines games, let me explain how this works:  You drive a car. A tiny car. You race other tiny cars around tiny tracks made of household objects like dishes in the kitchen sink and books with witty titles. You collect tiny parcels that give you silly powerups such as an EMP device and, of course, the timeless mounted instakill mallet.  And it's a racing game, so the objective is to get to the finish line first after 3 laps, right? Well, no. Not necessarily. The single-player campaign has various game modes: There's the (relatively) dull  go-round-3-times-win-congrats mode , the rather tense  OMG-flee-from-scary-blue-space-stuff  mode, the satisfying  make-traffic-explode-by-overtaking  mode, and others.  And then there's  THE  mode. The way it's meant to be played: The mode where the objective is to get your opponent off the screen by any devious means necessary - by strategically nudging them off the bridge of rulers, by tactically falling back before opening fire with a tiny tommy gun, or just by being boring and going fast.  And on top of the solid mechanics, there are loads of lovely little details:      Plenty of maps with creative designs and hidden shortcuts.     The little joy of unlocking the collectable cars by taking them out of their packages.     Local and online multiplayer.    The 'classic' camera mode.    A host of vehicles - hovercraft, bulldozers, black cabs, tanks - each with customisable colour schemes and their own horn effect. (Yes, they even added a 'honk horn' button. What does it do? Nothing, if you don't count putting a grin on your face.)    A demo so you don't even need to read this review. I don't know why you'd still be reading. Just go and play a couple of rounds for free.   I don't generally enjoy racing games. I'm not a nostalgic person. I don't usually grin like a 5-year-old on Christmas morning... except when I play Toybox Turbos.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little game - now with Oculus support - its brilliant!",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet. Kind of like what's in my pants.",
            "review_score": "1"
        },
        {
            "review_text": "i won a game best game 10/10 better than just cause 1 and 2 also 3 put together god DAMN",
            "review_score": "1"
        },
        {
            "review_text": "Toybox Turbos is a tabletop racing game that reminds me of Micro Machines both in presentation and in difficulty. No surprise considering both games were made by Codemasters. In fact, Toybox Turbos is Micro Machines in all but name.  And that's a good thing. Micro Machines was a game begging to be brought into the 21st Century, and it looks absolutely fantastic. So colourful and extremely imaginative in the vehicles you can drive and the locations you can drive on - dump trucks, New York taxis, hovercraft, pickup trucks, London buses and loads more can be driven around breakfast tables, school classrooms, games rooms... The list goes on.  I expected this to be a bit of a breeze, one for the kids perhaps. But as you will see from my 'first look' video below, I was in for a surprise in terms of difficulty:          YouTube™ Video:  Toybox Turbos - First Look - TABLETOP RACING AWESOMENESS!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "[懷舊經典game] 一隻重製以前紅白機同超任既經典作 micromachine. 操作簡單, 容易全成就, 有micromachine既味道. 有local 同 online multiplayer, 4個fd 一齊玩就最啱. 畫質當然係靚咗同埋單機加咗好多模式嚟增加耐玩性.  可惜, 佢無咗我本人覺得micromachine 最好玩既元素.  1. 無咗組隊模式. 以前有種打法就係一個隊友去拖死兩個敵人, 等另一個隊友去沖.  2. 地圖唔夠大, 唔夠長. micromachine 有d 地圖係長到你一直都係行直路, 個背景一直都係一樣, 你唔知道幾時會有個急彎. 背得地圖者會有優勢. 帶頭果個可以扮前面要轉彎, 等其他人跟你跌死.   3. 冇咗飛機, 艇同坦克玩. (呢隻game 都有艇同坦克, 但係都係當普通車咁, 唔係行水, 無得發炮)  4. 冇咗bugs, 以前有時就走出地圖者反而獲得勝利, 完全唔知點解. 但係係一種趣味嚟. （呢樣冇其實好正常)  同埋呢隻game 唔知點解multiplayer 得一種模式, 無得揀其他模式. 連最普通既classic racing mode 都無, 我覺得有d 奇怪.  如果而家有fd 嚟搵我打機,要我揀玩micromachine 定 Toybox Turbos, 我依然會揀micromachine. 因為多人模式趣味性高好多.  但係我都會推薦呢隻game 比steam 玩家, 因為佢有懷舊既味道. 同差唔多類型既steam game 相比 ( Super Toy Cars, BlazeRush ) , Toybox Turbos 高出幾班. 上網同3個fd 玩依然有趣.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this on sale before I got my Oculus Rift DK2 and later noticed that the Oculus Group here on Steam said it was compatible. This type of game is normally not my thing but I booted it up for the rift anyway. I have great results on Win 7 x64 and the 6,0 runtime. I really enjoy this in VR and find myself coming back to it again aand again. Worth full price for the Rift support alone.",
            "review_score": "1"
        },
        {
            "review_text": "  Game keeps crashing..... help please?",
            "review_score": "1"
        },
        {
            "review_text": "Basically a remaster of Micro Machines  Nuff said",
            "review_score": "1"
        },
        {
            "review_text": "Basically a remaster of Micro Machines  Nuff said",
            "review_score": "1"
        },
        {
            "review_text": "Great game !! If there's one game i would recommend for the rift THERE IT IS !!!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best experience on oculus rift I've seen yet. It feels like I'm really in the room playing with matchbox cars. When a race is done, the view is as iff you're still driving down the track, which causes a little barfiness. But that's something that'll work out in time. The classic view mode view is barfy too because every player steering input changes the view. If the camera followed the track, that probably wouldn't happen. The rest of the game is nausea-free though.",
            "review_score": "1"
        },
        {
            "review_text": "It's a neat little game for a low price and evokes memories of some older game I ♥♥♥♥ing can't remember. Anyways if you get motion sick easily, don't buy it.  Just be aware that the game is REALLY short and REALLY easy. You can probably beat it in 2-3 hours or less? I'm not sure how much fun and longevity the MP scene has.",
            "review_score": "1"
        },
        {
            "review_text": "Its like Trackmania had sex with Mario Kart and this came out.   Its really funny and endearing while at the same time presents a lot of challenge with very nice physics.",
            "review_score": "1"
        },
        {
            "review_text": "Really good fun mulitplayer game",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but it makes me dizzy and the AI is terrible.",
            "review_score": "1"
        },
        {
            "review_text": "This is awesome. Never had so much in ages.",
            "review_score": "1"
        },
        {
            "review_text": "Very inexpensive cheap fun game to play wiht friends. Online play pretty fun just wish they had battle race as well. Overall its a great game to pass the time",
            "review_score": "1"
        },
        {
            "review_text": "Best racing gace! Awesome with controller. Recommended for anyone!",
            "review_score": "1"
        },
        {
            "review_text": "Adorable and fun. Guaranteed to make you smile :)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome fun! If you are like me, an older chap, remembering the old Micro Machines games on the Amiga and consoles, then this is basically that but updated to modern standards. Cartoonish graphics, fluid and with tight controls. Not a deep experience, but very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Very inexpensive cheap fun game to play wiht friends. Online play pretty fun just wish they had battle race as well. Overall its a great game to pass the time",
            "review_score": "1"
        },
        {
            "review_text": "all of the fun of the app none of the microtransaction ♥♥♥♥♥♥♥t of Chillingo!",
            "review_score": "1"
        },
        {
            "review_text": "  A fun little racing game",
            "review_score": "1"
        },
        {
            "review_text": "awful game, awful handling, ridiculous AI, pot luck whether you actually win the race. It takes forever to respawn and sometime it respawns you facing the wrong way. I bought it because it looked reminiscent of MicroMachines it is far from it. The power ups are garbage. The online is absolutely dead. Comemasters should stop wasting time on junk like this and get a decent game out.",
            "review_score": "-1"
        },
        {
            "review_text": "This was a decent-enough of a game for me to play until completion, getting Gold on all available levels in exactly 3 hours. I can say that I enjoyed my time with it.  Unfortunately, this game is hard to recommend because it's just that: decent and polished. There's nothing particular bad, nor particularly outstanding about it. I'd suggest avoiding this game unless you can get it for stupidly cheap, or are an indiscriminant parent who just wants a living room-friendly game.",
            "review_score": "-1"
        },
        {
            "review_text": "A terrible camera ruins this game, it just doesn't allow you to see enough of the track on either default or the overhead view, shame really as i really used to love the Micro machines games....  I'd give this one a miss.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this game solely for VR purposes. Hasn't been updated since 2014 with oculus sdk 0.4",
            "review_score": "-1"
        },
        {
            "review_text": "It's actually a fun game but nobody plays it online , so I I don't recommend this game unless you play with your friends.",
            "review_score": "-1"
        },
        {
            "review_text": "I could not get it to run it would crash as soon as it began to load and windows would say 'The prgram has encountered a problem and needs to close the program' ive re-installed and shut down my computer even went to the .exe and used windows compatibility and even the compatibility checker said there was something incompatible with it unless its just me or something that is being fixed I would not recomend.",
            "review_score": "-1"
        }
    ]
}