{
    "app_id": 287450,
    "name": "Rise of Nations: Extended Edition",
    "release_date": "2014-06-12",
    "developer": [
        "SkyBox Labs",
        "Big Huge Games"
    ],
    "publisher": [
        "Microsoft Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Classic"
    ],
    "achievements": 38,
    "positive_ratings": 5125,
    "negative_ratings": 473,
    "price": 14.99,
    "description": "Rise of Nations is back! Play the updated classic with full Steamworks integration and enhanced features!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/287450/header.jpg?t=1523572459",
    "minimum_requirements": "OS: Windows Vista, 7, 8.1+ Processor: 1.6 Memory: 1 GB RAM Graphics: Direct X 10+ Capable GPU DirectX: Version 10 Storage: 3 GB available space Sound Card: Direct X Compatible Sound Card Additional Notes: GPU at least (Integrated HD 3000, 8600GT, etc)",
    "recommended_requirements": "OS: Windows 7, 8.1+ Processor: 2.6 Ghz Memory: 4 GB RAM Graphics: Direct X 11+ DirectX: Version 11 Storage: 5 GB available space Additional Notes: GeForce 9800GTX, Radeon 4850+",
    "reviews": [
        {
            "review_text": "This is my favorite game of all-time. This was one of the first games that I bought back in 2004 (Gold Edition) and still played it before the release of the Extended Edition. Every RTS lover should play this game. ★★★★★",
            "review_score": "1"
        },
        {
            "review_text": "Me and my mate thought it would be smart to build our docks around the back of our islnds, because the AI, like the Age of Empires II AI, wouldn't be smart enough to look back there.  They were swftly demolished.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "A solid, enjoyable, and accessible RTS with equal playability for combat and econ/tech.  RON is a multifaceted real-time game with well-implemented resource gathering and tech dimensions, in addition to the industry-standard combat elements. It's customizable enough so that a newcomer or veteran who would rather not worry about tech, econ, or combat can disable those elements in the starting menus.  There are six economic resources in the game (three of which appear after appropriate research). Most combat units, buildings, tech, and upgrades cost one or two types of resources. They also tend to increase in cost the more of the same unit/building you have already built, which encourages players to diversify their buildings and units rather than just rebuild one type over and over.  Combat units usually adhere to a rock/paper/scissors balance mechanic, although at later ages there are a decent range of specialized units that accomplish unique functions in warfare. Controlling a battle group is relatively intuitive - command buttons on the console also show shortcuts for the more-familiar player, and extra modifiers such as facing, General craft powers, and terrain also allow modest benefits for the detail-oriented player.  Each nation has its own special powers, which lead to interesting matchups (although at higher levels of play, certain nation powers mandate a narrower choice of strategy than others).  Those already experienced with RTSes can expect to jump right in and get playing against the AI competitively, and then jump online to test their skills against humans. This game may be a steeper learning curve for newcomers to the RTS genre because of its breadth of econ, tech, and military.  Players who like modding their games will also find this game rewarding and versatile, including the ability to mod entire campaigns and to create new units in the game's .xml files.  An excellent balance of accessibility and complexity. My favorite RTS game.",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS game ever made! Still don't understand why most people insist on playing Aoe while they have Rise of Nations. Considering the Ron offers better unit control even with full population, doesn't restrict players with medieval age and allows you to make more strategic moves both in economy and military; i have difficulties finding a reasonable explanation for not to choose Ron in this and almost every other RTS comparison. Only con of this game is the lack of players in online otherwise it is highly recommended to everyone who loves playing strategy games!",
            "review_score": "1"
        },
        {
            "review_text": "Rise of Nations is one of the best RTS games of all times and can be recommended. There are no new good RTS games similar to Rise of Nations, that are known to me, since a long time.",
            "review_score": "1"
        },
        {
            "review_text": "I was really happy to see this little guy arrive on Steam after being refurbished. Obviously played it a lot before and I'm happy to see the gaming world finally is setting its eyes on this jewel.  - Amazing different take on RTS; - Great AI; - Even better graphics now; - TONS of civilizations with a couple new ones; - Infinite replayability with a good learning curve; - Good luck trying to beat a moderate+ AI on a conquest objetive large map.",
            "review_score": "1"
        },
        {
            "review_text": "Well then, figured 'hey lets try it out!' well. . . bit more than 3 hours later I wake up out of my trance to find that it's 2am and my homework isn't done. I highly recommend NOT to get this game if you don't like being distracted from everything around you for hours at a time. YOU WILL NOT SIMPLY PLAY FOR A FEW MINUTES!!! Great game for strategy lovers!  I actually first played the game about 6 years ago but haven't had the game in a long time so this was awesome to find it again!",
            "review_score": "1"
        },
        {
            "review_text": "A great game. I really enjoy the amout of content you get From the skirmish battles to the campains. Also being able to set what age you start and stop in is quite intresting. my one thing i wish i saw differently is that this game is alot of battle of attrition. but other then that its a amazing game. not to metion its other Rise of Nations game the Rise of legends gives the best explination to a steam punk world that i have ever seen. Again love this game i recommended it anyone who like strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "Rise of Nations is one of the only RTS games that puts strategy ahead of micromanagement. The design was extremely innovative when the game came out in 2003, and nothing since then has even come close.  It takes the pacing and tactics of games like Age of Empires and Starcraft and combines them with the depth and strategy of games like Civilization. The result is something truly awesome.  There are a lot of different ways to customize games, so each player can set up games to suit his or her style of play.  The competitive play is very rewarding and challenging and really puts an emphasis on strategic decision-making. The balance isn't perfect, but the game has random maps that are different every time so that players are forced to adapt instead of memorizing build orders.  Playing casually is also rewarding and fun. Unlike other multiplayer RTS games that can feel like hard work instead of enjoyable entertainment, Rise of Nations doesn't require constant attention and giving orders all over the map at insane speeds (although you can control your units like that if you want to). It's the ideal RTS for people who don't have the speed, energy, focus, and free time of teenagers.  Most RTS games are a miserable experience unless the matchmaking is perfect and opponents are very close in skill level. Rise of Nations is different. The design of the game and the different modes ensure that fun and exciting games are commonplace instead of being a rare event.  The game has an extensive tech tree and lots of depth, but the learning curve is excellent as it lets you gradually discover what you need to know. There are lots of different civilizations with unique abilities, strengths, and weaknesses. All of this makes the balance less than ideal, but it ensures that the game doesn't get stale or repetitive, even after thousands of hours of play.  Rise of Nations represents the best strategy gameplay in the RTS genre. It's not a perfect game, but it comes closer than anything else. It's entirely possible that we will never see a game quite like this again. If you are a fan of actual strategy in games, you'll want to experience this gem while it still has a player base.",
            "review_score": "1"
        },
        {
            "review_text": "-Build 5-6 cities -My economy and resources increase - Enemy sends troops , I kill them easily - Build most wonders -Reach Information age - Research Missile Protection (Nuke protection) -Send my troops to enemy capital -Beat all of his army - Enemy sends Nukes to himself  -Armageddon reaches zero -Realize that I just lost the game - Punch my monitor and start swearing  10/10 Would buy again !",
            "review_score": "1"
        },
        {
            "review_text": "Very old RTS, but still better than most of the new stuff that is releasing these days. Love it.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game way back then, I remembered the campaign in this game that is so awesome.  Dominating nations and assimilating cities.  It's like civilizations but not turn-based.  I grabbed it on sale to relieve my memories, True the graphics may be outdated (old game) but this is an RTS, graphics should have less of a priority than gameplay.   back then I only have the entire world scenario, and now I have all.  Want to relieve your nostalgia?  Want to a good RTS game?  Try this game! Grab it on sale now to have maximum fun and less wallet gouging!",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me of my tour in Vietnam, ♥♥♥♥ happens out of nowhere and fast.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best strategy games ever made.Oldie but goldie :)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing RTS game. Absolutely one of the best of the genre. If you haven't played this before I do highly recommend it, and unlike AOE, the remastered version is acutally pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "By far one of the most memorable games I have ever played in my lifetime. Don't let the hours fool you; I played this game and the add on from the disk way back when it was originally released.  I really enjoyed playing coop with friends and advancing through the ages while maintaining your tech and resources was the most fun I ever had. Granted this presents rush scenarios but with multiple maps, play styles and Steam Workshop, this game cannot be beat!  Highly recommended from me!",
            "review_score": "1"
        },
        {
            "review_text": "An old classic but still awesome",
            "review_score": "1"
        },
        {
            "review_text": "Definently one of the best strategy games I have ever played. A wonderful mix of building your own civilization and army that makes it stand out over the competition.",
            "review_score": "1"
        },
        {
            "review_text": "Alright, as far as I know I can keep this review pretty short.  This is just Rise of Nations the Original with the expansion 'Thrones and Patriots'. They didn't change any gameplay formulas, nor did they change anything for multiplayer games. Which means you can just as always play through direct connect if you want to; which has always been an important feature of this game in my opinion.  The only thing they actually did change is the resolution setting. You can run this game in High res HD from now on and it looks just as the old thing, just a tad better.  So, if you liked the old Rise of Nations, then you gonna like this version also. It's the old familiar Rise of Nations for modern systems.",
            "review_score": "1"
        },
        {
            "review_text": "The greatest RTS ever. Well, look, honestly, it depends on what you like. If you like the idea of playing an RTS game, but the experience of playing them is stressful and unpleasant because it feels too frantic to be trying to juggle so many plates at once, this is the solution to that problem. The interface is fantastic, it's easy to switch between controlling units and upgrading your economy, there's little to no 'busywork', and you can slow time down to something glacial enough that even elderly gamers like myself can handle it. It's an RTS that's fun for people who generally prefer TBS, in other words. I played an absolute ton of this in single player back in the day and always thought it would be great for multiplayer, but I never got the chance to try it. Now it's going to happen. Can't wait! If you like strategy games of any kind, this one gets my absolute highest recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "Now, this is a story all about how  My life got flipped-turned upside down  And I'd like to take a minute  Just sit right there  I'll tell you how I became the prince of a town called Bel Air   In west Philadelphia born and raised  On the playground was where I spent most of my days  Chillin' out maxin' relaxin' all cool  And all shootin some b-ball outside of the school  When a couple of guys who were up to no good  Started making trouble in my neighborhood  I got in one little fight and my mom got scared  She said 'You're movin' with your auntie and uncle in Bel Air'   I whistled for a cab and when it came near  The license plate said fresh and it had dice in the mirror  If anything I could say that this cab was rare  But I thought 'Nah, forget it' - 'Yo, homes to Bel Air'   I pulled up to the house about 7 or 8  And I yelled to the cabbie 'Yo homes smell ya later'  I looked at my kingdom  I was finally there  To sit on my throne as the Prince of Bel Air   (This Game Is Amazing)",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would marry.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for classic real time strategy at its finest, its right here. Multiple resource management, giant armies, nuclear arms and throwing sticks. Get you some war!",
            "review_score": "1"
        },
        {
            "review_text": "Just as good as I remembered it. Very fun and accessible yet still very deep. Visuals are dated but functional, as is the music. There were a handful of bugs when I first played this edition, but they seem to have been fixed. Definitely a must-buy for any RTS/RTT fan.",
            "review_score": "1"
        },
        {
            "review_text": "an awesome game with age of empire and an empire earth feel but with a unique playstyle.  Pros: resource gathering mechanics are great and fluid with a solid logice to it research tree is well constructed and planned out this includes the age advancements animations still look nice for a reasonably old game graphics are still fresh and the game looks nice despite its age when selecting your army with the drag box it doesn't select civilians ( this is the greatest thing invented ever)  Cons: when playing with bots you will generally have to turn nukes off becuase if they can make them that will and lots of them combat is a bit 'iffy' but its not completely ♥♥♥♥ some of the mechanics need a bit of tweaking.  TL;DR : a good game if you are looking for a game with campaigns similair to the total war series. open gameplay similair to Empire earth series and age of empires",
            "review_score": "1"
        },
        {
            "review_text": "This game has destroyed my life. Ever since I started playing this game 6 years ago I have become a hermit and don't dare trekk outside. During these past 6 years, I lost my job, lost my girlfriend, got my car repoed, couldn't pay my apartment lease, got evicted, and became homeless, all because of this game. I continued to play on my laptop in internet cafes' because I am addicted like heroin. Now that I have newly discovered this version of the game, it is likley that I will continue to become an unproductived member in society.",
            "review_score": "1"
        },
        {
            "review_text": "i remember playing this when i was youny and the game is just as good even beter",
            "review_score": "1"
        },
        {
            "review_text": "The best game of its type by far.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Civilization 5 or those types of games, you'll love this! Civ 5 is my most played game on steam, and I think this game is better. Without expansion packs Civ 5 begins to feel repetitive and simple and even easy. This game is incredible! It makes strategy work! It's not turn based, and it's much more satisfying when you win. Also, a lot of it is real time so you don't spend a lot of the game on pause (although you can) but you feel much more involved in your cities.",
            "review_score": "1"
        },
        {
            "review_text": "This was probably my favourite rts game of all time, and the extended edition is just as awesome as I remember, which is rather unusual. The controls are still fairly intuitive and the game worked perfectly without any need to play with the settings. Still ranks as one of the best.",
            "review_score": "1"
        },
        {
            "review_text": "Its like aoe combined with civ 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. I have always been a fan of Age of Empires, but AoE 3 wasn't really my cup of tea... RoN filled that void!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. A must-play for RTS fans. Age of Empires style",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best RTS games ive ever played",
            "review_score": "1"
        },
        {
            "review_text": "One of my childhood fav RTS game, this was my Gateway to RTS games! it do not have the best of graphis it is fine, but gameplay is AMAZING!  Control ur resorces, citizen and military. work and fight for almost every Country! Choose one, kill the rest!  OPS: Best to play with 2-4 friends  Final Viking Rating : 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "rise of nations is still dope as hell, who'da thunk",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best strategy games you'll ever play. Countless hours of game play in just the skirmishes alone, and thats not even including the Campaigns and the rather robust Scenario editor that can even be coded to make your campaigns if you have a coding experience. The music is amazing and there are so many little details that so many other strategy games could learn from. Awesome Game well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Honeslty Maybe the one of the best RTS of my inventory, Greate scale, and the upgrade system is amazing, BTW NUKES 360 NUBS",
            "review_score": "1"
        },
        {
            "review_text": "A real-time strategy with depth to it. I'm personally a fan of the Age of Empires series, and this is like all three of them plus the modern era, which I like. There are a diversity of possible strategies and upgrade paths, and the large swath of history and geography covered could enable all sorts of interesting custom maps. The only complaint I really have about it is that there isn't a heap of diversity among the available military units; which, to be fair, is to be expected when you have approx 20-30 different nations available. The graphics could be considerably more flashy, but they're okay, and graphics aren't everything about a game anyway - the gameplay makes up for it about thrice over.  There are a few little oddities and glitches, but nothing game-breaking - they all mostly correct themselves.  Then you realise that this game was originally released more than ten years ago. It's aged very well - I honestly didn't notice from the game itself (except maybe the 2D graphics) that it was of any significant age. RTS fans, this is good value right here.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game like age of empires 2 but more eras",
            "review_score": "1"
        },
        {
            "review_text": "Pros +Covers Nearly all of the entire historical Eras (Ancient-Renaissance-Modern) +fight on all fronts Land/Sea/Air +Simple mechanics, easy to learn hard to master +Graphical Update +Steam multiplayer Integration +Challenging AI (Got rekt by the Spain on easy, just like my ancestors)  Cons -I feel some of the nations, and wonders are a bit OP *Cough* China *Cough* Terra Cotta Warriors *Cough* Egypt *Cough* -The sounds FX still play one at a time, Seriously? I thought you would have fixed this in the HD version. -The Nuclear Explosion lost its ring of fire :( I wanted that in HD  Extras =Is it just me, or did the units get bigger than the buildings? =Attrition can get annoying at times, but I understand why it exists =When is Rise Of Legends HD coming out? I miss reking magic with steampunk technology.",
            "review_score": "1"
        },
        {
            "review_text": "I've enjoyed this game for over 10years I've probaly bought it a few times doto loosing Disk's and computers breaking. I've got to say I love this game.  I hope you give this game a shot. Honestly I just wish to see a new version of this game made with New Units, new naitons, and genrally just some new contient. Rise of Nations 2 Just wasn't the same.  It'd be cool to beable to build Walls and Maybe add more single player options.",
            "review_score": "1"
        },
        {
            "review_text": "If you have played the classic version - this one is as good plus Steam matchmaking.  If you haven't - might as well start right now. Imagine Sid Meier's Civilization in real time - it's fun, really :)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best strategy games ever made. Simple as that. Microsoft should go back to creating games like AoE and Rise of Nations or Zoo Tycoon.",
            "review_score": "1"
        },
        {
            "review_text": "This game takes all the best things about Civilization and Age of Empires and combines them into a awesomely fun package.",
            "review_score": "1"
        },
        {
            "review_text": "Fun strategy game that I played when I was younger. Definitely worth the buy if you're looking for a simple strategy game that is easy to learn.",
            "review_score": "1"
        },
        {
            "review_text": "Ah the nostalgia, I remember playing this way back when. Now it's on steam and I love it! Definitley recommended if you love Historical war games and RTS games!",
            "review_score": "1"
        },
        {
            "review_text": "The game that will make you spend so many hours thinking and making plans with yor friends agains the enemy!Is a pure RTS game that deserve every single money!Have a great time playing it!",
            "review_score": "1"
        },
        {
            "review_text": "It's a really fun and balanced RTS that i played a long time ago and now its back and better than ever.",
            "review_score": "1"
        },
        {
            "review_text": "Best strategy game , i can't decide whether this game is better or Generals",
            "review_score": "1"
        },
        {
            "review_text": "If you like the Age of Empires games then you will like Rise of Nations. It captures so much of what Age of Empires does right and presents it on a slightly larger scale. The campaigns are a blast as you get to play various countries vying for control of different regions. You can play a North American campaign, for example, as either the the British, the Americans, the French, or the Native Americans. Each with their own unique requirements for winning. It has other campaigns in Europe, also with various countries requiring unique goals to win, and even a campaign to try and take over the word! I got this game during the Steam sale for around $4.99 and it is worth every cent, but if you like games like AoE then this is worth it even at full price.",
            "review_score": "1"
        },
        {
            "review_text": "If you like oldschool strategy games then this is the game to get. Lots of diffrent nation and all come with their own perks. You can keep improving in this game and find new tricks to surpass your opponent. Awesome music and pretty graphics add only more to the game. The gameplay on first sight is simple but complex if you wana master it.",
            "review_score": "1"
        },
        {
            "review_text": "I might dont have a lot of hours but this game simply is great, even if its old. If you like series like AOE - AOM etc ..... buy this.  It use the same structure and add more unique things like cities and how you should build few of them and connect them to each other, and the allies\\foe ability is good addition, while many ages can keep you hooked for along time in each match.  8\\10 and i recommend it for sure if not at full price surely at sale.",
            "review_score": "1"
        },
        {
            "review_text": "It's just as great as I remember it.  Good tweaks behind the game to make it run. (Those with Dual or more Monitors take heed: playing in full screen and alt-tabbing has pushed the visual game to my other monitor whilst keeping mouse movements shown on the main screen - play windowed to fix)  Actual working Multiplayer that doesn't require a 3rd party application to play - and no horrible patching button bug since updates are done through steam. Twitch intigration is also nice, but I think is rather wasted.  Other than that... nothing new really.  RECOMMENDATIONS: Pick up for a Civ-like RTS that you didn't try before, or for the new MP for veterans of the game.",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favourite RTS games. It is a fun game to play.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a classic RTS experience that surely won't disappoint, you should pick this one up (especially if it's on sale).  This game was my go to as a kid and still is today. It introduced me to the RTS genre, and in my eyes remains superior to many modern titles. The game has great replayability, honestly hasn't gotten old for me yet (and I've had it since 2006).   Additionally, there's a relatively lively modding community for a title that was originally released in 2001.   Still, even though the game’s a classic, it’s not perfect. The in game diplomacy system needs to be reworked. For example, if you start on a team with an AI player and the victory condition is conquest of everybody else, you can expect them to betray you. This will happen especially if you are doing exponentially better than every other player (or if they’re the one who’s doing much better), despite the fact that they win if you’re team wins. Overall, that’s my only big gripe with it.  ",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game; kind of like a larger scale Age of Empires, going into the Modern Era. Now all I need is a Rise of Legends remaster and I'm set!",
            "review_score": "1"
        },
        {
            "review_text": "for sure buying this game will increase benefit in your life. purdchase for great time",
            "review_score": "1"
        },
        {
            "review_text": "A fun strategy game that incorporates ALL historical eras. There is good variation in unit types and civilisations. The game also features really fun late game mechanics such as long distance missiles and future technology.  Overall I highly recomend this game if you enjoy strategy titles. It would be a great one to play with a group of friends over the game's multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RTS games ever.. worth buying with or without a discount. Played it since I'm like 13 and still ♥♥♥♥ing love it.   And about the multiplayer.. it's all good, some people say it has bugs and ♥♥♥♥ but it works better than ever.  11/10..would waste a liftime and never finish my degree again.",
            "review_score": "1"
        },
        {
            "review_text": "Ita the game we know.. Mulitplayer needs fixed",
            "review_score": "1"
        },
        {
            "review_text": "Classic Real Time Strategy game. Has strong replay value with all the scenario settings. Single player campaign can be pretty fun too.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RTS games ever.. worth buying with or without a discount. Played it since I'm like 13 and still ♥♥♥♥ing love it.   And about the multiplayer.. it's all good, some people say it has bugs and ♥♥♥♥ but it works better than ever.  11/10..would waste a liftime and never finish my degree again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is raw ♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Cool game, used to play it a lot of time ago, the multiplayer is laggy and makes me crash sometimes and has to be fixed. The fact that you can advance through ages, gather resources, make your own army and attack the opponents makes it very fun to play. I love the Campaigns.",
            "review_score": "1"
        },
        {
            "review_text": "A classic game. If you haven't played this game before, you should play it now.",
            "review_score": "1"
        },
        {
            "review_text": "Do I recommend this game? Well.  It was the 27th of Febuary 2016, it was saturday... The battle of the warring states (thats the map).  Korea 1 and Mongolia against Korea 2 and China So the game started off slow asf with nobody doing anything for about 10 minutes until the Chinese decided to ♥♥♥♥ and pillage the Mongols because it definitly wasn't the other way round in history.. Anyways Korea 1 which is me decides to turtle whereas my ally Mongolia gets bum rushed by crazy Chinese infidels from Chinaaaaa! While my ally gets destroyed and loses a city which I both cannot remember or pronounce the name off I decide to build a lovely statue in memory of classical era Kim Jong Un or the correct name for it is the Colossus but I wanted it to be the supreme leader therefore it is the supreme leader. After I built this incredible statue, my ally was able to push the blasted Chinese back and was then able to capture their city back. Where is Korea 2 you maybe asking? Well they literally just sat there watching China do all the work whilst they listened to PSI's Gangnam Style because that song is the true meaning of peace within south Korea. Eventually Korea 2 and China decided to double team my ally with an endless wave of firework shooter people things, this made me react with my supreme leader and his army of merry men! We pushed them back again only to have lost half of our army... 'Stupid Mongolians!' The game went on for a good half an hour with constant border disputes which made our match be like the Korean War with both sides at a stalemate. Both teams were both expanding and colonizing islands whilst everything was going on, this allowed us to get more dumplings for our soliders to fight in battle. As both sides progessed to the industrial era, me or Korea 1 and my ally Mongolia were able to take the Chinese city Chengdu which created a foothold for our armies to give grief to the enemies. With the Forbidden City built by Kim Jong Un on one of my islands I was able to research nuclear weapons whilst my ally worked on fortifying the frontline with a giant army with the enemy doing the same thing. Eventually I was able to build several silos which enabled me to Korea the s**t out of everyone because I could press the red button and unleash thermonuclear warfare on the Chinese cities of Shanghi and Beijing along with 2 other warheads blowing up their military facilities which were luckily all clumped together. This finally allowed both me and my ally to push forward and take their cities with no hassle at all. While all this was going on I decided to choose my newly appointed president of north Korea, Kim Jong Un who was also the Despot and King of Korea several hundreds ago to lead this epic advance into the heart of China. With China uttely F****d, Korea 2 was the only one left standing with a useless army and low resources. Eliminating them was quick due to the ultimate ability to utilize nuclear weapons. F**K YOU KOREA 2! YOU SUCK MA KOREAN BALLS!  SO! Would I recommend this game? Yeah I would! Its basically like Age of Empires only in my opinion its more in depth. The research tree is quite big and you are able to go from the stone age I think it is, all the way to the Information age allowing you to experience all styles of play. One age is full of swords, slings, bows, horses, crappy boats and pebble throwing trebuchet whereas the other age allows you to use rifles, bazookas, planes, helicopters, tanks, warships and everybodies personal favourite... Nukes! There's awider rang of unit types but there's a lot sooo if you get the game you can find out what they are! I would definitly advice you to get this game due to the fact that its just generally awesome. 10/10 would Kim Jung Un again.",
            "review_score": "1"
        },
        {
            "review_text": "Microsoft lately has been on a quest to re-release every sucessful game they ever had, updated and modernized. I have mixed feelings about this. Although I love these games and the re-releases are good the prices have been an issue. I don't feel that $30/40 is fair for these games, and they are on the right path by decreasing the price of RoN to $15 pre-release and $20 on release, which would be a fair price for other re-releases such as Age of Mythology and AoE 2. Now to the game itself.  Rise of Nations is one of, if not my favorite RTS game of all time. It blends various game concepts from games such as Civilization and Age of Empires and makes a masterpiece. This game is HEAVILY micro-management centric, where the nation with the greatest economic output, and the player who can manage that economic output efficiently, is going to win. Resources on the map are infinite, however productivity is everything, managing exactly how many woodcutting camps you need to sustain your growth without sacrificing, say mining metal for example. The combat in this game is also well balanced, focusing on a good mix of units rather than unit spam. Unique units are brought to the table just like in Civilization that each Nation has that can give them a slight advantage, however every unit always has a counter or way to be defeated. There's no 'stacks of death' or 'zerg rush' in this game, and that is one reason I also like it. I've been the smaller nation holding off spams of cheap units from bigger nations sucessfully many times. I wish more modern RTS games existed like this....I could only imagine the cores of this game being molded into a modern RTS...it would be grand.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of my Childhood game",
            "review_score": "1"
        },
        {
            "review_text": "Nominations “Test of Time” Award",
            "review_score": "1"
        },
        {
            "review_text": "Oldie but goodie folks, you want a game to play for hours and never get bored? This was it before Civ 5 was. We'll never see quite the like ever again. I cannot praise this game too highly, 5/5 10/10/ 25/25 and 100/100. Now that's not say there weren't flaws. In the interest of being balanced, this game could have had one or two graphics updates. Also, the Sci-Fi/Fantasy Rise of Nations would have been interesting in the package. Definitely, and again I recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Back when I used to play Command and Conquer Generals and Zero Hour... This game will scare you during the upgrades.... I lost a lot of battles because I didnt know how to upgrade the units. With the time the upgrade comes then you will like this game. Trust me. Worth the full price!",
            "review_score": "1"
        },
        {
            "review_text": "The key to victory is to have more nukes than the other guy before he can do anything about it.  Peaceful resolution is for unwashed hippies.",
            "review_score": "1"
        },
        {
            "review_text": "my childhood game, and still awesome game for me",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. The smoother animations are a welcome addition.  The games still go through the ages really fast though! I recommend getting the mod that increases all the research costs/times so that people enjoy smashing big battles in the earlier eras!",
            "review_score": "1"
        },
        {
            "review_text": "OMG MY FAVORITE GAME IS BACK AND IT LOOKS AWESOME!",
            "review_score": "1"
        },
        {
            "review_text": "best game evar IGN 10/10 would buy again ",
            "review_score": "1"
        },
        {
            "review_text": "I can not launch this game on my laptop..",
            "review_score": "1"
        },
        {
            "review_text": "It's a very fun game if you enjoy RTS. I prefer ones like this where the setting is realistic. In my opinion many of the earlier stages of civilization are pointless, but I guess that's why there's different settings and strategies. I prefer to rush to the final stage and crush the enemy with a huge army. One of the frustrating things about the game is that the battles take forever. I started a skirmish against the computer on easy mode and it took about 8 hours to finish the match. One of the frustrating things is the difficulty in holding and advancing your front line when attacking an enemy, especially when crossing a body of water onto their territory. I found the best strategy for me, after obtaining a very high amount of resources and maxing out all research, was to conquer a new area then immediately build an airfield and spam Choppers.. they are great because unlike other aircraft they always hover in the sky and don't seem to count towards your population. You can amass huge numbers of choppers and use them to protect your newly conquered area from attack. I will also then make a Factory for artillery and a barracks at my FOB.. these three things combined are usually enough to push the front line forward and the infantry units are required to conquer territory. All in all, it's a very fun and challenging game, but the curve of challenge is a bit whack because there's a point where it just gets repetittive and it can take a frustratingly huge amount of time to accomplish anything.",
            "review_score": "1"
        },
        {
            "review_text": "An old fav I highly recommend trying it :) .",
            "review_score": "1"
        },
        {
            "review_text": "The best game i ever had",
            "review_score": "1"
        },
        {
            "review_text": "An old fav I highly recommend trying it :) .",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game!!! Before it came out, I was playing Age of Empires III to prepare myself for Rise. But now that it's out it is nothing like age (it is more fun). I totaly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "as addictive as it was :)",
            "review_score": "1"
        },
        {
            "review_text": "No support, the game has been abandoned. Steam is 'Discounted' the game to get sales... It has sound, graphics, and mouse issues.",
            "review_score": "-1"
        },
        {
            "review_text": "I am a big fan of the original game, but i lost my disks. So I was very happy to see it become available on Steam.  Somewhare along the way, the game has been 'improved' from the original version. The 'improvements' are there to make the game more interesting but for me, they just made it unbearably annoying, the game is worthless to me like this.  Perhaps one day my old disks will turn up and then i will be back!",
            "review_score": "-1"
        },
        {
            "review_text": "crashes constantly since Jan 5 patch, now is completely unplayable",
            "review_score": "-1"
        },
        {
            "review_text": "Enemy team invaded overwhelming my base so I nuked everyone forcing us all into armageddon :D",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. It's a lot of fun in single player and especially fun with friends. Love it.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know how, but Skybox ENTIRELY mangled this game. The game crashes every 10-15 minutes, and when you try to verify the interity of the game cache through steam, it spins your harddrive into a fire without getting anything done. It took me all of 10 minutes to download this game, it shouldn't take any longer to verify the integrity of the game cache, much less should it wreak havoc on my brand new hard-drive.   You're better off buying the game through GoG or off of e-bay or some such. If you really want to play mulitplayer of this game, just use Hamachi.",
            "review_score": "-1"
        },
        {
            "review_text": "muh childhood",
            "review_score": "1"
        },
        {
            "review_text": "Rise of Nations They keep on rising Those nations Those rising nations We keep on rising Those nations Those rising nations We keep on rising RISE OF NATIONS RISE OF NATIONS RISE OF NATIONS THINKING ABOUT RISING RISE OF NATIONS RISE OF NATIONS THINKING ABOUT RISING RISING RISE OF NATIONS RISE OF NATIONS THINKING ABOUT RISEING RISE OF NATIONS NATIONS RISING THINKING RISE OH RISING RISE OF NATIONS NATIONS RISING  RIse of Nations They keep on rising Rise of Nations Rise of Naaaations (Rise of Nations of Big Huge Games)  Rise of Nations They keep on rising Those nations Those rising nations We keep on rising Those nations Those rising nations We keep on rising RISE OF NATIONS RISE OF NATIONS RISE OF NATIONS THINKING ABOUT RISING RISE OF NATIONS RISE OF NATIONS THINKING ABOUT RISING RISING RISE OF NATIONS RISE OF NATIONS THINKING ABOUT RISEING RISE OF NATIONS NATIONS RISING THINKING RISE OH RISING RISE OF NATIONS NATIONS RISING  10/10 game should get  ",
            "review_score": "1"
        },
        {
            "review_text": "  Love the game play it with the bois all the time but would love to see a brothel update which would improve poupulation ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RTS games I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "the game where the first person to research nuclear weapons wins  11/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever so buy it.",
            "review_score": "1"
        },
        {
            "review_text": "BEST RTS EVER. I wish they make a legit sequel!",
            "review_score": "1"
        },
        {
            "review_text": "this game is epic",
            "review_score": "1"
        },
        {
            "review_text": "The game is in the exact old glory it was back in 2003 plus Steam integratiobn making it better. The best RTS game out there of the sheer scale and tactics. You will love it and be frustrated, rageing, loving some more you get the point. Easy to learn. Campaign has good story line value to it (all 5 campaigns from Alexander the Great to Cold War) with hours of enjoyment and various difficulty levels making a challenge even for the vetren players.",
            "review_score": "1"
        },
        {
            "review_text": "The Indian Nation's War Elephants were no match for my chemical weapons  10/10 Would nuke again",
            "review_score": "1"
        },
        {
            "review_text": "A little bit buggy, but expected. If you are looking for an online game, expect even more bugs. However, for what it is worth and the old memories, I would still play it and buy it again.",
            "review_score": "1"
        },
        {
            "review_text": "The best RTS that I have ever played. Even though it is an older game it still tops the rest. I think it does everything that AoE didnt do. Try it out, it might be up for the summer sale.",
            "review_score": "1"
        },
        {
            "review_text": "Good. IF you are having an issue with sucky graphics go to settings and go to graphics and change it to borderless (i think) and the graphics improve. I love RTS even though i cant beat moderate",
            "review_score": "1"
        },
        {
            "review_text": "Have played this game for 10 hours, Still don't know how to make groups..   11/10",
            "review_score": "1"
        },
        {
            "review_text": "Greatest soundtrack ever made and if you disagree I'll glass you. Amazing rts, still stands up to modern releases (is better than most new rts games) and the extended edition satisfies the technical issue. They did an amazing job making this a stable, playable version of the original.   Would reccomend out of 10  NOW LET ME BUY THE 4 PACK FOR MY FRIENDS REEEEEEEE",
            "review_score": "1"
        },
        {
            "review_text": "If you like HEY QUICK RUSH ARTIFICIAL INTELLIGENCE SO WE CAN SPAM UNITS and also BUILD THE SPACE PROGRAM SO YOU'RE IMMUNE TO NUKES then this may be the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "  my 10 riflemen and 3 cannons got took out by a knight on a horse. good game",
            "review_score": "1"
        },
        {
            "review_text": "if u want a chance to go frome the start of time thith speers and sords to nukes and tanks this is the game for u. but dont send to many nukes because u will end the match.",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer doesnt work. Do not purchase it unless you wanna play it solo",
            "review_score": "-1"
        },
        {
            "review_text": "this game duz not work if you cod chang that it wod be nice",
            "review_score": "1"
        },
        {
            "review_text": "wow this is the best game ever! my childhood is getting better",
            "review_score": "1"
        },
        {
            "review_text": "game is made by liberals! after you nuke somebody a few times, everybody loses!  it's like this game is made by obama...",
            "review_score": "1"
        },
        {
            "review_text": "Its the gift that keeps on strategically giving",
            "review_score": "1"
        },
        {
            "review_text": "It pains me to not be able to recommend such a spectacular game, as it is by far my favorite RTS, but I bought this game again about an hour ago and it crashes immediately after launching. Do not buy this until it is fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game,highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "When i play Rise of nations i enjoy the Conquer the world Campaign the best. But when i get my race all set up and hit start campaign it just sits there and loads for ever and then the screen turns white and a message pops up that says Rise of nations is not responding. Windows is looking for a solution to the problem close program. But i have never got a solution. Is this fixable and if so please tell me. I want to give this game a good rating but the feature i enjoy doesn't work.",
            "review_score": "-1"
        },
        {
            "review_text": "How to play this game:  1. Refund 2. Install the retail version.",
            "review_score": "-1"
        },
        {
            "review_text": "i played this a long time ago so much that the disk became unplayable, ive been looking for it for a long time. i find it on steam download it ready to play just to have no cursor appear on my screen, what a let down...",
            "review_score": "-1"
        },
        {
            "review_text": "i guess i need a better graphics card? bummer, i want to play it.",
            "review_score": "-1"
        },
        {
            "review_text": "Got this out of nostalgia for 10€ since i liked it years ago. Wouldn't get it again. It's disappointing nowadays. The AI pathfinding is really annoying. For some reason the 'old feeling' is not quite there.. Maybe some of you may like it though, it's not worth more than 5€ imho.",
            "review_score": "-1"
        },
        {
            "review_text": "This game brings everything from the old experience plus improved graphics. Single player suffered minor changes. I noticed that forts and troops do not disappear once an enemy is eliminated. Multiplayer is a bit disappointing. Steam usually works for multiplayer, but Rise of Nations Extended is an exception. Lobby chat was removed, so there is no way of knowing who is in lobby. You cannot communicate or invite players currently looking for games to join or plan teams. Furthermore, You cannot tell how good your opponent is or there is no way of knowing how many games he won/lost. Your rating is given by a large arbitrary number (ELO) that changes only when playing rated games. The few games I played, I had some lag, one synched out and another dropped, in which case, there's no way to load and continue, despite this being shown as one of the options.  In addition, there are minor bugs two of which are really annoying: the invisible window that pops up when you run the game, for which you can only see the buttons; and the sound going away when you use alt-tab to switch to desktop and back.",
            "review_score": "-1"
        },
        {
            "review_text": "What a swiz, its not noticably different from the 10 year old (?) original!",
            "review_score": "-1"
        },
        {
            "review_text": "The game launcher does not work. I click play the launching screen comes up then nothing...",
            "review_score": "-1"
        },
        {
            "review_text": "If you dont own the game maybe is a good buy,however,if you have the original or played the game before,this is a huge desapointment because the graphics are exactly the same and i cant see any improvement whatsoever in the game. I know its a re release but in AOE 2 HD you can see a diference here you cant.",
            "review_score": "-1"
        },
        {
            "review_text": "Mediocre game. Blatant Age of Mythology rip-off, except with worse graphics and a ♥♥♥♥♥ier campaign. In fact, this game's only redeeming qualities come from the aspects that were ripped off of Age of Mythology. 2/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Poor graphics and game play",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most polished, comprehensive, satisfying RTS of all time!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, plays a little like age of empires but more to manage.",
            "review_score": "1"
        },
        {
            "review_text": "This is an extremely fun game. I play it all the time with my friends and alone. It is a really fun RTS, and it will completely knock your standards out of the park.  11/10  PS watch out for missles, they can be a pain",
            "review_score": "1"
        },
        {
            "review_text": "I made the Lakotas drive the Americans out of America, UNITED STATES OF LAKOTA B*TCHEZ!",
            "review_score": "1"
        },
        {
            "review_text": "So far it is a very fun game to loose yourself in!!! My only HUGE pet-pive is that zoom-out Doe's Not Go Out Far ENOUGH OUT, at All for me... If you like Supreame Commander Games, like me, (which is one of the Best Game Series I Have Every Played!!!) you LOVE the ABILITY to ZOOM OUT!!! It Make's You Have a Real Feel of the WHOLE Battlefield... But in RoN all the main stuff has to be done on a TINY LITTLE MINI-MAP in the Middle of the Bottom of the Screen...'That Blocks A-Lot of the VIEW of Your Battle Fields/Battling!!!' and since you Can't Zoom Out Far Enough {No Mods Available Anywhere for RoN to be able to Zoom-Out Farther-Hard Coded} You have to use the Hard to Use Hot-Key System.. (___'Compared'___ to the Sup. Com. Series, which Are/Is Simple.) ~~~~ But Otherwize it's a Great Game... And I Am Glad I Bought It!!! ~~~~",
            "review_score": "1"
        },
        {
            "review_text": "Yes sir! Love that this has finally gotten the download and graphics upgrade treatment here. Next to Warcraft and Starcraft, definitely my favorite RTS game, been playing it for years. $14 on sale, totally worth it to make the jump to this enhanced version.",
            "review_score": "1"
        },
        {
            "review_text": "An all time favorite, few connectivity issues with large groups but to be expected with such an old game.  10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "For some reason, the game just crashes whole computer after intros, and does not work in fullscreen.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is FANTASTIC. I consider it the sequel in spirit to Age of Empires 2. More resources, more ages, more unit controls. This is my favorite RTS of all time. I really hope they make a decent sequel soon.",
            "review_score": "1"
        },
        {
            "review_text": "Is cool ♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "My Favorite RTS game (besides Starcraft). I highly recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Great Classic RTS made available via Steam. Well balanced between resource collection, empire building, and warfare. Playing the conquer the world campaign really gives the game a whole new dimension.",
            "review_score": "1"
        },
        {
            "review_text": "I totally recomend this game. When i was about 7 years old (Currently 13( i played this game all day. but then i broke the disk by not putting it back in its case. But now i got it on steam. Amazing game. Works all the way from Windows XP to windows 8.1 (Which i have)",
            "review_score": "1"
        },
        {
            "review_text": "very good definetly must have, but wait for deals or price drop, its a bit of a rip off at £15, (14.99) i can buy the game in the shops for less than £5, but i understand the extended eddition has a steam based multiplayer, again great game, but steam or developers make the game more affordabale, its way too pricy",
            "review_score": "1"
        },
        {
            "review_text": "This is the game for people who love the macro wars of AOE and other startegy games without the mirco of an economy. Plus this game brings a lot of nostalgia when playing. I would suggest this game to anyone who loves strategy games but plays them for fun. Otherwise this game may be a bit easy for you.",
            "review_score": "1"
        },
        {
            "review_text": "Classic RTS game. One of my favourites from my teen years. I always play strategy games in some sort of story mode evolved around historical thematics and my imagination. This game is absolute winner for this kind of creativity and gameplay.  A few days ago I completed a multi game where as Russians, I struggled against German and Chinese attacks with my team mate who played as Japanese. Japanese forces made an outstanding defence to the last man as always but had to migrate to friendly territories at the end. We eventually surrendered 90% of the map and made a heroic stand in the streets of Moscow, Samurai and Russian musketeers, shoulder to shoulder under heavy artillery barrage. Thanks to the choke points and river in front of the city we managed to hold the city and eventually launched a simultaneous invasion from that small part to claim the rest of the map.  I hadn't watched any movies that evoked as much feelings as in that 3 hours game for so many years .",
            "review_score": "1"
        },
        {
            "review_text": "Great quality RTS Game, a bunch of fun to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "The memories from playing this game back in the day, so glad it was re-released onto steam!!",
            "review_score": "1"
        },
        {
            "review_text": "I missed this one back in the day... the golden era of RTS that is. This plays like an improved version of AoE2. Great fun!",
            "review_score": "1"
        },
        {
            "review_text": "best game to have a come back in must buy :)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome 'reboot' of a classic RTS. Still an epic game today, good tech-progression and a nice concept with territory!",
            "review_score": "1"
        },
        {
            "review_text": "An Old RTS Game from the year 2003. This RTS should Remind what a Real RTS should be. All Units got its own Role, Strenght's and Weaknesses. All Units do very little damage to one another, yet dealing good damage to those units there Strong against. Rifle Infantry &gt; Bazooka Infantry &gt; Main Battle tanks &gt; Rifle Infantry. With that, good Army management and Tactics is always better then spamming one single unit.  Compared to Age Of Empire, it has some very simaler conceps. There multiple resources you can gather, Games tend to take a long time if played against a strong AI or Player. There multiple ages, going from the Roman Empire till the year we live in.  Diffrent to Age of Empire are the resource gathering and managment. the amount of workes you have on farms increases the rate of resources gather total every 30 seconds. At the start of a Game, you begin with 3 farms, 1 lumbercamp and a total of 5 citizens. For every farm with a citizen you gather +10 Food every 30 seconds, 3 farms with citizens will gather you +30. You can never go into overkill when gathering supply's and Tree's, mines, farms, fishing spots never runs out of resources. By that, Stock piling is very easy and you will never see a game really turn into a very late game like a starcraft match where every resource has been depleted.  Only Downside is the Unit AI.  The Unit Pathing isn't that great, units can get stuck behind buildings, forest or even other units. Even aircraft tend to fly in a straight line while being chased by enemy aircraft, making them easy kills. some units in the later ages got some animations like; smoking, looking arround and some other stuff. Even when there moving they tend to use some sort of animations that slows them down and splitting up your forces.  Overall for a 11 year old game, it Still kicks asses. For players who liked age of empire or any sort of RTS, This game is a Must buy. Otherwise, Try a trailor or watch some youtube video's. For me, This game Stands in my Top 10 games I played all time.",
            "review_score": "1"
        },
        {
            "review_text": "Nice Game! A mix of the classic strategy board games and the empire themed RTS. This updated game gives the player hours of fun against computer and or player opponets. Although great to see this old game brought back to life, pumped with new gadgets for advanced computers. They forgot to update the graphics to current times :(",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing Rise of Nations for a while now and it is defintly a ton of fun and one of the best RTS' I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing RTS games for as long for as I can rember, and this was one of the first games I had bought when I purchased my windows xp. This remake is extremly faithfull to the orginal game, while makeing minor changes to the formula that where needed for smother gameplay. I would highly recomend this game to anyone who is interested, espicially since it is only 5 dollars (at time of writting).",
            "review_score": "1"
        },
        {
            "review_text": "I remember getting this game pretty close to when it came out and had been waiting for it to come to steam or someother place since i lost my discs. Pretty good game has some problems and issues that accomany older games but over all a fun time.   ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RTS games ever, still played even after all these years.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, but very challenging. I would remommend this to any serious strategy gamer if you havent already played it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most polished, comprehensive, satisfying RTS of all time!",
            "review_score": "1"
        },
        {
            "review_text": "Been playing the old version for around ten years now.   One of the best real-time strategy games I ever played. In fact, I have spent more time in this game than on any other video game. Highly recommend it if you are into strategy games. Compared to the old version, the graphics are improved and gameplay is more fluid.  Again, highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Why No Work on XP's?????",
            "review_score": "1"
        },
        {
            "review_text": "age of empires meets civilisation and risk :) and there's nothing better then nuking china :P",
            "review_score": "1"
        },
        {
            "review_text": "It's the game that got me into rts's with a slight visual enhancement and modern updates. Definitely a classic so stop reading and get it now!!!",
            "review_score": "1"
        },
        {
            "review_text": "Strong nostalgic game from 2003 with updated graphics. Great music. Superb strategy, we should have used this back in gradeschool. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "The lazy mans Age of Empires! Why keep mananging your people to gather resources when you can have them mine an endless resoruces! this is probably a good way to get introduced to the strategy genre without the micro-mananging parts.",
            "review_score": "1"
        },
        {
            "review_text": "this game is not working and has not worked i tied to get on ride of nation website it has been down for 3 weeks noe i tried to get help from microsoft i even asked for help reloading it but for 3 weeks i have had no response if i get none by Augst 24 i will advise not to buy the packet and call better buisness this is extremely ♥♥♥ in nine",
            "review_score": "-1"
        },
        {
            "review_text": "Best $5 I've Ever Spent. So worth it. Imagine just getting coffee. That wouldn't be fun. Imagine getting this game. Fun.",
            "review_score": "1"
        },
        {
            "review_text": "Nice setting and idea but AOE2's gameplay was just plain better",
            "review_score": "-1"
        },
        {
            "review_text": "An all time favorite, few connectivity issues with large groups but to be expected with such an old game.  10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Attacked a platoon of Main Battle Tanks with a herd of Elite Camel Warriors,  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Rise of Nations is a great game one of the best from my childhood I am glad they released it on steam great campagn I only have one complaint it can get repetitive     9.5/10-IGN ",
            "review_score": "1"
        },
        {
            "review_text": "I am so much better then Dragol at this games it not funny!",
            "review_score": "1"
        },
        {
            "review_text": "Im sorta torn between RoN and EE, still making a custom Civilazation in EE was rather strait forward, just decide what Epoch want to contribute points for improved dynamics of perks, RoN... yet to see if even gets involved with that as even first tutorial mission, abit unimpressed with the terrain textures of elevation... Mountains are not free-formed changes in the landscape, besides just a plopable setting to be used in mining for iron...etc(again low epoch before conquered opponent)  So much EE did right, yet Gamespy Arcade was shutdown so no more Mp with it, As for RoN... might be a different take on a rts model of conflict.  7/10 Lacks familiarity",
            "review_score": "1"
        },
        {
            "review_text": "Was my favorite RTS game of 2004 after Win Xp era I wanted to get this game back hardly! And finally I got it!  You can play as any major nation (Russia, Germany, USA, UK, France, Spain, Greece, Japan, China, Korea) and develop your cities, technology, military, research, religion and so on. Hell you can even decide your government type.  There's achievements but that's not the point of getting this game, it's nostalgic and epic!  I had tons of fun with it, but there's not actual campaign for single-player just quick battle or custom battle. You can play it online aswell which is cool too.  Definetly for RTS fans!  5/5",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Best one. Graphics and game play is superb.",
            "review_score": "1"
        },
        {
            "review_text": "Rise of Nations shines in multiplayer. Still booting it up every once in a while with my buddies. I would recommend you getting it as well!",
            "review_score": "1"
        },
        {
            "review_text": "One of the better RTS games on Steam, the way the technology upgrades work is a nice change of pace compared to what im used to with the Age of empires and Mythologies series'. A great game to add to the RTS collection to play with friends, not a big fan of the way nukes work even though you can turn them off i feel like there a negative addition to the game since they can cause alot of havoc when turned on and its super easy to turtle and get stuck in a infinite game with computers if you turn it off.  A little more costly than some of other RTS games but still a fun game to play with some friends online and worthy addition to the RTS colllection",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun so many choices!!",
            "review_score": "1"
        },
        {
            "review_text": "An old classic!",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why but I can't get into this game like I did with Age of Mythology and Age of Empires II and III. It's still good I guess. Nukes and ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely recommended! I used to play the original when it came out all those years ago, then I played Thrones and Patriots. This is a great upgrade to that, now with glorious 60 frames per second! We had small problems, though. My friends and I all wanted to get on the same server, and the interface isn't the best (plus, the steamworks integration is basically a lie, you can invite people, but they still have to find your server on the browser, but luckily there aren't many games open at a time). I (not anyone I know) also had a problem with the menus not working, it might be because I have Windows 10, but I also had this problem with Thrones and Patriots, it's a simple fix.   All in all, recommended! Everything I remember it to be, and more.",
            "review_score": "1"
        },
        {
            "review_text": "Sid Meier's Civilization and Age of Empires 2 had a baby!",
            "review_score": "1"
        },
        {
            "review_text": "I was a bit worried that this game wouldn't have held up after 12 years, and that maybe my rose-tinted glasses of nostalgia were obscuring my memory. Fortunately, none of that is the case. It holds up surprisingly well, and is as fun and enjoyable as I remember it. The music is still awesome. Only gripe I have with it, and that goes for back in the day as well, is that it's not obvious which research options do what. Some are self-explanatory like Taxation, commerce, and military, but others might as well do nothing and I wouldn't even notice. I would have liked descriptions on the importance of the research, or at least what they unlock/change. It's only a small issue though.",
            "review_score": "1"
        },
        {
            "review_text": "Growed Up With This Game &lt;3  Still The Best &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Even after years of playing, RoN is a RTS that keeps me coming back for more, despite my casual gaming interest. Solid 5/5, probably mostly for nostalgia...",
            "review_score": "1"
        },
        {
            "review_text": " One of the best strategy games ever!",
            "review_score": "1"
        },
        {
            "review_text": "its shap",
            "review_score": "1"
        },
        {
            "review_text": "even though it has 2003 graphics and todays grapics are much better BUT its a classic rts game so i recommend",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why but I can't get into this game like I did with Age of Mythology and Age of Empires II and III. It's still good I guess. Nukes and ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": " Rise of Nations is RTS Civilization.",
            "review_score": "1"
        },
        {
            "review_text": "Tis game is mindblowing fun its rts on crack its like aoe and risk had a baby and civ was its uncle.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game! ",
            "review_score": "1"
        },
        {
            "review_text": "Still as cool as it used to be",
            "review_score": "1"
        },
        {
            "review_text": "I have waited a long time to revisit this gem and outside of the moddern additions to the game it feels like it did back in the day.",
            "review_score": "1"
        },
        {
            "review_text": "Rise of Nations is just as classic and awesome as it has been in the past. This edition on steam is the same exact gameplay as it was years ago. Just as I remember, very good RTS game.",
            "review_score": "1"
        },
        {
            "review_text": "eramgawd 420 blaze it infinite resource new everyone 34324324322 jets flooding your base",
            "review_score": "1"
        },
        {
            "review_text": "Best stragic game ever.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic upgrade of the original game! Throughly enjoyable; highly addictive - definitely recommended for any strategy lover!",
            "review_score": "1"
        },
        {
            "review_text": "'Rise of Nations: Extended Edition' is a really good deal  'Rise of Nations: Extended Edition' is really enjoyable   ",
            "review_score": "1"
        },
        {
            "review_text": "Love this... much better version of the Risk.... and of course, much much more!",
            "review_score": "1"
        },
        {
            "review_text": "This is basically the spiritual successor to Age of Empires 2. Age of Empires 3 was just one of those dumbed down games made for casual gamers. This is the real Age of Empires 3 that will bring you through the beginning epochs of human civilization into the future, where you'll carefully build your economy and military strength to do battle with your closest neighbours. The Conquer The World campaigns gives players a chance to experience all the great RTS fun that Rise of Nations has to offer while exposing them to an exciting mini-game where your ultimate goal is to paint the world red with the colors of your nation.  You will notice similarities to AoE games and Civilization games while the priniciples they pioneered are put to the test to provide a unique civlization building military real time strategy game that to this date has no equal. Not Empire Earth or all the RTS games that came after this one have yet to provide a more exciting and representative experience of Human beings bloody birthing pains into the world of the modern civilization we enjoy today.  On sale or not this game is worth every penny, and if you ever finished playing Age of Empires 2, moved onto AoE 3 and felt that game was lacking, I suggest you try out Rise of Nations. I gaurantee It will be a satisfying experience.  9/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is exactly how I remembered it, and the new Nations (American, and Lakota of those that I recall) are quite the new challenge that is exactly what this game needed to revitalize its playability. Playing online is so much better now that it's supported by steam's network!  Sources: Personal experience; 8 years of playing Rise of Nations",
            "review_score": "1"
        },
        {
            "review_text": "Rise of Nations is not the most recent of games; it was originally released many many years ago, but it still seems to be quite good. Lots of technologies, eras, units, factions. Fast-paced and interesting. Matured better than AOE2, and arguably AOM.",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold. I never had a chance to play this back in the day and I regret it. This game is like Civilization meets Age of Empires, which is suprisingly awesome. Sure the graphics (even with the HD re-release) are a little dated but if you like RTS games you wll love this.",
            "review_score": "1"
        },
        {
            "review_text": "This game combines the best elements of Sid Meier's Civilization series and the Age of Empires series. Built on a modified version of the Age of Empires II engine, the game was starting to look dated. These developers have enhanced the graphics on the game with updated resolutions and textures and really give the game a more modern feel. The gameplay is the same as it always has been and amazingly, no game has tried such a brilliant concept since. I highly recommend this game to fans of the Civ and AoE series and RTS's in general. If you're a newcomer to the RTS genre, I would recommend starting with more basic games such as Starcraft or Age of Empires II.   5 Stars.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite real-time strategy game! Similar to Age of Empires and/or Civilization.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the games that was responsiable for my childhood (the others being Civ III and Starcraft, original and Brood Wars). This game is the best RTS that came out this last decade, and with good reason. PROS: -Great gameplay mechanics -Nice visuials, even though it is over 10 years old -Conquer the World campagin. If you get tired of just playing an RTS, play this rather intesting Turn-Based gamemode, in which many quick and small battles are spread out over an afternoon -Many different Nations, maps, and difficulties. Really good replayability value! -The music is very nice  CONS: -As of posting this update (6-21-14), the game appears to only run on Windows, sorry all you Mac and Liniux users -This game has a rather steep learning curve, but has interactive tutorials which are very handy.  This is a very nice game, and might be very nostalgic for some of you. Ok steam, now all you need is Masters of Orion two, and my life will be complete :)  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia bomb! Fun for the casual RTS gamer! Varied recources makes gameplay engaging when managing both resource output, technology and unit research and most importantly of all, building your army!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made! So addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, very nostalgic. Has elements of play that have either been forgotten or improved on. But the blend of balance, gameplay, and strategy makes this a truly astounding game and can be classified as one of the poster children of RTS-gaming, if not one of the top tier games of the RTS 'Golden Age' a decade+ ago",
            "review_score": "1"
        },
        {
            "review_text": "A must buy if you love RTS games.",
            "review_score": "1"
        },
        {
            "review_text": "Rise of Nations was one of my favorite strategic games and I could never find a modern one that was the same. Sid Meier's Civilizations was a decent game, but didn't quite have the same feeling as this one. To say the least, I'm really glad this game was revived, and if you're considering getting it, do it now. You won't regret it.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "A great game of you don't mind the outdated graphics!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! My fave is world campaign, not gonna lie only on the easiest mode though. ",
            "review_score": "1"
        },
        {
            "review_text": "Rekindles my childhood.",
            "review_score": "1"
        },
        {
            "review_text": "Well this game is great and with improved graphics its even better playing gold edition for 2 years now with my friends finally brought extended edition and it is good especially the nuke graphics are best  Rating : 5/5 Star",
            "review_score": "1"
        },
        {
            "review_text": "Played as native americans. Beat up gun-wielding Europeans with clubs",
            "review_score": "1"
        },
        {
            "review_text": "Love it!!!!",
            "review_score": "1"
        },
        {
            "review_text": "awesome game for 2003 and 2015 too, really fun :D",
            "review_score": "1"
        },
        {
            "review_text": "Its fun. If you played the others, this is a great update.",
            "review_score": "1"
        },
        {
            "review_text": "If you like games that are a little less micro heavy and alot more crazy insane battles, this is your game. For those of you looking for a game that can take anywhere from 30 mins to 3 hours, this is your game. Frankly, this is one of the few RTS's we still play at our lan parties and even online.  For those of you wondering why you should buy it? maybe you have a copy, or the gold amazon one, or you stole a copy...With this, it just works... You fire it up, you can play with people over the internet (Aus to California) and there is just no problems...I hated the issue with game versions listed the same number yet couldn't play together. Worth every cent!",
            "review_score": "1"
        },
        {
            "review_text": "Everything Age of Empires III should have been. The multiplayer works well and there is just somethings satisfying about melting your opponents with Nuclear weapons. If you like Civilization of any flavor, and would like try to anothe strategy genre without turn based play, this is your game.",
            "review_score": "1"
        },
        {
            "review_text": "Top notch RTS. Had it back in the day and it hasn't lost its lustre one bit. It's like Microsoft took every good aspect from every Age of _____ game and added everything that needed to be added to make something beyond amazing. Historical accuracy aside (and seriously, who cares?), it's probably the best straight-forward 'historical' RTS out there. Give it a try. Probably even worth buying when it's not on sale if you're at all inclined to playing strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best rts, out there, its a classic. Just dont nuke too much....noone wins....",
            "review_score": "1"
        },
        {
            "review_text": "Rise of Nations is what I would call a nice introduction to RTS games.   +It's fairly easy to get a hang of and you don't need to invest countless hours to understand the basic concepts.  +It has all your basic RTS features such as setting a way point for new units to arrive at when they are created, continuous unit creation, and scouting. +This game offers a nice 'Age' progression system where you can go through the stone age, the bronze age, ect, and build new units and unlock 'Wonders' to build that will give you neat little bonuses such as reduced costs of resources on certain research, give you bonus resources, or straight up give you soldiers to use. +Each nation has a special passives that can cater to your style of play and adds diversity. +The game modes are very customizable with a ton of options. +You can choose to play the game either in a 'Quick Play' session or you can choose a 'Take over the world' campaigns.  +/-It has twitch streaming options, I have yet to fool around with these and I don't hold any interest in them.  -The graphics are still a little dated. -The simplicity can be limiting at times with the lack of things to be able to do. -The game can get lack lustre quite fast if you ever stick to one style. -Quick Sessions are just as they sound, barely ever lasting an hour of gameplay against bots.  I still enjoy it to this day. It's a solid game that I think new comers to the genre can enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Great Fun I've Had it for years!",
            "review_score": "1"
        },
        {
            "review_text": "high replay value good rts",
            "review_score": "1"
        },
        {
            "review_text": "playied it enough to really enjoy it. Great game to play with mates",
            "review_score": "1"
        },
        {
            "review_text": "Even it's an old game but this game still the best game in strategy type that i ever play compare with other games",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite games and I used to play it 8 years ago. I downloaded it from steam and it has an unfixable bug that has been around for a lot of users for more than 2 years and developers dont seem to care to fix it. The mouse pointer of the game is offset on fullscreen mode and when windowed the display of the game is tiny (1/4 of the screen size). I know this problem has been around since 2014 because there is many discussions about it, but there is no clear fix to it. Some people seem to be able to play, but it is a risk to download it as you may have this bug.",
            "review_score": "-1"
        },
        {
            "review_text": "Just a classic, had to get it for that purpose, used to play it a lot back in the day",
            "review_score": "1"
        },
        {
            "review_text": "Another klassic RTS!!",
            "review_score": "1"
        },
        {
            "review_text": "Even it's an old game but this game still the best game in strategy type that i ever play compare with other games",
            "review_score": "1"
        },
        {
            "review_text": "They don't make 'em like this anymore...",
            "review_score": "1"
        },
        {
            "review_text": "10/10  rise to the world stage as russia and cause nuclear armageddon",
            "review_score": "1"
        },
        {
            "review_text": "Please don't mind my 'playtime'. I have played a lot of this game outside Steam. I am a freak when it come to RTS games. And if you are as well then this game is a must-have. It takes everything that Empire Earth tried to do but failed, and makes it great. If you loved such games like Age of Empires series then Rise of Nations is definitely for you.",
            "review_score": "1"
        },
        {
            "review_text": "Game crashes everytime when it was loading into new map...",
            "review_score": "-1"
        },
        {
            "review_text": "It'll always be fun to nuke people with bows and arrows who just sank a destroyer.",
            "review_score": "1"
        },
        {
            "review_text": "Why am i upvoting this game? BECAUSE ITS RISE OF NATIONS! THATS WHY!",
            "review_score": "1"
        },
        {
            "review_text": "Brings me back to old good times, after all its still one of best strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "good game lots of fun and destruction as you go through history  ",
            "review_score": "1"
        },
        {
            "review_text": "Encountered a bug affecting the Conquer the World campaigns, reported by other users many months ago and is still not fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "Such a great classic strategy title. The controls take the Ronseal approach; do what they say on the tin. The sprite assets are fantastically detailed for their time and still look good running on higher resoloution on a more modern PC. The overall difficulty of the single player aspect of the game is not that difficult at all and can be breased through in a few days, however the addition of Steam Achievements is much welcomed and sets another tier of challenges that compliment the way the game is played. I was most surpised however to see over 1,300 people online in the servers still playing this rather old title, which was really good to know. As this is where this game really comes to life; the multiplayer aspect.",
            "review_score": "1"
        },
        {
            "review_text": "My review it´s going to be simplest as it can be... Perfect game, many memories from childhood but I can´t run it on windows 10... Please try to do something with that, I would appreciate your effort...",
            "review_score": "1"
        },
        {
            "review_text": "All i will say, is that if you like strategy games, then you will love the sh*t out of this game!!! :) ..but if you wont, then you have to be retardoo!",
            "review_score": "1"
        },
        {
            "review_text": "Been playing this for years!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really excellent! great fun building nukes and destroying the enemy citys with them! you go through every time in history from stone age to modern day! you can even (if your fast enough and the computer set on easy) destroy greeks or romans with V2 rockets or musketeers! i reccomend getting this game! great fun!",
            "review_score": "1"
        },
        {
            "review_text": "For Multiplayer and Custom Game. It is good game to play. If you don't have enough money to buy it. I recommend you to buy it. Even if It has a little civilizations compared to Civilization Franchaise. It is really ejoyable Game. 8/10  Scenario : Sadly It has a little functions so you cannot add the hisotrical event by series. You just make the scenario or play the scenario for Diplomacy and Risk. 4/10  Campaign : Except for Speical Scenarioes during the Campaign, It is really boring. But Cold War and Napoleon, Alexander are not bad. 5/10",
            "review_score": "1"
        },
        {
            "review_text": "the best",
            "review_score": "1"
        },
        {
            "review_text": "It is a great return of an epic game!",
            "review_score": "1"
        },
        {
            "review_text": "Played a lot of Age of Empires growing up and was looking for something different but RTS at the same time. This game is great and I highly recommend it. Reminds me a bit of Empires: Dawn of the Modern World",
            "review_score": "1"
        },
        {
            "review_text": "GG i love this nuckler bomb D:",
            "review_score": "1"
        },
        {
            "review_text": "Very nice soundtracks, gameplay etc.Best RTS i ever played.10/10",
            "review_score": "1"
        },
        {
            "review_text": "A great RTS game with Campaigns similar to Total War, a great tutorial, skirmishes, PLENTY of mods, and lots of buildings and units. I definitely recommend to any fan of RTS's.",
            "review_score": "1"
        },
        {
            "review_text": "Very good strategy game with very helpful details and tutorials to get you started. I do suggest playing with a friend or two because then it will be alot more fun.",
            "review_score": "1"
        },
        {
            "review_text": "very good game! very positive",
            "review_score": "1"
        },
        {
            "review_text": "Best stragic game ever.",
            "review_score": "1"
        },
        {
            "review_text": "On my rating scale, I give Rise of Nations:Extended Addition a 8.7 out of 10.  My reasoning for this grade is for many different reasons. I like how the player is given the ability to choose their own way to run their country. I mainly play this game's online multiplayer, so the customization is good. I like how you can progress through the ages, and get new technology as you go.  As far as my deduction of 1.3 rating from this game. It is due to the fact that if you want to have en extending game, the only real way to end it is war. War is the main concept of this game, while real nations aren't spending all of their money and oil on tanks.   I feel that the other nations demand too much of you (trade wise), and if you decline their requests, they instantaneously declare war on you. They never learn, unlike real countries.   When there is a war, I am almost always the long term winner. I either end off a war by completely destroying the other country, or I accept their peace. I usually sanction payment of gold and food to my nation if the other side wants peace. However, it takes about 5 times of them getting nuked in order to bow down to you.   I wish they had more country managment options other than just benefits of certain governments.",
            "review_score": "1"
        },
        {
            "review_text": "'They don't make them like the used to.'  That is a saying I don't usually subscribe to, but... They don't make them like the used to.  I never played this game when growing up and nor am I a super nostalgic person, so I don't have much bias... so you can trust me when I say that this game is spectacularly good.  This game is brilliant in just about every area. It's withstood the test of time better than any other game I know of from this era - heck; it's probably one of the very few that have only improved with age. The visuals are nice, even by today's standards, the UI still feels intuitive and modern, the balancing feels nice and it runs phenomenally well on every PC I've ever come across.  It has mods, it has no microtransactions, it has boatloads of content, it's optimized very well and will run on just about everything, it has multiplayer and it has a devoted and awesome community.  I honestly can't find fault with this game. It is spectacular in every way.   Pros:  Literally everything.   Neutrals:  None.   Cons:  Prone to crashes during huge (7-8 player) multiplayer skirmishes.   Final Verdict:  Buy it. It's truly spectacular.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would recommend this game to anyone. One of the best games ever created, easy to pick up and always entertaining. I'm glad Steam borught it back online! Have owned the old versions previously and had tremendous fun on it spending hours in CTW mode or playing the Cold War campaign. Some highlights of the game include the vast units available and the timeline from the Ancient age to the Information age.   All in all a great game, haven't gotten tired of it even after 10 years.",
            "review_score": "1"
        },
        {
            "review_text": "Great historic game! I learnt that the British built the Great Pyramids, used supercomputers in the 1500's, and launched the first nuke at the USA! Crazy how much my school got wrong.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very replayable game when playing against the computer. Due to subtle differences between civilizations, there is a lot of variance in optimal gameplay. Add in variation due to map and enemy civilization biases, there are many strategies to explore.",
            "review_score": "1"
        },
        {
            "review_text": "Still a great game despite the age with good mechanics and customisation for the rules",
            "review_score": "1"
        },
        {
            "review_text": "This game, stands as the test of time award in my account No matter what games i play.. I came back playing this.. This is the game that will always be installed in my Steam Library",
            "review_score": "1"
        },
        {
            "review_text": "This game is a classic. I played this many years ago when it was new, logging many hours. The newest version is amazing, and with Steam integration its never been easier to get connected to play with friends. Really awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Ive always played this game to pass time , i use to play this game from the CD Version back in the day and ever since then ive been itching to play it again. This is a great game to pass some time and build a community, fight wars and become victorious over fellow factions. This game doesnt take crazy graphic cards to run or even a crazy computer at all. So if you are looking for a game to play i would definetly recommend this one.",
            "review_score": "1"
        },
        {
            "review_text": "Age of Empires 2 meets Civs, thats just great!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game it would have to be one of my all time favorites. I really enjoy playing civ like games and rise of nations takes this type of strategy game to a whole new level. I would recommend this game to any one who loves a good strategy game, has a lot of free time or wants a fun and easy way to fight your frriends with your massive armies. Happy playing!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite RTS games and it holds a top spot against newer games with improved graphics. This is a game that I can play for hours, in large part due to the different civilizations. This game is great for people who enjoy the build up as much as the battle.",
            "review_score": "1"
        }
    ]
}