{
    "app_id": 287600,
    "name": "Sunset",
    "release_date": "2015-05-21",
    "developer": [
        "Tale of Tales"
    ],
    "publisher": [
        "Tale of Tales"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Walking Simulator",
        "Indie",
        "Casual"
    ],
    "achievements": 100,
    "positive_ratings": 159,
    "negative_ratings": 72,
    "price": 14.99,
    "description": "It's 1972 and a military coup has rocked Anchuria. You, Angela Burnes, are trapped in the metropolitan capital of San Bavón. Your paradise has turned into a warzone. You take up a job as a housekeeper. Every week, an hour before sunset, you clean the swanky bachelor pad of the wealthy Gabriel Ortega.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/287600/header.jpg?t=1453796340",
    "minimum_requirements": "Минимальные: ОС: XP 32-bit Процессор: Intel Core i5 Оперативная память: 4 GB ОЗУ Видеокарта: AMD Radeon HD 6970 (1 GB VRAM) DirectX: Версии 11 Место на диске: 2 GB Дополнительно: IntelHD Integrated Graphics Chips may work but are not supported",
    "recommended_requirements": "Рекомендованные: ОС: 8.1 64-bit Процессор: Intel Core i7 Оперативная память: 16 GB ОЗУ Видеокарта: Nvidia GeForce GTX 980 (4 GB VRAM) DirectX: Версии 11 Место на диске: 4 GB Дополнительно: IntelHD Integrated Graphics Chips may work but are not supported",
    "reviews": [
        {
            "review_text": "This is not a game for everyone. I love walking sim, story rich, choice-based games (this game, exactly) so when I heard this game was in development back in 2014 I waited eagerly for over a year. I was not disapointed. I think this game is beautiful, for one thing. I was taking screenshots like they were going out of fashion. The story is also compelling and I loved hearing it from Angela's perspective.  The orange and blue options were simple but they worked: they made me think before doing (which could have easily made the housework repetative).  I thought that sometimes the journal entries were long and dull, I sometimes only listened to a few lines if the content was irrelevent to the current situation (often during a certain part mid-game where there were no lists and NO BREAKS FROM THE JOURNAL). But the writing was beautiful and it was important they touched on Angela's childhood and life as an African American woman.  So yeah, I'm giving this the thumbs up. But make sure this is your kind of thing.   ",
            "review_score": "1"
        },
        {
            "review_text": "A really immersive, touching and atmospheric little game. The gameplay is all about subtelty and exploring the environment, very much 'show not tell' for a lot of the narrative. Of course, if that's not your thing, you won't like it; maybe that's why there are so many (undeserved, in my opinion) negative reviews? The game starts deceptively simple - you make your way to a high-ranking official's flat every afternoon, and have to complete a to-do list around house chores. Thing is, after a few days, you start noticing that you can complete the tasks in a couple of different ways every time, and that by exploring and looking at the right things you can start building a slow relationship with the flat owner. Your choices *will* affect the game, sometimes in unpredictable ways, and it's fascinating to see the characters develop through the choices they make. The story is also highly personal and although the every day actions are pretty trivial, there's a real sense of sadness, anger or even danger at various key points. That was a really nice surprise. Graphics-wise the game has a very 1970s feel and palette obviously, again maybe not to everyone's taste (I personally really hate everything 70s!), but really well designed and elegant. It also makes a lot of cultural references to 20th century art/literature/music, which is quite interesting.  It ran perfectly on my 2yo mid-range gaming PC, so no issues there. Controls were very simple, could have done with a little more explanation (for the alternate choices for example), but definitely not a deal-breaker.  Tl;dr: try it, and like me you may get a really nice surprise. :-)",
            "review_score": "1"
        },
        {
            "review_text": "I don't know much about this point in time, but the atmosphere is good, the voice actor did a good job, and I could see some possible replayability later on,",
            "review_score": "1"
        },
        {
            "review_text": "For a dollar (at the Humble Store) I got to play as Foxxy Cleopatra while cleaning up and decorating some dudes penthouse suite. I think she secretly wet her pants in his bed each day. I might become a maid and interior decorator in real life now. Oh, and I got to grease his telescope.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, poignant, and introspective. If you liked Gone Home, or Dear Esther, I strongly recommend Sunset. The game's story is told from a unique perspective, one most usually dismiss or deride. This is not a power fantasy. It's about one person doing the best she can in a difficult situation. She has little power or agency, yet the ways in which you are able to influence the world still feels satisfying.  One last note, make sure you try to end the day with finding the white-draped chair and sitting in it. You'll get snippets of Angela's journal. I didn't discover this until halfway through, and I'm looking forward to playing through again to try and read all the journals.",
            "review_score": "1"
        },
        {
            "review_text": "A game that is not for all the people, but I like it. Is a bit like 'Papers Please meets Gone Home', because your behaviour has influence in the 'real' world outside your zone, but in first person, and by playing you know better other character. I really like it, but is a difficult game to enter.",
            "review_score": "1"
        },
        {
            "review_text": "This game was gorgeous and kept my attention all the way through. I found myself very interested in how the apartment would change from day to day. Seeing a story told from this angle is so refreshingly unique.",
            "review_score": "1"
        },
        {
            "review_text": "This is an interactive narrative. I've seen many people complaining about the 'gameplay.' If you go in expecting anything more than a walking simulator with a great story, you're going to be disappointed. Think of this game as Gone Home with choices. Things you do in this game certainly affect the outcome and that, in a way, is the point of the story.",
            "review_score": "1"
        },
        {
            "review_text": "Sunset is a story based exploration game played in a single penthouse owned by Gabriel Ortega, a rich businessman. The game is set in a fictional latin american country lead under military dictatorship and shortly after the start of the game, riots begin occuring near the penthouse.  You are playing Angela Burnes, his housekeeper and you visit his penthouse once a week to clean up his ♥♥♥♥. When cleaning up, you will be presented with 2 different choices. The blue choice will help you build a neutral relationship with Ortega while the orange choice will make him like you more than he should. You have exactly one hour to complete the chores and leave the penthouse, before the sun sets. As you clean Ortega's house, you will begin seeing notes left by Ortega himself, for you to respond to. You can choose to ignore his notes or write back. All decisions you make influence the further development of the story. You can also do various different things in the penthouse such as sitting on your ♥♥♥ listening to music from his headphones or looking through the window and blabbering nonsense. Sunset is a very interesting game that gives you the opportunity to create a genuine relationship between two people who have never even met. The most interesting parts of the game are the books that Ortega leaves around the penthouse and his behavior after you've done something special in the penthouse. The books that you can find scattered across the rooms help you form opinions about Ortega, specifically zooming to read the name of the book. If you do not zoom and read the name of the book, that will not be a factor in your future opinions about Ortega. There is also the fact that he leaves classified documents in the open for you to see in case your relationship is leaning towards the orange color. The other very interesting aspect of the game is the fact that you can do unusual things in the penthouse such as positioning his shoes in a circular pattern or building a pyramid of a few toy soldiers that you found. Ortega will not touch these creations. Even several weeks after doing this, it will stay intact while half of the penthouse items will change positions.  When playing Sunset, you really feel like every single choice you make, every book you read and every action you take during that one hour, matters and that the relationship between you and Ortega is changing. In the first 5 minutes of the game I thought this would be a boring waste of my time but then I realized that I really want to figure out who this Gabriel Ortega guy is and can I eventually have sex with him.           YouTube™ Video:  Sunset Gameplay Quick Look - Exploration Game&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Sunset is a fascinating and unique game of a type I wish we saw more of. It's very much like reading a novel; I'd say it's one of the most elegant attempts at making a game be a novel that I've ever seen.  The graphics are fantastic. As some have noted, performance can seem unexpectedly poor on a low end computer (reminiscent of 'Tex Murphy: Overseer' back in the day, for me, on my weaker machine). But on my newer system, the graphics are flawlessly smooth, delectably stylized, and I can't imagine wanting to change a thing.  The game is unusual in that it seems a bit as if you can do your job as poorly or disinterestedly as you please with absolutely no negative feedback. This is unusual, and takes a bit of getting used to. Eventually, the story begins to offer a plausible explanation for why this might be, but I didn't trust this concept for a good while. I plan on doing a second playthrough shortly to test the theory that I am completely free to sociopathically disregard the work I am (theoretically) being paid to do at all times. The game mechanics suggest that this is really how I was meant to be playing the game all along in the first place.  Really the only negative thing I have to say is that I have a suspicion that a few of the Steam Achievements might be buggy. I definitely saw things that would make me assume I should have a few more of them than I do, and all of the ones I think that about show 0% of players successful. Hopefully a patch will clear that up in the near future.",
            "review_score": "1"
        },
        {
            "review_text": "You can see a reflection of the whole room in a floor lamp.",
            "review_score": "1"
        },
        {
            "review_text": "The colour palette and sound design of this game is awe inspiring. Combined with carefully placed pieces of history, both real and imagined, this game creates a sense of nostalgia for simpler times mixed with forebording for the complexity of life. I recommend it for anyone looking for a simulation style game focused on aesthetic and analytical introspection.",
            "review_score": "1"
        },
        {
            "review_text": "The positive: Really interesting premise, setting and art style. I was invested in the story despite its unusual presentation. I appreciated that it wasn't about aliens or zombies or hitmen. When the game started and I realized I would be doing chores I was skeptical, but it won me over pretty quickly.  The negative: I'm really forgiving when it comes to clunkiness, especially in indie titles, but this one just wore me down fast. After a while I just couldn't ignore the flakey controls and poor optimization, and I opted to watch a lets play instead of actually playing it (Hence the extremely low # of hours played). If this were an Early Access game and I could expect these issues to improve I'd say absolutely give it a look, but as a finished title it's just shy of worth it. I've got to give it a thumbs down unless you're specifically into unusual game design.  I'm actually looking forward to the next game from these developers. They've convinced me that they can craft a fun experience out of unique elements. I'm hoping it's something in a similar style, just a more polished technically.  (Side note - Not really a plus or minus, just something to keep in mind if you're sensitive to motion sickness - this is the only FPS I've ever played that has made me feel nauseated. My wife couldn't watch more than a few minutes before almost throwing up. Pretty weird.)  [Edit: After writing this I checked out the developer to see what else they were up to. Turns out they've shut down. That's a damn shame.]",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a trainwreck. I wanted to like this, I thought it was supposed to be a good, artsy game. Instead, its a cynical cash in. The writing is atrocious, and the game didn't even get a copy-edit. The voice acting sounds phoned-in half the time. Game is set in the fictional world of South Amerca, in fictional 1972. Why would you set a story in a real continent and year but not use real events or country names?  Sunset tries to be Gone Home, but the exploration is so underwhelming and it pretty much plays itelf. There's no real game here, as 'cleaning the floor', for example, means clicking the broom once and watch time tick past. Story items are only explained a little bit, one sentence or two for each, and the character you play as doesn't even need to see items to comment on them the next day. You get achievements for looking at the books scattered around the house each day, but why should I care if this guy reads Brave New World? You look at Life is Strange, and they tell you why the pop culture it references is worth looking into. Sunset's just like 'here's a book one of the devs likes'.  I don't know if the people who made this have ever done anything physically before in their lives, but, I'm sorry, a young woman isn't going to assemble a 500 pound mobile scuplture suspended 20 feet in the air with no tools and no ladder. What were they thinking? The only thing that I got any sort of kick out of was the space station chairs from 2001 A Space Odessy, and man is that a random thing to add.  The game bombards you with trite poetry, rife with spelling errors and ridiculous statements like 'fire, a symbol of comfort.. and destruction'. Really? The color pallet in the house is more abstract and less on-the-nose than the writing. And then, in the story, they just randomly introduce elements into the mythos. I decoded a document because I was snooping around, and so for whatever reason I now have a brother who's a resistance leader. Why didn't we mention anything about this before it was of major relevance to the 'plot'? There's absolutely no incentive to explore the game's story, anyway. And the character doesn't even know herself. She's black, so obviously she would refer to her own school as 'the black school', right? Riiight.   Oh, and the game performs horribly on my machine. They even have a setting where you can reduce the graphics to look like Journeyman Project (1992). I kid you not, the lowest graphics setting looks like the Sega CD and it still runs like garbage. And why do the carpets at the begining look like snow, even in the advertised screenshots, but in the sunset 'levels' the rugs are gone?  Stay away from this boring, unthoughtful title. The developers obviously wanted to have as little to do with it as possible, too. I'd just like to thank them for dispanding before they had a chance to make a sequel.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting game, but its sad to see it fall under performance issues.          YouTube™ Video:  Sunset gameplay - Quicky Look&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "It pains me to say this but the game is a technical mess. After trying to see past all the issues for a good few hours I ended up requesting a refund.  It seemed like a fairly interesting game but it was almost unplayable, I have since started playing The Novelist which has a similiar concept of walking around a small lived in space over a peroid of days, that game thankfully funs like a dream.   If all the technical issues were ironed out I'd re-buy it in an instant but sadly I'm left thinking maybe the developers of Sunset bit off more than they could chew.",
            "review_score": "-1"
        },
        {
            "review_text": "Bored me to death, If you wanna become a House maid this is an A++ Job training tool.",
            "review_score": "-1"
        }
    ]
}