{
    "app_id": 287720,
    "name": "Nostradamus: The Last Prophecy",
    "release_date": "2014-04-24",
    "developer": [
        "Microids"
    ],
    "publisher": [
        "Microids"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 92,
    "negative_ratings": 36,
    "price": 3.99,
    "description": "The Spiritual. The Supernatural. The Skeptical. All are touched upon in Nostradamus: The Last Prophecy. The player is immortalized as a profiler of sorts in this treasure hunt game - a brilliantly vivid historical rendition of the acclaimed quatrains of Nostradamus.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/287720/header.jpg?t=1478598382",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8 Processor: 800 MHz Memory: 1 GB RAM Graphics: 512 MB DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Here is another 'old' game that I was very happy to be able to play after so long. I didn't remember most of it anyway.  What I truly love about this game is that most of the puzzles are very logical (and rather simple), unlike the new tendency of adventure games, which are usually based on gathering a lot random items without apparent reason, which you will have to combine (I positively hate pixel hunting), and where you don't always understand what you are supposed to do or, more important, why. In this game, everything you do has a purpose in the story. Futhermore, some of your choices have an impact on your progress (and score).  I liked the story and the artwork so much, that I didn't care that the quality of the graphics was not the last of the last. Oh, and I found a little bug that made me have to restart the game (the importance of saving).  Now, the truth is that it is a short game and the only interest of playing it again would be to try to get a higher score. But I am a sucker for this exact kind of game, so I loved it (and replayed it!).",
            "review_score": "1"
        },
        {
            "review_text": "Good game, surely not easy. Puzzles: Some easy, some hard, some extremely clunky. Potion mix puzzles are fun, the timed multi-one in the end not. EXTREMELY easy to remain stuck for a while on a puzzle. Some are even in your diary (and are story related too). Music: Okay but a little repetitive, near the end you miss some music variation. Story: Quite linear with no distraction, good plot. Graphics: Not excellent but acceptable, little amount of character encountered on the story AND mediocre voice acting. Bugs and glitch: I haven't encountered anyone, but a lot of people have, some even gamebreaking.  Final vote: 6/10 A decent puzzle game worth the time to play it but you would maybe prefer to buy in on discount.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very relaxing and fun. The puzzles are great, and easy to get into for all ages. I highly recommend this game for anyone that is looking for something simple and challenging at the same time. If you like to think, this game will do just that!",
            "review_score": "1"
        },
        {
            "review_text": "This was an enjoyable game for me personally, simply because of the puzzles. If you are not an Astrology buff, you'll have to brush up on your zodiac (as I did), but there are also codes of sorts, where you will have to do some translating.   I enjoyed the storyline (who doesn't love a good mystery?). The game is totally on rails, and there are only a handful of active characters and places that you can enter. Voice acting was done pretty well, although the background music can grate your nerves if you get stuck on something. There were several days that I had to quit for the night and revisit later when I could think more clearly, and even so I visited a guide once when I became very stuck.  All in all, this was a well-written story/game.  Edit: Perhaps the most important thing to mention was that I got this game in a bundle, and recommend waiting for it to go on a similar sale, as it can be mildly infuriating at times. It's less so if you didn't pay much for it ;)",
            "review_score": "1"
        },
        {
            "review_text": "It's the same version as the original box game, that's cool !",
            "review_score": "1"
        },
        {
            "review_text": "The game starts nicely enough, and I must commend the artists who have done an excellent job. The renaissance Italy, full of colors and rich in details, provides an excellent and atmospheric setting for the upcoming adventure. Nostradamus, horoscopes (strangely called 'charts' in the game), historical figures, sinister plot threatening the ruling family, all that is very promising and fresh. You can even pose as man or woman according to your wish, and the dialogues play slightly differently, which I found impressive.  However, as the game unveils, its quality starts to deteriorate. The translation is not very good, sometimes you wrestle with an odd expression of unclear meaning. There is absolutely minimal amount if animation in the game - a guard extends his arm, woman throws dice, Nostradamus nods and smiles. At one occasion, you talk to a person over a closed door, which no doubt saved the dev team some time and effort. The late game puzzles become infuriating, especially a particular substitution cipher where you must decipher.. a French text, probably because translating the cipher would take too much effort. The characters are barely legible and sometimes similar, for example the character '-' (hyphen) means three different letters.   The game also suffers from a split personality disorder. One moment you discover a dead body in a room, and are getting ready to open his personal chest to shed light on his murder, but your character refuses - Nah, probably nothing in there. Just another corpse. Without reporting your find, you are suddenly teleported to your home. Nostradamus listens to your report about the murder and then gives you a very important task - to brew a herbal tea, so that you can sleep better. I run back to the castle in the middle of the night, but the drawbridge was closed. Nobody cares. Another dead body? Old news.  The game ends, I imagine, in a moment when the dev team run out of finances, their creditors probably stormed their offices, and started confiscating computer equipment. A duo of a artists have decided to quickly conclude the game with a 20 seconds long cutscene that makes absolutely no sense whatsoever, and that's it, end of story.   'You have finished the game with %d points'.  '%d' is a symbol for numeric value in formatted print. The programmer was probably dragged away by then, so there was nobody to correct the error.   What a pity.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a very buggy game.  Expect to have to manually edit your config.ini if you are on a multi-monitor setup. Also, beware of the rope bug. There is a glitch that will cause the game to come screaming to a halt. My advice: if you see a rope at the forge, DO NOT take it until you need to go into a hole. (Trying to avoid spoilers.)  The graphics are terrible and the astrology stuff is a bit extreme. Don't get me wrong, some of the game is quite fun and challenging. Just beware the bugs, graphics, creepy talking old man, and bad voice acting.",
            "review_score": "-1"
        }
    ]
}