{
    "app_id": 287840,
    "name": "TY the Tasmanian Tiger 4",
    "release_date": "2015-09-17",
    "developer": [
        "Krome Studios"
    ],
    "publisher": [
        "Krome Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Indie"
    ],
    "achievements": 16,
    "positive_ratings": 186,
    "negative_ratings": 37,
    "price": 4.79,
    "description": "The hero loved by millions worldwide, TY the Tasmanian Tiger™, is back! Join TY on an exciting new adventure in the great Aussie Outback. Use your wits and boomerangs to find hidden treasures, help the colorful locals, and uncover the mysteries of the land Down Under.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/287840/header.jpg?t=1460939943",
    "minimum_requirements": "OS: Windows® 7 SP1, Windows® 8/8.1 (32bit and 64bit), Windows® 10 (32bit and 64bit) Processor: 3.0 GHz Intel® Pentium® 4 or 1.8 GHz AMD Athlon™ 64 3000+ Memory: 2 GB RAM Graphics: nVidia GeForce 6800GT or AMD Radeon X1950 Pro (256MB VRAM with Shader Model 3.0 or higher) DirectX: Version 11 Storage: 400 MB available space Sound Card: DirectX 9.0c-compliant Additional Notes: Windows-compatible keyboard and mouse, optional Microsoft XBOX360 controller or compatible",
    "recommended_requirements": "OS: Windows® 7 SP1, Windows® 8/8.1 (32bit and 64bit), Windows® 10 (32bit and 64bit) Processor: Intel Core 2 Duo E4400 @ 2.0 GHz or AMD Athlon64 X2 3800+@ 2 GHz Memory: 4 GB RAM Graphics: nVidia GeForce 9600GT or higher, AMD Radeon HD3850 or higher (512MB VRAM with Shader Model 4.0) DirectX: Version 11 Storage: 500 MB available space Sound Card: DirectX 9.0c-compliant Additional Notes: Windows-compatible keyboard and mouse, optional Microsoft XBOX360 controller or compatible",
    "reviews": [
        {
            "review_text": "TY was a good friend of mine back when i was playing it on PS2 and gameboy and i saw it on steam i didnt have a way to add money so i sold my cs:go skins i did it for you TY and it was worth it",
            "review_score": "1"
        },
        {
            "review_text": "In my gaming generation, everyone played Mario, Spyro, Banjo, Rayman, and so on when they were kids. As a result, everyone looks back at those games with a nostalgic smile. Many of those games are widely loved by nearly everyone.  But not by me. I never played any of those.  What I did have was Ty.  From the very beginning, I've been the type of gamer who plays a small number of games a lot rather than a large number of games a little. An early memory I have is being in the game store. I could only get one game, but I held two in my hands. Rayman, and Ty the Tasmanian Tiger. Eventually, I got Ty. No surprises there.  I absolutely loved it. It was one of my first games, and was my favorite game. I even got my friends across the street into it. I eventually beat it, though I have to admit, it was with the help of cheat codes. I was little, give me a break!  Then I got the second one. Played it a ton, and loved it just as much. I was too young to fully comprehend the way open world games work at the time, too, so I progressed through the game just by wandering around, doing whatever missions I stumbled into. However, I never finished it. After a while, I just got tired of it and stopped playing. I moved on, played other games, different consoles, and all that kind of stuff.  Then last summer I decided to boot it up again. It was time to beat it. Now that I actually understood the way open world games worked, I easily found the remaining missions. How many were there, you ask? Two. TWO! I had wandered around so much that I had only left 2 missions uncompleted! I don't remember the mission's name, but then the final Boss Cass fight. I wanted to make it a summer project, of sorts, to replay both Ty1 and Ty2 from start to finish during the summer, but unfortunately, it never happened.  As far as the third game goes, I unfortunately never owned it. My friends did, though I barely played it.  Then, I recently noticed this game on Steam. I had all but forgotten about Ty, but man, did it awake nostalga, especially the video of Ty playing his theme. How could I resist buying it, regardless of it being 2D instead of 3D?   --End of Nostalga--  --Begin Review--  To the game itself, it's great, but a bit short, in my opinion. I beat it in about 5 hours, though I didn't do all of the side quests, get all the collectibles, etc... though I did take care of most of them.  The Good: +Ty! +Great soundtrack +Great level design +Combat is fair, 95% of the time I take damage, I know its my fault. +Good assortment of boomerangs, all with their pros and cons. +All of the elements from the 3D games still work really well in 2D.  The Bad: -No voice acting. I mean, yeah, I rememer most of the voices and can do that bit in my head, but it's not the same for obvious reasons. -With some 'rangs, the pros drastically outweigh the cons. This makes some useless aside from utility. Why would I use the flamerang, which can one shot enemies that normally take two, if I can use ones that freaking EXPLODE? Though it still takes 2 hits, the splash damage is more than a worthy trade off. I'd like to see uses in all of them, even the default. -Somewhat tedious to switch between 'rang types quickly. This would likely not be a problem if we are able to arrange the order the 'rangs are in the menu manually to get a custom lineup rather than be stuck with the order we got them in. The ability to switch to specific 'rangs with a custom keybind would be even better.  The Ugly: +-Underwater flamethrowers? Really? I can't decide if that's hilarious or downright stupid. I honestly can't. +-Yeah, that's about it, really. I just had to put that bit about underwater flamethrowers somewhere.  Conclusion: Though I listed numerous downsides, they are minor, and don't detract from the game very much. All in all, I rate this 9/10! That's really saying something, as I'm not much of one for 2D platformers.  So yeah, if you're a fan of Ty, or just really like 2D platformers, give this game a shot!  If Krome makes enough money on this to be able to port the first 3 games, you bet your FACE I'm buying all three!",
            "review_score": "1"
        },
        {
            "review_text": "Interested in seeing some gameplay? see below!          YouTube™ Video:  Save the Kids, Possum! - Ty The Tasmanian Tiger 4 By The Cover&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia made me buy the game. The trailer made me drop a tear. I expected the best, or worse for that game. But I was thinking ... Come on! I will show them how much they have influenced my childhood in the right way, and buy it to support a more ambitious project!  Otherwise, the game itself is pretty good despite some fluidity lacks a few times. Especially in movements.  Otherwise the backgrounds are beautiful and there is detail. The aesthetics in general is rather successful.  The shop for costumes and boomerangs, is classic.  I'm waiting to see if the team will be able to invent something good after all this time. And I wonder how they are going to bring back this great hero of my childhood.  Maybe if it was available in Smash Bross, to make himself more known by the new generation ... this may sound crazy. But I think that would be better than advertising where he massacres all video game mascots XD (I liked that commercial)",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game, bringing back an old classic! Reminds me a lot of the good ol' days, when I played games like Crash Bandicoot and Ty the Tasmanian Tiger on my good old Xbox. I really wasn't expecting any new TY game anymore. Ever. I didn't even know the original creators (Krome Studio) still existed. The old three Ty games were 3D platformers, but this one has the graphics and gameplay style of games like Rayman Origins and Rayman Legends, where Rayman also got a make-over from his classic 3D platform gameplay. I have to say, I love the graphics and music in this game, it's very beautiful and everything runs smoothly on 60FPS. Also there's a lot of content in this game, that will keep you busy for a pretty long time. There's 40 levels, but these are all very big and well developed levels, which takes you about 10 minutes to complete for each level, if you just rush through them. Then there's also hidden collectibles you can find scattered through every level. And on top of that there's also minigames hidden in each level like Time Attack or 'Kill as many enemies as quickly as possible'. There's also a currency in the game (opals) which you can exchange for new boomerangs with special powers, or a dozen of skins/characters to play with. This game will surely keep you busy for a while, and I can say it's definitely worth that 5-6 euros! I would even pay 15 or 20 for it. Now, let's hope for the return of the first three games on Steam, especially my favorite, the second one. :)",
            "review_score": "1"
        },
        {
            "review_text": "Ty the Tasmanian Tiger was my childhood, man. While this game isnt quite the same as the original PS2 games, it's still one hell of a fun trip down memory lane for me. Krome, please port the original trilogy over to Steam, or even PS4!",
            "review_score": "1"
        },
        {
            "review_text": "Can't believe he's back. TY has always been one of my favorite childhood games (being the first game I had on Xbox). Although the game takes the 2D perspective compared to the 3D design of the three previous games, that doesn't mean it isn't as fun. It is just as fun as the predecessors. Gameplay is fun and it's great to see all the original characters back but is kind of disappointing with the lack of voice actors. Still, a very fun game for those who have played the previous games and those new to the series. Hopefully, Krome Studios will make the HD Colleciton of the first 3 games that we have been waiting for.",
            "review_score": "1"
        },
        {
            "review_text": "great game especially if you love the ty series",
            "review_score": "1"
        },
        {
            "review_text": "The amount of nostagia is unbelievable, I recommend this to anyone who has enjoyed this series in the past. This game doesn't have the amount of potential as its predecesors, however, each purchase helps provide the company more funds to create possibly a game equal to the previous games.",
            "review_score": "1"
        },
        {
            "review_text": "I've been waiting for A 4th TY game for far too long and im not disapointed at all.  If you like TY, Australia or Boomerangs then you'll like this game.  And i'm hoping that there will be HD remakes of the original 3",
            "review_score": "1"
        },
        {
            "review_text": "Very clean and polished. Looking forward to more TY projects in the future!",
            "review_score": "1"
        },
        {
            "review_text": "A servicable 2D platformer in a series of servicable 3D platformers. Nothing special, but not bad for a six dollar game, although I paid three for it.",
            "review_score": "1"
        },
        {
            "review_text": "rip 3D classic ty  rip short story  Would rather play the classic 3 than this, but it was still an 'ok' game",
            "review_score": "1"
        },
        {
            "review_text": "Great game not in 3d but still good.However, it's not as good as the last three but you can help by buying this one so krome studios can put those last three games on steam and maybe they'll get enough money from the sales of all of these games to make a fifth ty the tasmanian tiger.DO IT FOR YOUR CHILDHOOD!",
            "review_score": "1"
        },
        {
            "review_text": "ty the tasmanian tiger 4 is a good platformer so far i will be honest though i never have played ty before so i never know what this game is about. but iam glad i did.  graphics very good very cartoony it gets a 9.5 sound apart from lack of voice mode musics still good it gets a 9. gameplay it take awhile to get used to the game it gets a 9.5 recommend",
            "review_score": "1"
        },
        {
            "review_text": "Out of all the Thylacine in the world right now Ty is my favorite.",
            "review_score": "1"
        },
        {
            "review_text": "There are few games that I have been so let down by. It works fine, but the only thing it made me want to do was play the original games.",
            "review_score": "-1"
        },
        {
            "review_text": "The biggest downside to this game is that there isn't enough of it. The game is so short, and if I wasnt lost on how to kill the crabs to beat a level (you have to use power attack to stun them, then attack them to finish them) I would have finished the game in 4 hours.  The game is pretty fun and nostalgic, however you are probably looking to get 3-5 hours on this game to beat the story. There are several bugs and quality of life changes that they could have made to make the experience better.  1) When dashing under water, when you rise to the top you will dash in the direction that you are looking and you will be stopped for around 2 seconds and are unable to do anything.  2) Not sure if this is intended or not, but you can spam your power attack in the air while moving to basically move in a horizontal line, this is different from the intended slow fall mechanic in the game.   3) Clipping onto ledges and dropping down from platforms feels very clunky and could be improved upon.  4) Most of the mobs are one-hit-one-kill, and I did not see a difficulty option. The game was way too easy to just run through and just spam your boomerangs just one shotting everything.  5) The objectives to actually complete the level arent stated anywhere other than in the text at the beginning of the level, which most people skip anyways. If you press escape it shows you the bonus objectives that you can complete, but not the main objective that you must complete to go on to the next level. Going along with this, the quest objectives where you go and turn the generators on shows you the path that the game wishes for you to take, and it does not adjust if you have already gotten the generators. It will point you in the direction of a generator that you have already found. The arrows that appear over your head in this situation will point in the completely wrong direction and it is quite frustrating.  I was wondering why they made this game a platformer, and after the countless hours of fun that I had playing it when I was younger on the ps2, I'm left to be disappointed by the lack of gameplay that there is in this game.   I would say if you want to spend 6 dollars for around five hours of fun, then go ahead, but I wish that I had not.",
            "review_score": "-1"
        }
    ]
}