{
    "app_id": 288040,
    "name": "Actual Sunlight",
    "release_date": "2014-04-03",
    "developer": [
        "WZOGI"
    ],
    "publisher": [
        "WZOGI"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "RPGMaker"
    ],
    "achievements": 1,
    "positive_ratings": 364,
    "negative_ratings": 106,
    "price": 3.99,
    "description": "Take a walk on the thin line between hope and despair in Actual Sunlight: A short interactive story about love, depression and the corporation.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/288040/header.jpg?t=1535306169",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Pentium III 800 MHz Memory: 512 MB RAM Graphics: 1024x768 High Color + DirectX: Version 9.0 Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Jesus Christ. I need to work on my resume. Eat right. Maybe start a blog. Write a novel. Hell, anything but keep moving forward on the same path.  The main character even LOOKS like me.   ",
            "review_score": "1"
        },
        {
            "review_text": "Buyer be advised: 'Actual Sunlight' is basically a visual novel... and I don't mean the kind with fan-service cheesecake tossed in (unless you're into flabby white guys). There's almost no traditional gameplay in it. You play it not for 'fun', but rather for an emotional experience and perhaps for some insight into the psychology of depression.  If you're still reading, then maybe you're open-minded enough to get something out of this game. You play as Evan Winter, an overweight white-collar drone who tries to bury his loneliness in video games, daydreams, and misanthropy. Gameplay consists of guiding Evan through a few days in his overly routinized life, interacting with other characters and environmental objects in order to trigger Evan's dark and sardonic commentary (the game is  very  text-heavy). As the game progresses through its roughly hour-length, Evan's depression becomes increasingly severe. There is only one possible ending no matter what choices the player makes along the way. And with a name like 'Evan Winter' ... brace yourself.   One of the things I liked the most about 'Actual Sunlight' was how the developer took advantage of the unique features of video games as a medium in order to convey Evan's psychology in a visceral way. The graphics are mostly flat, basic, and bland; environments are constricted; and the narrative choices given to the player are ultimately illusions -- exactly how Evan feels about his own life. Which is not to say that 'Actual Sunlight' asks you to  agree  with Evan's worldview, but rather to take a walk in his shoes as a cautionary tale. When the game is over, the player must do something that Evan also does every day: put down his/her own controller, return to 'real life,' and ponder the choices that they may not have even been aware that they were making. The difference is that we have Evan's example to learn from.  Sounds like a party, right? ;) Buy 'Actual Sunlight' if you are looking to think and feel more than to 'play,' and if you are capable of handling dark subject matter. It took me a couple tries to get into it, but ultimately I'm glad that I did.",
            "review_score": "1"
        },
        {
            "review_text": "  I would not recommend it, though Im not saying that this is not a good game.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this hoping it was a mature look into depression and how people deal with it. And it could have been that. Instead, this software -- I cannot call it a game as you are not allowed to make any decisions whatsoever -- is a short story about a depressed 30-something on his last steps to the end. You never learn really how he is trying to deal with his depression or if he even tries to. The interactions you have with other characters are limited to short texts where you cannot choose your answers, and get bombarded by the wall of text instead.  I strongly advise against purchasing this. The story is an absolute downer and there is no gameplay other than pressing the button to get to the next scene.  While the presentation as a pixel game with good music works, the message -- if any -- is completely lost. If you want to learn about depression through the medium of games there are far better choices.",
            "review_score": "-1"
        },
        {
            "review_text": "I played it quite a lot time ago. I don't actually know if it has changed or not, But I couldn't help myself buying it.  It's just a beautiful game, just a beautiful story that I loved since the first time. I played it in a single session, in the dark of my room and when I finished it I felt something different, I felt actually pretty happy, for what my life is and what I have, and I think that that's what the creator wanted the player to feel, and, I repeat, he got it all right with his meaningful and sad story. If you played To the moon, you'd have ad idea of what type of game you're buying, but it doesn't actually matters.  What matter is if you want the creator to tell you a story about mental illness and what comes with it because, in that case, this is a game for you, and I'm sure it'll get you deeply. A pretty little perl in the indie ocean. Everyone should try it. :3",
            "review_score": "1"
        },
        {
            "review_text": "I played this game directly after Depression Quest because from what I read, they're very similar. Actual Sunlight does have more interaction involved though.   This game follows the thoughts of a man named Evan Winters, who clearly suffers from depression. He talks about things that a lot of us think about. He's stuck in a rut and working at a job he hates. He makes the excellent point that society is constantly telling us that our lives are what we make it, but that few bring up how there's lack of opportunity to actually change things. Being stuck in this situation, he succumbs to dark, sad thoughts.   Like Depression Quest, it is strongly advised that a person with severe depression and/or suicidal thoughts not play this game. However, it can offer a different perspective for those who wish to understand what it's like.  Issues with the game: It's too short.",
            "review_score": "1"
        },
        {
            "review_text": "A powerfully moving game, funny and tragic, taking on the issues of depression and suicidal thoughts in an honest way that affected me greatly.",
            "review_score": "1"
        },
        {
            "review_text": "Recommend this to anyone who has suffered from depression. ANYONE GO PLAY ACTUAL SUNLIGHT",
            "review_score": "1"
        },
        {
            "review_text": "I was expecting more than what I got. Also, the message it sent... wasn't really something I needed. Or anyone, for that matter.",
            "review_score": "-1"
        },
        {
            "review_text": "Well written, relatable game about depression. Was totally worth the time &amp; money. Grafics are fine, soundtrack too. I really liked the few moments of interactive storytelling in the game.  The animations could be better (people who are standing still have a walking-animation).    Prepare to read a lot and a lack of gameplay. But that's totally okay for this type of story.",
            "review_score": "1"
        },
        {
            "review_text": "I write this from the perspective of someone who's been carrying a diagnosis of major clinical depression, ptsd, and anxiety disorder for as long as I can remember. Actual Sunlight feels like someone wrote a game about my life. It's possible I only like this game as much as I do because of how I relate to it, but I think it's much more than that. It only took me 100 minutes to finish this, so keep that in mind when deciding on your purchase, but it's one of the most beautiful and meaningful games I've ever played.  The visuals are deceptively charming for such a somber game, the writing shifts from beautifully depressing to downright funny, and it's complimented by a nice soundtrack and some great CG illustrations. There's individual writing and descriptions for nearly every object and interaction in the game, and the gameplay compliments the narrative through the choices it allows you. I really started to empathize and relate to the character, and I think this would be true even if I didn't have the life I do.  Obviously the subject matter is quite sad and hopeless, but the authors own commentary on it is anything but. He's quick to point out that this is more of a biography than anything, a portrait of a stage in his life, but the fact that this game was even developed and released proves that there is hope to be found. It shows that you can move past depression. No matter how you find it, Actual Sunlight is out there.",
            "review_score": "1"
        },
        {
            "review_text": "If you're currently going through depression I would not recommend this game. However, if you've battled it - and are in a good place - you should be able to get through it, though it could trigger a moment or memory that might upset you. I really enjoyed Actual Sunlight, the struggles Evan goes through are real every day struggles that people can relate to.  - Down below is a bit of a spoiler. I think. -  One thing that I'm glad was included in this game was the out-of-control anger scene. I think that people who haven't experienced depression may only think that depression is about feeling sad, hopeless, and having suicidal thoughts. The commercials never say anything about the anger that happens. How it literally takes over your mind and you sometimes can not control the things you say or do when it grabs a hold. The regret afterwards is always heartbreaking.",
            "review_score": "1"
        },
        {
            "review_text": "Holy hell! What a depressing game.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes you feel more human, but ultimately less human.",
            "review_score": "1"
        },
        {
            "review_text": "This is the worst game on Steam.  This is a game about suicide with zero player choices. All characters and events are attempts to reinforce a false reallity to the player. This is the worst case scenario of a depressed mind assuming what it thinks is true and trying to convice you that it is.  If you have drepression, this game will make it worse. If you do not have depression, this game will give you a false sense of what depression is. The dev is trying to hurt you and spread his own misery.  Turn back, there is only hate here. Hate and suffering.",
            "review_score": "-1"
        },
        {
            "review_text": "I went through a period of severe depressions some years back, so i found myself relating to various things presented here. I really liked the art for this game, enough to want to get cards for it and maybe check out the artist too. There's not much in terms of gameplay, i would compare it to adventure games, visual novels, you walk around and examine and read. I wont beat around the bush, this game is a damn sad tale, and could kill your mood if you aren't prepared for it. On flip side it may help some idetify their bad habits old or new and just look at them and relate. I thought it would be a longer haul to the end of the story, but i still found it interesting no less.",
            "review_score": "1"
        },
        {
            "review_text": "'This game: Is a Portrait' This game is like described full of depression. You play a Man that hate his life. You will continue the game in map parts, where every object or person has a story. Like: You will talk to a woman, but then you will get a dialogue where you once talked with an doctor, where your are an patient be. You will get in a very depression emotion, because you will read things, that happen today in real life. The dialogue will shown like were you was younger, 13 or 14. You are scared of somethink. But ther are too dialogue of elder people, what happens when you lost somethink in your life. What happens when you dont do anythink. After 20minutes of gameplay, reading some of the dialogue full of depresion, im almost done with it, because ther are too many storys and dialogues that happen to me too, and I throught already too about it. I will rate it 10/10 because ther will shown all depressions, that people have. All in one. You should only play this, when you can go around with things like that. It's also not realy a game, it's more like a open book. A human experience of depression.",
            "review_score": "1"
        },
        {
            "review_text": "i feel like i should've felt sad or moved or something but i couldn't because i agreed with almost everything it said and maybe that's the saddest thing of all",
            "review_score": "1"
        },
        {
            "review_text": "An excellent example highlighting the negative effects of consumerism has on the weak, and comes to shine with the $5 price tag.  Don't waste your time.",
            "review_score": "-1"
        },
        {
            "review_text": "Actually I loved to play this game, but its nothing for people who need action or an impulsive story. This game is build like a comic, which is leaving you some decisions, which are all leading to the same. I enjoyed the lovely small story and it creates some deep feelings. Only buy it if you are interested into reading a story instead of playing a game.",
            "review_score": "1"
        },
        {
            "review_text": "short story but a good game overall",
            "review_score": "1"
        },
        {
            "review_text": "Wow. This game is very hard hitting. Especially the ending. I have never had a game leave me with this feeling before. Must have for any one who likes emotional, story based, depressing game.   Honestly, I give it a 9/10 Definetely worth the $5",
            "review_score": "1"
        },
        {
            "review_text": "Actual Sunlight is the living proof that video games can tackle more personnal and mature issues than the usual power-fantasy metaphore you can find in most games.  Depression, suicidal thoughts &amp; the grim reality that can lead to them are well explored even if the short lifespan of the title doesn't allow for a deep analysis of each of those elements. The game is not flawless and can sometimes feel a bit too unidimentional in its depiction of the mental disease that constitutes its main subject but its well written story and delicious sense of humor more than compensate for it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so incredibly well written. It captures the things people with this sort of depression go through on a day to day basis, I think it's a great way to help other understand what we go through if you're like me and have trouble putting it into words. If you know anyone like that I would sincerely urge you to give this game a play, it's not very long but it speaks volumes about the struggles in day to day life for them.",
            "review_score": "1"
        },
        {
            "review_text": "Game is too short, reminds me of the Stanley Parable, only about actual life, not video games. Kind of annoyed that I couldn't kill myself sooner. The corporate bit was amazingly good. Could have used a lot more of all of it.  Anyway, good stuff.",
            "review_score": "1"
        },
        {
            "review_text": "The game Depression Quest desperately wants to be.",
            "review_score": "1"
        },
        {
            "review_text": "It was an interessting lil 'game'. More like a visual novel. A lil bit touchy sometimes. It's short but was worth the money ( in sale) for me but I could understand when some people maybe expected a lil bit more.  Edit: Even after one year I still think about this game and the emotional ride it gave me. Edit 2: Even after two years I'm still impressed. One of the best games about depression and suicide.",
            "review_score": "1"
        },
        {
            "review_text": "It was an interesting experience that made me a little bit uncomfortable, which was the intention of the developer, but I don't feel like the price tag was worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Never before has a game sparked such a huge emotional reaction. Evan Winters is just your everyday guy, but what makes him special is that theres something of him in everyone of us. The worthlessness and misery that Evan feels every day is something that everyone has felt at least once in their lives. You not only feel for him, you feel what he feels as he goes about his day-to-day life, basking in his miserable and meaningless existence.  Thats what makes this game so special. You feel such a sense of hopelessness and misery, but you just want things to work out for Evan and no matter how much he tells himself or you wish it for him, hes doomed to be stuck in his cycle of misery forever and ever. You as the player just want to help him and pull him out of the darkness, but in reality this isnt a game where you are the brave hero. You aren't some noble protector, saving the people from villainy. You are just a man living out your doomed existence. Actual Sunlight deals with some really heavy themes relating to depression and suicide, so if you are suffering from one of these issues, I wouldn't reccomend immersing yourself into this world too much. If you feel like you need to talk to someone, contact lifeline on 13 11 14",
            "review_score": "1"
        },
        {
            "review_text": "Way better than that other game. What was its name again? Cant remember... The one with the attention seeker pseudo-feminist that sparkled the whole gamergate... whatever, doesnt matter. This game here is actually pretty good. Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "This is a terrible 'game' and whilst there is the tacked on 'interactive story', it's not actually that interactive.  I don't see or understand why this is being pushed as 'the hardest hitting game on depression ever!11!!11' like Kotaku. This game is clearly not about depression but rather Narcisstic Personality Disorder. If you identify with the character then you probably should consider Schema Therapy.  There is nothing redeeming about the character, infact I'd go so far as to say you'd be better off reading Catcher in The Rye for a similar affect.  We've got a duty to support game developers because otherwise all games would be terse FPS clones - this interactive story is awful and not worth buying for more than £1.50 or whatever the equivalent is in your local currency.",
            "review_score": "-1"
        },
        {
            "review_text": "edgy (good though)",
            "review_score": "1"
        },
        {
            "review_text": "A compelling look at what causes people to feel desperate.  A fantastic piece of work, yet a very dark one. Shy away if you are in a hard period of your life.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very powerful videogame",
            "review_score": "1"
        }
    ]
}