{
    "app_id": 288140,
    "name": "Jack Nicklaus Perfect Golf",
    "release_date": "2016-05-03",
    "developer": [
        "PERFECT PARALLEL"
    ],
    "publisher": [
        "Perfect.Golf, Inc."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Workshop",
        "In-App Purchases",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Sports",
        "Strategy"
    ],
    "tags": [
        "Golf",
        "Simulation",
        "Sports"
    ],
    "achievements": 28,
    "positive_ratings": 410,
    "negative_ratings": 264,
    "price": 26.99,
    "description": "Jack Nicklaus Perfect Golf is a next generation, indie developed, single player and multiplayer golf game. Jack Nicklaus Perfect Golf provides a truly immersive experience centered on stunning visuals and hyper-realistic game play. Don't just play golf - play PerfectGolf!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/288140/header.jpg?t=1476114959",
    "minimum_requirements": "OS: Windows XP Processor: 2 core duo E8400 @ 3.00 Ghz. 3.00 Ghz Memory: 4 GB RAM Graphics: DX9 compatible video card with 512MB video RAM DirectX: Version 9.0 Storage: 3 GB available space Sound Card: DirectX 9.0c compatible Additional Notes: Windows XP requires Unicode to display in menu arrows.  Also at minimum spec settings low graphics quality setting must be used in main menu",
    "recommended_requirements": "OS: Windows 7/8.1/10 Processor: Quad Core Memory: 8 GB RAM Graphics: GeForce GTX 770 DirectX: Version 9.0 Network: Broadband Internet connection Storage: 3 GB available space Sound Card: DirectX 9.0c compatible Additional Notes: DirectX 11 Compatible",
    "reviews": [
        {
            "review_text": "Rediculous! You want me to pay 150 bucks for a season pass? WTF? There is absolutely no depth to this golf game. No real way to judge the apropriate striking power for a good shot and the controls overall are just 'thick' and 'clunky'. So disappointed, there is not even a career mode and no skill tree to follow or upgrade your golfer. No options to obtain newer better clubs or clothing, no sponserships, no, no, no, no!!!!!!! NO!",
            "review_score": "-1"
        },
        {
            "review_text": "Pro:  UI got better since early access, Beautiful graphic Can use 3 clicks input  Cons:  Badly optimized game...  Performance did not change much since Early Access Clipping problem CPU hog Still using worst game engine available on the market... aka Unity. ",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste your time or money.  Each 'patch' breaks more and more, (edited to say...) and more and more and more.  Poor physics, broken swing meter, yardage that is way off, flashing textures on objects, and hilarious devs that forgot that this is supposed to be a game.  A fractured multiplayer community since the OGT site competes with the Lobby for players.  Go play TW2008 or Links 2003... more fun, no headache.  Oh, and 'Course Forge' public beta has finally been released. Read EULA...",
            "review_score": "-1"
        },
        {
            "review_text": "I am glad i only paid 20.00 for this game . So i decided to try the golf club game and it blows this away you can sigh up on the tgc tour. Same clubs for all and they use the handicap system . On the tgc tour you can start out in q school and play to get your pga card",
            "review_score": "-1"
        },
        {
            "review_text": "can't download game -crashed -26-08-08_063552! don't waste your money until problems sorted  .",
            "review_score": "-1"
        },
        {
            "review_text": "Game needs ALOT of work.if the tec's get to work on up dates then buy it; but deff'' not now!! not worth the bucks !!!!!!! I paied $19.99 for it last week an feel riped off and now I can't recieve a refund for it. I prob'' should of bough a golf game for PS-3 come on update game fix swing meter lagsssssssss real bad",
            "review_score": "-1"
        },
        {
            "review_text": "fix your swing gauge. It is crap. As it is this game is not worth the money. Free maybe.",
            "review_score": "-1"
        },
        {
            "review_text": "Having played this game for 93 hours, mostly match playing with a friend who lives overseas, I can honestly say it is a truly amazing experience. I played golf for 35 years until health issues 4 years ago and have found this game as close as it can be to the real thing. For me it is a 10 out of 10 game.",
            "review_score": "1"
        },
        {
            "review_text": "First look...  30+ hours.. The game has flaws... but they dont appear insurmountable... I play on pro difficulty, 3 click. There is one tier higher 'Tour pro' that adds to the penalty of not hitting it pure...  I find it very challenging... It reminds me of the Jack Nicklaus series 5 or 6. Putting requires some work to read the greens as it should. Mis-hits pull/push are about right to make you pay for bad shots. I would randomize the number they show for power loss to make bad lies less predictable like have it say 'power loss 5%-15% so you cant exact math the shot.   Customer service on the website is bad. I have had a support request in for over a week to get validated on the forum, no reply...   But I'm rating the game with my 'reccomended'. If you have been looking a golf sim, not a golf arcade. This will fit the bill.  Game at this stage 7 of 10...   They need to release the course forge without having to pay $249 for a season pass. Not sure if that is thier intent. But it will be a loser if they do.",
            "review_score": "1"
        },
        {
            "review_text": "If I could give it a MIXED score that is what I would do. I resisted the urge to cane it with a negative earlier, instead waiting to see how the games evolved first. Sorry to say that I will also do some comparisons between other golf games as well.  THE GOOD  - The graphics are nowhere as bad as some reviewers describe. On course they are finer than say The Golf Club, I have grown to like the courses.  - Hard on the fairway as well as the green. In The Golf Club I hit almost 99% of the fairways; with Perfect Golf I am lucky to hit 70%.  - Greens are 'fairly' realistic. Perfect Golf has much better green dynamics than The golf Club's ice puck surfaces (which is entirely where games are won or lost in that game).  - Has come a long way since Early Release.  THE BAD  - Not sure what the season pass people are going to get for their money? But if they get value it will mean the rest of us will be stranded with a 75% complete game.  - On line play still has a long way to go before it reaches Tiger Woods 2007, which is where PC On line golf achieved its pinnacle. Sad to say we had a better on-line game almost 10 years ago.  - It feels isolated, there are no active seasons, or competitions (one token tournament) or any attempt to group players by skill level. I know these next comment are outside the control / influence of the game developers - but in The Golf Club there is TGC Tours which is well run and builds that sense of community. The same is trying to happen with Perfect Golf with GolfOnlineTourNet, but is a long way from polished and even the hacker league is won by people scoring -40 under.  - Dubious wind physics, while head and tail winds make a difference, I rarely bother adjusting for side winds.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! I really enjoy the feeling of being on an actual course instead of a static image of a course. The play is more realistic than what I was used to in my previous golf game and the physics are much more believable in ball flight, roll out, bounces, etc... Yes, I think the game still needs some polishing. There are not any gamebreaking bugs that I have run into with the game. Mainly just the lack of content like different avatars and clubs, career mode, and some camera work. The amount of well made courses by both PP and the community is great. Being able to play 8 player ALT shot as well as a lot of different modes is also nice. Overall, very pleased with my purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Lovers of golf will enjoy this as it is true to the game. No BS effects, explosions. cloudbursts etc just a real golf game. Just like the real thing, don't expect birdies and eagles every hole. If you want to sit down, have a real golf experience in your lounge room then JNPG is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game great graphics , but beware very demanding on the pc .",
            "review_score": "1"
        },
        {
            "review_text": "I played this when it first came out of beta and was very dissappointed and actually got a refund. It clearly was released before it was ready. I tried it again though and wow it's so much better. This hands down is the best PC golf game available. If you like golf you need this game.",
            "review_score": "1"
        }
    ]
}