{
    "app_id": 288470,
    "name": "Fable Anniversary",
    "release_date": "2014-09-12",
    "developer": [
        "Lionhead Studios"
    ],
    "publisher": [
        "Microsoft Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Classic",
        "Adventure"
    ],
    "achievements": 50,
    "positive_ratings": 4036,
    "negative_ratings": 1119,
    "price": 26.99,
    "description": "FOR EVERY CHOICE, A CONSEQUENCE.Fully re-mastered with HD visuals and audio, Fable Anniversary is a stunning rendition of the original game that will delight faithful fans and new players alike! The all new Heroic difficulty setting will test the mettle of even the most hardcore Fable fan.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/288470/header.jpg?t=1542842315",
    "minimum_requirements": "OS: Windows 7/8 Processor: Intel 2GHz Core2 Duo / AMD Athlon 64 x2 2.4GHz Memory: 3 GB RAM Graphics: Radeon X1800/ Nvidia GeForce 7600GT DirectX: Version 9.0 Storage: 10 GB available space",
    "recommended_requirements": "OS: Windows 7/8 64bit Processor: Intel Core2 Quad 2.33GHz Memory: 4 GB RAM Graphics: Nvidia GeForce GTX 260 DirectX: Version 9.0 Storage: 10 GB available space",
    "reviews": [
        {
            "review_text": "While this is a 'Remastered' version of the original X-Box Fable, gameplay elements certainly aged. You will notice the story has no pace at all and things just happen too quickly in cutscenes. Combat is all about mashing the attack button.  However the game is unique and still has its charm. Lots of silly fun can be had with it.  If you are into action button mashing games and open world RPG, then I recommend to get this game when it is on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I see why people might not like it, but for a person who really liked Fable 3 (got into the franchise there), I like this game so much more. After playing this one for 25 hours, I tried to pick up Fable 3 again, and wow I just realized how bad that game is. If you liked any of the fable games, this one will be a good addition to your collection.",
            "review_score": "1"
        },
        {
            "review_text": "Fable Anniversary is a 'HD Remake of the Original Extended Version Fable: The Lost Chapters.' Keep in mind it is the 'HD Remake' not 'Fable 4.' So many people are giving this game a bad name for the wrong reasons, its been 10 Years since the release of the original game and to celebrate Lionheart have done a HD Remake of their game, of course it will run the same.  Now lets talk about the gameplay. Fable Anniversary has been masterfully re-crafted the original Fable with beautiful textures. Its absolutely stunning, I could not help myself staring at the landscape while being ganked by couple of those filthy hobbes and bandits. The game ran smoothly for me and could not help myself reminicise good moments when I was playing Fable TLC. Combat system is still fantastic like its predecessor although some of the enemies I thought were just cheap and annoying. The NPCs are still funny and a tad stupid like one time I just went to the Bowerstone Inn for a Quest when random villagers kept applauding and laughing at me when I was trying to have a chat with a Quest Giver. The story for me is still excellent and lovely. Pretty much my experience with this game have been awesome the only problems were some of the bugs that were initally on before the update. Controls for the PC are a bit strange and would personally recommend controller. Now everything is great. Even though the game might not seem new this game has 'mods' which will definitely have some bonuses.   So overall, this game I would recommend to people, even though people might say this game is trash it is their opinion. For me I love this game and is a great HD-Remake Port for the PC.",
            "review_score": "1"
        },
        {
            "review_text": "If you've never played any Fable before, get this one! Easily one of my favorite games of all time.  Highly Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "I do very few reviews-normally only on games that I feel strongly about. As far as Fable Anniversary goes, save your money. Especially if you already have the original version, if you don't just spend the 10 dollars and buy the original instead of throwing money away for this 'paint job' as most are calling it. The game runs smoothly with very few bugs that I've run across yet, got stuck in a wall once, rolled into a rock and got stuck, couple of game crashes- nothing major since the game auto-saves for you quite often. However, it is still the original game! Nothing has been added besides a few extra colors, sure it looks pretty that your shadow now follows the lighting properly but most of us don't really care about that beyond the first couple 'ooohs' and 'ahhhs'. The extra colors add a few more hues and textures but nothing mind blowing or game altering especially since most of the maps are darker toned anyway. All the in game movements of the characters, both your own and npc's, are blocky and out dated. The original game itself is still great and in all honesty with this play through I really haven't noticed anything that was worth the money I spent on the anniversary edition even at 50% off with the holiday sale. I have a feeling the developers were just looking for a way to make a quick buck with little work. Now that my ramble is done here's my point again: DO NOT BUY THIS VERSION OF THE GAME UNLESS IT DROPS BELOW THE ORIGINALS PRICE!",
            "review_score": "-1"
        },
        {
            "review_text": "Miss lionHead Studios ....",
            "review_score": "1"
        },
        {
            "review_text": "Well, I've been thinking about buying this game since quite some time now and I have to say that I don't regret it even one bit. I always loved Fable, it's probably the game I've played through the most (like 8 times now), it's one of my favorite games of all time and it was a part of my childhood. I played the original version on my old Xbox and I played The Lost Chapters on PC. So I think you realize by now how hyped I was for a remake. But despite all of that I always hesitated buying Anniversary, because of all the negative reviews about how buggy it is and such. Well, after my playthrough I can freely say that I didn't encounter a single bug and I didn't have any issues at all. That's why I could have an awesome experience with Fable yet again and I could re-live my childhood to a certain degree. My point is that you should buy this game, because it's hell of a lot of fun, it runs smoothly (even on not too good computers like mine) and because it looks amazing compared to the old game. If you're a Fable fan don't hesitate to pick it up and even if you're not a fan you should consider buying it, but you might want to wait for a sale because 32 euros kind of are a bit too much, eh?",
            "review_score": "1"
        },
        {
            "review_text": "Fable Anniversary - Sentiment and memories in HD.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of people are salty about this release, I get it. The Lost Chapters  (which will be TLC from now on, go ahead and take a moment to load up Waterfalls on youtube)  kept the faithful graphics that give it more of an edge, a grittier organic feel and the price difference is almost absurd.  But don't go chasing those waterfalls just yet. On a Chinese based website hosted on American based webspace ('g' two 'a' .com) this game is actually less than TLC, because of demand a lot of private sellers are able to sell this game for less than eight dollars, TLC is selling for just under nine.  So about my experience; I grew up watching my friends play this game when I was young. When it was originally released I was 13 and I didn't own an xbox. Many sleep-overs were spent watching my friend's epic adventures through Albion, at the time the game was pretty groundbreaking.  Now 12 years later I am finally experiencing the game from the pilot's seat, damn does it feel good.  The graphics are great for its age, the worst part of the remake being the camera which didnt quite survive the tinkering process; it is a little wobbly but I got used to it after an hour. Like I said I never really played the Fable games for myself in the past so I do not need the older graphics for nostalgia reasons but it would have been nice to have the choice to toggle between old and new.  So since the price between the games are so close on that Chinese site, I can only say that either one will satisfy you, just get the one that you feel makes the most sense to you and please stick to the rivers and the lakes that you're used to.   R.I.P. Lisa 'Left Eye' Lopes ",
            "review_score": "1"
        },
        {
            "review_text": "This is quite possibly the worst port I have ever experienced. Most of my time has been spent figuring out how to use the inventory menu (mostly because I kept trying different things to use the mouse cursor, but it was all in vain). This port is so lazy they translated A and B from the controller to the keyboard for accept and back. All clicking seems to be disabled, for a game that has had multiple ports I expected them to at least copy paste the pc controls from the last ones but they couldnt be bothered to even do that.  Final score: 0/10 - same as the effort they put into the pc version.  Edit: eventually the mouse thing was fixed. kind of. This tricked me into giving it another chance which was fun until the side quest 'bandit spy extraction' the quest bugged, its impossible to progress and there is no abandon quest feature in this game, i have to either finish the quest (impossible) or reload to before it happened, but because the game already resaved both the auto save and checkpoint save slots my closest save is now 3 hours before i took the quest. effectivly ending my entire 9 hour game playthough.  Final Final score: -5/10 - worse than having done nothing with my time.",
            "review_score": "-1"
        },
        {
            "review_text": "Even though I'm used to the Keyboard and Mouse from playing Fable: The Lost Chapters a hundred times over, I went straight to the controller because I wanted to see how that felt and I was plesantly surprised. I haven't tried Key+Mouse, and looking at the reviews here, I don't think I will, but if you're willing to play with a controller, you shouldn't have any problems.  As for the game itself, I could tell you to save yourself some money and buy the original TLC, because it's the same game exactly, minus the graphic update which is nice, but not at all necessary to enjoy the awesome game it already was.  I'm still gonna recommend it for one little detail, and that's the Heroic Mode. Shops will have a limited supply of Health and Mana Potions, although you can still find both as loot for defeating enemies or from Traveling Merchants at a slightly marked up price. Vendors will now purchase whatever you sell at 50% of what it costs, which means no more making a fortune by Buying/Reselling Emeralds in Oakvale, no more Resurrection Phials, more expensive and less effective Physical Shield and Enflame and all enemies will be buffed and give you 40% less experience.  Heroic Mode feels a bit more like what the game should have been initially. Now, at the same time if you're like me, and you like to powergame, it'll just make it a bit grindier but overall more challenging, which is nice.",
            "review_score": "1"
        },
        {
            "review_text": "Fable is a great game, one of my favorites!... but get the original, not this 35 dollar rip off. It causes much more lag and stutter, along with an obvious luminance glitch that you have to download a mod to fix! I'd much rather play the original 10 dollar version on 1920 resolution than a stuttery piece of crap poorly executed texture pack.",
            "review_score": "-1"
        },
        {
            "review_text": "Jam PACKED full of notstalgia with a prettier skin! 10/10 WILL PLAY AGAIN!",
            "review_score": "1"
        },
        {
            "review_text": "I miss Fable and Albion.",
            "review_score": "1"
        },
        {
            "review_text": "Got this game again on PC as the remake thinking I'd regret it. My nostalgia wasn't sated with new content, instead we see a remaster of the Fable I came to know and love. It was optimized great for an AMD 4000 or above, loading screens may have been longer than the oringinal on PC. Please resurrect Lionhead in someway!",
            "review_score": "1"
        },
        {
            "review_text": "Timeless classic.. It's such a good game.. you can never really get tired of it just because of the sheer design (+music), gameplay &amp; the story is decent, not really elaborate but it's immersive enough to keep you wondering and to keep you going through. A MUST for those who haven't tried it and enjoy RPG's. you are guaranteed to have fun. Still love this masterpiece of game.   ENJOY",
            "review_score": "1"
        },
        {
            "review_text": "Let me start by saing I love this game : 3 It is an amazing game.  However, this edition on steam is a real pain to play. Most of the menu buttons do not line up right or do not do what they say. To even start the game I had to find an invisable button and click an empty space between the two buttons to launch my new character...  100% unacceptable for a game that has been out forever to be released again with so many bugs in the menus...  Update: the Issue with the buttons not lining up is dependent on the Resolution you are using if you have issues you can try another resolution. Still 100% bs that its jacked up.",
            "review_score": "-1"
        },
        {
            "review_text": "The original Fable TLC was the first RPG game I ever played and loved it, played it over and over about 20times when I was in high school, this HD remake with some new content was a suprise as i got to relive some of the nostanga in HD, just wish Fable 2 could come to PC and RIP Lionhead Studio's well miss you!!! Great game now and for ever.",
            "review_score": "1"
        },
        {
            "review_text": "Fable Anniversary is the same Game as Fable the lost Chapters, only with a better graphic and achivements and Card drops. If you love Fable and you think its worth to pay 32€ for the same Game you already bought maybe 5 or 10 years earlier, then buy it. I bought this Game as Preorder with 20% off and Preorder DLC, and I can deal with it.  I realy love Fable and I enjoyed this Game, for me it was worth and the graphic are much better then before, at least for me, well at the beginning the Charackter looked ugly but then it was okay, I had alot of fun playing this game again and I would buy it again.  If you are a player who ask a Crysis 3 graphic or better, then don`t buy it, this is a XBox Port, its the same game only with a better graphic, like all HD remakes the graphic isn`t HIGH END GRAPHIC.  Game run well with XBox360 Gamepad, i would recommend to play this Game with Gamepad.  From me this Game get a 9 of 10 Points, no metter if the graphic isn`t much better but for me its good enough. (Resident Evil 4 HD looks compare to Resident Evil 4 worser, at Fable you can see that Graphic changed a lot)",
            "review_score": "1"
        },
        {
            "review_text": "after all the time I waited for this game, I expected it to run without trouble. well, no. it freezes sometimes, or get stuck in the combat mode. I played like 5 minutes before i decided that, no. it's not worth it. I will wait till they fix those issues. so if you havn't bought it yet, there's no reason to hurry. I trust it will be fixed soon and I look forward to it. I'm a bit naive.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is amazing and is worth the money IMO if you don't like a good looking hack and slash game with a good storyline then don't buy it, no need to hate on the game and to those people who think the old one is better don't get the new one then omg some people are just so negative.",
            "review_score": "1"
        },
        {
            "review_text": "Like many other people I was verry excited for this game. i pre-ordered it. I downloaded it the day that it came out and happily installed it. I have not been able to play it at all. The game has more time spent in lag than it dose running. not just the video but the audio as well. Untill this game has some major fixes, like if they actually spent at least a little time, trying to play the game themselves and saw how crappy it looked and ran and actually did something about it rather than just saying 'screw it, we will still make money' and just releasing it anyway. If you want to play fable get an origal version as it might at least work.",
            "review_score": "-1"
        },
        {
            "review_text": "Uninstalled after the horrible menu controls and then being unable to modify the camera rotation rate. The latter was way too jarring to be able to ignore, whereas the former, while ridiculous, can at least be looked over. Best bet would be to just play the console version of it.",
            "review_score": "-1"
        },
        {
            "review_text": "There is a large list of Cons for this game, and not too many pros. There is no menu mouse support and the in-game mouse is very VERY wonky, they put almost no effort into porting it from Xbox with controls in mind. The graphics are not a big enough improvement to warrent a 300% price increase from the Lost chapters. The day one DLC that was not included with preorder is a thorn in the side of the gaming community. It is obviously already made, so add it into the game without trying to charge us more for this cash grab. The modding support is a sham, with players only able to change textures and animations (Supposedly) I'm sure the community could find a way around that but we should be given what we were promised in ACTUAL modding support.  All in the all this remake feels like like a remake, and more a retextured cash grab that you should stay away. Instead spend that money to get Fable: The Lost Chapters on steam, it is still perfectly playable even 9 years later.",
            "review_score": "-1"
        },
        {
            "review_text": "After purchasing the game I found it to cause my system tremendous lag. Even after lowering the game settings, changing my computer settings, even downloading some mods for it, I still could not run it. Looking online, I found that many other people were having the same issues I was. This is with a system that meets and even surpasses the requirements.",
            "review_score": "-1"
        },
        {
            "review_text": "I decided to bite the bullet and pre-purchase it to save a couple bucks. Got me again, Microsoft! Headache-inducing post-processing, choppy performance, and ugly character remodels. If you don't mind Xbox-era graphics, maybe go pick up The Lost Chapters instead.",
            "review_score": "-1"
        },
        {
            "review_text": "  I was actually hoping or more than just graphical upgrades. Perhaps new chapters, story, map and etc. Just to add a little more for the expensive price it's being purchased for. Other than that I've always been a fan of Fable series and no matter how many time I come to play it over and over I never grow tired of it so no regrets here. ♥  What I really want though is that they work on a new game with more new contents to offer!",
            "review_score": "1"
        },
        {
            "review_text": "Good update for one of my favorite games. I had this on the origional Xbox and boy does it bring me back. I like the updated feel but with the same content layout. The updates make the game feel more polished and do not detract from the origional strory.",
            "review_score": "1"
        },
        {
            "review_text": "This game looks amazing! Still run in to invisible walls and glitch through the ground occasionally but reliving this game again is great!",
            "review_score": "1"
        },
        {
            "review_text": "It runs sluggish on my lenovo y50 with nvidia geforce 860m, 8gb ram. Is anyone experiencing a similar problem? It's kinda frustrating not eing able to play it :s",
            "review_score": "-1"
        },
        {
            "review_text": "Don't listen to the people complaining about controls. The graphics are done well, it still looks like Fable, just better. The controls are odd but not unplayable, and it's only laggy/choppy if you're running a potato. I have an i3 and a 2gb 950x with 8gb of ram and i run it full without any problems.  P.S: if you're buying it for the mods, there's only 15~ on the workshop.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Story, amazing gameplay, impressive new graphics.  A classic gem.",
            "review_score": "1"
        },
        {
            "review_text": "I tried playing this, but the camera was too jerky and made me feel pretty sick. I had to refund it.",
            "review_score": "-1"
        },
        {
            "review_text": "Not really worth the price unless you have never played fable lost chapters and like to use controller rather than mouse since this is the same game with a small improvement to graphics and no mouse control in menus.",
            "review_score": "-1"
        },
        {
            "review_text": "Choppy and terrible hangs, there is no excuse for this.  Note: My build can handle just about anything.",
            "review_score": "-1"
        },
        {
            "review_text": "Fable: The Lost Chapers, was one of my favourite games as a child. When I heard about Fable Anniversary, I bought it withotut expecting much; I thought it would just be a HD remaster. Maybe fix some of the glitches. What I got was:  + Improved shading. + Improved sound quality  Improved texture resolution and models, though the faces are all hideous.  - Interface that's about as user-friendly as forks being jammed under your toenails. - No mouse control in menus. - HORRIBLY clunky camera that seems to have trouble going around corners without jumping around. - Sound cutting off and crackling whenever it feels your headset and/or ears aren't being tortured enough. - Random Crashes - Combined key commands that shouldn't have been combined- such as dodge/rolling - Not being able to edit all of the controls without digging around in the files  Fable Anniversary is not worth the $35 price tag. The original Fable:TLC is superior in every way, unless you put graphics over gameplay. The graphical improvments are not enough to make up for the technical trainwreck that is Fable Anniversary. This is a shoddy port that simply feels unfinished. Alot of work has to be put into it before I would consider it supeior to the classic in any way.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad stuff: Cinematicas are renderred at a poor bitrate. Textures are far away from HD. I know when the original was released, but now they could do motion capture, cause characters' emotions and movements are so awkward. Shaders are not applicable for 3D stereo, some fixes are needed. Now the good stuff.  The main thing-this is like a real fairy tale, the plot and voice actors play is great(except women speaking for children squeezing their voices to seem immature-that's ugly, sorry...). The music was written by a genius. It's so true and impressive. If they make motion capture-this will be a really amazing game. I had no any troubles with controls, everything is fine for me. At least you can remap your keyboard keys almost for everything.",
            "review_score": "1"
        },
        {
            "review_text": "I am disgusted with the laziness of this company and their disregard for PC users. Yes, the graphics are beautiful, and run great on my computer, since I have a very expensive laptop. But nothing in this is made for the PC user. No more hotbar, I can't use a -mouse- a freaking mouse on the menus, You can't even use wasd on the menu, and you need to press a and b. I don't want to buy a freaking controller. I can't believe I spent money on this lazy port. They lied to us.",
            "review_score": "-1"
        },
        {
            "review_text": "it's combat is fun until you reach god mode a third of the way through the game it's choice to be good or bad is interesting until you relize it dosn't really effect the story the game feels empty most of the time",
            "review_score": "-1"
        },
        {
            "review_text": "a rather lovely game :^)",
            "review_score": "1"
        },
        {
            "review_text": "Still a great role playing game, and easy to go back to after tiume and still enjoy it",
            "review_score": "1"
        },
        {
            "review_text": "Who will you become? Fable Anniversary is the re-release of the original game that was created in 2004 and is bundled with all the extra content that was subsequently released a year later. The first thing anyone who has played the original Fable will notice is how ginormous the technical upgrade for this game is. It is far more than just an HD remake, It is a complete redesign on the graphical style of Fable with an absolutely impressive lighting system and a recrafting of the original textures along with a new streamlined control system modeled after the much better control scheme of Fable 2, but only those with a controller will be able to enjoy the new controls as the controls for the keyboard are still the same as the original. If you have played the original Fable and enjoyed it, don’t miss out on this wonderful experience. If you are new to Fable give it a shot, it’s a very charming, humorous and SUPER British RPG game that is absolutely delightful. Though its promise of choice is not as flushed out as it could have been that is no reason to miss out on such a unique game.",
            "review_score": "1"
        },
        {
            "review_text": "So basically its just a port from the console version, and not a good one at that. The interface is just plain horrible. Using insert, delete home and end to change between sections of the menu? The feeling of TLC is there, but not enough. Could've at least try a bit harder on the port. I rather play TLC with mods again if there aren't any changes to the interface. Why would you remove mouse from a menu on a bloody PC game. It makes no sense, unless its just a lazy port just to milk money from a series that a lot of people love. Way to disappoint us again Lionhead. With a certain someone no longer part of the studio, I expected much more. I guess a good port to PC is too much to ask.",
            "review_score": "-1"
        },
        {
            "review_text": "...and now everybody knows who the world greatest scam artist is.",
            "review_score": "-1"
        },
        {
            "review_text": "One step forward, 10 steps back pretty much sums up this retexture.  Unfortunately this is a rather poor Xbox One port, that removes all of the good aspects of the original Lost Chapters PC version. Mouse functionality is no longer available in menus, instead navigation is controlled though the Home, End, Insert &amp; Delete keys. You then make a selection using the 'A' (!?) key.  Whilst basic key rebinding is available, the main abilities are locked and cannot be reasssigned - block and dodge are both set to the mouse wheel which makes combat really fiddly for mouse and keyboard. The control scheme was clearly designed for use with an Xbox controller.   The game seems to use built in FXAA that cannot be toggled off, which gives the game a blurry, unfocused look hiding a large amount of the higher resolution textures.  Until large improvements are patched into this game, save your money and play the arguably much better original that was actually designed to be played on the PC.",
            "review_score": "-1"
        },
        {
            "review_text": "Controls made for controllers with no mouse support for menus. Game regularly hangs and it even gave me a blue screen of death. Shoddy port, Wait for patches or buy on Xbox.",
            "review_score": "-1"
        },
        {
            "review_text": "Sad adaptation. It was truly a waste of money. Controls are a wreck. This is from a fan of Fable - I was excited to play this and now it's just a waste of data.",
            "review_score": "-1"
        },
        {
            "review_text": "I want my money back. This is another example of a crappy PC port. Could have been great but the designers just didn't care about supporting the PC interface. The keyboard and mouse don't work on the menus at all. Once started up you can't even shut the game down without a controller! I dug one out, dusted it off, installed the drivers - and found out that you can't configure the keyboard/mouse controls once you do select them. Having wasted an hour and $35 dollars I'm walking away from this and playing something else. What a ripoff.",
            "review_score": "-1"
        },
        {
            "review_text": "Game lags, tried to fix it but didnt work.",
            "review_score": "-1"
        },
        {
            "review_text": "Due to being a Fable fan, I decided to pick up this game once more. I played the original and fell in love with it. Fable is a game that I can never get tired of even after 10 years. It is a mixture of both badass and funny. I believe that the story to this game is very well developed and each character is kept interesting. One thing I do have to say about Fable Anniversary is that the quality looks a bit odd and I still prefer the original one, but that's just probably because I grew up playing the Lost Chapters. Either way, I really do reccomend this game to those who like RPG's because the story is great and easy to follow along.  CHICKEN CHASER!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I do not recommend this game. It played fine for the first two hours I spent with it, but after that the game refused to load. I would get to the title screen and try to press start, at which time the game would freeze and crash. Looking around on the internet provided no help and there was no fix to be found.",
            "review_score": "-1"
        },
        {
            "review_text": "Using a gaming pc and the game is choppy. I don't understand how a game can be sold that can't run smoothly on a gaming pc. only game that doesn't work on my computer. waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a sucker for shiny things and i hate myself for preordering this ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "23 hours in* playing in offline mode.  My first impression was terrible, but that changed pretty quickly. It's fable! The new quest cards are built in well, and the TLC is tacked on the backend well. The graphics are mostly stunning, but there's a few sharp edges that poke out.  My only complaint is the same as with any game that came out around that time: the camera sucks. No biggie though. Party like it's 2002.",
            "review_score": "1"
        },
        {
            "review_text": "Game only half works using keyboard and mouse many screens will not open cannot change weapons or outfits or power up in guild most things only open 1 screen and not all of the others no view of inventory many other problems yet to be fixed",
            "review_score": "-1"
        },
        {
            "review_text": "I played and beat the original and then TLC's when they came out so I wasn't really planning on getting this itteration of it until I saw the addition of heroic difficulty.   What a bad choice it turned out to be. The first half of the game I found myself questioning if I had really picked 'heroic' in the beginning. The only way I knew for sure before I beat it, was the enemies did infact have obsidian &amp; master weapons. That was it, just a visual indication. It's been a long time since I had last played TLC's but I didnt notice a lack of potions, experience, money or even an increase in enemy damage like they said. Im an average gamer when it comes to skill at best and I died a total of 3 times. With a difficulty labeled 'Heroic' and described as '(it) will test the mettle of even the most hardcore Fable fan.', you would think it would present some kind of... challenge? Heroic mode was a joke.  Other than that, the graphical upgrade was nice for the game imo, aside from the characters faces. And the menus were not intuitive at all. I found myself fumbling through them more than I would have liked. I can't really comment on the keyboard controls as I used a PS3 controller, but aparently those were chosen by throwing darts at keys.  Bottom line, I'd stick with the lost chapters or wait for this to go on sale down the road. I personally can't justify spending $35 for this knowing what I know now. In fact I spent only $21 and still regret it. The only thing that might make it worth the current price is if the integrate steamworks support. It's been mentioned but no official word as of yet.  ",
            "review_score": "-1"
        },
        {
            "review_text": "A slick new interface, the description says. My God, I thought, if there's one thing the Fable game needed, it's an updated interface. And hey, the updated graphics are another thing that looks pretty slick. I was so excited, this is one of the only games I've ever preordered.  I load up the game, and try to click on 'New Game'. NOPE, CANT CLICK ANYTHING.  A bad sign. It gets worse though. I couldn't even click on inventory and its associated menus. Not only that, I have to use insert, delete, home, and end to get around those menus.  Could there be a less intuitive way to navigate? I submit that there could NOT. I haven't been so disappointed in a game purchase since Restaurant Empire 2.",
            "review_score": "-1"
        },
        {
            "review_text": "CONSOLE PORT AND LOOK IT HAS DLC I'M NOT SAYING THE GAME IS BAD BUT FOR PC STANDARDS THIS COULD BE ALOT BETTER CONSOLES ARE 5 YEARS BEHIND PC OR EVEN 10 IF THAT",
            "review_score": "-1"
        },
        {
            "review_text": "The fishing pole will not catch fish, and it's necessary to get through Lychfield cemetary. You have to reel in a sheild and you can't, it's a malfunction of the game. It was fun till there, but it's hard to quit part way through.Disapinting!",
            "review_score": "-1"
        },
        {
            "review_text": "So basically its just a port from the console version, and not a good one at that. The interface is just plain horrible. Using insert, delete home and end to change between sections of the menu? The feeling of TLC is there, but not enough. Could've at least try a bit harder on the port. I rather play TLC with mods again if there aren't any changes to the interface. Why would you remove mouse from a menu on a bloody PC game. It makes no sense, unless its just a lazy port just to milk money from a series that a lot of people love. Way to disappoint us again Lionhead. With a certain someone no longer part of the studio, I expected much more. I guess a good port to PC is too much to ask.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a crappy console port. The original has better support for mouse and keyboard. Ridiculous.",
            "review_score": "-1"
        },
        {
            "review_text": "I've seen a lot of hate for this game lately and I have no clue why.   Everybody asked for Fable: The Lost Chapters to be redone in HD LionHead Studios did exactly that.  I've found no problems with the game, and even if I did, they made it moddable in case there is something that doesnt suit you well.  Stop whining and enjoy a good game",
            "review_score": "1"
        },
        {
            "review_text": "You better have an Xbox controler for this one!!  The game is a nice port but the menu controls are all consol controler based, ive been playing this game all day apon relase and i still cant figure out how to control the damn menu ( WHICH THEY GIVE NO INTRUCTION FOR )  lIONHEAD STUDIOS WILL MAKE SURE YOU PAY YOUR SINS FOR NOT PURCHASING AN XBOX AS YOU BUTTON JAM SEARCHING FOR THE LEFT AND RIGHT SCROLL KEY TO CONTROL THE COMPLEX KEYBOARD AND MOUSE MENU INTERFACE  LIONHEAD STUDIOS WILL CHUCLE AS YOU FAIL TO UNLOCK THEIR ENCRYPTED KEYBOARD COMMANDS",
            "review_score": "1"
        },
        {
            "review_text": "More or less a graphical overhaul as opposed to a 'Remaster'; still as vastly enjoyable as it once was though, nonetheless.  Fable 2 'Remaster' next please, Lionhead Studios.  Please.",
            "review_score": "1"
        },
        {
            "review_text": "When will we be expecting the re-release of 2? Not soon enough",
            "review_score": "1"
        },
        {
            "review_text": "Really nothing wrong with it, i have mouse support... Dont know why you care, the game plays like the old game. But its just to expensive, so get it while its on sale.",
            "review_score": "1"
        },
        {
            "review_text": "There are some problems like keyboard configuration and some graphic issues but this game is so good and it is very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Portwise it's pretty bad, missing alot of keys that most would like to rebind in the rebind menu+you can only rebind when playing the game and not from the menu, I am personally on the fence about the new asthetic but other then that its the classic Fable experience and aside from the glitch time to time its really fun too play",
            "review_score": "1"
        },
        {
            "review_text": "It's as if Microsoft gave Fable the lost chapter to a team of junior artists with no budget and said 'GO'. Not worth the buy, you'll save some money and get a much better experience if you just buy Fable: The Lost Chapters.",
            "review_score": "-1"
        },
        {
            "review_text": "Game crashes just as i press on the title screen every time. There seems to be no one with this issue online and i dont know what to do about it. 0/10 game i want a refund",
            "review_score": "-1"
        },
        {
            "review_text": "I still remember when I played original Fable and I loved it. Remastered versio gave me that same old happy feeling which the original version did. Game is very good, but lacks an impact. Once you have played it through there is no really need to play it again since there isn't that much choises in this game. I would have wished more from this game, but then again I have Fable 3 which has that impact Fable Anniversary and the original versio lacks. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun game just like the original. But the control scheme is not computer friendly. Nothing is placed close together. You constantly have to leave your mouse and use the arrow keys while in menus. Really there is too much to list it needs a patch badly but it just came hope so here's hoping that in a few weeks it will be all fixed up and awesome. 4/10 just for awful controls.",
            "review_score": "1"
        },
        {
            "review_text": "So unstable it's almost insulting the devs released this piece of garbage. I love the original Fable, but this version is unplayiable, and I know my pc can run this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Already had 2 major updates since release. Don't be so quick to judge. This game was a big part of my childhood and it's great to play it again &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "All i wanted was Fable for the PC with controller support and i got it. the updated graphics are a bonus imo. 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "What's there to say? It's a classic and a good one, in a HD skin.  The combat is fun, even if the flow is a bit clunky and lends itself well to controller and keyboard and mouse.  The development of one's character is of course the main feature of the game, this can be annoyingly pushed in an unwanted direction in the pursuit of trying to open Demon Doors, but other than that one almost has complete freedom.",
            "review_score": "1"
        },
        {
            "review_text": "To any fan of Fable(s) this is a must buy. For anyone who loves an easy to get into rpg this is also a must buy. There is just a certain charm about this game that you can't get anywhere else. I purchased this day one and while it had it's bugs, the devs have worked around the clock pumping out updates to give this game the functionality it deserves. Whether you are wanting a nostalgic trip or just a great all around rpg, FA is a must buy!",
            "review_score": "1"
        },
        {
            "review_text": "I thought even though it is the hd version of the xbox original it's just fun as I remember it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a real good game with a nice story and gameplay, but being an 'anniversary edition', there is nothing new or exciting in this version, only with improved graphs &amp; sound (and lots of lags lol). So, I highly recommend to buy the lost chapter, it's the same thing and more cheap.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best games that i've played. Its always a great experience to play it.",
            "review_score": "1"
        },
        {
            "review_text": "i want my money back i cant even play this game on either of my computers because its too choppy !!!! and i have a really good gaming laptop",
            "review_score": "-1"
        },
        {
            "review_text": "Edit: I am leaving my initial review because I think it's important to know how companies release games as well as what the end product turns out to be. The game is great now aside from the menues still being terrible with a key set. The graphics are smoother, the eyes aren't taking you out of the game because they are so poorly done (decent now) and although esc doesn't back you out of menues, 'backspace' does and that in it's self is nicer than having to use the letters on the key set.  Now, I would say to go a head and play this game, and I'm changing my thumbs down to a up.    (This edit was done when I saw the update installing.) Edit: Seems they may have fixed everything I didn't like... Will have to test soon and re-write the review. See patch notes here: 'New Version Available – 835543 Community Announcements - Oman Fixes include but not limited to:  Expanded Keyboard and Mouse remapping options Fixed a script issue with digging glyphs in Necropolis Hard Mode – Removed ability to farm gold by selling houses with trophies Fixed highlight effect on textures with Alpha (trolls for example) Updated eye textures and placement Fixed Moustache colour morphing  Added error message for running out of Video Memory Fixed flickering sky at 3am  Fixed hero morphs in the stats screen Fixed new profile reverting back to previous profile on front end Added borders to cover UI clipping on non 16:9 screens Added Enter and Backspace as the main UI buttons Fixed a crash in the modded version with the skill upgrades Display the GPU Adapter at the bottom of the screen when on credits option - use this to verify which GPU your PC is using.'   Original review below:  I was really looking forward to this... Then I launched it.  As soon as I launched this game and got to the menue I thought to myself 'This has to be the worst port I've ever seen'  Navigation of the menue is not possible with the mouse, you can not move up and down in it with the W or S keys, you can't select a choice with a click of the mouse or a strike of the enter key, esc doesn't back you out. The 'A' key selects, the 'B' key backs up, and you must use the arrows to navigate the menue...  I shut the game off in discust after I maxed all the graphics settings.  Launched the game a few days later with a controller attached. OK fine, if I have to use one in game I guess I can get past the total lack of propper key set support... Now that I'm in the game my dissapointment grows further.  The original animations were fun and cheaky at the low rest and dated textures, having the exact same with new textures... Just feels cheap. It can look better, with propper screen shots, and there are deffinitely added foliage, increased resolutions, and so on and so forth but... The dancing shadows from the original are amplified in this version, and you get 'pop in' loading. I know what you are thinking, my computer must be slow or dated. I can play Witcher 2 maxed with uber sampling and not have an issue, so it's not the machines capability although who knows if it is a compatability issue.   Next up, the EYES. I should have said this first but if you played it I wanted you to wait a bit to know I agree heh. The eyes are so bad they take you out of the rest of the game. They make the people look like creepy dead little dolls from a horror flick. They never are looking at the person they are talking to but they do move around and seem to stare off in a direction that might contain the city where the person is that they are talking to, but never actually at them.... This is so bad that all I can do is laugh, laugh at it's complete and utter discrace it has brought to the first game and laugh at the fact I spent money on it...  They updated it so the crows in the start don't give you experience, but didn't bother to update it so you could save at any time and shut the game off and not lose your place...  I may keep playing it, I'm not sure... If you want to try Fable, I sugest 'The lost chapters' it was a fun and fantastic game. This one? Unless you want to laugh at it the way you would a movie from the 80's that's completely serious but you just can't help laugh at how bad it is, then don't bother.",
            "review_score": "1"
        },
        {
            "review_text": "So it is a good game yet i know how to make it crash lol just use one of the really long charge powers over and over crashes the game in just under 3 minutes",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST GAME I HAVE EVER PLAYED MY CHILDHOOD GAME IN HD THERE IS NO GAME LIKE IT TODAY I JUST KEEP COMING BACK FOR MORE THE BEST FABLE GAME IN THE SERIES 10/10 &lt;3 GREAT GAME",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing fable for a LONG time and have loved every bit of every game. I never got to playing The Lost Chapters because the graphics kind of turned me down. But when i saw this on steam I knew the time was NYE! I played it and LOVED it through every battle and restart. The game does have its bugs, but I think they are overlookable. YOU SHOULD PLAY THIS GAME!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding lets face it :D",
            "review_score": "1"
        },
        {
            "review_text": "Remake of a old Xbox game with Lost Chapters Content along With Pricy DLC contents in wich case you get a $10 DLC that you get for free on Pre-Purchase Overall the only thing they added was a Better Graphics and a couple of glitches were patched but the infinite money glitch is still in there",
            "review_score": "1"
        },
        {
            "review_text": "One of my favs since forever.",
            "review_score": "1"
        },
        {
            "review_text": "I thought id love this game but i have a great pc it meets all the requirements and it still wont work i can only move for about 1/3 of a second at a time and id really like some help of a refund ive tried all the fixes so someone help",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best games that i've played. Its always a great experience to play it.",
            "review_score": "1"
        },
        {
            "review_text": "Meh. Let's be frank, the original Fable was nothing special, and all this is, is a retread sooped up with Fable 3 graphics. If you've never played the original Fable, I would recommend this. Otherwise I'd leave it be. I played this game to death back in the day and it just does not hold up.",
            "review_score": "-1"
        },
        {
            "review_text": "i just wish they didn't change all the menus and everything, why not just re-release lost chapters with controller support tbh",
            "review_score": "1"
        },
        {
            "review_text": "how do i get my refund.  Every thumbs down review has already made it's points 10 times over I'm not gonna repeat it again.   Edit.   The developers seems to be on it. Fixing major issues with the game still not great but acceptable. Only thing missing is full keyboard + mouse control that would make me really happy.",
            "review_score": "1"
        },
        {
            "review_text": "Fable... no words to decribe. one off the best open world games i ever play",
            "review_score": "1"
        },
        {
            "review_text": "My youth generation game. If you like adventure it is one of the best but for the person who plays game too much specialy if you are expecting high quailty of AI you would be sad. If you just want to have some good time it is good but dont wait too much thing it is old game. Oldies but goldies.",
            "review_score": "1"
        },
        {
            "review_text": "This game has some of the best waifus from the early millennium. You can marry, bang, and sire offspring with them which is always a bonus in my book. The gameplay is solid if you have a Xbox/Playstation USB controller somewhere. If I remember right the keyboard controls and menus are horrendous in this version of the game though. When they ported it over they left the console controls in. So you have to press buttons to scroll through the menus instead of clicking on the options.",
            "review_score": "1"
        },
        {
            "review_text": "No, this was not as i remembered it years ago on the original Xbox. However, the music and atmosphere is still there.  Kinda recommend it. 2/5",
            "review_score": "1"
        },
        {
            "review_text": "The original game with some graphical textures is arguably a much better game overall. The lack of menu and key binding options, the lack of hotkey porting especially (there's no F key bindings I have found), makes this game not only lazy but extremely frustrating to play.  Don't buy this if you are thinking about it. If you haven't seen already, you can't actually use your mouse in the menus. WHY? I assume it would have taken 2 or 3 hours at the very worst to put the capability back in, or copy and adapt the code from *any* other game from the studio.  Edit: 2 months of fixes later and it has become quite a good game, happy to recommend it now.",
            "review_score": "1"
        },
        {
            "review_text": "Overall this is basically Fable: The Lost Chapters from 10 years ago. It is very nicely redone though. This version has updated graphics and audio. It has some added content like some weapons and armor and the opportunity for DLC at a later date. This is a great game to play through for both first time Fable new comers or somebody who would like to relive the memory of Fable from 10 years ago with updates.  EDIT: Game is essentially broken so I am changing my recommendation from yes to no until the problems are fixed. I got 4 hours into the game and I now can't even load the game to the menu without it crashing back to desktop. If problems are fixed, I will change my recommendation back.  *EDIT 2: Since the updates I have gotten, I haven't really had any major issues with the game. I would definitely recommend this game if you haven't played Fable the Lost Chapters before or are new to the Fable series.",
            "review_score": "1"
        },
        {
            "review_text": "Positives:  + It's Fable; a joyous British action-RPG made with love + Gameplay still holds up as an enjoyable romp through Albion + Graphics update keeps it relevant and playable on modern machines + If you haven't played the original Fable it's the definitive version to play  Negatives:  - Nothing done with the original loading screens and area sizes. They aren't long however do interrupt gameplay - Facial animation and features haven't been updated; look very dated and altogether jarring - UI was slightly fiddly and unmanageable - If you've already played Fable / Fable: The Lost Chapters there's no real reason to play this",
            "review_score": "1"
        },
        {
            "review_text": "The game is great, but I as for the moment I lack a contoller(broke a few days ago) it need sto be updated with full mouse support on menues having to use the keyboard to navigate is a pain but the rest of the game plays fine with a keyboard and mouse.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games! glad i can play it on the pc now :D",
            "review_score": "1"
        },
        {
            "review_text": "EDIT: Since the updates, the game is actually enjoyable. I can now safely recomend this game over the original.",
            "review_score": "1"
        },
        {
            "review_text": "As a huge fan of the original Fable, I just had to pick this remaster up and I'm truthfully glad I did. It is still basically the same game, but with a major graphical overhaul and built on a new game engine (Unreal). I'd say the graphics look 20x better than the original did despite some naysayers who say otherwise. The only problem I noticed visually is often times textures will take a while to load when talking to NPC's and their faces will look a little muddy for about a minute until the texture loads, but other than that it looks great and way better than the original. The character faces are what shine the most and have been improved dramatically, but overall the textures and colors are far higher resolution and more rich in color. Another plus is the addition of achievements and full gamepad support (I mean afterall, this is 2015, every PC gamer should own a gamepad). Aside from the obvious, this also has some cool DLC (I haven't bought yet, but I've seen it), mostly just new clothing and armor like being able to wear Jack of Blades' or Thunder's outfit, etc.  Aside from the obvious, it is still the same classic Fable fans will know and love but optimized for people who have the latest computer hardware and Windows 8/10. However, the price is a little steep. I would wait for a sale before purchasing as the normal price they're asking for is a little too much even for a remake as worthy of a purchase as this. I think $15 to $20 is fair, but anything more than that is a little overboard honestly.  Do I recommend buying it? Of course. Even coming from someone that played the original countless times this game doesn't ever get old.",
            "review_score": "1"
        },
        {
            "review_text": "A good update on a classic rpg, its really only worth buying if you are a big Fable fan since it doesn't really add anything new to the base game except for a graphical update.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, I've not played the 'Original- Fable'.  Fable Anniversary is a rework of the original game ported into the Unreal Engine, providing upgraded graphics and “upgraded” menus. It is a HD remake of the original Fable developed by Lionhead Studios for the original Xbox.  The level of customization you have over your character is Ok. 'Change your hairstyle or your clothes, be good or evil, help the townsfolk or watch them burn--the choice is yours.'   - 'I'm not sure if the good-evil alignment playing one time only will give more than a touch of reacts to your actions.'  Take your time on playing Fable. Speak to people, pick up side quests and play around, otherwise you might suddenly find that it’s over. There’s a lot you won’t find out unless you take time to mess around and experiment.  You may not be overwhelmed, but it's still a good action game that everyone should experience at some point or another.",
            "review_score": "1"
        },
        {
            "review_text": "I never played the original Fable, only Fable 3, and I actually enjoyed my time.   Trying this game was a breath of fresh air. The combat is much better than the third, the weapon system feels very balanced, the story is interesting.  As for the PC port, as long as you have a wired controller you will run into no issues.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoy the harder game mode a lot",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of all time. Fable Anniversary is the complete package (Fable:The Lost Chapeters HD Edition basicly). It has controller suport with the old control scheme for xbox. A lot of patches have been released and keep being released to help this game run super smooth at even the highest settings in the most intense scenes. The modding comunity is small sadly, and only has a few mods on the nexus that can extend your stay in Albion. The inside achevments are worth checking out too, and with multiple save slots per hero and extra lore friendly DLC that adds a lot of in game content to all the merchants, this game is definitly worth buying for fans of the series.   TL:DR Its Fable:The Lost Chapters but with HD visiuals/effects, up to date support and more content.(if you buy the DLC)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, lots of choices to effect your appearance, and if you are someone to be inspired by, or feared by. Side missions are fun, and the chicken kicking competiton works well with a remote too.  ",
            "review_score": "1"
        },
        {
            "review_text": "Fable: Anniversary is the bare minimum for what constitutes as an HD remaster. Sharper textures, better lighting and higher quality sound. The game feels and plays like the original game with the usual loading screens in between sections that you often see in games released back in the day.   It's still the same old Fable at its core, but for some reason the developers made some pretty major changes to the artstyle which make the characters look a bit off.   If you've never played Fable before then this is the game for you. If you, like me, have played the original Fable then this is just an okay remaster that does nothing better than the original. Hell, it does some things worse.",
            "review_score": "1"
        },
        {
            "review_text": "This game is everything I expected it to be. It's great to see this classic remastered for modern audiences.",
            "review_score": "1"
        },
        {
            "review_text": "First of all: Don`t mind the Mixed Reviews. People usually do not recommend this version because they say it`s not worth the full price. I think they're right about this point, it's the same Fable, just with a few graphic tweaks. This sure is not worth the full price. But this version is not bad at all. If you can pick this up on a Steam Sale: Do it. The tweaks are cool, the bugs are fixed. You're gonna replay Fable with better graphics. And if for some unexplainable reason you haven't played it yet, then it's for sure the version you should get, because it'll fell a little bit less out dated.  Well, the game is great and this version looks better, but try getting this on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Don't be fooled by the low rating because this game is as great as the original, if not better. The reason for the mixed rating is because of the price, which is understandable because this edition is simply a remastered HD quality version of the original. When it comes to the story and gameplay, nothing has changed (as it should be). But that's what makes this edition so great, it brings life back to the original Fable. With the enhanced graphics, it makes the game more enjoyable and playable in todays standards. I'm actually surprised that many were disapointed because they felt that this edition was 'lazy'. It's a remastered edition. It's not any different than getting a Blu-Ray of the Wizard of Oz.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games! glad i can play it on the pc now :D",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia, Nostalgia, Nostalgia. This is the greatest adventure RPG game I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Few hours in, and looking at reviews here it looks like I'm the only one who wasn't severely disappointed. Yeah, that first trailer with a bunch of people typing chat messages to one another did little to sell this one. Yeah, the graphics are a lot less improved than I had believed. Yeah, I preordered this largely because I thought I was getting some one-time shot at bonus content that you couldn't buy as a $5 DLC. Okay, a little let-down, but it's not a terrible remake so far. Some of the characters faces have gotten uglier than the first Fable tho. Was that intentional? I really expected Briar Rose to be more, um, appealing, given her self-absorbed attitude, and Mace to look less like he's lost some fights with his food processor.  Thus far I have played this with a controller, and have had no crashes, no issues, no glitching. Not even the ability to buy a crapton of apples and buy/sell them for infinity money and archery exp. Well, I guess they did fix some things, even if they kept some dumb game mechanics like having to murder people to buy their houses. 'Sorry I had to immolate you with magical fire so I could buy your house, but Bowerstone doesn't allow weapons, y'know... Hey, I'll use your future rent monies to buy lots of tofu and it'll all be okay!' Actually, now that I've played a bit more, it turns out you can still amass a small fortune by selling and rebuying 50 health potions. It's a dumb mechanic, but it does remove any tedium from earning money. And pretty much any meaningful value to the stealing skill.  I have not yet dived in with my trusty mouse and keyboard, but so far so good. Their latest patch, while fraught with complaints about the size, does seem to address issues I've seen reviews complaining about, like keyboard and mouse remapping. What's not to love about a developer supporting their game? Bottom line: maybe not enough improvements to make this worth all the hype (and price tag). People can complain about how they loved some of the mechanics of 2 and 3, but if you absolutely have to play a female, go play the game that allows it. Fable was a great game, and this seems to be at least as good, if only ever so slightly improved in graphics.",
            "review_score": "1"
        },
        {
            "review_text": "This is terrible. This is worse than Fable: the Lost Chapters. The graphics are plastic, like Fable 3, the video is grainy, clearly taken from the original (at least the once I saw). There is no mouse support in the menues, the menu system itsel was designed by chtonic monsters with multiple tentacles. The keys aren't rebindable. Just get Fable: the Lost Chapters and play it. You'll have a much more pleasant experience.",
            "review_score": "-1"
        },
        {
            "review_text": "It was like the old times, but now in HD, awsome",
            "review_score": "1"
        },
        {
            "review_text": "Just for my fellow female gamers, a heads up. Female roles are not yet available in this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game holds your hand so hard, it threatens to break your fingers.  Want the achievement for seeing the whole world without any actual work? Eat pies 'til you get fat!   Several achievements make the game almost not even require another playthrough (I've beaten my old physical copy of The Lost Chapters more times than I care to admit, and it was a blast each time), which really tells you something about ol' Lionhead Studios (RIP and also LOL).   The HD textures make everyone just as ♥♥♥♥-ugly as the original game, but now in HD, so you can look into their cold, staring, dead eyes as their mouths move in the same ventriloquist-dummy fashion as they do the exact same ten or so animations as they did about twelve years ago.   The menus are a god-awful chore to navigate, and only for the sake of looking nice and being charming and rustic and cute and *vomits*.  The combat is controller-snappingly frustrating (USE. A. CONTROLLER.), as enemies have finally discovered how to block, and also, how to abuse blocking completely until combat isn't even fun anymore.  The fixed the Silver Key glitch in Darkwood. The ONLY thing they fixed, and it's the ONE thing I wanted to STAY broken.  Also, the kid Hero looks like he is WAY too high to go get a birthday present for his sister.  5/10 1 point for the music still being good. 1 point for it still kinda being The Lost Chapters deep down. 3 points because it isn't Fable III.   tl;dr ♥♥♥♥ this game, buy the cheaper/better/original version; and ♥♥♥♥ you, Peter Molynyucknyucknyucks, if you had just learned how to make a good game, you'd still have a ♥♥♥♥ing studio.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing game, especially for the fans of the original Fable.",
            "review_score": "1"
        },
        {
            "review_text": "Fable Anniversary is a great game! That said, it is not perfect. Overall Score: 9/10 My simple review breakdown follows:  Pros:   - Just like you remember the original Fable, except with better graphics. - One of the greatest RPGs of all time. - Steam achivements!  - Modding! - Classic gameplay.  Cons:  - Could have had spent more time redoing character motions and reworked their physics engine to make the game more fluid.  - I hate to be cliche, but classic gameplay. While it is a pro, it is also a con, because RPGs as well as all other games, have evolved. I feel like this should have not just had new graphics slapped on.  - No add in of previous Fable advances implemented into the Anniversary Edition?! This is definitely my biggest pet peeve. Lionhead introduced us to a whole new realm of customization of our character in Fable 2 and 3, and here we are, back at square one again without the ability to simply have different color hair. It is my hopes the modding community comes up with a way to fix this.  Overall, great game! Still worth every penny! Pick it up!!!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "If i was able to use my mouse in the menus i would be more happy but that is probably update content... I love it otherwise...",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: Get it on sale if you haven't played Fable, or if you want graphical pretties. Keyboard+mouse be dun goofed apparently.   ------------------------------------  I was an avid fan of the original Fable and Fable TLC, and the remastered edition doesn't fail to disappoint either.  PROS:  - WIDESCREEN SUPPORT AW YISS. Getting the original to work in widescreen wasn't terribly hard, but it was still hackish and bugged at some critical moments.  - Very nice graphics, they've predominately kept to the core of the graphical characteristics of the Fable series, but it's amazing what a fresh coat of paint (proverbially speaking) can do with a game. Fable has definitely aged well.  - Modding support? I'll be curious to see where this goes, and from what I've read, we may end up having Fable Anniversary coming to the Steam Workshop. Can't imagine it'd be like a Skyrim, though.  CONS:  - No Borderless Window nor scaleable UI. Just a bit of a bummer that I can't have the window maximised since it then causes letterboxing and the like, and considering this is a UE3 game, I'm surprised that we don't even have a borderless window option, since I often alt-tab between windows and would rather have the game appear full screen. I've tried tools to force the borderless window but it doesn't work.  - Some graphical glitches exist where objects won't receive light from nearby light sources, kinda kills immersion a bit but it's not a deal breaker by any means.  ROOM FOR IMPROVEMENT:  - Mainly to do with the overall environmental lighting, particularly outdoors, but we could benefit from variations in luminosity, and actually be able to use the lantern at night, right now it just seems pointless to have the lantern since everything is so well lit.  - Some head models can do with some improving too, the child Hero looks like he hasn't slept for a week, and Maze does not look like Maze at all, his characteristic stern look got ruined by an elongated, pudgy, wrinkly baby face with tattoos. |:  I can't speak for the copious amounts of people that have whinged relentlessly about the whole keyboard + mouse thing, I do remember playing Fable TLC with a keyboard and mouse and it was working quite fine, though since then I've been playing games with a 360 controller, and naturally given Fable Anniversary was originally made for the 360, it still feels pretty good to play with. I did try playing with the keyboard+mouse combo, but quickly switched back to the controller. :P  Haven't played through Heroic yet, but that'll be the next step.",
            "review_score": "1"
        },
        {
            "review_text": "first off i would like to say i absolutely love this game, having spent quite a few hours on it, i find it hard to put it down, i do not understand all the hate and saying it feels 'dated' its a HD remake not a reboot, i give it 10/10 simply because it truly deserves it",
            "review_score": "1"
        },
        {
            "review_text": "The controls and camera are realy wonky! the controls just feel realy weird using the mouse to aim at your target, even though the camera likes to do an over the soulder view sometimes. this makes it hard to aim at times. Also the camera is verry shaky when running around the map, I dont think it was designed for mouse control. My suggestion is, if your like me and just wanted to revisit this amazing game. Dust off that old XBox and buy it used from gamestop. its just so wonky feeling it realy makes it hard to get into thinking about dealing with the controls and camera for an extended period of time.",
            "review_score": "-1"
        },
        {
            "review_text": "The best sex scene ever",
            "review_score": "1"
        },
        {
            "review_text": "Great game! I only had a little trouble starting it when it first downloaded, but all in all amazing game still and I am so happy to have it on my laptop.!!!! Accidently gave myself a halo when I wanted horns XD silly me.",
            "review_score": "1"
        },
        {
            "review_text": "Great game Really recommend for players new to Fable.Also there was many issues,after a huge update,they are all gone.Now it is a great game with HD and nice gaming experience.The gaming of Fable is unique and fascinating!",
            "review_score": "1"
        },
        {
            "review_text": "As a Fable veteran, I can honestly say that this game is great. It takes me back to the days where I was spellbound when it first came out. For the high definition remake: It's a refreshing look on the franchise. They have polished the graphics that, for me at least, is a nice addition. While I do think the price is a little much (then again, it almost always is for HD editions), I am happy with my purchase. Fable is a great fantasy RPG, and it continues to enrich my gaming experience years later with this HD update. I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Look i know this game is getting a lot of mixed reviews, but this is a great game! The sounds are so much crisper and seeing all my favorite heroes in HD is freakin sweet.  Pro: Still great story line! HD is great! Decaptitating bandits while wearing a dress and a redhead wig! LONG story line, up 15 hours of gameplay! Love how they added a heroic difficulty to the game!  Con: Main hero face model looks awful, had to go through game with helm on to cover it up. ...thats it really haha.  I love this game and would recommend it to other new or old gamers who love the series, except Fable 3, nobody likes that game... When they make a HD remake of Fable 2, i will be grabbing that!",
            "review_score": "1"
        },
        {
            "review_text": "Wether you played Fable 10 years ago or not, do yourself a treat. You can't really call it the best RPG of the past decade, but it's one of the few you'll get back to with pleasure years later, as I did.",
            "review_score": "1"
        },
        {
            "review_text": "Fable Anniversary is a great remake of an amazing classic.  I also feel the huge ammount of complaints some people have been having with this game to be very negligable.  Negligable Complaints:  Art style, A lot of people were expecting a more realistic art style for the game instead of a slight cartoony/fantasy look. I feel the art style the devs used works VERY well with the game, and increases the ammount of charm the Fable games give, so far everything I have seen looks asthetically pleasing.  Not RPG enough, If you have never played a Fable game, you MUST realize before playing that this game is NOTHING like an Elder scrolls, Dark souls, or Witcher game. Fable is VERY casual in comparison, and doesn't take itself nearly as seriously. Despite there also being a harder difficulty to choose from than normal, the game is still very much casual.  Real Complaints:  The AI, The AI of a lot of the NPC's in this game is very clunky, and a bit buggy especially when trying to get people to follow you.   Bad cut scenes, During a lot of minor dialogue cut scenes, everything in the background seems to stop moving except for you, and the NPC you;re talikng to. This can lead to some very distracting, or awkward backgrounds with NPC's just frozen in the middle of an activity. Also the audio during chapter progression cutscenes is very low quality, and even crackles at times like the original game.  The $35 asking price, $35 dollars is just way to much for ecentially upgraded visuals, and audio especially when the original, and its Lost Chapters DLC are available on Steam as well.  Over all though this game is extremely fun and very replayable The Achievments are also a nice bonus, especially since most of them leave you with two different methods to unlock it, so the path / play style you choose won't impact if you can earn the achievment or not.",
            "review_score": "1"
        },
        {
            "review_text": "finally an update of the classic. controls well, and looks great. other than some very minor glitches ( primarily in combat) this is an amazing, much needed update.   a must have.",
            "review_score": "1"
        },
        {
            "review_text": "Not the best HD remake/port I've played, but if you liked the original Fable (which I did), then this is that (bugs and all), so should enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "I am loving the remastering of a favourite game from my past, but there is a major bug still in the works (either connectivity to the server or some overlooked animation problem) regardless, the game lags to high hell mid combat then regains it's composure just long enough to allow you the gripping visual of your own death. If this game is to be the wonderful rebirth of a long loved game series, this needs to be dealt with. Untill then, I cannot recommend this game, you're better off dusting off the old console version and playing through all the glitches we found the first time through.",
            "review_score": "1"
        },
        {
            "review_text": " First Fable is outstanding, colorful rpg. I fell in love with it in 2006....  But this is not a good remake! ",
            "review_score": "-1"
        },
        {
            "review_text": "Updated Review They have made a few updates that have added mouse support for the menus including the inventory menus, also added more keymapping so most of the commands are in there. I still think that the original art style was better. Because they have fix the major issues that made it a pain to play I have changed the review from 'not recommend' too 'recommend'.  Original Review: 13 Sep @ 4:47pm The menus do NOT have any mouse support! you only use the keyboard for menus, keymapping is very limited.  The graphic upgrade is not very good. The textures are not sharp and the changes to the faces are weird .    I would recommend just getting 'Fable The Lost Chapters'.",
            "review_score": "1"
        },
        {
            "review_text": "No idea why people hate this port so much, I had zero issues with mouse + keyboard, game ran flawless (UE FTW). Wish I could stay in Albion for longer but I'm not really someone for replaying story modes. For anyone looking to check out the Fable series this is a solid start, for anyone who has played the original years ago I highly recommend playing this remake.",
            "review_score": "1"
        },
        {
            "review_text": "This is my first in depth review of a Game here on Steam.  I'll divide my review into the typical; Good, Bad, And Ugly. I hope you find my review helpful in more way that one.  Good: Graphics overhaul; The graphics were improved drastically since the release of TLC. Lighting was improved, as well as minor details such as foliage, bumpmapping on armour and weapons. The character models recieved smoother animations, along with better voice recognition so the character mouths don't look so rigid or twitchy. The lighting and shadows were also improved to give the overall look of the game a much greater atomosphere.  Sound; If you notice one thing like I have, it's that most, if not all of the original sounds, from combat, ambient sounds, to the sound track, sound exactly the same as they did in the original and TLC. I'm glad they decided to go this route as to keep a sense of nostalgia. No use redoing what you already had done, right? Now don't get me wrong, a lot of the voice acting in the Original Fable along with TLC was attrocious by any means. They could have gone out and tried to rerecord all of the voice acting, but it's been several years since the original voice actors recorded. Also, it wouldn't be much of an 'Anniversary' Edition with different vocals. I'm glad they decided to keep all of the original voices, because it brings back memories from when we played the original and keeps continuity.  Mod Support; Lionhead has gone out of their way and addedgiven us a completely modable version of the game, even though it is quite limited as of right now. Just think of wht people could do. They could add entire new quests, create new weapons, new spells, new environments, and a plethera of other content. I'm waiting to see what the entire community has to offer .  Now for the Bad.  Keyboard And Mouse Support; When TLC launched for PC back in the day, it had a UI designed for PC users in mind. The in game menus had mull mouse support and you could rebind keys to fit your unique play style. This time around, they developed the game with Console controls solely in mind. Annoying and trivial key presses to navigate the menus, keys rebinding themselves or failing to bind after changing them(in my experience.) It's almost as if they want PC players to go out and buy 360 controllers for their PC's just to play this game. I hope they're able to fully reimplement Mouse Support in the coming updates.  Paid Addon DLC; I can't really understand why they are doing this. It seems as if they're taking a page straight from EA's play book when it comes to addon Content. $15 just for some extra weapons/outfits that aren't even better than what you can find already in the base game? I can maybe understaing having maybe a season pass if they were to release some extra story missions, or even to have you play as another person in a paralell story. But that wasn't the case.   Last but not least, The Ugly.  Reworked facial models; I can understand revamping the textures and models to utilize the newest technology, but they blew it when they completely recreated facial modles for most if not all of the main characters, including The Hero. All of the faces we grew to love and hate were completely scrapped and the one's we were given weren't all that good either.  Character Progression; Yes, The same hack and slash/Grinding for Experience mechanic is still there, but there was no deeper involvement than that. The same body types, from Slim through Obese, are still the only options. In some of the preview videos for the skill trees, The Hero can be seen as a person with near body builder proportions. But we don't really see that in the game(at least I haven't, if there's something I'm doing wrong in game, please let me know.)  This concludes my in depth review of Fable Anniversary. I would recomend this game to anyone enjoyed the first one who is looking for a visual upgrade, just don't expect anything spectacular.   *This review is based soley on my personal perception and experience in playing the game. This review is not based on numers or facts, just opinion.",
            "review_score": "1"
        },
        {
            "review_text": "If I look over to my left and see my closet with CD's I can spot Fable: The Lost Chapters. This game is a revamp graphic-wise. And it's amazing. I really liked the fact that the achievements also had some humor in it which made trying to get them even more enjoyable! Sadly there's isn't a lot of new content except mostly cosmetic stuff... Nice game though!",
            "review_score": "1"
        },
        {
            "review_text": "No idea why people hate this port so much, I had zero issues with mouse + keyboard, game ran flawless (UE FTW). Wish I could stay in Albion for longer but I'm not really someone for replaying story modes. For anyone looking to check out the Fable series this is a solid start, for anyone who has played the original years ago I highly recommend playing this remake.",
            "review_score": "1"
        },
        {
            "review_text": "I've been a Fable fan since the original, the game is one of the best of all time in my opinion the game has high replay value. The only reason anniversary has some negtive reviews is because like any other game on day of release it had some glitches which have been resolved it now runs smooth. I loved this game back then and I love it now.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously, just buy the original, much better",
            "review_score": "-1"
        },
        {
            "review_text": "full of nostalgia and still fun as ♥♥♥♥.  updated: issues that people have been complaning about are fixed (most critical bugs are fixed and mouse is now fully supported). the PC dev really do their best to make decent port . if you still prefer TLC version, it's okay. but remember that this game is not a remake, it's a remastered, which mean they improved the graphic engine instead of messing up the gameplay. the graphic is obviously better than original version so it's totally worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "Generic story, generic world, generic characters and very simple, basic gameplay. Press the attack button to win. I was mashing x on my 360 controller the whole time and had no problem with any enemy. And then getting the solus greatsword halfway through the game which is the best weapon in the game and maxing out my slow time ability, my god. They updated the game adding a higher difficulty in response to how easy the game was. The problem is they couldn’t balance it. They added tougher enemies, for example instead of normally fighting wasps in the starting areas you are now fighting against bandits that kill you in three hits instead of eight or so. This would have been fine but the combat mechanics are not built for higher difficulty because of how basic it is. There is only one attack button and there is no way to predict enemy attacks like in dark souls for example so the enemies attack animation hits you in less than a second and takes of half your health bar and blocking and dodging is so clunky it’s not even worth it. So you have to choose either one of the easiest games of all time or really unfair difficulty for the sake of it being difficult. I mainly focused on the main story because I wasn’t into the game much to do much of the side quests. The main story isn’t very long took me 10 hours to beat. I could not get into this game at all I thought everything about it was so bland, basic and dull.  4/10 (Mediocre)",
            "review_score": "-1"
        },
        {
            "review_text": "This is the first time I've whritten a review. I personally bought this game for the Heroic difficulty. I played the original so much that I almost memorized every little detail, prolouge, etc. But then it just became so boring casue you can be pretty much be immortal spamming the ♥♥♥♥ out of magic potions with the phy shield up. So I bought this game, put it on the Heroic, and I just couldn't believe that I actually died like 10 times in an hour. If anything that is the best pro of the new HD relase, of course I hadn't played the game since the 360 came out and I was having a hard time with the controls.  I also agree with a lot of the negative, it's annoying how they have released the first game like 4 times already. I really wish for fable 2 to be on the pc. I love the first game but I really like the 2nd one too. The third one is a meh and can go die.",
            "review_score": "1"
        },
        {
            "review_text": "I am pretty surprised at all these negative reviews. I really don't see what the big fuss is. Self-entitled kiddos is my guess... Anyone outside of that should be ashamed of themselves for acting like one.  To be honest, I wasn't wanting additional content. I wanted a Fable experience exactly how I recall back in 2004.   On those grounds, Anniversary delivered tremendously.  Fable was a staple of my young adulthood. I beat the thing 20 times before Anniversary released, and after recently purchasing the original TLC for the PC; I really suffered through not having controller support. I ended up using Xpadder, which really sucked due to limited movement.  The added controller support, along with a redesigned UI really addresses the weakpoints of the original game.  The game plays on a completely new engine - Unreal 3, which makes it look incredible. That, coupled with the massive effort to retexture the game really gives the graphics a kick to make it competitive with current releases.  Fable Anniversary also features an audio overhaul, where some parts have been completely redone. No more out of sync voice overs with the character animations!  The majority of people downing this game are ignorant. I've watched people of the community refuse to buy this game for petty reasons like no more silver key glitching with hero saves, or no ability to play as a female. Those are features that were purposely left out because they weren't intended in the original game. These idiots are seriously bashing the game because they fixed bugs from the original...  Overall, if you enjoyed the original game, then you are bound to enjoy Anniversary. As a Fable series enthusiast, and longtime fan of the game; I can definitely say that Anniversary's graphical rebuild does the original game justice. The added controller support and UI overhaul really make the game a much smoother experience on the PC!  It was just like experiencing the original game for the first time again - and in my opinion, you really can't put a price on such a great feeling of nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "„I like it.“ - This was my original review.  Now there i saw 4 people disliking this review I want to edit it and explain why I like the game. Fable was my childhood and will be my favourite game forever. This remake of Fable TLC isn't „bad“ or sth like that. It has better graphics and a new gamemode, which makes the game a lot ♥♥♥♥in' harder, so why are there so many bad reviews you might think. Most of the negative reviews are very old and were written because of the negative sites of the game, which not really exist anymore. For example, when the game came out you couldn't use your mouse in the menu - now you can. The bugs that were complained about are fixed and if you look at the reviews for Xbox360 you can clearly see the game is very good and there are also not as much negative reviews as on PC, which probably is, because they never wanted a cursor based interface.  The only thing that I can really understand as a reason to not review this game is the price. The game costs 30 bucks and is exactly the same game as the original Fable TLC, but has better graphics and so on.  There you know Fable is my favourite game, it's not really weird that I bought this game on the release day including all DLC's.  I finished the game twice ( once easy mode, once hardcore mode ) and all I can do now is to highly recommend it to anyone, because it's just as great as the original.  // If I made any mistakes in this text, or you don't agree with my review, feel free to dislike or comment .:)",
            "review_score": "1"
        },
        {
            "review_text": "   Worst optimization ever  ",
            "review_score": "-1"
        },
        {
            "review_text": "I've loved Fable since I was a kid, I remember playing it for hours on my Xbox and having the best time of my life. When I found out it was being remastered, I was so overjoyed and couldn't wait for the release!  I was lucky enough to play the Beta and I loved every second. It plays brilliantly, the controls are as smooth as ever, the graphics are beatifully retouched so you can see how much time and attention was put into them. Its a fantastic remaster, it hasn't overhauled the game which is great because Fable is amazing enough to not need changing and its a nice way to rediscover childhood memories.  If you love Fable as much as me, you HAVE to play this and its well worth the money! Its fantastic to replay on PC aswell as Xbox 360. If you haven't played a Fable game, or you love RPGs Fable is a great starting point for anyone. It truly captures what I believe is the definition of an RPG.",
            "review_score": "1"
        },
        {
            "review_text": "It'll be worth it when it's 50, maybe 66 percent off minimum and some more mods've been released. Other than that... -The graphics update makes the characters look like disproportionate wax dolls -The menus lag just enough to be annoying -The inventory menu, which was perfect in the original, is AWFUL in this one -The level up system's been 'upgraded' to Fable 2's standards (the hell's up with that, Lionhead? Nobody who actually played Fable liked Fable 2's level up system) -The keyboard and mouse controls are almost unusable (do NOT buy this without an Xbox or PS3 controller) -The Xbox controls don't allow for any customisation, only the presets for Fable 1 or Fable 2  Honestly, we all knew Peter Molyneux hated his fans, but this takes the cake. Good job Peter, you've done what we all thought was impossible - you've ruined one of our favourite games of all time.",
            "review_score": "-1"
        },
        {
            "review_text": "I did indeed did this for a cheevo",
            "review_score": "1"
        },
        {
            "review_text": "I love the nostalgia feel of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Oh well, I expected more. I tried to enjoy this FUC- I mean game, but it's just so DAMN SLO- I mean uncomfortable. Dont get me worng, the original Fable series was amazing 100000/10. But this ♥♥♥♥ING PIECE OF SH- I mean game doesn't know what a good camera angle is.    Do not buy this PIECE OF SHI- I mean game, it's really bad",
            "review_score": "-1"
        },
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "I am really enjoying this remake of Fable I am also a player of TLC and yes it was easier to do everything in TLC but the remake is also really well done. Another good thing about this is that people want to play fable for the first time and never knew what it was its a good starting point for new players to see how games were done 10 years aog., From what other players have said it is hard to navigate through the menus. It is as first but if your using a controller it just takes a few seconds to learn how to navigate throught he menu and learn how the new contorller 2/3 settings are mapped out other than that this game is a good remake and brings back quite a bit of memories that I have sepnt in TLC. IF you haven't played Fable and would like too this is a good game to get you started I would recommend this game to players who want to relive the original Fable or to new players that are wanting to see what fable was all about back when it came out.",
            "review_score": "1"
        },
        {
            "review_text": "I was very excited when this game was announced, however, I've tried to change settings, and once you're in the 'Advanced Options' menu, there's no way out. The menu says to use the backspace key, but that didn't work. I had to use task manager to quit out of the game. There's been about 3 updates since it's release, as of writing this review, and I think I'll give the game a few more weeks for more bugs to be fixed. Until then, I cannot recommend this game, as it's key mapping is non-existant in some menus.   I will rewrite this review once more bugs are fixed.",
            "review_score": "1"
        },
        {
            "review_text": "While I can't deny that this game has some issues, such as the lack of proper mouse support and some framerate issues, in my opinion the enhanced graphics, audio and controller support more than make up for this. Even though I have to run all the graphics settings at their lowest possible setting (due to my crappy pc), the game still looks amazing and feels great to play.  Pros: Great graphics and sound, Plays great with a controller, still has the same great story and gameplay it had 10 years ago  Cons: Not great with mouse and keyboard, had to fiddle with NVIDIA settings to get it to run properly, and when you hit someone with a sword it still sounds like you're slapping them with a wet fish (which, incidently, is now an actual weapon in the game)  If you're like me and prefer controllers (I played with a 360 pad), then I recommend this. If you prefer mouse and keyboard, I'd say go and buy The Lost Chapters (this game without the graphical and audio upgrade)",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game...then got my ♥♥♥♥ wet! thats how good m8...thats how good",
            "review_score": "1"
        },
        {
            "review_text": "Fable is my favorite game serie of all time! 'Fable Anniversary' gives something new to the Fable universe but still not. If you haven't played any 'Fable' before I highly recommend this one, This game is the first in the series , and it provides a whole new way of thinking about the game-industry. From my own opinion 'Fable 2' is the best game in the serie and in the world. If you like Adventure, Action and RPG then this game IS for you to play! Pick it up now if you don't want to miss an opportunity, a new history, a new life!",
            "review_score": "1"
        },
        {
            "review_text": "I dont understand why people give this game bad reviews, Its amazing and has a good story, good controls and its fun  Please dont read the negative reviews because they lie",
            "review_score": "1"
        },
        {
            "review_text": "It's not as good as fable tlc but it works. Duger i krig 10/10",
            "review_score": "1"
        },
        {
            "review_text": "just click download....",
            "review_score": "1"
        },
        {
            "review_text": "microsoft are ♥♥♥♥♥♥♥♥s FACT",
            "review_score": "1"
        },
        {
            "review_text": "Before being disuaded from buying Fable Anniversary by the countless bad reviews, try comapring the time spent by playing by the people who didn't recommend to the people who did.   It's important to remember that this is a remake of a console port. That said, if you buy Fable Anniversary without having played the original and you are expecting a AAA RPG adeventure prepare to be disappointed. Very few things are changed from the original game, aside from the visuals, and aside from the addition of extra weapons and armor from the pre-order bonus, there doesn't seem to be much in the way of rebalancing, save for the addition of the 'Heroic' difficulty. Most people's gripes with the game seem to be from the controls and lack of mouse support in the menus, my recommendation is to have a gamepad. Believe me it will make life a lot easier on you.  Storywise, the game is unchanged from TLC, become a Hero, take on quests, discover the secrets to your bloodline and the power that awaits you. Same old, same old.   Visually the game does indeed look better than TLC, except for the face gen they used. Half of the NPCs look like their eyes are trying to escape from their head (lots of derp faces to be seen). The game does look more dark and grim than it did before, where it was more cartoony.  Your biggest foe in this game isn't going to be the bosses or the small hordes of enemies, instead you will find youself fighting with control over the camera. If I can say anything bad about this game, it is that the camera controls have not aged well AT ALL! The bad camera controls are especially noticable in locked-on combat and questionable angles while you're gambling.  Performance wise, the only real issue I have with the game so far is the occasional audio stuttering, my friend didn't seem to have this issue so it might be isolated to my rig, but it's still something that bugs me.  Also if you're an achievement ♥♥♥♥♥, 18 hours of play was all I needed to get 100% of the achievements, so there's that too :P.",
            "review_score": "1"
        },
        {
            "review_text": "This was always my favourite of the Fable series. I'm so glad they broke away from the Xbox exclusive BS and gave us the aniversary edition too, it looks great!  Admittedly it was a bit dodgy on release but it's much more than just a port, there are modding tools and the devs have been hard at work fixing bugs and responding to suggestions from the community which is always great to see. There is also a beta branch for those who want the latest changes and aren't afraid of minor bugs.   I use an Xbox 360 controller to play and I've had zero issues with that control scheme, if you don't own one and are insistent on using K/M you might want to watch the forums until those issues are fixed.  Hopefully this is a sign Lionhead/Microsoft are trying to mend their relationship with PC gamers after abondoning us for so many years. Not all of us want a locked up peice of slow hardware thats only useful for one thing!   Thank you!",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I have played the CRAP out of TLC. I've played this game for quite a bit of today and have come to the conclusion that most if not all of what these horrible reviews are saying is not the case. I have a mediocre computer, nothing special... this game has not frozen for me once, it has not demonstrated slow load times or high FPS or ANYTHING of the sort. This remake is more than worth it if you're a big fan of the original.  To be completely honest the ONE problem I have with it is the clunkiness of your characters head movement. (Which was always clunky to begin with, but now with the updated graphics it just looks ridiculous at times). I quite frankly love the game already and yes, the menu navigation is a bit ridiculous but at the same time THOSE THINGS ARE NOT 'GAME BREAKING' like others have tried to tell you.  All in all it's still a great game and I would highly reccomend it if you want an updated version of the original, oh... and yes... Maze IS white.  Pros: -Beautifully updated environment that actually took me breath away when first walking into Albion. -All the core elements have not been altered to the slightest degree. (Disregarding the menu interface) -Great game with hilarious puns and decent action that has the potential to keep a fan of the genre hooked from start to finish. -No frame rate problems as of yet,  -Modding support? Yes please.  Cons: -Clunky player character head movement. -Menu controls do frankly -SUCK-. -The main character's face is now ugly as all hell.  There you have it, no misplaced hate... or misplaced love... just my honest opinion on what I think of this remake. Still a great game and I look forward to finishing it.",
            "review_score": "1"
        },
        {
            "review_text": "Game seems fun, except for the huge amount of lag spikes you get in certain areas. Every second the sound and screen freeze for 5-10 seconds which makes the game unplayable. After 1,5 hours the game started to freak out, no fixes are available yet. All other games run fine.  A waste of money for now, waiting for a fix.",
            "review_score": "1"
        },
        {
            "review_text": "Despite everyone hating on it, i love it, i play it with a controller on traditional scheme because thats how i first played it on xbox, I do have TLC on pc but the menus and mouse and keyboard didn't suit it for me.  The game is fine, because i use a controller with many controller supported games now minus FPS, thats why recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "the game is bug ridden. After Oakvale i cannot walk for 5 steps without lagg spikes and game crashes. fix please!",
            "review_score": "1"
        },
        {
            "review_text": "Able to woo a man and then take him into the forest and beat him to death. Then proceeded to run around town kicking chickens and punching children. 11/10   Seriously though, I would recommend this game for fans of the original. It captures the charm and the feeling that I felt all those years ago when I first rushed home and put it into my XBox. I am yet to see any of the issues with framerate and I have no issues with the controls (I use an XBox controller) If you are a fan of the original, this is a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "Getting randomly frozen for a second a lot and game just crahsed, an update needs to come other than that it's exactly like fable but better graphics and it's amazing",
            "review_score": "1"
        },
        {
            "review_text": "keeps shuting down on me.",
            "review_score": "-1"
        },
        {
            "review_text": "Majority of negative reviews complaining about one thing, mouse and keyboard.Good game though, a little fuzzy graphics, but still. I can't justify the current price of it though however.",
            "review_score": "1"
        },
        {
            "review_text": "great game. loved the original but this remastered version just keeps crashing every 20 mins",
            "review_score": "-1"
        },
        {
            "review_text": "I was very disappointed with this game. It lagged like crazy. It took forever for the mouse to even go across the page. I'm sure it would have been a good game if it didn't have so many glitches. I wish they would fix these problems because I was really looking forward to playing it. Everyone kept leaving reviews about how bad the lag was, but I didn't listen. Sometimes it's a good idea to read the reviews before you purchase a game on steam.",
            "review_score": "-1"
        },
        {
            "review_text": "idk wtf happened but it is absolutely the worst gameplay compared to wow and csgo. theres no way its my comp",
            "review_score": "-1"
        },
        {
            "review_text": "Better off playing Fable: The Lost Chapters.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible graphics. Eww.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like the first game you will like this. Menus are simply terrible but the rest is fine. Controls take some getting used to and its probably easier to play with a controller.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most fun RPGs made to date. Another masterpiece by Peter Molyneux. It is so unfortunate that we will never see the like again thanks to the toxic millennial brats.",
            "review_score": "1"
        },
        {
            "review_text": "  This game if so good",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic mother ♥♥♥♥ing game, :D Ive been waiting years and such for a retexture of the game or so. THIS JUST DOES IT! this game is ♥♥♥♥ing wicked, Fable the lost chapters for life &lt;3    :-) hope fable 2 comes to pc, one day",
            "review_score": "1"
        },
        {
            "review_text": "Came back to change the review because they fixed the game (well, once I remembered that I'd given it a bad review). I haven't actually played the game a lot, but I do really like it. However, the thing that stopped me from continuing with the game was the controls. Using the controller became really annoying for me. Just doing simple things became the most infuriating chores. I've never played the original version but from what I understand, it's not that different and uses keyboard+mouse. You'll probably have more luck buying that instead.",
            "review_score": "-1"
        },
        {
            "review_text": "HERO, YOUR HEALTH IS LOW.",
            "review_score": "1"
        },
        {
            "review_text": "3123123123122113212",
            "review_score": "1"
        },
        {
            "review_text": "Fun addicting and easy get the hang of.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game to just relax to, I've seen people complaining about certain spells making it easy for the harder modes, if you don't want easy mode don't use those abilities simple, those abilities only really exist for those who really can't take the hits, and who are having problems finishing the game. If you are finding it to easy still all you have to do is just unequip your best gear. The game plays great with simple dynamics, which are easy to learn and pretty simple to master. Players used to Dark Souls and watching for certain animations, will find that for the most part you can still do that if you watch the enemies carefully (enemies will sometimes swarm you, and unlike some games won't take turns on you) You can always try and take out the ranged/summoners first, while dealing with some not all of the adds which they create.  I enjoy playing this game, it's great for those who tend to get upset and angry and break stuff, this is one game where you probably won't really do that. Just your standard adventure button masher. Fun for the whole family.",
            "review_score": "1"
        },
        {
            "review_text": "I did not play original Fable but as game I think worth. Keep on mind is just a classic game remastered and game itself barely improve nothing from original. Is just a pity the workshop for this game is just empty cause nobody wanna deal with .",
            "review_score": "1"
        },
        {
            "review_text": "I loved it when it came out and i love it now!",
            "review_score": "1"
        },
        {
            "review_text": "I loved Fable when it originally released, so was pretty excited to pick it up in a sale for around £6.  Whilst the game is pretty much the same as i know and love, the game is NOT made for mouse and keyboard.  It may be ok with a controller (i dont use one) but the keyboard can be woeful, auto scrolling, poor responsiveness, just general problems.  It's still worth picking up, but be careful with the controls!",
            "review_score": "1"
        },
        {
            "review_text": "It is wonderful to see Fable return to my screen in HD. I played TLC many times years ago and have great memories from that time; I am glad that the effort was made to remaster it. I appreciate that no major content was added, keeping the game as it was originally intended. The graphics improvements and gameplay are great and the musical score still on point. I'd say Fable Anniversary deserves a 9.3/10.",
            "review_score": "1"
        },
        {
            "review_text": "I loved Fable TLC and I pre-ordered Fable Anniversary as soon as I found it on Steam. When it came out, it was lagging, it was bugged and unplayable (in my opinion), but they quickly fixed most of the bugs. I played through it a couple of times a year ago, and did not encounter a single bug or lag. The game was running smoothly on my (bad) laptop. Now that I have a better PC, I'm enjoying it once again.   The game is exactly as the description states. If you expect more story or new characters, it's not going to happen in this remake. I personally love the new visuals and audio and would recommend buying it, especially if it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Get the original.  This one looks worse with character models and ruins a lot of the appearances of NPCs like Maze and even the hero at times. Animations were not updated so game looks clunky as ♥♥♥♥. It is at the very least just as buggy as the original if not more so. And honestly with the mixed in graphical upgrades the fidelity is all over the place. So I'd say at times this looks WORSE than the original game while also running far worse with all the bugs.",
            "review_score": "-1"
        },
        {
            "review_text": "Ty god we have option to experiance Fable again in HD! I had no bugs or peformance issues , great remaster! It's kinda sad because i just now noticed how old I am , i remember myself playing Original Fable 11 years ago o_0 .Still one of my favorite games! Have Fun!",
            "review_score": "1"
        },
        {
            "review_text": "I liked the game. I played it earlier when it was new and came back to it now. The story is nice, overdrawn and fun, nothing too serious. The graphics are easy on the eyes, even though a tad repetitive (looking at the NPCs).  I found combat to be rather easy, I didn't really need to master it in order not to die at every boss. I liked it that way, but I know for many it would be boring. I'm not one to enjoy hacking that same boss ten times in a row to get forward, I play for the story.  One thing that kinda annoyed me was the inventory system that required like 10 clicks to finally get to the item that I wanted, even though I knew perfectly well where to find it. Oh well, can't have everything :)  So if you can live with such minor drawbacks, I think you might like this game!",
            "review_score": "1"
        },
        {
            "review_text": "A worthy update of one of my favourite games of all time. The hero's face is, however, incredibly ugly and weord-looking compared to the original, but chuck a helmet over his ugly mug and you'll hardly notice it as you murder townsfolk and buy their property to rent to the next batch of cattle.   Or do good deeds but...   Gotta pay the bills somehow.",
            "review_score": "1"
        },
        {
            "review_text": "Fable, but it looks nicer and runs better than the original. A worthwhile upgrade, I'm glad I finally gave it a go. Some of the bugs have been fixed, and some haven't (Don't agree to marry the crazy lady who is locked up during the Lady Grey questline, as it will prevent 100% achievements). The new 'Hero Mode' was a nice touch, though after the Orchard Farm quest with Whisper I never really felt too much of a challenge, similar to in Fable-TLC. While it might not be a perfect game, I would recommend it to fans of the series and anyone who is looking to play through the original story again. To those who have never played the game, I would recommend this version over the Fable-TLC as the price is only marginally different. If you haven't played Fable yet, this would be a great way to give it a go, and you should. :)",
            "review_score": "1"
        },
        {
            "review_text": "NOSTALGIA MAKES ME FAP M8",
            "review_score": "1"
        },
        {
            "review_text": "Why would they change it from having all your spells on the scroll thing to a max of 8 it makes no sense",
            "review_score": "1"
        },
        {
            "review_text": "The game crashes. Look for 'fable anniversary has stopped working' on google.",
            "review_score": "-1"
        },
        {
            "review_text": "Favorite Game simce it came out on the original xbox",
            "review_score": "1"
        },
        {
            "review_text": "Nice to go back and play through after all this time.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, good graphics and excellent storyline. Also has the ability to customise your character and choose to be the hero or villain.",
            "review_score": "1"
        },
        {
            "review_text": "The use of mouse for the menu must be enabled immediately...I hope that we'll receive an update soon for this, because the game is far from playable..   Update: The use of mouse has really changed the whole experience. Thanks",
            "review_score": "1"
        },
        {
            "review_text": "one of the funnest and most relaxing games I have played!",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I have always been interested in the Fable series. So when the steam summer sale starts and I notice this game around $10, I couldn't resist it, and I regret nothing, in fact I do regret not looking into the series earlier. Even in 2016 I feel like this game is realy good, It looks nice and has good combat for an older action RPG. I also realy liked how your character model through out the game, like where you grow more muscular as you upgrade yourself, and how you gain scars through out the game. The story is a bit short for todays standards but because of the good and bad paths that you can take it pushes you to go through multiple playthroughs to get the full experience, as well as the new hard mode. I really enjoyed this game and it will definutly be one of the Action RPG that i will use to compair to others that I play in the future. I hope that someday steam will get a Fable II aniversary, or even the normal game.",
            "review_score": "1"
        },
        {
            "review_text": "I like this remake! Twin Blades looks odd but he kinda always did all long arms and short legs. I would pay full price if I could afford it and then just play it maybe once a month when ever the Fable fever would hit me. I used to play Fable 3 but for the most part that game sucks, however for a brain dead drunk person it can be good.  I want to see Fable 2 remade and intergrated with this one. There was always talk of raising a family then dying of old age only to take control of the child you had raised! I want to see that but make Fable 1 the starting point since Fable 2 is very similar to the map of Fable 1.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would 'Your Health is Critical!' again",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of my all time favorites when I think of a game I put plenty of hours into as a kid this is the game that comes to mind playing this game brings back so many good memories from when I was younger and it makes me feel sad there most probably won't be another fable as lionhead have shutdown but this will just keep the good memories of there games, I jsut wish they would of brought out a remastered version of 2 and 3 (by the way 3 was my favorite :D). This game should be voted for an award.",
            "review_score": "1"
        },
        {
            "review_text": "The nostalgia.  Also the mini-games. I swear I spent more time on those games than the actual game.",
            "review_score": "1"
        },
        {
            "review_text": "Better than I remember it to be!",
            "review_score": "1"
        },
        {
            "review_text": "The original Fable given a much appreciated facelift (something its successors could also benefit from), made just before the apex of Lionhead Studios prominence, I would still consider the first entry into the series to be the best. Simple but enjoyable concepts and gameplay, Fable was mostly criticized for a lack of depth and a failure to live up to the famous Molyneux hype. As someone who never was swept up in the pre-release fervor, what I found was enjoyable, albeit short game, with an engaging story and topnotch character. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is still awesome even years later. I play it every Christmas. Get on sale and enjoy. Single player, 3rd person, fairly linear RPG with some upgrade elements.",
            "review_score": "1"
        },
        {
            "review_text": "I did this for the badge! It is a great game though.",
            "review_score": "1"
        },
        {
            "review_text": "As much fun as it was 2004 on Xbox. Maybe even a bit more fun",
            "review_score": "1"
        },
        {
            "review_text": "This game would never get old. I'm still w8ing for 2nd and 3rd part coming on PC.",
            "review_score": "1"
        },
        {
            "review_text": "Game is the best of all the Fable series and is worth replaying.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Remake of the original. Very fun and hilarious. Not much bugs/glitchs nor lag.  the modding software could have been better though",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games i have ever played, I played it when i was 13 years old (13years since) on xbox. Great story, alot of quest and funny side quest to do. U can also change the story depending what you do. I just love this remastered game!",
            "review_score": "1"
        }
    ]
}