{
    "app_id": 288750,
    "name": "Hotel Collectors Edition",
    "release_date": "2014-04-25",
    "developer": [
        "Cateia Games"
    ],
    "publisher": [
        "Libredia Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 7,
    "negative_ratings": 18,
    "price": 4.99,
    "description": "Reveal the great mystery that lies behind high walls of the Bellevue hotel!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/288750/header.jpg?t=1529673028",
    "minimum_requirements": "OS: Windows Xp / Vista / Windows 7 Processor: 1 GHz Memory: 256 MB RAM Graphics: 32 MB 3D video card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Hotel - Collector's Edition (Cateia Games, 2010)  While playing I planned on writing a recommendation for this game. Now that I've finished it I realise the thing as a whole has little merit and, aside from recommending it to long time adventure gamers, I honestly can't give a thumbsup to what I've experienced here.  Why recommend it to long time adventure gamers? Because we'll play anything that is an adventure game, and so if you are one and you havn't yet played Hotel you may as well go and get it over with.  The odd thing is that I really love the core concept: you have a fancy hotel somewhere in France, an accident has resulted in a young woman's death. You're a police inspector and your boss believes it was murder. Will you find out the truth? And what's with the weird occult symbology all over the place? And that's how the game starts; for about an hour you feel like you're building up to something interesting, then it all quickly falls apart as the developers, who clearly had no idea where to take the story, slather on layer upon layer of hoodoo and fantasy that ill-suits the tone of what has gone before. In other words, they quickly ruin a good murder mystery with what can only be called nonsense, in the process grasping at various mainstream clichés as regards the supernatural.  Note, the game is short. I logged a bit more than two hours, and that includes exploring the collector's edition extras. Regarding those extras, they aren't worth buying the game for, for the simple reason that Hotel takes up less than 300 megabytes, making for an extremely compressed package. That means everything that counts as art assets including audio is incredibly downgraded to fit the meagre file size. This, I presume, was done to make the game better fit portable devices (there's also a version for smartphones and tablets). On PC however, you end up suffering because of the low quality assets being run through much better speakers and a much bigger screen than you're likely to find with your mobile device.  In terms of puzzles Hotel is fairly easy. There isn't much to interact with. And oddly enough this creates a nice flow through the game, and I became quite engaged early on, despite the game not really taxing my grey matter. Of course, then the hoodoo starts.  SCORES  Graphics: 35%  Extremely compressed pre-rendered 2D backgrounds. 3D models lack detail. Character designs are fairly generic and lack outstanding features. The game starts off with one of the worst pre-rendered FMV sequences I've ever seen. I mean, straight out of 1992. It really is that terrible.  Sound: 45%  Not much in terms of atmospheric sound effects. Only one particularly catchy tune. No voice acting outside of the horrible introduction and ending FMV sequences.  Execution: 35%  As an adventure game, the mediocre first half manages to improve on Cateia's Kaptain Brawe; the second half throws all that away.  Addictiveness: 40%  First hour, I wanted to see what happens next.  Second hour, I wanted to get it over with.  Overall: 34%  Like I wrote before, if you're an adventure gamer you either already own this game or you were planning on buying it anyway. (Which is how I ended up with it.) For others, forget about it, there are much better adventure games out there if you're only interested in dipping your toes in the adventure game pool. Buy the likes of Culpa Innata, Perry Rhodan (sadly not on Steam), Jack Keane, Lost Horizon, etc. instead.  Heck, now I feel like making a list of the best adventure games.",
            "review_score": "-1"
        },
        {
            "review_text": "An interesting storyline, but really there is no challenge to this game. It was over way too quickly.. oh, and the 20 hours I have against it is merely because I left it open one night.. in reality you will finish this within a couple of hours",
            "review_score": "-1"
        }
    ]
}