{
    "app_id": 288790,
    "name": "White Haven Mysteries",
    "release_date": "2014-04-17",
    "developer": [
        "Gogii Games"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Hidden Object",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 40,
    "negative_ratings": 34,
    "price": 3.99,
    "description": "Unravel the mystery of White Haven!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/288790/header.jpg?t=1447360944",
    "minimum_requirements": "Styresystem: Windows 7, Vista, XP Processor: 1.8 Ghz Hukommelse: 512 MB RAM DirectX: Version 8.1 Diskplads: 850 MB tilgængelig plads Lydkort: Integrated Audio or better",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "As much as a I love this game I woudn't suggest buying it. Every single time I've gone back into this game to continue where I left off an error stating 'your previous save file was corrupt. You will need to start over' comes up. Unless they fix this error I would not suggest purchasing this game. They really need to fix this bug as it's not fair to those who buy it to have to restart the game from the start everytime it's opened.",
            "review_score": "-1"
        },
        {
            "review_text": "The third time I launched it. It told me the save was corrupted and it deleted my profile.",
            "review_score": "-1"
        },
        {
            "review_text": "2016,,,still has corrupted files",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: Cheap (If you get it on sale or with a coupon) Easy Long enough  Cons: Too many campy cutscenes Lots of illogical going back and forth Low originality Like most Gogii games, won't shut down quickly (you may have to reboot your computer) Really bad science...",
            "review_score": "1"
        },
        {
            "review_text": "This was a terrible game. Short, way to easy, and little to no story. The voice acting was terrible. It advertises as a 'horror' game. This couldn't scare my 5 year old neice. Do your self a favor and buy another game.",
            "review_score": "-1"
        },
        {
            "review_text": "Played game twice and corruped file showed up 3/4 of the way through and had to start over. Not able to finish game.",
            "review_score": "-1"
        }
    ]
}