{
    "app_id": 288880,
    "name": "Pineview Drive",
    "release_date": "2014-07-31",
    "developer": [
        "VIS-Games"
    ],
    "publisher": [
        "United Independent Entertainment GmbH"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Horror",
        "Adventure",
        "Indie"
    ],
    "achievements": 20,
    "positive_ratings": 281,
    "negative_ratings": 161,
    "price": 14.99,
    "description": "A one-of-a-kind horror shocker – a game aware of your fear!Check out the improvements introduced with Update 2.0!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/288880/header.jpg?t=1516266624",
    "minimum_requirements": "OS: Windows®  Vista / 7 / 8 Processor: Intel® Core™ 2 Duo / AMD® Athlon™ X2, min. 2.8 GHZ Memory: 4 GB RAM Graphics: Nvidia® / AMD® with 512 MB memory DirectX: Version 10 Storage: 2 GB available space Sound Card: DirectX® 10 compatible",
    "recommended_requirements": "OS: Windows®  Vista / 7 / 8 Processor: Intel® Core™ 2 Quad / AMD® Phenom™ X4, min. 3,4 GHz Memory: 8 GB RAM Graphics: Nvidia® / AMD® with 1024 MB memory DirectX: Version 10 Storage: 2 GB available space Sound Card: DirectX® 10 compatible",
    "reviews": [
        {
            "review_text": " Living 30 days in a old mansion where a person has gone missing... What could possibly go wrong?",
            "review_score": "1"
        },
        {
            "review_text": "This game is not very well optimized, but I find the bit of story that is here rather intriguing. The game itself is basically fetching key after key and trying to find the door that it unlocks to progress, which can ne tedious at times trying to remember what ones you've yet to open. The atmosphere is pretty good and the scares have been decent so far. I am currently at day 7 of 30 and plan to play through. Not worth $20 dollars, but if you can get it on a sale I'd say go for it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the better horror games I have played in a long while. Graphics are pleasing, sound is superb, atmosphere is amazing.  Only the gameplay itself it quite tedious, as you are running around in the mansion for so many days, getting key after key and then running down the entire building again to see which door you'll be able to open afterwards.  But even with that repetition, the atmosphere absolutely delivers a great mixture of jumpscares as well as a steadily more and more creepy atmosphere.  I do defenitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "So many rooms. Resident Evil 1 could learn from the size of this area. So the game is to find keys and then the door and then a further key or a letter that tell a little part of history what will awaits you. So you search and search at start you have little lights and you can burn candle and have flashlight but the lights will go after a few days and you need to find your way with the matches and batteries you have and find and need to care to not waste it, sure its not so dark that you dont see nothing but it will be hard and the areas get bigger and bigger and even places you know could spawn out of nothing the keys or other stuff. The flair is great and sound too. Its not easy to die till the end missions but to avoid some scares to get achievement are little challenges. I enjoy this game, even if some days are very short if you know where to search but damn if you search at end days whole house for 1 item and your items (batteries, matches) get used one by one and you need keep danger from all sides that is amazing.   Really i like this game very much, but there are 2 dislikes 1 you cant make pictures with F12 and second you cant skip the long start (that is boring). Enjoy the scenes till the end and play 8 letters of Scarecrow (i doesnt do it but its a nice gimmick i think or watch the beautyful house (dont forget its an indie title) for every detail at SALES DAY after the game. One last thing, after all 1 room cant be open. Isnt it strange. WHAT IS IN IT? CAN IT BE OPEN? I give this title personaly 89 % so watch trailer and think about how much it is worth to you (5-10 so wait for 50-75% discount?!). Thank you for reading.",
            "review_score": "1"
        },
        {
            "review_text": "Pineview Drive, in my opinion, is a mediocre horror game that had the potential to be much better than it is. It’s not really a bad game, but it has some major flaws that really drag it down. The good things about the game are: The atmosphere is great for a horror game. The music and sound effects are excellent and really add to the game’s creepiness. The graphics are great. And the game has some well done scares. The major flaws about the game are: The game is WAY TOO DARK even with the game's brightness setting set to its highest level. You do get a flashlight but it doesn’t last long enough. And flashlight batteries in the game are few and far between. You may have to turn up the brightness and the contrast on your monitor to their highest levels just to barely see anything when your flashlight is low on battery power. When you start up the game, you can’t skip the introduction screens. And they are fairly lengthy introduction screens. You can’t rebind the keys either. It would have been nice if the game had a built in map of the mansion to help the player with finding their way around as you progress through the game’s 30 days of terror. It would have been nice if each door had its own specific name that relates to the room that it’s for. And also if the game told you which door each key is for when you find a key. These are major flaws that make me just barely recommend Pineview Drive. It’s not bad, but it’s not great either. It’s just mediocre to me",
            "review_score": "1"
        },
        {
            "review_text": "I'm not such a fan of Horror Adventure games, but this one I really enjoyed. Same with Gone Home, I went through this one without a clue what the game was about. For Gone Home however, it was quite a different story. This game actually had some scary parts.  This game has a really amazing atmosphere. At day it feels really safe, but at night.. Who knows what will happen. I eventually fled from the game cause I chickened out.. I remember having 3 keys which none of them fit in any lock. I went outside to check if the gate fit any of the keys, when my flashlight suddenly went out.. I was left alone in the dark with nothing but a far away lighthouse to keep me from turning insane. Suddenly I heard footsteps and they weren't mine. The first thing I did was close the game.  This being such more of a scary experience to me than any game that want to scare the player so consistantly is really interesting. The fact that you don't know when you should be scared and when not to is a really good part of this game.    + Good Elements  Good Atmosphere Great Sound Pleasant Control   - Fixable Elements  (as far as I have read) Too Many Days, Too Many Keys.. Odd Intro Finite batteries?   I certainly do recommend this game dispite my issues with this game.",
            "review_score": "1"
        },
        {
            "review_text": "So far so good! Its creepy enuff to keep u interested and not many bugs that I can see! Good game!",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. The story was kinda interesting. For an indie horror game, this game is quite long.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, it has good atmosphere.I know that people complain on that you spend almost entire game searching for keys but i didn't mind it, if you are lost after some time game gives you a hint. I was really into story though game doesn't give you many answers leaving it up to the player, so if you like closure and definitive answer when it comes to the story you may not like it.  My complaints when it comes to this game are that it starts rather slow what can turn off some players early and is that game is too easy what after some time may affect 'fear' factor of the game.  My final verdict is that i enjoyed this game, but sadly game isn't as good as it could be if some things were done better.",
            "review_score": "1"
        },
        {
            "review_text": "Please not buy this game, it starts out good but then youre just walking through the same rooms over and over, day after day, with so little light it hurts your eyes. By the end I never wanted to play this game again. And if youre thinking the ending will be worth it, i will save you a great deal of wasted time and tell you now it is not at all worth it. In any way. At all.  TL;DR DONT BUY!!! WASTED TIME!!!!! WASTED MONEY!!!!! You've been warned :)",
            "review_score": "-1"
        },
        {
            "review_text": "This game really did have potential.  It has a nice and creepy atmosphere with a nice mechanic involving scaring you when the game feels you 'need' it based on twitchy movement and looking around often.  However, any semblance of fun this game might have had is ruined by the actual gameplay. You wander around the exact same house repeatedly. At first you look for keys to open more of the house. Soon you're just searching for whatever usable thing has appeared in this particular day at the house so that you can progress. That's it. This single handedly makes the game awful. You literally just comb the same rooms repeatedly whilst the game occasionally throws a loud noise your way.  Terrible, and I got it in a bundle.",
            "review_score": "-1"
        },
        {
            "review_text": "At first this indie horror game is surprisingly pleasant and scary indeed, as you find yourself in the secluded house surrounded by the darkness filled with unsettling rustlings and weird murmurs. But as soon as you realise how the game works, it all immediately becomes boring and predictable. You walk in circles through the same dark rooms, meeting from time to time the same cliched jump scares. This is the exact description of the gameplay. Oh, and the ending here is nonexistent. But there is a doll. A doll, really?",
            "review_score": "-1"
        },
        {
            "review_text": "This game can suck my ♥♥♥♥. 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "It looks good. It has nice atmosphere. It has nice sounds. It's nice to try to figure out what's happened and what's happening.  ...and then you realize it. You're just doing same thing over and over again. You wake up, open doors, walk through same rooms over and over again trying to find keys which are magically appearing somewhere in those rooms you have searched dozens times already in previous days. Occasionally you find new rooms which offer nothing new, really, only more rooms to research in following days. In one of the rooms you (either new ones or old ones) you find next page of the story. When it will appear it ends the day. Sometimes you see something strange or hear something strange. That's all.  One day you just realize that you don't care that much about story that you bother to do that over and over again, walking from room to room, slowly, very slowly. There's not that much interest to find out how the story will end. Which is shame. Game could have been really good if there were genuine puzzles instead of walking around.",
            "review_score": "-1"
        },
        {
            "review_text": "tl;dr: Game is poorly optomized, laggy, and the scare mechanic is broken. Good atmophere, doesnt save the game though.   I was super excited to play the game, but quickly realized that it's almost unplayable. It's so badly optomized, I have to play with all the settings on low. Even with that, it was extremely laggy and choppy. The graphics kept wigging out. There was so much texture tearing and glitchy shadows, but that might be because I had to play with PS2 graphics. Also, it might have had to do with the low settings, but everything was pitch black in the dark. As in, I couldnt see ♥♥♥♥, even if lighting nearby. I truend up the brightness, but nothing. I understand a games need to be dark, but this was blindness in a room that had both lights on and candles lit. I had to watch through my stream to see what I was doing.   I'll give it credit, the game is very atmospheric. Too bad I couldnt see what was scaring me. That leads me to another thing. Your health goes down for no reason. I assumed the game based the health going down by your reaction, like mouse ♥♥♥♥♥♥♥ing or camera flinging or backing away or even not moving. Instead, it just randomly decides when to reduce your health. I feel like I'm playing IllBleed. I wish I was playing IllBleed instead of this.  ",
            "review_score": "-1"
        },
        {
            "review_text": "No bindable keys, and the game appears to be plagued with performance issues. The 'passing pineview forest' ran perfectly for me, which uses the same engine so I don't understand how this game runs so badly. Thinking something might be wrong with my machine, I checked the forums and people with hardware far superior to mine are having the exact same issues.  Adjusting the various graphic options doesn't appear to have any noticeable affect on performance.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I have made it to day 8 and I don't know if I am going to bother with day 9. Like the rest of the negative reviews state, you are basically just going through the house unlocking doors so you can find a key to unlock another door. No real rhyme or reason to it. In fact there were at least two times when the narrator had to say 'Hey why don't you go check out this thing' so that I could find the next key, One of them I NEVER would have found because there was no real reason to go there. I am glad I got the key for this game so cheaply or I would be really upset. If you must try this game wait until it goes on sale for 90% off.",
            "review_score": "-1"
        }
    ]
}