{
    "app_id": 288930,
    "name": "The Charnel House Trilogy",
    "release_date": "2015-04-16",
    "developer": [
        "Owl Cave"
    ],
    "publisher": [
        "Owl Cave"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Horror",
        "Indie"
    ],
    "achievements": 18,
    "positive_ratings": 381,
    "negative_ratings": 80,
    "price": 4.79,
    "description": "Witness The Charnel House Trilogy, the chronicle of one fateful night aboard a train bound for Augur Peak. Three thrilling, horrifying adventure games in one, from the depths of the Sepulchre, starring Madeleine Roux, Peter Willington, Jonathan Grier, Jim Sterling, and Ben Chandler as Grub.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/288930/header.jpg?t=1449600254",
    "minimum_requirements": "OS: Windows XP SP 3 / Vista / 7 / 8 Processor: 1 GHz processor Memory: 512 MB RAM Graphics: Integrated Graphics (512MB VRAM and above) DirectX: Version 9.0c Storage: 200 MB available space Sound Card: DirectX 9.0c compatible.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " '...and man looked down upon the earth, and the earth crawled up to meet him.' - Louis Cassell   My, my! Wasn't this an astonishing experience? When I decided to give this one a go, I wasn't expecting neither that much spiritual depth, nor such qualitative narrative.  The Charnel House Trilogy  - one game with separate acts, actually - is an incredibly well arranged psychological horror adventure.   I'd try to give you the baseline for the story, but the events, the characters that they are surrounding and their in-depth meanings are completely dependent on a perspective, and it is near impossible to define any character that we encounter within the game without pure speculation. Charnel House is what you get from Charnel House. Thus, I'll only present you some facts.  You begin the game as playing Alex Davenport, a young woman who is trying to recover from a bad break up. For some reason, she decides to go on a long train journey, in hopes of reaching the Island of Augur Peak at the end. During this odd journey, she encounters an odd British gentleman, Dr. Harold Lang, who is the curator of a museum and visiting the same island for an archeological expedition. The only seeming bond between them, is their lonely destination, and a series of uncanny encounters they shall endure during their journey.   The Charnel House Trilogy  consists of three separate acts, as if taken from carefully planned scenes from a theatrical performance: Inhale, Sepulchre and Exhale. Inhale is tied to reality, with a bitter taste of past experience. It feels old, dysfunctional and hurt. Sepulchre is the sublime passage between the real and that shadow on the corner of your eye, descending into the very Heart of Darkness, the horror itself. Exhale is the triumphant delusion, breaking the barrier between the reality that we coddle ourselves with and the cruel fact that logic doesn't work anymore. It is weaved with pure manifestation of raw emotions, raising more questions than it answers.  Three acts come together to compose an elaborate setting of carefully chosen subliminal details. The story is full of literary references, thrilling anecdotes, grave yet elegant symbolisms and interrelated details that will give a shiver down your spine when you realize their relevance. Don't expect your common jump horror. The art of absurd is the game's primary weapon against your psyche. This is a great psychological thriller.  The gameplay is no different than your casual adventure. There are some very minor puzzles, but nothing that would hinder your progress. As long as you keep exploring, the story reveals itself. Graphics are nothing extraordinary, nearly same as Blackwell series themselves, familiar and simple. Encountering something this eerie in this basic environment is probably down right uncanny compared to facing a grotesque enemy in full HD. When you finish the game, you cannot keep yourself from repeating exchanged dialogues in your head, trying to decipher hidden meanings.  If you've come to like the game, I'll suggest reading Ashton Raze's - the writer of  The Charnel House Trilogy  -  Bright Lights and Glass Houses , which is a novel that reveals some more information about the game's characters. I also recommend playing the game twice for the patient, just to watch events unfold in day light. I'll be anticipating the sequel until it comes in 2016!  Please also check out Lady Storyteller's Curator page  here  - follow for regular updates on reviews for other games!",
            "review_score": "1"
        },
        {
            "review_text": "The Charnel House Trilogy is an atmospheric and stylish point and click adventure set on a beautiful retro 2D backdrop. The simple mechanics and powerful narrative make this a truly enjoyable title with a very attractive price. It is also supported by a fantastic musical score and full character dialogue audio.   In this 3 chapter game; you begin by playing the role of Alex Davenport - a young woman who has to embark on a personal journey to Augur Peak by train after receiving some bad news. En route, you meet Dr. Harold Lang and this is where a routine train trip becomes an incredibly eerie experience. I wont elaborate on this because it will spoil the chilling and absorbing events that follow, but it will leave you deeeply engrossed throughout.   The game mechanics are fairly basic which makes this a title that you can pick up and play straight away. Each chapter is fairly short though and solving the occasional 'puzzle' or what to do next to progress isn't all that challenging. These aren't criticisms though - the way the narrative champions itself outweighs any depth or difficulty concerns.   The only real disappointment surrounding the game is the length - it will take you about two and a half to 3 hours to complete and the first two chapters are fairly limited although everything you accomplish has some bearing as the game flows nicely. You aren't walking around or searching aimlessly at any time so you feel you are always engaged in the product and everything has some merit. Despite the completion time; you will certainly get your money's worth for what is on offer and the intriguing writing.   Overall, The Charnel House Triolgy is a terrific game that delivers a powerful and absorbing story supported with a truly unique art style. If you're a fan of the genre or are just looking for a great story; it's highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "More of an interactive visual novel than a puzzle game; I was hoping for more complicated gameplay, but the story more than made up for it.   Can not wait for the sequel, which is supposed to be longer and more complicated. All together, a solid effort.   Pros -Very creepy. Great storytelling and atmosphere.  -Alex's voice actress is wonderful to listen to. -I love the Maniac Mansion style art. YMMV.   Cons -Very short -Simple puzzles",
            "review_score": "1"
        },
        {
            "review_text": "Firstly, I cannot understand why this game has received such wide praise! The voice acting was excellent, but that's pretty much all I can say. It took under two hours, and that included a dinner break. There were no horror elements, just some flashes on-screen of apparitions and a *eww* moment at the end, and the story was so simple and easy to work out for yourself anyway, if you truly are a fan of pyschological stories. I was hoping to get lost inside an in-depth narrative for hours, and have my mental limits tested. But no. I have been playing adenture games for a very long time, and there is nothing new here. At $4 Australian (on sale), it wasn't worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "It's OKAY. Just okay. I would still say give it a play, but it feels kind of rushed and simplified compared to other point and click adventures. I'd say Alex is a really unlikable character.Why does she have to swear in every single sentence? It seems like the writers tried very hard to portray a young woman. I honestly thought she was a teenager from how she spoke, then you find out later she's actually in her mid to late 20's. Completely unbelievable, especially as a 29 year old myself.  Harold Lang is a lot better and all the other characters are pretty cool. Lang's reactions are more believable and realistic. I like the train conductor Ol' Don the best though. I will say I love the old pixelated style a lot and the concept of being on a train where everything goes wrong.",
            "review_score": "1"
        },
        {
            "review_text": "Full disclosure: I worked on a game with one of  this  game's developers, Ashton Raze, and we had a grand old time doing it, so my opinion on this is probably a little bit skewed.  That being said, this trilogy of bespoke hand-crafted adventure games is terrifically creepy and absolutely worth your time. The voice acting is almost always on-point (especially Cara Ellison's in Inhale), and the puzzles are totally solvable, even for a huge idiot like me.  My recommendation: buy it, and play it at three in the morning with the lights off and a light rain pattering on the roof, like I did. Proper creepy.  Also, just to note, if you're still hesitating on a purchase, the middle episode  Sepulchre  is available for free separately, you can find it  here  [owlcave.net] .",
            "review_score": "1"
        },
        {
            "review_text": "THE CHARNEL HOUSE TRILOGY is a really chilling and creepy point'n'click adventure.  This is one train-ride you'll never forget! This game is really creepy even without stupid jumpscares and chases. The chilling atmosphere, the plot, the excellent writing, the little details; all this makes this game a great horror pnc Adventure! Its short but cheap and Jim ♥♥♥♥ing Sterling is voicing one of the characters. Definitely get this game!",
            "review_score": "1"
        },
        {
            "review_text": "Good. At its core a solid adventure game story, and while I would have liked to have seen it go longer (its composed of three chapters) I think it still stands up on its own. The writing is reasonable and the voice acting is generally enjoyable, my biggest qualm is that the 'puzzles' need to be more fleshed out and challenge the player more. I also agree with other steam users, Sepulchre is by far the best chapter in all aspects. I'll definitely be keeping an eye out for the sequel, in hope that it can hit the same level and not drag on like inhale and exhale did.",
            "review_score": "1"
        },
        {
            "review_text": "TL:DR; A solid 10/10 from me. Well worth the asking price for a couple of hours of good, clean, psychological horror fun.  I really enjoyed this game. Good voice acting from everyone involved (though Jim Sterling's voice doesn't quite fit the look of the character he plays, he does a good job regardless), nice artstyle, puzzles that don't require copious amounts of psychotropic drugs to understand, and intuitive, no-nonsense point-and-click controls.  However, the game's strongest suit is, by far, the story and the narrative. It constantly leaves you wondering, had me genuinely concerned and confused (in a good way) several times, and has a couple of really good twists I didn't see coming.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting short little game. I liked it but would have not paid the full price (I got it on sale) for the game. The gameplay only lasts like and 1 1/2 to 2 hours gameplay... really short!   I think they could have done a lot more with this game...",
            "review_score": "1"
        },
        {
            "review_text": "In a time of horror games that rely more on monster closets or cheap jump scares than they do any sort of atmosphere or dread, The Charnel House Trilogy is a welcome creep-out that matches its building darkness with its point-and-click pace. Following a fateful encounter, a man and a young woman separated by fewer degrees than they realize board a train for a rather peculiar and rather disturbing journey.  Despite being dubbed a trilogy, the game on the whole is rather short. This is not a disadvantage, however, as it keeps the plot tight and keeps things moving along at a pretty good clip, so long as you don't get stuck on any of the puzzles. In the first segment, we learn about Alex, still infuriated by a relatively recent breakup and not having the best evening in her apartment before an impending train trip. This is mostly establishment, though we are introduced to the other playable character, Dr. Harold Lang, and the train central to the plot, at the end.  In the second segment, Dr. Lang is highlighted, left alone to interact with the train's mysterious but friendly conductor, who sends him roaming among every cabin -but- Alex's for some reason to chat (or try to chat) with some other peculiar passengers. Strangeness accelerates rapidly, eventually leading to some grim discoveries regarding Dr. Lang's fate and, possibly, his present as well.  Alex returns in the third chapter, similarly left to roam the train and avoid Alex despite wondering what he's up to. Alex meets a greater number of passengers than Lang did, and eventually starts inexplicably stumbling her way through her past. Reliving several events from her more recent months, she discovers the truth behind what drove her to take this trip in the first place, and some things about people she thought she knew better.  Despite the short length and the low price, The Charnel House Trilogy is a beautiful game. The sprite work is great, the animation fluid, and the voice work is fantastic. I did have some mild beef with Alex's monologue toward the end of the first chapter sounding rather flat in its delivery, but this was not an issue that repeated itself later on. It was also great to hear Abe Goldfarb again, as he's quite a familiar earful from his regular appearances in other point-and-clicks. Jim Sterling also delivers what is arguably his creepiest performance to date, which is saying quite a bit if you're familiar with his Podtoid, Fistshark, Dismal Jesters, or Podquisition history.  If it wasn't clear already, I highly recommend picking this up. It seems there may be a follow-up down the line as well, and I cannot wait to see more.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely well-written indie horror game. This simple point-and-click adventure really drew me in with a creepy story that slowly builds to a terrific ending. A must play for anyone who likes horror but is tired of games that only deliver jump scares. The voice acting is pretty good too, particularly the train conductor. Definitely recommend this one, and will certainly be keeping my eye out for the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Calling it a trilogy is wildly missleading, as the game cuts off to make ways for sequel(s) to come. This is not a spoiler, this should be a disclaimer for people who are gonig to buy this game and want resolve.   Gameplay is obviously not the main focus of the game, where puzzles - calling them that for a lack of a better word - have trivial answers right there or with the game itself smacking you in the face with the solution under the mask of a 'hint'. Gameplay has to make way for the game's selfindulgent story, that start off with so much winks and self referential in-jokes that made me cringe.   While I understand the tone that the game is trying to set with atmosphere, the game writing is all over the place that I hardly know what the game is trying to say? Is it about breaking up? horror? teenage drama? The sheer amount of cringe worth dialogue and flat wooden voice acting made me stop caring almost 10 minutes into the game.   The voice acting in particular does the game a disservice, as sometimes it fails to convey the gravity of the situation and thus making it way less impactful than the creators probably intended for it to be.   It's lack of attention to detail like that turns the game into a bore at points, most of your time in the game will be spent walking in between 2 carriages to do one single element to unlock the next story section. While great adventure games usually will have multithreads that eventually combine to solve the situation and advance the story forward, CHT only requires one of the time, making it extremely linear even for an adventure game.   Text doesn't change at items after you solve the puzzle, character dialogue is inconsistent (a character chould be snoring unless you give him an item), some times items are referenced that don't exist in the gameworld ... etc  Short, incomplete, badly written, badly voice acted, no attention to detail and horrible game design choices, I would not recommend this game to anyone other than friends of the people who made it.",
            "review_score": "-1"
        },
        {
            "review_text": "GET READY TO LAUGH",
            "review_score": "-1"
        },
        {
            "review_text": "  One of the best experiences I've ever had",
            "review_score": "1"
        },
        {
            "review_text": "The charnel house trilogy is a very good game, it has an amazing and intriguing story, some really solid actings and a very consistent story that leaves room for interpretation.   Congratulations to the developers.   ",
            "review_score": "1"
        },
        {
            "review_text": "An atmospheric little adventure game that seems like it's more the prequel to another series or a larger game. There's a decent amount of intrigue that doesn't get explained, but as it seems more to be to setup something larger I'm okay with that.  The characters are fairly well realized given how short the game is, about 80-90 minutes or thereabout, and the voice acting is pretty good (aside from a few minor side characters who sound like they were recorded over skype). The music is pretty lowkey and moody which sets the tone well, and it's done by Jack de Quit if you're familiar with the Friends at the Table podcast and know some of his stuff from there.  I hate getting into the cost versus time played value proposiution argument, but just be aware that this is a pretty short game, so if that's an issue maybe wait to pick it up on sale. Having now played it though, I'd probably be okay with picking it up at full price.",
            "review_score": "1"
        },
        {
            "review_text": "Slighty glitchy with an all-over-the-place horror story. Not fun and barely interesting.",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely railroaded point and click adventure. I like when I don't have to resort to a walkthrough to get through an adventure game, but this game is not only without puzzles, but the characters will constantly just flat out tell you what to do next.  Story was also nonsensical and just felt like it was going for pure shock value. The 'reveal' that the train is actually The Sepulchre is completely ruined by a complete and utter lack of explanation of what that's supposed to even mean. Jim Sterling's voice acting is superb, like everything else he does, but the whole aspect of his stalker character being not real, but also real at the same time, really ruined it for me. I'm okay with horror leaving lots of things unexplained, but when characters are talking about things as though I'm supposed to understand what they're saying, it starts to grate on me.  The game is gorgeous and well-crafted, but the final result just fell flat for me.",
            "review_score": "-1"
        },
        {
            "review_text": "After a while, this game started to get into my head.  Example being, i was thkning that this is some crazy nightmare stuff. Then the game comments that it is some crazy nightmare stuff.  then I start to think: wow, this is very similar to Stephen King themed stories.  Then sure enough, bam!, stephen king reference.  Get out of my head!, Leave my brain alone!  A very haunting story set. I recommend it for anyone that likes chilling suspense and point-n-click.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a point-and-click adventure game fan this is a can't-miss entry in the genre for adults. Like a lovely blend of the Blackwell series and the creepy horror of The Last Door and other Lovecraftian inspired stories, The Charnel House Trilogy is a well-crafted tale with thoughtfully written and skillfully acted characters throughout all three acts of the game. The story arc deals with mature themes past the average adventure game plot and leaves you ready and wanting more from the series.",
            "review_score": "1"
        },
        {
            "review_text": "Overall, a tight little story that had some fun twists turns. Fairly well-written and thought out, but I didn't particularly find it super horror filled. It reminded me of a good Poe story.",
            "review_score": "1"
        },
        {
            "review_text": "I tried but sorry I can't even... bad 1980's pixel graphics on a 24' screen makes my eyes hurt. So unfortunately I never even got into the story of this game. Why bother? Also I cannot find any graphics settings to play this in a smaller window for example, what were they thinking?",
            "review_score": "-1"
        },
        {
            "review_text": "Okay, so I've only 2.5 hours on record, and thats because that's how short it is. And really, thats the only bad thing I can say about it. Some games can only be 2.5 hours and still be good, but the only reason I say it's a bad thing, is because I want more. So much more. Thankfully, there's a sequel coming out this year. :D  (Also, I got this on sale for 2 bucks, so for that price, it was money well worth it!) Seriously though, why aren't there more games like this?! Quit reading reviews trying to figure out whether or not you should buy it. Do it!",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed this. Good on a boring evening.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it because of Chungus.  10/10 did not dissapoint.",
            "review_score": "1"
        },
        {
            "review_text": "I tried the trial first. Which was the 2nd story 'Sepulchre'. I found the setting on the train intriguing.   The game was slow to start for me, but mainly because I was using the controls wrong.   It's a creepy little game, that has light gore, but really it's all the atmosphere, sound, and the script that add to the real creepiness. The game is story heavy with a lot of loose ends that don't really make sense, but at the end it starts to really come together, and then they leave you with a cliffhanger, and wanting more.   There's some repetition in lines for when you can't go in a room or when clicking on an object, but you can skip through that with a click of a mouse. The puzzles weren't too challenging.  It is a short game, but I feel it was well worth the 5.99.  Check it out!",
            "review_score": "1"
        },
        {
            "review_text": "An intriguing premise is ultimately let down by overwrought and overwritten dialogue, obvious plot twists, weak puzzles and a general sense of style over substance.",
            "review_score": "-1"
        },
        {
            "review_text": "Makes a perfect entry level point-and-click game without the overly-obnoxious or arbitrary puzzles that are a staple of the genre and also offers a horror experience based more around its atmosphere and story than the blind terror most horror games try to inflict. Might not be quite enough game here for the price (90 minutes to 2 hours to 100%) but what is here is pretty damn good. Oh, and Jim ♥♥♥♥ing Sterling, SON's in it, and he's great.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Loved it, the plot was intuitive and gripping. The story felt a little too short, the ending was a tad abrupt, and the voice acting seemed to be a bit low quality at times, but overall, this game is awesome. Gameplay was simple but kept me thinking and interested. Loved it!",
            "review_score": "1"
        },
        {
            "review_text": "Creepy in all the right places. There are some unanswered questions, and the ending's a little over the top, but I enjoyed it. Can't wait for whatever comes after this.",
            "review_score": "1"
        },
        {
            "review_text": "I spent the last few hours wondering wether to give a positive or negative review and well, you can see by yourselves to what conclusion I came. I'm a little bummed by the fact that it's more an interractive story than a real game and it's very short (2 hours and you're done) but that story guys, THAT STORY: WOAH! I'm gonna be honest I thought it was inspired by a book and my first thought was 'Wait I gotta pause this and google who the author is then I'm gonna buy the novel. Period'. Props to the mind who gave birth to the story. I'm not gonna complain because the game hasn't been translated in my native language as someone did: there's everything you need to know about the game on its Steam page so you know what you're buying. You don't know english? Your fault, I don't see why the creators should suffer for your ignorance. You want it translated? Ask for it. Wait for it.  Nice music, really enjoyed the voiceover. The game is really easy, you can't go wrong. Only thing is: it's not worth the price. It's a great story but it's too short and leaves you questioning some stuff (that, as I read, should probably get cleared in the next longer game) so buy it when on sale because for the full price you could buy hours of good reading.",
            "review_score": "1"
        }
    ]
}