{
    "app_id": 289090,
    "name": "Ampu-Tea",
    "release_date": "2014-05-30",
    "developer": [
        "ProjectorGames"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Indie",
        "Casual"
    ],
    "achievements": 11,
    "positive_ratings": 1285,
    "negative_ratings": 754,
    "price": 3.99,
    "description": "The surgeon-simulator inspired Tea-making game is now available on Steam! Using the latest KS-001 Robo-Arm, you must practise making various types of tea.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/289090/header.jpg?t=1447360970",
    "minimum_requirements": "Minimale : Système d'exploitation : Windows XP Processeur : 1.6ghz CPU Mémoire vive : 1024 MB de mémoire Graphiques : All DX9+ DirectX : Version 9.0 Espace disque : 512 MB d'espace disque disponible",
    "recommended_requirements": "Recommandée : Système d'exploitation : Windows 7 Processeur : 3.2 ghz CPU Mémoire vive : 1024 MB de mémoire DirectX : Version 9.0a Espace disque : 512 MB d'espace disque disponible",
    "reviews": [
        {
            "review_text": "Most satisfying cup of tea that I never made.",
            "review_score": "1"
        },
        {
            "review_text": "Nightmare of being British simulator 2014",
            "review_score": "1"
        },
        {
            "review_text": "If you want to kill a friendship, send this game to your friend on their birthday.",
            "review_score": "1"
        },
        {
            "review_text": "Well, this is basically Surgeon Simulator, but instead of killing patients, you are killing it making some nice hot tea, sometimes with sugar, sometimes with milk, sometimes with both, sometimes with neither, lol. You lost your arm in battle and so you were given a robotic arm with which you must try to make your aforementioned tea in hopes of calming down after the stress of losing your arm.  Physics based all the way. It's pretty challenging, but the learning curve istn as steep as with Surgeon Simulator.   All in all, it's a charming, sometimes frustrating little game that will make you want to do everything. Took me about an hour to get all the achievements exceppt the play 500 times one, but there are scripts available to handle that one in the comunity hub.  Anyway, pretty fun. I give it 7 broken tea cups out of 10 possible. The spilled milk and hot water abounds.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a lot potential!  There are just some bugs which needs to get fixed, I took a cup and my arm started flipping around totally randomly! It was hilarious but kinda annoying since I almost managed to finish the tea.  Anyways, I would like to see a multiplayer mode and maybe a larger table.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "  Come on it's not that bad.     Cons",
            "review_score": "1"
        },
        {
            "review_text": "54 mins for 10/11 archievements ... and happy logging 500 times :D",
            "review_score": "1"
        },
        {
            "review_text": "  dnt trust robot for making a cup of tea Gameplay :10/10 Graphics : 8/10 Music : 10000/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting game from a certain point of view. I enjoyed playing it, does have a special graphic and game mechanics, the overall sound is okay. Keeps you entertained and satisfied.",
            "review_score": "1"
        },
        {
            "review_text": "Wow the most amazing game ever, hands flying outside of the map mean you see lots of blue and INFINITY! Make me tea now!",
            "review_score": "1"
        },
        {
            "review_text": "Ok before I start my review, I just want to say congrats game developer. You got me. I tried to grab that damn red mug and everytime it would break. After like 7 tries i finally realised it was a troll cup, so congrats. *claps* (Also earned pretty much half of the achieves by just flipping the table)  So, Ampu-Tea... You play as a man who has lost one of his arms which has been replaced by a finnicky prostetic. Sounds alright so far doesn't it? The guy wants a cup of tea. I can do that you think. That is until you realise... the game is on the verge of being unplayable and you rage instead. You break the guys robotic arm of and in turn makes you want to break yours off as well.  11/10 would fall for the troll cup again.",
            "review_score": "1"
        },
        {
            "review_text": "Ampu-Tea is a ♥♥♥♥♥♥ game that is super hard to learn and will drive you to the point of skydiving without a parachute.      Its so bad its good and is worth the 74 cents.",
            "review_score": "1"
        },
        {
            "review_text": "This game made me break my keyboard.   I had to buy another keyboard to write this review.",
            "review_score": "1"
        },
        {
            "review_text": "Ampu-Tea  I tryed making tea. I destroyed my whole kitchen. I tryed making tea  My hand exploded and all of my fingers started moving at the speed of light (i destroyed my kitchen) I tryed making tea I lost all of the mugs because i tryed to pick up one and the whole shelf fell over. I tryed making tea I got my hand trapped in the table and once again destroyed everything I tryed making tea  I through my laptop accross the room  I will never succeed in making tea :(",
            "review_score": "1"
        },
        {
            "review_text": "The name is kind of ... untasteful. However, the game itself, if you can hold yourself together for about the first 15 minutes to grasp the controls, is not so bad.  Forget what you know about Surgeon Simulator. Amputea has a much quicker reflex, so you have to be extra gentle or your hand and arm will fly across the room. Also, you can break your hand off too...  Once you get the hang of it, it's just as fun as Surgeon Simulator in my opinion. So if you like that game, chances are you'll like this too. Or, if you like that game, you might not like this one as it has similar yet different controls that is likely to throw some people within the first five minutes.  I did finally manage to make tea and serve it, and also with cream and sugar - so it can be done.  Rageaholics be warned......",
            "review_score": "1"
        },
        {
            "review_text": "This game made me want to ampu-tea-ate my head from my body.   3/6=1/2=6/6=1",
            "review_score": "1"
        },
        {
            "review_text": "its realy hard and u must be a good player to finish the levels but its realy hard if u whant some hard games!",
            "review_score": "1"
        },
        {
            "review_text": "This is how I actually make tea 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I recommend playing- with pinkies up.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing i love it because I love English music and i like English mugs And I love Tea!!! This game in my opinion its in the top 5 of steam ... Its crazy as i only bought it for 39p!!!!! This game is acctually so emersive that i sometimes trip over as i think i am acctually making tea in real life its so good ; such a mind ♥♥♥♥. I think i might want to remove my left arm as it looks so cool who would of thought that having a fake arm would give you so much power! You can litraly make as many cups of tea as you want! As well as having a left arm as strong as an ox! But honestly this game is being amazing. Its on a whole different planet. i think i might die from over dose on tea now i even drink more than posh josh and oscar rooney!  But honestly i think i am AMPU-TEA CRAZY!!!!!!!   ",
            "review_score": "1"
        },
        {
            "review_text": "ITs RAGING ",
            "review_score": "1"
        },
        {
            "review_text": "I press for milk and it give me a ping pong ball. Seriously, making tea shouldn't be that hard. 10/10 will not do it again.",
            "review_score": "1"
        },
        {
            "review_text": "Accidentally put sugar in the tea. Ended up giving my father diabetes. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed surgeon simulator you're gonna love this game. Only started playing it yesterday and while it is more limited than surgeon simulator it's still enough to hold hours of fun! :)",
            "review_score": "1"
        },
        {
            "review_text": "I'm so British.",
            "review_score": "1"
        },
        {
            "review_text": "Its only played this once and its SOOOO difficult. I cant even pick up a mug",
            "review_score": "1"
        },
        {
            "review_text": "ok game i want refund but its too late",
            "review_score": "1"
        },
        {
            "review_text": "Good game if you can get it on sale for 59 cents.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly couldn't stand to play this for more that 5 minutes before my brain literally exploded. However I do like tea... And it does work EXACTLY as advertised. Oh and I got it on sale for 28 cents. God I love tea...",
            "review_score": "1"
        },
        {
            "review_text": "75/100 would recomend on sale I like this game and I like the controls like surgeon sim, but there is only one thing you can do, make tea and add some things pros: Fun controls fun hand physics hard but fun Cons:  hard(if you dont like that type, but I do) barely anything you can do repitative. I would recomend this game to anyone who like surgeon sim or wants to try controls a bit like it.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is fun but not as fun as surgeon simulator but still fun and not expensive it is what it says what it is a person with a robot arm is making tea... i feel there have to be more things in this game i recommend this game if you get it at a Sale!",
            "review_score": "1"
        },
        {
            "review_text": "This game was made popular by YouTubers a while back. It's a fun game, for about 30 minutes. After you spend half of the time trying to get the teabag into the cup, you get ♥♥♥♥♥♥ and end up flipping the table (AND *****SPOILER***** YOU GET AN ACHIEVEMENT FOR IT XD) doesn't have much gameplay quality, but if you get it on sale, it's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games you get when you sell your CS:GO skins or have some left over money in the steam wallet and you have no idea what to buy. It's really not bad to be honest, but it's far from a master piece. Overall worth the price in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Took me 2 hours to make a tea on easy mode + get all achievements. Nice :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty great. No it isnt going to provide you with 200+ (well it might) hours of entartainment but its pretty fun to just pick up every so often and try to make tea (usuially unsuccessfully but still is pretty fun). It is pretty agrivating at times but its really funny. Personally I love these kinds of games and tea so i may be a bit bias but its deffinately a pretty awesome game :D",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game 10/10 buy it -IGN",
            "review_score": "1"
        },
        {
            "review_text": "I love having my arm shoot off mid tea-brew.",
            "review_score": "1"
        },
        {
            "review_text": "Anyone know how to stop the pain?",
            "review_score": "1"
        },
        {
            "review_text": "Ridiculous, fun for the amount of time you'll play it, which doesn't have to be very long. You can get all the achievements after only a short while of playing. Just like surgeon simulator except a little more frustrating at times.",
            "review_score": "1"
        },
        {
            "review_text": "Ever sat on your chair and fancied a tea, but could not be bothered to get up to make one? Get this!  Achivement hunters will have great fun with this. Something so simple could not be made more difficult. The icing on the top is having to launch the game 500 times for the last achivement. FUN! ",
            "review_score": "1"
        },
        {
            "review_text": "To say this game game is difficult is like saying the earth is just another rock. This game goes far behind a difficultly controlled simulation where you make tea, who the hell ever thought making tea would be so stressful and infuriating at the same time.   Once you get the controls, you would figure it gets easier from there, but it's very likely that your robot-hand will start jittering and fly off and you will fail the mission. Learning the controls are one thing, but mastering this game will definitely take some serious patience.  The music is happy and full of energy, but about the time it starts getting difficult.. The music vanishes.. which makes it even more difficult seaming..   Buy this game if you're looking for one of those simulation challenges.",
            "review_score": "1"
        },
        {
            "review_text": "Fun AND irritating! Best of both worlds, right?",
            "review_score": "1"
        },
        {
            "review_text": "You asked for this. It's exactly what you think it is. It's tea time!",
            "review_score": "1"
        },
        {
            "review_text": "  Nothing as cool as (ampu) Tea! :)",
            "review_score": "1"
        },
        {
            "review_text": "  This was so frustrating yet fun to play. I totally expected it to be a lot easier than it really was. I def recommend it. See me try and fail at making tea myself  Here ",
            "review_score": "1"
        },
        {
            "review_text": "Tea-rrible",
            "review_score": "-1"
        },
        {
            "review_text": " Review in English/Spanish  Análisis en Inglés y Español:",
            "review_score": "-1"
        },
        {
            "review_text": "You know, I thought people were exaggerating when they said this game was bad. And I thought the trailer's exaggeration was just random b*tching...but it's really not as fun as you'd think.  Sure the idea is simple. So you'd think 'This is gonna be pretty cool'. When you play for the first 5 minutes, you'll realize the error of your ways.         Thumbs Down&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "I honestly have no idea why I play this, I mean it's probably because I'm just trying to get the achievements, or because I'm bored, but when I think about it, the game is really ♥♥♥♥♥♥. Let's start with running the game, first you get greeted with video/graphics settings then when you hit 'play game' or whatever it says, the screen is blank with a white banner for some, but for others, you see language options nd the actual intro which is like 5 seconds and the sounds are loud as ♥♥♥♥. After that, you sit there for like 30 minutes waiting for it to verify that the game is an actual copy, so you can't play offline. After that, the game starts instantly and you are shown a blueprint of the controls, and you notice how limited your movement is (You can only move up and down, or rotate your hand and you can only open and close your hand, but two of the fingers are the same key) and that the controls are real ♥♥♥♥. Once you play, it seems fine until you try and grab a mug where you have two possibilities the entire shelf falls off and you have to reset the game, or if you manage to grab a mug, your fingers will clip right through the handle or stick to you. If you manage to get the mug on the table, you have to put in a teabag and water before anything else, or that will be all you need to do sometimes. Trying to get the teabag in your hand is tough because with your limited movement and bugginess of the game, it will keep slipping through your hands (I once got it in my hands, but the game bugged out and everything on my table either fell off or tipped over) then you have to get your mug under the water dispenser, which has a sign tht prevents you from ever being able to put the mug in the right spot for the water. But, most of the time, your hand just falls right off before anything else",
            "review_score": "-1"
        },
        {
            "review_text": "I honestly don't know what I was expecting with a PUN-ishing name like that. It has a Surgeon Simulator feel while lacking any real mission besides slamming around objects like a 10-year old after drinking a single can of Monster Energy Drink. Of course, the only thing stopping you from doing this sort of thing forever is how easy it is to break the prosthetic arm and the desire you get after a couple of minutes to play a better game. All-in-all, I wouldn't recommend this if you're over the age of 10.  'Nough said.",
            "review_score": "-1"
        },
        {
            "review_text": "The only funny thing here is flip the table. And I thought Surgeon sim was bad, this is really worse.",
            "review_score": "-1"
        },
        {
            "review_text": "Surgeon Simulator knock off, not worth it unless it's on sale. Also the sugar cubes are 1000% impossible to pickup &gt;:(",
            "review_score": "-1"
        },
        {
            "review_text": "I thought maybe I could get an hour out of this. I hated all 7 minutes of my time with it. It can't even be controlled, not worth 5 cents.",
            "review_score": "-1"
        },
        {
            "review_text": "This is like Surgeon Simulator but with a robot hand. And you have to make a cup of tea instead of messing around with people's intestines. Fun, but only for a couple of minutes or so. And, as usual, the controls take some getting used to (some of us might never get the hang of it).  [Rating: 67/100]",
            "review_score": "-1"
        },
        {
            "review_text": "This game would be really fun if the clipping worked, but sadly items get stuck in themselves and even on your hand with annoying yet inconsistent regularity. The fingers on the hand will also phase through objects randomly, so you're never able to reliably use them. It's all but impossible to place something in a tea cup if you're unsure whether the laws of physics will work this time around. I'm also frustrated by how random the 'damage' system is. Sometimes you can pick up a cup with no trouble, other times just brushing it lightly will shatter it.   Finally, for an actual design choice, it suffers from a forced perspective, which makes no sense and adds nothing to the challenge save for frustration. If you bump a cup to the wrong angle, it will take you ages to get the handle aligned to something you can pick up and use. That's not fun, and there's no good reason I can't just step slightly to the side so that I can actually line up on the handle. (Edit: There actually is an alternate camera view. It doesn't work most of the time, but if you push the button enough then it will change your perspective. This does not change the angle of the arm though, so it's of limited use. It is handy if you need to see behind something, but it doesn't work 90% of the time when the button is pushed so it's hard to make any real use of it.)  All told, if they ever patch it so that it actually works then I'd recommend it, but as it is there's simply too much randomness to the laws of reality to be fun. If you pretend that you're a poltergeist learning to use its powers though then it does make it a bit more bearable.",
            "review_score": "-1"
        },
        {
            "review_text": "This came as part of a one-pound bundle. Don't judge me, friends. I'm idling, taking the cards, and putting it into my bin folder.  To the game developers:  Aside from the rather insensitive (but very punny) title of your game, it's surprisingly easy, and doesn't provide the same level of challenge (or variety) of Surgeon Simulator, who you did give a wink to in the lettering of one of your mugs.  The game runs 'janky' depending upon the number of objects on the table, and you remind the player that he is choosing to do this instead of any number of more enjoyable things in his life.  Lumps of sugar awarded: 2/420",
            "review_score": "-1"
        },
        {
            "review_text": "Not even close to the playability like Surgeon Simulator 2013.",
            "review_score": "-1"
        },
        {
            "review_text": "As a proud tea drinker it's safe to say that this is not the way to make tea. I do suggest that this man uses his other hand to make his tea, as his amputated one is clearly not capable of picking up a little tea bag.",
            "review_score": "-1"
        },
        {
            "review_text": "cant play! i want my money back",
            "review_score": "-1"
        },
        {
            "review_text": "  people actually paid money for this piece of ♥♥♥♥?",
            "review_score": "-1"
        },
        {
            "review_text": "A buggy, frustrating and weird version of Surgeon Simulator 2013 where you make tea with a non-functional hand. Just when you think that you've mastered the game you'll run into a bug that ruins your cup of tea. Everything weights the same, so everything flies upon contact. Unconfortable controls makes it impossible to grab things since your hand is so slow that the thing you're trying to grab moves as you're grabbing. You can't play offline, even if you have the game installed on your PC, which is the reason to why we install most games. The help screen keeps popping up when you restart, which is annoying and the game feels unfinished, considering the fact that you can go outside the kitchen, there's no real menu or even credits/ending. On the bright side, it was a funny experience at first and the references are kinda funny since they describe the opposite of what you're actually doing. The concept is also funny (just not done right) and you can tableflip. You also get Steam cards, which you can sell and get the value of the game back. You can also troll your friends by letting them try and laugh as they rage.  Pros:  - Fun first time experience - Funny concept - You can tableflip - Cool references - Steam Cards - Good for trolling friends  Cons: - Disgusting, uncustomisable controls - You can't launch the game without internet - Buggy hand that sometimes has its own will - Everything has the same weight - Slow and weak hand that never grips - Annoying help screen that shows up all the time - Feels unfinished   2/10 - Worth 0.74€ I guess. If you like Surgeon Simulator 2013, Probably Archery etc, you'll like this game the first few minutes and then hate it forever.",
            "review_score": "-1"
        },
        {
            "review_text": "I hope this is a brand new game and they release tons of updates and fixes, and not just forget about it. Loaded it once and played a little bit, probably won't launch it again until I see an update.  Would not recommend at this time.",
            "review_score": "-1"
        },
        {
            "review_text": "A worse version of Surgeon Simulator. It's fun for just a little while. Not a terrible game but not really good either.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm sure this game appeals to someone. That someone just isn't me. I don't mind the british humor inherent in it, but like everyone says, the controls are an excercise in frustration, and the Rage Quit achievement aptly describes the only thing I felt like doing after 5 minutes with them. Find it at a friend's computer, try it, and go about your day.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly? Possibly the worst game I've ever come across for Steam. Though thankfully I got it as part of a 10-game bundle so didn't pay the outrageous price Steam are asking.  Many mugs were smahed, many tables were flipped, lets just say I'm not the best person to ask a Cup of Tea for, you'll just get it all over you from my clumsy amputated-robotic hand.   Apart from all that, the upside is Trading-Cards and possibly the easiest game to get 100% achievements on.  Up to you if to buy or not...Personally, I wouldn't. :')",
            "review_score": "-1"
        },
        {
            "review_text": "Made tea, became a surgeon, now I have my butler play Ampu-Tea for me when I'm thirsty.  I never have to make tea again, but my butler sucks at Ampu-Tea so I'm lucky if I get an unbroken mug let alone one with tea in it. So many broken mugs, clumsy butler, 3/10.",
            "review_score": "-1"
        },
        {
            "review_text": "A game with beautiful graphics and an interesting idea that turns out to be a truely awful experience with controlls that activly fight the player. The slighest movement of the mouse sense the robotic arm flying across the table. The camera angle is truely terrible and does not allow for any real controll by the player often leavign you unable to see behind the robotic arm if it overshoots a target going forward... and you WILL over shoot your targets.   If you must play a 'control indvidual body parts to move for whacky antics' genre of games go with the likes of Octodad instead. It has goals you can actually oaccomplish and will leave you giggling rather than resisting the urge to throw a keyboard across the room like Ampu-tea does.",
            "review_score": "-1"
        },
        {
            "review_text": "worst game i've ever played. controls are bad and slow exept if you want to move your arm then it's super fast so you knock everything over. and i have no table. wish they had refunds earlyer",
            "review_score": "-1"
        },
        {
            "review_text": "I want Valve to stop making these schoolboys think they can produce something useful using 'How to build a game on Unity' tutorial and cheap assets. To write a decent indie game you have to be Notch. But Notch is an experienced programmer with a wide background. This game is on Steam for almost 1 year already. If you check the environment, it's blurred out to hide the fact that's the texture mapping is absolutely horrible. You have 1 square meter of space and still can't model it properly? Jesus Christ. If you move your hand for a dozen of seconds, you'll eventually leave the skybox! OMG, this guy doesn't even know you should lock your skybox at camera position. Not to mention the physics which is ♥♥♥♥♥♥ slow. Valve really should ban any 'indie' developer who doesn't have at least 1 year work experience. Soon we'll literally have tutorial examples selling for the full price.",
            "review_score": "-1"
        },
        {
            "review_text": "This is ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I only got this game because it was on sale for a few cents. This game is just not worth it and not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "the worst game ever. From range of 0 to 10 points I give -10.",
            "review_score": "-1"
        },
        {
            "review_text": "  what a joke. 0/1000000",
            "review_score": "-1"
        },
        {
            "review_text": "Eugh. I absolutely love Surgeon Simulator as it is both challenging and hillarious. This is challenging, but only because of the bugs (which, unlike Goat Simulator, aren't hilarous to watch), but that is about it. My robot arm keeps going through the mugs and the slightest knock seems to make everything go flying.... at least that got me a few acheivements! Maybe this game is better for those who have masses of patience for practiice, or for those who aren't British and find that the whole idea of making tea in tacky 'Keep Calm and...' mugs with the Union flag everywhere is charming. I think I got it from another site for very liittle money though, so I'm not disappointed to own it. Maybe I'll return to it one day and magically find I like it. I guess it could be a very good stress relief if you like to yell 'SMASHY SMASHY' at your computer? DESTROY ALL THE THINGS! Maybe it's not fair to compare it to SS, as making tea is very different to botched surgery, but they do make reference to it on one of the mugs by thanking them for the idea... Oh, I feel mean now.  I guess it's just not my cup of tea! ;D",
            "review_score": "-1"
        },
        {
            "review_text": "Don't, just don't it's a real waste of money, I really wanted to try this and it went on sale for $2.49, in short don't buy it for anything more than .50, It's horrible. Imagine taking an icepick, and then useing that bloody, narled hane to write shakspear backwords, and upsidedown, YEAH IT'S JUST LIKE THAT!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Tried to make tea, ended up smashing everything in sight without knowing it and breaking my quite costly robotic arm. Unfortunatly, that's the most fun you'll ever have while playing Ampu-Tea.  I'm not even kidding when I say that.",
            "review_score": "-1"
        },
        {
            "review_text": "I really do not recommend getting this game if you have a short temper, the amount of effort and time that goes into this game to do something very small such as putting a teabag in the tea is too much. It's annoying, controls are not good. This game will make you rage. This game will turn you into the hulk by the time youre done. When you finally have done something you will screw it up probably right after and have to start over. Or when it's finally time to serve the tea your hand will suddenly ragequit and spin around and destroy itself for no reason. 'rage simulator' or 'how-to-bepatient simulator' would probably be a better name. It's just not really any good unless you like this just because Pewdiepie played it and its a 'cool' game. This is one of the most annoying games I've played. Making a cup of tea is too difficult. I only played this because it had achievements.",
            "review_score": "-1"
        },
        {
            "review_text": "Tried to make tea, ended up smashing everything in sight without knowing it and breaking my quite costly robotic arm. Unfortunatly, that's the most fun you'll ever have while playing Ampu-Tea.  I'm not even kidding when I say that.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is based on a neat idea, and goodness gracious I *LOVE* bad puns, but it starts to suck badly pretty quick.  I'm gonna make a wild guess and say the controls are supposed to be wonky to add to the 'humour', but they could really use some polishing. I honestly see no reason for not including elbow controls.  I get that the in-game physics are supposed to be 'funny', but it's just plain annoying that you just need to *touch* the damn shelf to make it fall. Also, camera's weird angles and their very limited number is very, very annoying and really gets in the way of smooth gameplay. It's very hard to deduce the grip angle, and not in a fun and challenging way, but in a tableflipping way.  Music is pretty nice, but could use a bit more variation, and so could the tea 'menu' (ingredients).  The robotic arm breaks WAY too easily.   Conclusion: the game started to cause more frustration than fun very quickly, but if you're an achievement hunter, it's okay. I guess. Still, would not really recommend buying.  ",
            "review_score": "-1"
        },
        {
            "review_text": "ok, so i really wanted to enjoy this game because it seemed like it would just be a funny experience....  I bought this game almost 3 years ago and am only getting back to it now after playing for about 25 minutes... the game is not very good in terms of the controls, the physics, the mechanics, and bascially there is nothing good I can say about this game at all.... It's not really fun, it's way to difficult to do the most basic tasks, and you cant even change the camera angle from what I know.  I feel like the developper of this game was really in the mood to make just some sort of sick joke on the people who actually paid money for this game.... and in reality, he or she succeeded.  0/10 one point for each dollar the game is worth.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game.... just kidding, Thanks indiegala for this ♥♥♥♥! (again) You cant even grab a tea bag because of the ♥♥♥♥ing hand, it gets broken as easily as the dev mother ♥♥♥, and its like impossible to grab ♥♥♥♥, no sticky hand. and it sucks, i mean, if you touch r, the thumb goes to the center, like, no realist ♥♥♥♥, dont spend your money here dude, im warning you, the only thing here is that you get ♥♥♥♥ for playing this and you can sell them.  -1/5 Would only play if i lost memory.",
            "review_score": "-1"
        }
    ]
}