{
    "app_id": 289200,
    "name": "Ascension to the Throne",
    "release_date": "2014-04-23",
    "developer": [
        "DVS"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Strategy",
        "Turn-Based"
    ],
    "achievements": 0,
    "positive_ratings": 205,
    "negative_ratings": 30,
    "price": 1.99,
    "description": "Ascension to the Throne is a turn-based strategy game with RPG elements. In a vast fantasy world the hero will have to pass many tests on his way to victory. Enemies seek to stop players from regaining power and taking revenge. Gain new friends to aid you in reclaiming the throne.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/289200/header.jpg?t=1553163469",
    "minimum_requirements": "OS: Windows XP/7/8/10 Processor: Pentium IV 2.4GHz Memory: 512 MB RAM Graphics: GeForce 6600 or higher graphic card with 128 MB RAM Storage: 2 GB available space Sound Card: DirectX compatible sound card",
    "recommended_requirements": "OS: Windows XP/7/8/10 Processor: Pentium IV 2.4GHz Memory: 512 MB RAM Graphics: GeForce 6600 or higher graphic card with 128 MB RAM Storage: 2 GB available space Sound Card: DirectX compatible sound card",
    "reviews": [
        {
            "review_text": "This game truly could have been fantastic. It is a tad difficult at the beginning when your hero is too weak but then becomes quite enjoyable as things balance out a bit. By about 1/3 of the way through you are becoming so powerful that the battles are pretty much a joke. A few minor tweaks and the story, battles, and overall gameplay would shine. It is pretty much set up so that whoever acts first in the battle comes out on top. All the same, it was 15-20 hours of decent fun.",
            "review_score": "1"
        },
        {
            "review_text": "The game is sub-par at best, good game play, very sub-par graphics, story is genaric but fine.   Lots of troops to comand so there is a tiny bit of replaybility to the game but not much if you find most of the secrets in the first go, and trust me, i bet you can.   Tough start but gets easier about after the first quarter of the game, keep the hero back and safe for the first hour or two of playing and get some hitpoints and he will be fine.   over all, not a bad game, not much there but i myself hope they put the sequle up on steam so we can see what they fixed.",
            "review_score": "1"
        },
        {
            "review_text": "its a decent game you collect troops and fight in turn based combat but lately the game does not want to work for me not sure why",
            "review_score": "1"
        },
        {
            "review_text": "This is definitely a good game but it is also hard.",
            "review_score": "1"
        },
        {
            "review_text": "game doesnt work, waste of money, it just loads up a black screen then crashed, the biggest waste of money on steam",
            "review_score": "-1"
        },
        {
            "review_text": "Jean Kirstein approves of this game.",
            "review_score": "1"
        },
        {
            "review_text": "If you like large scale, turn based strategy games with a fairly interesting story, then this will be a fun game for you. However, you will have problems playing it if you have a newer pc.",
            "review_score": "1"
        },
        {
            "review_text": "Addicted? yes Want help? No Need help? Maybe Love this game and would of gladly paid more for it. Dont let first glance at graphics fool you",
            "review_score": "1"
        }
    ]
}