{
    "app_id": 289400,
    "name": "Parkan 2",
    "release_date": "2014-04-16",
    "developer": [
        "Nikita"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Simulation"
    ],
    "tags": [
        "Action",
        "Simulation",
        "Space"
    ],
    "achievements": 0,
    "positive_ratings": 151,
    "negative_ratings": 74,
    "price": 2.79,
    "description": "Parkan II is an original concept game that will allow you to feel as a pilot of a spacecraft lost somewhere in the universe. Become a pirate or mercenary, get money to buy the most powerful cruiser and show them all who is to be the new master of the galaxy. Unforgettable adventures in the Parkan II universe await you!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/289400/header.jpg?t=1553176350",
    "minimum_requirements": "OS: Windows XP/7/8 Processor: Intel Pentium IV or AMD Athlon XP Memory: 1 GB RAM DirectX: Version 9.0c Storage: 4 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a great game. Sure it's a bit quirky, but it's got so much about it to love. If you like space gaming AT ALL, give this one a shot. Seriously, I say this as an expert. ;)",
            "review_score": "1"
        },
        {
            "review_text": "I bought into this game based solely on it's concept. I want to love this game so much, it has, at least in theory, everything I want in a space game. Spaceships that you can walk around in, planets you can visit, multiple factions you can join, a free roaming (but sometimes limited for story reasons) sandbox universe... It even has in-ship fighting where you can get boarded by enemies or board enemy spacecraft to comandeer it yourself.  The game is a few years old, and the mileage doesn't give it any compliments. It has aged, and it hasn't aged well. It most likely wasn't even very visual-heavy back when it was first released back in 2007 either. But that can be forgiven. The real problem with this game is how the awesome concept is being executed. It's executed poorly. I walk around, doing stuff, going, 'Ah, wow, this would have been cool if they had made it like that,' or 'this is kind of amazing, I wish they had expanded on that' etc. Also, the planets and stations feel copy pasted and empty, defeating the purpose of being able to visit them anyway.  In short, though it has many features, none of them feel fleshed out, and some are flat out stupid in their lack of polish. The story isn't anything to write home about either, possibly due to poor translation and sub par voice acting. Want to spend 5-8 hours tops fooling around in a semi open sandbox space sim thingy? It's 5 Euros or your regional equivalent. Is it worth it? Your call. I bought it, played it for a bit, kinda liked it, it was average. But I left it feeling unsatisfied. I would recommend waiting for another game that does this but better.  Pros: Great concept A few hours mindless fun  Cons: Poorly executed concepts It ain't no looker Feels empty",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of the better indie games out there. If you like fast paced free roaming Space Sim/FPS Exploration, this game might be for you.",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't get into this, spent too much time with X series already I think. This game is very slow at the start, controls need tweaking to remove aggravation. Vintage hardcore gamers might like this but I just couldn't get myself into it (I love the scenarion/theme though)",
            "review_score": "-1"
        },
        {
            "review_text": "Impossible to aim in space, terrible story, bad controll, laughable dabing and too f*cking long and boring tutorial I didn't even finished because it was so boring. Don't even think about buying it, trust me",
            "review_score": "-1"
        },
        {
            "review_text": "a game i want to like. however the random but steady freezes requring a forced sign out of windows kill's it.",
            "review_score": "-1"
        },
        {
            "review_text": "WTF? No idea what's going on in this game or what you're supposed to be doing. Allows you a lot of control over ship systems so might be a decent game if you can get past all the terrible voice acting and strange AI of your ship. I wouldn't recommend purchasing.",
            "review_score": "-1"
        },
        {
            "review_text": "the tutorial sucks., the open worlds are not...glad i only paid 3.99",
            "review_score": "-1"
        },
        {
            "review_text": "This game has the worst controls ever. I never played a game with this bad controls. ",
            "review_score": "-1"
        }
    ]
}