{
    "app_id": 289420,
    "name": "Planet Alcatraz",
    "release_date": "2014-04-16",
    "developer": [
        "1C Entertainment"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Isometric",
        "Atmospheric"
    ],
    "achievements": 0,
    "positive_ratings": 230,
    "negative_ratings": 41,
    "price": 2.79,
    "description": "Planet Alcatraz is a 3D role playing game with isometric projection. The player travels through the game world and fights against enemies in the real-time mode.Several genres are mixed in this game but despite that fact it isn't stuck between them and appears to be a classical RPG that is based on a specially developed system.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/289420/header.jpg?t=1553175989",
    "minimum_requirements": "OS: Windows® XP/Vista/7/8 Processor: Intel Pentium IV 3 GHz or AMD Athlon 1,4GHz+ Memory: 1 GB RAM Graphics: nVIDIA GeForce 6600/ATI Radeon X800, 128 MB Storage: 5 GB available space Sound Card: DirectX 9-compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "l always find the russian rpg's creative. they have always new ideas about the classic genres. For this rpg: its a nice game with a lots of fun. no mages no spell casting, it has a different tough world. if you get bored of high fantasy spell casting rpg games give it a try. I think Price is really cheap for a game like this.",
            "review_score": "1"
        },
        {
            "review_text": "In general: This game has nice ideas and nice death moments, which can easily triggered by chosing wrong dialogue option. Some are hilarious, some are simply annoying.  Fighting: The guards will sometimes attack you even if you've put away your weapon (just happened to me, and I noticed it when I had already saved my game...) and they're so tough you probably won't beat them. Well, when it comes to fighting the whole fighting system is a huge mess it feels so clunky it ruined the gaming experience for me. It feels like you want to hit a fruit fly, you'll hit with a chance of say...10% maybe. And there aren't enough interesting drops (see items) to motivate you, and no motivating quests... It often is the basic thing : Kill x monsters and return, bring me this and that...  Items: There are lots of clothes to find but they don't have any interesting stats only amour and an attitude rating which I've never experienced influencing anything, they just look different. And there isn't much of an interesting weapon choice, neither. I found ranged weapons to be even more useless than melee weapons at least most of them.  Characters: They all seem very dump, dialogues are a bit funny and often pointless. You'll sometimes have different group members, but they have nearly no personality and they react not too intelligent. There are a lot of unimportant nameless people running around always doing the same thing (dancing, cleaning)  Graphics: Is o.k. but won't keep you exploring, small square-like maps which are all very similar to each other.  ---&gt; I wouldn't recommend the game, but for that low price, or better, on sale, you can try it, there are some funny sequences in it, but the gameplay is very annoying ( I often found me rather forcing me to play it any further than actually wanting it)",
            "review_score": "-1"
        },
        {
            "review_text": "Some of the game play, like the comabt anmations seem broken, and the main characters's voice sounds more like well eductted white-collar crook rather than his blue-collar aperance might suggest and whoever wrote the dialoge was either really bad at writng or really good, but spread it so thick that it sound really dumb. Makes it hard to take the game so seriously, while not complety spoiling it.   Soory if my reveiw is harsh for person who didn't sovery far in this.  I may write something more complimentry after a few more plays.",
            "review_score": "1"
        },
        {
            "review_text": "If you like 7.62 or E5 brigade you need to play this.",
            "review_score": "1"
        },
        {
            "review_text": "It's not only about the voice acting. I actually changed to Russian and it's a lot better, but the game is not smooth at all and the animations aren't really great ..And it even doesn't let you crouch or change your movement style, that sucks for this kind of tactic game.. I finished Marauder and my expectations was big for this game but.. well, if you can overpass this tiny annoying problems that I think it's important, according to the people who finish the game, you have a cool game.",
            "review_score": "-1"
        },
        {
            "review_text": "Ways this game could be improved:  Simpler graphics. No voice acting. No cinematics.  These slipshod attempts at polish greatly hinder the gameplay experience. When combined with a horrific and klunky interface experience, this game feels overpriced at 3.99.  There might be a decent RPG experience in there somewhere, but good luck getting to it.",
            "review_score": "-1"
        }
    ]
}