{
    "app_id": 289440,
    "name": "Perimeter",
    "release_date": "2014-04-03",
    "developer": [
        "K-D Lab"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 87,
    "negative_ratings": 21,
    "price": 2.79,
    "description": "Perimeter is an innovative Real-Time-Strategy game that pits players against each other or AI opponents in a life and death struggle to seize territory and establish crucial protective “perimeters.” Players will be introduced to the game’s unique terraforming feature, allowing them to move, build, construct and destroy the map...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/289440/header.jpg?t=1553176239",
    "minimum_requirements": "最低配置: 操作系统: Windows XP/7/8 处理器: Intel Pentium 4+ or AMD Athlon XP 2GHz and faster 内存: 1 GB RAM 图形: nVidia or AMD video card with 128Mb VRAM or more DirectX 版本: 9.0c 存储空间: 需要 4 GB 可用空间 附注事项: Online play no longer supported, LAN play is possible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Well, what can I say? It’s an old game, but it’s a good game. I remember, I couldn’t beat the campaign years back due to the need to distribute your attention, to dispense it on the different tasks. That’s why I think it’s good: you must be in absolute control of situation, of every part of yours and enemy’s forces. Some may call that babysitting, but I think it makes you think, adapt, be fast and precise in your actions. The storyline, its campaign, the world itself together reflect these concepts well, I think. The Spirits, priestly like people with advanced knowledge, discovered the new dimension — The Psychosphere. They said, they found a promised land, full of happiness for humankind, but the way here would be long and hard (as usual, of course). The Psychosphere contains all human thoughts and desires which are embodied into the Scourge: strange and dangerous creatures that are attracted by the human mind itself.  Together with the other people Spirits created a floating cities — the Frames. Frame is a home for the piligrims and the way to travel through the Psychosphere in search of the Promised Land. As I said above, the Psychosphere is very unstable, chaotic and creates the Scourge due to the chaos of thoughts and desires. So all pilgrims must be controlled, must be whole and should control their mind in their dangerous travels. And it takes several years to build new portals and travel to new undiscovered worlds. Player begins the game as a Legate of the one of the first Frames. As a Legate you need to watch this chaotic world and protect your Frame and your people. You must terraform every possible place to gather more energy for your next travels, defending yourself from the Scourge, finding new worlds and new, different and heretic and hostile visions of situation from the different Frames.  What I can mark as distinctive features of this game: — terraforming is one of the main concepts of the game: you need it to gather the energy, to build your structures from the so-called zero plane; zero plane can be damaged what makes this approach very interesting from the tactical side; — you have a robotic army that contains three basic types of units: soldier, officer and technician; if you’ll build according laboratories, you can transform you squads into new types of units, even on the fly; it creates some possibilities like digging your way underground and then transforming your squad into bombers for heavy damage; — three different factions with three types of special units each, with different views and philosophy; — paranormal bubble-chained world with its unique atmosphere in couple with the futuristic technologies; — some very hard missions that need from you full concentration and distribution of your attention; — you need to use community’s workaround to play multiplayer at the current state.",
            "review_score": "1"
        },
        {
            "review_text": "this is awsome but only if online worked",
            "review_score": "1"
        },
        {
            "review_text": "made me kill my whole friends  11/10 would play again        jk i don't have friends",
            "review_score": "1"
        },
        {
            "review_text": "LET ME START WITH THE BAD: AI sucks. Your units can land on terrain that will kill them. What's up with that? I lost more units that way than to the scourge. They cannot distinguish hostile terrain from good terrain.   On defense mode, your units can, and will go into said terrain ON THEIR OWN without the player commanding them. If a building is between it and the enemy, it will NOT move to have line of sight with the enemy.  All this stupidity despite the fact that your units CAN FLY! WHAT THE BLOODY HELL?!?! They land into a canyon and 'poof!' SQUAD IS UNDER ATTACK.  Uh, no, squad is not under attack. Squad is FALLING into a canyon or a moat DESPITE HAVING THE ABILITY TO FLY.  Good friggin' grief man!   PS: If you are going to portray a futuristic and technically advanced civilization capable of interstellar trans-dimensional space travel, then you must make sure that the units you can control and command in-game can portray just that.   If said units only have dumb AI that cannot see it is going to step into hostile terrain due to its auto-attacking an enemy, then what does that portray? Stupidity, that's what. Why not fly then attack? And when done then land NOT on hostile terrain.   When you make a group of units, and send them over good terrain that is surrounded by hostile terrain, then those at the edges of the group will probably land on hostile terrain. Then you'll feel bad because you clicked on good terrain, you didn't send them to land on bad terrain. Like I said, AI sucks.    NOW FOR THE GOOD: If you like strategy games where you have to baby-sit every single unit despite the fact that the player is supposed to be a member of a highly advanced civilization, then this is the game for you.",
            "review_score": "-1"
        }
    ]
}