{
    "app_id": 289500,
    "name": "UFO: Aftershock",
    "release_date": "2014-04-16",
    "developer": [
        "ALTAR Interactive"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Tactical",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 72,
    "negative_ratings": 31,
    "price": 2.79,
    "description": "UFO: Aftershock is a combination of tactical squad combat and global strategy that enhances and expands upon its prequel, UFO: Aftermath.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/289500/header.jpg?t=1553173386",
    "minimum_requirements": "OS: Windows XP Processor: Intel Pentium® III or AMD® Athlon 1GHz Memory: 512 MB RAM Graphics: nVidia® GeForceTM 5700 or ATI Radeon® 9500 Storage: 4 MB available space Sound Card: MS DirectX® 9.0 compatible soundcard",
    "recommended_requirements": "OS: Windows XP/7/8 Processor: Intel Pentium® IV or AMD® Athlon 2GHz Memory: 768 MB RAM Graphics: nVidia® GeForceTM 6600 or ATI Radeon® 9700 Pro Storage: 5 MB available space Sound Card: MS DirectX® 9.0 compatible soundcard",
    "reviews": [
        {
            "review_text": "It's good!",
            "review_score": "1"
        },
        {
            "review_text": "This game follows the Aftermath's pattern in combat, but there are a lot of improvements in graphics and UI, the global map is also improved. There are plenty of weapon to choose from, melee weapons, real firearms, sci-fi weapons, etc. The are three distict classes to choose your soldier from and this depends on your diplomatic relations with certain nations. The enemies are also interesting, aliens and also humans (called as 'cultists'). Unfortunately this game has a lot of bugs and you will likely make your own save game, and save often. All in all, I think this game worths the money if it is on sale, you can have a lot of fun with your own favourite soldiers.",
            "review_score": "1"
        },
        {
            "review_text": "UFO Aftermath, the prequel to this game, is a good tactical game: fast paced, great ambiance, and with a good sense of progression.   Aftershock is built upon the gameplay of its prequel and is pushing further by introducing economy, friendly fire and even a diplomatic system.  However, the game's progression is awful. The first hours are very difficult, and that's nice. Then you'll reach a phase where you have pretty much won. You control the globe thanks to your OP soldiers, the enemy cannot scratch you... but the game is still going. All that is left is waiting for the ending to come to you. I am 35 hours in as I write this and still waiting.  The battlescape also take a dive because your soldiers stupidity. They react slowly, if at all, constantly lose sight of enemies and do not even lean around covers (they did in Aftermath!). Its bugs and poor balance ruin an otherwise awesome tactical game.  This is frustrating. I really want this game to be good but it fell flat after a few hours inside the campaign. If you pick this up, I recommend looking for mods. Don't play this as vanilla.",
            "review_score": "-1"
        }
    ]
}