{
    "app_id": 289600,
    "name": "Marauder",
    "release_date": "2014-04-04",
    "developer": [
        "Apeiron"
    ],
    "publisher": [
        "Buka Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RPG",
        "Tactical"
    ],
    "achievements": 0,
    "positive_ratings": 298,
    "negative_ratings": 152,
    "price": 6.99,
    "description": "Marauder, is a squad based and tactical 3D game with RPG elements. It was released in late 2009, in Russia. You may know these names as the former made Brigade 7,62 and the later also published Pathologic.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/289600/header.jpg?t=1518534672",
    "minimum_requirements": "OS: Windows XP/Vista/7/8/8.1 Processor: Pentium 4/Athlon XP 2 MHz Memory: 512 MB RAM Graphics: DirectX compatible 64 MB Storage: 3 GB available space",
    "recommended_requirements": "OS: Windows XP/Vista/7/8/8.1 Processor: Pentium 4/Athlon XP 2.6 MHz Memory: 1 GB RAM Graphics: DirectX compatible 128 MB Storage: 3 GB available space",
    "reviews": [
        {
            "review_text": " «No one wants to buy me for a handful of cereals! »  - Random woman in Bazaar   Marauder , also known as Man of Prey, is a title which has a very soft spot in my gamer heart. There are some minor bugs, the story cutscenes are constantly freezing on modern systems and some ethical elements in the story indeed leave you behind with a raised eyebrow.  But if you've got a thing for turnbased strategy games like  Jagged Alliance 2  or Marauder's spiritual predecessors  Brigade E5  or  7,62 High Calibre , then this game is totally for you. Because of its appealing post-apocalyptic setting even fans of  S.T.A.L.K.E.R.  or the  Metro  series may take a look at this game.  The story, based on the same-named novel by Russian writer Berkem al Atomi, keeps you hooked for about 30 hours and is pretty unique. You control Akhmet, a Russian muslim and former army sapper, through the outskirts of a deserted city south of the Ural mountains. After a Russian political approach to NATO and the west, the US Army invades Russia under the pretext of a Peacekeeper Mission. The huge country therefore falls into chaos and soon anarchy spreads out. Akhmet and his lovely wife must now try to survive through this indeed chaotic cluster♥♥♥♥. As the game title already suggests, Akhmet does so in looting and fighting off bandits, stray dogs, corrupt policemen and even foreign soldiers. Interestingly Akhmet is not a  good guy  in the proper sense. He doesn't really care for the wellbeing of other dwellers or to bring justice all over the city. He only takes care of his family and its survival - whatever the cost. Soon he begins to fortify his apartment block against enemy raids...  Like in 7,62 High Calibre you control Akhmet from above and you can pause the game at all times. While the game is paused you can plan your next moves and give Akhmet (and later his companions) commands. Rather than taking away Action Points like in Jagged Alliance 2, all your actions require a certain amount of seconds, which will be counted down as soon as you un-pause the game. This gameplay element, called the Smart Pause Mode, may take a while to get used to it but works perfectly as soon as you progress. Once you also get your proper equipment the combat sequences are a blast - I've seldomly cheered so much while Vitek, our pro sniper in the team, scores another yet perfect headshot from hundreds of yards away. On top of that there is also a fancy skill system and upgradable character parameters. After levelling up you can invest points in better accuracy, stamina, barter skills or whatever comes in handy. The inventory, also similar to the one from the S.T.A.L.K.E.R. series, is pretty simple and self-explanatory. In the Bazaar, the local city market, you can trade further equipment and even upgrade your weapons. Also note that, similiar to the Metro series, the local main currency in Marauder are 5.45x39mm cartridges, colloquially called «fives».  Even if all this suggests that Marauder is an open-world game, it sadly isn't. In fact the game is pretty linear and you move from one section to another while regularly returning to your house and the Bazaar. I wish the developers would had implemented more city sections back then, but even then it's an already quite immersive world.  What really ♥♥♥♥♥♥ me off is that the fancy story cutscenes always freeze on modern systems. This is already a well-known problem and nobody really knows how to fix it. Once again, it's an absolute impudence that the current publisher didn't give a ♥♥♥♥ about fixing all these problems before releasing this game on Steam. Furthermore there are a couple of other bugs and sudden crashes, but those are pretty minor or rather quite uncommon from my point of view.  Either way, please make sure to do the following steps before playing the game:  #1 If you've got a large monitor, adjust your resolution  according to this guide . #2 Adjust the poor camera controls  according to this guide . #3 Fix the grenade launcher reloading bug  according to this guide . #4 Please read Tin Tim's fantastic  Let's Play Guide  [lparchive.org]  while playing. There you can  watch all story cutscenes that don't work in the game itself ! Furthermore it provides you with excellent hints and not too much spoilers.  The Good: + Quite detailed graphics + Immersive world and creepy Eastern Bloc atmosphere + Innovative story + Awesome combat + Lots of weapons (unfortunately not many NATO guns) + Good skill, trade and inventory management + Loot, loot and even more loot  The Bad: - Pretty linear - Some slowdowns during combat - The final sections of the story are quite unpolished - Those above mentioned bugs  The Ugly: -- Story cutscenes not working on modern systems! Argh!  To put it in a nutshell, this game really grows on you if you love turnbased tactical games with lots of guns and a post-apocalyptical setting. It still has its minor flaws, but the rewarding combat system just does it for me. Period.   9/10    «The Democrats are to blame!»  - Random man in Bazaar, philosophizing about the cause of war",
            "review_score": "1"
        },
        {
            "review_text": "Buggy, badly translated but the gun combat is extremely satisfying. If you enjoyed Jagged Alliance and those types of games, this game will appeal to you.   ",
            "review_score": "1"
        },
        {
            "review_text": "It's a highly recommended buy, though with many restrictions and prerequisites. Yeah, game-is-not-for-everyone's-tastes.  First, you should really like squad-tactics games like Jagged Alliance, Silent Storm or 7.62 and DON'T BE a graphics freak who wants everything in 16:9 with 60fps. Game's a bit dated, see? And still, it can be successfully compared by gameplay options even with latest tactics games. That slow-paced genre never was too hard about graphics. Physics, mechanics - that's a prime, but high resolutions... meh. Second, be ready for glitches. Game and engine developers now either dead or missing, so there is no help in asking for patches. Although for the most part, game is running okay, except for cutscenes. Third and last is about moral - it's a game where a desperate man doing everything to survive, so if you like playing knights in white armor, that's surely a wrong game. Try 'The Shining Force', maybe?  Now, what's it all about? Well, it's a game based on the book 'Marauder', bestselling in Russia, which were telling a story about a smooth and easy diplomatic victory of NATO forces. Russia is no more, sold to 'West world' by some puppets and oligarchs, with 'all included'. Some cities like Moscow and Saint-Petersburg remains almost the same - just to decoy everything else that is going on in the once-a-great-country. And what is going there? Every big force in former state like paramilitary formations, or even some villages coalitions is methodically observed and negated by NATO 'peacemakers'. They called 'mistresses' there, in sado-mazo sense, meaning they are masters and natives are slaves... Russkies are living in ruins of cities, without energy, fuel, water, food supplies. Anarchy and 'homo homini lupus est' rule is prior for everyone. Our 'hero' Ahmed, with the collapse of the state, is off to search for every piece of scrap he can use or sell, marauding and killing for own survival. Oh, grim apocalyptic future! Maybe it's close by already. I mean, look at eastern Ukraine...  Anyway, although this game is constructed pretty linear, right along with the book plot, there is a little twist in the end, for which I'm so fond to this game. While in the book a protagonist fled away when his city was about to be 'purified', in game we have a chance to strike back. To kill a slave in yourself! That's grand, really. Like killing Hitler or defending Alamo on your own. I'm spending all that much space revealing you the story, because it's the ♥♥♥♥♥iest part in the game. Not a story itself, but the way of its telling. Cutscenes are bugged, I don't know anyone who could see it all without glitch. More to that, translation from russian to english were surely made by Promt software, or something like that. Those who answered for translation, should be burned alive, since they were lazy enough to bungle even with a tutorial!  Okay, if you were able to read that all and still thinking 'why I should buy it?', like I said from start - it's a good tactical game, highest evolution of Apeiron engine, knowing by 'Brigade E5' and '7.62' games. Buy it with 75% discount, sell cards - and maybe you will have upper hand at the end of a deal, gaining more than spend.  9/10 successful missions. The sapper makes only one mistake.  PS: to turn on camera rotation in game fix 'camera sensitiveness' setting from zero to twenty, at least. And maybe it will be wise to turn on 'windows xp' compatibility with 'e8.exe'. Peace, people.",
            "review_score": "1"
        },
        {
            "review_text": "91 hours, of a rather difficult game. Just for a flop ending.  ",
            "review_score": "1"
        },
        {
            "review_text": "A good game. It crashes sometimes for reason I can't tell you because the text box is gibberish for me. When it does work it's very fun to play! A linear story, but freedom within the game when you do get to where you're doing the missions for the story. You also have a wife who punches like Mike Tyson. Your characters kind of a ♥♥♥♥, but who wouldn't be if survival was on the line, right?",
            "review_score": "1"
        },
        {
            "review_text": "I'm a big fan of both JA2 and 7.62 High Calibre. I'm really loving this game, it's very similar to 7.62, but with a great, dark novel as setting.  CAUTION: The Smart Pause System works more like a Turn Based Strategy game than like a Real Time Strategy. Only comparable to 7.62 and Brigade E5 (somewhat prequels to this game), or to Jagged Alliance (as far as micromanagment, guns and ammo go). If you buy this game expecting fast action and a slug fest, you are probably going to hate it.",
            "review_score": "1"
        },
        {
            "review_text": "You can gain experience points from beating your wife! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Hardcore tactics game - not recommended for players looking for a more casual experience (e.g. the newer XCOM games). Micromanagement of units is heavy, down to posture and walking speed, but the game is a real-time with pause for giving orders one, so it is manageable.  This game shares its engine with 7.62 High Caliber; if you haven't played that game before, I'll just say that it's like the Silent Storm games but slightly more complex on one side but the environments aren't as destructable as in Silent Storm.  The story, as far as I could grasp it (from what I played plus some let's plays and what little I read about the novel) is set on an alternate 1990s where the USSR splits and falls into absolute chaos (as opposed to the partial chaos that happened there in the 90s) and a multinational force (led by the US) steps in as peacekeepers but ultimately stay as occupants. The protagonist is a guy trying to hoard supplies and survive, and you make a few pals along the way and fortify your apartment block.  Pros: -A believable story about societal collapse where you don't try to save the world - just you, your family and friends. -Hardcore tactics! Luck doesn't matter as much as proper tactics. -You get to learn a bit of Russian, since it's got Russian voiceovers w/English subtitles. Beware that some of the swearing is minced (e.g., 'Blin!' instead of '♥♥♥♥♥!'). -Graphics are nice for its time and scope.  Cons: -Camera angles can be a bit of a pain at times, especially when you walk into buildings (moreso in multi-storey buildings). -Controls are a bit complex - if you only play every now and then, you may want to revisit the tutorial (which is rather lengthy and deadlier than usual as far as tutorials go).",
            "review_score": "1"
        },
        {
            "review_text": "Interface is bad and the game engine slows to a crawl when there are more than a few enemies. Cut scenes don't work properly and there are lots of spelling mistakes.",
            "review_score": "-1"
        },
        {
            "review_text": "If you're looking for a good game, don't get this one. I didn't make it very far at all. The controls are terrible. I barely got the camera to kinda work. I would love to have my dollar back. A cheese burger would be more fun.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a wet turd. Interface is broken, and in places incomplete. If the game wasn't actually broken, this could have been brilliant -- a game in the vein of silent storm and the original Xcoms. Indeed, that's obviously what this game wanted to be. But now it's just another sack of poop kicked out of the door so poor sods like me end up buying it because we assume for a game to show up on steam it's got to at least be playable. Shame on you, you starving bunch of ticks. Go suck somebody else's blood.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought the game with high hopes for some fun gameplay, but after trying it out, I might just say it was a waste.  First off, the startup intro seem to get some sort of hickup and freezes, though you can press 'ESC' and move on to the next cinematic that freezes, then when you start the game there's a cinematic but it also abruptly freezes after 1 sec but can also be bypassed as with the startup with 'ESC' key. Second, I had to 'hack' an .INI file and max out the camera sensitivity to get the camera to work properly, I also noticed that the game has no sound effects (although i heard something when i reloaded my rifle but that's about it).  The gameplay seemed promising at first, but the smart pause was kinda ♥♥♥♥♥♥♥♥, the enemy NPCs are ♥♥♥♥♥♥♥♥ and when i manage to get myself killed by gunfire, my character was thrown 6 feet straight up in the air just to slowly fall back down, made me laugh as I quit the game though.  Other than that, the voice acting is in russian but it has mediocre subtitles so it's playable. Oh well that's it for me here, off to play something else...",
            "review_score": "-1"
        },
        {
            "review_text": "It's controls are weird, the combat is horrible and I already hate the game only in the start of the 3rd mission.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME HAs the worst most clunky hard to move camra i have ever seen in most any game i have played controls and combat very hard cuz of ♥♥♥♥ response times and than theirs the laggy intro this game looks just from the stroy and kind of gameplay like if done right it may have made a really great game but the camra controls combined with all the bugs im sorry but this game isnt worth 5$ its almost like they where trying to ♥♥♥♥ off people the that ♥♥♥♥ camra and clunky controls and ♥♥♥♥ combat",
            "review_score": "-1"
        },
        {
            "review_text": "Worse ten bucks ever spent... The game could be good if it had less bugs, a decent camera (it sucks so hard I stopped playing after 1 hour) ; better graphics would be appreciated : it's not 2000 anymore... TL;DR : DO NOT BUY IT !",
            "review_score": "-1"
        }
    ]
}