{
    "app_id": 289620,
    "name": "Collapse",
    "release_date": "2014-04-11",
    "developer": [
        "Creoteam"
    ],
    "publisher": [
        "Buka Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Hack and Slash"
    ],
    "achievements": 0,
    "positive_ratings": 342,
    "negative_ratings": 132,
    "price": 14.99,
    "description": "In 2013 the Central Europe (Ukraine, Kiev) witnessed a catastrophe. Everybody was mystified by its cause. What happened was beyond our comprehension. Somebody called it the collision of worlds or the stratification of two dimensions.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/289620/header.jpg?t=1524557122",
    "minimum_requirements": "OS: XP/Vista/7/8 Processor: Pentium 4 2 GHz/Athlon 64 2800+, Memory: 512 MB RAM Graphics: DirectX compatible 128 MB Storage: 5 GB available space",
    "recommended_requirements": "OS: XP/Vista/7/8 Processor: Core 2 Duo 2.5 GHz/Athlon 64 X2 3000 Memory: 1 GB RAM Graphics: DirectX compatible 256 MB Storage: 5 GB available space",
    "reviews": [
        {
            "review_text": "not a bad game, shame there isnt any english dialog becouse the caption text is way too small for my poor eyes making the story hard to make sence of so most of the time i dont know why im doing what im doing. others have had problems getting it to run on nvidia cards but it runs fine on my gtx 660 ti. if you like aimless shooting and bashing get this game if your after something with a little more depth look elseware. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "This game catches a lot of flack, and not entirely without reason.  Is it fun as all hell? Yes and more yes. Is it going to crash on you sometimes after you die? Yup. But!! the mix of melee and gunfight is such a fun balance, the satisfaction of hack and slash plus the mix of human and monster opponents really makes it rather easy for me to overlook the annoyances. Maybe because I have a toddler and tuning out annoying things has become an art that I have mastered. Anyways, if you wanna use guns and swords and jump around slashing ♥♥♥♥, this game is for you. (Plus, it was dirt cheap!!)",
            "review_score": "1"
        },
        {
            "review_text": "So, I just finished this game I thought it deserved to have at least a brief review.  Story: 6/10 - pretty cheesy, kinda obvious, predictable. But the background is quite good.  Sounds: 8/10 - The soundtrack itself is amazing, but it gets kinda repetitive. The weapon sounds are mostly crap. Rest is good, voice acting is kinda forced but fine, I don't understand ukranian/russian.  Graphics: 8/10 - Character models are quite good, enemy design is unique (and seems that I finally found out where Borderlands got their spiderants from), weapons are okay. Some animation problems with finishing attacks and so on, the enemies sometimes (like, often) are not placed where you are putting your sword, so it kinda looks trashy. The world is really cool and atmospheric, looks A LOT like City 17.  Gameplay: 7/10 - The combat is usually fun. Sometimes it gets kinda crappy because you're flooded with melee enemies and ranged enemies at the same time. Another crappy thing was the jumping parts. The game has a really stupid jumping thing and they felt like it was okay and decided to put it to use in two places. I wasted an hour total just trying to jump correctly and not falling to my death. About the combat itself: Melee is quite fun, it's like God of War, only all of the combos are useful in different situations. The shooting is nothing new to a third person shooter, quite generic and could feel a little bit better.  Played mainly with a keyboard, but tried the controller and don't recommend controller, it sucks.   Verdict: 7/10 - No replay value, but it sure wasn't a bad game. Recommended if you want some weird experience. Especially if it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "  7/10 TJBs",
            "review_score": "1"
        },
        {
            "review_text": "repetetive combat and frustrating checkpoint system making you replay the same parts over and over   the only reason ppl are liking this game they expected much worse, but just because it's not terrible doesn't make it good or very fun to play",
            "review_score": "-1"
        },
        {
            "review_text": "fighting system is very clunky. Bad guys can take up to 4 head shots to die and the sword play is probably the only redeaming element. not worth the money also be ware the voice acting is really annoying.  2/10",
            "review_score": "-1"
        }
    ]
}