{
    "app_id": 289760,
    "name": "ROCKETSROCKETSROCKETS",
    "release_date": "2015-05-01",
    "developer": [
        "Radial Games Corp",
        "Loren Bednar",
        "Dr. Kimberly Voll",
        "Lindsay Jorgensen"
    ],
    "publisher": [
        "Radial Games Corp"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Sports",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Action",
        "Casual"
    ],
    "achievements": 36,
    "positive_ratings": 431,
    "negative_ratings": 118,
    "price": 4.99,
    "description": "ROCKETS fire ROCKETS at ROCKETS in this action-arcade, arena-combat, gorgeous festival-of-fireworks! It's dogfighting meets figure-skating in space with local multiplayer and single-player fast-paced action modes plus a ZEN MODE where ROCKETS learn to LOVE.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/289760/header.jpg?t=1542309589",
    "minimum_requirements": "OS: XP Processor: Core 2 Duo or Higher Memory: 2 GB RAM Graphics: Intel HD Graphics 3000 with 384 MB of RAM Storage: 200 MB available space Sound Card: DirectX compatible sound card",
    "recommended_requirements": "OS: 7 Processor: Core 2 Duo or Higher Memory: 2 GB RAM Graphics: NVidia GeForce 9800 GTX+ or higher Storage: 200 MB available space Sound Card: DirectX compatible sound card",
    "reviews": [
        {
            "review_text": "This dogfight ballet is intense with two players and hilarious madness with four. Very simple for anyone to pick up and play which makes the game ideal for party situations but there is a lot of finesse with controlling the abilities which gives the game a lot of legs for competitive players.   This is one of those must have local multiplayer games that is sure to become part of your friends' regular rotation.",
            "review_score": "1"
        },
        {
            "review_text": "That's fun. Dynamic, simply and cheap timekiller.  P.S. IT WAS CHEAP ON EARLY ACCESS SO SHUT UP.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome game for the price. Addicting fast paced gameplay that gets pretty intense when playing with a few buddies. A solid game with a low price. I definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "I didnt play this game for very long yet. Im sorry , if anything in my review isnt 100% the Truth , i might just havent noticed some of the Features.  -Soundtrack is better than the Actual game  -If i got the Main Menu and its soundtrack , i would probably also have bought the game.  -AI was made by the Developers of 'Why so Evil'  -There is only a single AI Difficulty  -If you got used to it , the AI is Okay , but its Definitely much too hard if you are just about to start playing  -Graphics and Effects are MLG²  -EXPERIENCE DRUGS WITHOUT TAKING DRUGS by putting all the settings 100% to the right of the bar!  -By now , the game is good. If it will ever get an Online Multiplayer , it will be GREAT.  -All in all , If you want a challenge and the game is on Discount , Buy it.  RATING: MLG/10",
            "review_score": "1"
        },
        {
            "review_text": "Starwhal, only a headache. Also minus the magic. Get Starwhal instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Neat game, Neat idea, awesome soundtrack, poor performance. I actually really like this game, its got a lot of potential and i would have loved to have played it as a party game with my friends, however, this game simply cant hande itself. With four players, or even two, as the players get far apart and the game has to load more of the map, the speed at which the game runs at significantly drops, when it gets to bad then the framerate drops as well. Its playable, but definetly not as enjoyable when you all slow down to turtle speed. tested on several gaming laptops, it definetly seems to be an issue with the game and not laptop performance... Also, DO NOT TRY TO CHANGE THE RESOLUTION!!!! Ruins everything, makes everything invisible, gamebreaking, trust me. dont even try.  You can turn down graphical settings, however i find it still didnt help the lagging issue. Works decently fine with 2 people in close proximity, where you can see what the game is meant to feel like. Until the issue is resolved,  5.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "I bought me and my friend a copy of this game expecting to be able to play it together. Unfortunately this game is only LAN or local play. I would highly recommend buying this game if you want to have some fun action with a friend in the flesh, however if you wanted to play online it's not for you. I won't be refunding this game as it is actually very good and will probably just get my friend to visit at some point to have more action and fun!  5/10 for no online play",
            "review_score": "1"
        },
        {
            "review_text": "Annoying game. How do I start a single player match?!",
            "review_score": "-1"
        },
        {
            "review_text": "Bought it for multiplayer, turns out it's only local multiplayer. Lesson learned: read the reviews before buying a humble bundle.",
            "review_score": "-1"
        },
        {
            "review_text": "Maybe when you're high as ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "This game is wonderful with its unique art assets and its fast gameplay. I would not recommend playing the game alone because it is far supperior to play with a friend. The game is worth every cent it costs.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game for free. :happymeat:  Although I got only one person to play with me, most of the dogfights... Boiled down to sheer luck, as even if you're aiming directly at someone,  your projectiles are not guarenteed to hit, or miraculously hit even though they weren't even aimed at you , which is cheap.  .. And controls are fumbly but intuitive once I got used to it.  Simply put, this is co-op-versus twin-stick shooter game well done with simplistic graphics.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing little game to play. It can be very addicting. Only problem I have right now is multiplayer, if it exists that is. I have no friends that own the game. I was thinking maybe there was a game invite feature that would show it or something.  However, note this is fun regardless. Only thing is that the AI difficulty is quite high.  ROCKETSROCKETSROCKETS!   Just saying it can also be fun.  err, maybe not.  --------------- EDIT: After further investigation... This is a local multiplayer only... Sadly... I don't think they will implement online multiplayer... Which is main reason I bought game.",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game if you have a few friends over, and even though Im pretty sure it is more based on luck than skill, its a wonderfully colorful time.",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand them. They say it has multiplayer, yet there is none. OH YOU MEAN THE LOCAL PLAY? Great, thanks. I'll be able to play with my friends who live far away.",
            "review_score": "-1"
        },
        {
            "review_text": "i would recommend this game it is pretty good but i hope they add online multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun- there is nothing like it out there right now, and I strongly recommend it to anyone interested in a great party game.",
            "review_score": "1"
        },
        {
            "review_text": "Played it for 10 minutes solo, asked for a refund. A friend came, we played together, I cancelled the refund :-P  So, recommended only if you intend to play with friends.",
            "review_score": "1"
        }
    ]
}