{
    "app_id": 289840,
    "name": "Dracula 3: The Path of the Dragon",
    "release_date": "2014-04-17",
    "developer": [
        "Microids"
    ],
    "publisher": [
        "Microids"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 34,
    "negative_ratings": 81,
    "price": 5.59,
    "description": "There is obviously no such thing as vampires... at least according to the official line of the Catholic Church. The trilogy continues as the Prince of Darkness rises again.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/289840/header.jpg?t=1478597462",
    "minimum_requirements": "OS: Windows® XP/Vista/7/8 Processor: 3 GHz Memory: 1 GB RAM Graphics: GeForce 6800 GT / Radeon 1800XT DirectX: Version 9.0c Storage: 1 GB available space Additional Notes: Minimum screen resolution is 1024 x 768",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I'd really like to reccomend this game - But the problems it has and the cut scenes / frames of animation missing make this game tough to play on the PC. This is not the original disk version of the game that was released by other publishers instead it's been optimized for tablets and ported over to the PC. The mouse controls run too fast and there is no way to adjust this. The way you advance through some scenes makes it impossible or next to impossible to advance to other areas of the game. It's like you almost have to click through everything in the scene your in just to see if something happens where your character can advance. Some NPC characters in game you interact with have limited amounts of animation, but mostly have speech bubbles with audio voice overs. At least most of the FMV is here. Shame since this is a great game that you may want to play through once more - but only if all the bugs present in this game are gone.",
            "review_score": "-1"
        },
        {
            "review_text": "This is not an original version of the game. There are missing some scenes and puzzles, the controls are totally different. It is like a mobile version or something and this point the game is a trash on steam. Go to buy an original version somewhere else....",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a joke, and a bad one for that matter.  First of all, it is not the full version -- parts of the story as well as the character animations are missing. What was Valve thinking adopting this version of the title for Steam? *facepalm*  I played the prequels on PlayStation 1 and couldn't wait to finally play part 3 on PC, but this? Nope, don't buy it, you'll only regret it.",
            "review_score": "-1"
        },
        {
            "review_text": "**",
            "review_score": "-1"
        }
    ]
}