{
    "app_id": 290040,
    "name": "Retro Game Crunch",
    "release_date": "2014-05-19",
    "developer": [
        "Rusty Moyher",
        "Shaun Inman",
        "Matt Grimm"
    ],
    "publisher": [
        "Retro Game Crunch"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Co-op",
        "Shared/Split Screen",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 259,
    "negative_ratings": 60,
    "price": 6.99,
    "description": "Retro Game Crunch is a series of 7 games, full of the charm and challenge of the 8-bit generation. Each world feels like an authentic NES classic. A massive genre-spanning collection.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/290040/header.jpg?t=1525367023",
    "minimum_requirements": "OS: Windows XP SP3 Memory: 1 GB RAM Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows 7 SP1 Memory: 2 GB RAM Storage: 500 MB available space Additional Notes: Xbox 360, Dualshock 4, or XInput-compatible controller",
    "reviews": [
        {
            "review_text": "Wish Valve had a thumbs in the middle for this game. The individual titles are all enjoyable and some can be a time eater if you start to get into it. That being said, a lot of the games in this feel as if they focused more on copying the look of 8-bit era games (specifically NES), but not the feel of the games from the era. This does detract some from the experience. With that said, there's some entertainment to be found here. I'd recommend a purchase if you can catch it during a sale.",
            "review_score": "1"
        },
        {
            "review_text": "So far I've only played Super Clew Land, one game out of seven. It took me a little over an hour to beat, but dang it was a really good hour. Reminded me a lot of the Kirby games in art style and in music. The game was decently challenging, but not frustrating. A lot of games that go for the ~retro~ vibe tend to go for blistering difficulty, but Super Clew Land was only a little tough at some parts and was otherwise just 'challenging.' Really well-made and well designed, everything felt super nice. Just by the one game I can tell this collection is worth the price of entry, can't wait to try out the other games in the collection.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, I highly reccomend! If you are a fan of retro games you will love this one. It doesn't pose as too difficult and looks as well as feels authentically retro.",
            "review_score": "1"
        },
        {
            "review_text": "For any retro gamer or anyone that owned or still plays gameboy / GBC this indie pack is a must...the devs have crafted these games to an Nth degree..even down to original sound fx and music...  They're a blast  Enjoy",
            "review_score": "1"
        },
        {
            "review_text": "Take a bunch of ideas from old NES games, mix in some more ideas, bake into 7 different games, each with a different feel/mechanics, but clearly playing with what the idea of a pixelly 'retro game' means. Really nifty, obviously done with a lot of love.   Retro but modern, without trying to fetishize the pixels/genres. Seriously fun stuff here for retro fans.",
            "review_score": "1"
        },
        {
            "review_text": "I felt that Paradox Lost, Super Clew Land Complete, and Shuten were the best games of this package. I liked them enough to write this single line review.",
            "review_score": "1"
        },
        {
            "review_text": "As far as i can say, not a bad game.  The Reason why I dont recommend it to anybody outside the USA is the keyboard-layout. You CAN play it with a pad, but It seems so be impossible for many americans to see, that other countries may have different keyboardlayouts. So they put functions to keys witch can be at the other end of the kb but dont give you the option to remap it. From a 15 Euro game we MUST await more! :(  Edit:  Played some hours meanwhile. Its absolutely not what I awaited. Maybe with 'retro' they mean big fat ugly NES-like pixels, maybe half-hearted instructions, maybe even only the lag of deep story. But it surely has not much to do with lovely 1986s games.  The price of 15 Euros is ONLY understandable, because of the 523167 people that worked on the game. I have seen much better flashgames for free even.   So its ok to buy for 2,50 Euros on sale to kill a few minutes. But not more. Sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "Seven very varied retro-style games for the price of one, AND they're all great! How is that NOT a good deal!  Has controller support -- but the button mappings aren't displayed anywhere. This isn't a huge deal however, as the games are quite simple.   Keyboard keys are displayed however, but they aren't rebindable. Actually, the games have no options to speak of either, no sound or graphics settings, but again it's really no problem as the games are very simple.   Thankfully you CAN play in windowed mode by pressing ESC while ingame.  I highly recommend this gameset -- especially if you get it of a sale.",
            "review_score": "1"
        },
        {
            "review_text": "A collection of 7 retro style games made in modern tijmes. If you played the original nintendo system and are looking for a fun little throwback then this game is well worth it. Shuten is probably the best in the lot, being a bullet hell shooter with fun, cool bosses. The puzzles in end of line are unique enough to warrant their own game with better graphics. I was surprised to see such good quality puzzles in this. Clew land is where you play a basic animal thing that gruadually evolves into different forms through eating and exploring. The others are decent enough.  If graphics effect your enjoyment out of gaming and you never played the original nintendo then you will definitely be dissapointed. It is what it is, a retro game crunch.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, great soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. like Undertale, but chopped up. like chopping vegatables but harder.  multiplayer is good. but you may need a controller for 4 player....",
            "review_score": "1"
        },
        {
            "review_text": "The games vary; some games will keep you occupied for only a short time before you pass but chances are you'll enjoy at least one of them. I recommend picking it up if it's on sale.",
            "review_score": "1"
        }
    ]
}