{
    "app_id": 2900,
    "name": "688(I) Hunter/Killer",
    "release_date": "2006-10-26",
    "developer": [
        "Sonalysts"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Naval"
    ],
    "achievements": 0,
    "positive_ratings": 52,
    "negative_ratings": 17,
    "price": 22.99,
    "description": "688(I) Hunter/Killer, the most realistic submarine simulation ever developed for PC. Master the sonar and weapons control systems, learn to develop real target situations and outfit your boat with the latest advanced weaponry. Then use your skills to complete the tour of duty and earn your dolphins to become a true submariner.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/2900/header.jpg?t=1447350933",
    "minimum_requirements": "Recommended: Windows 2000/XP, Pentium III, 256MB RAM, 1.5G Hard drive space, 32MB video card (Nvidia Geforce or ATI Radeon) DirectX 8.1 compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "At first I really wasnt sure if this was going to be a big waste of time and money but to my surprise it can deliver a really entertaining time killer.  THE GOOD   1: very realistic .. well at least to a civilian. 2: complex game mechaincs to those of us who dont like our games dumbed down. 3: strong sense of acomplishment when missions are completed  4: good variety of operations consisting of single missions, campaign and training. 5: A good challenge but far from impossible once youve learned your submarine skills.  6: Lots of replay value. 7: non linear game play do it your own style quiet or loud just be aware of critical objectives you are rewarded or punished based off your operating decisions.  THE BAD  1: No real training or explaining on how to actually operate ANYTHING ON YOUR SUB! making life very difficult in the beginning. BTW I hope you learned how to use sonar and stealth tactics for a submarine in high school otherwise its very touch and go for the first 5 hours. 2: A hard sell for full price 20 dollars based off its a 1997 game best to find it on sale. FINAL   I give this game a 7.0   A great simulator , if you can take the time experiment and read all the manuals and figuar out how a nuclear sub actually works you will find this game has a surprisingly high fun factor even for a 1997 game. ",
            "review_score": "1"
        },
        {
            "review_text": "I have been waiting to play this game for the last 10 years. I one time played this game when I was about 10. I didn't know how to play or what to do. Now finally I can play this game on my computer again. It is just as I remembered, a hard core submarine simulator. Very accurate to how to actually use sonar and ship manuvers. I have had my navy friends help me in this game learn how to use the sonar and launch torpedoes. This is a great game and a lot of fun. You just have to be patient and willing to learn to be good. Great game 9/10",
            "review_score": "1"
        },
        {
            "review_text": "... I think I sunk my battleship.  I have no idea what I'm doing here. I'm sure it's a great retro game for those that want a sub sim. I just have no idea what I'm doing :)",
            "review_score": "1"
        },
        {
            "review_text": "game keeps crashing",
            "review_score": "1"
        }
    ]
}