{
    "app_id": 290280,
    "name": "Volt",
    "release_date": "2014-04-14",
    "developer": [
        "Quantized Bit"
    ],
    "publisher": [
        "Quantized Bit"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 203,
    "negative_ratings": 98,
    "price": 0.79,
    "description": "You were on the way to a recycling process when fortunately for you - and unfortunately for the environment - you accidentally ran off. Now your goal is to escape from the facility, which is an extremely difficult task due to the fact that you are a battery without legs.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/290280/header.jpg?t=1507027461",
    "minimum_requirements": "OS: Windows XP Processor: 1.7 Ghz Memory: 1 GB RAM Graphics: Intel GMA 900 DirectX: Version 9.0 Storage: 150 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Although I have no inherent issue with mobile ports or mobile aimed design, in the case of Volt its control scheme is so egregiously designed around the use of touch that the PC version almost feels unplayable.  But lets take a step back. Volt is easiest (and I haven't the energy to write a lengthy description so easy is what you get) described as Cut the Rope as a platformer. As a little robot, you shoot electric strands out like a robotic Spiderman, swinging around level using only your momentum as you attempt to float into the warp holes placed in the most difficult to reach places.  If you've never played Cut the Rope, the key mechanic is cutting, well, rope in order to drop candy into an Omnom's gaping mouth. Except in this instance it's not candy, but your character, and instead of clever momentum manipulation it's frustratingly precise obstacle dodging as far too many different hazards conjoin to make getting through a level of Volt something akin a root canal.  Volt is challenging, to be sure, but it's the method of control which really makes it such a nightmare. Having to slice with a mouse with any degree of accuracy is far more difficult than it has any right to be, and the precision you're required to do so in to make it through a level is far beyond what you're capable of with the limited control you have over your battery character. And to be quite clear, this is within the first dozen levels of the game. You're given next to no time to learn how to use the terribly clumsy controls, and then sent on your way expected to be able to somehow survive a minefield you often can't see until you've already died within it.  It's horrendous design from top to bottom, and made me absolutely loath the hour or so I spent attempting to play the game. I don't even know why I found myself so angry, but maybe it's because all of Volt's issues seem like just a series of many slight missteps that could have easily been avoided, but instead produced an experience I couldn't wait to get out of.",
            "review_score": "-1"
        },
        {
            "review_text": "This could have been a fun little game, but the horrible controls made it frustrating and unenjoyable.",
            "review_score": "-1"
        },
        {
            "review_text": "good gameplay challenging levels responsive &amp; easy controls good vibes soundtracks drops cards  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I didn't really get into it the first time I played, but now that I got a bit further in it, it's just the right mixture of logic- and skill challenge. It is absolutely worth a try since you wouldn't exchange those 'eureka' moments for anything; and somehow this game manages to give them one after another (by making puzzles look hard but be actually pretty quick to solve). Play if you want to feel smart. :)",
            "review_score": "1"
        },
        {
            "review_text": "You're a sentient car battery that can shoot magnetic lasers out of its hands. I play this game when I haven't been hitting my head on the computer desk enough.",
            "review_score": "1"
        },
        {
            "review_text": "Its like cut the rope but it makes you want to take an AA battery and shove it up your nose.  11/10-IGN",
            "review_score": "1"
        },
        {
            "review_text": "Volt isn't what you'd think it is. Before installing this game i thought it would be another one of those games that you wonder why you wasted money on. i was proven wrong. This game is really enjoying to play, it starts to actually get quite difficult and you have to start thinking out every move you make. I would recommend this game to anyone who enjoys strategic games.",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot of terrible indy games on Steam that should never be touched, but this one is a doozy.   It's an indy retro pixel 2D scrolling puzzle platformer. It's like a winning bingo card of reasons never to buy a game. The developers must have done extensive research on finding absolutely terrible aspects of the indy movement to come up with a rotten hunk of code that typifies all of them. However, to their credit, even Unity couldn't stoop low enough to have their name on this one.  Regardless, it's a poor example of the horrible retro 2D platformer/scroller genre. There are too many of these games - this one brings nothing new to the table worth mentioning. Artwork is clunky, gameplay is, well, typical of the ancient dead genre. There are thousands of free, interesting games on Steam that are far superior to this. Don't buy it, don't play it (well, if you've played a 2D platformer before, you already have played this, it's so derivative). Indy devs, please, please stop with the 2D pixel scroller shovelware. Let it die.",
            "review_score": "-1"
        },
        {
            "review_text": "-",
            "review_score": "-1"
        },
        {
            "review_text": "it is good, will ♥♥♥♥ you off but i have fun doing so :D",
            "review_score": "1"
        },
        {
            "review_text": "Ahhh! This game is so frustrating. I really want to like this game but it's so frustrating trying to get hold of something with your beam and even though it's at a reachable distance the beam just doesn't stick. You try again and again, clicking again and again but it only works sometimes and you just don't understand why it didn't work before. I just got fed up of trying.  I just hope the developers fix this issue. If I click on a surface in mid air that is inside the area of reach, it should always work.  Essentially you are a battery that can jump upwards and can also send a limited amount of beams to grab on to walls and objects. And you have to get from point A to point B while avoiding dangerous obstacles and picking up items (for bonus points, I think) on the way.  I like the game and the atmosphere but the music can be somewhat annoying. Especially if you add the frustration mentioned above.  I guess I'll come back to this game to try to complete the level where I got stuck but if the developers don't work on these issues I don't think I'll want to play much more.  For now, I can't recommend Volt. Unfortunately.",
            "review_score": "-1"
        },
        {
            "review_text": "Go to Store (Featured), Click on Games, Narrow by Feature (Steam Trading Cards), Relevance (Lowest Price). Then skip to Page 9 or 10, until you find the .50 - $1.00 games. Add them to your Wishlist, games that are a dollar can go on sale and you may be able to purchase for cheap! A game at .50 may give you that value back in trading cards. Search and Install 'Idle Master' which will run your games even without the game being installed.  I may or may not ever play this game, but some games I have installed and messed around with on a rainy day! @ .50-$1.00 it's hard not to recommend!",
            "review_score": "1"
        }
    ]
}