{
    "app_id": 290260,
    "name": "Sokobond",
    "release_date": "2014-07-21",
    "developer": [
        "Alan Hazelden",
        "Lee Shang Lun"
    ],
    "publisher": [
        "Draknek"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Puzzle",
        "Sokoban"
    ],
    "achievements": 8,
    "positive_ratings": 289,
    "negative_ratings": 24,
    "price": 6.99,
    "description": "Sokobond is an elegantly designed puzzle game about chemistry. It's logical, minimalist, and beautiful - crafted with love and science.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/290260/header.jpg?t=1545809498",
    "minimum_requirements": "OS: XP Memory: 512 MB RAM Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Sokobond is a nice little puzzle game with some questionable views of chemistry.   The game involves you controlling one atom in a grid structure, and you move the atom around the grid forming bonds with other atoms [or not, in the case of noble gases]. Each atom is a simplified representation of its real-world counterpart, focusing mostly on the number of bonds it can form.  The puzzles in this game range from simple to quite tricky, and it took me quite a few hours to complete the entire thing without cheating. [Don't cheat, it's very satisfying when you solve a puzzle]. The mechanics require you to do a lot of lateral and reverse thinking, which is quite good.  Simple graphics and sound design, which works well for a puzzle game. The controls use either a keyboard or a controller, both of which are again, very simple [LUDR + undo/reset].  Definitely a good simple [but not easy] puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "PROS: - lightning fast install (67MB) - Clean, minimalist interface - Clever puzzles  CONS: - Lack of mouse support, especially in game menu - Lack of HOW-TO. The game basically assumes you know what to do (ie bonding molecules)",
            "review_score": "1"
        },
        {
            "review_text": "Overall, I liked the game. Everything is nicely done, it's a well designed puzzles with lovely aesthetics. The only thing I could carp about is educational aspect of Sokobond. You, basically, just play puzzle. There are interesting facts about certain chemicals after each puzzle, but you tend to rush through them, as you want to advance to the next level.",
            "review_score": "1"
        },
        {
            "review_text": "Ive never wanted to punch helium atoms so much in my life...  Forreal thou, the later levels have taken me multiple attempts as they are brain melters.  9.6/10 Very addicting and challenging",
            "review_score": "1"
        },
        {
            "review_text": "Fun lil' puzzle game that will teach you timbits of chemistry as you play. Challenging but fair with a pleasantly simple aesthetic. Worth picking up at full value.",
            "review_score": "1"
        },
        {
            "review_text": "This game is genius. Don't let the chemestry scare you off. Excellent puzzle game!",
            "review_score": "1"
        },
        {
            "review_text": "Sokobond is both an informative and fun puzzle experience. You don't have to be a chemistry expert to solve the puzzles, but you can learn a lot of basic concepts while playing. As a chemistry student, even I have learned a few things! Many of the puzzles can be quite challenging, which I like to think offers plenty of playing time out of one uniquely simple puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "I like the idea of a game that teaches me interesting facts about chemistry, but I wish this game just wasn't so difficult.",
            "review_score": "-1"
        },
        {
            "review_text": "I had suicidal thoughts after playing this game",
            "review_score": "-1"
        },
        {
            "review_text": "I love Chemistry, and I love this game! It's really beautiful, very atmospheric. The music really emerses you in the game. At first I experienced periodic lag, but Bacon's Adobe AIR fix worked and now I can enjoy my molecules spinning at a constant speed. What a simplistic puzzle game should be!",
            "review_score": "1"
        },
        {
            "review_text": "I'm a chemist now",
            "review_score": "1"
        },
        {
            "review_text": "Deceptively simple-looking puzzles that get very difficult. Very polished, minimalist presentation. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzle game; has almost nothing to do with actual chemistry, though.",
            "review_score": "1"
        },
        {
            "review_text": "nice puzzle game teaching basic chemistry",
            "review_score": "1"
        },
        {
            "review_text": "As a chemist the bond angles make me a little blind in one eye, but CHEMISTRY GAME! Puzzles increase in difficulty as you progress, becoming diabolical later on. I'm not all the way through yet as slider puzzles have always been my bane, and deep down, that's the heart of the game mechanic here. If you like puzzle games, this won't dissappoint.",
            "review_score": "1"
        },
        {
            "review_text": "I've played about an hour so far as I'm writing this review, and I'm pretty impressed already. It's not super teach-y, but as you move around atoms, you start to get a better sense of how how and when they bond. Each level adds different elements to the mix, so it always feels fresh. I keep getting mad at Helium for not bonding with things and am starting to consider Hydrogen as the promiscuous molecule it is. Judging by the achievements, later levels will incorporate different kinds of bonds for even more situations, and I think that's pretty neat.   Also, this game got me excited about methane. Not many things can do that.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent puzzle game with an enjoyable range of difficulty. I actually enjoyed learning chemistry for once!",
            "review_score": "1"
        }
    ]
}