{
    "app_id": 29120,
    "name": "Yumsters 2: Around the World",
    "release_date": "2009-11-12",
    "developer": [
        "KranX Productions"
    ],
    "publisher": [
        "KranX Productions"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie",
        "Casual"
    ],
    "tags": [
        "Casual",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 53,
    "negative_ratings": 26,
    "price": 3.99,
    "description": "Not only are these Yumsters crazy for strawberries, they can rock the bongos. For the love of fruity music, help them earn money by cleaning gardens to promote their band. To really skyrocket, Yumsters need the best equipment to win the ultimate grand prize at the fairy town music showdown.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/29120/header.jpg?t=1447351724",
    "minimum_requirements": "Minimum                                        Operating System: Microsoft® Windows® XP/Vista                    Processor: 600 Mhz                    Memory: 256 MB (512+ MB recommended)                    Hard Disk Space: 54 MB (or More) Available HDD Space                    Video Card: DirectX® compatible with 16 MB of Video Memory                    Sound Card: DirectX® compatible Sound Card                    DirectX® Version: DirectX® 7.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Yumsters 2: Around the World is the unofficial spiritual successor to Bad Rats. Featuring a similar production quality and budget as Bad Rats, Yumsters 2 pulls no punches in providing the best that indie games have to offer. The gameplay revolves around pulling brightly-coloured dinosaur worm things (Yumsters) across chains of fruits (at a blistering 60 FPS). They eat the fruits, and you get money for it. Later on, you use the Yum-money (the yummey) to purchase a generic albeit not racist musical instrument from whatever region of the world you're in (Egypt, Mexico, Japan etc) which you then use to play a rhythm minigame that rivals the depth and complexity of titles such as DmC: Devil May Cry and Michael Jackson: The Game. The intricate plot of Yumsters 2 is very well-paced, engrossing the player in a profound tale about brotherhood and personal growth as they advance from level to level. Yumsters 2 offers a plethora of graphical options to make it perform well on all systems, such as 'Fullscreen: on or off'. The soundtrack of Yumsters 2 is also very prodigious, featuring a whopping three minutes of looping audio. Sometimes if you score a good enough Yumster combo (a yumbo), 'Rules of Nature' will start playing, congratulating the player on their Yumsters skill. Yumsters 2's voice acting is top-notch. Captivating quotes such as 'Commander ready' and 'Tumma' (???) are delivered magnificently, rivalling the emotional and compelling narratives of titles like Metal Gear Solid. 'Do you think fruits can bloom even on a battlefield?' 'In the Middle East we don't hunt foxes, we hunt Yumsters.' If you liked Bad Rats, play this. Yumsters 2 may very well be the 'Citizen Kane of video game'.",
            "review_score": "1"
        },
        {
            "review_text": "When I first started the game I though it was looking at a Popcap game, it has the exact same style and setup like their games. It's an ok game though. You control worms that have to eat fruit. That's it actually. I can't explain it any other way. It's a fun casual game but I think its main audience will be kids.  [Rating: 62/100]",
            "review_score": "1"
        },
        {
            "review_text": "If you thought KranX Productions would be unable to outdo their amazing work with the first Yumsters! you were wrong. Yumsters! 2 is a true step up from that original Yumsters! drek. You'd have to be a true KRANXSTER to skip out on this one, folks.",
            "review_score": "1"
        },
        {
            "review_text": "Most casual games have satisfying game mechanics somewhere at their core. This one does not.",
            "review_score": "-1"
        }
    ]
}