{
    "app_id": 291270,
    "name": "Vitrum",
    "release_date": "2014-04-22",
    "developer": [
        "9heads Game Studios"
    ],
    "publisher": [
        "9heads Game Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 27,
    "negative_ratings": 37,
    "price": 1.59,
    "description": "Vitrum is a 3D, first person, puzzle/platform game with more than 45 stages, stage editor and community's shared stages. The game uses physics and powerful crystalsto challenge the player find your way out of each stage.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/291270/header.jpg?t=1447361066",
    "minimum_requirements": "OS: XP/Vista/7/8 Processor: 2.0+ GHz (dual core recommended); Memory: 2 GB RAM Graphics: ATI Radeon HD 2000+, nVidia GeForce FX 6 series Storage: 214 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Looked to be a fun portal-type puzzler from the first-person perspective...but fell very short. The game had some potential in its idea, but the game itself feels like an unfinished piece of work. Despite its mediocre graphics, the game ran very poorly on my system (which can run something like Saints Row IV in medium without lag), which also took away from the experience.  Although the game does look decent in the videos, the levels actually feel very empty and devoid of life, and not in a meaningful way.   If you're looking for an FPS puzzler, find something polished like Portal or Antichamber instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes when you alt tab, controls are bad, puzzles stop feeling hard half way through.",
            "review_score": "-1"
        },
        {
            "review_text": "portal without the magic",
            "review_score": "-1"
        }
    ]
}