{
    "app_id": 29130,
    "name": "Musaic Box",
    "release_date": "2009-03-19",
    "developer": [
        "KranX Productions"
    ],
    "publisher": [
        "KranX Productions"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie",
        "Casual"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 178,
    "negative_ratings": 12,
    "price": 3.99,
    "description": "Uncover all of your grandfather's sheet music, hidden in his home amongst a treasure trove of gorgeous antiques and musical relics. Melodious music box games will let you piece these special compositions together and unleash their symphonious secrets. Unlock Creative Mode and write your own outstanding arrangements.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/29130/header.jpg?t=1447351749",
    "minimum_requirements": "Supported OS:  Microsoft® Windows® 2000/XP/VistaProcessor:  800MhzGraphics:  DirectX® compatible with 16 MB of Video MemorySound:  DirectX® compatible Sound CardDirectX® Version: DirectX 8.0Memory:  256 MB RAM (512+MB recommended)Hard Drive:  54 MB or more",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Good game. As a musician, I enjoyed the history the game showed while searching around to complete the music arrangements. The game is simple yet intrict. It is easy for someone who doesnt have any musical sense and also good for musicians who know the reasons. The only downfall of the game is that it is a tad short, taking me only 3 hours to complete but overall I would highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I was originally put off by the puzzles' squiggly lines, but as soon as I hit the tutorial I was having a lot of fun playing around with the music. The game showcases plenty of familiar songs and keeps it simple. You don't need to be an expert to put the notes together, or even know how the song goes. Both the music and the puzzles have a good amount of variety, I didn't find either to be repetitive at all.  I think the least appealing part of this game would be the sections in which you look for scraps of paper in various rooms, but the game gives enough hints for it to be reasonably easy.   Very laidback lil' game with very beautiful bits of music, I just wish it was a lot longer.",
            "review_score": "1"
        },
        {
            "review_text": "6.5/10  A short, but sweet experience that doesn't need a heavy investment in time. Musaic Box is a puzzle game at heart with a very basic story to it. Find outlines hidden about your grandfather's workshop. Doing so succesfully will allow you to uncover your birthday present. Once you complete an outline you'll be able to piece together a musical melody that starts in pieces and needs to be assembled to complete the final work. As a layman, I found the music enjoyable and sometime's nostalgic. The difficultiy varies with a few pieces being somewhat hard to solve. Luckily there's a hint option that makes the process a bit easier by shading out misplaced pieces. Even though I favor this game it could have been much more than it is. There are only five rooms to explore and about a dozen or so melodies to solve. There is a Creation option at the end of the game, but it only allows your to rearrange previously solved melodies. I wish they would have gone into depth explaining the history behind each piece and possibly extending the experience with other areas to explore. Personally, I wouldn't pay full price for this game, but that's just me. Wait for it too show up in a bundle or a sale and you won't regret the few dollars you spend on it. Kid friendly, but your child may struggle with no prior knowlodge of the music in the game. I played in Big Picture Mode and had a problem with scaling. The screen was stretched off screen on all sides. If you encounter the same problem keep in mind that 3-4 of the outlines or solutions to outlines are hidden a bit off screen. That's what gave me the most trouble.",
            "review_score": "1"
        },
        {
            "review_text": "Musiac is a very nice game with 2 different types of Gameplay.  Number 1 - you search for 'parts' In a 2d room and sometimes you must complete small puzzles to get those parts.  Number 2 - You must complete various kind of Puzzles where you have to recreate songs.  The Gameplay is simple, easy and - fun!  During the few hours i played and completed the game i had alot of fun. And, thats what a game is supposed t be.  I can only recommend you to buy this game if you want a small but nice puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Nice little music based puzzle game. 2 hours start to finish. Just about right. Bundle fodder, but not bad at all.",
            "review_score": "1"
        },
        {
            "review_text": "What a great game, I didn't really know what to expect, especially for a price this low. I expected some sort of old school point and click adventure, but got a nice music/rhythm puzzle game instead, with point and click elements. The goal is to search rooms for parts of music sheets and combine these together to create a full sheet. You then have to recreate the music by forming a puzzle. You do this with several blocks, each with their own instrument(s). The example is listed in the lower center so you continually have to listen to the example and try and fit the puzzle together. It starts off easy but gets more difficult in a matter of minutes. It's a nice challenge, and I enjoyed it very much, because I'm an avid music listener. It's, so far, all classical music though, but most of them are well known. Even though the music fits the style, it would've been nice if there was a game around (sequel maybe, someday ?) with more modern music or where you could load your own music.  [Rating: 77/100]",
            "review_score": "1"
        },
        {
            "review_text": "Even though I had some issues with the game saves, I still recommend this game. The graphics are beautiful, and the music is an excellent arrangement of classical with a kind of contemporary dance/electronica beat to it.  The game involves using both auditory and visiual senses to solve the song puzzles. My favorite part is the 'Creation' option. You can arrange the music pieces of the songs to make your own song/arrangement.",
            "review_score": "1"
        },
        {
            "review_text": "It's very intresting, but too simply.",
            "review_score": "1"
        },
        {
            "review_text": "I personally loved this game; the light adventure-style gameplay coupled with some amusing puzzles as a vehicle for a nostalgic trek through a handful of classical music pieces reminiscent of some happy memories made for a very pleasant experience.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, it's a bit short, but you can have a lot of fun rearanging the songs and creating something new.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun little puzzle game. The song selection is pretty good (mostly classic ones that people probably can remember). The puzzles were great, although it took a bit of time to find everything. I'd give it 8/10.",
            "review_score": "1"
        }
    ]
}