{
    "app_id": 291640,
    "name": "Mirror Mysteries 2",
    "release_date": "2014-04-10",
    "developer": [
        "Gogii Games"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Hidden Object",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 38,
    "negative_ratings": 26,
    "price": 3.99,
    "description": "That evil mirror is back and it’s up to you to extinguish his power for good!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/291640/header.jpg?t=1447361095",
    "minimum_requirements": "OS: Windows 7/Vista/XP Processor: 1.8 GHz Memory: 1 GB RAM Graphics: DirectX compatible video card DirectX: Version 9.0 Storage: 360 MB available space Sound Card: Integrated Audio or better",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Glitch at the mailbox outside the house in the beginning tried under different profile name this time not taking the mail first that covers the keyhole. Played this before in a free trial on another computer so I know how it works, Can't get the second light bulb so theres no proceeding the hint button just points to the mailbox, have the key but it won't work.",
            "review_score": "-1"
        },
        {
            "review_text": "I liked the original Mirror Mysteries quite a lot, but this sequel was clearly written by a different developer, and it shows. Gone is the brave and pretty heroine from the first game, only to be replaced by her extremely annoying kid who has grown up and apparently gone insane while searching for the magical mirror his mother talked about. You play a private investigator who travels to the mirror worlds to find him. (Is that really necessary -- we can't just leave the little bugger to his fate?)  Speaking of the mirror, they completely ruined his personality. The original mirror wasn't exactly evil, he was just a curmudgeon who was annoyed at some unruly kids for breaking his mirrors. His sardonic commentary was very entertaining, and he actually helped the heroine in her quest. This new mirror has gone completely off the deep end into deranged villainy. The new voice actor plays him as a one-note bad guy, and there is nothing interesting or entertaining about him at all.  On top of all that, the hidden object scenes are much harder (but not in a good way), tbe puzzles are boring, and the mirror worlds are just derivative copies of worlds we've already seen a hundred times before in other, better games.  Ultimately I cannot recommend this game, even on sale. If you like hidden object games play the original, or search for one of the many superior titles developed by Artifex Mundi or Silverback Games.",
            "review_score": "-1"
        },
        {
            "review_text": "Enjoyed this one more than the first game but that's because it had adventure style gameplay this time. Took me a couple of hours to complete it but it was engaging enough that I don't mind finishing it in one sitting. The storyline is only loosely connected to the first but you wouldn't miss much if you skipped the first. I like the hidden object scene style in this series where it shows you a picture of a broken up object and you find the pieces, this game also didn't have any parts where I was stuck looking for something tiny. Definitely worth a look if you are a HOA fan, but get it on sale coz of the short story and limited replay value.",
            "review_score": "1"
        },
        {
            "review_text": "This sequel is much better than the original game, although it can still be completed very quickly. Graphics, story (still not much going on there but there's a nice link to the first game), music, acting and puzzles are all improved and enjoyable. Once again, no real replayability to the game. Buy it cheap and you should enjoy it, particularly if you have played the first game.",
            "review_score": "1"
        }
    ]
}