{
    "app_id": 29160,
    "name": "Blueberry Garden",
    "release_date": "2009-06-01",
    "developer": [
        "Erik Svedäng"
    ],
    "publisher": [
        "Erik Svedäng"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Short"
    ],
    "achievements": 0,
    "positive_ratings": 96,
    "negative_ratings": 28,
    "price": 3.99,
    "description": "Congratulations Blueberry Garden! Winner of the Seumas McNally Grand Prize for 'Best Independent Game' at the 2009 Independent Games Festival. Also a winner for 'Best Innovation' at the 2008 Swedish Game Awards. Blueberry Garden is a short and experimental game about exploring a strange world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/29160/header.jpg?t=1447351767",
    "minimum_requirements": "Operating System: Microsoft® Windows® XP / Vista Processor: 2.0 GHz Dual Core Memory: 1 GB RAM Hard Disk Space: 40 MB Video Card: NVIDIA® GeForce™ or better, DirectX® 9.0c compatible video card, Shader Model 3.0 required. Video card must have 256 MB Sound Card: DirectX® 9.0c compatible sound card Additional Requirements: NET 2.0 Framework, XNA 3.0 support DirectX® Version: DirectX® 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "An interesting game. Each playthrough is different. It frustrated the hell out of me at times, yet I still enjoyed playing it. The soundtrack is lovely.",
            "review_score": "1"
        },
        {
            "review_text": "One of WAY TOO MANY of the indie games of the late 2000's that focus on delivering an 'experience' and to 'change the way gaming is perceived' and 'waste your ♥♥♥♥ing time with a ♥♥♥♥♥♥ boring platformer disguised as an introspective journey into a world and into yourself'. Don't get this, and if you were unfortunate enough to have already received it, don't play it. It's not worth your time.",
            "review_score": "-1"
        },
        {
            "review_text": "Simple and beautiful. A wonderfully relaxing experience. Worth its tiny pricetag.",
            "review_score": "1"
        },
        {
            "review_text": "At first this game did not make any sense to me (like for Cadmium Yellow).  When playing for a longer while, I understood. And a really helpful review jogged my curiosity further. Then I enjoyed the game a lot :)  And I have to say that by this the game is worth it's price after getting into it. Fly, birdman, fly!  I'll give you some spoilers - step 1 will be mere hints, step 3 will be full-fledged explanations.  Spoiler step 1: * there is an objective to this game that will become clear if you play it for a longer while. Don't give up too soon ;) * at first it seems like a slow-paced exploration-game, but in reality it's a mean game that enforces quick acting to 'win' * to reach your objective you will have to understand the game-mechanics and world by experimenting and observing * don't be mad that there is no savegame. If you play a bit longer, you will know why it's not important to have one  Spoiler step 2:  * about the objective: you could say it's to help your birdman to survive  * why would your birdman need to 'survive'? Mind the very first picture being displayed right at the beginning of every new game showing a certain device that is commonly found in any modern household  * try to make your birdman eat every fruit (Enter), as each type of fruit will provide a certain useful effect for a while * there's a separate game-mode called 'playground' that can help you to find out more about the game-mechanics that you will need to make use of. Give it a try ;) * trees will only produce a small amount of fruit for a while until the trees will die * but don't despair, fruit can make new trees grow * however fruit will only grow into trees under certain circumstances * after understanding these game-mechanics, you can make trees grow to provide you with fruit (and their effects), and if you provide for the right circumstances trees will grow fruit that will grow into trees and grow fruit etc. for a long time * at first you might think it's weird or stupid that by touching large objects these will automatically be teleported to your 'home' and 'litter' it, but this is a very important feature of the game to help you reach your goal/s * small creatures do not only eat certain kinds of fruit to make life harder for your birdman, they will sometimes transport fruit to other places, occasionally causing trees to grow there by doing so * trees cannot grow / be grown under water!   Spoiler step 3  (beware and don't read if you want to find out yourself what this game is about)  * a faucet has been left running that will bring disaster to the garden by flooding it  * the water will start to rise slowly at first, but then faster and faster * your birdman will need to turn off the watertap and save the garden. However you will have to find and reach it to do this... * or else you can try to reach a safe place that will not be flooded. Maybe the moon?  * by finding large objects and teleporting them home by touching them, you will build a tower that will gradually grow above the rising water-level and in the end will enable your birdman to reach the moon * while the tower grows ever higher you will be able to reach higher grounds by flying, starting from the top of the tower  * after lying on dry ground for a while fruits will 'decay' and at the spot of their decaying a tree will grow - as long as no other tree is already occupying this spot. Then the tree will produce a number of the type of fruit that the decaying fruit had. After a while (and after having produced a small amount of fruit), the tree will die  * fruit will automatically drop from their trees if your birdman does not take the fruit, and then will often grow into new trees if the fruit is stopped from rolling before it will drop into water or stop at a spot where no (new) trees can grow * make use of these game-mechanics to ensure a constant fruit-supply * mind that the rising water will gradually stop new trees from growing in lower areas by flooding them  * the faucet is to the far right and high up * eating blueberries will help your birdman to fly higher * eating star-shaped fruit will enable your birdman to breath underwater for a while * eating brown berries will show you the way to large objects you might want to collect * eating onion-shaped fruit will shift a part of the ground sideways where your birdman is standing * eating small red fruit will make the part of the ground where your birdman is rise up/grow a bit   Sure, a savegame wouldn't hurt ;) However I would rather love to see tons of 'levels' made for this game, each with a new different kind of element bringing surprises ;) More - constant - background-music and different looking characters to choose from would be awesome too. The biggesst mood-killer for me have been the large nonsensical everday-objects drawn in a chidish style (well, and the moose). I'd rather prefer all of these objects to be fantasy-like imaginative fruit or so...",
            "review_score": "1"
        },
        {
            "review_text": "Crap. Don't buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Not everything is the way it seemes in this garden.  Fun but very short game.",
            "review_score": "1"
        },
        {
            "review_text": "If I'm honest, I just don't know what to do with it...",
            "review_score": "-1"
        },
        {
            "review_text": "Completing this is similiar experience to 'Kaipuu' and 'Painajainen' early indie games from Finland.",
            "review_score": "1"
        },
        {
            "review_text": "Blueberry garden is not the simple hipter indie game it may appear to be. Instead it is a vast extended metaphor for the communist CCCP. One can easily identify with the struggle of the main character. A nameless entity, doomed to a fate of endless consumption, while his peers march on with the same goals in mind. Drones in an infinitely repeating machine. Whilst the main character must struggle to find enough blueberries to sustain him, he must still pay trubute to the giant red fruit which compels him to his doom. The ever reaching powers of the Kremlin are called to mind when this element is masterfully employed into the story. This game weaves a complex story, which incorporates into it a complex stream of deeply emotional characters as well as action packed gameplay that draws the player into the mind of an oppressed factory worker in 1960's Russia. Despite the main characters ability to fly, walls always prevent further travel. Such was the effect of the Berlin wall, ♥♥♥♥outofro",
            "review_score": "1"
        },
        {
            "review_text": "pretty cool.",
            "review_score": "1"
        }
    ]
}