{
    "app_id": 292230,
    "name": "Game Character Hub",
    "release_date": "2014-05-23",
    "developer": [
        "Sebastien Bini"
    ],
    "publisher": [
        "Degica"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Steam Workshop"
    ],
    "genres": [
        "Design & Illustration",
        "Utilities"
    ],
    "tags": [
        "Design & Illustration",
        "Utilities",
        "RPGMaker"
    ],
    "achievements": 0,
    "positive_ratings": 196,
    "negative_ratings": 86,
    "price": 10.99,
    "description": "Game Character Hub is an art program that is focused on game asset creation, especially RPG Maker's. It provides a built-in generator for character and tileset creation.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/292230/header.jpg?t=1463100150",
    "minimum_requirements": "OS: Microsoft Windows XP/Vista/7/8/8.1/10 (32 bit or 64 bit) Processor: Intel® Pentium® 4 2.0 GHz equivalent or faster processor Memory: 256 MB RAM Graphics: 1024x768 or better video resolution in High Color mode Storage: 250 MB available space Sound Card: DirectSound-compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Very limited.  They created this software, and provided content, but very little, and only for the basic RPG Maker XP &amp; VX / Ace. The users themselvs have to stand for the content being added to it, and it basically puts you back to square one if you can't do sprite work, except, you generally lack the 15 euro you once had.  A lot of people have bought this, and they were hoping and gambling on it supporting the DLC character layouts for characters, but it doesn't, and you have to work around for a while to add the different selections of dlc content, such as the Rural Farm characters.  I personally feel that this is of no help to people who use these DLCs, nor for people that can't do sprite work, because this software if meant to take away that element for you, but it doesn't, and they never update to add new content. All it does is grab 15 euro, and leave you in square one, and gives false hope...  I am dissapointed in this software, and i can generally just say that this is trash in my opinion because they never update and add more content, making it seem like a small project only made for more income.  Generally, unless you will just use this for basic XP / VX / Ace characters, stay away, and if you are prepeared for a limited resource field, or can do sprite work, then i would recommend it, but most isn't, so how can you then recommend it to others?  It is up to you, give it a shot, but you might get shot...  -Walker   To all people who are commenting recently, this is why i have and remain at a bad review:  Earlier when this came out, it was marketed as a tool for people who couldn't create sprites, and that it would be so good to help you create characters if you didn't want to learn it. They didn't say that you had to actually know how to create sprites, and that you only had limited resources. That way, all of us who got this when it was marketed wrong felt tricked, because we were promised something that we couldn't use.  'if you are prepeared for a limited resource field, or can do sprite work, then i would recommend it, but most isn't, so how can you then recommend it to others?'  I clearly said that it's up to people themselvs to get it, if they can do sprite work i recommended it, but to those who couldn't, well... So you see, i only gave it a bad review for being wrong marketed, its page have changed info, but it still doesn't answer this review / question, so its still easy for people to fall for the same mistake we did when it launched.",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent application if you're working with any RPG Maker engine. It's cheaper and more streamlined than Photoshop. (That's what I was using before.) It's very easy to set up the grid so you can rearrange and edit tiles, too. I'm well versed with Photoshop and GIMP. But GCH is a great tool because it's so specialized for 2D spriting. You can see a walk cycle preview, for example. It can convert sprites from XP to Ace so they fit the number of frames. It can even handle the old 2000 and 2k3 sprites. It features random sprite generators that are easy to customize and set up. Some people expected it to have 'behavior' bases and corresponding parts, for animations or poses, like dancing or collapsing. It doesn't. (I have no idea where that expectation came from. At least one person already made a 'down' base. Just consult the internet.)  Yes, VX Ace has a built-in character generator, but you can't even adjust colors without an outside editor. GCH allows much more freedom for what parts you're able to use and how you can layer them. The resource sets it comes with are for RPG Maker XP and VX Ace. (If licensing is an issue because you're using some other engine, you can always import your own sprite parts...)  Now, this might not be the best tool for making a sprite entirely from scratch, for a number of reasons. But it's probably one of the best options for editing sprites or piecing them together. If the price is too steep for you, just wait for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "When creating an RPG, one of the most important things are the characters. While RPG making tools often come with their own standard characters, it can really set a game apart if the game uses custom designed characters. But, for those of us like me who lack the ability to create custom character portraits and character sprites, Game Character Hub is a godsend.  Basically, when you start the tool you create a type of character. Then you pick pieces from the proper character type, select them, and shift their order around, until the character looks right. The character (or face portrait) is shown in the lower left-hand corner, so you can quickly see what your result looks like.  Once you have a character, you can export it to use in the game or save the particular character, so you can re-load and edit it later. This is a huge help, in case the character doesn't look exactly right, or if you want to make a similar character later.  And, what if you want a slew of similar characters? Say you want a lot of minor NPCs that look just a bit different? Game Character Hub has you covered there. With one special Export command, you can create dozens or hundreds of characters (or faces) which vary in color (such as hair color, eye color, clothing color), all from a single template. This is a great way to fill in the roster of minor NPCs, very quickly.  Overall, it's an invaluable tool for character creation and I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I Loved Useing this it has been so helpful to me thank you for makeing this software 10 out of 10! Great  !",
            "review_score": "1"
        },
        {
            "review_text": "This program is just plain awesome. It really helps with making characters / sprites for RPG Maker!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Intending to use this only to create custom sprites (not assemble ones provided) and I can say that I really love this! It allows you to export files as PNG, so you can use them with a variety of different engines, it divides the canvas into tiles for you, so you don't need to worry about doing that yourself and it animates on the left hand courner. Far less messy than trying to do all of that in Photoshop.",
            "review_score": "1"
        },
        {
            "review_text": "This is great for the less than artistic individuals trying to develop a game. It's easy enough to start using in just a few minutes, but can be so much more than just a character maker, it's also a pixel editor.",
            "review_score": "1"
        },
        {
            "review_text": "It's okay.. but doing tasks i thought would be simple are more cumbersome than if i just used Photoshop. The fact that it seems made for VX and XP but not so much VX Ace is a huge issue. There are no options for grouped sets of charecters.. there only seems to be options for single charecters, leaving me to still have to fiddle with Photoshop to do most of the real work. I am putting it down as a NO... but really it's neither... as this would be great for some people.. but not others.. I am importing my own graphics in, and i'm finding that kinda cumbersome.. .. but only kind of. How do i make my own hair? How do i make my own anything? I don't really see explinations on how to set up resources.. or your own resources and set ups properly. It's as if it was made, expecting you to only really be working on VX and XP default set ups. I hope this software gets an update, because as it stands.. it's rather lacking. Unless i missed something..",
            "review_score": "-1"
        },
        {
            "review_text": "crashes on startup",
            "review_score": "-1"
        },
        {
            "review_text": "This software lets me make endless combination of character sprites and easily able to import as for my game in progress, it is very helpful and i give it. A master sword out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Though I'm sure it would have been easy to figure out without a tutorial, the instructions given upon opening GCH were actually really helpful and easy to follow. The UI is also pretty nice; it's clean and simple, but not lacking in tools either. I wouldn't recommend acquiring it without purpose, though, since it's really a niche utility more than anything. So unless you're planning on making games with lots of varied characters, I'm not sure why you would want this.   That said, it's great for keeping your sprites organized. Definitely a must-have for anyone dealing with more than a handful of characters.",
            "review_score": "1"
        },
        {
            "review_text": "It appears to be nothing but a selection of faces, capes, and other items found already in Ace with their built-in tool. If you have Ace, you will find better use of the default character creation tools. If you could use this to actually create sprites and not just modify existing ones, it'd be useful. As it stands, it's as useless as two guys using a strap-on. Glad I paid 3 bucks for it instead of 15. I'm gonna go buy a strap-on now.",
            "review_score": "-1"
        },
        {
            "review_text": "They should add other body types rather than just Human or Elf. What if we want a Goblin or an Impish character?",
            "review_score": "1"
        },
        {
            "review_text": "it will NOT work on my computer for rpgmaker xp",
            "review_score": "-1"
        },
        {
            "review_text": "Other than a few minor bugs that are usually fixed by reloading the program, this has turned out to be a very good program for editing sprites specifically for RPG Maker programs.  It has all the tools needed and not too many extras to clutter it all up.",
            "review_score": "1"
        },
        {
            "review_text": "A Nice Program To Work In More Detail And Freedom On Your Characters For Rpg Maker. Only One Down Side Would Be The Lack Of Options.",
            "review_score": "1"
        },
        {
            "review_text": "This is good for creating characters but not black characters for XP so please fix. Ill give a good recommendation when this is fixed",
            "review_score": "-1"
        },
        {
            "review_text": "This tool is awesome! It allows for FAR more customization than the default tool in rpg maker. I really wish there was an easier way to make child sprites, though, but you can scale the sprites so they're shorter. I hope there's an update for MV!",
            "review_score": "1"
        },
        {
            "review_text": "It's ok.",
            "review_score": "1"
        },
        {
            "review_text": "If you're serious about RPG Maker or sprite building in general, I WOULD HIGHLY SUGGEST GETTING THIS!  I was a little nervous when I first purchased Game Character Hub, I had read through the reviews and saw it was split pretty evenly down the middle, but I had also taken into consideration that most of those people who had reviewed the game had less than an hour of trial time with it. As you can plainly see, I have spent a PLETHORA of hours on this system! I LOVE IT!  At first I was a little disappointed with the avaliability of the items, UNTIL I spent additional hours messing around with the system. The Hub contains graphics for sprites stretching back over multiple RPG systems, and that was exciting for me, as I have only delt with VX Ace and the really OLD RPG Maker 2000 system. You can mix and match, and even create your own graphics utilizing the content in the Hub.  What I loved MOST about the Hub was the moment when I realized that I could use it for my own custom graphics. THAT'S RIGHT! I was able to upload my own custom sprite into the Hub! I used the system to get the sprite's animation right, because the Hub comes with a little display box down in the left hand corner of your character and what it looks like when it's moving. THIS HAS HELPED ME OUT IMMENSELY! I was having trouble for a long while getting this particular sprite to look right (it had moving shadows flowing around it) and using the Hub, I was able to finally get a working sprite out of it.  Now, I use the Hub for ALL of my sprite purposes. It makes everything so much faster and easier for me! I HIGHLY recommend this system!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Along with Axis Game Factory and RPG Maker VX Ace, Game Character Hub is my favorite tool Steam offers for map and character building. Especially for sprites. I cannot afford Photoshop nor would I of gotten this baby normally but luckily the developers make it available at many intervals such as Humble Bundles or breath-taking sales.  All-in-all I have a lot of interest in this product and would thumbs it up to anyone even remotely curious in using it. Much like RPG Maker VX Ace it has a slight learning curve but once mastered the program becomes a -ball- to use.  8/10, if only it had some addons or extra things.",
            "review_score": "1"
        },
        {
            "review_text": "Completely worthless program to anyone with Photoshop an access to RPG Maker. All of the included assets are directly ripped from those game makers (not sure the legality of that), and it includes nothing new whatsoever.  Everything I messed with in my minutes before I requested a refund was buggy, required re-positioning of basic additions, and was 100% doable, EASIER - I might add, using the RMVX Character Creator included with the program.  A waste of time and money.",
            "review_score": "-1"
        },
        {
            "review_text": "An awesome add-on if you have any RPG maker software, great to make some extra custom characters of your own. Really easy to use and a must own if your serious about making your own 2D RPG.",
            "review_score": "1"
        },
        {
            "review_text": "I use this to draw all my custom sprites for my RPGMaker games. I use VX Ace so I cannot speak on the quality of MV or the lack of it in this application. It comes with the character generator RPGMaker provides with a couple more options but with practice you can delve into it and draw your own sprites. It provides references for character direction and also sorts the sprites out into a sprite sheet automatically. It may not be for you but it certainly has helped me.",
            "review_score": "1"
        },
        {
            "review_text": "It makes it much easier to create characters and animations!",
            "review_score": "1"
        }
    ]
}