{
    "app_id": 292200,
    "name": "Crazy Plant Shop",
    "release_date": "2014-08-04",
    "developer": [
        "Filament Games"
    ],
    "publisher": [
        "Filament Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "achievements": 7,
    "positive_ratings": 178,
    "negative_ratings": 62,
    "price": 3.99,
    "description": "In Crazy Plant Shop, players learn about genes and inheritance by breeding zany plants! Special requests from mysterious customers require players to understand dominant and recessive traits and how genetic traits get passed through generations. Use profits to acquire new breeds, purchase shop upgrades, and acquire new customers!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/292200/header.jpg?t=1447361148",
    "minimum_requirements": "OS: Windows Processor: Modern Intel Core series or AMD Athlon processor Memory: 512 MB RAM Storage: 130 MB available space",
    "recommended_requirements": "OS: Windows Processor: Modern Intel Core series or AMD Athlon processor Memory: 1 MB RAM Storage: 200 MB available space",
    "reviews": [
        {
            "review_text": "Not 'crazy' but certainly adorable. The game centers around you being a plant shop owner and you breed plans to have certain traits and it's your basic genetics. It kind of took me back to those times where I had to fill in the squares with what traits would carry on and what not. It was really fun for the few hours I put into it, extremely cute with the nice graphics.  You carry out your day filling orders and breeding plants to make money to buy/unlock more plants and eventually the game ends when you unlock all of the plants and all of the traits. It was cute.  Reccomended for casual gamers or someone just looking for something to do for a few hours.",
            "review_score": "1"
        },
        {
            "review_text": "Cute, small, well made, puzzle like game. Was meant to be educational, but even though I'm not a child I thoroughly enjoyed it. Works both as an educational game about genes and a cute flower shop puzzle game :)",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay time is recessive but the fun is dominant! It is fun to grow your plants to have the right composition for the customers needs and on the side note you're learning your basic mendels law. As I said the only downside is the playtime, which is way to short. But it is so much fun that you can play it a few times ;)",
            "review_score": "1"
        },
        {
            "review_text": "Although this presents as edutainment, with a lot of crazy $10 science words like 'allele' and 'phenotype,' it plays much more like a fairly unforgiving business sim than a biology lesson.   After a few game days I worked out that most of the customer orders are not just hard or impossible to fulfil, but also involve selling special-order custom items at lower than the wholesale prices for standard varieties. So, the economy is strangely (lovingly caressed) against you. You can decline orders with no consequence as far as I could see, they just keep cycling through until you have the maximum number accepted.  Aside from the business model being odd, the real science of plant breeding is glossed over. I got the idea that some plants are 'simple' like sunflowers, and you can just choose through selective breeding whether they shoot sunlight or rainbows, whereas a Pitcher Plant is more complex with variables such as whether it holds a hot or cold beverage and if it has a sippy-cup or a lid, but you choose those traits by clicking on a button and it doesn't explain anything about how to actually do that to your Mom's houseplants.  Good points: for one there's no time pressure, just resource juggling. Also I did feel a genuinely heartwarming moment when, after days of fighting foreclosure, no money in the bank, no credit available and no way to fulfil paying customer orders I was able to waste my last 6 Gold Coins on a stock bunch of white daisies to sell for 3 Gold Coins to some scruffy street urchins who needed a break. The smiles made my day and the business turned around from that moment. So the Karma Simulation seems solid.  Upgrades to the store itself are unlocked very early and I strongly recommend getting the Breeding Machine Power Upgrade asap, as that is the only possible source of profit as far as I can see - the machine manufactures new plants at no Gold cost and the number of uses refills each day (starting on the day AFTER you buy it, I think.)  Graphics are excellent, hand-painted stuff in the ballpark of Bastion and nice animated, the sound's fine but the voice acting is patchy and amateurish, it seems like a port of tablet game but runs fine on my Windows 7-64 rig.   Not sure if 'terrible fake accents' is a good or a bad thing but it has that too. Also a Catctus... I mean a cactus shaped like a cat, in Spiky or Fluffy varieties. There are rabbit and chicken plants too.  Science!",
            "review_score": "1"
        },
        {
            "review_text": "Crazy Plant Shop is a pretty cool game while you're still figuring out the mechanics. Mixing plants and understanding how the dominant and recessive traits work in your favour (or against you). After you do understand, however, the game gets very monotonous.   Every mission is just someone asking you x number of plants with x and y traits. So you mix your plants to get the desired result. And that's about it. Some light management aspects to it, knowing when to buy a plant or mix them, etc., but those aspects don't make much of a difference, overall.  It also gets very dull to have to repeat the same procedure over and over and over again. Click here, click there, wait for the menu to pop-up, click here, open menu, close menu, etc. etc. It would definitely benefit from a pipeline mechanic, like in SpaceChem, so that you could automatize everything. But that would be a different game altogether, I guess.   I'm not too keen on the educational aspect of the game. I mean, it's still sistematic/mechanic learning. You're not exploring, digging, investigating anything through trial and testing, for the most part. Which would be the real joy of learning?  Like this, it's following a textbook in videogame form. You're still just going through the required motions without ever being surprised. They don't give you a fairly obscure objective that requires you to explore the mechanics until you figure out a possible path to the solution. Instead, you're just kind of memorizing what you need to do, and then you're done. Which is unfortunate, but not unexpected...  Not my kind of 'educational' game, but it may help with middle/high school tests, I guess.",
            "review_score": "1"
        },
        {
            "review_text": "I went in expecting something akin to the 3DS title Flower Town, but without that irritating 'waiting for other people to progress' aspect. Unfortunately, it's not that, it's actually a game which was clearly developed for use in classrooms/aimed at youngsters. It's got a fun sense of humor, and none of the above makes it bad by any means, but it's not particularly deep and it's easy to blow through if you know how a punnett square works.",
            "review_score": "1"
        },
        {
            "review_text": "This Whole Game Finishes in 13days! - Win or Lose! (GAME OVER MAN!) Firstly Stuff You Can Do Each Day:  1. Use Plant Breeder to get more Plants for Free (Limited Charges). 2. Buy New Plants before you end the day to prepare for the next day. 3. Upgrade Your Shop once you manage to save up enough $. 4. Reject Customers if they request something your not selling. - Other than the Plant Competition the 4 features above are what you will be doing through out each day.  *Note: There is only One Game Mode which is the new game mode, play 13days and unlock all the plants in your catalog or lose the game, that's it. There is no time limit but feels more like usage or turn limit as using the Plant Breeder is No.1 Priority and has limited charges.*  It feels like a very well put together flash game and as for the educational side to it, I can honestly say that I didn't learn anything useful nor will I ever it anything I experience from this game in real life.  ------------------------------------------  Stuff that I feel can improve this game! 1. Change some game mechanics around to add Endless Mode. 2. Put more meaningful upgrades, almost half of the upgrades doesn't do anything to give you a game adventage. 3. Do Something To MAKE NEW GAME+! 4. Have some kind of Storyline in the game please!  If they devs manages to add either 1. or 3. than I will test the game again and write a new review.  FOR NOW I CANNOT RECOMMEND THIS GAME! Reasons - It felt like, imagine your in an Arcade and saw that the game you wanted to play has a very long queue for it so you decided to use your tokens to play this game instead. That's how I felt about this game but even after I won on my first playthrough and I didn't have any reason to open the game again so that means game deleted*.  The art style is Super Cute though but sadly the game features and zero storyline are very disapointing.",
            "review_score": "-1"
        },
        {
            "review_text": "Have you ever wondered why two blue-eyed parents cannot have a brown-eyed child, but two brown-eyed parents CAN have blue-eyed children? After playing this game, you will totally understand dominant and recessive genes (quite a mouthful, isn't it?) I found this game very entertaining - just hard enough to be challenging, but not so hard that I would give up in frustration. My only complaints would be that you cannot save one game and then start another, and every time you start a game you have to go through the introduction again. I hope they will come out with a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Cute little game, great for kids/students wanting a fun way to learn about basic plant genetics.",
            "review_score": "1"
        },
        {
            "review_text": "Starts slow and seems a bit confusing but after that it's over in 1-2 hours! Really cute short game!",
            "review_score": "1"
        },
        {
            "review_text": "It was a laugh...ish... ok it was terrible. I got it as a I'm bored I should download and play a random crappy game. Problem was it was really crappy. It takes about an hour and a half to dinish and if you can understand basic math you instantly know the most efficiant way to do EVERYTHING in the game. All in all there are plenty of crappy came that'll give you a laugh on steam, this is not one of them.",
            "review_score": "-1"
        },
        {
            "review_text": "The lack of fullscreen will put you off, but keep in mind - this is an educative game. If you want to know how to breed plants - you might want to look at this. If you already know about plant genes and traits - you might like this as well.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game! Makes you think and helps you understand punnett squares better! This game makes you think and strategize a lot more than I expected.",
            "review_score": "1"
        },
        {
            "review_text": "Crazy Plant Shop is a fun little game mixing genetics and running a shop. It doesn't dumb down its topic and within the first few minutes I saw enough scientific terms to scratch my brain trying to remember old biology lessons. Thankfully, there is sufficient in-game explanation to help you out. A single run takes about 2 hours and I found that exactly the right length for what the game has to offer. It's enough to figure out how to make the most of dominant-recessive genes and keeping an efficient plant stock, but without feeling like you're repeating yourself. You can do another 1 or 2 runs after that, e.g. for some achievements or secondary goals that you may have missed, but that is pretty much it.  The price of the game reflects this duration, so I wholeheartedly recommend it to anyone who wants to run a shop with cute-looking plants and simultaneously conducting genetic science.",
            "review_score": "1"
        },
        {
            "review_text": "This is cute and simple, a good introduction to genetics for kids. If your kids are under 12 or so it might be too much for them to handle alone and will need your assistence.",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty fun little game and I think it's worth it even at $5. Once you understand how to make the genetics work in your favor, it's rather easy to do. The only thing left to do than is to hunt for achievements. The hardest one will probably be to win the World Fair. My biggest dissapointment with the game is that I can't experiment more, Would have liked to see a bit of crossbreeding, but it's not possible. Other than that, was quite happy with my purchase.  Spoiler:     To be able to make all the possible plant variations, both seed plants should have both the dominant and recessive trait in each category, alternatively, it's ok for one of the two to have the recessive trait twice. With those combos, it's always worked for me. Sometimes, other combos will work, but seemingly without rime or reason.   ",
            "review_score": "1"
        },
        {
            "review_text": "It's not the funnest game I've ever played, but it has its charms. I like learning from a game, and I think anyone could learn a bit about genetics from this.",
            "review_score": "1"
        },
        {
            "review_text": "Got this in a Humble Bundle and figured I'd try it. The target audience is obviously people still in primary school - the game itself is trivial to break (get two identical plants of each type that have both the dominant and recessive gene for every trait and you can breed any combination) and it's nigh on impossible to actually lose (there's no time limit). While more plants are added as you progress, the mechanics remain unchanged throughout the game; it's the exact same game but with some different images for the later stages. I can't even really recommend it to teach simplified genetics because the game does a poor job of explaining how to breed plants.",
            "review_score": "-1"
        },
        {
            "review_text": "Simple Mendel genetic. Quite simple actually, but there's always someone that just doesn't get it. The challenges are fun and it keeps you on your toes for those recessive genes.",
            "review_score": "1"
        },
        {
            "review_text": "Charming puzzle game about running a plant shop.",
            "review_score": "1"
        }
    ]
}