{
    "app_id": 292240,
    "name": "Spy Fox 2 \"Some Assembly Required\"",
    "release_date": "2014-05-01",
    "developer": [
        "Humongous Entertainment"
    ],
    "publisher": [
        "Humongous Entertainment",
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 87,
    "negative_ratings": 5,
    "price": 4.99,
    "description": "Once again, the world relies on Fox - Spy Fox, the suave secret agent who smoothly finesses his way through Spy Corps' toughest assignments. This time, Spy Corps' corrupt counterpart, the Society for Meaningless Evil, Larceny, Lying and Yelling (S.M.E.L.L.Y.) has devised a dogbot which will be unleashed upon the unsuspecting world!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/292240/header.jpg?t=1553804546",
    "minimum_requirements": "OS: Windows 7 / 8.1 / 10 Processor: 1.0 GHz Processor Memory: 512 MB RAM Graphics: 100% DirectX compatible graphics Storage: 512 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "recommended_requirements": "OS: Windows 10 Processor: 1.5 GHz Processor Memory: 512 MB RAM Graphics: 100% DirectX compatible graphics Storage: 512 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "I really do love the Spy Fox games, even now. This was the first one I ever had, and in my opinion, it has aged gracefully. I definitely appreciate it a lot more now than I did then, because I've seen James Bond movies now :P   I wouldn't recommend it to older people who had never played it before, but if you're wondering whether or not the nostalgia is worth it--or if you're considering it for your kids-- it's a must.",
            "review_score": "1"
        },
        {
            "review_text": "This is the one Spy Fox game I didn't own right off the bat. I owned 1 &amp;3. This one requires a bit more thinking in my opinion and is a bit more strategic, but either way the game still is really good and entertaining to play for the first time or for nostalgic reasons.",
            "review_score": "1"
        },
        {
            "review_text": "Best childhood gam ever!!!!! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Great game from great company. Good job HE.",
            "review_score": "1"
        },
        {
            "review_text": "I had this game on CD when I was a kid. I then probably gave the disc to a thrift store laterer in life, but somehow I still have the case. I remember even playing the game demo of this one too. I still have to say it builds upon the first game by introducing harder puzzles and more polished voice acting, and a better story. So I would recommend this game to anyone who loves point and click games",
            "review_score": "1"
        }
    ]
}