{
    "app_id": 292370,
    "name": "DarkEnd",
    "release_date": "2014-10-17",
    "developer": [
        "Kodots Games"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPGMaker",
        "RPG",
        "Indie"
    ],
    "achievements": 26,
    "positive_ratings": 155,
    "negative_ratings": 132,
    "price": 1.69,
    "description": "Conquer the ever changing dungeons of DarkEnd and save the fall of humanity! Choose your heroes and venture into a world filled with numerous treasures, mysterious secrets and discover a haunting past in this 10+ hours of retro 2D Dungeon-Crawling!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/292370/header.jpg?t=1495641867",
    "minimum_requirements": "Minimale : Système d'exploitation : Windows XP/Vista/7 Processeur : Intel® Pentium® 4 2.0 GHz equivalent or faster processor Mémoire vive : 512 MB de mémoire Graphiques : Intel GMA series or better Espace disque : 400 MB d'espace disque disponible Carte son : DirectSound-compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "For about 4 dollars I'd say it was worth it, there was times when it was a challenge (in a good way) and times when it was just 'I'm bored, I should play pokemon this is so bad'. The side quests were hard to do due to the low drop chances (or my horrible luck) and the random generating was so random i found the fairy 10 times and the cave once before giving up.  I'll give the story a 6 out of ten, but i played as griselda and was confused until I hit the end of the dark dimension. I like some curious plot twists but I got a little lost there. In the description even it said something about a love story. I didn't see it at all besides the weird flash backs about someone who wasn't even my MC.  For 4 bucks if your bored enough to waste 7 some odd hours like I did, I recommend it (Kinda). But for something to play over again to see it through the other characters stories? Nope.",
            "review_score": "-1"
        },
        {
            "review_text": "  The game is ok, it's got a nice story line as far as I can tell and I like how the text seem to be specific for each character (like I was treated like a girl and even sometimes people tended to believe I was not so dangerous, in other moments people would sense my dark powers and be apreensive of that, which I guess would be diferent if I chose the knight). Only problem is it crashed twice in 100 minutes of gameplay (that's more than once every hour) and that is really annoying. Also didn't seem to be something related to some item or action, just random crashes.If the crash was fixed I could probably call it a great game (unless something else happens) but as it is it's an ok game. ",
            "review_score": "1"
        },
        {
            "review_text": "  RPG Maker games tend to suck. This is not expection from this rule.  Didn't play much, but those are my results/facts: * running in 640x480 resolution window (or go fullscreen and enjoy blur) * seems generic as it can be + not bad music * tons of texts to skip... [noticeable typos] + story is a bit different comparing to other RPG Maker games",
            "review_score": "-1"
        },
        {
            "review_text": "  DarkEnd is among the very best RPG Maker games that I have played, simple and good game.",
            "review_score": "1"
        },
        {
            "review_text": "  Man.. how can i put this..  This game, CHANGED MY LIFE!   I mean.. I cant describe the feelings I had.. I felt like a bipolar that injected shrooms in his eyes. IT WAS AMAZING!  ... then I right clicked it and delete local content...   i miss the yellowish shroom haze",
            "review_score": "1"
        },
        {
            "review_text": "DarkEnd is a game that I recommend because: - it is a method to banish boredom - it has an acceptable price - it is indie - it is RPG - it has trading cards  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game on/off for a few weeks, I gotta say, forget it. Play something else.   The Good: The character selection and choices for upgrading is a nice touch. The world seems well thought out.  The Bad: Errors in skill descriptions, way too much RNG. When a skill says it removes EVERY status aliment, that better mean every single aliment in the game. Afraid it doesn't remove blind, which made one boss a nightmare.  The Ugly: The RNG. The desciprtion says this game is about strategy, but its really more about pray to the RNG goddess and hope. You only have a party of 2, so it only takes one unlucky turn to get a TPK in most battles (especially dungeons 6 and 7). Afraid this developer needs to research the old dungeon crawlers more and what people liked about them, as I can tell it was NOT the RNG that people liked (trust me, no one finds it fun to have your entire party paralyzed or frozen and then unable to move). Look at Eterian Odyessy and see how they did it, and take ideas from that. As it is, this game missed the mark horribly, and instead we got a game that is heavily dependent on the RNG and horribly unbalanced at that.",
            "review_score": "-1"
        }
    ]
}