{
    "app_id": 292480,
    "name": "Magical Battle Festa",
    "release_date": "2014-11-21",
    "developer": [
        "Fly System"
    ],
    "publisher": [
        "AGM PLAYISM"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Anime",
        "Action",
        "Indie"
    ],
    "achievements": 56,
    "positive_ratings": 217,
    "negative_ratings": 107,
    "price": 6.99,
    "description": "TEOS, an agency of holy mages, holds a tournament to find the best magic users in the world to take on a dark threat looming on the horizon. Choose your mage and take to the arena in this fast-paced competitive fighting game that mixes troop formations and fast action.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/292480/header.jpg?t=1554709261",
    "minimum_requirements": "OS: Windows XP/Vista/7/8 Processor: Core 2 Duo or faster Memory: 1 GB RAM Graphics: GeForce 8800 or better (or comparable AMD card)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's a fun 3D battle game with lots of energy attacks.  Gameplay: That said, I might not play many battle games so I don't know if this is normal, but I find it a bit difficult to break out of an opponent's combo. I mean, all defensive measures (dodge/shield) seem to fail if you don't guard before the first hit lands and your opponent starts an X-X-X-X punch combo. It'd be great if you can break free somehow, otherwise it seems stupid absorbing damage for if you don't guard in time. I wonder if you can interrupt the combo chain if you overdrive.  You wouldn't think it, but your companion bots are a lot more important than you would expect. You need them to execute your best moves, run interference, and boost your stats depending on the formation. If used well, it can make a difficult opponent easy. And if ignored, even an easy opponent can become a pain in the butt.  Story mode is very easy. The CPU tends to crumble very easily if you perform an all out attack. And you don't need to worry about ultimate attacks. But don't let the ease of your completion fool you. Wait till you unlock and try out Magical Battle Festa mode. That's when the gloves come off and the CPU becomes serious.   Controls: Let's see, what else. I play with a Xbox360 gamepad and I've found that the default controls work well enough once I get used to them. I've heard that keyboard players have a bit of trouble working with the camera, of which careful handling is needed. More on that later.  Sound: It's partially voiced. During story mode, when the characters are performing the prebattle and postbattle conversations, the conversations are punctuated by bits of Japanese here and there. It's sort of like emoticons. It's cute I suppose, but it's also strange when you see multiple lines of text and you only hear like 5 words of Japanese.  Camera: Because this game is battle royale capable, you might find the camera a bit awkward. Unlike Virtua Fighter or other 3D fighting games your character and follow-cam do not automatically follow your opponent. The reason is because there can be up to 3 other opponents. You can't just jump the camera back and forth automatically. It's not a movie, it's a fighting game. Without the automatic tracking, you're left with manual handling.  And when you play you'll soon find that part of your success in battle is keeping that camera focused on the action. If you're not diligent, you can soon lose track of the battle and find yourself blindsided.  That said, my pet peeve is that there is a button that allows you to lock the camera onto an opponent. The button itself is fine, the problem is that it doesn't force your character to automatically face that opponent when you've locked on, you have to handle the direction your character is facing yourself. So I have to spend a frame or two to run toward an opponent in order to face him before unleashing a long range attack. Otherwise, I'll find the attack shooting off in the other direction because my character happens to be looking the other way.  Story: The story is really short. It covers a few days of a yearly tournament where the characters each have their motives. Most of them have pure motives...some do not. Saying anymore would probably spoil it. I kind of like how the story mode is arranged. Basically, the match results are predetermined. Because of this, the matches that you find yourself playing will be as the character that is supposed to win. So it's best not to lose, okay?  Multiplayer: Right now MP rooms are hard to find. I guess everyone with the game is trying to unlock all of the characters first. That said, it was a joy to discover that it's not local multiplayer but internet multiplayer.   So let me share my observations. I'm in the US and I found an opponent playing in Japan. It's a situation where two players are playing each other from across the world, a 12 hour difference seperating them. We found that when we were the host, there were no response issues. However, the situation is different for those players who weren't the host. They would experience latency issues. When he hosted, I've found that it could take a second for a button press to register. While this delay won't mess with your ability to execute a combo since that's just button mashing, it will interfere with your camera control, movement, and timing-related actions like perfect blocks. I need to test against someone closer to see if the delay is smaller.  Overall: A few minor annoyances here and there, but overall the game is rather fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "I think this game is pretty good. The controls are simple and east to learn, the characters are easy to learn as well. The story is silly and anime as hell. My only gripes are the default controls are kinda bad and the keyboard controls are unplayable(thankfully I own a game pad) No mouse support though. If you have a game pad and 4 friends to play with I recommend it  EDIT: a point brought up by Soluna is being added. I should note this game is niche so it does not have a big user base at the moment(though a summer sale could change it) If you want it mainly for online play you may wanna hold off or think about it. If you got some friends(4 or so) interested in the game I'd say buy it. Also good if you are into these kinda DBZ sorty arena fighting games.",
            "review_score": "1"
        },
        {
            "review_text": "to many controls and not enough fingers, i only seem to do regular attack and special attack and guard. so its abit harder",
            "review_score": "1"
        },
        {
            "review_text": "Very annoying game. First of all, mashing the attack button wins the whole thing, and the camera is just atrocious. it always tries to move back to the way you're facing, instead of just letting you aim your attacks.   This is just a horror to control, and the shallow combat doesn't make for anything better.  I can't recommend this game to anyone. I just simply won't do it. I WON'T DO IT, UNDERSTAND ME?!",
            "review_score": "-1"
        },
        {
            "review_text": "The game is dripping in that crazy Japanese stuff that some people eat up like candy, but for somebody looking for a solid gaming experience, this is just far too shallow. I've consistently won matches without taking a single hit simply by executing the exact same easy combo over and over.   Not to mention I grew utterly sick from hearing 'Mahou shojou, Hoshisaki Ion' every 2 minutes. Go to main menu, hear it. Start a battle, hear it. Conversation segment, hear it. It gets old fast.   Even if you are one of those anime fans that likes girls shooting lasers and swinging large weapons, $17.99 is a criminal asking price for what you get here. I got it in a bundle for about $4.00 along with other (much better) games. It is highly recommended that you wait for such an opportunity.   ",
            "review_score": "-1"
        },
        {
            "review_text": "If the camera was decent, this would be a fun game. Unfortunately, at least for me, it is not. Oh and you are look for T&amp;A (softcore porn), look elsewhere (Sakura Dungeon has that with the patch from the devs website). Otherwise, meh.",
            "review_score": "-1"
        },
        {
            "review_text": "Buyer be warned, this game doesn't seem to work some AMD graphic cards and there is no tehcnical support.",
            "review_score": "-1"
        },
        {
            "review_text": "Great Story 8/10 Mahou Shoujo 10/10 Cyborg Loli 10/10 Pantsu 11/10  no problem without controller, I use keyboard and I'm doing fine",
            "review_score": "1"
        },
        {
            "review_text": "10/10 pantsu everytime you win with ion yatta ne~",
            "review_score": "1"
        },
        {
            "review_text": "Nice game for slashing and wasting time",
            "review_score": "1"
        },
        {
            "review_text": "The game was quite unfair to start with and the tutorial is very unclear on the buttons so I couldn't figure out what ls_push was and I had been pressing every button.",
            "review_score": "-1"
        },
        {
            "review_text": "I ABSOLUTELY RECCOMEND THIS GAME, IT IS FUN AS HELL, BUT DON'T EVER DECIDE TO PLAY WITH 4 CPUS!!!!!! IT IS MORE THAN HELL, IT'S MORE RATHERSOME CHAOS, SORRY FOR CAPS!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I don't know, but the first screen loading seems take too long. And the combination attacks are poor. Ofc, the trailer is a big lie.",
            "review_score": "-1"
        },
        {
            "review_text": "AKA underage panty quest: waifus with weapons edition. AKA gabe newell's true vision for steam  questionable/10; buy for all your friends",
            "review_score": "-1"
        },
        {
            "review_text": "  idk when i got this game in my library or how it got there but what i do know is that its some weeaboo trash listen to the audio on the trailer! actually look at it too! how much english do you see in that? actually look at the title of this game instead!  ARE YOU REALLY GOING TO BUY THIS GAME ARE YOU  also it controls like hot trash and the options menu is classic japanese port meta, where the options are on a completely diffrent EXE file and the tutorial is in a PDF File WHAT IS THIS GARBAGE please dont play this my friend forced me to write this",
            "review_score": "-1"
        },
        {
            "review_text": "Sometimes the the combo make me confuse, but that coverd by the unique story and colorfull gameplay give different taste of the game. Nice Job",
            "review_score": "1"
        }
    ]
}