{
    "app_id": 292410,
    "name": "Street Racing Syndicate",
    "release_date": "2014-04-24",
    "developer": [
        "Eutechnyx"
    ],
    "publisher": [
        "Funbox Media Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Racing",
        "Open World",
        "Driving"
    ],
    "achievements": 0,
    "positive_ratings": 1886,
    "negative_ratings": 420,
    "price": 2.09,
    "description": "The raw, high-stakes world of illegal street racing comes to life in Street Racing Syndicate. Trick out over 40 authentic licensed cars with parts from over 15 real-world manufacturers, then turn your customized ride loose on the streets of 3 cities across the USA.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/292410/header.jpg?t=1530529947",
    "minimum_requirements": "OS: Windows 7/8 Processor: 1 GHz Processor Graphics: 32 MB DirectX 9.0b compatible video card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Need For Speed Underground 2 Girlfriends Edition",
            "review_score": "1"
        },
        {
            "review_text": "10 year old game and still better than Need for speed 2015",
            "review_score": "1"
        },
        {
            "review_text": "Good memories on the Play station 2 :) very good game for moding cars and for racing.",
            "review_score": "1"
        },
        {
            "review_text": "  This game is pretty good for a game made in 2005. I am glad I went and got myself a free steam key off of facebook.",
            "review_score": "1"
        },
        {
            "review_text": "Another Memories Game i used to play a lot on my Console since i was in Elementery School known as  Street Racing Syndicate!!. This game is really amazing and Good Street Racing game.Its same as Need for Speed Underground 2 with the Free Roam,Map icons and options and stuff,and same as Midnight Club for the Customizations and the Car Styles. This game also Include Great Soundtracks while Racing againts the Opponents and you also can Make Wager deals too with your Opponents which technically i prefer doing that on Racers with the Slowest Cars. This game also Includes Sexy Girls you can meet and Impress in some Respect Races to get a Free Sexy Videos of them Dancing and shaking their Booties/Bodies in front of your Two Eyes!.(Hope you dont get a Boner from that). So anyway This Old Racing Game deserves a lot of Rating from me because its Really Great,I just bought it on a Hugh Sale they made on Steam and yeah i totally took the risks of buying that again. This game is Amazing and fun if you like Street Racing games and Sexy Hot Ladies.  Rating:10/10",
            "review_score": "1"
        },
        {
            "review_text": "KEEP IN MIND THAT THIS IS A 2005 GAME!!!!! It is definitely worth $1.49. It has a decent amount of cars and customization ",
            "review_score": "1"
        },
        {
            "review_text": "Such a great classic.",
            "review_score": "1"
        },
        {
            "review_text": "Old school racing remind me of NFS Underground 2 which is a legend.  Supra, Impreza, Lan Evo, etc.. 10/10 for cars.",
            "review_score": "1"
        },
        {
            "review_text": "Oh boy, this game brings so many memories. I remember when I got it in circa 2008 on a DVD with a computer magazine I used to love. I read the little 'review' in the magazine and jumped on the game. Since I was a little girl still I was blown away by the game, honestly. All these shiny cars, so many posibilities how to tune up your car, I could even 'own' girls. It was simply awesome for me. I could say that I played some solid 100 hours on it. I wanted 100% progress no matter what. And here I am after 7 years. I got it with a bundle for 0,99$. Bargain for a game I used to love so much.  You know how sometimes people tell you to not expect much from things you used to love so much and you come back to them? Yeah, there is a good reason for that. When I first started the game after so long I already noticed that this game is pretty cringy. The music is simply horrible, let's be honest. I had to turn it off after some while and just play my own music over it. Only listenable track is 'Madhouse'. I mean, yeah I get it there wasn't much cash left for a decent music, but gosh, you could slap some better music over it that wasn't that bad. Nevermind! Also the gameplay is pretty easy. It isn't really hard to get on the top with a car you got as a starter. I am not trying to say you will finish the whole game with just Subaru Impreza but yeah, you will surive with that car untill you save for that Nissan Skyline loved by everyone (This game made me fall in love with that car even tho I know batshit about cars...).  Anyways, the graphics are acceptable. Always could be better tho. I don't like comparing two completely different games but look at Half life 2 and graphics of this game! Nevermind, let's keep on rolling.  Overall this game is still playable and I must admit I do enjoy it even after all these years but it isn't what it used to be.  Even after this all it will still stay in my heart &lt;3  A review brought to you by Elle who doesn't even know how to 'review' games. You're welcome!  ",
            "review_score": "1"
        },
        {
            "review_text": "I like this game,reason: -It reminds me of Need For Speed Underground 1 customization and cars -It have police chases like in Need For Speed Most Wanted 2005 and etc. -Nice soundtrack -Beautiful girls (No pervert) -Open World Only the thing i dont like it is the damage,if you have to much damage on your car it will drive more slowly and the storyline that is not really like a story. But you should give this game a chance. Buy it when the price is cheaper. Final note:7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Oh yeah I almost forgott, that you could pull ladies onto your riced out car..... back in the late 90s and early 00s ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "OMFG , i love the girls on dis game so much...........        i mean i love the cars on dis game ",
            "review_score": "1"
        },
        {
            "review_text": "If you like street racing you will like this game. It takes me back to childhood. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Why is this game worth buying ? You can sit behind the wheel of GOLF IV",
            "review_score": "1"
        },
        {
            "review_text": "Let's start by saying that this game is well past its prime, so no, graphics are not the best, V/O is kinda bad, and physics weren't the best.  That aside lets get to the good part!  Pros: -Damage determines how well your car does -Some good graphics for its age -Nice selection of cars though limited -Videos of your grilfriends dancing loosing more and more clothing as you keep winning -Cops randomly appear when leaving races  Cons: -Limited selection of cars -Physics aren't the best -Videos of girlfriends are pixelated (same for console versions) -Cops randomly appear when leaving races (sucks when it was a sanctioned race) -Game is too short  Just remember that this game IS older, so if you don't go in expecting too much from it, it can actually be fun.",
            "review_score": "1"
        },
        {
            "review_text": "A Really nice game that you can play alone or with friends",
            "review_score": "1"
        },
        {
            "review_text": "When I was like 5-7 I LOVED playing Need For Speed: Underground 2 on the PS2. This game gives me a vibe from that game, they're alike in many ways. With a full city to travel and many missions and activities to do around the city gives lots of play time. The graphics are as expected for a 2004 game. The gameplay is recommended by me for anyone who likes racing games, especially Need For Speed games.",
            "review_score": "1"
        },
        {
            "review_text": "   Some words first :  This was the game of my childhood and the first video game I have ever played so this is from where I've started gaming.   Worths the price?",
            "review_score": "1"
        },
        {
            "review_text": "That reminds me my Ps2 :) old, but good.",
            "review_score": "1"
        },
        {
            "review_text": "Need For Speed underground inspired game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good street racing game . If you want stuff with local multi-player action, get it . You can go split screen or LAN . The presets for an Xbox 360 controller are a bit goofy, but you can change those . (You'll have to use controller 1 to set up controller 2 in that goofy menu) . Take some personal time with this game to tweek out the goofyness before you bring your laptop over to your buddy's place . I noticed that on the split screen, you can only hear the enjine and tires of car #1, unless car #2 is rather close . Both cars also have to finish a split screen race to end the program . But on the over all, I am Rockin' Hip Hop happy with the action of this game . (Or is it I 'be' Rockin' Hip Hop happy ?) .",
            "review_score": "1"
        },
        {
            "review_text": "  I thought this game was 'Syndicate' but with Street Racing. I was wrong.",
            "review_score": "1"
        },
        {
            "review_text": "+",
            "review_score": "1"
        },
        {
            "review_text": "It load's up the game but as soon as you see the credit's pop-up it start's to lag hardcore while it's trying to load up the rest of the game for me, it only does this when i have my xbox 360 controller plugged into computer tho if controller isn't plugged into computer then it load's up properly for me tho. Can anybody help me fix this problem please?",
            "review_score": "-1"
        },
        {
            "review_text": "You would be much better off with the Gameboy Advanced version of this game than the PC version. This game lacks so much and does so little, The only real plus is the freeroam when not in a race, get it if you like to collect racing games. if you want this game directly get it for Gameboy Advanced.   2/5  /CaptainB_Money",
            "review_score": "-1"
        },
        {
            "review_text": "AWSOME GAME :) IT LOOKS LIKE NEED FOR SPEED :)",
            "review_score": "1"
        },
        {
            "review_text": "Bad game! If you have no money in game you can not do anything! You can not race or repair your car. The only thing to do is to restart the entire game!",
            "review_score": "-1"
        },
        {
            "review_text": "The cars are anime, yet the 'girlfriends' aren't. They had one job.",
            "review_score": "-1"
        },
        {
            "review_text": "Bored with wasting my time in the Need for Speed series, I was looking for another NFS-Esque game. I saw this game for a few cents, so I decided to get it.  Negatives: - Boring driving physics - Bad controls - A horrible menu (Tuning vehicles is a chore) - Open world is small, and doesn't stand out - Color selection for cars and vinyls is lacking - Bad story  Positives: - When ignoring the horrible menus, the modification is pretty solid. - Graphics look pretty good (especially at night) - It made me wanna play NFS Underground again.  Can I recommend this game? No, unless you get it for really cheap. I got it for about 60 cents, but considering that the default price (as of now) is 10€, I just cannot recommend it.    I also noticed that my review is vastly different from everyone else's, so if someone can please explain to me why this game deserves so many good ratings, please do so in the comments. Because I really wanna like this game.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Get the nfs collectors series, it costs more than this but atleast you know you'll get your moneys worth. SRS-ly avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a good game. I wish I had spent my $2.49 of something else, like a taco or something!",
            "review_score": "-1"
        },
        {
            "review_text": "no thanks",
            "review_score": "-1"
        },
        {
            "review_text": "The game is hideously creepy.. you have to drive like a moron to impress the girls that hang around alone on car parks in the dark. If you do, they will become your possessions to keep forever.. your 'girlfriends'. Keep the girls in your girlfriend inventory (think of it as your own creepy dungeon) and you can go and visit them for a lap dance (in videos performed by real 'actresses') at any time!  Just incase you forget, there are scantily clad girls draped across just about every menu screen to remind you that this game was designed by idiots.  Quite fun racing, but the theme and creepiness of it all drag it right down.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty decent game, if you want a cheap racing game with no story, then this is the game for you, I sometimes get bored of the game due to having no story whatsoever, the first 10 miniutes of the game has this cutscene where you must race for something something important, then you're left on your own. The 'girlfriends' in this game are hot, but make me cringe the way they talk, in fact, all the characters in this game talk in a cheesy manner, making me cringe. There are bugs in this game that I found quite crappy, at one point in the game, every time you leave the garage, the game immedietly crashes. The game does save, but this happens very frequently, which pisses me off. The driver's in this game are complete ♥♥♥♥♥♥♥s, crashing you and making yo get that feeling that you want to tear their ♥♥♥♥ing car apart. The point is, this game is basic, dull, and only entertaining the way you play it, I'm quite impressed that this game wasn't that bad, due to the publisher being the ones who made Ride To Hell Retrobution, which is quite the ♥♥♥♥♥♥ game of steam. This game was a classic to the Gamecube to me, so if you played it before, it's a good game to play on the PC. But if this is your first time buying it, this game came out 2005 and your going to be running into some bugs. Anyways, it's an okay game.",
            "review_score": "1"
        },
        {
            "review_text": "I picked this game in a racing bundle , without knowing what it was , and i installed it guessing it was just another need for speed underground clone ... How wrong was i ...  This game is not a simulation and does not support wheel control *sigh* , but the handling feels just perfect with the keyboard , the graphics are pretty beautiful even given that the game is 10 year old ...   But the principal greatness to this game is the amount of modifications you can do on your car , it's just awesome ! You can turn your old crappy car into the ultimate drift weapon and tweak the cars setting to adjust it to your driving ... I've never saw an equal level of customisation in an old car game since Street Legal Racing Redline.  Whenever i launch this game , i got hooked into the amazing open world city that's given to us , sometimes doing illegal street races , sometimes trying to escape the cops (gotta go fast) , and sometimes reparing the car after some violents encouters with walls ... and i realize that 3 hours are already gone.  (I didn't talk about the girls , i'll let you discover that other good point ofthe game by yourself :p )  The only thing i regret is that it cannot be run in 1080p , max resolution is 1600x1200 :(  (Hey steam , i'm looking at you , patch the game already !)  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "8/10-great game, great cars, great mods cons-graphics and resolution only goes up to 1280x768  should be called ricer simulator xD",
            "review_score": "1"
        },
        {
            "review_text": "glad i bought it",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the dopest games I've ever played and most certainly going to be one of my favorite games. Even though the graphics may not be the best but you know I'm not conplaining. You could also hear the turbo's spool and blow off valves, which was one of my favorite things in the game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun arcade car game. If you liked need for speed underground you will like this one too. You can tune your cars performance with turbos, nitrous, exhaust systems, fly wheels, better ignition, weight reduction kits etc. Also you can tune your car's visual side too. It's worth the sale price of 0,99e for sure.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like ♥♥♥♥♥ier, more arcade, worse graphic mod of Need for Speed Underground 2. I don´t say it´s bad game though! You can really 'turn off' when playing. Also, I like the music.... So, if you are unassuming player, this is not bad choice.",
            "review_score": "1"
        },
        {
            "review_text": "This game is as awesome as it was in 2005",
            "review_score": "1"
        },
        {
            "review_text": "If you want a nostalgic racing game with visual modifications, try this one.",
            "review_score": "1"
        },
        {
            "review_text": "So skuxx. Makes me wanna buy some etnies, drop out of school and live on the pension.",
            "review_score": "1"
        },
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "Pretty decent game, if you want a cheap racing game with no story, then this is the game for you, I sometimes get bored of the game due to having no story whatsoever, the first 10 miniutes of the game has this cutscene where you must race for something something important, then you're left on your own. The 'girlfriends' in this game are hot, but make me cringe the way they talk, in fact, all the characters in this game talk in a cheesy manner, making me cringe. There are bugs in this game that I found quite crappy, at one point in the game, every time you leave the garage, the game immedietly crashes. The game does save, but this happens very frequently, which pisses me off. The driver's in this game are complete ♥♥♥♥♥♥♥s, crashing you and making yo get that feeling that you want to tear their ♥♥♥♥ing car apart. The point is, this game is basic, dull, and only entertaining the way you play it, I'm quite impressed that this game wasn't that bad, due to the publisher being the ones who made Ride To Hell Retrobution, which is quite the ♥♥♥♥♥♥ game of steam. This game was a classic to the Gamecube to me, so if you played it before, it's a good game to play on the PC. But if this is your first time buying it, this game came out 2005 and your going to be running into some bugs. Anyways, it's an okay game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a really fun game for racers and nfs people I bought it for 99 cents so a great deal for a 2005 game it's not to bad but by no means is it perfect.",
            "review_score": "1"
        },
        {
            "review_text": "So skuxx. Makes me wanna buy some etnies, drop out of school and live on the pension.",
            "review_score": "1"
        },
        {
            "review_text": "Recommended : PEGI 18+ MATURE",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would Recommend This Game. Because It have PAC-MAN song before starting the game.",
            "review_score": "1"
        },
        {
            "review_text": "NFS Underground's hornier brother.",
            "review_score": "1"
        },
        {
            "review_text": "I am not much of a racing player, but this game has great mechanics that makes me want to race some more. 9/10 hot chick doe.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, 10/10 buy it. Legendary game.",
            "review_score": "1"
        },
        {
            "review_text": "Its a good game to pass the time.",
            "review_score": "1"
        },
        {
            "review_text": "Able to put anime girls on my car. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Pros -OpenWorld (Smaller than nfsu2 but okay) -Car customizations -Plenty of girlfriend you can choose -Acceptable graphics for an old game  Cons -Car physics  -Every cars only have 1 bodykit option to install -Police car can spawn ahead of you",
            "review_score": "1"
        }
    ]
}