{
    "app_id": 292600,
    "name": "Duet",
    "release_date": "2015-08-03",
    "developer": [
        "Kumobius"
    ],
    "publisher": [
        "Kumobius"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Minimalist"
    ],
    "achievements": 63,
    "positive_ratings": 610,
    "negative_ratings": 38,
    "price": 3.99,
    "description": "Elegant and minimal, Duet asks players simply to navigate two orbiting spheres past an increasingly complex maze of falling obstacles. As the difficulty increases, the tension mounts, and a peculiar narrative unfolds.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/292600/header.jpg?t=1478033981",
    "minimum_requirements": "Minimale : Système d'exploitation : Windows Vista or Newer Processeur : Core 2 Duo Mémoire vive : 1 GB de mémoire Graphiques : Integrated Espace disque : 150 MB d'espace disque disponible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  What about to say!?... Its a simple game but amazing (addiction alert ;-) Its RETRO but no graphic junk Its funny but not boring Its not expensive for the stuff (looks exclusive) The Soundtrack Music is exquisite and fit the game perfect The Woman Voice tell you philosophical principles, but she sounds not human :-)  Great Game to relax after a consumptive hardcore game session!  Slave to the Rythm!",
            "review_score": "1"
        },
        {
            "review_text": " Introduction",
            "review_score": "1"
        },
        {
            "review_text": "this game made me very nauseous   it's still pretty good but i can't really recommend because of this",
            "review_score": "-1"
        },
        {
            "review_text": "Great game! The menus are a little slow to navigate compared to the phone version, but thats not that big of a deal.",
            "review_score": "1"
        },
        {
            "review_text": "Therapeutic, hypnotic, and for some reason never frustrating despite being more trial &amp; error than OlliOlli. A great reflex game à la Super Hexagon but with more heart.",
            "review_score": "1"
        },
        {
            "review_text": "The game has a pleasant and unobtrusive, minimalist graphics quiet background music. Even after numerous losses and attempts you will have no desire to remove it.",
            "review_score": "1"
        },
        {
            "review_text": "My approach to this game is a little different. I think it is a piece of art. When you play in story mode, the levels are grouped in categories; categories with topics such as denial, depression, guilt, anger etc. In the beginning of each level, there is a little phrase about the topic of the category. Every level, I thought about the levels phrase while playing. I know this will sound pathetic but it makes me think about aspects of life, as if it was a piece of art trying to tell me something. It feels like the phrases comes from a person in the game, who I am together with and converse with. Those half- philosophical conversations (which I’m making up while playing) makes me feel like I’m building up a kind of a relationship with the person – just as I would with anyone who I had such personal conversations with. After completing story mode and I began playing challenges, I actually began to think that the game became a little lonely to play without those phrases. Then I found out that there’s also phrases when playing in epilogue mode and encore mode. So there’s still good stuff to come for. I think this game is fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Its just what i had expected from a game originally for a phone or tablet. Played this game when it was first released to the public and now I am more challenged to play it all over again with the newest update so far",
            "review_score": "1"
        },
        {
            "review_text": "I'M SO DYSLEXIC KILL ME NOW",
            "review_score": "1"
        },
        {
            "review_text": "why buy this game when we can have it for free on the phone ? if you buy it on steam you can do a steam revieu of this game and that's kinda nice",
            "review_score": "1"
        },
        {
            "review_text": "If you are depressed, frustrated, or stressed, play this game, trust me, you will hurt your pc and yourself (physically).  10/10 for bruise and broken fingers.",
            "review_score": "1"
        },
        {
            "review_text": "At first I was like 'Finally a game I can play with one hand! But I can not fap to this!' but then...  eargasm .",
            "review_score": "1"
        },
        {
            "review_text": "  oops i accidentaly review wrong game",
            "review_score": "1"
        },
        {
            "review_text": "I do not like this game.   Maybe it's a matter of expectation, I expected to find a skill based rhythm game/endless runner puzzle hybrid, what I found was a poorly executed frustration engine.   Visuals: Dull. I don't dislike minimalist styles, and it's not BAD looking, but when you only have two spheres and 3 types of rectangle in your game, I would expect them to look at least a little bit interesting. Not to mention how the constant blur effect makes it surprisingly difficult to see what's going on sometimes, especially with spinning blocks. The visuals are actually detrimental to the gameplay. The pulsing background effects are cool.   Gameplay: Memorize sequences of left and right presses. There is some skill involved, but it's basically just remembering how long to push left or right for various combinations of blocks. It's very unrewarding. It is an interesting rotating concept, but it doesn't deliver. Every time you mess up you have to restart the level. Levels are short and the reset takes only a second so it's not a big deal, but it's not fun. That is how I would describe the gameplay here: not fun.  It has a minimalist narrative which is pretty cool.   Audio: This game actually has a great soundtrack, I really like the background music and when it gets going it starts to tie the game together and make it almost enjoyable. The in game sounds are lackluster. The 'narration' is a nice touch.  In short: It's not terrible, not the worst thing you can buy for sure. If you just want to pay £2 to kill half an hour then it's not bad, but I wish it had been so much more. It could have been with just a little bit more time/effort/money.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Frustrating and pleasuring at the same time  This game is very intriguing. I have found myself to like the obstacles in this game and get frustrated when I keep failing, not to say that its a bad thing. I like the game so much that I really enjoy it even when I fail, (Im terrible at games) The music is devine and sits perfectly with the game itself. It is sort of a calm tune that goes with crazy obstacles and if you were do play this in a calm mood rather than be rage quitting, it can be really fun! I recommend playing this game, even just casually as the music is relaxing for the type of game this is! I dont have much time on this game, but it is phenomenal and have loved every second ive played it so far",
            "review_score": "1"
        },
        {
            "review_text": "At least in Super hexagon there's a voice saying 'Game over... Again!'",
            "review_score": "1"
        },
        {
            "review_text": "Warning: not for people with anger management issues!  If you've ever played Super Hexagon and liked it, you'd like this one too! This game made Humble Indie Bundle 16 worth it for me. Simple concept, but difficult to play. ",
            "review_score": "1"
        },
        {
            "review_text": "This game hooked my so hard I didn't realized the later levels were faster than the first one. It's impossible to notice that with the awesome music and the great narrative story. It will make you angry but you won't feel an itch of that.",
            "review_score": "1"
        },
        {
            "review_text": "hate but love it",
            "review_score": "1"
        },
        {
            "review_text": "Difficult. Can be excruciatingly difficult at times. But clever and extremely fun.",
            "review_score": "1"
        },
        {
            "review_text": "Very good but very damn frustrating....",
            "review_score": "1"
        },
        {
            "review_text": "Challenging, cross-platform and extremely fun!",
            "review_score": "1"
        },
        {
            "review_text": "Mind-bending. The mental gymnastics you'll have to put yourself through will leave you more tired than carrying around Tess Munster.  Highly recommended for anyone who likes a little challenge. The ammount of levels is huge (I thought I finished the game, just to realized I was really just 1/3 way through). 10/10 would fry my brain again.",
            "review_score": "1"
        },
        {
            "review_text": "the game does what it does best BEING AWESOME buy it it's good pinky promise don't hate and donate",
            "review_score": "1"
        },
        {
            "review_text": "Soothing...",
            "review_score": "1"
        },
        {
            "review_text": "My head is still spinning.",
            "review_score": "1"
        },
        {
            "review_text": "my brain and heart said to stop playing this game but my hands said hell no",
            "review_score": "1"
        },
        {
            "review_text": "cool game mechanic and design but incredibly challenging ; at least for me ",
            "review_score": "1"
        },
        {
            "review_text": "Loved it. Still dont know how I did it. A game about reward and frustration. I've died at the last possible moment a hundred times laughing. Loved it",
            "review_score": "1"
        },
        {
            "review_text": "Duet is a feat of elegant and minimalistic game design, in the 'easy to learn, hard to master' genre.  The entire gameplay revolves - literally - around a single axis. And yet you'll be surprised at the variety of levels. It plays well on keyboard, controller or touchscreen, and runs as smooth as can be.  It's a game you play in small bursts, as these are short levels, but there is also a lot of replay value with perfect runs, achievements, endless mode, daily and nightly challenges etc.  I should get frustrated at some of the later levels which require devilishly precise controls, but yet I don't because of the awesome relaxing soundtrack. Duet is my pick-me-up when I want to chill for 15 minutes.  Among the seas and oceans of garbage mobile ports, this game stands out as how amazing a mobile port can actually be.  With tons of extra content, it's worth paying even the full (cheap) price for it.",
            "review_score": "1"
        }
    ]
}