{
    "app_id": 292630,
    "name": "Uriel's Chasm",
    "release_date": "2014-09-12",
    "developer": [
        "Rail Slave Games"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Psychological Horror"
    ],
    "achievements": 0,
    "positive_ratings": 470,
    "negative_ratings": 2295,
    "price": 3.99,
    "description": "The death of everything",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/292630/header.jpg?t=1484923719",
    "minimum_requirements": "OS: Windows 7 and up Processor: 2 gig dual core Memory: 2 GB RAM Graphics: Latest driver direct x 9 Sound Card: Latest driver direct x 9",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Edited on 1/20/15 to add game mechanics detail (see paragraph four).   Uriel's Chasm isn't a game so much as it is an experience. Unfortunately, if you're not of the age group to recognize that, or if you don't know this before you press 'play,' you'll give it five minutes, declare it the most horrible game ever made, and move on.   I'm going to flirt with madness here and tell you it's [expletive deleted]  BRILLIANT . From the lack of a pause key or an options menu, to the midi-based music, to the absolutely brutal gameplay, to the lack of pyrotechnics, to the anticlimactic area 'wins,' to the interlaced, grainy FMV (that's 'full motion video' for those of you who weren't around  before  its existence)...all I can say is just...wow. For those who didn't experience computer gaming back in the early 1990s (just as CD-ROM drives were hitting the market), Uriel's Chasm very accurately replicates the  exact  experience of that era. Games were frequently nonsensical; they often changed screens abruptly, they didn't hold your hand, they didn't provide tutorials, and they most   certainly  didn't have giant arrows or yellow question marks to point you in the right direction.   As an actual game, once you get into it, Uriel's Chasm is challenging, unsettling and even a bit disturbing. Part of the purpose of this game (other than to take you back in time in a very real way) is to discover each new section and how to play on your own, so I won't spoil those moments for you here. What I  will  say, is that it very accurately represents what were three out of the four main styles of gameplay back in those days (the fourth being faux-3D shooters such as Catacombs 3D, Wolfenstein 3D, Doom, et al), but skewed through Uriel's Chasm's own twisted lens.  Game play is brutal and unforgiving, but that's kind of the point. The controls are extremely responsive, if not initially intuitive. It runs smoothly even on my three year-old big box computer, and there is a solid logic or pattern to each area (even the seemingly unbeatable final level).  I came to Uriel's Chasm as an active Presbyterian Elder, curious about the Biblical aspects of the game, but that quickly became a non-event, as the experience took over. Nevertheless, there is some usage of Christian iconography that may be disturbing to some players (such as spinning crucifixes that fire bullets). Play time is pretty short but, as this is more about the experience than the actual game, that doesn't bother me. With all sincerity, and without any sarcasm, I tell you this : Uriel's Chasm is art. Most people won't agree with me. Most people won't get it. Most people won't like it. I do. I do, and I absolutely recommend it to anyone who remembers what gaming was like back then and wants to relive the experience, those who are into hardcore gaming, or to those who are curious about it. All others should, as evidenced by the multitudes of negative reviews, pass it by.",
            "review_score": "1"
        },
        {
            "review_text": "(The description for this game flat out lies. There's no metaphysics here, and VERY little 'rich context' that in NO WAY can be investigated.)  I greatly enjoyed this game, but I would not reccomend it to most people. You have to have a very specific taste in these kinds of psychedelic games in order to appreciate it. Oh, and it takes 15-30 minutes to complete the game.   Uriel's Chasm is a very complex enigma. First off, I would like to say that there is no 'Shovelware Queens' as the description would have you beleive. I wanted to see their playthrough, so I googled it and searched for around 4 hours, and literally nothing even mentioning them popped up. This game is not based off an unliscened bible game, this is a game entirely handmade, not a revamp of a game from the 90's.   I would try to give this game a traditional review, but that is impossible. The appeal in Uriel's Chasm is not the gameplay. The appeal lies in something more abstract, perhaps the game's overall aethsetics. This game is more of a commentary on other things than a game in of it's self. This is a fancy way of saying, the gameplay basically sucks. The second level is a very well made side-scrolling bullet hell, but the first and third levels are tedious. Now, don't get me wrong, I greatly enjoyed each level, but not because of normal reasons. It is a lot like Sluggish Morss in how it is presented.   The enclusion of DMT is what made me buy this game, and what made me realize that this isn't a remake of a very old game. Why would someone trying to sell a christian game advertise DMT?  The best part about this game is the ending. I found the whole concept of this game to be extremely innovative, and I am excited to see more games like this.",
            "review_score": "1"
        },
        {
            "review_text": "here is this games story: your a girl who is in a space ship, who is against a giant mouth with wings that is called the garden of peace, and you need to sit still in space to collect faith, untill you have more than the garden of peace. you can destroy the astroids to collect more fuel (REALLY rare), ammo and bibles. what does the bible do? it changes the text at the bottom of your screen. what else does this do? nothing. after that, you are trown in a 2d space shooter where you are flying with a oil tank, where you need to dodge crosses that shoot round disco balls, blue men that are riding blue d***s, and so on. when you reach the end, you fight a xenomorph with the face of an old man, that summons a ball that has a cloak field around it self, and shoots a whole lot of fire balls and small disco balls. then you go on an acid trip to find jesus trees, seven times. when you have completed it, you will be sent into the garden of peace (i think) where you will fight the mega giraffe that shoot 1000 black and white balls at the same time, and you need to shoot it with a infinite amount of books. what happens after? go on youtube, i really dont know. 10/10 would use this to torture myself and my friends again. P.S. did i mention that this game is about religion?",
            "review_score": "1"
        },
        {
            "review_text": "Still better than Call of Duty...",
            "review_score": "1"
        },
        {
            "review_text": "A flawed masterpiece. One of the more original games I've played 2deep4me metaphors with allegories Cool graphics and nice aesthetic Great music Nice mix of genres  There are some nitpicks, like not being able to skip those cutscenes and the text that disappears fast My main gripe with the game is too short and easy so just wait for a sale when is below a buck",
            "review_score": "1"
        },
        {
            "review_text": "I liked this quite a lot. It has good retro graphics and is pretty much a brutally difficult top down shooter. It does have some odd themes and most of the difficulty is in the dodgy controls, though.",
            "review_score": "1"
        },
        {
            "review_text": "I survived the first level.",
            "review_score": "1"
        },
        {
            "review_text": "  Althought i liked this game, i can not recommend it to everyone. This is obviously a parody to old bible games so if you don't get it you might end up hating it or not, what is to me i have only knew about bible games from watching AVGN's bible game reviews.  So as far as im concerned, this is way too much better than those old bible games, they were games/hacks made with the only purpose to make money, they just stack a few random bible passages and they put bible references in their name. Basically a scamm, this game is making fun of them.  What's is about the story, i think soo faar there should be 3 storylines. The people from the videos reviewing the game (in game) the story of the game with happens to be really bizarre and what is really going on, that to me it's just some drug trip hallucinations the main character is having since there are many references to DMT  The story is not over yet, since there is a sequel. also i think this game 'Selfie' might have something to do with this bizarre world  The only thing i didn't liked of Uriel's series is that they're too short games, but in the other hand i think the dev was more interested in the experience of playing this game than the game itself and it worked, at last for me...",
            "review_score": "1"
        },
        {
            "review_text": "I actually finished this game in about 35 minutes, I highly recommend it, it brought me closer to god. 10/10 would play it again.",
            "review_score": "1"
        },
        {
            "review_text": "Le sjws want to destroy our gaems",
            "review_score": "1"
        },
        {
            "review_text": "Seriously, it's not that difficult to figure out the game play for the first level. The other levels are several times harder than I generally have the patience for, and I'm not a huge fan of shooters, but the aesthetics and sense of humor were wonderful and kept me going to the end. Also, some seriously terrifying sounds toward the end. Perfect length of ~1 hr.",
            "review_score": "1"
        },
        {
            "review_text": "That game can make the time you spend playing it fun and pretty interesting. The game has a fine graphic and cool gameplay, the soundtrack is good. This was a unique experience playing that game and I liked it a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Well.. what can I say, Uriel's Chasm, is just fantastic. It's like looking at the bottom of your mcdonalds bag and finding extra chips, it just tops all games by a mile, from the story to the art it just really pulls the player in. Apart from the 5 minute introduction every time you load the game, this game is a fast paced, space adventure. The introduction really pulls you into the game and makes you feel a part of it, a smart idea by the game devs to include actual humans talking to you so you don't feel lonely, becuase I mean, if you're buying this game, you're lonely. But all things said, this is the game of the year in my opinion and shouldn't be overlooked because it is 30p. I had great fun and would love to see another.",
            "review_score": "1"
        },
        {
            "review_text": "A must have game! really, buy this !! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The Best Game for uninstall",
            "review_score": "1"
        },
        {
            "review_text": "W-Why? Why would you make this game?",
            "review_score": "1"
        },
        {
            "review_text": "This game gift me cancer, ebola and malaria. COMBO BREAKER!",
            "review_score": "1"
        },
        {
            "review_text": "I used to believe in great god Alah but this game converted me into a Christian.",
            "review_score": "1"
        },
        {
            "review_text": "There's a school of thought that says art should make people feel uncomfortable. I'm skeptical of the notion that games are art (I think Kojima was right when he said games are a service), but there's certainly unruly fodder for the argument here.  As noted in the copy, No-Wave scene musician/poet/whatever Jarboe does the in-game voice-over here. No-Wave music was notable for being deliberately abrasive, noisey and antagonistic, punk rock carried out to its logical extreme. Dare I say the music set out to be unlistenable. In the No-Wave documentary 'Kill Your Idols' one musician who was pivotal in the scene admits that he rarely listens to this sort of music and spends most of his time listening to generic pop. I bring this up because Uriel's Chasm is a sort of 'No-Wave Game' - it sets out to be un-fun, which gave me the strange feeling that the game was a joke on the part of the developer.  Most of the game is structured as some sort of shmup, be it the first stage's mash up of Asteroids and the first Thunder force, the second level's side-scroller, or the Director's Cut-additional final boss stage's Invaders clone. From a gameplay standpoint the problem is none of them are very fun. The first stage require's you to fill up your 'faith gage' by picking-up items dropped by destroyed asteroids, or just waiting, as the gauge slowly fills on its own. Guess which one I opted for? The second stage is the most playable, given the mercifully small hitbox your character has (hint: it's the cross on your sprite). The final stage is barely-playable given the headache inducing spray of bullets, which painfully flash white and black (I don't advise this game for anyone prone to seizures). It's worth mentioning that what I presume to be the end-boss (I gave up when my eyes ached and my head started throbbing) is scored to a track consisting of Jarboe's sampled grunts and screams over which plays her monotone free-verse poetry. It's easily the most unpleasant final boss I've ever had the mispleasure of playing, which wasn't aided by the ship's enormous hitbox.  That being said, the aesthetic angle of the game is interesting. The set-up is essentially that you're 'playing' a clumsy 'let's play' video (I realize that phrase is redundant), with non-'in-game' cutscenes consisting of the hosts commenting on the game, some of it being humourous, at least blackly-so. The game's certainly colourful, too, while the unlicensed head-trip bible game trappings keep things fresh. Light CRT and unlicensed-game-visual-glitchiness simulation is also a nice touch.  The real star of the game is its soundtrack. Simply put, it kicks ♥♥♥. Be it the second stage's homage to the Megadrive or the ♥♥♥♥♥in' shoegaze epilogue, the music at least keeps one part of this admittedly short game enjoyable.  It would be nice if it were possible to give this game a 'mid' rating, given it fits what one reviewer said of the film Demon Seed. To paraphrase, it's definitely not a classic, and it can't be said that it's even any fun, but in the end players with the right frame of mind won't have wasted their forty minutes. Just don't torture yourself with that end boss. Life's too short.",
            "review_score": "1"
        },
        {
            "review_text": "Holy hell, it's a hard game, the soundtrack it's good, a bit repetitive though, it's hard to control sometimes, you can't skip the between levels clips, they don't give you instructions for every level, but it's easy to know what you need to do once you do it, i actually like this game.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥.   I want to beat this game extremely badly; I loooove the style, and I love Swans. But I played it for only 30 minutes and nearly had a panic attack, on the second level, because I'm simply not good enough at video games to be able to play this one. I'm not really sure what to do, other than maybe try a cheat engine or something. :(  Why is this tagged 'Casual'? ",
            "review_score": "1"
        },
        {
            "review_text": "I've never felt so close to Christ.",
            "review_score": "1"
        },
        {
            "review_text": "this game saved me &lt;33",
            "review_score": "1"
        },
        {
            "review_text": "Oops, pressed the wrong button :3",
            "review_score": "1"
        },
        {
            "review_text": "this game is dope",
            "review_score": "1"
        },
        {
            "review_text": "got the cards 10/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "I now have a profile badge about DMT.",
            "review_score": "1"
        },
        {
            "review_text": "So this is going to be a positive review, that doesnt have any jokes.  Uriel's Chasm is um.. weird to say the least.   I thourghly enjoyed the game, I did not beat it, i cant get past the space demon giraffee (which is LITERALLY FEAR INCARNETED!!!), sorry if the grammar is off. I can't really see straight, have a migraine, maybe be intoxicated, will defenitly throw up. If you have Vertigo, or Epieplsy DO NOT F***ING PLAY THIS GAME!!! There should be a warning in this game. I'm not going to explain this game, if it looks like something you would play, then play it. I saw it, thought it looked more intersting that a game that just used Unity resources. I'm glad i tried it, probably wont ever again, worth it as long as the price is less than .50 cent. Hope the 'Develpore' makes something like this again. And as i stated, i dont feel good at all after playing this 'game' so sorry in the english is pretty jank.",
            "review_score": "1"
        },
        {
            "review_text": "WTF i think you destroy rocks then bibles come out and you collect them to get faith to kill what i think is a giant alien.",
            "review_score": "1"
        },
        {
            "review_text": "I have no idea what I am even playing. Is this even a game, or is it random madness? I assume there are multiple levels, but I can't even figure out what to do in the first level, which is a horrible asteroids type game where an anime girl (?) is ranting bible quotes at you. From reading some more the intent was to make a supposed old bad Bible game -- well, they succeeded absolutely.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a joke game and I get it, it's not making me laugh but I get it.",
            "review_score": "-1"
        },
        {
            "review_text": "A friend of mine was dying due to lung cancer, so I gifted him this game to put him out of misery. Now he's threatening to kill me.",
            "review_score": "-1"
        },
        {
            "review_text": "▓▓▓▓▓▓█████░░░░░░░░█ ▓▓▓▓▓▓█░░░░░░░░░░░░░█  ▓▓▓▓▓▓█░░░Valve delete░░░█  ▓▓▓▓▓▓█░░░this game░░░░░█  ▓▓▓▓▓▓█░░░Please! ░░░░░█  ▓▓▓▓▓▓█░░░░░░░░░░░░█  ███████▄▄█░░░░█████▄  ░░░░░░░░░█░░░█  ░░░░░░░░░░█░░░█  ░░░░░░░░░░░█░░█  ░░░░░░░░░░░████",
            "review_score": "-1"
        },
        {
            "review_text": "░░░░░░░░░░░█▀▀░░█░░░░░░ ░░░░░░▄▀▀▀▀░░░░░█▄▄░░░░ ░░░░░░█░█░░░░░░░░░░▐░░░ ░░░░░░▐▐░░░░░░░░░▄░▐░░░ ░░░░░░█░░░░░░░░▄▀▀░▐░░░ ░░░░▄▀░░░░░░░░▐░▄▄▀░░░░ ░░▄▀░░░▐░░░░░█▄▀░▐░░░░░ ░░█░░░▐░░░░░░░░▄░█░░░░░ ░░░█▄░░▀▄░░░░▄▀▐░█░░░░░ ░░░█▐▀▀▀░▀▀▀▀░░▐░█░░░░░ ░░▐█▐▄░░▀░░░░░░▐░█░░░░░ ░░░▀▀▄THIS GAME▄▐▄▄▄░░░░ ░░░░░░░░░░░░░░░░░░░░░░░",
            "review_score": "-1"
        },
        {
            "review_text": "I wish Hitler was still alive",
            "review_score": "-1"
        },
        {
            "review_text": "Installed it, got the cards, uninstalled it  -1/11",
            "review_score": "-1"
        },
        {
            "review_text": "this game made me lose faith in humanity. Good game if you need a reason to kill yourself.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't do it. I laughed at reviews and thought it might be an enjoyable trippy game. It's so weird and messed up. Disable sound and turn off your monitor while you idle for cards. I wet my pants and ♥♥♥♥ the bed and stayed up for 3 days crying.",
            "review_score": "-1"
        },
        {
            "review_text": " Uriel's Chasm  is a sad addition to the already-replete ranks of bad religious games; its intended satirical nature cannot save itself from its own dysfunctional gameplay, lazy execution and general misapplication of its religious themes.  It's maddeningly difficult to give a synopsis of this game, as the game never tells its own story properly. New players are introduced to one Sister Tabitha, who both monologues about being asleep for years yet inexplicably also knows about events that trouble the world. Players are then immediately dropped into a space setting, in a spaceship, with text explaining that they must collect Bible verses via mining asteroids. The game also launches a HUD that has four different values on it, including 'Faith' and 'Fuel', and before even processing what the controls are, the ship is crushed by some massive unknown object and the level is reset. This madness encapsulates the experience of  Uriel's Chasm  well.  This game is ravenously difficult, and little of it comes from fair, legitimate sources. The game's interface provides no indication for new players on how to play the game. Naturally, players will discover on their own that the arrow keys move the ship, but no other keys seem to do anything. Only after stumbling about on the keyboard will one find that the Z key fires the weapon. The shots fired from the weapon often phase through smaller asteroids, making it unreliable at best. The lack of collision sound effects for when the ship takes damage or when asteroids are destroyed makes it even easier for those not paying attention to spontaneously die. Perhaps the greatest injustice this game offers is that it has no pause menu, meaning that gamers that naively assume some level of competence by the developers and press 'Escape' during a level to pause will find themselves back at the beginning video sequence...which is unskippable. It's always unskippable. The unremovable Bible tracts that appear on the bottom of the screen during the first level in putrid green hues rounds out this spectrum of awefulness. The game's length is quite pathetically short at only four levels, though no player of sound mind will make it past the first. Perhaps it is merciful that this mess cannot last for long.  This game tries to save face by marketing itself as a satire of early religious videogames, with its lackluster interface and tough-as-nails difficulty serving as callbacks for nostalgia's sake. However, the protection that satire provides, despite being quite overarching, is not enough to save this title. What differentiates good game satire from  Uriel's Chasm  is that good game satire must convey that it has the potential to be good, but is intentionally made badly in attempt to pay homage to bad source material. Without the implementation of basic functions or a good system for the game to run on, the satire fails to parody its source and instead just becomes what it tries to mock. See  AVGN Adventures  and  DLC Quest  for examples of satire done right. The former parodied old-school platformers with brutal difficulty and the latter parodied modern microtransactions by making everything in-game DLC. However, both of these games have basic functionality and don't turn off players with awful aesthetics and unfair mechanics. If those two were designed the way  Uriel's Chasm  was made, then  AVGN  wouldn't have a jump button and  DLC Quest  would make players pay actual money for the fake in-game DLC. Because the developers do not understand how to effectively render satire in videogames, this game fails on all levels: as an actual game and, most importantly, as a parody.  Good games and religious games are not mutually exculsive in theory, but this game does nothing to prove this theory correct. Adequate functionality in controlling the character does little to forestall the mass of horrible elements that this game forces players to endure, from the lack of simple components like a pause menu to no explanations of backstory to such an out-of-place shoehorning of Biblical passages in a game that otherwise has nothing to do with Christianity, that this game can only be described as  unholy . Avoid this like the plague.  Uriel's Chasm  gets an F+.",
            "review_score": "-1"
        },
        {
            "review_text": "It exsist to bring pain to this World.",
            "review_score": "-1"
        },
        {
            "review_text": "  The game doesn't even have a pause button... Nothing else to add.",
            "review_score": "-1"
        },
        {
            "review_text": "Most fun game ever, would recommend it to anyone. If you are looking for confusion and suicidal thoughts you have come to the right place. TVFilthyFrank is also a good place to go aswell.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Nooooo!!!!!!!!!!!!! No! No! No! No! Please no! If you are eating with forks. Leave this store site right now. If you are a cat and you like colours then you can buy it and the next day you should be dead from ebola. The worst 'game' I've ever... damn NO!!!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Blast those heathen asteroids to Vaporware heaven. (Thy words ending in -eth/oth doth noth maketh thy game holy).",
            "review_score": "-1"
        },
        {
            "review_text": "What the f*ck simulator.  666/10",
            "review_score": "-1"
        },
        {
            "review_text": "If your looking for a review on this game you've come to the wrong place, but if your looking for an outstanding cheese cake recipe you've come to the right place.  Ingredients:  1 cup digestive plain sweet biscuit crumbs 3 tablespoons sugar 3 tablespoons melted butter 40 ounces softened cream cheese 1 cup sugar 3 tablespoons flour 1 tablespoon vanilla 1 cup sour cream 4 eggs  Directions: For The base:. If you're using a dark pan, preheat the oven to 350. If you are using a shiny pan, 375. Combine the crumbs, melted butter and 3 tbsp sugar well and pat onto the bottom of a 9 inch springform pan. I also like to very very lightly butter the sides of the pan so that the cheesecake will not stick later on. Bake for 10 mins in your preheated oven and remove. Let it cool while you prepare your batter. For the batter:. Make sure everything is at room temperature. Combine sugar, cheese, flour and vanilla in a big bowl and mix on medium speed till well combined. Don't forget to scrape the bowl as you're doing this. Mix in the sour cream till its incorporated well. Then, add the eggs one by one, mixing well after each addition. Pour the batter into the springform and let it bake for 1 hour and 10 minutes After the baking time, turn off the oven and leave the door ajar. Let the cake cool in there for about 1 1/2 hours. Remove the cake and let it cool thoroughly. Refrigerate overnight. Release the sides of the springform. Eat.",
            "review_score": "-1"
        },
        {
            "review_text": "What bothers me more than the terrible game is the terrible quality and lameness of the trailer.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is born in hell and no human being should ever expirence the hell that this game is. This game WILL give you cancer. This game WILL be the last thing you see. And this game IS A CREATION OF THE SATAN HIM SELF.",
            "review_score": "-1"
        },
        {
            "review_text": "'The intro looks like a cheesy porn 6/6' - Pope",
            "review_score": "-1"
        },
        {
            "review_text": "How is moral to pay for this game?",
            "review_score": "-1"
        },
        {
            "review_text": "I played it for 0.5 minutes and thanks good i have alt/ctrl + del becouse the esc key dident work and i wanted to kill myself",
            "review_score": "-1"
        },
        {
            "review_text": "Digital herpes for your Steam library. Get this and know the true meaning of regret.",
            "review_score": "-1"
        },
        {
            "review_text": "i got the game for free i wanted to be fair reviewing it so i played it till the end and really any one can finish the game in less than an hour and it costs 5 dollars for 1 hour gameplay.  This game is basically is the worst game in pc history just get the cards and delete.",
            "review_score": "-1"
        },
        {
            "review_text": "  Honestly: Who buy this for 5 bucks?!",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY IT! Its not worth even 1 cent. Some games are just bad, some games are so bad they actually are funny, some games are BAD bad this is one of them :S",
            "review_score": "-1"
        },
        {
            "review_text": "I don't why but i really hate this game.. i just afk in the 1st stage but suddenly i got to the 2nd level @_@ but anyway thanks for the trading cards.",
            "review_score": "-1"
        },
        {
            "review_text": "the hell is this?  i can buy trying to make a religious game intresting but this... nope this is just BAD.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't ever pay for something like this game. It's awful. I got it for free and it wasn't even worth the time I spent on it.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this for the card drops. Opened it up in the background, muted it, never even looked at it. Ever since then, I get the shivers when I pass by a church. I...I just don't feel clean anymore. I don't think I ever will again. Dont make the same mistake as me!",
            "review_score": "-1"
        },
        {
            "review_text": "It's like a spreadind disease, especially the intro gives me nighmares. All you got to do is to get those cards as fast as you can and also stay away from the PC ( I recomand to leave the room while this games is running and to turn off your electrical current before entering the room just to be sure the game is closed)",
            "review_score": "-1"
        },
        {
            "review_text": "It really is as horrible as everyone says. And to add insult to injury, even if you manage to suffer through the first 3 stages, the final boss (a giant space-giraffe with lipstick) is pretty much unbeatable because there's no way to avoid its projectiles.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game ever: a 10 year old could make a better game than this.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the absolute worst game I have ever played in my life.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the most horrible ♥♥♥♥ I have ever played. The controls are ♥♥♥♥, the sounds are ♥♥♥♥, the premise is ♥♥♥♥. It may be fun for someone who likes the Bible, otherwise it's ♥♥♥♥. Total ♥♥♥♥. ♥♥♥♥.  EDIT: Zombie Zoeds is more horrible than this.",
            "review_score": "-1"
        },
        {
            "review_text": "How to mute this while you are gathering the cards:  1. Go to the bottom right of your screen and chose the music mixer 2. Find the uriels chasm icon and turn off the sound off 3. Gather the cards without going crazy by this dreadful piece of ♥♥♥♥ !",
            "review_score": "-1"
        },
        {
            "review_text": "Got it for the cards. Still regret it.",
            "review_score": "-1"
        },
        {
            "review_text": "Here's my review: WTF is this ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "  If you want to get cancer and die painfully, buy this game and than play it at least for one hour.",
            "review_score": "-1"
        },
        {
            "review_text": "It is a trap made by Satan himself. Take the cards and run away as fast you can",
            "review_score": "-1"
        },
        {
            "review_text": "It is a trap made by Satan himself. Take the cards and run away as fast you can",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game for free. I played it up until I got to a cracked out giraffe and then I couldn't take anymore.   I guess you might like it if you're into bullet hell type of games, but I thought it was god awful.",
            "review_score": "-1"
        },
        {
            "review_text": "Even minimizing it for the cards feels like a waste.  I played a bit of it. You get bibles by shooting asteroids while a giant flying winged mouth spins. It has that much sense.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok, now seriously! What is this game about?! I really don't know and i was playing it for a while! This is when Jesus died secondly! No really! If he will see this game he will die again with big pain. But still, it has cards and i got it for free... If you want to buy it... No you DONT!",
            "review_score": "-1"
        },
        {
            "review_text": "Why does this exist? It is by all counts very terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "One of those awful things you hide in your library.  ",
            "review_score": "-1"
        },
        {
            "review_text": "This is the worst ♥♥♥♥ing game I've ever played, I got this in a 10 steam keys for £1.70 on ♥♥♥ and I still feel ripped off. Get to ♥♥♥♥ with your ♥♥♥♥♥♥ game I made a better game for my ♥♥♥♥ing school project you ♥♥♥♥♥♥s.",
            "review_score": "-1"
        },
        {
            "review_text": "Atleast this crap got colours :D  i even dont want get cards from it becouse music in background suck!",
            "review_score": "-1"
        },
        {
            "review_text": "My first time giving a no and it can't be helped.  Well, it is free and gives you cards. If it has discount and lower than the total cards drop price, buy it, you still help the dev on that way. Otherwise, no.",
            "review_score": "-1"
        },
        {
            "review_text": "I stopped playing when I encountered the giant screaming cheese monster with eyes.",
            "review_score": "-1"
        },
        {
            "review_text": "Probably the worst game on steam.",
            "review_score": "-1"
        },
        {
            "review_text": "....................................................",
            "review_score": "-1"
        },
        {
            "review_text": "Proper way to play this game: 1. Get for free. 2. Launch 3. Finish in ten minutes while keeping the vomit inside. 4. Go vomit 5. Come back, Alt-tab, mute 6. Wait until cards are farmed. 7. Close, uninstall. 8. Sell cards. 9. Delete Steam account. 10. Format computer. 11. Burn down computer. 12. Burn down house. 13. Nuke town. 14. Profit.  -10/10: This game is so like religion and drugs: not even once.",
            "review_score": "-1"
        },
        {
            "review_text": "No wonder why this is the worst rated game on steam. A complete waste of time and money.I wonder who voted for this on greenlight. Only good thing is those 3 card drops you get for playing this. Better play Flappy Bird than this Crappy Game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is the steam version of AIDS. I don't know how I got it, but I'm stuck with it forever.",
            "review_score": "-1"
        },
        {
            "review_text": "I was given this game for free by an ♥♥♥♥♥♥♥ who called himself my friend. The moment I booted the game up, I immediately ♥♥♥♥ myself, filling my pants to the cuffs with fecal material. It was merely a sign of things to come. As I attempted to play, each time I'd pick up a 'bible quote' blood would stream from my nose. I could hear endless screaming inside my head, as if the souls of the damned trapped in this accursed thing. Voices told me to go out and kill, and that god would forgive me, nay, welcome the sacrifices.  Immediately, I deleted the game and wiped my computer.   But when I close my eyes, I can still hear the music. I fear these are my last hours.  Avenge me. Do not buy this game. ",
            "review_score": "-1"
        },
        {
            "review_text": "Damn i have gone Blind! this game causes cancer to your eyes and ears! and reminds you so much of every pain you've experienced through life! please make it stop!! I am typing blind right now and don't know where the post button is for this review! XD",
            "review_score": "-1"
        },
        {
            "review_text": "THIS IS WORSE THAN BAD RATS STAY FAR FAR FAR AWAY FROM IT, EVEN THOUGH IT GOT GIFTED TO ME I STILL FEEL TRAUMATIZED AND USED ID LIKE TO FILE CHARGES AGAINEST THE DEV'S FOR FIRST DEGREE ASSAULT.  I HAVE BEEN ASSAULTED VERBALLY MENTALLY AND SEXUALLY THIS GAME SHOULD BURN IN HELLFIRE WHY IS THIS EVEN ON STEAM?   NO BLEACH, DRUGS OR SUPPORT GROUP CAN HELP FROM THE AMOUNT OF PTSD THIS GAME HAS GIVEN ME.",
            "review_score": "-1"
        },
        {
            "review_text": "This game helped me find peace... you can find it by pressing escape twice.",
            "review_score": "-1"
        },
        {
            "review_text": "💩",
            "review_score": "-1"
        },
        {
            "review_text": "What the ♥♥♥♥ is this? Is this even a game? lol",
            "review_score": "-1"
        },
        {
            "review_text": "WORST GAME EVER SO FAR  PLAYED IT FOR 2 MIN AND MY EYES ARE BLEEDING  I got it for free But i Want Refund .  ",
            "review_score": "-1"
        },
        {
            "review_text": "One of the worst games (is it a game?) I've ever seen.  Either that or just 2deep4me.",
            "review_score": "-1"
        },
        {
            "review_text": "Played it for the cards, but it wasn't even worth it... I'm not even sure what you're supposed to do. The text, which is close to unreadable, doesn't help either.",
            "review_score": "-1"
        },
        {
            "review_text": "Girls are hot. Plots are thick. Graphics are cool.",
            "review_score": "-1"
        },
        {
            "review_text": "GOT THIS GAME FOR FREE, REGRET GETTING IT, JUST OPEN IT AND MINIMIZE IT AND GET YOUR CARDS AND UNINSTALL AND NEVER EVER REMEMBER THIS GAME EVER AGAIN",
            "review_score": "-1"
        },
        {
            "review_text": "Just one thing to say about this game.......  This game did the same exact thing to the video game industry that E.T game from Atari did back in the days. Good for this game it's digital, because it would have need an other hole to file it with this crap to forget about it!  Gladly for us the industry now is strong enough to survive an other crap wave.",
            "review_score": "-1"
        },
        {
            "review_text": "im really sorry for the words im gonna say now : this ♥♥♥♥ing game not even cost 1 usd  this i ♥♥♥♥ing boring , you can buy that ♥♥♥♥ only for getting borred  3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game ever",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game I've ever played.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like cheesy gameplay and bible verses at every opportunity you get, this is the game for you! otherwise, run for the hills!",
            "review_score": "-1"
        },
        {
            "review_text": "Why the ♥♥♥♥ would you help the ebola virus cross an ocean ?!",
            "review_score": "-1"
        },
        {
            "review_text": "dont buy ♥♥♥♥♥♥ game !",
            "review_score": "-1"
        },
        {
            "review_text": "How to make this game enjoyable in 2 steps. 1. Drop cards 2. Forget about this game",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game for free. It is the first game ever that I wish I didn't have in my library. Only good thing is a few cards that I'll sell, just hope there's someone crazy enough to buy them! The 12% of people who gave it a possitive review - I'm uber surprised there's that many!",
            "review_score": "-1"
        },
        {
            "review_text": "This 'game' is the most visually assaulting product I've laid my eyes upon. Do NOT play if you suffer from epilepsy, this is not the last thing you want to see in your life. The audio side of things is offensively bad as well: the Soundtrack that accompanies the action(?) is a complete disgrace.  I would like to talk about the gameplay but I have no words to describe the drug induced on-screen madness.  Thanks for the free trading cards though!",
            "review_score": "-1"
        },
        {
            "review_text": "Blinded after playing this game",
            "review_score": "-1"
        },
        {
            "review_text": "S.H.I.T.",
            "review_score": "-1"
        },
        {
            "review_text": "game maker me feel borring, bad game play!",
            "review_score": "-1"
        },
        {
            "review_text": "do yourself a favour and hide this crap from ur library",
            "review_score": "-1"
        },
        {
            "review_text": "how can anyone charge people for this ♥♥♥♥♥♥♥t.",
            "review_score": "-1"
        },
        {
            "review_text": "im glad i got this for free cause i would not want to pay money to play this, dont waste your time or money with this, it has no actual point that i could see and although graphically would apeal to retro gamers thats all there is to it, if you have £4 sat on your steam account get a better game",
            "review_score": "-1"
        },
        {
            "review_text": "im confused, i dont even know what was that and what i were supposed to do, im very confused",
            "review_score": "-1"
        },
        {
            "review_text": "If you like old pixle games go ahead-  I dont really like it.  Ill give a 'No'. Make your own decision.",
            "review_score": "-1"
        },
        {
            "review_text": "WE MISSED YOU/1000  pros :  - cards - lipstick girafe - Jarboe  cons : - headache - regrets for purchasing this game ",
            "review_score": "-1"
        },
        {
            "review_text": "i have no idea whatsoever what the story is about and gameplay itself sucks serious nutsack. It's something about religion, and it's totally lame so that's another minus. Not a reason on Earth why you would want to buy this.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know whats happening.",
            "review_score": "-1"
        },
        {
            "review_text": "Massive Piece of S**t. Whoever developed this horrible 'game' Give up. But Thank you for adding trading cards. so i at least got Some of my money back  Whats Worse this or Ride to Hell  I want a refund... and i got it for free",
            "review_score": "-1"
        },
        {
            "review_text": "I thought I was prepared for how bad this game was going to be. I was wrong.",
            "review_score": "-1"
        },
        {
            "review_text": "i have 0 faith in this game it is pointless and gives you no instructions on how to play i am a satanist now hail hydra",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know whats happening.",
            "review_score": "-1"
        },
        {
            "review_text": "Got this for free. Z to start, Z to shoot. Arrow keys to move the spaceship in the first level. The game is very hard and has very weird design decisions (huge and flashy subtitles, creepy voice reading the text, no options, FMV that is not skippable, etc). This is certainly one of the weirdest games ever made, with different gameplay for each level.  In the first level, you control a ship and the goal is to gather more Faith than the Garden. This is acomplished by shooting stuff and getting Bible pages, which show you texts from the Bible. After a while, if you just avoid being damaged, the Faith level keeps going up until you finished the level.  In the second level, you play a 2D scrolling shooter with very low HP and you need to get to the end of the level without checkpoints, killing Crosses that shoot, among other enemies.  I have not been able to finish the second level, and there is no saving system, so I'm not sure I'll feel like finish this weird and terrible game. Not recommended, two thumbs down!",
            "review_score": "-1"
        },
        {
            "review_text": "I nominated this game for the 'Please Banish This From Steam' Award.",
            "review_score": "-1"
        },
        {
            "review_text": "im really sorry for the words im gonna say now : this ♥♥♥♥ing game not even cost 1 usd  this i ♥♥♥♥ing boring , you can buy that ♥♥♥♥ only for getting borred  3/10",
            "review_score": "-1"
        },
        {
            "review_text": "i have no idea whatsoever what the story is about and gameplay itself sucks serious nutsack. It's something about religion, and it's totally lame so that's another minus. Not a reason on Earth why you would want to buy this.",
            "review_score": "-1"
        },
        {
            "review_text": "Massive Piece of S**t. Whoever developed this horrible 'game' Give up. But Thank you for adding trading cards. so i at least got Some of my money back  Whats Worse this or Ride to Hell  I want a refund... and i got it for free",
            "review_score": "-1"
        },
        {
            "review_text": "not enough teeth garbage/10",
            "review_score": "-1"
        },
        {
            "review_text": "I've just recieved this game from a bundle among many others. I am a fan of Retro and Retro-themed games, I have been playing video games since 1979 or so . And I've even enjoyed some religious themed games (I can not be called religious and i am not a christian) on old consoles (from a company called wisdom tree). This is the worst game that i've ever came across. This is a pile of junk which is not worth the money or the time that you spend on it. If you really want to play a similar shooter game that is cool, fire up your amiga emulator and play 'blastar' from 'core design'. If you want to play a religious themed game play 'Spiritual Warfare' on NES. Stay away from this one. Avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "worst game ever do not buy waste of money 0/11 made me drop 160 iq points",
            "review_score": "-1"
        },
        {
            "review_text": "Why do I even have this game? Oh right... I got it for free. Well, at least it has trading cards...",
            "review_score": "-1"
        },
        {
            "review_text": "it was a gift! i played it for 20 min, relized i could use my time more wisely, so i left the game on, turned tv off, took a poop, came back 2.8hrs later and got 3 cards.",
            "review_score": "-1"
        },
        {
            "review_text": "Game seemed ok the ~6 minutes i played it, but i can't condone a game that contains an adware that opens up your web-browser and redirects to the store page for another game. Uninstalled.",
            "review_score": "-1"
        },
        {
            "review_text": "Got this hame for free, i was playing only for the cards. Soundtrack is sh*t, gameplay is sh*t, story - sh*t, levels - sh*t. Conclusion - sh*t!",
            "review_score": "-1"
        },
        {
            "review_text": "This game seems like it was made on an iphone i hate it",
            "review_score": "-1"
        },
        {
            "review_text": "This game is about collection Bible in cosmos by mining in asteroids (WTF). You have to collect over 1000+ fragments. Collection is just easy, just go afk for 2-3 mins it will collect auto (I don't know how, don't ask me). After that you will see a cut-scene with picture of blonde guy with big boobs. After cut-scene it's time for shooter. This time you are flying by holding soda can. You have to shoot and shoot enemies. If you fail (of course u will for 100%. it's f*cking bullet hell) you must start over and over and over again. There is noo checkpoint or something. I don't what is next because I got cancer. This game is just great &lt;3  +Mindf*ck music +Got it for free from IndieGala so I got from cards. Profit +I think this game was made by these stupid girls from trailer so it's great argument why girls shouldn't make games. +Best control ever. Only WASD and Z for shooting. It's still bad.. +You can get cancer in 5 minutes. This game is worst than Ebola.  CLICK 'ESCAPE' IN GAME TO SEE MAGIC",
            "review_score": "-1"
        },
        {
            "review_text": "This game is proof that Jesus Christ died in vain and changed his middle name to f**king - AVGN",
            "review_score": "-1"
        },
        {
            "review_text": "It's a weird game as you may have already found out by the many reviews for this game. However it doesn't pretend that its not. The makers were trying to be weird so you'll find a lot of reviews from people that were put off by that. Also there's Bible references immediately and throughout, but its definitely not in a preachy, shove it down your throat type of way. Why such negative reviews for that I don't know. Many mainstream movies and games refer to the Bible. Anyone remember Halo? Anyways I wouldn't buy it but that's my opinion. I'm writing this review when the game is posted at 49 cents... 90% off until april 6. I still don't think I'd buy it, but it does have trading cards so maybe. It's retailed on Steam at $5 so if you like weird games and its peaked your interest try it out, it's not horrendous. I've played worse, much worse.  The maker did this game on a budget I'm sure so the fact that its gotten the small publicity that it has isn't bad. Maybe being weird was a good idea...  Space theme 8 bit top down starfighter craft. You're looking for some missing space station. I really don't want to bore you or me with the details. There's pictures and video out there so see for yourself. Thanks for reading and have fun gamers.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game just to write a negative review 1/100",
            "review_score": "-1"
        },
        {
            "review_text": "This game is one of the stupidest game's iv ever wasted 20 minutes on, sorry this is just not the game you want to buy!",
            "review_score": "-1"
        },
        {
            "review_text": "The amount of diseases I have got from this game is to much to list. Worst of it though is the leprosy I received with the flashing text and my face deteriorating from it. I physically died from the leprosy and I was brought back to life to return to play this turd. Reason for this you may ask? Because this game won't let me die. I have been binded to this game by a prophecy and I'm damned for eternity",
            "review_score": "-1"
        },
        {
            "review_text": "Piece of junk, avoid it at all costs! There is nothing good in this product - I avoid the term 'game' on purpose.",
            "review_score": "-1"
        }
    ]
}