{
    "app_id": 292670,
    "name": "Princess Isabella - Return of the Curse",
    "release_date": "2014-04-15",
    "developer": [
        "Gogii Games"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Hidden Object",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 50,
    "negative_ratings": 12,
    "price": 3.99,
    "description": "Defeat the witch for the last time with the help of your trusty Fairy sidekick and a new friend you met along the way!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/292670/header.jpg?t=1447361183",
    "minimum_requirements": "OS: Windows 7, Vista, XP Processor: 1.8 Ghz Memory: 512 MB RAM DirectX: Version 8.1 Storage: 700 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Princess Isabella - Return of the Curse  is the second game of the  Princess Isabella  series and also its peak probably. Coming out from Gogii games as its predecessor, the game narrates another chapter in the titular princess' life and her lifelong enmity with a witch.  Years after princess' adventure and commotion with the witch, the curse returns to her land. It's been several years now that she's been happily living with her husband, and baby daughter Bella; but dark shadows summoned by the witch infiltrate the castle and abduct Bella. They had an unfinished business after all. Isabella takes on a journey throughout her kingdom this time, facing witch's forces, aiding townsfolk cursed by the said witch and searching for her beloved daughter. Will she prevail and return Bella to safety?  The game is a loveable continuation to the series, with beautiful background art, hand drawn characters and fairytale design. Game being old, you shouldn't expect a miracle about resolutions though. In tone, it is somewhat childish and carries the nativity of the first game. This time, we are also capable of observing the realm of Isabella a bit more closely, weaved from countless European fairytale references. Our fairy companion - who is also happened to be Bella's godmother - is also present to accompany our quest just like old days, alongside a dragon hatchling named Nessie who joins us just recently. They both have different abilities and interaction options to aid you in your quest.  HOG scenes are quite basic and items are distinguishable despite the age of our graphics. Puzzles are various and a bit more of a challenge compared to the previous game, but item collection is all over the place. Due to your companions' various abilities getting unlocked in a timely manner, you'll keep revisiting different locations over and over again to harvest previously unreachable items. The HOG show down with the AI is still our preferred end game boss battle. Oh, and the ending isn't your usually happily ever after; rather a plot hook for the third game to come.  In the end, I'd recommend the game if you've played the first one and curious about what is to happen to Isabella. It's not a marvelous HOG, but a pretty little casual adventure game with an enjoyable story outline that would present you 2 hours of game time. Enjoy!  Please also check out Lady Storyteller's Curator page  here  - follow for regular updates on reviews for other games!",
            "review_score": "1"
        },
        {
            "review_text": "When this game first came out, I just could not make myself play it, as I found the faery annoying. Saw it on sale here on Steam, and thought, 'Why Not?' Especially since I had played the first and third in this series. The faery and the dragon didn't annoy me as much as I thought they would. Despite what another reviewer wrote, you can click on them while they are speaking just to shut them up. Especially when the dragon is repeating what someone just told you. I actually did enjoy it, except for some of the HO's being difficult to find. I like the fact that it has a jump map and you are notified when you are done in an area, so you can just move on. It was at times challenging, but not overly so. Puzzles are solvable without being to simple. If your not sure what to do, there is a hint helper on top you can click on that will let you know what to do. Otherwise, it stays out of site, for those who do not want hints. There is a WT on the Big Fish site for when you get really stuck. Not sure what the CE would have, as seeing I played #3 I knew how the story would end.",
            "review_score": "1"
        },
        {
            "review_text": "Overall I was very amused by this one - there are some delightfully tongue-in-cheek references to classic and more contemporary fantasy tales, and wandering the kingdom was a nice break from solving hidden Object games in rooms. This game will definitely be a treat for the princess in your life .. or your inner princess.",
            "review_score": "1"
        },
        {
            "review_text": "As some other reviewers wrote, this is not the collector's edition. So the end is a little 'whaaaaaaaaaaaaaaat'??? So if you can catch the collector's edition go for it or you are going to be a little disappointed. Anyway the game is good &amp; some puzzles are quite original. 7/10",
            "review_score": "1"
        }
    ]
}