{
    "app_id": 292910,
    "name": "Deponia: The Complete Journey",
    "release_date": "2014-07-08",
    "developer": [
        "Daedalic Entertainment"
    ],
    "publisher": [
        "Daedalic Entertainment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Commentary available"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Comedy"
    ],
    "achievements": 105,
    "positive_ratings": 2552,
    "negative_ratings": 359,
    "price": 25.99,
    "description": "Junk, junk and even more junk. Life on the trash-planet Deponia is anything but a walk in the park. No surprise that Rufus had enough of that and hatches one ludicrous plan after the other to escape this bleak place.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/292910/header.jpg?t=1524051835",
    "minimum_requirements": "OS: Windows Vista/7/8 Processor: 2.5 GHz Single Core Processor or 2 GHz Dual Core Processor Memory: 2 GB RAM Graphics: OpenGL 2.0 compatible with 256 MB RAM (Shared Memory is not recommended) DirectX: Version 9.0c Storage: 8 GB available space Additional Notes: Mouse",
    "recommended_requirements": "OS: Windows Vista/7/8 Processor: 2.5 GHz Single Core Processor or 2 GHz Dual Core Processor Memory: 2 GB RAM Graphics: OpenGL 2.0 compatible with 512 MB RAM (Shared Memory is not recommended) DirectX: Version 9.0c Storage: 8 GB available space Additional Notes: Mouse",
    "reviews": [
        {
            "review_text": "I will start out with some of the cons. This game can be very frustrating. A lot of the puzzles follow very illogical reasoning, so often it comes down to trial and error as you try to use everything in your inventory on everything in the world. Even then, this this game can be agonizingly difficult and it would be a challenge to finish this game without searching up guides to get through certain confusing areas.  In addition, there are quite a lot of glitches in this game, and though they are rarely gamebreaking, they can hamper your enjoyment of your game (for example, I have seen Rufus get duplicated for a while before the duplicate went away, and the sound disappearing).  That said, however, this game can also be very fun. The humor is great, and the story is interesting, non-mainstream, and engaging. The art style is great and fits with the humor perfectly.  For $40, this game might be a bit pricy, but I can tell you that this is definitely worth buying and if you are tight on your budget just wait for it to go on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Thanks to developers for linux support!",
            "review_score": "1"
        },
        {
            "review_text": "Deponia: The Complete Journey is a really good game and is highly recommended to anyone who enjoys adventure games. I'd give it a 7/10.  Pros: + Very lengthy and worth the price - ~30 hours + Hilarious most of the time + Excellent voice acting + Some very nice puzzles + Well thought out world  Cons - Puzzles can be obtuse - Mini-game puzzles are mainly terrible - Main character can be too much of a jerk to be likable - Unsatisfying ending to series  This is the closest to a Monkey Island game we have had in quite some time(well, other than Tales of Monkey Island). It's nice to see a company that continues to make adventure games, a genre that is still active, but less so than in the past.  Other than some incredibly obtuse and unsatisfying puzzles, the majority of the game is a lot of fun. I laughed, thought hard, solved puzzles, and had a smile on my face most of the 30 hour playtime.  I paid $6 for this game it was worth every penny. It has its drawbacks, but its positives far outweigh the negatives.  ",
            "review_score": "1"
        },
        {
            "review_text": "The homeworld of Rufus is about to sink in trash and getting blown into pieces. It is your turn to help Rufus escaping this hellhole called Deponia. With your high experience of blowing yourself up, ending heads down in mud and turning bad things into worse, you really can become the walking disaster itself.  Deponia: The Complete Journey combines all three adventures of the famous Deponia, well, trilogy (who thought that).  10/10 Everyday is trashday!",
            "review_score": "1"
        },
        {
            "review_text": "I got a medical prescription for a noose.  10/10 Love this game's humor",
            "review_score": "1"
        },
        {
            "review_text": "This game taught me something:  1. Life is hard 2. Life is not always fair 3. The things you need are always when you least imagine.   I really love this game, nice interface, nice story, hard af, so funny and a really good gameplay.  I'm just disagree about the end but... Guess what? Deponia Doomsday!     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "Great pont n click game!!! Beautiful graphics, great soundtrack and a thousands of fun! Great job!",
            "review_score": "1"
        },
        {
            "review_text": "What an excellent and complete package. One of the best P&amp;C's I've played since the golden age. For those of you purists out there that will never look to a walkthrough, buckle up for the long haul because this thing is meaty. Two big chucks of Chaos and Goodbye had me reaching to outside help quite a bit. Good characters, beautful locations (despite all the garbage) and and incredible sense of humor throughout. 10/10... would play again.  An excellent bonus for the complete journey package with Jan Müller-Michaelis (Poki's) commentary. It's hilarious and also manages to give an incredible amount of insight into how the game came together.   Poki likes minigames..... has he mentioned that?",
            "review_score": "1"
        },
        {
            "review_text": "Holy cow!!!!! This flipping game is what I have been looking for well forever. I had sooooo much fun playing through this hilariously well made game. There's twists, turns, ups, downs, and some inside-outs thrown into the mix. I had a blast playing through this and experiencing such a well made game. There honestly is no way I could possibly recommend this game any more than I currently am. If you are a fan of great story lines, lots of hours of playability, hidden easter eggs, outstanding comedy, and just down right fun, buy this game for sure!",
            "review_score": "1"
        },
        {
            "review_text": "When this intially came out I was really happy. I had already bought deponia and 100% it. Then I played this and it was completely broken. I waited a month for Poki and the gang to fix the bugs and everything has been gravy since then. This was awhile ago. I decided to hold off on the last chapter until redcently because I didn't want this amazing adventure to end. It was really awesome overall. Albeit confusing as ♥♥♥♥ at times.",
            "review_score": "1"
        },
        {
            "review_text": "Best value classic style point and click adventure game ever! Had played through the first Deponia and its a worthy game by itself, but all three togther in one pack is fantastic. Most similar type of game would be the secret of monkey island II, so if you like classic point and click adventure games with a sense of humour, you can't go wrong with this.",
            "review_score": "1"
        },
        {
            "review_text": "  Game is sooo hard, dialogues are humorous and funny and developers support you for any problems when you post at forums.  Probably the best support I've got compared to any other games. I hope they make more of rufus, I hope they make an RPG of this.  I've got so many hours in game but haven't even finished it yet.. game's harder than my MBA..",
            "review_score": "1"
        },
        {
            "review_text": "Good game, it reminds me The curse of Monkey Island In crazyness of the puzzle and in the humour. I have to point out two 'However's. The two first episodes, the sense of humor is absurd and hilarious. However, in the third one, it begins to be a bit repetitive. They haven't known how to give the freshness to the conclusive episode. The animatións are too simple. Whe two things have to be mixed the animation is always the same, no mater if you mix a knife with a fish or a blanket with an elefant. it seems tacky and careless.",
            "review_score": "1"
        },
        {
            "review_text": "I bought the first part years ago and played it for about an hour before thinking 'This seems kind of juvenile and dumb' (this is coming from someone who grew up playing and loves the Monkey Island series) and I put the game away for a few years.  Well I had a time coming up were I would not have internet access for a few months and decided to give the complete journey another chance and about just after the point I stopped playing all those years ago the game hooked me. I was smitten, I feel in love.   The main character, Rufus, who all those years ago I thought was just an annoying idiot with stupid one liners was actually a lovable and missunderstood goof. (I love myself a good goof.) Long story short I started to root for him.  To keep it short, it was a star-crossed love that spanned almost 3 years but I now regret the time I wasted not having his game as a fond memory.  If you like inventory based, point and click adventure games, with a lovable goof protaganist (like my childhood babysitter Guybrush Threepwood of Monkey Island) then this game is perfect for you. Its got a wonderfull, interesting, long, but well paced story, and a dozen unique characters. The humor can be a little eye rolling at times but after a while you start to understand that is all part of its charm and actually its overall story. But I will stop there before I spoil something. I hope you have a wonderfull adventure on Deponia!",
            "review_score": "1"
        },
        {
            "review_text": "Good story and great puzzles. Great game arts and the characters have been given personalities, which is good. Bugs here and there that makes the game crash, but that doesn't annoy me much as long as it doesn't do it all the time. Happened maybe four or five times during my whole playthrough.  I have played through it once and thought it was worth my time.  Some people does not like the game because the main character is a real jerk. Don't buy this if you think that are equally sensitive.",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of the best point-and-click adventure games out there. It's actually three games together with a few bonus, but it's a cohesive trilogy. What makes the game interesting is it's humor, present through the whole game, and some very interesting characters. The story is good with some twists even if the ending is a bit disappointing. Still, it is well written. The art and animations are great and the voice acting well-done for the most part. The music is also good. The gameplay is what you'd expect from this genre: click everywhere, talk to everyone, collect, combine and use items. There's also some interesting minigames. This edition also includes an interesting Developer's Commentary implemented in-game and a neat questlog. Regarding puzzles, i must say that the game is a bit hard and sometimes the solutions aren't very logical. You'll need to experiment a lot. But it's worth it. If you're a fan of this genre, this is a must buy, except if you own the separate games. If you're new to the genre, maybe this a great way to experiment point-and-click adventures. It may be difficult at times, but that's also a trademark of this genre. Still, buy it on sale anyway.",
            "review_score": "1"
        },
        {
            "review_text": "Plot Twist. Plot Twists are everywhere!",
            "review_score": "1"
        },
        {
            "review_text": "The trailers/pictures you might see will never correspond how good the game is. Being a point-and-click adventure, some people mighty think it's a thrashy game, they are so wrong... I won't dwelve into many aspects because I don't want to spoil anything, a game like this has its impact, in my honest opinion, for the ability to be felt as a first-time experience and leave you wanting for more. Pros:    Beautiful Art    Comedy during the whole playthrough    The hotspot highlighting (that helped me a lot during the game)    Awesome Story  Neutral:     Out of the box puzzles, some people might enjoy, some might think it's frustrating and have to resort to walkthroughs. Personally, I liked it.     Some minor bugs on hotstop detection (hovering the mouse over something and not detecting), but those kind of bugs happen in nearly any game, no matter the genre.   Edit: a new one has been out for a while and looking very eager to play it! Glad they made another one ^^",
            "review_score": "1"
        },
        {
            "review_text": "same fun as Deponia but x3 times. and achievements!!!",
            "review_score": "1"
        },
        {
            "review_text": "This review contains minor spoilers:  The Deponia trilogy reunited in one BIG game! Finally! It's a real pleasure to finally be able to get back into this wonderful point and click game!  If you are a newcomer to the genre, just know that with Deponia you'll never approach your everyday problems like before or see the world with the same eyes: Need to wake up your love ? True love kiss ? Hah ! Just pour a mega combo coffee in her mouth ! Your girldfriend's mind is divided into 3 personalities because of your lollipop cravings? No harm done, you'll figure it out... This game is filled with the most wackiest puzzles I've ever seen - who would have thought to turn down the music in-game so that the character would not be distracted while performing a secret knock? But don't think that the story behind all this is childish! Behind the wonderful art - head to DawnElaineDarkwood's deviantart, one of the artists of the game - lies a mature story: the characters are just great, the plot thickens every second and I never thought the ending would be so breathtaking!  For those who already played the game, you should still try to get this game, just for the dev commentaries and the bonuses! All I have to say left is Huzzah! Just play the game!",
            "review_score": "1"
        },
        {
            "review_text": "The Deponia trilogy is lovely drawn, has good voice-acting throughout, and quite a lot of nice puzzles. The world it describes really piques your interest. It has all the ingredients for a great point-and-click game.  So why shouldn't you buy this game for the full price?  Well, the game is very much story-driven, and the story is where the problem lies. The overall story itself is good, although it suffers from a really badly written ending. That alone does not warrant a negative review, but the devil is in the details. It feels as if a lot of the story details and puzzles were written without any concern for fitting in with the various characters' personalities. Deponia goes from touching kindness in one scene to ruthless human sacrifices in the other, all performed by the protagnist who is almost, but not quite, likable.  The impression I got from this game was that it was created by a talented team of game developers… and the puerile nephew of their primary financer whom they could not refuse to hire.  Get this game in the bargain bin during the summer or christmas sale though; it certainly has its good points.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice puzzle game with great story line, I like it",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Characters are halarious. Story is cute also funny and very cute. Puzzles are tricky, but not complicated.",
            "review_score": "1"
        },
        {
            "review_text": "Made me laugh as hard as when I first played Monkey Island.  Made me cringe as hard as Duke Nukem Forever with some of the jokes.  Made me stop and stare at the art work like I was playing Myst all over again  Made me rage as hard as when I played Contra with the ending, realising that there would be nothing more in this amazing world.  If you like point and click games, buy this.  If you don't, consider it.  If you like black humor, buy this.  If you hate games made by nilhistic Germans, avoid this.",
            "review_score": "1"
        },
        {
            "review_text": "Note this game is very cool but addicting game it has loads of replayablilty definitely worth while on daily deals or just sale :)",
            "review_score": "1"
        },
        {
            "review_text": "i love this game",
            "review_score": "1"
        },
        {
            "review_text": "Loved every second of it. Cut up dolphins, sacrificed children to some sewer monster, and cloned myself repeatedly, nothing like a little chaos to save the trashiest planet around eh?",
            "review_score": "1"
        },
        {
            "review_text": "This is my first review! I've just been replaying this game after playing through it a few months ago. The game is fantastic. It is the best point-click adventure game I've played since Maniac Mansion back on the NES. The characters are well developed, the play control is intuitive, the logic flow is tricky, but with just enough hints to get through. The story is seriously clever. You get really sucked into the plot. I started off buying just the first game. At the end, I immediately bought this...I should've just bought this set from the start.  The minor play control gripe I have is that the tutorial doesn't tell you that you in fact can skip a lot of the slow walking. If you are moving to a screen you've already been to, you can jump to it (sometimes called zip-mode) by just clicking the orange arrow a couple times. Also, knowing that the space button reveals all the trigger items is a wonderful feature that, again, should've been in the opening tutorial.  The only serious complaint I have is that the last I checked, you are unable to gift the game. I tried sending it to a friend only to find that I couldn't...it's weird when you want to hand over money but are unable...  If you like any of the classic Lucasarts or Doublefine games, seriously, just get this. Don't be scared by the fact that it's done by some random German game company you've never heard of. The english voice actors are all excellent, and the creator-sung song is catchy as Hell (Huzzah, it's catchy as Hell!)",
            "review_score": "1"
        },
        {
            "review_text": "The game is pretty funny. Unfortunately it is unplayable due to multiple heavy bugs.",
            "review_score": "-1"
        },
        {
            "review_text": "Let me start off by saying that I loved deponia. Adventure games to me were always more about visuals, themes, and stories than actual gameplay. This is why I can forgive the downright ludicrous puzzle solutions and poor animations. The complaints that the game is 'sexist' or 'racist' I believe are silly as well. They make it sound as if Rufus is aware that he is being an ♥♥♥, which you will quickly learn that he is always blissfuly ignorant of what is truely happening and the consequences of his actions. Back on point, the reason I am not recomending Deponia is that it's ending is a great big stab in the gut to anyone who was invested enough to finish the game by completely negating everything you worked for, solving NONE of the initial goals you set out for, and ruining what emotional value the game could of had by having a side character (that appeared in only 3 scenes if I remember correctly) explain why and what you should be feeling and then being subjected physical comedy.  Yes, I'm writing this review in an impassioned state of anger and frustration; I realize that might effect the validity of my review. Unless you want to end up like me, however, I suggest you just don't bother with this game. It will only leave you angry, dissatisfied, and with a little less hope for this industry.",
            "review_score": "-1"
        },
        {
            "review_text": "Frankly I feel dissapointed for spending so much time on this game. I really only have one thing to be said on this game...it has good production values. Maybe the music if nobody tries to add lyrics. But when it comes to story...oh boy just forget it and look elsewhere. ANYWHERE. This might have been worth it if the story had in any way come to paint the hero as a redeamable character...but any chances of that ends with the first part of the trilogy.  Rufus is the main character, and can be safely classified as a sociopathic anti-hero. The least of the things you will get to do as the 'hero' in joining Rufus on his journy would be to break up a black woman from her boyfriend and trick her into indentured servatude, turn baby dolphins into tuna, repeatably mind warp and physically abuse your 'love interest', poison your friends, and my personal favorite being FEEDING CHILDREN TO A SLIME MONSTER (tortilla wraps, gravy, and even puting them in the mouth yourself).   The 'jokes' are not funny, usually aiming for the lowest denominator. Expect sexism, racism, misogamy, and even gay jokes just to be hip. Expect our 'hero' to remind women to not be in a resistance movement, to consistently make fun of a speech impediment, to basically just throw words at you and jangle the keys. It's really sad that my personal dislike of Rufus and the jokes were so bad that even doing the tired 'crotch meets hard object' joke didn't even make me crack a smile. They even have their own laugh track out of nowhere for one scene...it's about as funny as it sounds.  So my final advice to you is to avoid this trilogy. I spent roughly 20 hours on it. I want my money, my time, and to wash myself of the whole experience like it never happened. It takes a lot for me to utterly find a character irredeemable and Daedalic has succeded of going even beyond that. To the point I now question the ethics of the developers themselves.",
            "review_score": "-1"
        },
        {
            "review_text": "Deponia: The Complete Journey is a very well made point &amp; click game trilogy that follows the story of an antihero called Rufus. Unlike usual game protagonists, he is a complete ♥♥♥♥♥♥♥ and his main motive is to gain something only for himself. The art is done very beautifully and clearly a lot of love was put into it, as well as the music. These together make all of the areas very unique and memorable.  As the story progressed, you learn that Rufus starts to slowly drift towards a more nicer character, even though he still does a few very selfish, mostly just ♥♥♥♥♥♥ deeds every now and then. However, all of this escalates to him having an immense change of character in the end, which didn't fit his character that well in my opinion. Since the game really doesn't offer any options in the story, forcing you to follow a single laid out path, I was hoping that a miracle would happen and reward Rufus for his actions, since luck seems to have been on his side most of the time, when he most needed it. But in the end, nothing happened. This really left me craving for a more satisfying end to his long and eventful journey. It made me feel like the whole game was for nothing, since the culmination never happened. Unfortunately, cause of this I can not fully recommend the game, since I felt like I lost more than I gained through the story.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to give this a thumbs up and be able to recommend it, because it really does have some awesome things about it. The tongue-in-cheek humor at times is quite funny, and Rufus himself is just .. well. so oblivious to his own nature.   The problem arises when you get to the final leg of the game. - Goodbye Deponia. It is just awful. In every way. For me, it ruined everything that came before it.  Rufus has always made inappropriate comments throughout the game and that was ok for the most part because it was part of his personality and there was no real malice behind the comments, just him being selfish and ego-centric as usual. In Goodbye Deponia, however, his comments begin to stray heavily to a malicious nature which was no longer funny, just insulting and offensive.   In addition, in Goodbye Deponia, they went too far, straying far beyond humour and deep into the realm of very bad taste. I literally sat there .. thunderstruck with utter disbelief .. trying to wrap my head around the content that involves June (&amp; Goon). The only black female character is sold to play the part of a monkey for the organ grinder who looks like an actual monkey. Just shocking. Then they have her almost naked and dancing for him.  The final straw was the horrible, horrible, horrible ending. I sat there and kept expecting something to happen.. until I saw it say 'The End'. Uhhhh. you can't be serious! Really? that's how it ends? It was an awful ending. The ending could have been salvaged by perhaps having multiple endings possible.. but nope. Just a really crappy ending. It killed the entire game.  I cannot recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME AS IT IS!  There are currently a number of game-breaking bugs that make it so you CAN NOT complete the game. Literally puzzles are broken, and some are completely unresponsive. Some of these puzzles can be skipped, but it takes away from the joy of besting the game system, or solving things yourself. The bugs are well-known and people have been directed to fix it by going to the Deponia site when they get stuck and download save games that makes you lose your own progression and places you roughly after the puzzle you want solved (but may have solved some other puzzles you didn't even get a chance to see).  This game seriously looks like it's got great story and a lot of heart and I REALLY hope that I get a chance to play it for real some day. Unfortunately I played too long already trying to figure out the issues to get my Steam refund.",
            "review_score": "-1"
        },
        {
            "review_text": "   The ending is a lame diabolus ex machina, just like Edna &amp; Harvey. The Germans have an ideological aversion to satisfying endings. No seriously, look it up the writer said so himself.  ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is very badly written. The dialogue and main character are extremely sexist and unpleasant. I gave it a good run hoping I could look past all the bigoted comments and general awfulness but I couldn't and requested a refund. If you're not bothered by grossly anti-femenist statements then it's your basic point and click game full of 'I never would have thought to use that there'. The writers tried too hard to be crass and edgy and came down on the wrong side of niche.  Don't play it. If you do play it, don't pay for it.",
            "review_score": "-1"
        },
        {
            "review_text": "Worth every penny. I wasn't much of a point &amp; click gamer, but this game is an exception! Hilarious, nice visual and interesting characters (especially the main character, annoyingly interesting). I didn't realised how much time I spent on it until it's 2 am.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished it... and honestly I'm very mixed. The entire game had me sitting on the edge of my seat. Throughtout games 1 and 2, and the majority of 3 I was absolutely absorbed, and honestly I could see that a lot of work was put into making the game[s] interesting and exciting (with a couple of rly cool eastereggs). If I had been asked at anypoint of my playthrough if I would recommend this game (excluding the last hour of so of gameplay) I would have responded 'Yes. Definetly, it is one of the best games I've played.' but after finishing it, I'm no longer as sure. Other than a very unsatisfying ending that does not fit into the overall genre of the game (which is mostly comedy/sci-fi), the game also leaves huge gaps in knowledge given to the player. One of the biggest sins that a writer can make, is introducing a new concept, a new idea, a new revelation, in the conclusion. And many such things are done within the last hour of game 3. Charectors randomly transforming into each other, things disapearing, things randomly apearing, an overwhelming amount of teleportation, and other things I can't agree with.  Game 1 makes a promise that Rufus will fight his fate with all his might, that his ego, his personality refuses to lose, that he will not be kept down or chained to a planet of filth. Game 2 makes a promise that Rufus will not hurt those around him, at least not on purpose, (with the exclusion of tricking people into electrocution, that's totally fine for some reason) but It restates that he will not give up, not even when it's hopeless. Game 3 confuses the everloving crap out of any sort of logic you may try to use. It creates question after question after question, and then instead of giving us some anwsers in a clever and meaningful way (as I had started to expect), it throws an ending that feels pasted on [and not even much like an ending] at us. Even ignoring the heavily unsatisfying ending, Rufus breaks everything that he as a charector stands for, and becomes what would be a true hero, even though it completely contradicts everything that he as a person, and as a charector stood for. He finally decides to give up. No crazy sceme, no sleigh of hand, nothing of what he stood for or represented. Just a flat, boring, cliche hero ending.  'Goodbye Deponia' never really manages to feel like a goodbye. It just feels like I need to open up game 4, even though game 4 does not(and the dev. promised that it will never) exist.  Tl;Dr: Game 1 - Outstanding 9/10 would play again in several years Game 2 - Great 8/10 would play again. Introduces lots of new things to keep a long game from getting stale Game 3 - 4/10; Plot-Twist reveal mid-game actually quite obvious; Ending leaves more questions than it anwsers (and not the good kind); Unsatisfying End Nevertheless, most certainly worth a try, if only for the jokes and cool animations.  Edit: Post contemplation I realize that the game is perfect the way it is, and that the ending leaves millions of questions, because the anwsers to them don't really matter, and in your head you are allowed to craft your own ending with such amounts of freedom that you are given, however retaining it's motion and impact. This game was the first one I have ever played, that has given me a sleepless night not because of fear, but because of conteplation. 10/10 to the series.     ----Actual Spoilers---- The two main problems I had: 1 - Seagulls wife, 'Mom' is never actually spoken of except in the one moment when it is used to ♥♥♥♥ off Seagull towards the end. It seems to be a huge part of Rufus' motivations and a very large reason for him being the way he is, but she is never spoken of except as an appreantly plugged in reason for Rufus to push/test Seagull. Considering the importance of Rufus' father to his charector, it should be assumed that a mother would be even more impactful (or at least as much so). 2 - Dead goal falls out of closet. Alive Goal on boat. Goally turns into Donna. This means that A-Donna is a clone, otherwise there would be no reason for Goally to be Donna. B- Writers ♥♥♥♥ed up, cus without cloning you can't have 2 Goals - one that fell out of the sky with Rufus and one that didn't  additional sins:  The three kids? apparently 2 got eaten, but that's perfectly alright with everyone. Cletus jumped? but then ended up behind Argus with a weapon. Goal is happy? It's quite ovious that she knows Rufus sac'd himself for the greater good, but she seems happy about it? The Elders are cool with taking a bunch of hobos on their luxury cruiser? that seems like a huge point of conflict that was just glazed over. Cletus became Rufus? for the last couple of dialogue options Cletus loses his accent and sounds exactly like Rufus, which can make one wonder..................... a briliant move theatrically, but with unclear intent. Especially since Cletus/Rufus seems to be very excited and happy about his new role and his lousy ideas. Cowboy Dodo and the vainishing prison doors? Considering Cleetus managed to get out of prison and onto the organon cruiser, one would think that Dodo would manage that as well simpy by following him, but everyone from the prison except Cleetus simply ceases to exist. 'Goal.' 'Toni.' What did I miss here..... I don't remember them ever meeting before that moment.... At least not while Goal was conscious... Awake? Srsly, the main heroine spent about 2.5 of 3 games being either impaired or dead... Or in game 3, both.",
            "review_score": "1"
        },
        {
            "review_text": " Deponia: The Complete Journey  is a trilogy of old-school point-and-click adventure games, all wrapped into a single executable file for your convinience.  The story revolves around Rufus, a self-proclaimed genius, a tinkerer, who lives on planet Deponia, covered with trash ( Deponie  is a German word for  garbage landfill ). One day, he tries to put into motion another one of his plans to reach Elysium (a   spaceship of sorts   that is hovering above Deponia and where lives the elite). But (of course) his plan fails again and results in Goal, an Elysian girl, falling down to the surface of Deponia. The rest is about the misadventures of Rufus, Goal, several reccuring characters - how they try to get back to Elysium and what discoveries they make in the process.  I found the jokes in this game to be absolutely hilarious, however that depends on whether you like crass and dark humor or not - there's quite a lot of such humor. And not only the dialogue is funny, the animated sequences contain some funny slapstick situations as well. There are a few (like, a dozen for the whole 30+hrs trilogy) swearwords (which I did not expect), but who cares?   The voice acting (both English and German) is top-notch. I prefer German voiceover, but the English one is just as good - I switched back and forth b/w them a couple of times.  The game is very beautiful, that is if you are willing to overlook low-budget animation drawbacks - sometimes you can feel that there is not enough frames drawn for this or that action to look satisfying. The backgrounds are absolutely gorgeous though.  The puzzles in this game are satisfiyngly difficult, for the most part, which is a good thing. Some of them were, however illogical (like the one with the Yrk and the paper plane, or the one involving the conveyor belt   in hell  ). This is a minor drawback. but still I had to look in the guide a couple of times. For the most part though, the puzzles are creative and you just need to think harder to solve them. A lot of interesting minigames are there as well.  This edition could use some more polish, the game freezed on me a couple of times, which lead to some loss of progress. However not much progress was lost in either case, the game autosaves at important plot points by itself - just make sure to click 'Continue' and not load your last savegame. The text boxes for the commentary sometimes shifts to the right part of the screen, instead of a text box frame. But those are all minor drawbacks, which I am sure will be fixed with a patch.  The community seems to be split about the ending, however I find it brilliant and very cleverly written.  Overall, it's a very enjoyable adventure with a great story, great humor, brilliant plot twists and smart puzzles. I recommend it to any point-and-click adventures enthusiast.",
            "review_score": "1"
        },
        {
            "review_text": "Overall a very good game. A solid point and click adventure. Sometimes, the game did leave you with no direction or hint as to what to do next leading to the frustrating situation where you are clikcing everything hoping something works or you just go look up a walkthrough for a hint. The story was good and complete. The art and music were phenominal. For the price, I definitely got a solid amount of gameplay and storytelling out of it.  My only complaint would be the ending which was quite disappointing for such a grand story, but that shouldnt take away from the overall quality of the rest of the game.  If you like adventures, point and clicks, or great stories I definitely recommend this(especially on sale).",
            "review_score": "1"
        },
        {
            "review_text": "Very funny adventure game with good voice-acting and puzzles. Interesting story aswell.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for something similar to the Monkey Island series, this could very well be exactly what you're looking for. The Deponia Trilogy manages to capture a very unique feel as far as the story and characters go. The scenarios and dialogue can be quite humorous and the animation and gameplay are very similar to The Curse of Monkey Island. Rufus (the main character) is certainly no Guybrush Threepwood though. He isn't nearly as likable and comes across as ridiculously arrogant. It can be amusing at times but mostly it's annoying. He does grow on you after a while though and you'll be rooting for him by the end. I should warn you though, this game is NOT for kids. Although humorous, there are some adult references and language throughout the story and the final installment contains two F-bombs as well as a 'motivational' speech that draws all of its humor from swearing, so bear that in mind if you plan on letting a younger audience play it. Overall, I would give Deponia: The Complete Journey 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game have everything that I miss from the new age point and click games: -Cartoonish grafic... check! -Unpredictable, selfish, jerk who will become the true hero... check! -Wierd but clever puzzels... check! -Reference jokes... check! -Recurring jokes... check! -4th wall jokes... check! -jokes which cause people to go hate war because they are tend to overreact everything because they don't have anything to do in their miserable life... check! -Superb voice acting... check! -Unforgettable side characters... check! -Ending which    make you cry in sorrow and joy at a same time  ... check! +mini games   If you love the Monkey Island, Sam and Max and a Maniac Mansion seria, you shouldn't left this masterpiece out of your collection.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely loved this game!!! I totally fell in love with the characters! Buy it! You won't be disappointed! (until it's over)",
            "review_score": "1"
        },
        {
            "review_text": "Deponia is essentially Monkey Island for a new generation. Strong characters, strange situations, clever solutions, and a classic point-n'-click feel with an art style all its own, I found the trilogy deep, immersive, challenging at times, and definitely a good time.  If you like the genre, this is an ABSOLUTE must have!",
            "review_score": "1"
        },
        {
            "review_text": "Playing last act of Deaponia is like telling Fairy Tale to your children. At beginning everything is Upsy Daisy, but later it's like Main Character is betrayed by best friend and died, his Girl r*ped and enslaved and World ends in fire. Kids tell you to stop, but you tell them the story to end and later on they can't sleep alone for next half a year. Well, that's how i felt after last chapter of Daeponia.",
            "review_score": "-1"
        },
        {
            "review_text": "Slow pace, uninteresting story, antipathic 'hero', far fetched logic and all that in a rubbish tip if you please! I've tried to go as far as possible, I even got out of the tip! But I ceased playing because of the unsufferable personnality of the hero.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought Deponia a while ago when it was on sale, but just got around to playing it yesterday. I believe I just started the second part of the trilogy.  Deponia is a point-and-click adventure game with futuristic and steampunk elements. The protagonist, Rufus, is a lazy scum bag who is perfectly happy mooching off others. However, due to events he finds himself wrapped in (partially by his own doing), he gets wrapped up in events much larger than himself and becomes the unlikely hero that the story needs.  Seriously, I have almost nothing but good things to say about this game. The aesthetic is charming, cartoony, and with a soundtrack that captures the setting well. All of the characters are engaging and fun, especially Rufus, who does progress with the story. Voice work is good, and the characters have voices that suit them well.  My one complaint is in the puzzles. Sometimes, the puzzles are too easy, where other times, there is no indicator in-game on how to reach the solution. Most of the time, trial and error worked well to get over hurdles.   Overall, this game is great.",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me of the old sierra (space quest, kings quests, etc) point and click adventure games. Only this is way harder in my opinion. In fact, if you can finish this game without cheating by looking up hints online, then i say you deserve a trophy for being the best gamer ever. Some of the puzzles later in the game are sickeninly hard, wtih hints that are so obscure, that I dont see how anyone would see it without cheating a little.  I still recommend it, because the funny dialogue alone is worth it. The only game I have played with funnier dialogue is DeathSpank, which is a much better game. Get Deathspank first, then maybe get this if you need a laugh.",
            "review_score": "1"
        },
        {
            "review_text": "it's fun and intersting",
            "review_score": "1"
        },
        {
            "review_text": "random skits with good mild humor clicker.. quite hard to find the hints since this game do not always follow logic, like chewinggum and clothhanger makes a bow or slingshot for example.",
            "review_score": "1"
        },
        {
            "review_text": "Personally I really liked the first few hours of the game. Although it crashed on me numerous times (because my laptop wasn't up to snuff) I really enjoyed the humor, story and puzzle elements to it...  Why I think it should win the selfdeclared 'Oversea' award is because it is a damn well made game with handrawn characters and backgrounds... which wasn't made in America norr England. So for that I would give it the 'Oversea' award.  P.S.: Yes this is my first review and yes I'm not good at it...",
            "review_score": "1"
        },
        {
            "review_text": "Deponia: The Complete Journey is my favorite game/game collection.  I have laughed playing this game, and I have cried  10/10 Chorus Guys  10/10 Rufus",
            "review_score": "1"
        },
        {
            "review_text": "Worth every penny in my pockets.",
            "review_score": "1"
        },
        {
            "review_text": "this is the best game EVER!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best point and click adventure games to come out in the last few years.",
            "review_score": "1"
        },
        {
            "review_text": "Quirky and funny. However, humor is of darkest kind. You could call it a parody of old school adventure games. Save the world... having only your own best interests in mind. Exploit your friends and ruin innocent peoples lives - all for a good cause and guilt free. You might hate yourself afterwards, but the main protagonists ignorance and self centeredness won't let him even notice the price others are paying on his way to the promised land and love. Rufus is like an anti-hero, a hateable character, and yet, through out the saga, you get attached to him. You even route for him. He's like your own lovable monster.  And the whole game is just like Rufus - colourful and interesting visually, quirky and jabby story wise, unaware of how ultimatelly dark it is between the lines.   ",
            "review_score": "1"
        },
        {
            "review_text": "I laugh. I screamed. I cried. I died. I platypied. 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Can't get my savegames from Cloud. Have 2,78MB on Cloud. Pretty sure it is savegames from PC. Now I'm trying to play on Mac. But there are no savegames. Great! Game from 2016 makes me happy!",
            "review_score": "1"
        },
        {
            "review_text": "“You, tell me why, the game is worth a buy. And if going through the game will a chore.” I’ll tell you with honesty, it is of good quality! The puzzles are fun but some may be obscure.  But my recommendation has really cool animation. It has story and humour and you’ll have to use your brains! Even without a strong discount,  it won't empty your bank account! Your time is well spent playing the mini-games!  HUZZAH! I LIKE MINI-GAMES!",
            "review_score": "1"
        },
        {
            "review_text": "This game contains the three first Deponia games in their entirety, but connected together almost seamlessly, and with added developer commentary (activated per-screen only, so you can safely ignore it if you don't want the behind-the-scenes stuff). You can really tell that Sierra and LucasArts of the 80's and 90's have inspired the humor and gaming style for all of the Deponia games, and it's wonderful to get a feeling of these games. If you buy this game, you don't need to buy 'Deponia', 'Chaos on Deponia' and 'Goodbye, Deponia', although I still did (part because I wasn't sure they were all remasters of the three first games, and part because it's a quality game series which Daedelic deserves the extra cash for). In short, if you liked the original Monkey Island series, the King's Quest series, the Space Quest series, Day of the Tentacle, etc, you'll most likely enjoy the Deponia series.",
            "review_score": "1"
        },
        {
            "review_text": "You want great humor, great voice acting and a great story? Maybe some junk too? Then this is your game! I personally think this is a 'must-play' because it's funny, creative and a challenge. You have to think out of the box to complete cute/hilarious riddles that sometimes have a very dark humor. It's one of my favorite games to be honest with some of the most creative and interesting characters in a video game you'll ever meet. Starting with Rufus, who you play. He is a genius with no social skills whatsoever. He also has no conscience, which is great for you. But my favorite character will always be Toni, his angry hot-headed ex-girlfriend. She's so much fun to interact with and I fell in love with her, even though she has a bad temper. But I'm not going to spoil anything for you - just play the ♥♥♥♥♥♥♥ game already!",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic! Really reminds me of the good old point and click games.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Funny unique characters, unique plot and world, and challenging puzzles are amazing contents of this game. I couldn't recommend it more.",
            "review_score": "1"
        },
        {
            "review_text": "Well I've enjoyed it.  Came into this pretty cold on an impluse buy. Since then I have really enjoyed myself. Exactly how hard the puzzles are I can't really say as I don't think I have played a point and click adventure since last century. Some defeated me by the extreme out of square thinking required, some because I failed to notice the first, second and third time there was a new item I could interact with or that there was a part of the screen I was allowed to move to, but most of the rest I proudly logiced my way through without needing cheats.  While I did use a bit of 'help' I felt little guilt over as I was desperately interested to see where the storyline was taking me. At time of writing I have only finished the first of the trilogy but have found the story and characters much more enjoyable than some of the other games I have been playing recently.  Few annoying bugs. My inventory pull down icon has disappeared when entering new screens a couple of time and having loaded my last night save the entire cursor seems to have upped and left.  I did buy this game on sale at a significantly mark down, which probably has a lot to do with me believing I am getting my money's worth but overall my past 13 and a bit hours have been a lot of compelling fun and, for a game billed as a comedy, I have actually spent a lot of time laughing.",
            "review_score": "1"
        },
        {
            "review_text": "Simply brilliant :) Ive been waiting for an adventure game like this for AGES :)) And its finally here! Rufus is so funny and original :) Definitely a must buy!",
            "review_score": "1"
        },
        {
            "review_text": "What just happened... hours of my life have passed and i have managed to beat the 1st lvl... wait, what? theres more lvls. this is going to take a while. if you ever played king quest series back in the 90's and loved it, well this is one of those titles you missed. its a game of memory and concentration, remeber where you clicked and remeber to stop clicking in the same spot 5 million times because you cant find the next spot on the map to continue to the next part. aaahhh common where is it! XD",
            "review_score": "1"
        },
        {
            "review_text": "Deponia is a great old style graphic adventure, with a lot of nonsense but in a good way. The first chapter is somehow the weakest, then it flies to high skys!",
            "review_score": "1"
        },
        {
            "review_text": "I just love this game! The best point'n'click I've played. If you're not sure if you want to buy it, trust me. You want it.",
            "review_score": "1"
        },
        {
            "review_text": "The first part is really good, the second one even better and the third starts off quite promising - but trust me when I say that the ending is just about the worst one I know. Yes, I played Mass Effect 3. This one is far worse. I also don't think that the 'June Puzzle' was a good idea, but well, that's just me.",
            "review_score": "-1"
        }
    ]
}