{
    "app_id": 292990,
    "name": "NOBUNAGA'S AMBITION: Souzou (Traditional Chinese version)",
    "release_date": "2014-08-01",
    "developer": [
        "KOEI TECMO GAMES CO., LTD."
    ],
    "publisher": [
        "KOEI TECMO GAMES CO., LTD."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Historical"
    ],
    "achievements": 0,
    "positive_ratings": 413,
    "negative_ratings": 74,
    "price": 17.99,
    "description": "The latest title in the historical simulation series &quot;Nobunaga's Ambition.&quot; Become a daimyō of the Warring States era, and unite the land! With &quot;the creation of a new age&quot; as the key concept, this title features beautifully recreated castle towns, dynamic battlefield action and dramatic event scenes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/292990/header.jpg?t=1550179336",
    "minimum_requirements": "OS: Traditional Chinese Windows® 7, Windows® 8, Windows® 8.1 Processor: Pentium®4 1.6GHz Memory: 256 MB RAM Graphics: VRAM 128MB or better DirectX: Version 9.0c Storage: 5 GB available space Additional Notes: This game is only supported for Traditional Chinese versions of Windows® Vista, Windows® 7, Windows® 8, Windows® 8.1.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Excellent. However, I am playing by my rudimentary knowledge of the kanji through Japanese. The Japanese dub is extremely helpful. PLEASE launch a Japanese language patch soon. I would very much love to see an English port eventually so all of my English speaking friends can enjoy this wonderful title as well.   Everything I have hoped for from Koei's legendary title. This game lives up to the legacy and expands upon it,   10/10  Flawless victory.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love the power-up edition. The music is terrific and taking over the whole of Japan (after nearly 30 hours of play) just give you an unexplained sense of satisfaction. And finally, a gameplay mechanics that let you form an alliance to re-enact battle of Sekigahara.",
            "review_score": "1"
        },
        {
            "review_text": "Looks like a nice game too bad its not in English .",
            "review_score": "1"
        }
    ]
}