{
    "app_id": 293320,
    "name": "Coma: Mortuary",
    "release_date": "2014-05-12",
    "developer": [
        "Nova Dimension",
        "Naga Entertainment"
    ],
    "publisher": [
        "Naga Entertainment",
        "Nova Dimension"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Horror",
        "Indie",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 480,
    "negative_ratings": 415,
    "price": 4.79,
    "description": "Coma:Mortuary is the introduction part of a trilogy about events in the world of the dead. The game`s genre is Adventure-Ambient with Horror-quest element.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/293320/header.jpg?t=1514320397",
    "minimum_requirements": "OS: Windows XP SP3, Vista, 7. Processor: 2.0+ GHz processor Memory: 2 GB RAM Graphics: NVIDIA 6000 series or higher graphics card DirectX: Version 9.0 Storage: 4 GB available space Additional Notes: Not tested on Windows XP!",
    "recommended_requirements": "OS: Windows XP SP3, Vista, 7. Processor: 3.0+ GHz processor Memory: 4 GB RAM Graphics: NVIDIA 7000 series or higher graphics card DirectX: Version 9.0 Storage: 4 GB available space Additional Notes: Not tested on Windows XP!",
    "reviews": [
        {
            "review_text": "This is an odd game at first look. It doesn't appear to have any direct action (i.e. fighting and interaction is minimal), it doesn't really have puzzzles in the traditional sense... But what it does have is a Gothic chic like me's dream atmosphere! Creepy stone worked and long dark hallways, strange scurrying in the blackened corners, dripping moss, ancient angel statues, even giant centipedes!!!!! What girl could ask for more? And, best of all, one has a chance to basically explore The Land of the Dead. Very cool!! Throw in an excellent, mostly Ambient soundtrack (one Black Metal sounding song does play too at one point but other than that, all Ambient), and Viola! You have a very dark and almost fable like tale. I say 'fabel' as it has a moral message, not an annoying one, but one which makes one think of ones life. It does have an issue with ending too soon and I think this is because it was intended to be a two part game. I do not know if the devlopers are working on Part 2, but I truly hope they are. It is a graveyard rich, dark, and spooky explorer horror game is how I would assign a genre to this game. To top it off, it has a cool tale which the main character (you) tells as you walk through this dark world, which I greatly enjoyed. Definitely worth a look for horror fans like me~ 8.5/10 For basic game play, graphics, and storyline. To be honest, I love this game but I am frustrated it does not appear to have it's part 2 yet. It is a bit like only reading half a good novel. So 8.5, not 10.",
            "review_score": "1"
        },
        {
            "review_text": "This was a odd game. Had mix feelings for it. Def not worth 6 bucks.. It is a big walking simulator. It is a game that is short and will consist on series due to the end says 'to be continued'. Because of this, the developer will be making another game similar to this instead of adding on to this game in which i can not consider it a game.. But for the concept of the game i liked it. Not to many games have a concept of the world of the dead. Get it when its 50cents  Pros: Nice graphics Okay story Concept art BEAUTIFUL Music  small puzzles. FInding levels and mazes Great voice acting  Cons: few unexplained deaths Plot boring Can run. In game you walk short",
            "review_score": "1"
        },
        {
            "review_text": "Pretty terrifying but slow to start of :D amazing game for $2.99",
            "review_score": "1"
        },
        {
            "review_text": "For me, one of the best Adventure/Horror game I have played in a long time. For those who haven't played it yet, trust me, it's worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Pros- Atmospheric, a few scares, has potential story-wise.  Cons- Slow pacing, insipid puzzles, subtitles are difficult to read.  Worth it at the 90% off price, would recommend waiting until all episodes are out, am doubtful game will ever be fininished with the lukewarm reception this episode received.",
            "review_score": "1"
        },
        {
            "review_text": "Has a few good horror elements. !!!DO NOT PAY FULL PRICE!!! - wait for it to be on sale  Pros: Interesting storyline fun - in the sense of it being rediculous thus being fun.  Cons: the guy walks slower than my dead grandmom starts out creepy, turns out to be a bith meh scarefactor definitely under 9000 :/",
            "review_score": "1"
        },
        {
            "review_text": "This game is a walking narrative kind of like Dear Ethster. Its got a few puzles to solve that are prety easy but for the most part its very linear. I really enjoyed the story and I guess this is part one of three. I played it for about an hour and a half and finished it. Tho it is linear there are a few moment where the game made me jump a bit.",
            "review_score": "1"
        },
        {
            "review_text": "Like skyrim with flashlight 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Coma: Mor - turtle - ary  Why parodize a title? because you are SLOW. And by slow I mean extremely tortoise snaily slow.  +: graphics are alright, concept art is amazing. story is ok - too much info/too many features - you get lost in it. And doesnt expand, narrating is decent  - : walking speed, can't jump(you can get stuck), bugs here and there, not knowing cause of death sometimes, transition between 'chapters' or parts of game (I ended up saying 'how did I get here' multiple times, it is short  not worth full price, but you can grab it on -90% or something. 4,5/10, curious about other installments (it says part one of a trilogy in the description)",
            "review_score": "1"
        },
        {
            "review_text": "THIS GMAE IS SO ♥♥♥♥ING SCARY AND IF YOU LIKE HORROR GAMES YOU WILL LIKE THIS GAME FOR REAL I HAVE PLAYED IT FOR LIKE 5 MINS AND IM ALREADY ♥♥♥♥ MY PANTS FOR REAL ",
            "review_score": "1"
        },
        {
            "review_text": "1 hour gameplay. Worth 1$.",
            "review_score": "1"
        },
        {
            "review_text": "I'll start off by saying this, only get this game ON SALE, 50% off or more!!! Having said that, this game is the epitomy of the 'short but sweet' saying. Yes, it is very short, I beat it in less than an hour, but, that's also this game's strong point, since the story is quite simple, and so is the gameplay and it's broody and heavy atmosfere do weigh on you, or at least it did on me, so having it go on for five or more hours might have broken the game rather than improved it. Although, since this world they created is so interesting and rich with detail and backstory, mostly spewed by the main character as he wanders the depths of the mortuary(world of the dead), it did feel a bit TOO short, having it last twice the amount of time, with more story, of course, would been better though.  Still, with a price drop I can't recommend this more. Great atmosphere, solid art and design, interesting levels and a rather deep world setting.",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me of a place i remember as a child called Fun Zone. An overpriced indoor playground Where any possible fun was ruined by the angry teenage attendants constantly yelling 'NO RUNNING!!!!'. The movement speed is painfully slow. Add a run function, and the beautifull graphics would be worth experiencing. but until then i can't come close to recomending.",
            "review_score": "-1"
        },
        {
            "review_text": "It's an aesthetically appealing game with some nice visual impressions, but unfortunately, that really is all there is.  This is best described as a 'walking simulator', where all you do is move from area to area looking at things while the narrator describes lots of scenes that you wish you were involved with. The thing is, there were plenty of times where walking itself was boring and there was nothing to look at and no narration to listen to.  It all seems like an interactive teaser to a game that could be quite an interesting experience, but that hasn't quite been completed yet.  Odd music choices, monotonous movement and an unclear '2deep4me' kind of story - Wouldn't really recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "[Playtime won't add up if you play in Steam's offline-mode] Can't recommend this even for 60 Cent (€) at Summer Sale. I really liked Dear Esther and Spate, but this walking-game steals your control now and then, and tells you what to see and when to be scared (like in Amnesia). And that's ****** for a challengeless storytelling-only game. Wait for the movie...  Summer Sale 2016 Edit: Now this game drops Trading Cards. 5 of them. One per hour!! Keep that in mind when you see the playtimes. As far as I know this game is just one hour of content.",
            "review_score": "-1"
        },
        {
            "review_text": "well, what a ♥♥♥♥♥♥♥, can't interact with anything which makes the game last longer i suppose, but also renders it unplayable.. what a gyp! no wonder it was so damn cheap!",
            "review_score": "-1"
        },
        {
            "review_text": "After several minutes of gameplay i had a thought: 'why this ♥♥♥♥ is on steam?'. It is boring, every room looks the same, you're slow (because you will play this game longer ofc), jump scares are crappy and you die every 30 sec or so just because you turned into wrong room. A room that looked exactly the same as the one you just left. Plot probably doesn't exist or I haven't found it yet. Graphics is bad, and the game has sudden FPS drops for no reason. 'Music' and screams in the backgound aren't good at best. The only plus (for me) is that i got it for free. Do not buy it, don't even consider it. Not worth it. tl;dr If you're looking for Amnesia/Penumbra clone, this is propably not the thing you might want. Avoid it.",
            "review_score": "-1"
        },
        {
            "review_text": "Movement speed sucks so bad. The story is slow and boring to go with the walking. The voice actor sounds like he is trying to sound like captain Kurk most of the time. I made it through stage one and the speed of the walking and the slowness of it all bored me i didn't even bother to finish. Sorry to say a thumbs down from me and when i got it i had high hopes.",
            "review_score": "-1"
        },
        {
            "review_text": "Looked interesting on the store page, had a slow start and then the engine crashed about 20 minutes in. To be honest, I'm not interested enough to try it again, but it didn't seem like a game I can recommend from what I played which is a shame. *",
            "review_score": "-1"
        },
        {
            "review_text": "This was by far the stupidest god damn game I have ever played, I spent 1 hour (which felt like 99393987598435209 hours) listening to  freesound.org  on repeat and a ♥♥♥♥ing ♥♥♥♥ ass narrator talk about death or some ♥♥♥♥. Here's everything that happened:  -Walk -.PNG spook ghost -.PNG spook ghost that chases you with 3 ♥♥♥♥ing animation frames -The end  And I'm not including every ♥♥♥♥ing cutscene where it legit looks like you're still playing the game, What would make me recommend it? If you have a longing obsession to commit suicide, this will really doot your ♥♥♥♥ing snoot. --- When I was a young boy, my mother had left my dad and I, and my grandmother was my only real mother figure. Yet, she had this really bad smoking problem, which my dad and I tried to make her quit. Despite our efforts, she eventually devolped mouth cancer, and ended up dying. My father told me that this should be a lessojn; to never smoke. To avoid what had happened to my grnadmother. So I've stayed clear of cigarettes for years; yet this still somehow gave me ♥♥♥♥ing mouth cancer.",
            "review_score": "-1"
        },
        {
            "review_text": "Remembers me on a (bad) book that i read a long time before. everytime you nearly fall to sleep and than a middle class interessting passage came.",
            "review_score": "-1"
        },
        {
            "review_text": "Pro: some things in the environment look nice, like braziers and pots. Con: slow walking speed, inability to crawl or jump to get past 'obstacles', short length, incoherent and unfinished story, few boring puzzle elements that make no sense storywise, ugly 2D people and other 2D things, bugs, many cut-scenes, inability to interact with the world.  Not worth the money even with 90% discount.",
            "review_score": "-1"
        },
        {
            "review_text": "[Pros]  -The drawn intro video is very nice.  -It have nice environments. I didn't expect to look so good for an indie title. Especially the beggining of the game.  -The game tell the sad story of a man no willing to live anymore and he kill himself by driving his car to a cliff [I think]. Then he suddendly wake up to a strange place which of of course the place is the afterlife. The narration is very interesting, telling us how the world of the dead work. I was more interesting in the lore than the game itself......  -It does have some 'scary' moments. Not very scary, but it was a good try I guess.  [Cons]  -Hah? The character walk a little slow....well, this doesn't bother me so much. I will keep playing. *after 15 minutes* WALK FASTER YOU PIECE OF SH*T!!!!!!!!!!!!!! FASTER YOU MOTHERDUCKING SLOWPOKE OF PINK ♥♥♥♥♥♥ POKEMON SPAWN!!!!!!!!   -Don't move the camera to make it more scary!!!! Let me have the control of the character.....  -Even if I said the environments look good, at some moments in the game you look the 'true' quality of the game..... I mean.......COME ON!!!!! 2D spites for humans?!?!?!?!?!?!? really!!!!! This is just awful.......  -WHY THE F*CK I CAN'T PICK THE KEYS?!?!?!?! WHY!?!?!?!?!?!?!  Too short.......TOO SHORT!!!! I don't even needed a hour to finish the game! I just couldn't believe it!!!!!  It is just 1 Episode.......I feel incomplete knowing I DON'T want to play the other Episodes......  [Final Thought]  I am SO disappointed with this game! I just wanted at least to feel satisfied being a VERY small game..... It have some cool things, like the interesting lore of the game. Sadly the story in overshadowed by the painfull slow walk of the character. I can't believe it myself. In other words, don't buy the game. Not even for 0,60 euros I bought it.....Only if they 'fix' the game somehow. By 'fix' I mean to make the character walking FASTER!!!!  3/10",
            "review_score": "-1"
        },
        {
            "review_text": "This episode is very short, from the looks it took 1.2 hours to finish, It drove me crazy at times at the slow pace of the walk. There was a few scary times but the annoying pace of it all, along with the interractive parts took the enjoyment out of it for me.",
            "review_score": "-1"
        },
        {
            "review_text": "broken/10  A psychological Horror Walking Simulator. I was enjoying my playthrough despite a cupple crashes. Then i got to a certain area where the game broke and i couldn't proceed. What did it was I got to a simple puzzle where i was supposed to pull some levers, and for some reason the game wouldn't let me pull this one that i needed to proceed. I even looked up 3 different walkthroughs to see if I was doing it right and all 3 walkthroughs were the same. I tried restarting the game multiple times and kept getting stuck. It's a real shame because i really enjoyed the atmosphere, and was genuinely creeped out at some points. This game also has an amazing soundtrack. But whats the point of all that if the game was broken and i can't proceed? If i can find a solution i'll change my tone about this game, but for now i can't recommend it based on my experience with it. It's obvious that other players have managed to beat this. so hopefully i can find a way to fix this.",
            "review_score": "-1"
        },
        {
            "review_text": "I play this game because I was told that this game is fun, but the first play. It's bad for me",
            "review_score": "-1"
        },
        {
            "review_text": "This is just wank. I mean, screenshots look nice, but there's a good chance that the engine is doing most of the job.  I got it out for less than a dollar, but even then it really isn't worth your time (just play some freeware walking simulator or one of those face-cam horror survivals)",
            "review_score": "-1"
        }
    ]
}