{
    "app_id": 293840,
    "name": "Cult of the Wind",
    "release_date": "2014-06-30",
    "developer": [
        "North of Earth"
    ],
    "publisher": [
        "North of Earth"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Workshop",
        "Partial Controller Support",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 220,
    "negative_ratings": 212,
    "price": 7.19,
    "description": "Cult of the Wind is a game about people who pretend to be airplanes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/293840/header.jpg?t=1447804903",
    "minimum_requirements": "OS: Windows XP or newer Processor: 2.4 gHz Intel or AMD Memory: 2 GB RAM Graphics: DirectX 10 with Shader Model 3.0 DirectX: Version 10 Network: Broadband Internet connection Storage: 400 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is my first ever review so...  WOW, it's all i can honestly say. Yeah at the time of writing this review ive played one hour but during that one hour i have faught and won many a battle, and used many a power up. The pick ups are what really make this game shine, the randomness of getting a minigun or an auto cannon can greatly affect how the game will play out later, the chance of getting the pick up which will allow you to become your worshiped plane is a CotW players dream. Another brilliant feature is the linear map design, which focuses the fight into key areas, but also provide multiple storeys of combat for you to fight upon, yet is obviously more suited to those who have acuired the bomb pick up.  At a bargin of £1.74 during the summer sale i saved 75% on this baby, which is even batter.  Another great feature is the fact that this game is pretty much my entire life in a game, I too spend coutless hours running about with my arms outstrecthed, making both plane and gun noises, running around with my cardboard plane on, and also jumping from worring hights. This has lead to me having to visit A&amp;E on multiple occasions with fractures in my leg, i also ran in to a wall and fractured my cranium whilst aspiring to become a plane. But you see this is why this game is so adequate for people like me, i now no longer have to injure my self, i can merely play the game to get the release that i need, Which at the age of 43 and a half is quite difficult to achieve.   I just cannot wait for the sequel to this, just imagine jet fighters, using lock on rockets and other advanced weaponry to take down other plane enthusiasts, you just can't get enough of it can you. By using the word cult in the title those cheeky chappies at north of earth were just foreshadowing the popularity of this, though there isnt manny of us that now play this, we are devout followers to the end.     I love you cult of the wind.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, dead servers sadly",
            "review_score": "1"
        },
        {
            "review_text": "  [16/12/2016] I think I'm the only one still playing so it has turned out into a singleplayer game. Still better than No Mans Sky.",
            "review_score": "1"
        },
        {
            "review_text": "This is the type of game that you require to master the basic and really important mechanic (such as pressing and holding 'space' to boost jump which is important to quickly win a certain map) in order to achieve utmost fun in playing this game. The blend of music, various plane and special move sound really make me thinking that 'Im a planeeee!!' (and it's actually weird that this game make you thinking you are a plane MORE than any other plane game IMO. This game is really creative. It needs more polish and more type of gameplay. To be honest, 'Take the flag' of this game is better that 'Take the flag' in UT series. What I really want to see is that professional player playing this game in competitive scene. It would be so much fun to watch.  Edit: This is my first review",
            "review_score": "1"
        },
        {
            "review_text": "What a stupid piece of ♥♥♥♥.  Pretty fun though.",
            "review_score": "1"
        },
        {
            "review_text": "I unistall thts how good it is",
            "review_score": "1"
        },
        {
            "review_text": "I unistall thts how good it is",
            "review_score": "1"
        },
        {
            "review_text": "Such a brilliant game! Give the developers of this game the credit that they deserve and buy it now! The concept is fresh, the mechanics are good, the gameplay is fun! Its a real 10 out of 10!",
            "review_score": "1"
        },
        {
            "review_text": "It's a bird, it's a plane ...  It is fun, looking forward to multiplayer games.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very unusually fun and funny title that features you role playing an airplane and fighting against like minded individuals in an arena environment.  This is something I did as a kid with my buddies on a play ground and now this allows me to do it with strangers online. This game is actually super fun...if only people actually played it.  It used to have mid sized servers with people actively shooting one another down, but as of February 2016, I've tried logging in 3 times and all 3 times the only server was completely empty.  So unless you have several friends to play this with locally, it may not actually be alive anymore.  Chances are the only server will be closed eventually and it's very likely to become an abandonware.  I still highly recommend this as it's cheap and entertaining!",
            "review_score": "1"
        },
        {
            "review_text": "I can't explain how cute the concept of this game is.",
            "review_score": "1"
        },
        {
            "review_text": "You can go fast    10/10",
            "review_score": "1"
        },
        {
            "review_text": "Dah fuq is this game?!   I can only describe it as a multiplayer shooter where you play as a person that thinks they’re a plane in World War II as you feeble try to shoot back at other people that also think they're planes.  Got this game for free and it was a blast to play for around 45 minutes. Don't buy 'Cult of the Wind' for a whole $10, the only reason I'd actually buy it is to have a laugh with some friends while it’s on sale or something as this game is pretty 'entertaining' to watch.  Because everyone has way to much health and the controls are so sloppy, most 'dogfights' end up becoming hilariously awkward stand-offs where you sit there and jiggly you're arms at the other person (what the animation looks like for “shooting”) until one person give up a collapses.  This game oddly enough has pretty decent graphics, there are some nice lighting effects and smooth-looking grass. At the same time though the overlays look like they were made in powerpoint. I don't know, maybe it's some kinda of preset? The music is also strangely decent but a little too intense for the, uh, style this game is going for. Don’t know if it’s all royalty free or what.   Either way, weird game. Into that, buy. Not into that, don't.  If I had bought this game with my own money, expecting something playable for more that an hour, I would've been severly disappointed. The only reason I speak well of Cult of the Wind is that it showed up in my inbox out of nowhere and I didn't expect much of it.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game for free and haven't played it much unfortunately. But it has a special kind of magic to it that I can't explain. The game isn't early access and feels unfinished and yet something draws me back into it. It's klunky, it's confusing, but you get to play as someone who gets to be ridiculous and honestly, I have actually done this in real life with friends at the park when we've been bored and i'm an adult. Here you get to have fun. The game is fun and so simple you have to love it. ",
            "review_score": "1"
        },
        {
            "review_text": "I like the idea, I found it hilarious when I saw the trailers. The graphics look unique and nice, it has a great sound design and runs smoothly on a potato.   Why the thumbs down then?  It's not a game, it's just a 'bag of potential' sold for money. The game is practically dead (3 people being online at a time tops) and it's multiplayer only. I wouldn't buy it, unless you like running around alone in a mid-sized multiplayer map doing nothing.",
            "review_score": "-1"
        },
        {
            "review_text": "Control a guy pretending to be a plane in an empty map. That's basically it.",
            "review_score": "-1"
        },
        {
            "review_text": "The idea of this game is hilarious and the 2 matches a played with three other people were great. The problem is there is not community to play with. Since it is only a multiplayer game, if there is no community, you can't really play. If you and four or five of your buddies pick it up you can have a great time, but with the current state of the community on 10/4/2014 I cannot reccomend it.",
            "review_score": "-1"
        },
        {
            "review_text": "  Very interesting concept for a game but lacks two very important things, finese and, most importantly, a player base... Pretend airplanes are pretty great but right now the game feels like people just running around in T pose. There needs to be more visuals to better communicate airplanes. That flying ability in the trailer would be great but I dont think it's in the game. If there was a viable way to play thing single player I feel I would enjoy it but, on it's own, I can't recommend it to people knowing that the best they're gonna get out of it is running around an impressive looking map.",
            "review_score": "-1"
        },
        {
            "review_text": "I felt so alone. Made my own game just to fly around a bit with my pin wheel hat, but with no one around to shoot or fight over the flag with I just became sad. I tried joining someone elses game first but both open games had 0/16.",
            "review_score": "-1"
        },
        {
            "review_text": "most confusing game i have ever played",
            "review_score": "-1"
        },
        {
            "review_text": "An unfinished game. Don't waste money on it.",
            "review_score": "-1"
        },
        {
            "review_text": "good concept - not well executed",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "You'd think a lower end PC would be able to run this by the way it looks but it's unoptimized also the faux airplane controls are stupid as funk.  Why can't anyone make a decent 3rd person game anymore?",
            "review_score": "-1"
        },
        {
            "review_text": "- Just one server online and it is empty all the time. - Animations missing for shooting - Turning is pretty annoying - No Tutorial - No Singleplayer Mode with Bots - No Fun  This could be a nice mod for some well known game.  Instead it is a game for 10 Euros, which noone really plays! Sadly!",
            "review_score": "-1"
        },
        {
            "review_text": "I suggest you don't buy this game. The premice is preety good, but it's a multiplayer only game with no people, so it's a small art museum. If you get some friends to play with(at least 3 more) maybe, but you will get bored soon. How do I know this? I don't I'm just guessing, cause i got it for free and I haven't seen a single player for the past 3 days.",
            "review_score": "-1"
        }
    ]
}