{
    "app_id": 293880,
    "name": "Dark Scavenger",
    "release_date": "2014-05-16",
    "developer": [
        "Psydra Games LLC"
    ],
    "publisher": [
        "Psydra Games LLC"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 167,
    "negative_ratings": 26,
    "price": 3.99,
    "description": "Dark Scavenger is a bizarre point-and-click RPG adventure with a focus on exploration, gaining loot, and meaningful choices. Filling the role of a powerful space traveler, you find yourself stranded on a mysterious alien planet. Will you save the world or just yourself?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/293880/header.jpg?t=1534910447",
    "minimum_requirements": "OS: Windows XP or better Processor: 2.0 GHz Memory: 2 GB RAM Storage: 100 MB available space Additional Notes: Native Resolution 800x600",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "What a gem. It's the perfect marriage of RPG 'dungeon' crawlers and choose-your-own-adventure books. Don't be fooled by the UI – it's better to think of the game as a descendant of text-based adventure games. And the great writing does glue everything together. It will have you giggling, or, in those moments that the game has sufficiently worn down your defenses, laughing uproariously. Definitely a cult classic – I would have loved to have played this game when I was still a kid!",
            "review_score": "1"
        },
        {
            "review_text": "Don't let this game's modest price tag fool you, what's offered here for $5 most games don't deliver at double that price. Dark Scavenger is a choose-your-own-adventure JRPG in which the choices you make will directly impact your experience, often making the game either easier or harder and sometimes downright impossible.   Items you find while scavenging can be crafted into 1 of 3 types of gadgets (weapons, items, allies) which usually provide something of value although rarely you'll end up with a bricked gadget which is by all accounts useless. Much of the game's humor is achieved by offering the absurd or unexpected along with the occasional one liner which is tailored to the scene as are most of the dialogs in the game, you won't find any copy pasta here.   Dark Scavenger is all about the choices you make; every battle, every room, and every dialog has the potential to alter your journey forever.",
            "review_score": "1"
        },
        {
            "review_text": "A unique and fantastic game; a well-written story with tonnes of character plus an ingenius crafting system that really makes your playthrough feel like your own.",
            "review_score": "1"
        },
        {
            "review_text": "Very refreshing and entertaining little gem, about travelling from one, beautifully hand-drawn scenario to the next, making meaningful decisions and crafting your loot into useful items as you progress.  I can easily recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Sold my mother into sex slavery to a group of savages (the teddy bear wasn't good enough) to make my way into their camp.   Would pimp my mother again. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game when I first played it last year. The humor was reminiscent of the old LucasArts games and I felt rapt in the atmosphere. Had to buy it again on steam for convenience and to support the developers some more. Great jobs guys!",
            "review_score": "1"
        },
        {
            "review_text": "Its a weird charming little adventure with Wizardry style combat thrown in. Basically you progress through rooms, clicking on stuff that might get you more loot or attacked, or more frequently BOTH. The Loot you can throw at your friends on this journey, a skeleton warrior who can craft them into weapons, a weird green guy who'll turn them into items, or a horrifying alien biologist who'll turn them into allies. By the end of the game, I had an uzi that shoots bones? aflail that grilled my enemies (and healed me), a spear that can stab souls, a teddy bear so adorable that it'll paralyze enemies, a blanket that protects me from all harm, and a whole bunch of minions with rabies, a narcoleptic monster, etc. If I went through again and threw the items at different allies I'd get a completely different set of things that allow me to progress differently through the game.  There's bunches of choose your own adventure style options in the game to resolving issues. You could brute force your way through them and heal up after, or use the variety of objects you've collected to solve them. At one point I sailed across a lake of acid on a raft crafted out of swords and javelins held together by mucus. And then I finished the game and OH HELL there's NG+ so now I get to carry all my items through and make new ones. This is ridiculous.",
            "review_score": "1"
        },
        {
            "review_text": "This game was ok at first but got boring very quickly. Point and click rpg/adventure game with some crafting.",
            "review_score": "-1"
        },
        {
            "review_text": "Dafuq did I just played?  Weirdiness 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Grade: C+/B-  If you like old school ADV games with a bit of humor, this game is quite neat.   Ammong many problems with this game, it seriously need a better tutorial or at least a proper 'how to play' page. For example, nowhere in the game explains how the save mechanics work. Basically, all your actions are autosaved, BUT, you can do 'manual autosave' by existing the room and going back in again. But as I said, the game didn't bother to tell you this important feature, so I had to restart the whole area many times before I figured out the system. The low score I gave is also reflect upon the unbalanced weapons/items/summons, and low quality art, and also the lack of new elements in NG+.",
            "review_score": "1"
        },
        {
            "review_text": "This is a difficult one for me, as  Dark Scavengers  simply did not cut it for me. I repeat: it wasn't good enough for  me.   Approaching the game objectively as possible,  Dark Scavengers  is a good turn-based RPG that feels as if it was designed to give you the meat-and-potatoes of its genre while forgoing a lot of the fluff turn-based RPGs are known for (grinding, turning in quests, messing around with level progression and so on). You basically run from room to room of each level, beating up enemies, clicking on environment objects, and navigating through chuckle-worthy dialogue, 'scavenging' interesting objects all the while. After each room, you will typically be brought back to your hub to make the scavenged pickings into either a weapon, item, or ally – this is the prize mechanic of the game, though it comes dangerously close to being a gimmick at times. Your crafting buddies give you no clear indication of what they'll make, and although there is certainly fun in this, you can't help but feel a bit cheated by this fairly unforgiving system when you realize that weapon you just made is practically useless.  Thing is, it's hard to take any of the game seriously: between the story, the crafting system, and the writing, it all just feels like the snack-size equivalent of a good time. You go through it and you enjoy it for what it is, but leave with an empty, half-satisfied feeling.  Why the hell have I devoted so many words to this five-dollar purchase? Just buy it if you're that ♥♥♥♥ing interested, look how far you've gotten in this review. It's five ♥♥♥♥in' bucks. You spend that much on footlong sub,  minus tax , fatass. It's not that much. Go mow a couple lawns if you're so ♥♥♥♥in' money-conscious, Scrooge. Jesus. Just buy it. Buy it. ♥♥♥♥.  Here, cutting point - if you like short, simple turn-based RPGs with decent, humorous writing and a charming appearance, buy it. If not, go somewhere else.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly funny writing, refreshing artwork. At this price it's certainly worth a try!",
            "review_score": "1"
        },
        {
            "review_text": "This game got me interested with the unique art style, humor, and weird storytelling. The gameplay turned out to be really fun, with a wide variety of crazy weapons, allies, and items with unusual conditions for use. It's a really hard game to describe, but what is most important is the turn-based RPG combat and the dialogue system. It's a great game for casual players, but hardcore gamers will still get a solid 3-5 hours worth of gameplay out of it, with a New Game+ mode for those that want to try for all the wacky items.  ",
            "review_score": "1"
        }
    ]
}