{
    "app_id": 293900,
    "name": "Pivvot",
    "release_date": "2014-07-14",
    "developer": [
        "Fixpoint Productions Ltd."
    ],
    "publisher": [
        "Fixpoint Productions Ltd."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Casual"
    ],
    "achievements": 8,
    "positive_ratings": 205,
    "negative_ratings": 19,
    "price": 3.99,
    "description": "Pivvot is a thrilling game of strategic avoidance that will consistently test and challenge your ability to make quick, impulsive decisions. As the game progresses, you will have to rely on your instincts and problem-solving skills to navigate down the winding path for survival.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/293900/header.jpg?t=1447361258",
    "minimum_requirements": "OS: Windows XP Processor: 2 GHz Memory: 512 MB RAM Graphics: Direct X9.0c Compatible Card DirectX: Version 9.0c Storage: 300 MB available space Sound Card: Standard audio",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Got this game for free on iOS, loved it. Bought the game on steam to support the devs. 9/10 A great game to kill time.  amazing music  addictive gameplay. completed the first voyage with just 27 deaths on my first try. would totally recommed it to a friend.  but it seems a little jittery on PC.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like Super Hexagon? Do you like to die alot? Then this my friend is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "Simple yet highly addictive gameplay. Great casual game. Very cheap well worth the money. I bought it since it was so highly rated to see what everyone was talking about and was not dissapointed. The game looks good and has incredible music.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a trip. Only two moves- left or right, but the world you are speeding through is constantly rotating. So what is your left one second could be your right next second. Very challenging but forgiving (lots of checkpoints). Psychedelic music and colors (think Austin Powers, only cooler and less cheesy).",
            "review_score": "1"
        },
        {
            "review_text": "Do you like to die? Do you like to do it as often as possible? Well then, my friend. Pivvot is the game for you! 10/10, would die multiple times again.",
            "review_score": "1"
        },
        {
            "review_text": "One word: INSANE!!!!!   Simple controls, nice music, psychodelic colours..... simply love this one ^^",
            "review_score": "1"
        },
        {
            "review_text": "Looks like fun, but sadly controllers do not work. I have Logitech Rumblepads 2 and even tried gamepad emulators... nothing. Such a shame for a four player local multiplayer game!",
            "review_score": "-1"
        },
        {
            "review_text": "Way too short game where you can pivot left or right of a line avoiding obstacles as a circle. The controls are the mouse buttons and it's impossible to fine-tune it (a click already pivots quite some distance). At the same time the game is much too easy, only the expert mode is mildly challenging. Runs well on linux.   Can unfortunately not recommend, there are better executed free flash games.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing ♥♥♥♥ 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "Pivvot is certainly an interesting game with simplistic controls that make an addicting experience. With this game possessing obstacles and game modes that demand twitchy reflexes, you can inevitably be so close to your goal, when suddenly you hit the wrong direction and ruin your great run. However, when you do reach your goal, your heart might just be racing in your chest from a surge of adrenaline and maybe nerves.  While Pivvot might give these feelings to players, some might find that there is little to be had once you unlock and play all of the modes at least once. There are 8 modes, with the 2 voyage modes (Normal and Expert) suggested to be the main modes, displaying a sort of progession in difficulty as more obstacles are introduced in waves. It is a good progression, as you must successfully dodge each obstacle a set number of times before you continue, and are then incorporated into the regular waves.  Outside of these two modes, there are endless modes for both voyages, just to see how long you can last, displaying the obstacles in order of how they appear, and also Random Endless modes, throwing obstacles at you as the game pleases. The further you get in these modes, the faster the speed gets as well, increasing difficulty as well. These modes do not really add all that much to the variety of the game, because once you understand the patterns for avoiding said obstacles, it simply becomes an endurance test.  Pivvot also contains 2 other modes, Berserk and Looper. Berserk is a crazy avoidance mode that is very fast at the start, and presents scattered obstacles around that require your best abilities to get through. I find that this mode may not be for everyone who gets this game, because players might not be able to get very far, possibly only a couple of seconds, causing frustration. Looper, on the other hand, is a rather fresh mode compared to the others, looking for how many rotations you can do before you get hit. All of the other modes focus on getting through obstacles to continue on the track, but Looper changes focus by having obstacles float by you, with nothing in your path on the actual track. The better you do at Looper, the higher the difficulty becomes, and the obstacles and points you get.  Overall, this game is certainly enjoyable, but I give a very tentative recommendation. The music that this game has is rather cool and enjoyable, and allows for tension to ease a little bit, but this game is not for everyone, and it may not keep a player's for more than a couple minutes at a time, and should be played in short bursts due to the potential of feeling stressed because of the twitchy gameplay. I'm not sure if it is even worth the $5 price tag, as half of the modes are lackluster variations of the 2 voyage modes. If you seriously consider giving this shot, it would be good to wait for a sale, or possibly get lucky with acquiring a coupon.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive cool stuff !  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Really reccomend this one, smoot, addicting gameplay that will keep you at it for a nice while. Good music with a nice beat to it, really enjoying it!",
            "review_score": "1"
        },
        {
            "review_text": "Challenging game .. go for it :)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome soundtrack.  Fun gameplay.  Cheap.  Enough said.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome!!!  I think everyone must playing this game.",
            "review_score": "1"
        }
    ]
}