{
    "app_id": 294060,
    "name": "Aaru's Awakening",
    "release_date": "2015-02-23",
    "developer": [
        "Lumenox ehf"
    ],
    "publisher": [
        "Lumenox ehf"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Action"
    ],
    "achievements": 20,
    "positive_ratings": 86,
    "negative_ratings": 35,
    "price": 10.99,
    "description": "Aaru's Awakening is a hand drawn 2D action platformer set in the mythical world of Lumenox. Travel through the mysterious world while the story of the four gods unravels.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/294060/header.jpg?t=1447361265",
    "minimum_requirements": "OS: Windows 8, Windows 7, Windows XP Processor: Intel Core Duo 1.8ghz + Memory: 1 GB RAM Graphics: Integrated chipset or video card DirectX: Version 9.0c Storage: 2 GB available space Additional Notes: Less RAM required if chipset or graphics card has RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Aaru's Awakening is an unrelenting challenge of a game, which places players in the world of Lumenox, a mystical land in a precarious state of balance between four deities who rule it, Dawn, Day, Dusk, and Night. Now that balance is being disrupted, as Dawn sends a faithful warrior, Aaru, to travel the domains of the other gods on a quest to remake the world.  Players control Aaru, tasked by his master to destroy the temples devoted to the world's other deities. His tale, told through a storybook narration, is one about the trappings of faith, subservience, and the necessity of questioning authority. The plot is unremarkable and straightforward, serving up enough to establish the world of Lumenox and the character of Aaru, but little else.  The game presents a 2D platforming style of play with an emphasis on challenging level design. Aaru can run left or right, jump, and employ an air-dash in any direction, but what makes him truly special is his teleportation ability. This is performed by firing a ball of light into the environment, acting as a targeting beacon Aaru can instantly move to. Like the air-dash, this teleportation ball can be fired at any angle and can also be charged up to increase its velocity. The ball is also a physical object that will bounce off surfaces and be destroyed by nearly anything which would also injure or kill Aaru.  These properties of the teleport ball open up vast possibilities that the game's environments take full advantage of. To be successful, players will have to learn to use the ball in a variety of ways, such as firing it through tiny corridors Aaru is too large to pass, using it to keep aloft over lengthy stretches of deadly spikes, even applying it as a weapon by teleporting into enemies. By the mid-point of the game, maneuvers which require precise application of all three of Aaru's abilities become commonplace with little room for error.  Controlling Aaru works well enough with a gamepad, but the better choice for most players will probably be to use keyboard and mouse. From an accuracy standpoint, aiming air-dashes and the teleport ball seems a touch easier with a mouse than an analog stick. The default controller scheme also binds the jump command to up on the left stick which makes it easy to accidentally jump at the wrong time, but the necessity of the right stick to aim effectively prohibits use of face buttons, so there aren't a lot of options to work with.  Players will want that level of precision in the controls, too, as Aaru is not a hardy warrior. Most of the world's surfaces are covered in spikes, thorns, or water, all of which will kill instantly. Hell, just about everything kills instantly, with the exception of some enemy projectiles and pockets of gas or flowing water that can be survived if further contact can be avoided during a brief healing period. Odds are, if it looks like it might kill you, it probably will, sending Aaru back to the last checkpoint reached in the stage. It's likely players will die in excess of fifty times on their first attempt to navigate later levels. Thankfully, the game is generally liberal with checkpoints, though there are a few sequences which seem almost unreasonable in length, chaining together one difficult maneuver after another without any break.  If this proves to be too simple for players, an additional challenge can be found in attempting to clear stages within target times, rewarded with medals. This is totally optional and excruciatingly difficult to accomplish in most stages. There is satisfaction to be had from earning these medals, but some elements in many levels appear in a random fashion, which undermines the goal of achieving that flawless, fast run through repetition.  Aaru's Awakening features nineteen standard stages and five boss encounters, which take the form of more environmental puzzles but with a non-linear twist. Each features glowing targets in a variety of colors which need to be teleported to. Clearing all the targets of a set will grant access to an adjoining room with a challenging sequence to complete, but each destroyed target also impacts the main room where the boss resides by provoking a special attack or adding more obstacles. The targets can be approached in any order, which gives some control over how difficult the main room becomes, but all will eventually have to be hit to clear the stage and defeat the boss.  This approach to boss design is excellent in the context of the game's minimal combat mechanics. Much like standard stages, checkpoints are established often (with the clearing of every secondary room), cutting down on the frustration of having to retread old ground. Unfortunately, the targets have no distinguishing characteristics beyond their color. This can make it difficult to differentiate between them, which in turn makes it harder to establish an effective approach.  It's especially a bummer when considering how much attention has been paid to other facets of the visuals in Aaru's Awakening. The world of Lumenox is conveyed through a pencil drawing style which gives it a detailed, somewhat grungy look. Animations are smooth, particularly in the case of Aaru, as plenty of frames have been dedicated to animating him to reflect the changing angle of the targeting arrow.  Sound design hits and misses in equal measure. Ambient music tracks which play during stages set an appropriate mood and do a lot to enhance the experience, but sound effects are often a bit grating and there are instances where respawning after a death produces a sharp noise which borders on painful, especially when you're likely to hear it fifty times or more over a few minutes.  A fine game which presents a grueling challenge, Aaru's Awakening is perfect for the player who thinks 2D platform games today just aren't difficult enough.",
            "review_score": "1"
        },
        {
            "review_text": "Have just completed it after about 8h. Most people don't seem to need as much time but I played with a bad controller making everything extra hard. The game is a ridiculously challenging platformer with unique mechanics (you spend most of the time air-dashing and teleporting at break-neck speeds) and visuals that are adorable in a rarely seen way. Can't stress enough how original and gorgeous the art is. Reminds me a little of The Secret of Kells, visually. On the down side, the controls are waaay too stiff for a game that revolves almost exclusively around impossible jumps and complicated mid-air manoeuvres. Once you jump, you lose all control of your direction... which is seriously punishing. The story is utter nonsense as well, but hey, a platformer can do just fine without one. All in all, it's a refreshing and fun game for platformer fans. I bought it at a heavy discount and am rather pleased with the purchase, but would not, honestly, buy it at full price.",
            "review_score": "1"
        },
        {
            "review_text": "Aaru's awaking is a great platformer. Teleportation mechanics open so many possibilities and the game does a great job implementing sections of a level to seem like mini puzzles as one tries to clear each level as quickly as possible. There's a sense of liberty which i enjoyed about this game as a lot of these sections within a level can be tackled differently and can required some out-of-the-box thinking. The game is by no means slow and will sometimes require precise timing and aim tho with each checkpoint u can breath easy. While some sections can be tricky requiring some serious skill fortunately there are infinite oppurtunities to retry but that does not make Aauru's awakening by no means a walk in the park, unless that park contained booby traps killer monsters and ninjas (cus ninjas make everything better, sadly this game had no ninjas lol, and it still rocked). If a challenge is what you want seek then a challenge is what you'll get. The teleportation is what set aside this platformer aside from many others to me and its just so much fun to mess with. I should mention the game is basically story driven but can be replayable i just wish there where some form of collectibles hidden items of sorts or stuff as i enjoyed getting 100% and stuff it would increase the replayability of the game to me, tho ik there are those people who hate those types of things so it could just be optional items to maybe like idk have notes like a lore to previous events of the war or monster encyclopedia pages. Still my respects to the creators of this game they have my support and i wish to see possibly a sequel or presequel witch i would buy. Hope this review helped.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun, stylish platformer game. But ♥♥♥♥♥♥♥ the very last bit with Dusk is a punch straight to the balls. Whoever made that is an ♥♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": " A delicious, huge, beautiful 9/10",
            "review_score": "1"
        },
        {
            "review_text": "A very unique indie-platformer that has a cool story and great graphics. Mechanics for the game is very interesting and everyone who plays it falls in love with it. (Please reward the positive reviews with trading cards for the game) :D",
            "review_score": "1"
        },
        {
            "review_text": "Trys to be a hardcore 2D platformer but fails to convinve because the screen is way to small to give the player enough time to react to all those hazards. The artstyle is unique and ok, but it also makes spotting certain obstacles really difficult, like lava or tar pits are drawn in the same colors like the surroundings, so you take it for solid ground. The unnecessary dying commences and drains you of joy real fast.",
            "review_score": "-1"
        },
        {
            "review_text": "The concept behind this game is nice and the artwork is awesome, though I truly hate playing sidescrollers with keyboard+mouse! I'd still recommend you to pick it up (when on sale or bundled).  5/10",
            "review_score": "1"
        },
        {
            "review_text": "WOW!!! Original beautiful game!!! Pretty difficult, but completly original!!! and it works fine (until now)!!!  Great Game!!",
            "review_score": "1"
        }
    ]
}