{
    "app_id": 294160,
    "name": "Galcon 2: Galactic Conquest",
    "release_date": "2014-12-05",
    "developer": [
        "Hassey Enterprises, Inc."
    ],
    "publisher": [
        "Hassey Enterprises, Inc."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Free to Play",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Strategy",
        "Indie"
    ],
    "achievements": 10,
    "positive_ratings": 656,
    "negative_ratings": 118,
    "price": 0.0,
    "description": "Galcon 2 is a demolition derby in space! Send swarms of ships from planet to planet to conquer the galaxy in this fast paced multiplayer strategy game!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/294160/header.jpg?t=1527044358",
    "minimum_requirements": "OS: Windows 7 Processor: 2 Ghz Memory: 512 MB RAM Graphics: OpenGL 2.0 Storage: 256 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "For a game as easy to get into as Galcon it is incredibly deep and rewarding. I've played previous iterations of the game and I've enjoyed them all and Galcon 2, with the addition of its online play, is a worthy addition to the series. It's definitely worth checking out if you're a fan of Real Time Strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "an asolutely addictive game you can pick up and play at anytime",
            "review_score": "1"
        },
        {
            "review_text": "Galcon is an EXTREMELY fast-paced RTS game. In fact, most Galcon matches take less than a minute to be decided. However, due to its learning curve(plus game-specific quirks), new players will lose matches very quickly, very often.  The game supports microtransactions, but they only include cosmetic items(and it's possible to earn premium currency by winning tournaments, bets or by being given them by other players as a 'good game' reward). However, time played still plays a massive role in how likely a player is to win matches, partly because of skill differences, partly because of an upgrade system based on gameplay frequency allowing players to receive more units at a match's start or produce/move them faster. New players get the advantage of being able to see how many forces opponents have, but this isn't very useful as more skilled players tend to not send all of their ships at once to an enemy planet, can produce enough ships to stop the attack, or send in reinforcements to that planet before your ships arrive to attack it.  The upgrade system uses diminishing returns for match rewards as an anti-poopsocking mechanic similar to CSGO's weekly XP boost/reduction, but with a continuous reset. A player playing for 15 minutes 2~3 times a day is going to get as many points as someone playing continuously, disincentivizing grinding. As such, it's possible to get a sufficiently competitive upgrade level by playing the game casually for 1~2 weeks.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this to mac users who have been craving a simple RTS like Red Alert 2. Only this time the only unit in the game are Engineers which take over bases. And that the bases are actually Planets. Oh and the Engineers are actually triangles.   Great game, I've played a couple of hours straight so far and have not noticed many overpowered pay 2 win players  Pros: Friendly Community, Addicting yet satisfying gameplay, and it's free.  Cons: Encountering a highly upgraded player is a bit cheap, thankfully though they made a lobby for newbie players like me :). ",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. But not enough people playing this game",
            "review_score": "1"
        },
        {
            "review_text": "  this game is very fun but i have a feeling it will be short lived with little sense of proggress...",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, reminds me of tower defence games",
            "review_score": "1"
        },
        {
            "review_text": "A simply genius game. Easy to learn but difficult to master. Makes you feel like eating nachos. The games setting provides a stark glimpse into humanities dark future.   8.83/10 (approx.)",
            "review_score": "1"
        },
        {
            "review_text": "First you'll hate the Pros for being mean, then the next day you'll hate the noobs for being dumb.  This game is all about speed, you can't stare at your planets and jack off. You will get overrun.  If you want in a Clan send me a message (Wulfgang) and i'll invite you.",
            "review_score": "1"
        },
        {
            "review_text": "For a quick little game that keeps you entertained, it's awesome. Draws you in with it's quick game play, and easy difficulty setting.  Then slowly lures you into harder and harder difficulties, causing you to hate how the computer and click on multiple things at once. Frustrating. Did I mention there is a frustration mode where the other side has a stupidly huge advantage and you frustratingly tear your hair out while they slowly conquer the entire world as you know it?  11/10 would pay nothing for this great game again.",
            "review_score": "1"
        },
        {
            "review_text": "Strategy Via Divison. What is this, school?",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game to play, decent graphics, fun gameplay and lots of different modes to play :)",
            "review_score": "1"
        },
        {
            "review_text": "This game make you party hard.",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favorites.",
            "review_score": "1"
        },
        {
            "review_text": "very cool game. I have spent 6hours on it and im hooked. It would be nice if it was less Pay2Play such as clans and ships etc. But its a all around good game.",
            "review_score": "1"
        },
        {
            "review_text": "PROS: This game has the best story I have ever seen in any game, I was on the edge of my seat the whole time, and even fell a few times.  The motion capture graphics are the first thing that struck me when playing this game, absolutely stunning, it is optimized so well almost any computer could easily run it at max settings and maintain 60 fps, it even made me cry a little bit. The spaceships in “Galcon 2” are the most realistic physical depictions of spaceships in a video game to date. The amount of technology available overwhelms the player.  FREE GAME! Honestly, this should be priced at $60, maybe even more.  The combat: It is amazing, you have high-detail next gen spaceships at your disposal, ready to attack enemy planets. There are so many different colors you can be, every time I am a new color, I feel like I am being born again, there is so much variety in the colors and the way they attack.  Multiplayer: With internet getting about 4kb/s, I feared I wouldn't be able to play online, boy was I wrong. For the first time, I was able to play an online game without lag. I played with my friends and we worked together to conquer the planets. There are so many different gamemodes to pick from, I felt overwhelmed.   Soundtrack: The music in this makes me want to get up and dance in the middle of my game. The song is constantly stuck in my head all day, but I actually like having this song in my head.  Extras:  +While playing the game there are neutral planets, all of these have clever, realistic names to them, adding more atmosphere to the game.   +I just can't stop talking about the graphics, I literally fell backwards when I first opened the game, I felt as if I was actually in space.   +Online, with eight people playing simultaneously, it's hard to even put into words. There's just so much happening at once, so fast, without any lag too.  Galcon 2 might be the craziest, most intense video game experience I've had in years, but it's also amazing. With stunning graphics, beautiful music, intense, fast paced battles, and so much variety, I couldn't think of one way to improve this game.  Final Score: 11/10 - Best game I have ever played in my life. Game of the century. I would be shocked if I managed to find a game better than this.     ",
            "review_score": "1"
        },
        {
            "review_text": "only fun the first few times you play",
            "review_score": "-1"
        },
        {
            "review_text": "this game is terrible. Not because of the gameplay but the fact its just literaly an untouched port of an ipad. -10/10 would sacrifice.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is terrible, since getting I haven't slept for three days, my work think I'm ill with laryngitis, my wife's threatening to leave, but I still can't stop playing :(  And that's not the worst... I can't focus on anything more than a foot away, everything looks bland and colorless, people look like planets, words look like triangles, is this enough yet? have I beaten you now? or do I need to use more ships ?  10/10 would ruin my health again.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty good game My Strategy is to Earn it can help when someone is raiding you if this Was Helpfull d*-*b",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - Happy that it runs on Linux, was the only reason I tried it - Looks good for such a small game  - Responsive  Cons: - Simplistic concept, gets boring after max half an hour, unfortunately. Doesn't have much content",
            "review_score": "-1"
        },
        {
            "review_text": "Galcon 2 is a very different game to the kind of game i usually play, i either play MMOS or story driven, sometimes online multiplayer (e.g Battlefield) but this game has caught my eye, i downloaded this thinking it would be some space shoot them up but it is a sort of puzzle action game and even though i havent played much it has got me wanting to play more, without having to use a story. I highly recommend this game and i give it a 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantasic, fast-paced, colonization game that is surprisingly free. I'd recommend it to anyone who doesn't have any other games they'd like to play. Fun content. 6.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "Galcon is a simple easy to learn hard to master fps game.Its Graphics are both realistic and simplistic and are not too demanding.The gameplay consists of moving ships to planets to reduce its value until it becomes yours.The goal is to eliminate all enemies.Galcon has many modes to play, the most common is free for all, in which players spawn on random points with a planet and try to conquer everybody else.Its pretty fast paced and until the very end you dont know who will win(unless im playing, heh).The next mode is team mode, the next common and involves two teams fighintg each other, teamwork is very impoortant in this one.The other ones are frenzy, which is free for all but all planets are occupied at the start, and co-op where many people fight a clever(or not so clever)bot. There is no pay to win and all artificial currency is used for cosmetics and running a coustom server, another plus if your willing to spend money.  Galcon is a simple easy to lean game, and is a quick download so check it out!",
            "review_score": "1"
        },
        {
            "review_text": "good hard fun game, and really quick too...to quick for me lol",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun. If it weren't for the demolition derby referance, I thought it would be about sperm fighting over eggs. It's a simple game, really fun, multiplayer, and the in-game chat makes this game really fun to play. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I will say this if you cannot learn strategy stay away from this.   PROS:  1.That being said I love this game the community is awesome constant gg's and well played. 2.It's free I mean that alone is reason enough to try any game. 3. It's super small maybe only 500Mb so it wont take up any space. 4. Any system can run this it has almost no requirements and is not intensive even during the largest of battles. 5. I enjoy this game even when I am losing constantly. 6. The practice and training mode in the beginning will teach you the fundamentals well and allow you to jump straight into the game and start having a blast. 7. Multiple game types mix up the game and change the dynamics greatly team battles etc are awesome and so are all the other game types.  CONS: 1. There is currently a slightly low population in this game (however i would like to mention this does not prevent you from getting into matches by any means people are always joining and leaving). 2. In order to create custom rooms where you can earn in game cash you have to pay a small fee of $5 a month or there are some other small micro transaction fees.(this does not affect gameplay however).   OVERALL   I would recommend this game if nothing more give it a try for an hour if you dont like it then its probably not for you. I say one hour because in that time you can probably run about 40 games some are under 3min long depending on the game type you are playing as there are multiple game types.",
            "review_score": "1"
        },
        {
            "review_text": "Other than the fact that it's a simple, fast-paced, challenging, entertaining, awesome strategy game... It's compltetelly free, so stop reading reviews and go try it! Zero investment = Zero reason not to try it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game about Galaxies. And crap like that. The objective of the game is just to rule the Galaxy. And when you play online with friends, you mainly go after the bots after that try to rule the Universe. This is a fun point and click game!",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game to put it in short. It's not resource heavy, it doesn't take up lots of disk space, and the gameplay is fun. The strategy in this game is quite simple, but it can be the difference between life and death. I love it. The gamemodes are nice, but the balance between teams in the team mode can be off sometimes. Galcon 2 is a bit like Tetris in a way. it's real easy to pick up and play, but it can also be challenging. This game is a great, casual gane, and I would highly recommend it, especially because it's free.",
            "review_score": "1"
        },
        {
            "review_text": "Seems like a good concept, didn't really enjoy the game a whole lot though. Needs more flagons, I'd say.",
            "review_score": "-1"
        },
        {
            "review_text": "I think this is a great game, even though it's simple, it has a good gameplay, espescially if you like strategy games. (Sorry if my english is bad)    A quick tutorial, and then head right into the battles! :D",
            "review_score": "1"
        },
        {
            "review_text": "There needs to be a version where people work together.     If your looking for a calm upgrading game with money, try AdVenture Capitilist. It is free and plus there is the moon!",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games ever! (especially when u have 5 mins free time, at work or smthn)",
            "review_score": "1"
        },
        {
            "review_text": "V. fun game, infinite possible strategies. Artistic, stylised graphics. Sure to keep someone entertained for a while!",
            "review_score": "1"
        },
        {
            "review_text": "its a good game",
            "review_score": "1"
        },
        {
            "review_text": "This is a superbly excellent game, no pay to win, well constructed and an excellent community all mixed into one.  this game will make you love, hate, rage and bond and if you do not have the patience to play it, give it time and eventually master it then do not install it but if you are willing to dedicate time and thought in order to learn adaptive strategy then you will love it!   some aspects of the community are real ♥♥♥♥♥ but are generally frowned upon and pushed to the side.   but give it time and it will blossom into a real nice flower! please enjoy and do ask other players for tips!!",
            "review_score": "1"
        },
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "Truly an addictive game. Don't let the simple look fool you this can be a hell of a strategy game. Fun co-op against a bot of varying difficulty. It really comes into it's stride with the versus team and free for all though. A true game of galactic conquest. High pace, addicting, fun... You have been warned.",
            "review_score": "1"
        },
        {
            "review_text": "Really dissapointed about it but well it at least was free! It is not worth the TIME for downloading it. one word: Triangel.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game but revolt system sucks",
            "review_score": "-1"
        },
        {
            "review_text": "This game really give me a lot of nice memories. Back then I used to be a Clan leader of the Clan called Splitters together with some other awesome person.  This Clan used to be very known and we had some very decent and most likely the best people on-board. I was quite good at it myself but there were really some sick people you hardly could keep up with. But this also pushed you further and made yourself better!  My Username was Manjini on it btw. :) To some Veterans this shouldnt be a unknown name. :p   Hopefully they gonna release a Galcon 3 because I am confident that even those old legends on Galcon 2 will return and we would all meet up again and form Splitters Reborn! Or something like that xD",
            "review_score": "1"
        },
        {
            "review_text": "What a fun game. In Galcon 2, players try to conquer all planets on a map by colonizing planets. Planets under your control will produce ships, which can then be sent to nearby planets to spread your territory. Planets of different sizes will produce ships at different rates, but may cost more or less depending on their production times. So larger planets will produce ships faster, but will be harder to reach and harder to acquire. Smaller planets will be more accessible, but will produce ships slower. The goal of Galcon 2 is to find the right balance and utilize strategy to conquer as many planets as possible.  What I enjoy about Galcon 2 is how simple it is to play. There are no complicated colonization protocols. Any planet may be colonized so long as it contains fewer ships in storage than the amount of ships attacking it. That's it.  However, there is an interesting level of strategy to Galcon 2. First, only gray neutral planets will display colonization cost, ie. a neutral planet might cost 25 ships, making your decision easy in whether to attack it. However, planets colonized by other players will *not* show colonization costs, so pay close attention to ship traffic locations from enemy player activity to guess where their weak spots are.  Second, diplomacy often comes into play in large multiplayer matches. Games will begin as mad rushes to colonize planets and begin producing ships. Then, as the number of neutral planets dwindles, conflicts begin to arise. Players must juggle whether or not they can take over their neighbor's territory, and if doing so will make them appear vulnerable to other players. There is a certain strategy in trying to incite conflicts while biding time to make a proper attack.  Third, though Galcon 2 is typically a free-for-all game (designated team matches exist, but are not as common), teamwork finds itself arriving in the most incredible of situations. In a three-player skirmish, when one player assumes large control of the map, the two other weaker players may realize silently they must work together temporarily to stop the growing threat. Galcon 2 is full of spontaneous blasts of teamwork, but also backstabbing and surprise attacks.  Galcon 2 is one of the most accessible and friendly real-time strategy games on the market today. I myself am hardly a strategy player, preferring simple and obvious games, yet I have so much fun with Galcon 2. Now that it's free there is no excuse not to give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "old time fav havent played it in ages... its fun and good community",
            "review_score": "1"
        }
    ]
}