{
    "app_id": 294530,
    "name": "Freddi Fish 2: The Case of the Haunted Schoolhouse",
    "release_date": "2014-05-01",
    "developer": [
        "Humongous Entertainment"
    ],
    "publisher": [
        "Humongous Entertainment",
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Family Friendly"
    ],
    "achievements": 0,
    "positive_ratings": 124,
    "negative_ratings": 4,
    "price": 4.99,
    "description": "So who is haunting the schoolhouse, taking the toys and practically scaring the scales off all the guppies?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/294530/header.jpg?t=1553803569",
    "minimum_requirements": "Минимальные: ОС: Windows 7 / 8.1 / 10 Процессор: 1.0 GHz Processor Оперативная память: 512 MB ОЗУ Видеокарта: 100% DirectX compatible graphics Место на диске: 512 MB Звуковая карта: 100% DirectX compatible card or onboard sound",
    "recommended_requirements": "Рекомендованные: ОС: Windows 10 Процессор: 1.5 GHz Processor Оперативная память: 512 MB ОЗУ Видеокарта: 100% DirectX compatible graphics Место на диске: 512 MB Звуковая карта: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "WARNING: This game is as spooky as an episode of scooby doo play with caution and wear a diaper because game will scare da poopoo outta u",
            "review_score": "1"
        },
        {
            "review_text": "Scariest game I've ever played. Not sure how I made through it as a kid. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Freddi Fish 2: The Case of the Haunted Schoolhouse is a classic for all ages. You feel sympathy for the poor fish with the lack of their toys. You become one with Freddi Fish as you solve puzzles and learn about valuable life lessons such as sharing to save the guppies. The ghosts only make you want to save those guppies even more. Venture off into the sea in a wonderful adventure filled with heartfelt moments and deep philosphy from Freddi Fish, only for 6.99.",
            "review_score": "1"
        },
        {
            "review_text": "this game is good, bring the childhood memories back",
            "review_score": "1"
        },
        {
            "review_text": "have you ever played a game that made you say Wow. that is a good game?",
            "review_score": "1"
        },
        {
            "review_text": "An Instant Childhood Point-and-Click Classic from the Days of my Childhood, which consist of the old MS-DOS, Windows 3.1, Windows 95, Windows 98 &amp; Windows 98SE PCs in which you help Freddi Fish &amp; her best Friend Luther find Recover the Missing Toys by catching a Ghost by Collecting 5 Objects to complete the Ghost Trap &amp; Unmask the Ghost in Scobby-Doo Style and I mean the Saturday Morning Cartoons &amp; SEGA Genesis Sense.",
            "review_score": "1"
        },
        {
            "review_text": "this game is too short but i enjoyed it :D",
            "review_score": "1"
        },
        {
            "review_text": "Believe me when I say this my dudes, This game WILL RUIN YOUR LIFE AND RID YOU OF YOUR SANITY. This has scarred me to the point where I get vietnam flashbacks everytime I'm asked to spell 'i-cup', ♥♥♥♥♥.   (PLAY THIS GAME AT YOUR OWN RISK)   (DO NOT PLAY IF YOU ARE FAINT OF HEART OR BAD WITH HORROR/SPOOKY MEMES)",
            "review_score": "1"
        }
    ]
}