{
    "app_id": 294660,
    "name": "Putt-Putt® Saves The Zoo",
    "release_date": "2014-07-03",
    "developer": [
        "Humongous Entertainment"
    ],
    "publisher": [
        "Humongous Entertainment",
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Family Friendly",
        "Adventure",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 333,
    "negative_ratings": 14,
    "price": 4.99,
    "description": "Today's the grand opening of the Cartown Zoo, and there's still so much to do: zoo chow is running low, and all the baby animals are missing.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/294660/header.jpg?t=1554314743",
    "minimum_requirements": "Mínimo: SO: Windows 7 / 8.1 / 10 Procesador: 1.0 GHz Processor Memoria: 512 MB de RAM Gráficos: 100% DirectX compatible graphics Almacenamiento: 512 MB de espacio disponible Tarjeta de sonido: 100% DirectX compatible card or onboard sound",
    "recommended_requirements": "Recomendado: SO: Windows 10 Procesador: 1.5 GHz Processor Memoria: 512 MB de RAM Gráficos: 100% DirectX compatible graphics Almacenamiento: 512 MB de espacio disponible Tarjeta de sonido: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "I saved the zoo",
            "review_score": "1"
        },
        {
            "review_text": "This game is better than sex.",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS in the Steam Store 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I'M NOT EVEN PLAYING THIS IRONICALLY!",
            "review_score": "1"
        },
        {
            "review_text": "A PC game that is actually optimized well.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Childhood nostalgia restored. I always played it at our local Bank when i was young :D",
            "review_score": "1"
        },
        {
            "review_text": "One of my first H.E. games back as a kid, followed by Freddie Fish, Pajama Sam, and Spy Fox.  This game has aged well since it was made in the 90's. Plenty of hidden gags to find for children to spend hours and hours on.  Here's the story: Cartown Zoo is having a grand opening, and Putt-Putt is off to visit with Zoo Chow from the grocery store owner Mr. Baldini (he's italian). The Cartown Zoo is run by Outback Al (he's australian). Putt-Putt learns that the baby animals are missing and the zoo needs repairs done before opening. Putt-Putt takes on the task to find the missing baby animals, while Al does the heavy work. (Makes sense since Putt-Putt is a child and Al is an adult).  Putt-Putt needs to find 5 missing baby animals: a Lion Cub, a Seal, an Elephant, a Hippo, and a Snake. All can be found between three regions of the zoo: Articland, Grasslands, and Jungleland.  There's a bit of puzzle solving, but challenging enough for a child to solve. There's also two mini-games: Hockey (pong-style), and Spot the Animal. Can even change Putt-Putt's color (a running theme in every Putt-Putt game). Can also take pictures of the animals, and a few cars, in the zoo.  Getting the complete Putt-Putt set would save you money if your child enjoyed one of the Putt-Putt games, or for nostaliga purposes; same goes for the complete H.E. set.  -----  Check out more games I see that deserve more attention from my curator group:  BluePaw's Underrated Games List  Join and/or follow if you wish.",
            "review_score": "1"
        },
        {
            "review_text": "Ahh there's the nostalgia again. Something about this does seem better than the earlier installments in the series, too, though maybe that's just bias. The puzzles are pretty simple, the environments are varied enough. The art and voice acting is a bit improved too. Though it seems to be a bit on the short side all things considered. And there's like... one random element, period. Still, decent enough nostalgia fuel.",
            "review_score": "1"
        },
        {
            "review_text": "Who can hate Putt-Putt, recieved as birthday gift for 20th birthday. Probably the best I recieved. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game with countless jaw dropping action sequences. Never a dull moment. Was on the edge of my seat for the entire time. Engaging characters. Money is not an object when it comes to flawless masterpieces such as this 1990's blend of nostalgia, high quality graphics and heart-wrenching storyline. 10/10 would kick Polar Bear's ♥♥♥ in hockey again.",
            "review_score": "1"
        },
        {
            "review_text": "its 10/10 the combat system is more complycated than dmayc4 and a better story than beyoshack infaite and funyert joke than dilopool is a lot a good about this",
            "review_score": "1"
        },
        {
            "review_text": "great game I saved the zoo  if you are looking for hints on how to beat is you need to get the peanuts and feed them to all of the animals you see this is how you beat the game there are no cheat codes sorry",
            "review_score": "1"
        },
        {
            "review_text": "I used to play these games all the time when i was a child. I'm so happy steam decided to sell them so we can relive our memories once again! :-)",
            "review_score": "1"
        },
        {
            "review_text": "I saved the zoo ! Again ! And again ! AND AGAIN !",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would Save zoo again",
            "review_score": "1"
        },
        {
            "review_text": "What happens when friends become sleep deprived?    They sell their Strange Kritzkrieg for 90 bucks, and use every last penny to buy multiple copies of this game.      Don't make the same mistake we did.   ",
            "review_score": "-1"
        },
        {
            "review_text": "It's nice to see that it works on Win8.1, after 18 years I can't believe that I still remember the game and what happens in the game, what sounds they make, a weird feet of memory. It's a nice ride back to childhood.",
            "review_score": "1"
        },
        {
            "review_text": "The length I played is my first attempt at a speed run. Someone beat it",
            "review_score": "1"
        },
        {
            "review_text": "I played this as a kid, and in revisiting it it's much more solid then I even remembered.  Recommended for anybody!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would definately save the animals for the hairy australian truck again ",
            "review_score": "1"
        },
        {
            "review_text": "One hell of a game. Car tuning, kidnapping, gang of peguins, hot chocolate, the thug life at its finest. Totally worth the money! ",
            "review_score": "1"
        },
        {
            "review_text": "This game made me kill my own family and plug my mouse into my a$$ while i scream: 'HIT ME WITH THAT ♥♥♥♥♥ DADDY WAHFAOFHASOFHASOF'",
            "review_score": "1"
        },
        {
            "review_text": "I just saw this on steam and knew i had to get it. The nostalgia factor is over 9000. Played this when i was 6 years old, and i loved it. An absolute classic.",
            "review_score": "1"
        }
    ]
}