{
    "app_id": 294790,
    "name": "Haegemonia: The Solon Heritage",
    "release_date": "2014-05-01",
    "developer": [
        "Digital Reality"
    ],
    "publisher": [
        "Microids"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 42,
    "negative_ratings": 25,
    "price": 3.99,
    "description": "A stand-alone expansion pack to Legions of Iron, discover new innovations and even more stunning visuals that launch the Haegemonia experience into light speed.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/294790/header.jpg?t=1478598004",
    "minimum_requirements": "Минимальные: ОС: Windows XP, Vista, 7 Процессор: 1 GHz Оперативная память: 512 MB ОЗУ Видеокарта: 3D graphics card compatible with DirectX DirectX: Версии 9.0c Место на диске: 1 GB Звуковая карта: Windows DirectSound compatible sound card Дополнительно: Windows compatible mouse and keyboard. Local multiplayer only. There are no servers.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "a very good game,,,simple interface and can be confusing, intergalactic movement can be difficult though asides from all that 3.99 isnt a wallet ripper for an excellent space based rts, though be aware solon heritage is simply a multiplayer local and net based to legions of iron which is basically only campaigns.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun has heck but few problems with the game is not enough ships no fast forward 20% of the ships are broke as ♥♥♥♥ like try using the supply ship see how fast your game crashes :P theres alot of problems like some maps will crash if you cap a planet and theres planets thats uncapable which sucks! like huge ones...uncapable and 10%? give or take planets are broke meaning you cap it you crash theres alot of problems but well worth it! i even noticed the fighters are sooooo much better then the rest lol due to the damage over time and their dodge rates cuz they move around and they dodge everything BUT rockets rockets are hate seekers so be warned but other then that i give it a 8/10",
            "review_score": "1"
        },
        {
            "review_text": "man im glad they fix alot of the bugs that legions of iron had but im dissapointed that there was no story to it such a pity legions of iron had a great story and i was hopeing for a continuation but im saddend to say there wasnt (cry's) personal rating 3/10",
            "review_score": "-1"
        }
    ]
}