{
    "app_id": 295550,
    "name": "Royal Quest",
    "release_date": "2014-08-06",
    "developer": [
        "Katauri"
    ],
    "publisher": [
        "1C Online Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "MMO",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "achievements": 323,
    "positive_ratings": 833,
    "negative_ratings": 386,
    "price": 0.0,
    "description": "Royal Quest offers a fresh MMO experience from the creators of Space Rangers and King's Bounty series. Join Guild Wars, conquer Castles, and battle other players in unique PvPvE locations, or explore the vast world of Aura and enjoy the story on your own.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/295550/header.jpg?t=1553175651",
    "minimum_requirements": "OS: Windows 7/ Vista / XP SP3 Processor: Intel Core 2 Duo / AMD Athlon X2 64 3.0 Ghz Memory: 2 GB RAM Graphics: 512Mb NVIDIA GeForce 9500GT / ATI Radeon HD 3450 DirectX: Version 9.0 Network: Broadband Internet connection Storage: 5 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I've Been playing this game since Open beta released. I gotta say, The people I've met here in RQ were kind, and sharing. Community Is Great(I'd rate it 7.5/10) There are trolls and ragers, But not that many. Now, the gameplay is pretty strange since this was my first click to move MMO that I've Played. You get used to it though, I see why they would drop the normal WASD key configuration to click 2 move since there are many spells in each classes(LOTS,There are also many Slots to add in your interface,Side slots and 3 rows on the bottom). Also this game forces you to pay for blessings, which is a time duration item that gives a certain amount of bonus exp+gold intake for an amount of time.   Now about the bad things to point out. To reset skills 1-20(Yes, there is a limit of levels where you only can reset from a certain item) 1-20 is where it only takes about 200 gold(which is really REALLY easy to get). Now 21-49, you need a flower. This Flower costs about 99 reales(reales are REAL LIFE CASH-Worth about $2-$3). The flower can be easily bought for about 800k+ and is pretty expensive for people that are levels 21-49. Now 50-60 is where it gets really damn serious. To reset you need to spend $$$(199 reales) or 2-3 Mil gold in game just to reset. This is ridiculous In my opinion. Also note that there are 2 certain categories to reset, Talent Points and Characteristic Points(STR-INTEL-VIT-LUCK-DEX) Which makes you have to spend x2 the money just to reset everything. This Plus the Blessings people usually buy.   Now the PvP system. The PvP system they have for RQ was only probably meant for 1v1s, Only because there are so many single target spells for many of the classes,subclasses etc. PvP In royal quest always connected to eachother. Meaning that One class counters another and another.   Finally, the conclusion of what I think about this game is that if you are beginning to play MMOs, This is a really REALLY great example of what to play as your first MMo. But if you are an experienced MMo player and a hardcore MMo player like me, There are so many MMos that beats this one(No offense Royal Quest).    Rattings-  Overall Gameplay-7.5/10  Combat-6/10  Ez Navigation-8/10  Community-9/10  Graphics-6/10  StoryLine-2/10  This is all In my Opinion, Please Do NOT get offended If I said anything wrong about RQ.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok, After playing a little bit, and having 2 characters reach level 20+ i have this to say:  the game is fun, at first.  -- Bag Size, WTF?!? the bag is so small you start throwing things away. you have to pay REAL money to get a bigger bag. -- Mounts, WTF?! Unless you started as a warrior, you have to pay REAL money to get a mount. -- Death, WTF?! Ok, I died. i want to revive at the same spot cause i walked alot to get there. 'PAY ME' the game shouts.  if you don't pay, you go back to town, with 1/2 of the HP and Energy, and if you are Lvl 20+ you also get a 10 MINUTE  weakness!  ---------------THIS GAME SCREAMS MONEY--------------  i actually think that there are more MicroTransactions on this game than on most Mobile Games....   ********PLAY THIS GAME IF YOU LIKE PLAYING UNTILL YOU GET TO LEVEL 20-25******   ********without using money, game is worthless******",
            "review_score": "-1"
        },
        {
            "review_text": "Decent enough game however the camera angle cramps the neck and its only a matter of time until Square Enix and NCsoft shut this game down. It literally rips chocobos as mounts from Final Fantasy and most of the hair styles are straight out of Aion. GL with that.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm sort of confused by some of the negative reviews, as I'm finding this to be a pretty decent game that doesn't have many problems.  First, it has a lot of lore and story to it. It's not just quests like 'Kill 10 rats because I stubbed my toe and need toe medicine' - the quests have more detail and story to them than that. Each quest has been pretty detailed so far with lots of extra tidbits of story and lore you can get out of the NPCs if you select to ask them certain questions.  You also find a lot of NPCs that aren't part of the quest line but that actually have story bits to add if you talk to them. I find this extra work and detail to help the game to be much more immersive.  The classes are all very different. If you don't like the way one plays, you really should try the others as they all have their own different way to play and their own feel. The powers are all different and specific for each class line and greatly change and affect the way you play. This isn't like some games where the only difference in classes and skills are that they make a different graphic for them but they play the same way. Here they all really play in specific unique ways. Even when two classes have traps, one class they are auto traps and the other are traps you manually detonate. There are a pretty good amount of skills too and they all have purpose and do different things rather than just being damage upgrades that look a little different.  The game plays out just fine and quickly. Yes, your main attack if you click something is set on default to autoattack (like 99.9% of every MMORPG that exists, so why one would complain about that I don't know - especially since you can toggle it off to manual if you really want) but in most classes that attack is very fast and you're going to be worried about using all your skills all through combat. You quickly end up using a lot of them. The only class that plays a little slower to start out is the Warrior, but even they end up with a lot of skills in time too. If you're into melee and want faster combat, play the Rogue. The Warrior is meant to actually be a party tank and has a lot of taunts and things instead of the fast pace skills of the other classes. That isn't to say they are lacking, they have quite a few and you'll see them as you level up more.  The game isn't well known here, so there aren't a lot of people in game right now. Not only that, but they don't really understand why it's a free game they can't get in (the first week is just for people who buy one of the DLC packs, but they only say that if you go searching elsewhere to find that info and didn't post that here).  I'm not that into PvP, but for people who are they have these nice castles your guild can take over that spawn chests of loot and have other neat little extras in them.  I don't really get their whole 'PvPvE' thing - that's just a fancy way to say PvP zones. Most MMORPG games with PvP also have monsters in the same zones but they just call them PvP zones instead of trying to be fancy with the wording. I really very much dislike PvP and want to avoid it, so I'll have to see how much it affects my gameplay as I level up. I hope it's avoidable and not too too bad. A description at their web site says there are quests in those areas which I never enjoy being forced to go to PvP zones to do quests, especially in game that has so much story and I really am enjoying reading all the quest text. I'm not really there yet though to see how that's going to affect my play. It could have a huge negative affect for me and even get me to quit if it's bad enough but I'll just have to wait to get there to see.  The camera angles really aren't that bad. I think they limited it in order to make the game work better on lesser systems, I'm not sure. It runs very smooth and pretty though and I don't really see why they can't allow you to pan it so you can see into the distance a little more but you do have some tilt control and it's really not too bad.  The one thing I dislike though and very much want to see change is for us to get the ability to use WASD movement in the game. A lot of games like this launch with click to move movement only, and it's always the same. I get sick of clicking so much, it's a pain in the butt after a while. They really need to change the game to allow keyboard movement controls as well. I know it doesn't work great for every situation, like if people set the camera to auto movement, but they could always disable it if you have auto camera on or find some other work around. Too many people are going to want WASD movement controls, maybe they'll listen and put them in game in time though.  So I'm finding a pretty decent game here. You may want to wait and not chance it, and give it another 4 or 5 days until it's opened for free to everybody, but I for one am very happy with the game as it is and am glad I bought a DLC pack so I could play now. Even if PvP areas make me quit later (again I still don't know if they will or not, it depends if I can still level and quest around without having to deal with them for the most part) - I still will be happy that I got and played the game. It's been interesting and fun and is a good example of how to put real story and more meaning into quests. It also is doing something very right with the skill system all being so different. Hopefully once it's opened for free a lot of people will find out just how much they like it too.  The video they have here really doesn't show much of the game, you can find videos elsewhere online of people playing the game if you really want to see how it plays though. They don't take the time to read and go through all the extra text and things in those videos however, so if you're a person who really likes story and lore in your games you won't really see how cool it is until you're able to get in there yourself.",
            "review_score": "1"
        },
        {
            "review_text": "This game definitely resembles Ragnarok Online, there is no doubt about it.  However I still feel it does lack compared to Ragnarok Online. But don't get me wrong that doesnt make this a bad game.   Royal Quest definitely have some things going for it.   It is a grind-fest, but for those who like that sort of thing it's perfect. The mobs in the game are balanced well and I found myself needing to heal myself frequently.  It offers a decent variety of classes. (4 base classes, each with 2 advanced classes)  Quests are plentiful and will definitely help you get through the initial 20 levels of the game.  Stats are self allocated leading possibilities of many unique play-styles.   On the flip side there are things that Royal Quest lacks.   Skills are linear, everyone of the same class will get the same skills. The talent system makes up for it slightly, but it still would be nice to have a 'skill-tree' system.  Bag space. It's not that big of a deal, but it is annoying at times and would be better if they gave us double the space.  Although the cash shop isn't that bad, the cash shop definitely saves a lot of time.  If you can get past these hurdles this game can definitely be something worth investing time into. ",
            "review_score": "1"
        },
        {
            "review_text": "Alright, I have played quite a bit of Royal Quest and I can tell you one thing, all the other reviews that tell you that the game is pay to win couldn't be more wrong, premium items, not only aren't that great, but even those you can buy with in game currency. This is a great game, it has that old school feel to it and in my opinion the only bad thing about this game is the camera, which is usually decent but sometimes it puts you in a very weird perspective, other then that it is totally fine, and for the price of free why not give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "it is a nice adventure and calming game. I reccomend to get it.",
            "review_score": "1"
        },
        {
            "review_text": "Nice MMORPG to play with your kids, Easy to learn how to play and lots of fun doing quest together with family or friends.",
            "review_score": "1"
        },
        {
            "review_text": "No don't play. Noooo. Bad. Bad game. Game = bad time. Also, female's clothes made me really uncomfortable like every single one has this tiny miniskirt that's so stupid. Are people this horny that they need to dress girl characters up in nothing?",
            "review_score": "-1"
        },
        {
            "review_text": "slow boring and frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "Very enjoyable mmo, that also runs very well on low end systems :) graphics are very good aswell on good gaming system, enjoyed them on max settings. Once you get into some dungeon crawling game has lots of depth to get into. Lots of end-game with guild castle ownership, but a huge grind to get decent end game gear, but that maybe enjoyable to some hardcore mmo fans, lots of spells and crafting recipies to sink your teeth into :)...REALS...the ingame curency very expensive, for this mmo, at ~5cents US per real gets very expensive quick, decent gear or shop items 250 reals for example that $10 bucks for 1 mth premium stub for example or $5 bucks 100 reals+ for decent potions or crafting item that only lasts 30 min x 20...ouch too rich for this mmo...but freeplay is duable....dont need to spend much if you Budget, but this mmo sure tries to suck you in the spend $. be warry not to fall for the Paywall !",
            "review_score": "1"
        },
        {
            "review_text": "Fun casual MMORPG very similar to Ragnarok Online.   Leveling becomes a challenge from 25+ onward truthfully.  You wont level fast or reach far unless you are willing to grind out some levels because quests won't bring you to the next level.  At these time it's best to get into the community and see for yourself if its worth continuing to play with others.  Still early days in the game as there's surely more content to be added in the future.",
            "review_score": "1"
        },
        {
            "review_text": "boring as ****",
            "review_score": "-1"
        },
        {
            "review_text": "This game is pay to win. Everything becomes severly limited down the road and you eventually have to cash.. so bad so sad",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent open world MMORPG. This game provides with amazing experience in online interactions. Very friendly community, many willing to help players and in general just fun and easy game. P2W is present in this game but that doesn't mean you can't become the best without it. Hardcore grinding will help to abtain the best gear and enchantments for your weapons. PVE - 10/10 PVP - 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I'll try to keep it short and sweet. I played till level 52. Didn't use premium/blessing until level 30.  Pros: -Sweet time waster with lots of fun for early levels. -Making decent gear for class C items (1-30 ish) is easy and fun. Most materials are obtainable from daily quests with easy to farm items. - Exploring the maps with mobs that can kill you in 1 to 2 hits is fun. Basically it is fun to be noob in this game.  Cons: - P2W.   Gold cost for gear improvements and seals increases at almost triple or more from each class. Just look at the NPC price of Emeralds compared to Sapphires compared to Morions. Without mentioning the required cashshop items for item improvements as the success rate for higher class item is much lower if using non-cash cubes  Premium/Blessing is a must to play at later levels even when 60. Gold/time costs of weakness debuff after death is very high, and players can die a lot especially when playing in areas with range mobs or during guild wars. Maiden tele costs adds up without Blessing. (7K here, 8K there and all your gold farmed is gone) Another thing is the tax on non-preimun account for players setting up markets is ridiculous (15% vs 5%). Either spend time spamming to sell instead of enjoying the game or suck it up losing 10% extra.  TL/DR:  Reccomended for those who like grinding games with an objective to reach level cap and for causal/serious pvping in lower levels. Not reccomended for those who wants level cap PvP because the costs is too prohibitive for most. (too grindy or too P2W)",
            "review_score": "1"
        },
        {
            "review_text": "First off, the game is -NOT- Pay to Win. You can buy premium currency with gold. Second off, most of the people who are bad mouthing the game either have very low hours played (under 5) or got their ♥♥♥♥ rocked in PVP (Which is entirely optional)  It feels alot like Ragnarok Online but with better graphics and animations. There are also far more skills than Ragnarok. The leveling is slow, but the game isn't all about leveling. Anyway, here's a Pro/Con list.  PROS  Decent, fluid graphics Fun gameplay You can buy any premium item with gold. There's PVP (That is instanced so you don't have to PVP) Lots of class diversity Daily quests for faster leveling Card system to upgrade gear (Apply poison/fire/etc or extra damage to weapons/gear) You can buy premium items with in game currency from other players You can buy premium account time from other players with in game currency You can set up shops  CONS  Sometimes the grammar is a little bit off, nothing major. The upgrade system is based on a % chance so after +5 it fails alot The debuff from dieng lasts a little while  Overall, it's a great game that I'm having lots of fun with.",
            "review_score": "1"
        },
        {
            "review_text": "this game is a good miltiplayer mmorpg that doesnt require a bunch of fancy downloads or computer specs the computer i have isnt the best but this game runs like its nothing ive played a lot and there is more than the begining quests and grinding theres guilds (with the cost of 1000000 gold) partys boss dundgeons and much more i enjoy this game more than anything else ive played and i wloud recomend it to anyone who asks ",
            "review_score": "1"
        },
        {
            "review_text": "Boring, generic, grind.  Bag space too limited had to trow away half of my quest rewards just to get room to complete a quest.  Lots of p2w or pay to have any kind of fun.",
            "review_score": "-1"
        },
        {
            "review_text": "every time i get in steam it start download it and i dont love gime like this one and i hate it so please the one who make it kill yourself",
            "review_score": "-1"
        },
        {
            "review_text": "I just dont ike the controls ",
            "review_score": "-1"
        },
        {
            "review_text": "Camera range is too limited and the controls are ugh! Very limited character creation options Otherwise it seems to be absolute cookie-cutter MMO fare without much flair or its own personality. In this day and age one would expect a bit more.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game only thing in my opinion is the characters need more customization and other than that it is a good game runs smooth everything flows together moves seem well balanced ect. I give it a 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This is so stupid. If you forget your PIN number there is no way for you to get into your account game again =___=!!",
            "review_score": "-1"
        },
        {
            "review_text": "whendt let me ply  ",
            "review_score": "-1"
        },
        {
            "review_text": "Game basics seem sound and in the beginning are somewhat enjoyable. However there is far too much pay to play for the game to continue to be enjoyable. If you want or feel some overwhelming need to spend A LOT of money on a game, then this one is for you.",
            "review_score": "-1"
        },
        {
            "review_text": "It is cool",
            "review_score": "1"
        },
        {
            "review_text": "the game is fun,but thre is no-where to go at level 23 to level up,so it becomes pointless to play.",
            "review_score": "1"
        },
        {
            "review_text": "So far several hours in and its still refreshingly different. The game has similar feelings of all other mmos but for some reason i dont find it stale. It is fairly fast paced with something new around every corner. im sure late game 'endgame content' will be boring as hell like every other game but until then i beleive it may hold up the bar.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun, but at lvl 20-60 it's just grinding Recommend playing with a friend of group of people. Playing solo sucks",
            "review_score": "1"
        },
        {
            "review_text": "Wow. this game is awesome! althought im only level 20 it's so good. It's a bit boring at early levels but just keep doing quests with some friends and youll have a great time. Also, there isnt rly a main quest so you have to find quests in order to gain xp and gold, or just farm monsters.",
            "review_score": "1"
        },
        {
            "review_text": "I think it's really good game and i don't know why people say its P2W because it's not. Maybe u can buy some goods for real money, but you can also buy Reals (money from $,€ exchange) for gold. You can have premium account without using your real money. I was playing something like 40h and it was fun. If you want enjoy the game in every aspects join to guild (there is many guilds from many countries). :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is realy nice. If the developers where going for that old school mmo look and feel, they nailed it. I recommend this game to anyone who likes a good laid back old school style game. I don't recommend this game for anyone who don't appreciate the classics. Now the crafting takes some time and its not realy 'pay to win' its pay if your in a hurry to level up. And there are thing that will try to get your loot befor you and thats what the pet collars are for to make your pet get the loot befor any one els dose. But its kinda fun raceing to grab your loot befor they do. It is a realy good game but the view is a bit maddening sometimes, its also ment to be as social as the old school mmo's. But it seems like I have played it befor the hole mint leaf in the mouth thing, someone message me and tell me why it seems so familiar.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and creative artwork, steady and enjoyable gameplay, this is a perfect game for the casual gamer (which I am because of work). Just the change I needed from the rest of the cookie cutter games. Thank you Katauri!!",
            "review_score": "1"
        },
        {
            "review_text": "It´s a really really slow game.... if you like stories and etc it can be a nice game but I personally don´t like the fact that you have to walk everywhere (Very slowly btw) complete quests one at a time....cause there are few and need to head all the way back to town to clompete them, Besides that it has some nice graphics kinda drawn but that´s the charm",
            "review_score": "1"
        },
        {
            "review_text": "When I first started out this game as a mage I only thought 'If RO turned 3D, this would be how it should have turned out.' Even though it's not the true 'Spiritual Successor,' I'd say this is RO 1.5.",
            "review_score": "1"
        },
        {
            "review_text": "This game is sooo cool,i prefer Archer cause of its super ranged attacks,and bandits for there good skills of backstabbing easily  Graphics are sooo great (soo great like tf2 but a bit not tf2)   mostly you easily enjoy the game while relaxed ,no raging,no sad people who die   BEST GAME EVER",
            "review_score": "1"
        },
        {
            "review_text": "Very good mmo.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is simplistic and entertaining enough. The game itself is completely free and I haven't come across any need to pay for access to content. Bag space, item development, and many other areas require in game currency you purchase with cash. The game would be better with a different microtransaction system for vanity based items.",
            "review_score": "-1"
        },
        {
            "review_text": "constantly crashes do not download till later at least or even never ",
            "review_score": "-1"
        },
        {
            "review_text": "So generally game kinda fun, but.. 1h playing 2h running around to do generic quests.. and laso this game is highly dependable of buying items with real money.",
            "review_score": "-1"
        },
        {
            "review_text": "I feel I can do a first look review since I played 90 hours now.  This game is what ranganork Online 2 should have been. If you liked RO you are going to love this game. In the other hand if you hate grinding, this isnt for you, questing is not a big part of the game, most quests give so little exp that you would rather grind instead. You can level up by questing easiely up to lvl 20-25 but after that you have to grind. If you played RO this might feel familiar and it shoul'nt be a problem at all. Grinding is not that hard and you get cool rewards for it. Also there are pvp zones with mobs in it where you can grind and the exp is at 120% just be careful with the other players.  So far this is not a pay to win for me. Theres a currency called Royale, which you buy with real money and with this you get a premium account that gives you boosts in exp and such. However you can buy royales with gold. At this moment it costs about 500k gold to get 3 days of premium account. In case you are wondering, 500k is not expansive at all, I had spend that when i was about level 25-30.  Finally: If you are going to give it a try play after level 20, this is when the game starts to shine. Althought for some classes is very hard to go from 20 to 30. I played as a crusader and as a Sorcerer. Sorcerer is the easiest class to lvl. Just mob mob and mob using AoE. At my current level (35) I can get a level per hour if I play good. In the other hand, the Crusader at lvl 26 i only can get a lvl every 2 hourrs of grind. This is because the lack of AoE skills, but everyone keeps telling me that at lvl 30 you get a skill (Grand Cross RO fans know) that allows you to kill a bunch of mobs at the same time and so they say is going to get easier even though the exp requierd is going to be a lot more. Right now for the Crusader I usually go in party to lvl faster. Lastley I've been playing a roug for a couple of hours but I cant say much about that because I havent play enought to get to 20.  PD community is great too. Bunch of Guilds, people is friendly and ussually like to play socially.",
            "review_score": "1"
        },
        {
            "review_text": "Love the community! Most people here to have fun. Good game play, server sometimes annoying with lag especially during sieges.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game with unique ideas, monsters can eat your drops and if you want them back you have to kill them! so much fun, and if you're reading this message and you're unsure to play or not, just do it man, i mean don't let the 'pay to win comments' get to you. game is surely not pay to win and can give you lots of hours of fun, people don't know what pay to win is. Pay to win is buying stuff with real money that you can't have any other way which makes your character stronger than others. Thing is.. You can buy everything that is on the item mall from other players or the market, the stupid people that give this game a bad reputation are just lazy to farm for gold to buy good items, ignore them, have fun in game :)",
            "review_score": "1"
        },
        {
            "review_text": "Still need a lot of work to be a good mmo ...",
            "review_score": "-1"
        },
        {
            "review_text": "This game spits in the face of every single gameplay and interface improvement made to the genre in the past 20 years.  Cluttered, tiny interface? Check. Incredibly boring and bland monsters and quests? Check. Characters with incredibly slow movement speed having to cross huge distances to do a quest, then slowly walk back to return it? Check. Painfully slow progression, with very little reward? Check. Pay2win goods being rubbed in your face constantly? Check.  If you like oldschool grindy MMOs this is for you. If you want something different and interesting I'd recommend eating nails over playing this.",
            "review_score": "-1"
        },
        {
            "review_text": "Really good game for it being still in beta has the best parts of WoW and yet its free",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun though lots of bugs to fix its fun i reccomend this game and if any of the creators are listening there's a bug where i will lagg out ranbomly and sometimes it will not alow me to log in",
            "review_score": "1"
        },
        {
            "review_text": "I tried it, but about died of sheer boredom by level 10. This MMO takes no risks and does nothing innovative at all. It is just like a bunch of other f2p MMO's out there (such as Eden Eternal). You pick from one of 4 generic classes, and then embark on a series of generic fetch/kill quests. The quest objectives eventually are so far away that you can just put your toon on auto-run and go make a sandwich before reaching them. They separate you by class, so forget questing with your friends unless you are all the same class. The stealth ability for the Rogue class made me cry...lasts a very short amount of time and makes you move extremely slow. I understand some movement speed decrease, but RQ takes it to the extreme. Overall: extremely disappointed. There are a ton of f2p MMO's that do everything this does but better. I honestly didn't even look at the cash shop, so I have no idea what is in it. I don't spend a penny on games like this anyways.",
            "review_score": "-1"
        },
        {
            "review_text": "Does anyone have an original idea for a game?  Meh.",
            "review_score": "-1"
        },
        {
            "review_text": "Royal Quest is a basic MMO-RPG that has the added feature of point-and-click movement. The quest objectives are very simple and there is little to no lore or plot. But, this game is a very good game for people who LOVE and adore progression (like myself), and players that are new to the MMO-RPG genre.  7/10 - Gets my thumbs-up for simplicity and playability",
            "review_score": "1"
        },
        {
            "review_text": "It just didn't seem to grab my attention. The combat style is basic. The camera is free moveable, but has limiters. I really wanted to look ahead of where I was going. It feels more like a Diablo style camera that you can move a bit.  I would most likely play again. I just wasn't really feeling it.",
            "review_score": "1"
        },
        {
            "review_text": "Royal Quest is a decent free to play mmo, it does not do much if anything different but it looks pretty, runs smooth and is simple to play. It is very simple so don't expect anything breakthrough, just a good amount of content we have already seen 're-skinned'. If you are looking for a new free mmo, without feeling pay to win, but also don't want to try one of the newer more popular games, I bet this could be a good fit for you. As I have ever heard of the game before its steam release I cant attest for how large the community will be after the Steam release players 'die-off', but overall I think the game is worth a try. Come in expecting a terrible game and you will be pleasantly surprised its not that bad.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly enjoyabgle f2p ARPG!  I certainly didn't expect a great deal initially, but absolutely enjoying this title!  The graphics and controls are well done, very fluid combat and with no lag at all. 4 Classes to choose from. The f2p mechanics are good, this isn't a B2W product up to this point (currently level 12).  The loot is good and mostly obtained from personal dungeons which is a neat idea. I wish mobs would drop loot ( mainly just craftable stuff it seems which is a negative).  Give this game a go if you like games ala D3, TQ and mythos etc...",
            "review_score": "1"
        },
        {
            "review_text": "First Hour; Kind of boring, but I'm giving it a shot anyway. Time to be a Warrior!  Second Hour; quests are getting more interesting, and the loot drops are getting better since I found out about dungeons Third Hour; Some grinding to get levels for better gear Fourth - Sixth Hours; HOLY MOLY NEW MONSTERS QUESTS WEAPONS AND ♥♥♥♥ Seventh Hour; some more grinding with a couple of the new monsters Eigth Hour; WHAT LOVE ARROWS WHY WOULD THE NPC'S BUY THEM FOR SO MUCH IT'S ONLY VALENTINES DAY Nineth Hour; decided to grind love arrows cause I could.... then got loads of money Twelfth Hour; just hit level twenty warrior.... time to become a dark knight! Thirteenth Hour; WHAT THE HELL IS WITH THIS BOSS Y U NO DO DIE?! Fourteenth Hour; ok I am a Dark Knight... I have awesome armour, a rideable bird and a ♥♥♥♥ING BAT PET Fifteenth - Sixteenth Hour; Made a second account which was a mage! Looking forward to try out new stuff! Seventeenth Hour; Found out that mages are overpowered to ♥♥♥♥... I got through most of the stuff in a couple of hours compared to the warrior class which took AT LEAST double that.   Conclusion; Awesome game but for the record, there isn't a huge amount of quests for people to do... It's basically the same quests for every character no matter who it is. But it still it very good. For a free game, pretty good! I give this a 7/10  P.S I know I had said there aren't varied quests depending upon your character, but keep in mind that this game is currently in BETA TESTING. Be patient with it and new quests should pop up sometime in the future.",
            "review_score": "1"
        },
        {
            "review_text": "A Good Open World MMORPG with good mechanics there is a little of a pay to win in it but you still could do WITHOUT paying ANYTHING.Yes i would recomend this game if you're looking for a good MMORPG with an okay-ish community If you did not know you can lower the minimum speculations of your computer to a 1 gigabytes worth of ram and just a windows 7 starter.runs fine",
            "review_score": "1"
        },
        {
            "review_text": "This Game Just Like Ragnarog Or If You Know R.O  This Game Just Like That Soo EASY To Play",
            "review_score": "1"
        },
        {
            "review_text": "This Game is Amazing and i know play it or i will rip the happy right out of your soul",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what everyone's problem is that is giving negative reviews. Yes it's pay-to-win and is much like other games, but nowdays, there's just so many mmorpgs, it's hard to find anything unique anymore. Just each games has their own style and variations. And as far as pay-to-win goes, that's what you will get when you play a FREE TO PLAY game... The damn makers of this game have to make money SOME HOW to keep the games going...    Let me get one thing straight about all the negative reviews.... All these things things the negative reviews are complaining about, is just pretty much what you will find in any typical free to play mmorpg.   Now here's my personal opinions on the game so far:   Pros:  The graphics are beautiful for this type of game, way more beautiful than I expected. The things that you can do to upgrade your gear is a nice feature. So far from the low level maps, I've found these randomly spawned gravestone things that you can click and go into a mini-dungeon (I assume). I've found these quite fun to do because you can get some decent loot from these. I hope there's more in the game! The characters and customization all look quite nice. The faces look just a little weird on some of the options, but other than that, I really like it. There's a decent amount of options for you're character's looks, more than even some mmorpgs I've played. I'm a sucker for character customization, so I really hope they add more features to this. I haven't gotten into crafting (if there is), but what I'm seeing looks like it should be interesting as well. The classes, skills, and stat points when you leveling, all this I really like. There's a unique (to me anyhow) feature for spending your stat points each time you level. The amount of options you are given in the settings (graphics, sound, chat settings etc...) is very nice as well. Games that give you a lot of settings and customization is always nice.   Cons-ish:  I do hate the click to move, but from all the mmorpgs/games I've played, I'm use to it by now. Bag space is annoying, but I just put things in storage I don't keep any time soon, and sell everytime I go into town. So I never really run into many problems with it. There are pvp zones, I'm not quite sure how it all works, but I look forward to exploring this. From what I've heard though and from what it seems, it doesn't tell you when you are in a pvp zone. Hopefully this stuff will be changed up some. There is a 10min death penalty. After you die, you're stats are decreased for 10mins, but this can be removed for 500g (which is REALLY easy to get) from the respawn points. So it's not a big deal.   TLDR?  The game has it's ups and downs. To best figure out if YOU like the game, I'd honestly suggest trying it out. Like I was saying earlier though, these negative reviews are kind of BS. Their complaints are stuff you will deal with in almost all free to play games.  Every game is going to have at least 1 thing you don't like, after playing games almost my whole like, and 12 years of it being mmorpgs, I've learned you just work around it and deal with it if you like the game enough. No game is perfect :P",
            "review_score": "1"
        },
        {
            "review_text": "After 10 levels of game play i'm happy to say its a good game, feels and plays like RO :D",
            "review_score": "1"
        },
        {
            "review_text": "Hello all, Just want to mention this game is awesome and it's something everyone should try out and play. :)  This is NOT pay to win game everything can be bought with in-game cash. I only bought a mount with real-life cash to help support the developers.  Classes in this game are amazing and well worked.  Pros: - Awesome community, everyone is helpful - Guns! What else can I say we all love guns in an action game :) - Crafting is well worked - Dungeons on this game are cool  - Looting items, the looting system is awesome in this game  - Classes are well balanced out and easy to use  Cons: - Camera angle, would be awesome if it was all-round up and down camera - Spending Reales to revive your character when dying in the spot you died at - There isn't a lot of quests, there needs to be more! - There is only a few cities to explore - Not able to zoom-out further  - Using mouse to control your character movement would be better with WASD  That's all, just another mention this game is worth a try and it's only going to get better! Awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "If you thought what Diablo III was missing was endless fetch quests, look no further!",
            "review_score": "-1"
        },
        {
            "review_text": "This MMO has a old school feel which is lost in the MMOs of today and thats a good thing.",
            "review_score": "1"
        },
        {
            "review_text": "Even Though This Is Not Original.....It Still Applies  Atleast the uninstall works.",
            "review_score": "-1"
        },
        {
            "review_text": "Rating: 6.5 out of 10  Genre: MMORPG  Thoughts: If you liked Ragnarok Online (Ragnarok One, the old 2d/3d one) you will surely like this game... it plays like Ragnarok Online and seems to be like a slight copy of it with graphical upgrades but some things are changed as well but play great, good play if you are into Ragnarok Online, in my opinion",
            "review_score": "1"
        },
        {
            "review_text": "You can try but will probably yawn after a while. As it is free, i will set a thumb up. After some hours playing, i have not discovered how to craft.  Yes, try it, it could amuse you, it is well done.",
            "review_score": "1"
        }
    ]
}