{
    "app_id": 295590,
    "name": "Hero Generations",
    "release_date": "2015-04-10",
    "developer": [
        "Heart Shaped Games LLC"
    ],
    "publisher": [
        "Heart Shaped Games LLC"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Rogue-like"
    ],
    "achievements": 0,
    "positive_ratings": 114,
    "negative_ratings": 90,
    "price": 4.79,
    "description": "The original roguelike/4X strategy game where every turn is one year of your life. Explore, find a mate, build a home, and raise a child before you die to keep your legacy going. Praised as &quot;the offspring of Sid Meier's Civilization, Jason Rohrer's Passage, and The Legend of Zelda.&quot; 2011 IndieCade Finalist.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/295590/header.jpg?t=1478031638",
    "minimum_requirements": "OS: Windows XP or later Processor: 2.33GHz or faster x86-compatible Memory: 1 GB RAM Storage: 150 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Easy to learn game that offers quite a few hours of fun.  Pros -It keeps getting updates  -Good concept -Roguelike -Allows you to feel strong just to watch you fail -Health used as a new kind of barrier -Pretty tested and mostly bug free Cons -short, easy to replay but the game needs to have 3x the size -Maybe a little too random, its possible for your world crushing hero to lose to a basic bandit 1/100 of the time -Lack of real customization -Generations dont feel meaningful, you can pretty much skip the first 10  Overall i would recomend this to anyone who wants something they can waste 10 hours mastering and come back for the updates.  I enjoyed the game quite a bit.  ",
            "review_score": "1"
        },
        {
            "review_text": "What will you leave behind? That's the question that Hero Generations poses to the player. Every step is a year of your life. One step closer to the grave. Hero Generations is deceptively simple from the outside. Adorable graphics and minimalist UI make it easy to approach and play. However with its Roguelike and 4X elements. Careful planning and thinking ahead is rewarded. Making it required to make progress in this game. Suddenly each step isn't so simple and the games complexity truly shines. Now sadly, Hero Generations does suffer from some basic technical problems. Lack of manual save, fullscreen support, save data corruption to name a few. With time these issues will be patched up though. If you enjoy any of the aforementioned genres. Hero Generations is an enjoyable, easy to play title. That offers plenty of replay.  I made a video review to show off some of the features and gameplay of this game!         YouTube™ Video:  IndieView - Hero Generations&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Really clever game. Does a lot better job of doing a multiple generation rogue-like than Rogue Legacy, I feel, and has quite a few interesting ideas behind it that I've never seen in other games, and that's pretty rare nowadays. It does seem like it's possible to beat, but I couldn't figure out how to stop the volcano without dying in my 10th generation first. Overall I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "The Hook: An adventure game where you age 1 year every turn.  Sounded like a very cool idea when I Kickstarted this project, and the end result is just as I expected. A neat little game where time is your greatest enemy that has you thinking about genetics, heredity, and your legacy.  Simple, fun, and hard to stop playing.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It's got the element of endless discovery that keeps me coming back. It's easy to jump in a out at will. Nice music, fun character design, and is constantly giving me great difficult decisions. The balance seems really great as well, keeping you in the happy part of the difficulty curve, never too easy or too hard.",
            "review_score": "1"
        },
        {
            "review_text": "I am ten thousand years old and can punch archdevils to death.",
            "review_score": "1"
        },
        {
            "review_text": "I am ten thousand years old and can punch archdevils to death.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game. Addictive.   better resolution to be played, 1280x720 on tv screen  Developer would make a clan Name for all characters' lineage. First enter your clan name, and then, current new born character.   Sometimes, appears male or female names to opposite sex, but you can rename.  ",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game. It lets you run around and play how you want. Build up cities, kill monsters or do both at the same time. There are a few problems though. After every few moves the game auto saves. The delay is pretty noticiable. Even worse, The game is not able to load those saves when you close the game sometimes. So you could lose whatever work you've put into the game. But at less than $15 it's still a pretty decent time killer. It would probably do well as a mobile game.",
            "review_score": "1"
        },
        {
            "review_text": "Each heroes life passes way to fast. Other then that its damn difficult.  One of the few PC games i rather see for a mobile platform and would do better 'on the go'.     3/5 - Would pledge again.  ",
            "review_score": "1"
        },
        {
            "review_text": "Would hae given a 4 or 5 star review, but the save system is hopelessly broken, so it's unplayable. EDIT: They fixed the issue and I had a good time playing this game. At the time I played, I was frustrated that there didn't seem to be any functionality with the volcano torches, but other than that would recommend for sure.",
            "review_score": "1"
        },
        {
            "review_text": "This game can not be recommended because the developer is working on a Unity engine remake which will be sold separately to this Flash version. It's due to release in August 2016. The remake will make this version completely obsolete. If you're interested in playing this game search for 'Hero Generations Regen' on Steam and click 'Follow' or 'Add to wishlist' and wait until it comes out instead of wasting your money now. It will probably be a fairly decent game if it's just various improvements on this version, which isn't terrible to begin with.  I'm only posting this as a review to let people know because the developer doesn't want to put anything on this store page about it.",
            "review_score": "-1"
        },
        {
            "review_text": "Is being remade in Unity as a new game so really not worth buying",
            "review_score": "-1"
        },
        {
            "review_text": "Quite a fun game however I've yet to be able to complete a game due to some bug preventing me for being able to move for example.   I bought that game based on reviews that claimed it has a lot more depth to the game than you would imagine. This has not been my experience. I find that I can ignore all the buildings except the ones that give strength. Spam those and you can kill anything.   This has worked on each world so far. As a result I've found that I've become quickly bored of the game.  The traits and card system really hasn't made any difference to the way I play and influences the gameplay in such an insignificant way that it quickly becomes a chore to have to keep picking the cards.  I hope there is more to come because the game does have a lot of potential. Priced at 1.99 on mobile devices it would be a good deal but I feel it's overpriced for what you get on the PC.",
            "review_score": "-1"
        },
        {
            "review_text": "Wouldn't recommend. For $15 you can get games with far more content. You'd think a game with the concept of raising heroes and going through countless generations would have a lot of replayability to it but it got old fast. I was disappointed in the player models and I didn't like how you couldn't raise your base attack. You could be extremely strong and still roll lower than the weakest of the weak. Game was pretty laggy as well.",
            "review_score": "-1"
        },
        {
            "review_text": "Poorly ported mobile game",
            "review_score": "-1"
        },
        {
            "review_text": "Has a cool consept but its no fun at all",
            "review_score": "-1"
        },
        {
            "review_text": "May look interesting but gets pretty boring, pretty quick",
            "review_score": "-1"
        },
        {
            "review_text": "I liked the look of this game when I first saw it, and bought it within half an hour of doing so. Unfortunately I find that it's not a game I'm particularly fond of. I found myself bored within an hour, and unable to find many ways to build a sustainable dynasty, or achieve much at all. At very best I could defeat one easy boss in a lineage, and then once that lineage ends you have to start over in a completely new world, so any progress you managed to make is now gone.  I've never been as strategy minded as some in these kinds of games, so I'm sure there are people who would do a much better job of this game than I. Personally, while I love the art, the game was not for me, and isn't one I'd recommend to friends.",
            "review_score": "-1"
        }
    ]
}