{
    "app_id": 295630,
    "name": "Defense Zone 2",
    "release_date": "2014-05-30",
    "developer": [
        "Artem Kotov"
    ],
    "publisher": [
        "Artem Kotov"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "Strategy",
        "Indie"
    ],
    "achievements": 93,
    "positive_ratings": 78,
    "negative_ratings": 17,
    "price": 2.89,
    "description": "Stunning detail of levels, in-depth gameplay, finely tuned balance of all levels and turrets. The new, engaging levels are even more stunning and impressive.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/295630/header.jpg?t=1447361501",
    "minimum_requirements": "OS: Microsoft Windows XP or later Processor: 1.5GhZ Memory: 512 MB RAM Graphics: OpenGL compatible. ATI, NVIDIA or Intel HD. Older Intel graphics cards may have slowdown issues. DirectX: Version 8.0 Storage: 512 MB available space Sound Card: Windows or Mac compatible",
    "recommended_requirements": "OS: Microsoft Windows XP or later Processor: 2.0 Memory: 1024 MB RAM Graphics: OpenGL Compatible. ATI, NVIDIA or Intel HD. Older Intel graphics cards may have slowdown issues. DirectX: Version 9.0 Storage: 512 MB available space Sound Card: Windows or Mac compatible",
    "reviews": [
        {
            "review_text": "Great Tower Defense Game, ive got both of them on my phone so its one of those you can play at any time an still enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "So Awesome lol",
            "review_score": "1"
        },
        {
            "review_text": "Realy nice tower defence with good 3d graphic, on lvl hard game start be challenging, i spend many hours on my tablet trying master some maps but is hard :) now i got it on PC and no more battery killing",
            "review_score": "1"
        },
        {
            "review_text": "VERY FUSTRATING AS YOU NEVER SEEM TO EARN ENOUGH TO UPGRADE THE UNITS QUICKLY ENOUGH",
            "review_score": "-1"
        },
        {
            "review_text": "What a load of crap. The enemy units will start anywhere along the path.  You place you towers near the start of the path, expecting the enemy to all start at the start. Then with no warning, you will be defeated simply because the idiot developers decided that it is ok for the enemy to start at any poing along the path!  DO NOT BUY!!!",
            "review_score": "-1"
        }
    ]
}