{
    "app_id": 295850,
    "name": "Vlad the Impaler",
    "release_date": "2014-07-16",
    "developer": [
        "Section Studios"
    ],
    "publisher": [
        "Section Studios"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Visual Novel",
        "Adventure"
    ],
    "achievements": 30,
    "positive_ratings": 258,
    "negative_ratings": 110,
    "price": 0.79,
    "description": "A city gone mad with violence and the mass murder of its people. In this interactive graphic-novel, your choices can either lead you to the ultimate destruction of this fallen metropolis, or the demise of a vicious butcher. Will you save this city as promised or will you fall prey to the killer within?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/295850/header.jpg?t=1447361508",
    "minimum_requirements": "OS: Windows XP or Later Processor: Core 2 Duo Memory: 2 GB RAM Graphics: 256 MB graphics memory and directx 9.0c compatible gpu DirectX: Version 9.0c Storage: 512 MB available space",
    "recommended_requirements": "OS: Windows XP or Later Processor: Core i3 Memory: 4 GB RAM Graphics: 256 MB graphics memory and directx 9.0c compatible gpu DirectX: Version 9.0c Storage: 512 MB available space",
    "reviews": [
        {
            "review_text": "Recommended but ONLY while it's on sale, and ONLY if you don't mind a game consisting purely of reading and choices.  Vlad the Impaler has virtually no gameplay, and the only thing you, as the player, do, is make choices as the story unfolds. At its most basic, it's a choose-your-own-adventure type of game, but of course, the subject matter is different from the traditional children's books. Your character is sent by his liege, the eponymous Vlad, to investigate the increase in murders and violence in Istanbul, and depending on the character you choose, you will have different means to conduct your investigation, and defend yourself when attacked. Your character has stats, and they will increase and decrease during the adventure, making him or her better at surviving in different ways.  The writing is gripping and engaging (though for some reason, the word 'and' is always missing), and while a playthrough can be completed in fifteen minutes, you'll find yourself doing quite a few of them, because it's impossible to do everything in one playthrough.   Negative points about the game are the fact that you don't know what outcomes your choices will have (and sometimes they'll be questionable), and that the stat increases and decreases seem to be a bit strange at times.  So if you like reading and playing a choose-you-own-story type of game, and you have a vivid imagination, you can buy this one while it's on sale. Its regular price isn't justified, not out of quality concerns, but by how short a playthrough is.",
            "review_score": "1"
        },
        {
            "review_text": "A well-written visual novel with rpg elements. It plays like the old choose you own adventure books from the 90's, except here your choices influence the stats you gain as you progress towards a final battle against Dracula. With its dark story and gothic art, this is a nice choice for those looking for something a little different than the typical anime-inspired VN.",
            "review_score": "1"
        },
        {
            "review_text": "If I mention the phrase 'visual novel', that probably means something doe-eyed and infuriatingly passive to you. Visual novels outside the realm of anime are as rare as unicorns but they do exist, and are on occasion just as magical. Vlad the Impaler is one such offering, allowing you to do battle with the forces of evil through a tight narrative structure and careful choices of words.  After picking one of the three starting classes you are whisked away to the exotic streets of Istanbul where evil is afoot. Dark forces have gripped the city, spreading death and madness to its furthest corners. Your task is to root out the source of this blight, and you do so through text adventures. Each day you can take three actions by choosing a location from the map and an event that occurs there. As you read through the event, you'll be presented with a choice that affects the outcome, and the rewards (if any) that you'll receive.  The events to partake of in Istanbul range from buying falafel at the market to unearthing eldritch gateways beneath the city, but make no mistake, every choice you make carries grave consequences. Helping a beggar at the docks might give you an important clue to use in a later tale, and small favors can unlock new options on subsequent days. Your character also has eight stats to track that are used in skill checks late in the game, and can be raised or lowered as the result of your choices.  Each of these events is presented in fine narrative style, describing the action and details in clear prose. Every action comes alive with sickening crunches, putrid scents, and threatening shadows. You may also have gathered there's very little light or levity to the story, and I definitely won't deny that. Plenty of people will die in gruesome fashion, many dispatched by your own hand. For most of the game you'll find your character nigh immortal, pulling through ambushes and attacks with surprising ease. All of this is presented in an excellent monochrome sketch style that helps sell the atmosphere of ancient, unspeakable dread.  You'll spend five days in the city, chasing down leads, battling evil, and hopefully getting your stats up to where you need them. That's because day 6 opens with a steep skill check that can end your game immediately if you don't make the right choice for your character build. If you manage to prevail, you'll be presented a selection of powerful weapons and then head off to the final confrontation. This is a series of dramatic scenes against powerful foes, culminating in a literal boss battle with a menu of combat options. This is not at all a simple battle, for your success will depend on the order in which you use your options and whether or not your skills support those options.  The stat system ultimately is what holds this game back the most, because it is obscured in the worst ways. There's no indication other than textual cues of what stats affect what choices, nor is there any way to know what effect story choices will have on your stats until after the fact. That means your first few adventures will end quite suddenly and ignobly on day 6, and will continue to do so until you start memorizing which events give which stat bonuses. It's a surprisingly technical game but in a very static way, challenging you to puzzle through the same routines over and over until you find the optimal path.  I don't think most people will have the patience to conquer Vlad the Impaler more than once, but then again I don't think they really need to. The excellent writing and presentation will carry the game for a few adventures at least, and those intrigued by the mechanics of the game will stick with it longer. I would appreciate it more if it were more forgiving of novices, but there's still plenty to appreciate even if you can't best it.",
            "review_score": "1"
        },
        {
            "review_text": "Very beautiful artwork and a very interesting story well worth the price. Unique story with depth that really places you in that world.",
            "review_score": "1"
        },
        {
            "review_text": "Like reading a book, only if you die you have to go back to the first page.",
            "review_score": "1"
        },
        {
            "review_text": "First time i saw this game, i was like ,'Awesome! A game about Vlad The Imapler! It must be epic!' And i was right, it is epic, if you like a well made story, you will like this game!",
            "review_score": "1"
        },
        {
            "review_text": "First things first, is this game worth 10 dollars? Absolutely not. It lasts an hour and a half at most, and that's only if you do a seperate play through for each character class. However, if you've got a lot of money to spend and don't mind the relative lack of content, there are certainly worse ways you could spend it. For the short time I played this game I was at least reasonably entertained by it. If you like choose your own adventure books or visual novels, you might actually like this game. Just don't come into it with grand expectations.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed every minute of this game, especially the music and the art work which really set the dark, gothic atmosphere this game was trying to achieve. However the price of this game is not worth it for something as short and basic as this, this is its biggest drawback considering you can get games such as FTL for the same price.",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely amazing tale, with a lot of replayability for an interactive adventure. Hihgly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "just finnished playing for the first time ...TOTALY HOOKED! XD",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those choose your own adventure type games. You read text, you make choices, those choices affect your stats. The art reminds me of Gustave Dore's art for Paradise Lost (which is actually kind of fitting given the subject matter) and is mostly black and white with a bit of brown thrown in. You can choose one of three characters. Your choice doesn't really impact the game that much, although they appear to get different events. There's some great writing and atmosphere in this game, from cannibal priests to ritual murders to attending swanky parties at the Sultan's Palace, you'll find all that here and more.   The game reminds me very much of the Yawhg (also a text-based horror game( but unlike the Yawgh, it seems to lack any random elements. Events seem to play out the same way for each character regardless of stats, your stats only really seem to have an effect during the final battle and that.....is very disappointing..... it's also really short, my first playthrough maybe took me twenty minutes because I was carefully reading everything, subsequent playthroughs took about five minutes.   Despite being disappointing in a number of ways, I'm giving it a tentative recommendation because I love text-based games like this one, and if you liked The Yawhg you should definitely check this one out. If the game were a bit more random I'd certainly recommend it, but as it is now, I like it, I think it definitely has potential, but the execution is....not as great as I'd hoped. I would definitely recommend waiting for a sale at this time.",
            "review_score": "1"
        },
        {
            "review_text": "Never got so much fun from such a cheap and low graphics game. Definitely worth the money, lts of replayability",
            "review_score": "1"
        },
        {
            "review_text": "I am genuinely enjoying this game very much, and have played it through twice since I bought it tonight. It's not without a few flaws, but I found the art style and tone of the game very charming. It reminds me of old Ravenloft adventures. If you're more of an 'old-school' gamer who likes horror, you could do worse for ten bucks. I don't imagine this is everyone's cup of tea, though.",
            "review_score": "1"
        },
        {
            "review_text": "It is a fun, short and decison making game. Pros: + The Vlad theme is always creative and full of mysteries; + There are several decison making elements that drives choices with rewards or penalties; Cons: - The decisions are always the same; - Repeating the game might be fun to test different choices, but it ends up quickly;  I would say, but it cheat.",
            "review_score": "1"
        },
        {
            "review_text": "This game does a great job of pulling you in to the atmosphere of the story. You can help cure the evil and test your own conscience at the same time.",
            "review_score": "1"
        },
        {
            "review_text": "better than the other vn iv read sofar - somuch better than them cutesy animes ones",
            "review_score": "1"
        },
        {
            "review_text": "Vlad is a short game, but it's really fun for the small amount of time that you play it. The game has a lot of achievements and aspects that you can only get from making certain choices. This requires you to play through the game multiple times and make new choices along the way.",
            "review_score": "1"
        },
        {
            "review_text": "THE UPSHOT: This is the only gothic horror visual novel I’ve ever encountered, and I could almost recommend it solely on that basis. I have many gripes with its implementation, but given its low price and short playthrough time, there’s no real reason for other gamebook and visual novel fans to not give it a try.  DETAILED OPINIONS:  Vlad the Impaler is a horror-genre visual novel with RPG elements that features awesome gothic art and honestly disturbing writing—which I consider a plus in a horror story. Overall, my feelings about this game are pretty conflicted: there’s a lot done right, but there are a couple significant issues with it that are difficult to overlook.  The most immediately obvious issue is the seemingly un-proofread text: there are blatant errors, such as missing words, in just about every paragraph. I honestly find this bizarre: the content of all of the writing (the situations, word choice, overall tone, etc.) is quite good, and presumably required some care to write, so how can it possibly have so many errors?  Another annoyance is that there is no continuity in the overall story. Some late-game storylets refer back to earlier storylets that you may or may not have seen, and the chapter transitions are extremely jarring (how the heck did I go from exploring the sewers to on a rooftop with an assassin?!).  Finally, the RPG elements seem really pointless. There’s no real control over which stats are boosted/penalized, so clearing the mandatory skill challenges seems very random. I’ve seen visual novel/RPG hybrids done well before (such as Long Live the Queen), but they were poorly implemented here.  If this were a longer or more expensive game, I couldn’t recommend it, but I think the quality of the art and writing is good enough to justify spending $1 and 30 minutes on the experience. ",
            "review_score": "1"
        },
        {
            "review_text": "Interesting story, great art and nice music. In my opinion it's worth the price unlike all those blank no art choice games that keep polluting steam. Really, people should stop giving this a thumbs down just because it's what it is, a visual novel of sorts. Just don't get this if you want a hack and slash...",
            "review_score": "1"
        },
        {
            "review_text": "This game is, unfortuantely, a mess. The drawings are beautiful, but there are tons of random words just missing from the narration, which can make it hard to follow. Otherwise the writing is good, but the missing words are consistent and pervasive. The chunks of story aren't written modularly enough to support having so many choices all at once; often you'll visit a place and people will reference information and events that haven't happened because you visited in the wrong order, even though there's no indication of an order. Because of that, you don't get a coherent narrative out of it unless you're lucky. All in all, this sounded like a great idea, but it doesn't work at the moment.",
            "review_score": "-1"
        },
        {
            "review_text": "The game isn't difficult to figure out, but there is no explanation of character attributes or any real story to be found. Though there are some OK images shown and the storytelling itself somewhat engrossing, the entire package is fairly lacklustre and uninspired.  The entire game boils down to a randomized choose-your-own-adventure novel; each randomly generated story path has 2 outcomes, some bad, some good, some neutral. Your stats and previous choices seem to have zero impact on future events.   Bugs and unfinished portions of the game appear frequently. Needs polish.  Overall: horrendously overpriced, low content, low replayability, unfinished. Don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is like opening a beautifully wrapped gift on Christmas morning and finding socks inside. Not even good socks, but mismatched ones with holes in the toes.  Wrapping paper: The art, GUI and music are all utterly gorgeous. Holey socks: The game mechanics and story are a complete wreck.   Vlad the Impaler  takes place over the course of fifteen turns, broken up over six chapters. Each turn allows you to take a single action, which gives you a little snippet of story and presents a moral dilemma, and your decision affects your stats. For example: you can go 'Buy a Falafal' where you run into a fugitive, then choose to help or condemn him, which results in a plus or minus to certain character attributes. After three of these events, the chapter ends, and you get new information about the plot.  The trouble is, there is no guarantee that the three actions you take will be related, and there is no indication anywhere which ones are most important to the main plot. Some events seem totally random, and the story appears to be unaffected by your choices to the point that it moves on without you. Because you can only take three actions in each act, and thus only get three little vignettes of plot that may or may not be directly related to each other, you will  never  have all the information necessary to make real sense of the events that come later, unless you play through the game several times to read  everything , which is an extremely ♥♥♥♥♥♥ way to tell a story. Entire chunks of plot just end up  missing ; and when each chapter ends, characters you've never met before may pop up and allude to events that haven't happened because you didn't play through them.  In most visual novels or other games with choice based gameplay, events you play through are flagged by the system and ONLY storylines pertaining to the actions you've actually taken play out. That's not the case here, and it makes for a frustrating experience.  There's also the fact that, while choice is a selling point in games of this type, there is a  lot  of God Modding in this one that make your choices seem arbitrary and worthless. Free will is mostly an illusion in  Vlad the Impaler , and the plot moves you where it wants you to go without your say so. Suppose you choose to follow a mysterious woman who catches your eye and end up back at her home; when she tries to seduce you, you kill her and slice her head clean off--and the only part of this that was your choice was  following her . You aren't given the option to coax information out of her before beheading her, or let her carry on with her seduction, or anything else, because God Modding is in play: you WILL do what the plot decrees whether you like it or not.  It doesn't help that the prose leaves a lot to be desired. It's sufficiently atmospheric, but the grammar is terrible, a lot of punctuation and whole words are missing and many of the events are cliche. I might be more forgiving to those if the rest of the game's problems were less annoying, but as it is they're just salt in the wound.  If the devs ever do an update that allows for more events or choices each turn or at least fixes  some  of the grammar and punctuation issues, I would reccommend this in a heartbeat. (With the usual provisos about its content--it's violent, and falls into many of the usual tropes that are pretty boring at this point.)   As it is, I'm going to have to say: give it a pass unless you can get it for at least 50% off.",
            "review_score": "-1"
        },
        {
            "review_text": "Well that was disappointing.  It's your basic choose your own adventure - like those books you used to read as a kid. You occasionally get to make a decision that...doesn't really have any bearing on the story. I was bored by chapter 3.  It's a great premise even though it could use a bit of fleshing out. I love reading, but when I buy a game I'd like to actually play otherwise I'd have bought a book.",
            "review_score": "-1"
        },
        {
            "review_text": "The story isnt cohesive. there is only one time where you make any choices that effect gameplay. then it makes little difference what you choose. The setting of the story is in an interesting place. so much more could have been done. THIS GAME IS A RIP OFF!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I played it enough for it to be a waste of my time and instead offering me nothing I couldn't get from a free online RPG. The story doesn't make any sense, the 'history' that the game is based on doesn't make any sense (why would crusading Christians want to save a Muslim city?!), the gameplay doesn't make any sense. Stay away.",
            "review_score": "-1"
        },
        {
            "review_text": "It is a game I don't like what you might like it if you like to read every thingLiterally everything.And if you mess up one time you You die or if you can get any of the endings.",
            "review_score": "-1"
        },
        {
            "review_text": "Too boring to retry again and again.",
            "review_score": "-1"
        },
        {
            "review_text": "A limited-path, railroading, linear video game version of a choose-your-own-adventure novel. Too often the events are random, and feel completely beyond the user's control. No explanation is given for the RPG elements, while the dialogue and lore are poorly written and ultimately unsatisfying.  The underlying plot and themes are potentially very good, but the execution is sorely lacking.",
            "review_score": "-1"
        },
        {
            "review_text": "There is no real gameplay to speak of here; this is basically an interactive novel, where once in a while you can pick one of two choices. The stats don't seem to actually mean anything until the final (and only) battle, where you likely won't have them high enough to be of any help, because you raise them randomly by arbitrarily picking a place to search for clues every turn.   I would avoid this even if it's on sale. I got this looking for a CYOA type story after getting hooked on the Heroes Rise trilogy, and was extremely disappointed.",
            "review_score": "-1"
        }
    ]
}