{
    "app_id": 295930,
    "name": "Swipecart",
    "release_date": "2014-05-08",
    "developer": [
        "Micro Factory Games"
    ],
    "publisher": [
        "Micro Factory Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Racing"
    ],
    "tags": [
        "Indie",
        "Racing",
        "Casual"
    ],
    "achievements": 20,
    "positive_ratings": 252,
    "negative_ratings": 301,
    "price": 1.99,
    "description": "Swipecart is a physics powered mine cart racing game that rewards patience and skill. It combines vehicle physics with clever and challenging level design. Compete for the fastest times across 60 official tracks and 3 deadly mountains, or create your own.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/295930/header.jpg?t=1447361510",
    "minimum_requirements": "OS: Windows XP Processor: 2.0GHz Memory: 2 GB RAM DirectX: Version 9.0 Storage: 40 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Did the first 5 tracks and got 1-0% top scores on all of them so the controls seem to be alright... yeah they are finnicky and imprecise in some ways but they work for me fine at least. Got the game for free so I'm satisfied so far. Give it a go if you can get it cheap or for nothing.  EDIT: This game is insane... in both a good and bad way. It's a love or hate it kind of thing and I got to agree with some of the reviews that this type of gameplay is better suited for a touch enabled mobile device but still, for cheap, it can hit that gaming itch on the pc as well.  I for one am glad it's on steam.",
            "review_score": "1"
        },
        {
            "review_text": "Not a long game, not a breath-taking game. But it was fun enough to be worth $3.",
            "review_score": "1"
        },
        {
            "review_text": "Funny and lovely game to play.  Higly recommended , don't let the looks decieve you , a little brainer :-)",
            "review_score": "1"
        },
        {
            "review_text": "Nice game!!",
            "review_score": "1"
        },
        {
            "review_text": "Completed a race with a cart upside down and stuck when riding from the hill. 10/10 would ride again.",
            "review_score": "1"
        },
        {
            "review_text": "hehehe funny retro game",
            "review_score": "1"
        },
        {
            "review_text": "It is actually very fun game (got it free) ",
            "review_score": "1"
        },
        {
            "review_text": "I glitched into a see-saw and somehow got a new hat.  10/10 It's an okay game for the fact the dev's are treating this game as if it's an inactive community. But I would beg to differ",
            "review_score": "1"
        },
        {
            "review_text": "This game is really addictive, loads of fun",
            "review_score": "1"
        },
        {
            "review_text": "Minecraft, retro style cart with fresh mechanics. Fun for a while.",
            "review_score": "1"
        },
        {
            "review_text": "  WARNING:   Swipecart used the 'free code if you vote' system on greenlight.  This game is not correctly set-up for PC, everything is HUGE on the screen, creating your own levels is a chore, and controls are trippy as hell (you have to move your mouse back and forth on the screen to move).  I'd give it a 2.5/5, this is not a PC game, I'd recommend it for tablet users. Steam workshop support will not change my mind, it already has the worst editor ever.",
            "review_score": "-1"
        },
        {
            "review_text": "I would if I could...totally recommend this game, however it can give me serious rages on some maps. The main reason for this review is to establish that anyone who has a short temper should NOT play this game unless they don't play it on a PC.   It has really awful control of the breaks and wheelies...it makes some maps impossible to get with gold medal and perfect gems even though you played it right (unless you do it like 30-50 times until you get it perfect). So...as a conclusion, when they'll update the controls (which after all...are one of the bases for a game), I would totally recommend the game for thrill seekers and stubborn people who like challenges.",
            "review_score": "-1"
        },
        {
            "review_text": "0,1 hours spent in game, that's whole 6 minutes and gotta tell, I've wasted em, nobody ain't gonna bring em back. There was one enjoyable moment though, when I uninstalled it.",
            "review_score": "-1"
        },
        {
            "review_text": "A bad port. It made the attempt, but it failed. Just get the mobile version.",
            "review_score": "-1"
        },
        {
            "review_text": "Annnddd there we have the worst game of 2014..!",
            "review_score": "-1"
        },
        {
            "review_text": " Swipecart  is a mobile game that should have stayed mobile. As far as I know, the idea's original, and the execution's not bad, but this direct port makes it painfully obvious that the game was designed for a touchscreen device. Not only do the controls feel awkward with a mouse, I found that scrolling in level selection is outright broken, making it so only the first few levels can be selected. Having gotten it for free, I don't regret giving it a try, but I wouldn't want to continue with it even if I could, and I can't recommend it (as a PC game).",
            "review_score": "-1"
        },
        {
            "review_text": "Guys, run away from this game..I mean 3 euros for this?   1st of all, this is completely made for smartphones  2nd of all, the controls on PC is pretty much ducked up..   3rd of all, 3 euro is just too much. Way too much, but at least it has 3 cards and 20 achievements which are easy to obtain.  Since we got this for free, it is good to farm cards and achievements, nothing much.. After 10 tracks you will want to shut this game down as fast as possible.",
            "review_score": "-1"
        },
        {
            "review_text": "Very bad IFONE game, control are awful, the 1st levels are easy after that, it's start getting very difficult which will lead to frustrating, glad I got it for free and not in my smartphone, if so i will smash it  ▂▃▅▇█  final judgement : 30/100  █▇▅▃▂",
            "review_score": "-1"
        },
        {
            "review_text": "Planetside 2 &gt; Swipecart",
            "review_score": "-1"
        },
        {
            "review_text": "It is bad",
            "review_score": "-1"
        },
        {
            "review_text": "This game is meant to be played in touchscreen device, not good in pc.",
            "review_score": "-1"
        },
        {
            "review_text": "Swipecart is a game that I can't recommend because: - is boring as fu*k - the graphic is too bad - have no sense  The only good reason to install this game is just to collect the cards!",
            "review_score": "-1"
        },
        {
            "review_text": "I don't like saying there is a game is bad but this one is.Why would some one make a game like this its just like playing a celfone game on a pc",
            "review_score": "-1"
        },
        {
            "review_text": "I want to recommend this. I really do. It's a fun little game that held my interest for much longer than I expected. But it's clearly not designed for computers and mouse control. The swiping and holding and flicking just doesn't work with a mouse. The game doesn't know if you're trying to brake, wheelie, or jump. And with broken controls, you don't have a game. You have an unplayable mess.",
            "review_score": "-1"
        },
        {
            "review_text": "Mobile game port to steam,         YouTube™ Video:  Lets Look At : Swipe Cart&nbsp;",
            "review_score": "-1"
        }
    ]
}