{
    "app_id": 295910,
    "name": "Olympia Rising",
    "release_date": "2015-07-23",
    "developer": [
        "Paleozoic"
    ],
    "publisher": [
        "Paleozoic"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Platformer"
    ],
    "achievements": 0,
    "positive_ratings": 72,
    "negative_ratings": 24,
    "price": 3.99,
    "description": "Olympia Rising is a 2-D action platformer starring Iola - a young warrior who has been cast into the Underworld after meeting an untimely end. She must navigate through the various twisted regions of Hades' domain, fighting through hoards of deadly creatures as she attempts her escape, making her way to Mount Olympus.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/295910/header.jpg?t=1447361510",
    "minimum_requirements": "OS: Windows XP or later Processor: Intel® Pentium 4 / 2.0GHz Memory: 4 GB RAM Graphics: DirectX 9.0c compatible card, 128MB of VRAM Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Neat game if very short: 6 worlds which are easy to beat with the health upgrades you get after every boss fight. It's not a metroidvania, it's just pure arcade platform with no backtracking. Just levels to beat one after another.  PROS: -Nice pixel art. -Fast gameplay. -Well done boss fights. -Satisfying final battle (if tough). -Simple and effective magic system.  CONS -The main character has way much momentum in her moves. Difficult to navigate or step on small plats sometimes. -Barrier magic is unuseful. -You're likely to get hit when navigating downwards. -Way too short.  Am I seeing a sequel with tons of looting, magic and more weapons with the same arcade premise?",
            "review_score": "1"
        },
        {
            "review_text": "  Went in thinking things might get frustrating came out with the best old school experience since Shovel Knight. Controls are where I was most impressed spot on jump and combo system and you can hold to any walls making navigation pretty easy. Difficulty is being ridiculously exaggerated by some people, expect to do maybe 3-4 retrys to get through the first boss and from there it depends how good you are",
            "review_score": "1"
        },
        {
            "review_text": "I have only played a hour of it, but already I am loving. The only downside I can see to this game so far, is that the coins can sometimes get stuck in walls, which can be especically irrating when trying to escape acid and collect coins at the same time. However it takes away little from the gameplay, which is excellent. My favourtie thing about this game so far though is the animation in the game, as the fire spell and the sword slash looks pretty damn awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. However, it is a little frustrating to get into, as controls are a little wonky and the first few levels are difficult. Believe me, stick with it, it's a fun ride.",
            "review_score": "1"
        },
        {
            "review_text": "I highly reccomend this game. In my opinion this is one of the best games of this year so far that i have played. the game has tight controls, beautiful pixelart, a great soundtrack and some unique mechanics. The only problem i can really find with it at this time is that you have to use the D-Pad on the controller and no adjustible controls but its easy enough to get used to. and even if it is kinda short it still is an amazing adventure for 5 dollars. I highly reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Add the option of LEAVING THE GAME and I'll think about coming back for a real review. I couldn't even quit by bringing up task manager. There is no option to quit or to return to the desktop ingame so you have to get creative when you feel as though you want to move on and not play the game anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "Controls, movement and actions are clustered to only two buttons which makes the gameplay frustrated as hell. Do not buy it, go play a free random flash game similar to this on newgrounds. You'd find your self more entertained.",
            "review_score": "-1"
        }
    ]
}