{
    "app_id": 296050,
    "name": "Battlepaths",
    "release_date": "2014-05-30",
    "developer": [
        "Key17 Games"
    ],
    "publisher": [
        "Digerati Distribution"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Turn-Based"
    ],
    "achievements": 61,
    "positive_ratings": 535,
    "negative_ratings": 241,
    "price": 1.99,
    "description": "Battlepaths is a loot-centric and addictive 2D-RPG featuring neat monster hacking, an excellent loot system, and great variety in character development. Learn skills, use powerfull potions, and hunt down the Chaos Overlord.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/296050/header.jpg?t=1532942715",
    "minimum_requirements": "Минимальные: ОС: XP Процессор: 1.6Ghz CPU Оперативная память: 512 MB ОЗУ Видеокарта: Direct3D support DirectX: Версии 9.0 Место на диске: 175 MB Звуковая карта: Any",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I got this game as a bundle and really cheap so I didn't start with very high hope for this game.  Well I was right! Don't put very high hope for this game.  On Steam review I can only choose Yes to recommend and No to not Recommend. But sometime like this game i would love to have an option 'Neither'.   This is not a terrible game but it's just too simple. It's simpler than the old Windows 3.2 Game Castle in the Winds. Which i played over 20 years ago.   The graphic is decent for indie, The Combat is very simple and there are not much choice for spells and ability.  Basic you build up your character and use ability to cover the short coming in order to get though tough fights.  You had to save and exit many times to level up and get items to win the tough fights.   I have just played 1 game of hardcore to get achievements and 22 hours later, right after I get the last achievement that require me to play hardcore I died on the last floor of Brutal challenge room.   This means i have to start over. But since i already achieved over 60% achievements and all the rest ones are just more grinding of exact same content over i don't think i will play this game for a second time.  Over all I would rate this piece 5/10. If you can get this game cheap and there are no other game for you to play... Give this piece a try.",
            "review_score": "1"
        },
        {
            "review_text": "While it isn't terrible, Battlepaths plays like a game that should be free on Kongregate.   There are no options to speak of other than turning fullscreen off and on. Which means you can't rebind the awful keyboard layout (you actually have to use Esc for more than just bringing up the game menu!) and you can't adjust any audio setting besides turning off the music.  For a rogue lite, it has a shockingly low challenge level. The death penalty (yeah, you can come back to life!) just subtracts a small amount of experience and gold and sets you at the entrance to the map you were on, leaving all the monsters in their current state.  It ends up just being really boring and annoying to play. Buy when it's 80-90% off if you're curious, otherwise stay away. Go play Dungeons of Dredmor instead.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun, but gets repetitive at times in terms of quests and such. Very short game though, wish it could be longer or add more game modes. 5/10 it has great potential, but fails to execute it effectively. I would recommend this if it was less than one dollar, else its best to skip.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't expect Dragon Age or The Witcher here. It's simple, kind of retro and it's fun though. 2D turn-based hack-n-slash?",
            "review_score": "1"
        },
        {
            "review_text": "It's a simplified casual Diablo cartoon flash game. However it works. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "  Boring flash garbage about cockeyed guy who can't hit a ♥♥♥♥. I lost my patience, time and good agc. for 6 0.04€ cards...",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly, Battlepaths isn't up there with Maj'Eyal, The Pit and Dredmore, but its a surprisingly decent roguelike that can be surprisingly difficult at times, especially against the end bosses.  My one main complaint that there's very little music.",
            "review_score": "1"
        },
        {
            "review_text": "This game does not bring anything new to the table, and is very basic in its mechanics. Did not like.",
            "review_score": "-1"
        },
        {
            "review_text": "for the card",
            "review_score": "1"
        },
        {
            "review_text": "Everytime I attack, it will miss",
            "review_score": "1"
        },
        {
            "review_text": "This is what Diablo looks like on Gaz's computer.... 11/10 would press the W key again",
            "review_score": "1"
        },
        {
            "review_text": "Battlepaths is a lovely designed 2D RPG with carton graphics. It offers a lot of different items and big maps. It is fun to play the game and level up the character.",
            "review_score": "1"
        },
        {
            "review_text": "Cooool game. =) I played it several times through in the Xbox360 version.  My son also played it A LOT of times through, also in the Xbox360. My favorite attributes are speed and strength. You can play it several times, with other style,  depending on the main attributes that you choose. Happy to see it also available on steam. Keep the good work guys. We want a seeequeeel. =)  PS: I LOOOOVE ACHIEVEMENTS!!! AWESOOOME ADDING!!!",
            "review_score": "1"
        },
        {
            "review_text": "Battlepaths is a perfect example of cheap game with poor production values. A wet dream of a money-greedy indie developer who thought he invented roguelike genre again with his terrible art style combined with uninspirational gameplay. GJ. That's good job for fanboys (hope there isn't any). I'm sorry to inform you all that Dungeons of Dreadmor has already been made and it's like on this other planet, planet of awesome new iterations of old genres, and BattleBATHS was left in it's rotting, infested homeplanet of terrible excuses and incompetense. I would love this game if it was good.",
            "review_score": "-1"
        },
        {
            "review_text": "I've decided to re-write my review for this game and review it based on achievements alone.  The developers consider you to have completed the game at 100% achievements - here are my thoughts on each of the harder ones.  ===========================    Weapon specialization achievements    - Complete BS, forces you to play the game 4 times because only one can be unlocked per playthrough or character     Skill specialization achievements    - Same thing, forces you to play through 3 times up to the level you unlock your second skill at.     Touching obelisks achievement    - Obelisks are supposed to give you buffs for battle, but in fact you almost always only get to use them AFTER the battle.     Reaching level 35    - Enjoy grinding the last few levels for many hours.     Boss/challenge achievements    - Good luck finding the right gear, you'll need to be opening quite a few chests, sell a lot of items and stock up on bunch of potions and other consumables before being able to take on them.      250K damage without dying    - Because of very imbalanced fights at certain points in the game, good luck with this on your first or second attempt. Either you learn everything on your first playthrough and then get it while leveling up those last levels after everything is done, or you start another run for hardcore mode and get it from there... by finishing the game again and grinding a bit more so you take enough damage.     Opening 150 treasure chests    - Grinding for keys and then moving to few treasure chests to open them. Yay     Crafting a masterpiece    - Hah, good luck with that. I found 3 small chance upgrade items for it (which means 3 attempts) in my 17 hours of play... didn't get it yet.  ===========================  Edit: This is actually a rant on both game mechanics and the achievements that don't fit a game like this in my opinion.  Achievements aside, the game is sort of enjoyable at first. It keeps you playing to see new monsters, items and skills, but disappoints you in the end.",
            "review_score": "-1"
        },
        {
            "review_text": "I'd love to give it a try. I can't even get it start. Running Vista on a Core2 Duo Qosmio, it won't even start the game. Waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "get it on sale or discount coupon from badge making .. get trading cards .. delete ..  rest game is too childish .. maybe my 4 year old enjoy the monsters .. it maybe a good game if it was released in 90s ..",
            "review_score": "-1"
        },
        {
            "review_text": "Decent but short turn-based rpg. I rate this 7,5 /10. ",
            "review_score": "1"
        },
        {
            "review_text": "Free: so can;t complain, good RPG action! RUNESCAPE 2D",
            "review_score": "1"
        },
        {
            "review_text": "Swaglord approves. :^]",
            "review_score": "1"
        },
        {
            "review_text": "fun not too bad",
            "review_score": "1"
        },
        {
            "review_text": "This game looks like Garfield and plays like Diablo. 2 mediocre things mashed together into one 4.99 mediocre game. Honestly, I'm only here to get my 12 cents from the trading cards. Unless you're here for that, this is a no-go.",
            "review_score": "-1"
        },
        {
            "review_text": "I love it very much! Poor mans Diablo.",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't even move in the tutorial. I could open up interfaces, equip the starter weapon, etc. But not move. Tried restarting, changing the resolution. Bizarre.",
            "review_score": "-1"
        }
    ]
}