{
    "app_id": 296070,
    "name": "MIND: Path to Thalamus Enhanced Edition",
    "release_date": "2014-08-05",
    "developer": [
        "Pantumaca Barcelona",
        "@CarlosGameDev",
        "Dani Navarro",
        "Luka Nieto"
    ],
    "publisher": [
        "Talking About Media"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "VR Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Adventure",
        "Puzzle",
        "Indie"
    ],
    "achievements": 23,
    "positive_ratings": 839,
    "negative_ratings": 397,
    "price": 9.29,
    "description": "MIND: Path to Thalamus is a First Person Puzzler that throws you into a fantastic and surreal environment. You will bend the natural elements to your will in order to progress in this emotive, mindbending tale. Now also in Virtual Reality!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/296070/header.jpg?t=1547136731",
    "minimum_requirements": "OS: Windows 7 (64 bits) Processor: Core 2 Duo E4300 1.8GHz Memory: 2 GB RAM Graphics: GeForce 7600 GS DirectX: Version 10 Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 7 (64 bits) Processor: Intel Core i5-3570K 3.4Ghz Memory: 4 GB RAM Graphics: GeForce GTX 660 DirectX: Version 11 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "Mind: Path to Thalamus is the emotional aftermath of a careless father, one who dragged his children on trips to chase storms and other extreme weather. It’s a personal crusade that ultimately enacts cascading consequences: a fatal tsunami which swept away the narrator’s sister as he watched from the safety of a tree, his father nowhere to be found. A descent into drunken madness as a result of a broken family and an inability to believe in the truth of a sibling’s death. The narrator blames his father, but also himself, as he too chases extreme weather: the opening scene of the game is a massive tornado in which you must find your own daughter, named prophetically after your sibling.And thus begins a decade-long coma through which Mind: Path to Thalamus is a journey. As you make your way to the heady metaphor that is a giant tree called Thalamus, the road is paved with obstacles in the form of weather/environment changing abilities. Special areas—marked by gnarled trees, lilies, cairns, or slowly rotating gears—affect fog, night/day, rain, and time, respectively. Stand in their areas—or leave a spindly ball of glowing neurons in them—and the fog will expand, the sun will set, rain will fall, or ruins destroyed by time will grow whole again. Mastering these will be the nuts and bolts of your journey, the tools that let you pass into new areas and build up, more like Portal than Myst.Each map is nothing short of breathtaking in its complete disregard for spatial logic: chairs sit with their legs against walls, neat rows ordered to the ceiling. Railroad tracks truncate into blinding tunnels. Decaying ruins grow from an endless, ankle-high sea which reflects invisible, walkable segments floating above you. As the hollow avatar of the game’s narrator, you hold down W to move across these mindscapes, explore inner turmoil, solve puzzles, and listen to a voiceover that elucidates regret, dead sisters, drunken fathers, and shame.It’s incredibly ambitious subject matter from a young creator, but at times, it falls somewhat flat. All of this information is delivered in voiceover that pops up at the beginning of levels, whenever you solve a part of a puzzle, and so on, often in ornamental language or via out-of-place references. Awkward, overly poetic phrases make the game feel like a high school, compounded by a young voice actor who has a hard time passing for a father, let alone one who has been ravaged by life and death.Saying the game is about exploration may be a little reductive but it’s also true. It wasn’t the allure of puzzle solving that drew me in Mind. It wasn’t the developing powers over night and day, fog, clarity, or even time that are used to solve them. These elements deepened the gameplay in a necessary enjoyable way, but my ‘path to thalamus’ was characterized by soaking in each of the game’s environments. Puzzle solving, as tricky and inventive as the puzzles often were, was a means to an end: they were the reason to slow down and notice all that was around me. And that is why I will remember Mind.Mind: Path to Thalamus would never have existed ten years ago. Its abstract, high-minded premise isn’t one we would have seen from a big publisher. Instead, a single man and his small band of compatriots deliver on one of the most creative ideas of recent years.Mind is beautiful and its surreal environments will linger on with me longer after the story has faded. Exploration is its defining quality, even as the puzzle solving elevates above other exploratory games. For this reason, Mind: Path to Thalamus is an easy recommendation, even if its story falls a little short. This is a game that should be experienced.",
            "review_score": "1"
        },
        {
            "review_text": "I can recommend this game but there are a few 'meh' things.  The story idea is not bad but its narration doesn't catch me.. in contrast to it's atmosphere. Visulas and Soundtrack are amazing and blew my mind. The puzzles aren't that hard and after a while even me as a Puzzler-Beginner was able to solve them what is great in my opinion.  I enjoyed it while playing so I am fine with some negative aspects.",
            "review_score": "1"
        },
        {
            "review_text": "Quite interesting game with lot of logical puzzles. It's not a copy of Portal nor Antichamber but if you liked them, you will probably like that one too. At least I did!",
            "review_score": "1"
        },
        {
            "review_text": " In  MIND: Path of Thalamus , you traverse loosely connected surreal landscapes in pursuit of a floating piece of paper, presumably a drawing from your lost daughter, while solving clever puzzles that require both observation and thought.",
            "review_score": "-1"
        },
        {
            "review_text": "This game really failed to capture my attention in the early chapters. You start off hearing a guy scream at a girl you never see, then suddenly you're transported to some abstract reality and just have to wander around until something happens. In order for a walking simulator to be enjoyable (IMHO), there needs to be a captivating story. This game doesn't have that; instead, you get to hear awful voice acting pronounce some pointless dialogue, all of which needs to be manually accessed by walking into a cloud of floating lights. Should you happen to miss any of these, you'll miss out on all of those segments of the story. The story should not be missable! Walking simulators are held together entirely by the story! Even if you manage to hear most of the story, you'll discern that you're in a decade-long coma, but that's about it. By the time the game ended, I had no clue what the story was about.  The environments further ruin the game as there is no cohesion between chapters. You simply walk until the level disappears and a new one is loaded. On the one hand, this gives the freedom to create completely dissimilar environments and possibly keep the game feeling fresh, but on the other hand, it makes the game feel like a disconnected series of nonsense. To make that even worse, the game seems to constantly alternate between beautiful environments and downright ugly scenes.  Fortunately, I continued playing past the first few game segments and got to some puzzles. This game actually has some decent puzzles, and you don't have to play too long in order to reach them. I wouldn't say the puzzles make this a good game, but it certainly begins to makes up for the complete failure in the 'Walking Simulator' aspect. I'll also warn you that the game has an equal number of worthless puzzles. One such puzzle is merely 'walk around in fog so thick you can't see anything until you find this small object in a huge area,' and for some bizarre reason this puzzle appears repeatedly. Also, by the time you start to get a feel for the puzzles and think the game may not be a complete failure after all, the game simply ends. It seems even the puzzles can't deliver enough enjoyment.  Other grievances:  The game claims Full Controller Support, but that's a lie. Sure, you could use a controller, but there is no way to adjust input sensitivity so attempts to look around feel very, very sluggish. Gamepad controls are so bad that it's almost unbearable. Just use the mouse and keyboard instead.  I also hate that I can't adjust the game settings from within the game. You have to restart the game any time you want to change quality or control settings. The checkpoint system doesn't really provide any useful checkpoints, so you're going to have to restart every level should you need to quit the game mid-chapter. This makes for a frustrating start if you're trying to figure out what settings work best for you, such as trying to use a gamepad and then realizing you can't simply switch to keyboard and mouse without first quitting the game, or when you realize that high shadow quality looks ugly and you need to change it to low.",
            "review_score": "-1"
        },
        {
            "review_text": "Played this game all the way through before VR and it was awesome and I can see why it won so many awards. Then they tacked on VR and totally destroyed it. The rediculous teleport mechanic totally ruins any immersion the game had. Graphical glitches. Puzzles ruined because what you fell through before you can just teleport past. This is now a disaster even after the fix. This is based on the vr version",
            "review_score": "-1"
        },
        {
            "review_text": "Just when I started to believe video games had lost their appeal, this incredible adventure game shows me it's not true. This is a must buy for any fan of the 1990's adventure genre (Myst, Zork Nemesis, Riven, Zork Grand Inquisitor, Shivers, 7th Guest). I was honestly stunned at the incredible environments in this game. I can't honestly remember the last time I just sat and stared at such beautiful locations in a video game world. The game starts off with a incredible sequence and quickly transitions into a beautiful adventure game. You walk through absolutely stunning locations, solve various puzzles and learn the protagionist's story.  If you love a good puzzle, or simply love the act of exploration, this is the game you should be playing right now. Well done Carlos, very well done.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful landscapes, very solitary and peaceful game. Challenging puzzles. Definitely recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to like this game. It's so pretty. And it seemed like such a good concept. But I can't get over the fact that I hate the puzzles. I really hate the puzzles. They just keep getting more vague, and I haven't enjoyed one yet. Playing this game feels like trying to read a book with speedbumps. If it had a 'Dear Ester' mode that just autosolved the puzzles as you explore, I might love this game. But as is, I just can't say that I think it's pleasant.",
            "review_score": "-1"
        },
        {
            "review_text": "I really like the atmosphere of this game and it had decent puzzels. A good length and not to long. Aparently the enhanced edition removed the final boss level. I like this because it destroys the atmosphere of the rest of the game and is a bit silly, but in a way intresting.",
            "review_score": "1"
        },
        {
            "review_text": "A neat idea, but executed poorly. The narrative is flimsy and lacks any solid effort to engage the player in the character's story.. The puzzles are also largely arbitrary, exercises in trial and error with little cohesive design. MIND ends up feeling like an unfinished graduate project instead of an actual game.",
            "review_score": "-1"
        },
        {
            "review_text": "TLDR: -Novel puzzles -Gorgeous scenery -Weak story -Puzzle mechanics are poorly explained  Very pretty, with some fairly clever puzzles. However, it probably leaves a bit too much to trial and error. The story is fairly original, but ultimately fell flat for me.  It concerns a man who lost his daughter in a tsunami, who has since fallen into a coma. He's trying to find his daughter in his own mind, and escape from his mental state by solving abstract puzzles in the (really quite beautiful) landscapes of his unconcious. Interesting premise, however it's delivered entirely through poorly acted voiceover. The game doesn't really explain much about the protagonist or his daughter (at least in the first half of the game, I didn't finish it), so we don't really have an incentive to care all that much about either of them. So that really leaves the gameplay as the main drawcard.  There are some strong ideas when it comes to puzzles, however much of it fell flat due to the trial and error required to understand the basic mechanics. I'll explain them, if you don't mind being mildly spoiled on the mechanics. Essentially, there are areas on the ground that, when stood in, affect the level in various ways. Patches of white flowers will change the level to night, which opens various portals around the area, and makes balls of light become visible. Stone circles will bring on the rain, which raises certain wooden platforms. Tree arches/circles will make the level foggy, but remove spherical barriers blocking paths. These effects only apply while you're standing in the zones, so you'll need to place balls you find into them to change the states and solve the puzzles. This also means that if you enter an area and it's already dark, you know there's a ball in a flower patch somewhere. Once you've figured this out, the puzzle system becomes quite rewarding. But the trial and error required to get to that point can be irritating.  Ultimately, I gave up on playing about halfway through because I wasn't having much fun with the puzzles, and the story wasn't compelling enough for me to continue. There's definitely promise here though, and I'll be keeping an eye on future projects from this developer.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like depressed monotone narrators, this is your lucky day. If you like walking around very slowly, this is the game for you. If you like falling off tiny thin paths repeatedly, you will love this game.  It's very pretty. The opening scene with the tornado is great. Sadly it's all a bit boring after that and the 'puzzles' are nothing more than tedious and rather repetitive mazes centred around opening doors in the correct order by placing balls to trigger events.  Want a challenging first person puzzler? Head straight to Antichamber.  Graphics 7.5/10 Puzzles 2/10 Narrator 1/10",
            "review_score": "1"
        },
        {
            "review_text": "Personally, I'm not very good at puzzle games, but after hearing a lot of good things about the mood and art of this game, I decided to give it a try. Not surprisingly, I ended up having to use a walkthrough for some parts of the game, but for me, this game was as much about the beauty of it, as it was about solving the puzzles.   Mind: Path to Thalamus is slow-paced and tranquil, which suits this game just fine. The player is taken on a journey, and both the music and the artworks make for a spectacular atmosphere, not to mention some really beautiful scenery. As such, this game might not be the best fit for anyone looking for something more fast-paced and challenging. But if you don't mind a slower pace, I might just suggest you give this game a try!",
            "review_score": "1"
        },
        {
            "review_text": "I honestly can't believe they charged so little for this game. I only hope they have enough money to make more games, because I am now an addict. This game was like mind-candy to me and I want more! It literally was that good. I feel like running out and buying an even better graphics card just to experience this game on all high settings.  In the game (experience?), half the time I was wondering if I was going the right way, but then I ended up in the right spot I think. I'm sure that's all intentional to give you that 'wow I am lost in a weird place' feeling!  I'm not even sure what to call this game because I haven't finished yet. Murder-horror-adventure-mystery-game?",
            "review_score": "1"
        },
        {
            "review_text": "Changing review from Not recommended to recommended.  So I finally figured out how to improve graphics, if you're playing this on VR, you need to launch the game in desktop mode then put everything in the option at ultra as well as the resolution @ 150%. Exit the game then launch it via VR. It should look way better after that.  Finally appreciate the graphics as well as the music and sounds included on the game.  Game was ok, unfortunately because VR has the option to teleport, it broke some of the puzzles so solving it became way easier. Finished within 2.5 hours so if that is faster than the average, the I definitely skip some of the steps on the puzzles due to teleporting.",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this game if you are going to play it with the vive there are huge gaps colision detection just dosen't work you will walk up stairs and just drop through them for no reason made the game almost unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a fantastic puzzle game with an engaging story and fantastic voice acting, especially for an indie game! The visuals were seriously impressive (I would often stand around looking at all of the details) and the puzzle mechanics are creative and just plain old fun.   There is the occasional glitch (for some reason, I had a hard time keeping a grip on the nerve clusters. They would just fall out and roll away. I would be doing certain puzzles over and over just because of that issue) but it's hard to tell if it was just my computer being a turd or an actual gameplay issues since other people didn't seem to have the same problem.   Regardless of the glitches, it's a fantastic game and I HIGHLY recommend it to people who love story-based puzzlers.",
            "review_score": "1"
        },
        {
            "review_text": "really great looker and man if you like puzzles then there are real gems here. while the game is short but it was one of those that puts the 'Q' in quality for puzzles. there is not enough praise this game can have especially if you have your headphones on as accompanying the puzzles are a bunch of really great background soundtracks. the only issue i have is the fact that the nerve ball is literally obscuring about 70% of the screen as the game does not look bad at all from puzzle to the next uzzle is just breath taking. you just have to try the game even if you are a bad puzzle solver ^^",
            "review_score": "1"
        },
        {
            "review_text": "Stunning high detail worlds and a mysterious otherworldly story add a nice steady pace to the simplistic yet well implemented puzzles. The “balls” you have to carry can sometimes be in the way a bit making it slightly Awkward to see where you’re going but its only a small niggle with an otherwise charming and unique game. ",
            "review_score": "1"
        },
        {
            "review_text": "This is a walking simulator. An excellent, gorgeous, immersive, brain-teasing and touching walking simulator.  With magnificent lighting effects and sky textures, beautiful landscapes, geniously designed, intuitive and not mind-boggingly difficult puzzles, and an ultimately fascinating storyline-gameplay paralellism created from a just-above-average heart-breaking story, this game should be an instant favourite for people who are interested in topics like family, loss, human nature, psychology, etc. The game's beauty is only surpassed by the feeling of authenticity it provides.  I'm basically out of adjectives. TL;DR: Great game, recommend!",
            "review_score": "1"
        },
        {
            "review_text": "i have never seen a great game like this...good view,imagine...ahh",
            "review_score": "1"
        },
        {
            "review_text": "Story: This is game about a guy in coma suffering from guilt. He wanders a surreal place in search of the thalamus reminding me of Dali, Myst or Inception at times.   Gameplay: You walk at a rather slow pace through a pretty landscape and solve easy-medium puzzles (never took me more than 15 minutes on one) where you basically drop balls on switches that change day to night or sun to rain and so on. Some balls only appear at night, some bridges can only be crossed by rain and balls roll down when placed on a slope etc. I estimate the game takes around three hours to finish.  Execution: The visual presentation looks gorgeous though in detail the foliage on the trees is somewhat flat. Piano music is serene and fits very well. Script and voiceover have been criticised by others - I think it's decent, he's in coma after all.   The puzzle elements and the surreal setting sets the game appart from simple walking simulators like 'Dear Esther' (which bored me terribly). Can recommend to friends of casual ambient puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "As a game it's a bit basic - very basic - really, really basic - and some...  As a walking (no running so it's LITERALLY a walking) simulator set inside a late 70s Prog Rock Album Cover, it's really pretty good.  3 hookahs out of 5",
            "review_score": "1"
        },
        {
            "review_text": "This was a neat, if fairly pretentious, puzzle game.  The puzzles themselves were somewhat clever, and I enjoyed the environments. I didn't encounter too many bugs, although I did manage to get myself stuck one time behind a portal with no way to finish a level because I had moved one of the 'night' balls to the wrong spot and accidentally got it killed with no way to get it back. I was able to restart the level from the menu, however, and that cleared it up.  One minor complaint is that the first proper level of the game is not entirely intuitive in that the mechanics of how things work and what you're to do are never explained, so it does take a bit of futzing around before you figure out that you're supposed to drop those balls inside the tree ring to progress.  My biggest complaint is, I suppose, the writing and voice-over work. The dialog is that of a super-bitter cynic, and it starts to grate fairly quickly.  That said, I'd definitely recommend this both for the visual presentation and the puzzle aspects. Once you get into the mindset of how the puzzle mechanics work, things start moving along at a pleasant pace. If you can ignore the pretentiousness of the narrator and his babbling about the tree of Thalamus, you'll have a pretty good time.  Recommended: 4 out of 5.  ",
            "review_score": "1"
        },
        {
            "review_text": "Looks nice, what I can see of it - but very buggy, constantly loses control of mouse and flicks back to windows desktop. Makes it unplayable.  From the updates and comments on the forums, developers seem to have a 'Up yours' attitude.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this on the steam sale and I'm impressed with the level of emotional enagement the environments elicit in VR. There was a crazy electric ball that jumped out at me indiana jones style in a cave level and I felt that damn thing go right through me. My skin was buzzing. My body felt pentrated by a ghost. I'm a bit freaked out by the way the mind produces physical sensation in the limbs in VR. I'm super samplling this to 1.5 on my Vive with a 970 and it keeps 90 fps in the graphics screen.",
            "review_score": "1"
        },
        {
            "review_text": "Artsy-fartsy visuals and music are nice but gameplay is very lackluster - especially when it comes to badly designed puzzles, not at all suited for the limited controls availabe in this game. I'm guessing that the developers aimed at creating something very immersive (and for a team consisting of only three people that's pretty ambitious) but the results fall flat due to inept design and lack of polish. I really wanted to like it but after about an hour and a half it was only putting me to sleep.  Not recommended, unless you're really baked and want to look at some trippy surreal landscapes.",
            "review_score": "-1"
        },
        {
            "review_text": "Incredibly hard, but so satisfying at the end. Seeing as I've barely started it, this may not be accurate, but from my gameplay so far, 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty game, but a little too disjointed for my tastes, like a dream sequence from any other game, but drawn out with so... much... walking... Puzzles increase nicely in complexity, but tend to repeat a lot of the same basic principles. The scenery can be stunning when not clouded in fog, particularly the last section. There's also a really great bit about 2/3 through that was executed beautifully, and I added a whole extra point for it. Voice-over and story are a little too emo, too self-indulgent. It's a linear sequence of rooms and not a patch on Myst let alone Riven. If you're really into this kind of puzzler and are patient, it's might be worth a try, but otherwise you can do better elsewhere.[5.4]",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to like this game. It looked nice and had decent puzzles, but the story and voice acting left much to be desired, especially in the end. Heavy-handed and innappropriately meta dialogue entirely shatter the pacing of the game, not to mention the final boss. It would've been better if the story was symbolic and/or metaphoric and left it at that instead of failing at trying to be clever. The story is partially incomprehensible due to poorly balanced sound, and what's beneath the shoddy design isn't worth digging for.",
            "review_score": "-1"
        },
        {
            "review_text": "+ fine art + ambient tracks + somewhat dark but turned out to be a light hearted story + ending + actually hard puzzle + walking sim  - TEH BALL - BALL PHYSICS - single digit fps  Its great, considering the dev is also lead dev of the map warcelona Just whats with the cursed ball?",
            "review_score": "1"
        },
        {
            "review_text": "Boring! I've spent hours in the Talos Principle and Portal, but this was just slow. Like the Vanishing of Ethan Carter (which I also didn't like) or Dear Esther (which I also didn't like). If you liked those games, you might like this one, but I didn't, so I don't.",
            "review_score": "-1"
        },
        {
            "review_text": "OK I gave this game a few hours but it tragically flawed. If you want to spend 90% of your time redoing things over and over because the controls let you down then buy this game. Controller support..............lol yeah right. ",
            "review_score": "-1"
        },
        {
            "review_text": "Lets start with the pro's. This game is pretty. It has some great set pieces, and lovely scenery. Unfortunately that's where the complements sort of end. The puzzles, such as they were, weren't terrible, but neither were they particularly engaging or satisfying to solve. Often times you'll find yourself unconsciously holding down the shift key, hoping beyond hope that the protagonist would shake a leg and get his damn hustle on.  The story is nothing unique, but that alone doesn't doom it. Its the poor execution and lack of any correlation between what you're seeing with what's supposed to be going through the protagonists narrative that squashes it. And then there's the voice acting... Well, It starts of passable, but as you progress it gets worse and worse, and by the time you reach the climax of the story, you'll be muting the embarrassingly poor performance.  So, do I recommend it? Well, no not really. Not unless you're getting it in a bundle, or with a huge discount, and even then only if you enjoy the type of light puzzle walking simulator thing this got going for it. You might enjoy about an hour of the scenery, but it wears thing quick and really hasn't got an interesting enough conclusion for me to recommend seeing it through.",
            "review_score": "-1"
        },
        {
            "review_text": "Had high hopes for this, and it really is a beautiful game, but all of the puzzles are simple trial and error puzzles requiring no thought whatsoever. Stopped playing so I could request a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "LAME!  what's wrong with the ♥♥♥♥ing menu? it's broken when using controller, but you say your game is fully support controller!",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing game! stunning visuals and soundtrack :)",
            "review_score": "1"
        },
        {
            "review_text": "I am not one who normally writes a review. However, I just wanted to warn others. If you want a game that has simple puzzles and stunning scenery. This game is for you. If you walked into this thinking it could be another Myst... Run away dont look back.   30 minutes of gameplay and the story is like alan wake with a hint of Max Pain.",
            "review_score": "-1"
        },
        {
            "review_text": "The graphics are unimpressive, at least at the beginning. The sound does not work at all. The controls are odd, but not bad. Overall, I have to say the bugs in the game make it unplayable, which is too bad, because it looks like it has potential.",
            "review_score": "-1"
        },
        {
            "review_text": "Had to leave a review because based on whats here you'd think this game is great (I did) and waste your money.  It is an utterly beutiful game. The art and music really work and if I could play through the game with just that it would be a great experience. The mechanics are fun as well though the puzzles can get a bit tedious.  BUT, the voice acting and script are awful. after the first 10 min. I was just playing it muted. I think it was meant to be deep but it comes off like a whiny teenager reciting cringeworthy prose. DO NOT BUY IF NOT ON SALE, but perhaps follow the creator to see if his next piece comes off better.",
            "review_score": "-1"
        },
        {
            "review_text": "Finished the game in 3 hours, playtime went to 4 while i got a hotdog.  the demographic for this game is anybody with 7-30 fedoras from walmart, if you own a single fedora over $25 you may be dissapointed by this game. It just won't be thought provoking enough.  Put a ball into a puzzle effect to change the level 6/10 game of the year -IGN  (even on sale I'd probably not get this unless you find bad narrative funny, or again own many fedoras then perhaps this will be super 'deep' to you and you alone, and none of your friends, your father, and certainly not your sister sofia will understand just how amazing it is.)",
            "review_score": "-1"
        },
        {
            "review_text": "5 years from now a hipster will ask you on a date. They have a few pieces at an art gallery event. You say sure, that sounds like fun. After walking down wide white hallways with hanging paintings and finished floors you get to an Oculus Rift. 'Try it!' they insist.  You put it on. You walk around this linear path for awhile. Some things happen that seems exciting, then you're stuck. A narrator takes over and you're just walking forward. It's the interlude of a game when your character is dreaming or drugged that you have to get through before you get to the main game. Except this is the main game. You don't need explosions and guns to entertain you, and you certainly don't need a tutorial to hit you over the head, but this world seems pointless and empty. You keep walking around in the virtual world so as to not disappoint your date. After enough ♥♥♥♥♥♥♥tting, you take off the headset.  'So? What'd ya think? Pretty cool, RIGHT?' they say all proud of themselves. 'It was. Interesting,' you say.  You indugle in the wine at the gallery to try to make the best of your time while your artist date drones on and on about the state of art today with other artists and connoisseurs. You're drunk and bored so you just stare at the enormous statue in the middle of the room that you swear looks like a woman ♥♥♥♥ing a dog, yet everyone insists is abstract art. You say goodnight and don't ♥♥♥♥ them because you don't want to have to sit through another date with that person.",
            "review_score": "-1"
        },
        {
            "review_text": "quite possibly the worst game Ive played in a while! graphics, playability, everything.... deplorable... if I'd released this, Id make it look like an accident so my family would get something!",
            "review_score": "-1"
        },
        {
            "review_text": "Invisible platforms and ominous uninteresting puzzles. No aparent story.  Just a boring walking simulator through a desolate land solving weird puzzles. Also, you are teleported to other areas with different odd puzzles because it's more convenient than to have a progression that makes sense.  Graphics look either 'oooh, nice environment' or 'what's with the crap textures and low polygon 3D models, I set the graphics to ULTRA'.  Setting video quality to Ultra also sets 'screen percentage' to 200% which result in 60fps in-game but 1 FPS in the menus and invisible menu labels in the Graphics menu.  Setting back 'screen percentage' to 100% took over 5 minutes due to the unexplicable 1 freaking FPS in the menus.  Game run in 4K but after Alt-Tab it switches to 1650*1080 for some reason, makes no sense to switch from 16:9 to 16:10  Pressing Escape in the Graphics menu will exit the game instead of returning to the main menu, or, to the freaking game I was just playing...  It also auto-created a category called 'Steam VR' in my games which I neither want or care for.  Lifeless Planet is MUCH better in all aspects.",
            "review_score": "-1"
        },
        {
            "review_text": "(Update!) While I have to credit these fellas for making changes and listening to us, I am still unable to sell this to you. YET, FOLLOW THESE BOYS! THEY HAVE LEARNED FROM THEIR MISTAKES AND NEED SOME SUPPORT! Unlike most developers out there, once they are wrong they give up! This is not the case here and to be honest... I want to give it a thumbs up, but I paid for the original release and that is what the following review is based upon. Enjoy, your life.    Now before we get started, I know a lot of you here are going to buy this regardless of what I write and while you shell out your cash, you will probably be thinking that I just don't get it. That is not at all correct, I spend most of my time on puzzle and/or story driven games. This is a product aimed at those of us that love surrealism and storytelling, but don't let that be the only reason you want to spend hard earned cash on it. I for one love anything that gets me thinking or asking questions. Sadly, this game had me asking all the wrong questions and came across as an ego trip.  I don't want to be only negative, so I will point out that this game is not hard on the eyes when the screen is not tearing from time to time. Also, the music when playing is decent, it just always seems to fade away or get cut off before being allowed to really go anywhere amazing. Now let me get to why I am not able to recommend this product. It has a lot to do with the poor writing being about as good as the voice acting and the game design making you wonder, 'was that a bug?' For example, in the prologue I came to a point where the puzzle had me wondering, was that even suppose to happen? I do understand this was intended to be a cool little illusion type puzzle, but it seems sloppy and lazy.   For some reason, the game makers think having you use reflections to find your way is fun. Followed by some trial and error puzzles that involve placing things in the right areas, that quickly become more of a chore than entertainment. By now you might be thinking, 'If I smoke some bud it has to be cool, right?' WRONG! If anything, you are going to find yourself cheesed out by the terrible writing that has such a hard on for itself.   The screen tearing really is ugly when it does happen, it's not a lot but it does like to pop up; just could have been avoided all together. There is too much walking from one point to the next making any back~tracking that much more painful. The bad design has the game come across as rushed and broken when really these choices are on purpose in order to throw you off.   The story is pretencious, with the main character going on and on about himself. The amount of times I heard the players character mention his daughters name in the first few minutes became annoying and way over written. It seems as if the developers made this in a bedroom, while the voice actor sounds as if he just wants to go home. I would be more kind if this game was not so full of pretentious bull$hit. The writer seems to be patting himself on the back the entire game, forcing words into the script out of nowhere as if he just learned them and wants to show off.   The worlds seem forced, as if trying to be strange instead of mind~blowing or awe~inspiring. We have seen this all before and I don't see why there is any reason to choose this over some of the other 3D puzzle games on the market. I came across a lot of invisible walls, something I thought no longer existed in games these days. After awhile I just stopped trying to explore the worlds, since I was always stopped, keeping me stuck walking across fields knowing that it looks open, but is really linear.  I understand this is suppose to be art and that I should have an open mind, (which I do) yet if that is how you want to look at it, then the art here is far too self indulged, closing your mind and making you see what the developers want you to see. The price is not so steep that I feel robbed completely, still I did pay enough to where I am let down by the product.   If it was written better and the voice actor for the main character was not so off, I could put up with the level design and other problems. Everytime I hear the main voice actor speak about his daughter, all I can think to myself is how he does not sound at all like a strom chaser/father, and instead a game developer who really wants you to admire his work. It also comes across as if he is reading his lines right off a piece of paper for the first time.   I really hate to give this a thumbs down since it could have been something, yet there are other games out there better than this. If you really must play something new and have yet to enjoy, A Story About My Uncle, then try that first. It is far better than this on all levels and if you need more surreal worlds and 3D puzzles, then maybe this is for you, just get ready for a character that loves to hear his own voice. I'll end this review with a quote from the game. 'All this sounds pretty cheesy and lame, I'm sure. And it is.'",
            "review_score": "-1"
        },
        {
            "review_text": "This game is absolutle beautiful, the atmosphere is stunning and the music sets the mood very well (Bar one moment where it sounded like my character was eating a bag of chips for ~5 min.). From an aesthetic point of view I'd easily give this a 10/10.  The meat of the game was surprisingly fun as I progressed through, although I will admit I only encountered mild difficulty at best, beating the full game in just under 2 hours. Not worth the $11 on spent on a game that offers hardly any replayability.   It seems that much of the difficulty in this game is traversing the large spaces these puzzles take place in, which leads to me to think of it as a difficulty substitute, granted the final few puzzles took me a while to figure out despite the walking back and forth, and I did feel a sense of accomplishment when I completed it.  The dialogue and plotline are really where this game falls flat for me. There is too much prententious dialogue which I felt would make for a cerebral ending, something that would make me think if even for a minute. I was wrong, the game wrapped it self up leaving little to be desired.  I suppose I'll play through again for the steam achievements, maybe I'll find some fun easteregg, by my hopes are nigh.  Overall I have to give this game's: Story 4/10 Dialogue 5/10 Audio 8/10 Graphics 9/10 Atmosphere 10/10",
            "review_score": "-1"
        },
        {
            "review_text": "walking simulator trying too hard to be art. If you like Dear Esther, this is for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Being a fan of puzzle and thoughtful games most of my life, I am recommending this. The puzzles are well thought out, some challenging, some not. They are varied and are not always the same thing over and over again, which is definitely a plus. The scenery and atmosphere is absolutely beautiful. In this game, you need to 'think outside of the box' on more than 10 occassions. Replay value is there, if you enjoy puzzlers. 10/10 would Path again.",
            "review_score": "1"
        },
        {
            "review_text": "an absolutely beautiful puzzle-walking simulator",
            "review_score": "1"
        },
        {
            "review_text": "hooooooly crap, this game is stunning. I loved the story, very cool concept. The puzzles were decently challanging and actually took some effort to figure out, especially the few at the end. Even without the stunning graphics (which were really easy to drive with a pentium G3258 and GTX 650 surprisingly) the basic game mechanics were very well thought out. It was simple but still managed to be pretty challanging. Now as for the visuals, my goodness is this game gorgeous, by far one of the best looking games I've seen in a while, The unreal engine is an amazing tool and should really be used more. I really hope to see more games in the future from these guys.",
            "review_score": "1"
        },
        {
            "review_text": "one of the most wonderfull and mistery games",
            "review_score": "1"
        },
        {
            "review_text": "This puzzle game takes you through some of the most stunning and awe-inspriring alien landscapes; and yes it is an indie game! The concept and the imagination that went into this game is truly inspiring. Most video games don't take you to the same headspace as 'Mind' (except for the 'Myst' games). The creators successfully take you to a place that gaming has never been to, out in the cosmos or in your mind is all up to you. 9/10. If you love the Myst games (I'm a Myst freak) you MUST PLAY THIS GAME!!!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent puzzler with a grandiose sense of scale. The narrative might not hook you right away or keep you interested throughout, but the sensational scenery and clever clockwork of the core mechanics will definitely make a lasting impression.",
            "review_score": "1"
        },
        {
            "review_text": "Mind: Path to Thalamus is a not very hard puzzler with a good story and interesting mechanics. It looks and feels amazing to play, but the narration is likely to get on some people's nerves if they're not into narration. Even so, the game offers a unique experience, which is something very hard to do these days. Looking forward to getting an Occulus rift to try this game out on - as it supports this device, and would definately use it to it's full potential.",
            "review_score": "1"
        },
        {
            "review_text": "'You cannot trim a lily, give it a new coat of paint and a lovely fragrence and call it a rose.'",
            "review_score": "1"
        },
        {
            "review_text": "This is a very weak recommendation.   Pros:   Fun puzzles. Nice Music/Sound. Somewhat compelling story. Okay graphics for most of the time.  Cons: Plenty of Invisible Walls. Seriously, don't put interesting stuff in the background if I can't get to it. Bad Dialog Bad Voice Acting Info-dump ending that pretty much says, 'Just in case you didn't understand the previous narration and have a clue to what was going on, here's what was going on.' Ending credit music that did not fit at all. Imagine if MYST ended with a cut from Slayer's Seasons in the Abyss.  Buy Mind on sale and play it when there's nothing else that intrests you...but you probably won't rememeber it the day after you've completed it.",
            "review_score": "1"
        },
        {
            "review_text": "4 words I LOVE THIS GAME  I like the overal concept of the game and even though at some points of the game is was stuck it gave me time to look around at how beutifull the game was with all its surroundings and elements.  The Graphics where Amazing everything looked buetifull to look at.   I almost never write a revieuw for a game but this is the first one i can say that i really liked it and i recommend my fellow gamers to try it out.   (btw Sorry for bad English :P )",
            "review_score": "1"
        },
        {
            "review_text": "At first i thought...what were these devs smoking when they think of this. But then i couldn't wait to see every puzzle, every enviroment, every landscape.  Very very nice.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool game, definitely worth the money if you enjoy beautiful, aesthetically-pleasing worlds with relatively simple puzzles. The story is perfect, draws you in and doesn't let go, reveals the developer's personal experience and struggles in a relatable way.  I'd very much like to see more from this developer!",
            "review_score": "1"
        },
        {
            "review_text": "The best game I have ever played. Gorgeous, smart, challenging and touching.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most complex, beautiful puzzle games I've played. There were times where I would stop and look at the gorgeous textures that seemed to effortlessly weave with the game's soundtracks. If you like abstract puzzle games kinda like portal and other puzzle indie creations, I highly recommend this game. Ends pretty cool too ;) 9.6/10",
            "review_score": "1"
        },
        {
            "review_text": "Yet to finish the game, but what I played was fantastic.  Pleasing aesthetics, powerful imagery, an incredibly soundtrack and an interesting story (so far!) to boot.  Certainly worth your time if you can afford it.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed myself as much as i did with Dear Esther, the story leads you to want to progress and the puzzles are more like mind benders not just pointless puzzles. Fog area, you leave a ball by another area to unlock it, but sometimes there are layered puzzles so you can't just drop and go forwards. I played it all night with my brother and we were helping each other just giving advice, was fun to play that way, and had a touching realistic exposition that you could imagine occuring within one's mind.",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't so much of an adventure game as it is a puzzle game. The puzzles are all based on retaining what you have already learned and applying it in similar but still different puzzles. All of these puzzle take place in a beautiful world that when I started playing just made me sit there and look around in amazement at the world I'm each new area. I highly enjo this game though I haven't yet completed it.",
            "review_score": "1"
        },
        {
            "review_text": "Not that great...",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun, immersive, and challenging, though none of the puzzles were impossible. Got this as part of a humble bundle, and at the time it wasn't available on Mac. Very glad they added Mac support recently and I was able to play it.   The only downsides are that the controls, collision spheres, and physics could be better. There were many times when the 'spheres' you move around would get stuck on invisible collision, get knocked out of my hand, and then I'd have to chase after it as they rolled down hills. Sometimes they would get stuck on the ground as I tried to move forward on a steep incline. Still though, I appreciate what theses guys tried to do.",
            "review_score": "1"
        },
        {
            "review_text": "Dont let the 37 hours of playtime fool you, I really just left it running over night. My ACTUAL playtime would prolly be around the 2 hour mark.  Boiled down to its simplest, 'NO, this game is not worth buying &amp; then investing part of your lifespan playing.'  If you would like a few reasons why that is, fine. We are inqusitive creatures by nature.  -Bad script --which is then poorly acted -Cliched dreamlike settings -Puzzles that aren't really puzzles but are more akin to mini-platforming stages that require you to notice things &amp;/or flip switches -Infuriating Balls that act as blocks to sit on switches to activate weather mechanics. Why are they so troublesome? BECAUSE THEY ARE BALLS! They roll and BOUNCE and ♥♥♥♥. -Weather mechanics that could have been clever but are really just switches to activate particular platforms or doors...ect. -Settings that are ENTIRELY TOO LARGE. -It froze on me so I uninstalled it out of spite. I'm ok with that since I was only determined to finish it out of spite in the first place.  I do not choose to review lightly.  *edited for a poorly placed comma and changed a 't' to an 's'",
            "review_score": "-1"
        },
        {
            "review_text": "Wouldn't say I'm blown away with this game but with so few true VR games out there with depth. It leaves you the player to work out how to play with little hand holding. With time and development, games will improve and as of now, these experiences are what we have on offer. I wanted to like this so much more and the only reason I didn't ask for a refund is that I want VR to succeed therefore my money goes to developers who want to create new ideas for this medium.",
            "review_score": "1"
        }
    ]
}