{
    "app_id": 296490,
    "name": "GemCraft - Chasing Shadows",
    "release_date": "2015-04-30",
    "developer": [
        "Game in a Bottle"
    ],
    "publisher": [
        "Armor Games Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "Strategy",
        "Indie"
    ],
    "achievements": 419,
    "positive_ratings": 2179,
    "negative_ratings": 88,
    "price": 6.99,
    "description": "An epic, challenging tower defense game with an emphasis on strategy and replayability. Summon gems of immense magical potency and harness their unique abilities against a seemingly endless horde of monsters. The archdemon seeks to swallow the world, and you must journey to stand against her.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/296490/header.jpg?t=1511185831",
    "minimum_requirements": "OS: Windows Vista SP1 Processor: Intel Celeron N or better Memory: 2048 MB RAM Graphics: Intel HD Graphics or better Storage: 100 MB available space",
    "recommended_requirements": "OS: Windows 7/8 Processor: Intel Core i3 or better Memory: 4096 MB RAM Graphics: Radeon HD / Geforce GTX grade graphics card Storage: 100 MB available space",
    "reviews": [
        {
            "review_text": "Played the flash version +300h. This game is not what it seems. It's so much more. This is *the* definitive tower defense game.",
            "review_score": "1"
        },
        {
            "review_text": "My worst nightmare as a completionist. A game that is fun to play that never ends. Goodbye life.",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game for about a year on Armor Games, so I am qualified to rate this, even if it says I've only played it 3 minutes here. Here goes:  If you haven't played the Armor Games version, then this is definitely worth getting here. Especially with the early Special Promotion offer. If you've got the AG version, then it's totally up to you, as to whether you want to support the developer or not. Either way, it is guranteed to give anyone who likes Tower Defense games many, many hours of gameplay. Each level alone can give you 2 or 3 hours or more in a single Endurance run, and there are over a hundred different levels, starting with the 'F' hex, where 'F1' has 3 waves of a few monsters each, and they go up in difficulty from there.  Some changes I've noticed-- there is an extra save slot here on Steam. Also, you don't start off with Orblets or with a Red gem. It's odd playing the first few maps without 'battle traits,' but here you don't pick up your first one until F4. Also, it's nice being able to play in full-screen mode. And it's alway fun racking up Steam Achievements-- this game has 419 of them. And in 'Chasing Shadows,' it's not pointless to rack up these achievements-- each one that you get gives you a free skill point to improve your abilities with.  The game isn't perfect, the way Gemcraft Labyrinth was, as Shrines aren't fun anymore: now they show up randomly, at random times and in random locations. And I don't agree with the decision to tie the amount of times you anger a wave to the amount of beacons that appear-- in both cases I wish that I, the player, had more control over such decisions. So some casual fans might find the game overly difficult at the start.   But for the fans, be it of Gemcraft or of Tower Defense games in general, these sort of decisions will only improve your gameplay as many of you now have a year of gameplay experience and already know when to use a white gem or when to use a black one, where to farm for mana and which maps are the best for early endurance runs. I don't need to tell you guys anything as you already know and love the game.   So I'll add this one last point just for new players: don't be afraid to experiment. There are plenty of guides out there if you get stuck, but sometimes it's fun to figure it out on your own. Once you've played a few hours and want to optimize your gem ratios (and this can be as easy as deciding to make it out of two yellows, one red and one orange and four whites, or as hard as following the various high-level gem speccing guides which read like this: 2o+o+o+o+o+o+o+0(2o+b) + (2o+(o+r)+b+2b)+(2b+b+b+b+b+2b+(2o+b+2b) where r, b, and o stand for red,blue and orange gems. But you lose nothing by screwing around: even losing a level gives you shadow core, so if you want to try some prismatic gem to see what it does, go for it. If you want to just keep playing F1 a dozen times before doing anything else, then do that. It's your game, so have fun with it!",
            "review_score": "1"
        },
        {
            "review_text": "Extremely positive updates to an already top of the line tower defense game. If you're into the tower defense genre, or just like good flash games as a whole, GC:CS is a great pickup.",
            "review_score": "1"
        },
        {
            "review_text": "With hundreds of hundreds tower defence games it's easy to get lost in tons of clones and mediocre titles. Looking at GemCraft's screenshots or even trailer, I've put it in 'No, thanks' category. It looks like another generic, Adobe Flash based tower defence, and it's true. This painfully simple looking game has it's roots in flash, as it was released in web some time ago. What caught my attention were positive reviews of GemCraft. I bit the bullet and boy was I surprised!  Quickly, you are enveloped in minimalistic but eerie and mystical atmosphere. Curious, slowly unfolding story and dark music made it complete. With that, you slowly get to know GemCrafts mechanics. As you progress, you'll be gradually realising how big of a game GemCraft is. Though gameplay rules aren't revolutionary, the amount of features is overwhelming.  As the title says, you'll be crafting gems to defend yourself from incoming waves of monsters. That's simple, right? You'll receive a massive amount of gems that have different roles and characteristics. You'll have basic attack towers, enhancement towers and traps which you can upgrade. That's still simple and familiar. Now, here's the thing - you're free to combine and mix gems you want. You want to have highly damaging tower that also freezes enemies? Or maybe you want it to also poison and lower armour grade? Sure you can. Everything combination you can think of is possible. It's the core of the game - not only you have to decide where to place the towers, what gems to choose, how much to upgrade them but also mix them just right from your own recipe.  And it gets better. Looking at the map in between missions you'll see how gigantic it is. Even more so, you can shape missions just like a mix your gems. As you level up, gradually unlocked game modifiers can drastically transform the mission so much that your previous, perfect tactics become completely uselss. Many skills and mods offer a high reward at a price of high risk. That breaths a new life in levels that you would normally tick off as completed. As a cherry on top of the cake there are secrets that are cryptical enough to keep your curious.  That being said, GemCraft is a top notch tower defense game that despite poor initial impression will keep you playing for long. If you plan to highscore endurance levels, it will perhaps last a lifetime.  Final score : 8/10  The good :  - Ridiculous amount of gameplay - Great, dark atmosphere and music - Freedom to create your own tactics   The bad :  - Somewhat basic graphics - It will devour your free time and ask for more",
            "review_score": "1"
        },
        {
            "review_text": "Gemcraft is one of the most successful tower defense series for a reason. This game is all about options, because with a little experience you can earn mutators to be set pre mission to increase the difficulty and the XP earned. Since you only gain XP over what you did previously on repeat runs, grinding isn't really grinding, it's raising the bar for a second run. You can also pour your power (through gems,) into the oncoming monster waves, to toughen them and earn you more XP.  You also can find drops of talismans for more upgrades, and these can be improved.   If you like tower defense games, this is a no brainer, up there with Defense Grid and Defender's Quest.",
            "review_score": "1"
        },
        {
            "review_text": "THE best tower defence game ever created. It has huge depth, variability and replayability.  I though Defence Grid was great... well this is completely different league.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty much the king of tower defense games. You won't find any game as good as Gemcraft in this genre. I guarantee it!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best (if not the best) Tower Defense game ever. I don't have much else to say.  well, thats a lie i have a lot to say about how much i like this series, since i have played all 4 installments.  This installment is the best so far, content wise and everything else. (though the constant re-shuffling of gem color specials from each installment can get confusing).  The fact that you don't get access to all the skills (and need certain wizard levels to improve) but need to find the skills first is my favorite change. And if you thought the game was easy theres also the 'iron wizard' mode which makes this game a real test of skill  I personally don't have any real issues with it (except with some of the 'vision fields')  Definitely a must have for those who love tower defense games",
            "review_score": "1"
        },
        {
            "review_text": "Great game, packed with content. There are literally thousands of ways to play. There are 419 achievements, if you like that sort of thing -- and they provide skill points for upgrades so are valuable in-game. Of course, about half the achievements are easy enough (a bit like playing Candy Crush :-) but there are more intricate and fun ones to work out, and a few more hard-core (which are optional to complete the campaign). There is a whole hard-core culture of gem-weaving and insanely high XP levels, so it appeals to casual gamers and hard-core completists alike. There are hundreds of maps which look and play differently depending on which of at least 9 different gem-colours are available for your defenses. Definitely worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "I'd say it's the best Gemcraft game to date. Runs flawlessly on PC, unless you have several hundred monsters on the screen at once. It's occasionally frustrating because of sharp difficulty curves, but these can be overcome and so they don't take that much away from it. An 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This is just about the Best Tower Defense game there is. Nothing special here. :D  It is maybe comparable in quality with Kingdom Rush, but (much) more complex, and way darker in style. I know no other relevant tower defense game to compare with.  You defend yourself on many stages (levels, maps) against waves of bug-like monsters coming through predefined (but not limited) path to your wizard core. Your defense consist of firing towers along the path you can equip with different types of gems. These gems define what kind of attack shot will tower use (for example slowing, poison, chain, mana steal), and gem types can be combined together. You buy towers and gems for mana that is slowly replenishing by itself, but mostly you gain it from killing monsters. Funny twist is that your wizard core can 'banish' monsters reaching it in exchange for some of your mana burning up, if you have enough of it (and there are ways to decrease banishment cost). You usually lose a stage when your core is reached by a monster and you have no mana left for banishment at the same time. And this is just core mechanics.  But did you know, that on stages you can also: use gems as one shot bombs alone or to activate powerful shrines, build power amplifiers for gem towers, use several special skills and spells to curse monsters or enhance gem tower damage, collect special rewards from destructible buildings, boost your mana pool from harvesting mana shards, kill mysterious apparitions for more rewards? And if it is not too much for you yet, there is campaign map, where you progress through stages and explore new areas, there are exp and levels that contribute to your skill points, and there are talismans you can equip for various bonuses ingame. And surprisingly it is not complicated game to play. If you wish to play brutally simply you can. And if you feel like you are up for challenge, you can try to use all of your options at the same time.  To sum it up: + Solid but original and complex tower defense + Control over many aspects of game difficulty, before starting and during battle, so you can push your limits + Nine gem types to combine, several meaningful skills and spells, talisman system bonuses, over 400 achievements + Background storyline about wizards, forgotten evil and lost rituals + 'Dark-themed' visual style and storyline are nice contrast to some 'lightly' taken TD games +- There are many, many stages to beat +- You can reach ridiculous wizard levels if you are dedicated enough  - Lets face it, it gets repetitive after some time - No gamma correction means less visible details, unless you brighten your display settings - There are some disbalancing, yet not game breaking mechanics, especially on higher levels  Final conclusion: Strongly recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is way better than I would have ever thought it was, even after reading all the good reviews. This is so much more interesting than the average game in the genre. I will still be playing this game 5 years from now.......  It's awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Played the original gemcraft game on flash sites like newgrounds and armor games, and this version isn't any different in terms of quality. It's great!",
            "review_score": "1"
        },
        {
            "review_text": "iron wizzard gizzard 9x speed 4 life + i am now immune to jump scares irl as a bonus 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the long standing TD series games around. It has been free to play for a long time on armor  games.com . So why play it on steam you ask? Great question. As a free to play game on  armorgames.com , it has had a pay to play an 'upgraded' edition which is what you are paying for on steam.  Pros-  Highly addictive. long replayable game with maps that you will revisit. Easy to learn. hard to master.  Cons-  Originally designed on a flash platform, and still plays like a flash game. Many tablet games are flash games, however this series has been around longer than tablets. This developer and many others are the reason for you phone and tablet games.   Overall one of my favorite games outside of the steam community and a welcome single player game to the community.  On a side note, while many developers have taken adavatnge of the cash grab aka 'early acccess' on steam, this developer has been around for years putting out free to play games on his own time for the love of gaming. This is one developer that truly deserves your attention. If you want to see what this game is all about, check it out at  armorgames.com  and come back with your wallet. You will not be sorry.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most longest and complexity tower defense game. You will surely spent hundreds of hours to get all achievements.",
            "review_score": "1"
        },
        {
            "review_text": "Gemcraft - Chasing Shadows is a wonderful game. The graphics and UI look kinda janky but it's well thought out and the progressional system works perfectly. You discover, or are introduced to a new aspect of the gameplay almost every new field you play. The music is simple and incredibly atmospheric and although the graphics clearly weren't a major feature in the games creation they definitely create the perfect aesthetic.  I love tower defense and this is probably one of the best tower defense games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "100% recommend. Besides the obvious reasons why, like  lots of content  and  innovative gameplay , there's another reason why I love this game so much.   It's mature and takes itself seriously, so no matter what age you are, you can enjoy it.  I always loved tower defense games, but over time, this genre has been occupied by kid games. I'm talking about bright, cheerful, pathetic  Kingdom Rush ,  Bloons Tower Defense  and others. If you hate these games, this game is for you.  Yeah, story isn't that good, but atmosphere is great and nothing is more awesome than being a demon-hunting, gem-crafting wizard, stranded in the wilderness!",
            "review_score": "1"
        },
        {
            "review_text": "Very polished game. 191 different, unique maps. Great sound design, gives a feeling of oppression. You get stronger by clearing areas, and you can get more by re-visiting them and getting a better score. You are in control of the difficulty and there are various ways to adjust that, before and during the fight. This means you cannot get stuck, as eventually you'll be able to win by pure brute force. And once you start doing survival mode farming techniques, you discover that there is no level cap.  Then there's the huge list of achievements. Awesome. And they're also tracked ingame separately for each individual save, which boosts replayability. Also, Iron Wizard mode for a simplified but much more challenging playthrough.  Try the previous chapters too if you liked this and want more. They're flash games playable for free in the browser. They have somewhat different rules and much less polish, but the feel is the same.",
            "review_score": "1"
        },
        {
            "review_text": "I've played all prequels and decided to wait to review this game. I won at ~40 hrs just to show how genuinely entertained I was.  I can't find any flaws with this masterpiece, and I've tried. This is one of those few games that actually respects your intellegence and brings glorious content to the table in the process. Any completionist NEEDS this game, there is so much to do here. Placing gems in towers/traps feels so gratifying. I like being able to create one boss gem and wipe out all the mosters on a field, or strategizing on fields where any exp farming I may have done before doesn't matter.  This may be the best Tower Defence game known to man. 92/100   The ending makes me crave more!  ",
            "review_score": "1"
        },
        {
            "review_text": "'Holy ♥♥♥♥, dude. Gemcraft's on Steam!' [Immediately breaks open credit card]",
            "review_score": "1"
        },
        {
            "review_text": "I adored all the flash games, figuring it couldn't get any better. And then this comes out and blows them the ♥♥♥♥ away. The difficulty is steep but fair, and all gems serve a unique purpose in their own right, and since each stage demands a different set, you have to learn how to use them all.  I do have 2 complaints though, and they're so minor that they're practically nonexistant. 1. Whenever you close the game, your Battle Traits are all set to 0. It's not a massive problem by any means, but I tend to forget to set them, or forget how high I set them. 2. There's no quick way to switch out your Talismans, or your skills for that matter. I'd like for there to be an option to have different sets, so you can mix and match depending on the stage, without having to use a minute or two on switching Talismans and skills around.",
            "review_score": "1"
        },
        {
            "review_text": "Gemcraft has always been one of the best and deepest tower defense games out there. The battle traits, skills and some interesting achievements add a lot of replay value to the levels. There are a lot of things to unlock to make yourself more powerful, and so while you can really get to a point where you have 'broken' the game, there is fun in that too.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. Plenty of variety in how you approach character development and map management.",
            "review_score": "1"
        },
        {
            "review_text": "Don't mind to just launch it and play few minutes, this game will keep you entertained for several hours. One of the greatest TD ever made.",
            "review_score": "1"
        },
        {
            "review_text": "There are gems and stuff.  But really, excellent TD game, huge amount of content for just 6/7 quid.",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing the gemcraft series since 2008. Every year peter manages to make a different game that is better than the last. This game has been in the works for almost 4 years now and i can say that this game is worth the wait.",
            "review_score": "1"
        },
        {
            "review_text": "The best tower defense game out there. Hands down. This game killed many other TD's for me just because of how unique and innovative it is. I would start playing them and then immediately head over to Gemcraft. I've been waiting for this one since it was announced!  this game is a steal at 10 dollars, looking forward to the dev's next releases.",
            "review_score": "1"
        },
        {
            "review_text": "I have played many towers defence games, some are great and a lot are as boreing as hell, this is by far my favourite, the length of the game is huge, there is 9 different so called gem towers all can be combined with each other for added bonuses, the combinations of gem towers are endless....Heaps of skills to upgrade, at the time of this review My wizard was at level 2497 and still going. I play every level at max difficulty and bonuses and still really enjoyable to play, it's been the only game that I have played that has so much replayability, most are boreing after the first few hours. Highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Best tower defense game. Hands down. Its simple and yet complex. Easy to learn hard to master. has endless replayability and customization. You don't have this? What is wrong with you?",
            "review_score": "1"
        },
        {
            "review_text": "This has to be the... best tower defence game I've played.. ever.  The amount of options you have when it comes to upgrading skills, the way you can combine gems(gems are you towers, for anyone who hadn't figured that out), the talisman system and the way of how you unlock levels is awesome. And hey, achievement collectors, get ready to collect 419 achievements.  In my personal opinion this game is completely fleshed out, the gameplay experience is great, no flaws, as far as I am concerned, after 15 hours of gameplay.   Risk, reward.",
            "review_score": "1"
        },
        {
            "review_text": "the very definition of an epic TD",
            "review_score": "1"
        },
        {
            "review_text": "For a game that's under $5 ( on sale ) there's no question it's worth buying. It's a tower defense game so obviously you need to like them or you wont like this but as far as the game goes it's suprisingly deep and fun.  It has a talent tree to customize you're wizard A crafting system in the form of a talisman to offer even more customization And a system for increasing difficulty for more xp and a chance at better drops.  The gameplay is simple to learn but still has enough options, so you have lots of choices. Some work better than others. You combine gems to slot into your defense and depending on what you pick and how many are combined you get different effects. Raw damage is important but it isn't everthing.    ",
            "review_score": "1"
        },
        {
            "review_text": "This is essentially a tower defence game.  You build towers, but instead of upgrading the towers, you upgrade gems which  you can put in there. 9 choices, each with very different properties.  The game is very addictive; I played all Gemcraft so far, especially on Kongregate. I thought it was time to give some money to the developers, as this game is totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I have always liked the GemCraft series, since I first discovered it as free Flash Games on Armor Games. All of the entries to the franchise are tower defense games, that successively paid more and more attention to building up content and refining game mechanics.  There is a story to the game, which frankly feels like it has been put there to just not have no story, but these kind of games really can do without a thrilling plot - even more so since the gameplay changes feel like a success to me. And that is kinda the important part: Even though I highly consider myself a person that doesn't like change, I was familiarizing really quick with the new elements and wouldn't want to go back. The new additions make the game more customizable as ever before, so you can play your own style of game and still succeed more than likely.  I already put above 30 hours into the game and it still doesn't look like I have come close anywhere near the end. Up until the point where I am, maps also don't seem repetitive to me and coming back for them, when you acquired new gear or skills can make them feel totally different again.  My only con to the game is the performance which sometimes (even on waves around 100) can go down, especially after casting certain spells. I feel like it's a limitation of the engine they used, I don't think it's my system :]  In conclusion: If you like crafty games, where you can choose your own methods and if you enjoyed any of the predecessors or similiar games from the tower/lane defense genres (like 'Orcs Must Die!' or 'Plants vs. Zombies'), then do yourself a favor and pick this gem up.  In the course of 2016's Steam Autumn sale I nominate this game for the 'Just 5 More Minutes' Award, because of how addictive and long-lasting the challenge of this game is.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend it but stay away if you have an addictive personality. I tell myself just 1 more map and next thing I know I have a beard with 14 cereal bowls on my desk.",
            "review_score": "1"
        },
        {
            "review_text": "this game is a little jewel...oups is a little gem :) ,and then have a lot of achievements ;)",
            "review_score": "1"
        },
        {
            "review_text": "True brilliant for TD fans.",
            "review_score": "1"
        },
        {
            "review_text": "BEST. TD. EVER.",
            "review_score": "1"
        },
        {
            "review_text": "This was exactly what I expected: a tower defense game with a nice story, lots of variety in leveldesign and character speciallisation. ",
            "review_score": "1"
        },
        {
            "review_text": "The graphics from the top may make this game look boring, intimidating and complex.  It's not though. For a tower defense game it is addictive and fast paced. It's very, very simple to learn- though strategy can start to get very complex especially as you give yourself handicaps and go into endless mode.  Probably one of the best tower games I've played- that said, unless you like these kinds of games this one won't be the one to get you into them.",
            "review_score": "1"
        },
        {
            "review_text": "Best tower defence game you'll ever play",
            "review_score": "1"
        },
        {
            "review_text": "I dont write reviews,but this game is thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "Not another tower defense game. Very addictive",
            "review_score": "1"
        },
        {
            "review_text": "fun game. good story. cant wait for the next one.",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best 'tower defense' type game I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Ever just looked through all of your games not really wanting to comit to playing something but wanting to not be bored? Well this is the game you are looking for  ",
            "review_score": "1"
        },
        {
            "review_text": "Over half a decade ago I said 'I would give im 5 bucks on steam' now I have and this complex elegant towar war does not disapoint. Pass if you want deapth buy if you to kill time.",
            "review_score": "1"
        },
        {
            "review_text": "This game is F = is friends that do stuff together U = is for you and me N = is for anywhere at anytime at all, here in the deep blue sea.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good havent even unlocked the whole map and im several hours in and still having as much fun if not even more then from when i started. This game is a must buy",
            "review_score": "1"
        },
        {
            "review_text": "A classic tower-defense game, from back in the days of Flash Game sites. I loved this when I played the original, to have it now in a more modern format on Steam is amazing. I would love to see the previous entries brought over in some fashion at some point, but as I've not completed this one yet, there's no rush",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Been addicted to the series for a while and Steam selling it is pretty awesome.   One complaint: I max out the trait to add 7 shadows to each map. 100+ waves. So...why in the hell do I consistently get 2-3 shadows within the first 2-6 waves? Honestly, that's ludicrous. It's like an RNG for an instant lose. (Cue the 'Lrn 2 Play' people) It should be random, and not structured, because that's part of the challenge. But there really should be some sort of control. Minimum wave before the first shadow, or minimum wave between shadows, or maximum number of shadows per number of waves. Something to make 107/7 not equal 3 more often than not.  This is a pretty minor complaint in the grand scheme of things though. You are not obligated to activate that trait. But it's still something that irks me. Definitely not a dealbreaker though. If you like TDs, this game is solid.",
            "review_score": "1"
        },
        {
            "review_text": "What a great game! It's extremely deep with a massive variety in everything! Towers, monsters, upgrades, out-of-level progress. Okay not in story line, no I don't read the texts. This may seem scary, but the game starts you off nice and slow and introduces the principles one-by-one. It's very nicely paced and I enjoyed every level.",
            "review_score": "1"
        },
        {
            "review_text": "Basically a flash game brought to steam. However, it has a very detailed system and requires actually thinking before attempting battles the further you get into the game. Keeps me entertained and requires a lot of time invested to 100%(wihch is a good thing). Also being the achievement ♥♥♥♥♥ that i am i was pleasantly surprised how many achievements there were.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Very satisfying TD game. The screenshots don't do it justice. Addictive and ever-challenging!",
            "review_score": "1"
        },
        {
            "review_text": "Gemcraft 2 is something special in the genre. It is a tower defence game that allows you to slowly build up your strength until you have the power to effortlessly squash entire armies and even though doing so is easy, it's still fun.  I like the Iron Wizard mode, it's a very nice addition for the Steam version.",
            "review_score": "1"
        },
        {
            "review_text": "fun game when you are bored or have nothing else to play or like TD games or simply...really fun game that makes you think when you take it seriously",
            "review_score": "1"
        },
        {
            "review_text": "Best Tower Defence game on steam, and my 2nd favorite in the genre. (Protector series have allways been my favorite)  GemCraft started out as a flash game on sites like newsground, armor games and kongregate, and took the jump into greenlight and steam not too long ago. This is the 4th GemCraft game made, and the other 3 were all Chapter 1 stories.  If you like tower defence, there is no reason whatsoever NOT to buy this game.   8/10",
            "review_score": "1"
        },
        {
            "review_text": "Simply my all time favorite tower defense game. And trust me, I've played A LOT of them. Even when you have beaten almost 200 different fields it still has replay value. Increasing the difficulty with battle traits or embarking on the Iron Wizard journey, which has a different setup and puts your strategic thinking to a whole new level.   If you like tower defense games then definitely give this one a try. You can try out the game on armorgames. It has limitations, but you can get the taste of GemCraft.",
            "review_score": "1"
        },
        {
            "review_text": "very good, very nice, very handsome",
            "review_score": "1"
        },
        {
            "review_text": "Best tower defense I ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Just buy this game!",
            "review_score": "1"
        },
        {
            "review_text": "So, im a little confused. This is the 2nd game in a serie? Will I get the other chaperters seeing as I payed for 'GemCraft - Chasing Shadows'? To me it seems I have payed for the whole serie, but cant tell if I will get the rest of what I payed for. XD Again im a bit confused.",
            "review_score": "1"
        },
        {
            "review_text": "Well... for me, that play Tower Defense games since Warcraft 3 (Custom Maps | Wintermaul, Element TD someone?!?) is an outstanding game.   For those who played the first chapter on Kongregate, this game, on steam, is heaven!  Nice and Hard game, don't think this game is 'another' TD... And is not hard because it's meant to be hard, it's hard because you must understand how the map and the combination of the gems work, and is a more complexity than you think.  A must game for those who love TD games!  9.4/10 - Excellent!  Fox. . .",
            "review_score": "1"
        },
        {
            "review_text": "It feels like it takes a little longer than the previous games to really get into it but still a solid TDG. Worth the money if you enjoyed the previous games.",
            "review_score": "1"
        },
        {
            "review_text": "A very solid, addictive and fun Tower Defense game with a progression system, difficulty customization and a tower crafting gimmick that leaves room for almost endless experimentation. There isn't much else to say. The graphics are a bit dated because it originated as a flash game but it's still extremely functional.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! hundreds of levels, dozens of towers, few type of monsters that will keep you on your toes for 100+ hours.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of achievement to clear and cheap.  I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Best tower defense I played so far (except for some TD mods played on warcraft ... ).",
            "review_score": "1"
        },
        {
            "review_text": "Very well put together Tower Defence game, with an interesting set of basic mechanics and character progression, decent visuals, and an excellent soundtrack.  The game does get quite boring once you figure out what the best gem setup is, however.  Still, this is well worth diving into.",
            "review_score": "1"
        },
        {
            "review_text": "GemCraft is my favorite tower defense series, and this is the best entry in the series to date. Fun game mechanics, an engrossing theme, with good art &amp; sound. Highly addictive. There's a free browser-based version of this, but it's worth paying for it here on Steam because of the seamless Steam Cloud shared savegames -- play a little at home, a little at work, whenver you have a minute, and progress is shared. Totally worth the cost for that convenience.",
            "review_score": "1"
        },
        {
            "review_text": "I find the GemCraft series of games to be among the very best tower defense games that I have ever played. In fact, I think the very first tower defense game I ever played was the first GemCraft game when it came out on the web. Very much worth it if you are a fan of tower defense games.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game. Especially if you like tower defense. This game will make you think. It's accessible if you have no idea what you are doing but will make you stretch to get the more difficult levels and achievements.",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you have played the other GemCraft games and loved them. There is alot of content to the game that will keep you busy for hours!",
            "review_score": "1"
        },
        {
            "review_text": "Gemcraft has a nice variety of gameplay strategy! Walls, Towers. Gems and a Talisman, keeps the game interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent tower-defense. Very complex but accessible, with a lot of content: you can play it for hours and hours. To make your mind before buying, you can also find previous versions of the game in flash on free game sites.",
            "review_score": "1"
        },
        {
            "review_text": " What I liked:      Has all the options that comes standard with a TD game (mazing, enemy prioritization, and upgrades plenty)     Achievements that matters     Tons of levels with variety of tower usage and replayability with modifiers level progression   What You Need to Know:      Enemy variety is limited( not really a big deal), story has unique boss type monsters to make up for it     Can't make your own levels     Based on the free browser game    My Score:",
            "review_score": "1"
        },
        {
            "review_text": "As addictive as Diablo II but with Towers! = Win!!! If you are into TD games, this one... is... ...  a Gem!!! :)",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love the Gemcraft games. Simple tower defense perfected. Super addictive. The first 2 installments were free to play online flash games, and I believe you can still play this one free, but I was so excited to see this on Steam that I was happy to pay to support the makers after the endless hours I've sunk into these games.",
            "review_score": "1"
        },
        {
            "review_text": "As someone who played every entry in the GemCraft series, i was little disappointed at first, at one point in the Game everything starts to feel like a grind, most levels aren't difficult, just build your little beat it all setup and call waves early and upgrade you area of death. It gets more difficult as you unlock more difficulties, but personally i recommend people to play it in Iron Wizard mode, less options, no going back to get stronger, just more streamlined and just the right amount of challenge.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! I bought on a 80% off sale, but it's worth full price.",
            "review_score": "1"
        },
        {
            "review_text": "One of the deepest and most interesting tower defense games i've seen in a long time. Playied the flash version was back when and this version is incredible. An easy recommend for an TD fan.",
            "review_score": "1"
        },
        {
            "review_text": "Love it:) Lots of fun hours for a fair price:)",
            "review_score": "1"
        },
        {
            "review_text": "This is a tower defence game. You can find much more better looking tower defence games. You can find much more story oriented tower defence games. You may find all kinds of tower defence games. Yet, all of them will be too shallow compared to this mariana trench. So many gems, such complexity, wow.",
            "review_score": "1"
        },
        {
            "review_text": "One of the BEST Tower Defense game on the market! 10\\10",
            "review_score": "1"
        },
        {
            "review_text": "Been a fan of tower defense for years. How come I never played gemcraft until now? Challenging but not impossible. Upgrades and rewards come at a medium quick pace. I will be playing this for a while.",
            "review_score": "1"
        },
        {
            "review_text": "It feels like it takes a little longer than the previous games to really get into it but still a solid TDG. Worth the money if you enjoyed the previous games.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent tower defense game! Ranks right up there with Defense Grid and PvZ.  RPG element made it really fun. A lot of different things to upgrade and playstyles possible. Respec was easy and with over 400 achievement w/ in game rewards it encourages you to experiment a bit. Levels get a bit repetitive but in a game like this it's just part of the expected grind. Took me over 50 hours to get 60% achievements and complete all regular &amp; half puzzle stages. Enjoyed every bit of it.",
            "review_score": "1"
        },
        {
            "review_text": "It's Gemcraft, the tower defense game with complex math and infinitely variable strategies.  Same as the flash version, minus the freemium crap, so you get all the content right from the start.  If you liked any of the previous Gemcrafts, you will surely like this one. It adds more upgrades and some truly devious challenges.",
            "review_score": "1"
        },
        {
            "review_text": "It's Gemcraft, again! It only gets better with each iteration, and although there are a few UI quibbles and some funky moments in the difficulty curve, it's a top-notch game and I look forward to more.",
            "review_score": "1"
        },
        {
            "review_text": "One world Addictive!!! If you like a fun and challenging TD game definitely get this one and when is on sale its even better",
            "review_score": "1"
        },
        {
            "review_text": "Too much fun.  Seriously, I won't be able to do anything else for a while...",
            "review_score": "1"
        },
        {
            "review_text": "This game gives Leslie Hall a run for her money in crazyness for gems.",
            "review_score": "1"
        },
        {
            "review_text": "Everything a tower defense game should be. There are lots of achievements , lots of useful stuff to work towards and the maps look great .  Some of the maps are very challenging , I've done many a restart . Best Tower defense I've played to date .   ",
            "review_score": "1"
        },
        {
            "review_text": "This game has a good deal more customization than what i was expecting and there is a lot of fun to be had with the styles of gameplay you can choose to complete a level by, should it be Gem bombing, Traps or the classic tower defence. i havent been able to do customization in a tower defence game before so i have got to give this a recomendation. Only downside is the story seems a bit slow although that could be just the little time i have played but none the less it has me interested.",
            "review_score": "1"
        },
        {
            "review_text": "I strongly recommend this title to all tower defense enthusiasts.  If you havent played any TD games yet, you might want to try out previous GemCrafts online first, since this one somewhat throws you in at the deep end with a few things.",
            "review_score": "1"
        },
        {
            "review_text": "Having spent over 40 hours on this as of writing, I can't help but recommend this game fully. I did get it for about 69p, too, which was a steal.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best tower defense games I've played.",
            "review_score": "1"
        },
        {
            "review_text": "the best TD series out there :D ... wait for discount and try!",
            "review_score": "1"
        },
        {
            "review_text": "I was very suprised to find that I enjoy this game so much. I play plenty of tower defence games but did not expect much from this one due to the pictures. A fun and deep tower defence.",
            "review_score": "1"
        },
        {
            "review_text": "GemCraft Chasing Shadows is a Tower Defense game wherin you combine 9 different gems into various combinations. Each of the nine colors of gem represents a different modifier.  Ive played 119 hours of this game. A number one could compare to the biggest of triple A titles.  Its pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "If you like tower defense games, then you need to play this one. That's all there is to it. I've played several of the gemcraft games online, and the ability to buy one and support the developers feels great. Also, I won't accidentally delete my cookies this time.  Pros: Lots of content, tons of map, loads of different strategies. Hours and hours of playtime.  Cons: FOOS (First Order Optimum Strategy) --that is, this is the sort of game where you'll find one thing that works, and you'll be tempted to stick with that strategy for the entire game. Don't. Play around with the different gem types, find a use for traps and altars and everything. You'll have way more fun that way.",
            "review_score": "1"
        },
        {
            "review_text": "Got this game for $2.49, had been wanting a casual tower defense - very happy with it. Very nice look and feel with a somber, dark soundscape to match. Surprising amount of quality content for such a cheap game. This will probably be like my next Puzzle Quest. :-)  EDIT: Having sunk 50+ hours in this now, I'd just like to thank the makers of this game for such a great time at such an insanely low price. :-) Possibly the best casual game I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Complex and rewarding tower defense game. LOTS of achievements (a few hundreds) if you like that sort of thing.",
            "review_score": "1"
        },
        {
            "review_text": "Best tower defence game! Endless possibilites due to battle traits (mission difficulty), combinations of gems and much more. This game is really well thought out.",
            "review_score": "1"
        },
        {
            "review_text": "Best classic tower defense ever!",
            "review_score": "1"
        },
        {
            "review_text": "This is the succulent gemcraft experience I crave and desire",
            "review_score": "1"
        },
        {
            "review_text": "Addictive Tower Game that is more than just another gem game. Don't let the title confuse you - there is no need to have played the prior versions of this game to jump into this one. Further, there is much more mathematical and stats depth to this game than what I initially expected. You can really self-modify this game (don't confuse this as a software mod, I am referring to modifying settings and difficulties in-game). There are many different ways to earn bonuses via the stratified difficulty settings by category and type. The variables are so many - each playthrough of this game could become very unique. This is like RPG meets Tower Game. Admittedly, I am satisfied especially with the 75% off sale price during the current Steam sale, so if you're waiting for a similar price point, it comes around.",
            "review_score": "1"
        },
        {
            "review_text": "GemCraft Chasing Shadows is a Tower Defense game wherin you combine 9 different gems into various combinations. Each of the nine colors of gem represents a different modifier.  Ive played 119 hours of this game. A number one could compare to the biggest of triple A titles.  Its pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a filthy casual who doesn't even fully understand the enrage mechanic but it's a good game.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Spent a lot of hours on it, and am not planning to stop there. Definitely recommend - if there was any other similar game I'd be happy to buy it too.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, challenging. Pretty good variety for a tower defense without having too much complexity.",
            "review_score": "1"
        },
        {
            "review_text": "The very best tower defense available - the level of depth is just insane. And I haven't even gotten to the Iron Wizard mode yet. Looking forward to playing this one for a long time.",
            "review_score": "1"
        },
        {
            "review_text": "The Gemcraft series has always been my favorite tower defense game, and this iteration just continued expanding on everything that makes it so great. I bought the premium when it was just a web game, and bought it again once it came on Steam. It epitomizes what TD games are supposed to be. ",
            "review_score": "1"
        },
        {
            "review_text": "i thinks this game is the best game in the all steam store.",
            "review_score": "1"
        },
        {
            "review_text": "This is THE tower defense game that all other tower defense games want to be when they grow up.  You could spend 30 minutes here and there and have a great time, or you could devote hours upon hours to trying to perfect your strategies for each map. So many different combinations of abilities, powerups, and effects make each scenario have multiple paths to completion. Plenty of different maps with tons of options for scaling the difficulty up or down in different ways make for high levels of replayability.",
            "review_score": "1"
        },
        {
            "review_text": "I came back here wondering why there haven't been any other good tower defense games made lately. This game is still the best to date.",
            "review_score": "1"
        },
        {
            "review_text": "Played this game quite a bit. More than anyone I know actually. In it's most advanced stages it has some performance issues that can cause a level to drag on for many hours. But the diversity and replay are excelent.",
            "review_score": "1"
        },
        {
            "review_text": "As a tower defence fan i couldn't pass this game. At first it seemed like a fun game with lots of mechanics. Past 30 hours and a few unlocks it reveals itself as a really poorly made TD game...  -So it's all about gems - there are 9 types of gems, 6 of them are barely have any use, other 4 are a must have if you want to beat a difficult map (and unless you unlock them you're limited to what developers give you on that map) -Gems have different effects on monsters but every tower is the same single target cannon (exception is a chain gem with which your shots deal damage to several monsters in a chain) -What seemed to be a lot of mechanics is actually a pretty shallow set of similar things, half of which arent even viable like combination of more than 4 types of gems, cause you will LOSE a lot of damage because of a skill that buffs only up to 4 gem combination... or traps... traps are essentially useless cause they can't get even close to what a buffed tower will do... or gem bombing which is only 'useful' to make waves stronger to get more exp/mana... or barrage spell which travel so slowly it lands when tower shots already killed everything and if your barage is actually killing something then you probably buffed waves too hard and might just die anyway -WAY too many waves... WAY. 1 map can take an hour to beat on high difficulty and you use lots of traits and also enraging waves... -It lags like any other game won't ever lag, cause to match your power you need to buff waves more and more resulting in thousands of monsters on the map -It's insanely unforgiving... you can sit for an hour on a map with like 150-200 waves, enraging them, then you accidentally (cause of lags or losing patience) enrage them for a bit more than you can actually hanlde and there it is - youre ♥♥♥♥ed, start the map over again -Limited demolitions... WHY THE ♥♥♥♥? You are carefully building a labyrinth and bam you placed something wrong a couple of times, well you better be precise next time cause you can't remove it anymore... -Annoying ♥♥♥♥ coming out of nowhere without any warning ranging from a harmless ghost flying by to a huge fat ♥♥♥♥ness requiring lots of dps or it will oneshot you or how about losing control for 20 seconds? Sounds fun right?  If it was developers first project then these flaws might be actually somewhat forgivable (is it even a word?), but looks like it's already a game series (it might be just an updated version, i'm not sure).  What i liked is the style and maybe some challenges. I wish developers use their acquired experience and improve the game or make their next project better.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a terrible game, but personally I don't think it's worth the time investment required to progress through the levels. It dried up on me pretty quickly. Good for patient people who really like minigame arcade feeling TD's, but personally I couldn't get into it, there's just better stuff out there.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm not impressed. The graphics are too basic. It could easily have been programmed that way in the 20th century. Its pixellated, almost retro and not even isometric. For such primitive visuals it loads slowly.  There is little to differentiate the strengths and weaknesses of the enemy. Tower selection and placement doesn't seem to matter much. Weapon strikes and dying enemies have forgettable animations. There is very little strategy and gem type availability seems to be random for each level. I quickly became bored of the gameplay.  The gem-crafting aspects seem tedious and overly complicated. The best evidence of this comes from the wordy tips. These may be helpful but the design is dated. Unless you come back to the game a few times in the one day it is easy to forget the details.  The various aspects of the game don't seem to mesh at all. I can tell from other reviews that people voting this game up appreciate the franchise rather than this title. 3.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "gemcraft - chasing shadows is a DISGUSTING MISOGYNISTIC GAME. I KNOW WHAT U DEVS WERE TRYING TO GO FOR. TRYING TO ATTRACT GAMER WOMYN TO YOUR CRAP MISGOYNIST GAME BY MAKING IT SEEM LIKE AN OVER GIRLIFIED MINECRAFT, WHICH WOULD BE A GOOD IDEA IF IT WERE AN ACTUAL SAFE SPACE FOR WOMEN. BUT WTF DEVS? U HAD TO GO AHEAD AND 'CRAFT' THIS IMPURE GEM. WHILE I WAS PLAYING THE GAME, THE GAME IS CONSTANTLY MAKING WOMEN THE 'PROBLEM' WITH THE MAIN CHARACTER CONSTANTLY SAYING 'SHE' IS THE MENACE. ARE YOU TRYING TO IMPLY THAT WOMEN ARE THE ROOT OF ALL PROBLEMS? WHAT. THE. ♥♥♥♥. NOT TO MENTION THAT THIS WOMAN IS ALSO BLACK... THATS RIGHT... FEMALE PEOPLE OF COLOR ARE THE PROBLEM IN THIS WORLD ACCORDING TO THE DEV. EVERYONE! LETS UNITE AND GET THIS GAME TAKEN DOWN FROM STEAM! WE AS FEMINISTS DONT HAVE TO PUT UP WITH THIS BLATANT RACIST MISOGYNIST ♥♥♥♥♥♥♥T! LETS EMAIL GABE NEWELL AND GET THIS TAKEN OFF STEAM! FOR SOCIAL JUSTICE!",
            "review_score": "-1"
        },
        {
            "review_text": "This game, although it has a goal and story, is pretty much a sandbox Tower Defender. There are tons of ways to customize the level and difficulty, both before and during the level. It's kind of like an old arcade game, where you're trying to reach the high score and there is no defined ending.  Unfortunately, the game does suffer a bit because of it. There's never a need to stop and reconsider your strategy, you can always just go around grinding for exp until you can brute force through the game. The monsters are just walking numbers with hardly any relevant features. The bosses are nice, but you usually don't need any special strategies to beat them, just keep shooting with your strongest gem. The gem types aren't well balanced at all, you always need to go for highest damage output and ignore utility because monsters will get exponentially more healthy as the time goes, but they will not get significantly faster or regen more health or anything that would make you want to use utility gems.  This is very unlike games like Kingdom Rush where you have only 4 tower types (can be upgraded into some specialist towers later), huge variety of opponents and only few places to place your towers. In that game, you need build specific things to counter specific enemies. In Gemcraft? Nope, just combine yellow with red and upgrade whenever you can.  There are probably some techniques needed to beat endurance (1337 waves I think) or get grade 100 gems, but even then it's mostly about grinding enough experience to be able to do it.  The strong point of Gemcraft is all the customization. There's really a ton of ways you can play. But why would you? If you go too far with the difficulty buffs, you're not gonna beat it no matter what. If you go too low, you'll be bored to death. It's hard to find the sweet spot. It never feels like there's a challenge that needs strategy and wit because you can beat everything if you grind for more experience.  It's a good time waster when you're tired and just want to get instant gratification by doing nothing. But 10 bucks... Nah. Don't. There are more entertaining games you can buy for that price.",
            "review_score": "-1"
        }
    ]
}