{
    "app_id": 296530,
    "name": "Coldfire Keep",
    "release_date": "2014-05-09",
    "developer": [
        "Steve Jarman"
    ],
    "publisher": [
        "Steve Jarman"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Dungeon Crawler",
        "First-Person"
    ],
    "achievements": 0,
    "positive_ratings": 37,
    "negative_ratings": 61,
    "price": 2.89,
    "description": "An ancient power lies hidden, deep within Coldfire Keep, threatening the peaceful town of Newsettle. Now four friends must take it upon themselves to become heroes, and venture into the depths on a quest to secure their town's future.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/296530/header.jpg?t=1447361551",
    "minimum_requirements": "OS: Windows 7 SP1, Windows 8 (all 32/64 bit versions) Processor: Intel Core 2 Duo E7300 @ 2.6 GHz or AMD Athlon 64 X2 5200+ @ 2.7 GHz Memory: 2 GB RAM Graphics: nVidia GeForce 8800GT or AMD Radeon HD3870 (512MB VRAM with Shader Model 4.0 or higher) DirectX: Version 9.0c Storage: 500 MB available space Sound Card: DirectX 9.0c Compatible Sound Card with Latest Drivers",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I for my part enjoy this game. It's like some sort of a casual 'Dungeon Master'.  Ok there really isn't much depth to it but then again, I don't always want the depth of an epic game like 'Dungeon Master' or 'Eye of the Beholder'. Sometimes this depth is just overhelming. This one here is easy to pick up and easy to lay away to play on later. It's fun. Really. Just don't expect it to be epic.  Apparently I find the graphics quite enjoyable and the sound is athmospheric enough for such a kind of a game. It all suits my taste really well. I like the spoken intro too. The voice over is professionally done, sounding good and clearly understandable. The game even has some nice touches (like eastereggs) to it, for e.g. the disk scratching sound when you're saving your game just like in good old Amiga days when playing from floppies. That's cool!  Gameplay wise it's a classic Dungeon Crawler through and through and there is everything in it you would expect from such a game: keys, doors, switches, levers, monsters, mazes, riddles, loot ...  I must say it can't compete with the classics in any regards except the updated dungeon graphics but I think that wasn't the intention when creating this game either so rating it in it's own regards I can easily recommend it.  There are only one or two little letdowns for me in this game:  1. The fighting is too slow. I guess this comes from being a mobile port. In this game here it's not possible to walk in a backward circle around strong enemies hitting them from the side while evading their attacks. (I think classic Dungeon Crawler players know what I mean ... ;). In fact it is somewhat possible but too unreliable and waaay to slow, it gets boring to do it but it's not necessary either because your magic characters have literally unlimited mp so you just stand still in front of the enemy and heal your party all the time. Not nice but it works. Only I liked the more action oriented version from classic games more.  2. Speaking of fighting: Daggers can't be thrown, either can't arrows - you need a bow to be able to shoot the arrows. Again the fact that the party as a whole is using arrows from the same pool makes the game even more casual. No micromanagement here. And I think you can't sell items, and probalby there will ever be three items to buy in the shop the whole game through ... You could see this all as a positive though as it makes the game more casual ...  As I said before this game can't compete with the classics (my personal favourite still being the underrated and mostly forgotten 'Black Crypt' for Amiga) but that's okay for me ...  Maybe it should be priced a little lower, like 4,99 €, but when it's on discount and you're looking for a nice snack of oldschool dungeon crawling you can get quite a lot of fun out of it. If you did like games like this in the old days chances are high this game here sends you right down memory lane. And it does it in a nice and easy package.  @ngel",
            "review_score": "1"
        },
        {
            "review_text": "8/10 Quite Fun! It reminds me of the good old days of cRPG but I cant quite decide which one it is similar to. Very much like Might and Magic 1 through 6 but with less story. Also alot like Bards Tale 1.  If you liked the older style games (1980's and 1990's) before they became all graphical fluff but dont want to waste time with a story (beyond 'Im here to kill sht') then you may like this game too.  That said, it is lacking in depth. There is no story beyond 'Hey im in a dungeon, lets kill stuff' and it feels more like someones early work rather than a polished full fledged cRPG.",
            "review_score": "1"
        },
        {
            "review_text": "I really want to love this game but I can't because it's a mobile game. The graphic and the sound is enjoyable for me, but the story is not enough in 2014. The interface is perfect for touch based computer, but hard to use with mouse.   I'm sad, because I don't find this game in google play, but will never play whit that in my home computer. :(  If you are a old and old school player like me, you must try this game - if you not, you must find anything else.",
            "review_score": "1"
        },
        {
            "review_text": "Overall: 4.9 / 10  The biggest problem of the game is it is horribly unpolished. It is obvious the game was made with the intention of having to swipe fingers across the screen rather than use a keyboard. There is only one save slot for every party you make, so if you manage to pull levers in the wrong order in a puzzle and get yourself stuck, you're done. That's what happened to me about 80% into the game and after that I felt there is no point to start a new game. However, aside it being slightly broken, this game did manage to take 7 hours of my life, that I have kind of enjoyed.  In the case of this game, a line between recommended and not is very thin, but I decided that the unforgiveness of the game to do the puzzles in a different way than it has imagined it being done is unforgiving. That tipped me over to say No, skip this title. However, if you are REALLY into these types of games, you might still want to get it.  -------------------------------------------------------------------------------------------    Graphics: 7 / 10 Pleasing to the eye, exciting. Few quite really nice touches to the levels.     Sounds: 6 / 10 Neat menu music, decent ingame sound effects for the most part. I felt as if the reading speed at the start was too slow.     Story: 6.5 / 10 Quite basic in fact, but enjoying regardless. Slow progressing.     HUD and controls: 4 / 10 HUD itself feels slightly crowded. What you see in the screenshots of the game is the HUD if you play with non-traditional settings. This mean that game will try to act as it is still kind of being played on your touchscreen device in a way that it will allow you to turn around by clicking and dragging your mouse instead of swiping your fingers. This however can get annoying as you have to click on the items, walls or objects to interact and may sometimes turn instead of doing that. Upon switching to traditional settings, your character will not turn around randomly because of your mouse, but your hud will receive about 8 new buttons on it that give you an option to use them instead to turn. This is totally obsolete in a PC game where you use a keyboard to navigate. The game will also not bother teaching you some of the controls required for moving on with the game (Tab, you're welcome).     Fun factor: 6 / 10     Possibility to get stuck at random times: -1 off the overall rating  ",
            "review_score": "-1"
        },
        {
            "review_text": "It is The Legend of Grimrock for the poor. It even has the same puzzles: 'shoot on target to raise the floor', 'push part of the wall that stands out' etc. The graphics are ok, but they look sterile - like drawn by amatours. I had a feeling that I am playing game added to Windows 95. If I've never seen LoG, then this game would be ok for some time, but this is not the case. Score: 4/10.",
            "review_score": "-1"
        },
        {
            "review_text": "It looks pretty, but it's complete crap",
            "review_score": "-1"
        },
        {
            "review_text": "Go play Legend of Grimrock instead. This is just a slathery mess of a game. First enemy in the game is a rat with what seems like unending HP. The first room in Fallout, filled with rats, with only a knife was faster to clear than 2 rats standing in front of you at ankle height in Coldfire Keep. Just don't even bother.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a game I wanted to like, but the game simply would not let me.  I can deal with the unpolished visuals. I expected it to look like a mobile game.  The controls are slow and clunky. You are often waiting for whatever time cycle to pass before you can enter another command. Sure, the pauses are generally small, but the frustration adds up. Plus, the default swipe movements are always there, so you can end up accidentally moving while trying to activate levers or pick up objects.  You can use the 1-4 keys to make attacks, an improvement on Legend of Grimrock which is click only, but half of the default party are spell casters and there are no keyboard shortcuts for spells.  And if you accidentally cast a spell with no possible target? You're still stuck waiting for everyone to return to 'idle' state so you can move again.  You also start with almost no equipment. You can pick up a few items laying around an intro area, but when the first fight arrived only half my party had weapons. By the time everyone was wiped out by some golem thing, my shaman had yet to find a weapon and so all they could do was cast Heal and twiddle their thumbs.  There is also the inane conversation between the party members. It's better than talking to the two crazy ladies who run an inn and a shop in a dungeon, but that isn't really saying much.  Yet despite all the time spent on text and conversation, there are other areas that are blatantly ignored when it comes to prose. For instance, the areas you enter and teleport to/from are things like '2a' and '1'. It just struck me as odd. There is also no real explanation of what game items are and how they work. Why do I have rations? No idea. Why can't the shaman wield a staff? No clue.  All in all, this game just isn't worth $5.",
            "review_score": "-1"
        }
    ]
}