{
    "app_id": 296730,
    "name": "Viktor",
    "release_date": "2014-06-13",
    "developer": [
        "Shorebound Studios"
    ],
    "publisher": [
        "Shorebound Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Adventure"
    ],
    "achievements": 34,
    "positive_ratings": 123,
    "negative_ratings": 43,
    "price": 5.59,
    "description": "Viktor is an action-packed sidescrolling adventure with gameplay inspired by classics such as Castlevania and Megaman. As Viktor, you will fight your way through hordes of relentless enemies, lurking traps, and fearsome bosses who will try to keep you from your mission.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/296730/header.jpg?t=1447361558",
    "minimum_requirements": "OS: Windows XP Service Pack 3 or newer Processor: 1.7 GHz Processor Memory: 4 GB RAM Graphics: Nvidia or AMD graphics card with updated drivers, 256 MB Storage: 350 MB available space Additional Notes: Mouse and keyboard or Xbox 360 controller",
    "recommended_requirements": "OS: Windows 7+ Processor: 2.5 GHz dual-core processor Memory: 6 GB RAM Graphics: Nvidia or AMD graphics card with updated drivers, 512 MB Storage: 350 MB available space Additional Notes: Mouse and keyboard or Xbox 360 controller",
    "reviews": [
        {
            "review_text": "I really really wish I could reconmend this game. Viktor has a lot of good ideas and elements mixing bits of contra, megaman, and DMC, but is hampered by poor execution. When the game is at it's best it's pretty damn good, but it is plagued by too many bugs, glitches and control problems in it's current form. Clipping into walls and getting stuck is the biggest bug that will cost you many a life due to no fault of your own.   Outside of bugs it has some flaws including a damage recoil far too great for it's slippery controls to justify and needless use of a lives system (made especially frustrating due to the wall glitches eating up extra lives like candy) and a low item spawn rate that feels horribly imbalanced.  This game could be great with some more polishing but until it at very least fixes the serious wall bugs I cannot reconmend it in it's current form.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not be fooled by those neat graphics. The design of the very few levels in this game is just dull, you move right on a plain surface all the damn time. Most enemies are annoying rather than fun to fight. Most bosses have uninspiring attack patterns and enormous health stacks making the bossfights as tedious as it gets. Honestly, I tried to give the game a few second chances and yet simply couldn't have any fun with it despite enjoying some similar platformers.",
            "review_score": "-1"
        },
        {
            "review_text": "A fun platformer shooter that reminds me of Megaman and Bleed, both of which I think are great. Controls are very good and allow for great dodging capability. The player can select a level (similar to the Megaman games) and go through each level looking for upgrades (like Megaman X). It makes excellent use of the old fashioned 'lives' systems in the levels.  I enjyed every aspect of the game: great controls, fun upgrading options, difficulty, moderate exploration and good music. My only complaint is that the levels (not the bosses) are generally too easy in my opinion. I wish they were more on par with the bosses.  Some people prefer their games to be lengthy. If this is your opinion, this might be a concern for you. It took me about three hours to beat the game on normal mode, but I was happy to immediately turn around and new game + on hard mode (there is also a hardcore mode, which I am insterested to see).  Overall, a great action platformer. Some folks have complained about bugs. Either I'm lucky or all of the significant bugs have been fixed as I have not seen one yet.",
            "review_score": "1"
        },
        {
            "review_text": "Oh man! I don't think I can play this game. I am not a fan of how the controls work. I tried both control schemes and I believe that keyboard and mouse are the way to go for this game.  Also, I was a little disappointed by the art style. I kind of expected it to have a darker feel to it, kind of like the classic 2-D castlevania games. I will give this game a second chance at some point but I will be skipping over this one for now.",
            "review_score": "-1"
        },
        {
            "review_text": "I shoot things and they go splat.  SPOILER ALERT: Epic Music  5/5",
            "review_score": "1"
        },
        {
            "review_text": "The game looks great. I had a hard time at first when I tried to play with a controller because there is no option to lower the sens. of the analog sticks. I had to switch back to keyboard/mouse combo and aiming was fine after that. The only thing that I don't like about this game is health potions are rare and your health goes down fast. Once you die three times, that's it. You have to start the game over again from the beginning. I have yet to find a way to earn extra lives. I'll keep playing but I'm thinking about asking for a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Controls bloody suck with a gamepad aiming should be automatic without having to use the right analog stick.",
            "review_score": "-1"
        },
        {
            "review_text": "this is an awesome mega man meets castlevania (classic 2d of course) style game. i think everyone should play.",
            "review_score": "1"
        }
    ]
}