{
    "app_id": 297060,
    "name": "Freaking Meatbags",
    "release_date": "2015-02-04",
    "developer": [
        "Wild Factor"
    ],
    "publisher": [
        "Plug In Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 126,
    "negative_ratings": 16,
    "price": 7.99,
    "description": "Land on a planet, pick up some rocks, leave before the solar system explodes. Oh, and don't die in the nightly robot attacks! Freaking Meatbags is a humorous real-time strategy game that's all about building a base, mixing meatbag DNA, then convincing those dolts to help you gather resources.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/297060/header.jpg?t=1447361577",
    "minimum_requirements": "OS: Vista or higher Processor: Dual Core CPU Memory: 1 GB RAM Graphics: 3D card with 512 Mo memory DirectX: Version 9.0 Storage: 210 MB available space Sound Card: Stéréo",
    "recommended_requirements": "OS: Windows 7 or higher Processor: Quad Core CPU Memory: 2 GB RAM Graphics: 3D card with 1GB of video RAM. DirectX: Version 10 Storage: 210 MB available space Sound Card: Stéréo",
    "reviews": [
        {
            "review_text": "This is a very fun little game with quite a bit of depth, persistent crew but it's marred with AI bugs that force you to restart a level (the characters cease to respond to orders). Imagine a more tower defensy Command and Conquer where you WASD control the commander. You WASD control a bot commander who is in a dire predicament for having been late to work by 0.01 seconds... yes it's quite goofy light hearted humor. You command locals into mining resources that you then use to build defenses and other machines to save their lives and complete missions. Whoever survived can be kept and deployed to the next level and that's important because each member of your crew level up to become mining expert/tower buff or can be gene-spliced with local aliens to get laser eyes. On top of that your commander can gather attack drones that turn it into a mobile battle station. It's a lot of fun and when the dev fixes the AI it will be a must buy.",
            "review_score": "1"
        },
        {
            "review_text": " What I liked:      Like the DNA building of humans for different roles (Mining, damage +, range +) Can't have them all on one guy     Music is very calming and old school   What You Need to Know:      Game has limited enemy variety, and tower types      Very simple tower defence, not much strategy compared to other great TD games     Your minions seem to wander instead of staying where you put them     Not a terrible game, just not to me a game that I want to sink hours into    My Score:",
            "review_score": "-1"
        },
        {
            "review_text": "Freaking Meatbags is a combination between adorable sci-fi, the terrifying fate of humans in the future, and really smooth gameplay. There are a couple bugs that could be fixed, a few spelling mistakes that made me feel like I was having an annurism, but the game overall is tons of fun. Wish there was endgame content, because once you beat the final boss there isnt a heck of alot to do.   Other than that, a good buy! Would recommend this if you have some time to kill, and traditional tower defense games are too easy and straight forward",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Am enjoying the game I love it~. I was like.. It's only 10$.. i have the extra money might aswell as give it a go~ if i don't like it ohwell. but.. after playing for sometime i Love this game lots.~ If you like RTS/Tower defense Then you may Love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Made Meatbag with:  Rocket Launcher Jetpack Hoverboard Cybernetic Suit Motivational Brain Slug  SupaGangsta Is Born  2 Dual Wield Machine Guns/10",
            "review_score": "1"
        },
        {
            "review_text": "A delightful little tower-defense rts-style game about splicing the dna of your minions to create better/more powerful/faster/tougher dudes/dudettes. Also includes some elements of top-down shooters, emphasising the point-based scoring system with skill-based elements and allowing you to play this game almost any way you want!    The art style is solid, though the alien and human characters are clearly lower quality.... The writing is intensely funny, and will keep you laughing the whole way through.  9/10: Very good!",
            "review_score": "1"
        },
        {
            "review_text": "my meatbags have laser eyes and brain slugs I r8 11/8 m8",
            "review_score": "1"
        },
        {
            "review_text": "Very fun single player game that is a mix between RTS and Tower Defense. Has some good RPG qualities like upgrading different things (the upgrades persist) and levelling up followers. A lot of unique game mechanics I hadn't seen in other games before.",
            "review_score": "1"
        }
    ]
}