{
    "app_id": 297100,
    "name": "Beyond Space Remastered Edition",
    "release_date": "2014-06-18",
    "developer": [
        "Silesia Games Sp. z o.o."
    ],
    "publisher": [
        "Plug In Digital"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Simulation"
    ],
    "tags": [
        "Action",
        "Simulation",
        "Adventure"
    ],
    "achievements": 29,
    "positive_ratings": 55,
    "negative_ratings": 110,
    "price": 3.99,
    "description": "Our journey begins when Max Walker starts a contract with the Alliance of Planets and immediately gets drawn into a galaxy-spanning conflict. His mission will take him beyond the reaches of space, while fighting many different opponents and meeting pirate overlords, scheming politicians, deceitful allies and ambitious leaders – all...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/297100/header.jpg?t=1543574828",
    "minimum_requirements": "Минимальные: ОС: Microsoft Windows XP, 7, 8 Процессор: Intel Core 2 Duo @ 2Ghz / AMD Athlon 64 X2 Оперативная память: 2 GB ОЗУ Видеокарта: 256 MB OpenGL 3.2 or DirectX 10 compliant card DirectX: Версии 10 Место на диске: 2 GB Звуковая карта: DirectX compatible sound card",
    "recommended_requirements": "Рекомендованные: ОС: Microsoft Windows 7, 8 Процессор: 3.0 GHz Dual core or equivalent Оперативная память: 4 GB ОЗУ Видеокарта: 512 MB OpenGL 3.2 or DirectX 10 compliant card DirectX: Версии 10 Место на диске: 2 GB Звуковая карта: DirectX compatible sound card",
    "reviews": [
        {
            "review_text": "I consider myself a flight/space sim enthusiast. This might be the bottom of the barrel of what I've ever played.  I'm guessing that they used Freespace or Starlancer as a point of reference while developing this. The game is mission based dogfighting.   The good (there's not much): Visuals are pretty good for a budget game. More than passable. I didn't experience any major frame rate drops of anything of that nature. The music is stock but appropriate. The story is weak but doesn't hurt anything.   Now, the bad. The enemy AI is not good. It will either fly around aimlessly, or swarm you when it has other objectives. The male voice actor is horrendus, and the female voice is terrible text-to-speech. The controls are worse than both of those. I tried to play this with the mouse/keyboard controls, using a Thrustmaster T.Flight Hotas, and a Logitech gamepad... none are usable, and they're all flawed in seperate ways. I never even got a chance to properly switch my ship's equipment, since when I could get that feature to function at all, it switched it to something I didn't want and was stuck with since I didn't want to burn another 15 minutes into trying to get it to change again.  I got approximately halfway through the game (best I can tell) before getting completely stuck on a turret section. Even on the lowest difficulty, I get annihilated due to the turret moving independently of my actions.  Rating 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "It was hard to decide whether to recommend or not. It's quite a fun space shooter with a bit of short campaign. Some missions are pretty hard, others can be accomplished for the first time. The main cons of this game is the fact that it freezes quite often (I have Win 8.1 64 bit, I don't know if it crashes on other OS or not). If you like this genre, then I recommend buying it, especially when it is on sale. If not, don't buy it, and you save your money and avoid the anger caused by the crashes :)",
            "review_score": "1"
        },
        {
            "review_text": "I picked up this game on Green Man Gaming earlier today, and I thought that it was a pretty neat concept, and well worth spending a dollar. Well, to be perfectly honest, the game really is worth the value. It's basically a dog fighter type of third person shooter, much like you would see in Battlefront II. The only difference would probably be the automated aim system which requires you to aim at a certain area in order to hit them when your cursor changes color. This along with the bad humor and sort of monotonous voice acting makes this game kind of weird.  When you're looking at a star pilot, you're expecting him to be gruff, and cool. Instead you get an awkward flirt. Game is worth the money, and you can dump a few hours into playing it and not getting bored, but these kinds of games really deserve multiplayer. If you're looking for a hard core dogfighter simulator, this game isn't for you. It's more for the casual game that you would let a 10 year old play to occupy his time.",
            "review_score": "1"
        },
        {
            "review_text": "The dialog's a bit painful, and the controls aren't polished.  But the ships are cool in a retro way.    Get it if you like shooting stuff in space.",
            "review_score": "1"
        },
        {
            "review_text": "It sucks, its a direct port from ios. Do not buy this game. It is actualy terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is much like Galaxy on Fire 2 for mobile devices. Controls are very easy it took me like 15 minutes to get use to them( WASD and Directional pad) mouse control was to weird for me to even try to use! The game crashes after every level for some reason and that is the only major con i give this game.",
            "review_score": "1"
        },
        {
            "review_text": "Playing this on a phone or tablet? Sure, probably worth the buy.  On PC with a mouse/keyboard? NOPE.  2/10",
            "review_score": "-1"
        },
        {
            "review_text": "It's ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a complete piece of crap. There is nothing good to say about it. Crappy plot, crappy characters and dialog, just a total waste of time. I want my $3 back. DO NOT BUY!!",
            "review_score": "-1"
        },
        {
            "review_text": "4/10 I hate to admit it but I actually like this game. While it has horrible script/voice acting it can be fun. I like the fact that the targeting seemed a bit better than most space shooters I've played. I do find that there is alot more wrong with this game than right tho. The most fustrating issue I had was with the ship customization (if you can call it that) where you swap out weapons and the few addons. All in all the options aren't bad it was the fact that i had to turn my mouse's dpi to its lowest setting to even begin to try and scroll through the weapons menu because for some reason it didn't have a like 'next weapon/item' you had to swipe it. Even at my lowest dpi moving as slowly as possible I had difficulty changing weapons.  I read that using a controller might fix this issue and make it alot easier, well when I finally did get around to trying my controller the game didn't like it at all. It seemed to have more issues with it. The weapon menus still didn't behave and worse my speed + controls refused to work on the controller no matter what I bound it to. Meaning if I hit the speed minus button I'd have to even finish the mission at that speed or worse restart the mission because when I started the level I chose controler not keyboard so its speed + key didn't work either so more than once my ship came to a complete stop forcing me to restart the level.  Honestly I could have looked pasted all that was wrong with it because of the space fights and the final boss battle which I really liked if it wasn't just so hard to change the addons to my ship. I still to recommend it but with a warning, know what you are getting yourself into lol.",
            "review_score": "1"
        }
    ]
}