{
    "app_id": 297290,
    "name": "Detective Case and Clown Bot in: Murder in the Hotel Lisbon",
    "release_date": "2014-07-17",
    "developer": [
        "Nerd Monkeys®"
    ],
    "publisher": [
        "Nerd Monkeys®"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 15,
    "positive_ratings": 167,
    "negative_ratings": 38,
    "price": 4.99,
    "description": "A strange murder has occurred in the Hotel Lisbon, a man committed suicide with 14 stabs to the back while at the same time he peacefully drank his coffee. This case with contradictory facts could only be solved by the amazing Detective Case and his sidekick, Clown Bot.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/297290/header.jpg?t=1547394171",
    "minimum_requirements": "OS: Windows XP Memory: 128 MB RAM Storage: 128 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Recommending for the portuguese, but maybe you should avoid it if you're not able to play this in Portuguese.  I had a blast, really. All the references and resemblences of my city in a pixelated art style is just amazing to see. A lot of the portuguese culture is shown in this game, and that's why I loved it so much. Even the tiniest things may be referenced, and that's what makes this a huge gem to have on anyone who loves and/or lives in Portugal. The game itself was fun too, the case was entertaining, not very confusing, but kept me going and going until I was actually done with it. I completed the game in one sitting, for about 4 hours.  The soundtrack is AMAZING, the jazzy sound had me hooked, and there's even a Fado song, one of our own genres of music!  I believe that the humour may be completely different for each language because there's a lot of puns in the version I played, so those are pretty hard to translate, if not impossible, hence why some foreigners feel like it fails at humour, but that's because you're not experiencing the best version of it, sadly the only way to play the best version is if foreigners learned Portuguese!  All in all, again I do say, a must-have gem for Portuguese speakers, sadly I don't think people 'from the outside' will appreciate it as much as we do! 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgic for most of the players and a great example of what Portuguese developers can do if given an opportunity. The humour is rather portuguese so I believe that all portuguese steam users should own this one!",
            "review_score": "1"
        },
        {
            "review_text": "Mediocre detective point&amp;click with some witty banter and an interesting interrogation system.  Sadly very straightforward with little actual challenge and a simple plot. Go everywhere. pick up everything, talk to everyone, case closed.  The game also offers a few 'sidequests', but even the hardest one can be completed in under ten minutes just by paying attention to some dialogue.  Too easy for fans of the genre, too boring for everyone else.",
            "review_score": "-1"
        },
        {
            "review_text": "Really funny point and click! Many surprises and easter eggs to find! Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "The best Portuguese game I've ever played. A charming point and click adventure that makes me proud of sharing a nationality with its creators.",
            "review_score": "1"
        },
        {
            "review_text": "I just had a good feeling about this game by only seeing the screenshots. i decided to buy and it was on of my decisions ever. this game is classic point &amp; click adventure, with a lot of humor and 'bad jokes', but also hidden stuff like bugs which they hid in the game on purpose or just secret rooms/screens. i really enjoyed this game and im hoping for a sequel and then another one and another one and another one. and the music oooh the music. so beautiful.   I recommend this game for everyone who can call himself a fan of adventure and point &amp; click games. but even if your not such a big fan you probably will enjoy this masterpiece. 10/10 would point &amp; click again",
            "review_score": "1"
        },
        {
            "review_text": "This game is entertaining and easy to navigate. It gets a little tricky towards the end but with a little trial and error I figured things out. I haven't finised it because towards the end it started crashing and I didn't feel like starting over at the last save but I bought it on sale and it is cute so I'm not mad.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! It recalls the first graphical adventures from Sierra and Lucasarts. Still it has its own model for interviewing and interaction - actually it is simpler, but quite effective.  I would recommend this game to anyone who likes a good laugh - specially for someone who knows about a specifiic kind of portuguese culture.",
            "review_score": "1"
        },
        {
            "review_text": "Nice point and click game, must buy if you like this kind of games.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "  Im sure if I had the time and patience to sit there and enjoy this game I would, but I cant.  The crowd is something ive never seen before. Nice little touch  3 minutes and I cant bare it. But I know it has potential",
            "review_score": "1"
        }
    ]
}