{
    "app_id": 297490,
    "name": "Spy Chameleon - RGB Agent",
    "release_date": "2014-06-11",
    "developer": [
        "Unfinished Pixel"
    ],
    "publisher": [
        "Unfinished Pixel"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Stealth",
        "Puzzle"
    ],
    "achievements": 30,
    "positive_ratings": 244,
    "negative_ratings": 31,
    "price": 3.99,
    "description": "Spy Chameleon RGB Agent is a challenging arcade-puzzle game where the player needs to avoid being spotted thanks to the color-changing mechanisms of the main character.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/297490/header.jpg?t=1447361595",
    "minimum_requirements": "OS: Windows XP SP2 Processor: 2.6 Ghz single core Memory: 1 GB RAM Graphics: DirectX 9.0 compatibility DirectX: Version 9.0 Storage: 400 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Eat flies, grab ladybugs and spy on people.  What else is there to be said? Get to it!",
            "review_score": "1"
        },
        {
            "review_text": "A simple little game that is suprisingly fun. All about timing, planning, and quick but deliberate movements. I also love the overall 'theme' of the game. Very lighthearted but not to the realm of silliness. For $5, it's a steal, buy it, especially on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Actually a really fun title. If you like puzzles and thinking fast, as well as being stealthy, this is a game for you. I am enjoying it quite a bit.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really interesting. The idea of being able to blend in with certain colored carpets is very cool. This game is really good. I think this game will be a huge hit if people actually get the game. Plus with the price of the game, you have to buy it!",
            "review_score": "1"
        },
        {
            "review_text": "That was a quite refreshing Indie Puzzle game. You can just jump right in and understand it real quick. After you learned the basic patterns of what you can do, there are some intelligent levels that are actually really fun to play. Didn't play it completely but it's a nice game for in between all those bigger games. I can just recommend it. :-)",
            "review_score": "1"
        },
        {
            "review_text": "Spy Chameleon is an incredibly fun action puzzle game wherein you must reach the exit of a level by avoiding vision cones of enemies. It utilises interesting mechanics that I haven't seen in other games, such as the ability to blend into the environment to avoid detection, as a chameleon would do in real life.   Positives",
            "review_score": "1"
        },
        {
            "review_text": "good concept and it's fun, however, not having the ability to change controlls needs to be addressed.",
            "review_score": "1"
        },
        {
            "review_text": "It is a nice game.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun. Easy to play but challenging. Beatufilly finished and clean graphics",
            "review_score": "1"
        },
        {
            "review_text": "Fun stealth puzzle game that keeps it pretty easy to pick up while remaining entertaining and at times challenging. Simple controls (I'd imagine it's a little difficult on keyboard and mouse but the controller is super straightforward- your colored buttons correspond to the color you want to change to) and really great music. Personally I can only do a couple levels at a time before my attention starts to wander but I always find myself coming back to it. Got it in a bundle so I definitely can't complain about the price, but I think $4.99 is fair for what it is. Overall I'd recommend it, it's charming and a fun little time occupier.",
            "review_score": "1"
        },
        {
            "review_text": "Spy Chameleon - RGB Agent is a game that I recommend because: - is a method to banish boredom - it has a good price - it has trading cards - it is indie - it is a good puzzle game  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "A novel twist on stealth gameplay that unfortunately fails to keep you wanting to come back for more. Levels feel more like a chore than fun, perhaps due to the simplicity of the goals and repetative gameplay. Had these gameplay mechanics been used in an advanture-style game I think it would have been a huge success but as it currently stands the game really lacks something to hold the players attention for more than 20 minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent game! Worth it.",
            "review_score": "1"
        },
        {
            "review_text": "If yuo want sleep early but yuo need to play something. You can play this game every night before the sleep. You may enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Can't go wrong with 1 buck!",
            "review_score": "1"
        }
    ]
}