{
    "app_id": 297590,
    "name": "Monsters Ate My Birthday Cake",
    "release_date": "2014-07-01",
    "developer": [
        "SleepNinja Games"
    ],
    "publisher": [
        "Cartoon Network Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Puzzle"
    ],
    "achievements": 16,
    "positive_ratings": 64,
    "negative_ratings": 1,
    "price": 5.59,
    "description": "Warning: This game is crammed full of monsters, cake, amazing powers, puzzly bits, epic adventure, witty repartee, secret paths, unlockable characters, silly hats and a wiener dog. Use caution if you are allergic to fun or overly sensitive to cake-related pathos.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/297590/header.jpg?t=1447361605",
    "minimum_requirements": "OS: Windows XP or later Processor: Core 2 Duo Memory: 2 GB RAM Graphics: DirectX 9.0c compatible graphics card DirectX: Version 9.0c Storage: 600 MB available space Sound Card: Any",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A fantastic puzzler with great music, art, writing, ... (the list goes on). I was a apprehensive with purchasing this as I feared the game may have been too childish, but this is not the case.  The puzzles definitely get fairly complex. I've only played up to the third world so far, and nothing has been all that challenging, but if the pace continues, the fourth world is going to have some wonderfully difficult challenges. Don't expect something to twist your mind like a puzzle from Braid or FEZ might. The puzzles here rely on the teamwork mechanic. You must control up to four different characters, switching between them, one at a time, and orchestrate their movements in order to progress.  The RPG-esque elements add fun content to the game (which could stand on its own without them). There are always sidequests to complete and new ones pop-up frequently, at least once you complete a world. The secrets aren't that well hidden, which is a little frustrating, but some have been tricky enough to make up for it.  The game definitely has a unique charm. The monsters all have quite different personalities and add a nice flavor to the game. The humor just makes me smile.  Don't go into this game expecting be lost on a puzzle for hours, as none of them are THAT difficult. They will make you think in a different way than you're used to, which is what puzzle games really should do, in my opinion.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Cute and fun. It had a good balance between story and puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "This game was everything I expected it to be. It was a nice, short but sweet puzzle game that was super fun and amusing. The game is a bit on the shorter side, myself having completed it 100% in about 12 hours. Though there were harder puzzles near the end, the game's difficulty is not extremely high, leaning more on the casual side. This would be a perfect game for someone who doesn't play puzzle games that much, or for a younger audience. Those are the demographics this game would be best suited for. Though with the visual style and cute little story attached, any puzzle game fan could play this and enjoy it for what it's worth. The game's puzzles were intuitive and fun, making up the majority of the gameplay. There was a mild bit of fetch-questy type quests thrown in here and there as well. I'm aware some people do not care for fetch quests, but I believe they were executed well in this game. The music and atmosphere was very well suited to the game. The songs were not repetitive or annoying but well fitting to the environments, which were also finely crafted. Monsters Ate My Birthday Cake is a fairly funny and wholely heartwarming game that delivers an adorable casual gaming experience.",
            "review_score": "1"
        },
        {
            "review_text": "The game was pretty fun. Some challenging puzzles towards the end but nothing too hard. Some of the references were pretty funny and the humor was witty. I'd give it a 4.5/5. My experience would've been better if the achievements weren't so buggy. You have to quit out of your game and reopen it for them to unlock. I've done everything there is to do in this game and I still have one achievement that hasn't popped. If achievements don't mean much to you, and you enjoy a good puzzle, I'd suggest grabbing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, cute design and hilarious dialogues!  Monsters ate my birthday cake is packed with fluffy, cheeky and loveable monsters. While trying to solve quests, eat cake and save your village you get to know different monsters and their abilities AND you collect fancy monster outfits1!! And the best thing is: IT'S YOUR BIRTHDAY!  PROS: everything but... CONS: ...the closed bakery òó WOULD PLAY AGAIN: 1139/1139 cake crumbs ",
            "review_score": "1"
        }
    ]
}