{
    "app_id": 297760,
    "name": "Qvadriga",
    "release_date": "2014-06-13",
    "developer": [
        "Turnopia"
    ],
    "publisher": [
        "Slitherine Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Racing",
        "Simulation",
        "Sports",
        "Strategy"
    ],
    "tags": [
        "Racing",
        "Simulation",
        "Sports"
    ],
    "achievements": 0,
    "positive_ratings": 215,
    "negative_ratings": 50,
    "price": 14.99,
    "description": "Qvadriga is a tactical game of chariot racing in ancient Roman circuses, where you take control of a four horse chariot team. Choose your preferred upgrade combinations and prove your skills at the arena.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/297760/header.jpg?t=1552913857",
    "minimum_requirements": "OS: Windows XP/Vista/7/8/10 Processor: 1.6 GHz Memory: 2 GB RAM Graphics: DirectX 9.0c compatible video card DirectX: Version 9.0c Storage: 2 GB available space Sound Card: Compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I am kind of surprised about how i enjoyed this game... I took some time to read some of the reviews and all those negative reviews are about the pricing and i personally it shouldn't be mentioned in a review at all especially on steam where the price tag of a game vary very often...  Anyway let's just talk about this game...  I never even thought that it could be possible for me to enjoy a turn based racing strategy game, but the devs from Turnopia proved me wrong...  I actually put more hours on this game that i even expected to and those were quality hours i enjoyed playing this game. The game is kind of difficult since you can't really have a viable strategy that work 100% because there is many factor in consideration, some random events, the probability to hurt your horses so they lose some of their maxmum speed, your chariot can broke and sometime get totally destroyed and the actual skills of the pilot are all things that can influence the game result...  I personally like that kind of game that are challenging and sometime even if you plan all the way a perfect strategy, anything can go wrong from one turn to the other...  There is differents race tracks that change the play style i use, some have more chariots than others and the numbers of oponent can vary from differents race on the same exact track.  You can manage your team and have up to 4 pilots, 4 chariots and 4 pack of horses that can have differents stats that influence the outcome of a race.  The options are quite limited for the management, but it's a simple game with some twist in it that make it fun to play in my opinion. If you want to play an easy game where you can win everytime without much difficulty, then i guess you should avoid this genre since the game can be frustrating some time.  The game can become repetitive after some time, but what game don't get repetitive after spending some time in it anyway?  I recomend this game if you like the turn based slow paced strategy game, there is another mode called dynamic races , that is pretty much the same thing, but more fast paced and can be hard to hit the right button in the right time. There is probablly some people that may like this, but i personally don't so i won't spend too much time on this mode since i did not tested it alot...",
            "review_score": "1"
        },
        {
            "review_text": "Well what a blast of fresh air this is. Worth grabbing the current Humble Bundle for this alone. Get in there!",
            "review_score": "1"
        },
        {
            "review_text": "So, let's get the bad stuff out of the way: This acts like a converted boardgame. The graphics are from the 90s if not late 80s. The game will not hold your hand - if you act stupidly, the game has no issue with punishing you.  That said, this is the best racing game I've played in a very long time.  In Qvadriga you control a team of charioteers (aurigas). You're responsible for selecting them, buying and upgrading horses and chariots, and paying for medical care/repairs when things don't go well. Your sponsor will give you certain advantages: Perhaps your aurigas are tougher than average, or your horses faster.  Once you've taken care of maintenance and the like, it's time to race. Simply put it's three times (usually) around an oval track, with rewards for finishing first, second, third, or even simply finishing.  The commands are intuitive enough once you've played a few games: You can accelerate by shaking the reins, whip the horses (which might hurt them and lower their overall speed), pull back on the reins, change lanes, whip to the left or right to try and injure enemy drivers and horses, or ram your cart left and right for the same reason. Action by default is turn based. There is an option where the turns run together, simulating an RTS, but I feel it's not worth it.  Since the commands are simple enough you can focus on strategy. Whipping the horses is a great way to surge past the enemy ... but if you hurt them too badly it'll hurt their base speed and you'll be paying for a vet later. Sometimes beating the crap out of your enemy is the answer, but that tends to slow you down. Do you take the turns at full speed and hope you don't crack a wheel? Or do you focus on stabilizing your chariot or even slowing down to make sure everything you make it? Having your chariot shatter under you and being dragged is no fun. Letting go of the reins and getting run over by an opponent is even worse.  Strategies are affected by random events. For example in a recent race my auriga was so mad at the world 'he' decided that accelerating by shaking the reins wasn't an open, and if I wanted to win I'd have to rely on the whip much more than I like. In another event drunken spectators thought throwing trash on the outer lane of the track was great fun and several drivers got hit in the head.  Don't let the graphics scare you off. This is an intuitive racing game with good strategic potential. Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Got it in a Humble Bundle for $1 with 4 other games, very good deal.  I can certainly understand the complaint about the price, it is VERY expensive and would barely be reasonable at $9.99, but after you whip another racer till he explodes in a shower of red and then whip his horses until one of those also explodes into a fountain of gore it's pretty damn satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe not worth the full price but its good fun really !",
            "review_score": "1"
        },
        {
            "review_text": "I recieved this game in a Humble Bundle awhile back and unfortunately overlooked it. After recently giving it a shot, I have found myself a little suprised.  Qvadriga is a turned based chariot racing game where you use your mouse to select what you want your driver to do each turn. There is a campaign mode, where you manage a team of chariots, and a simple, single race mode. In campaign mode, you can upgrade your drivers, buy them new horses/chariots, and travel to a number of different arenas.  This game can be rough getting into with it's archaic menus and lack of a proper tutorial. I found myself really frusterated after my first couple races and almost uninstalled. It is a game that really requires a bit of patience and the will to learn through trial and error. Once you get over the learning curve and start figuring out how to tackle each course, it becomes quite enjoyable.  While I would recommend this game, I don't think it is worth it's 19.99$ pricetag. $7.50~ seems a little more reasonable to me.",
            "review_score": "1"
        },
        {
            "review_text": "With it's combination of real time and turn based control, Qvadriga is a racing game that's both tense and tactical.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great little game! There is a lot of strategy involved. The learning curve is pretty steep, but as you get the hang of it, you really get sucked in. Usually set backs are not game breaking. On my first play through, I lost my drivers and chariots quickly, and could not recover, but only because I didn't know what I was doing. I went back, looked over the tutorial, started a new game, was more careful this time, and I've been having a great campaign. I've had my set backs still, but always have recovered from them and surged to new levels despite them. A word to the wise: don't imagine this is a game you can easily win on your first race. You will have to work hard for each victory. But they are all the more rewarding when they come.  You will also quickly develop rivalries with other teams' charioteers (called auriga in the game). Currently, I've got a very heated rivalry going with a fellow named Alpheaus. After he took out two of my horses and almost killed an auriga at the very start of a race, I've had it out for him ever since. And he likes gunning for me, too. Makes the races very interesting when he's around.  In response to critics who say there are only two types of track: first of all, each type has many variations within. Some are longer, some are shorter, some are wider, some are thinner. No two tracks are exactly the same, and each one has unique strategies required to be successful. Second, in ancient Rome this is exactly how it was. Two types of track (Greek style and Roman style), but with variations all over the place. Each race also will have a random event at the start, sometimes good, sometimes bad, to add to the variation. There's also different combinations of auriga skills, chariot types, and horse quality.  In total, this is a great game. I think it is worth $20. But if you can pick it up on sale, that's always good, too. I give it a 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Qvadriga is a fun simple and yet surprisingly deep top down strategy racing game. If you've ever played the board game Formula D you'll instantly see some similarties but enough diversity to be its own thing. At first it may seem like a luck based game but the more you play and develop your play style the more you see skill plays a factor in 90% of things. Random events keep the game fresh and new and not as repetitive and its just all around polished decently.  My only complaints are that $19.99 for this game is asking for more than the game is worth because if you dont like it after your first 20-40 minutes you wont like it at all. Also this thing is BEGGING for a multiplayer component which would make the game much much more replayable.  To sum it up short: Great game, lot of fun, probably too high a price for how simple the game is and MULTIPLAYER PLEASE.",
            "review_score": "1"
        },
        {
            "review_text": "If you grew up playing Avalon Hill's Circus Maximus, like I did, you want this.",
            "review_score": "1"
        },
        {
            "review_text": "Feels like a boardgame more than a video game... and thats good by my preferences. But oh, there can be some rage-quit times to be had with this one. It's a great racing game and if you like Ben-Hur (the movie) then this is Ben-Hur with all the boring parts cut out of it.  You can feel like you have the best team, and suddenly you can be wiped out with some bad 'luck?' (try 3 chariot spills in a row with 2 deaths) The AI can hemm you in and make things difficult, I once was full in the lead when a chariot in last place pulled an nasty cut-off as I was about to lap him... so nasty that it hemmed me as everyone else flew past making me lose the race (as far as winning money). I don't think anything more could have been added to make this any better, the graphics are fine, 3D would have been ok but not really important. A lot of your own imagination takes up the slack. I like the random pregame events that add extra interesting situations in the race. There is city travel as you get better, going to better events... but make sure you dominate your current city before making a trip, it's more competitive out there. I'll be playing this a lot. Multiplayer would be awesome tho...",
            "review_score": "1"
        },
        {
            "review_text": "Football manager meets Ben-Hur.  I fell out of my chariot and got trampled to death.   11/10 would die horribly for the enterainment of others again.",
            "review_score": "1"
        },
        {
            "review_text": "A really interesting, original strategy game - but not worth the price tag.  Turn based Roman chariot racing - good original subject. And a really nice, simple mechanic, easy to understand, quick to get into, but really intriguing to play. That sounds great, right? Well, it is. The apparent simplicity of chariots trundling around the track actually creates a really interesting set of challenges, where the positions of chariots around you mean you have to carefully consider every turn, with different races unfolding to reward different tactics. It's like a really, really good board game.  Except...  The graphics are super-simple, 2d. That isn't a problem, but it feels more like a five dollar mobile game.  The individual races are interesting, but there is no sense of story or progression, no apparent end-game, no rivalries to develop with other teams, and little ability to develop your drivers. Further, there is no Hall of Fame where you can compare your drivers' achievements nor mourn for those who have died. And all of that is a shame.  Also, there is no multiplayer. Given that this plays like a boardgame - like the sort of thing you'd want to get out for half an hour to play with your friends around the coffee/dining table - it's a real shame that there is no internet multiplayer option (nor any other multiplayer).  So, if you're interested in an unusual little strategy game - one that you can keep coming back to and dipping into for an engaging coffee-break distraction - then this is absolutely worth having. But it's hard to justify much more than $5 for it.  Recommendation: add to wishlist; wait for it to be reduced.",
            "review_score": "1"
        },
        {
            "review_text": "Good idea and well researched with pretty good mechanics. That being said, the content, variety, UI, polish are totally at odds with the ridiculous price. ATM it's $22 and that's nearly criminal as it should be around the $5 mark. So while I would normally recommend this for its unique and interesting take on a rarely covered genre, I can't at its current price.",
            "review_score": "-1"
        },
        {
            "review_text": "This has got to be one of the most half-♥♥♥♥♥ boardgame ports of all time.   This is pretty much exactly the game 'Circus Maximus', but the interface is garbage, there's no multiplayer support of any kind, and the game is less polished than most game jam games.  Here's how much the devs cared: You can go back to the main menu in the middle of a race if it's going badly for you, and there are no repercussions. You can go back to the main menu from the management screen, then back, to re-roll the products in the market until you get what you want. The savegame is stored in the installation directory. Changing the resolution will always re-enable fullscreen. You can't turn off the music, you can only mute the sound. It will sometimes turn itself back on when you change screens.  The graphics are functional but very ugly. The 'how to play' is multiple pages of walls of text that makes the game seem considerably more complicated than it really is. And the font is blurry.  The actual game here is excellent. It's very, very fun. I highly recommend playing this game, but don't buy Qvadriga. Play the boardgame, play the DOS game from 1984 that has multiplayer support, but whatever you do, don't give Slitherine money for making off with someone else's game and half assing it.  I desperately want somebody to port this boardgame, but to do it properly. This is just a waste.",
            "review_score": "-1"
        }
    ]
}