{
    "app_id": 298220,
    "name": "Terraformer Expedition to Mars",
    "release_date": "2015-11-20",
    "developer": [
        "Vermont Software Studios,LLC"
    ],
    "publisher": [
        "Vermont Software Studios,LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Indie",
        "Space"
    ],
    "achievements": 0,
    "positive_ratings": 15,
    "negative_ratings": 23,
    "price": 18.99,
    "description": "Earth is dying. In a desperate effort to save humanity, all the nations of Earth pool their dwindling resources together one last time to construct and equip three space ships. The mission: Terraform Mars and pave the way for human settlement of the planet.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/298220/header.jpg?t=1448061044",
    "minimum_requirements": "OS: Windows XP, Vista, Windows 7 Processor: 2 GHz Single Core Memory: 4 GB RAM Graphics: DirectX 9.0 compatible, 256 MB (Shader Model 2.0 required) DirectX: Version 9.0c Storage: 4 GB available space Sound Card: Yes",
    "recommended_requirements": "OS: Windows XP, Vista, Windows 7 Processor: AMD Athlon 64 X2 5200+ Dual Core 2.60 GHz, Intel Core 2 Duo E6420 Dual Core 2.13 GHz Memory: 8 GB RAM Graphics: NVIDIA GeForce 8800 GT 1024MB graphics card or better, ATI Radeon HD 4830 10242MB graphics card or better DirectX: Version 9.0c Storage: 12 GB available space Sound Card: Yes",
    "reviews": [
        {
            "review_text": "tl;dr: Game is completely broken and bugged, no QA been done at all. Graphics are horrid, pricing is completely inpurportunate =====  I got this game as a gift a few years ago when it was still in early access.  Back then I tried playing but the game was incredibly unstable and buggy. A few weeks ago I tried again but little has changed, the entire tutorial is still the same, buggy and crashed the game in the end.  Graphics are way below any standard, so are the sound effects. Gameplay looks like it has the elements to be there and to be a game in it's own right. I'm not here to insult the developer, I'm sure there has been a lot of work and learning here but this doesn't mean the product of that can be excused for what there has been put down here.  -Stability is the number one issue here, crashes galore and bugs for more. -Menus are clunky and UI/X has not been iterated up on since early early access. -Graphics got a call from 1998 and it was laughing, models and textures both really lacking any quality, let alone animations, a lot of actions even lack animations. -I'm sorry if you like survival, terraforming or mars, there are better games out there more decently priced for their performance. -Price does not match quality what so ever, I don't have the hours to know all the content at all. But the instability, bugs and problems surely ruin the experience to even try.   Sorry can't even rate this game out of 10. Without any improvement of a working product it's 0.",
            "review_score": "-1"
        },
        {
            "review_text": "Considering this game was released in 2013 and I have had to for two years with no updates Id naturally assume the dev took the money and abandoned this game. Therefore Id say dont waste your money. It is buggy and crashes ad least 2 times every hour and considering my PC can run the witcher 3 max graphics on 4k with 60fps id say its deffinatly the game.  The graphic quality is on par with minecraft, A.K.A ♥♥♥♥. The game itself is slow and does not flow. The conscept is ♥♥♥♥ing fantastic however due to the lack of a proper developer and a decent engine the gane turned to ♥♥♥♥.  Someone PLS make a game like this I want this concept to become a reality and not just a money grab like this lump of ♥♥♥♥.  simplely put, dont buy this game unless you want to waste your money.",
            "review_score": "-1"
        }
    ]
}