{
    "app_id": 298260,
    "name": "Only If",
    "release_date": "2014-07-25",
    "developer": [
        "Creability"
    ],
    "publisher": [
        "Creability"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Adventure",
        "First-Person"
    ],
    "achievements": 10,
    "positive_ratings": 3752,
    "negative_ratings": 2137,
    "price": 0.0,
    "description": "Only If is a surreal first person adventure-puzzle game. You play as Anthony Clyde, who, after a heavy night of partying, wakes up to find himself in an unfamiliar bed with no memory of the previous night's events.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/298260/header.jpg?t=1455028983",
    "minimum_requirements": "OS: Windows XP (SP2 or higher), Vista, 7, or 8 Processor: Dual Core CPU @ 2.2 GHz Memory: 2 GB RAM Graphics: Nvidia GeForce 8800 GT / ATI Radeon HD 4770 DirectX: Version 9.0c Storage: 1 GB available space Sound Card: DirectX 9.0c compatible",
    "recommended_requirements": "OS: Windows 7 or 8 Processor: Dual Core CPU @ 2.4 GHz Memory: 3 GB RAM Graphics: Nvidia GeForce GTX 280 / ATI Radeon HD 5830 Storage: 2 GB available space Sound Card: DirectX 9.0c compatible",
    "reviews": [
        {
            "review_text": "So after playing this game for quite some time and giving it a chance by finishing it i got 2 conclusions:  1) The reviewers giving it a bad review don't have a clue what they're talking about and they don't care about the genre of the game. Probably teenagers or people hating adventure/indie games.  2) This is a great game in all aspects. I agree it's getting a little frustrating at times and it that it has its bugs, but hey, which adventure game didn't have these things? You have to keep in mind that this is a free game (surprisingly), and it gives you the chance to spend some hours gaming happily (if you like the genre).   This game is a hybrid of adventure/indie/mystery games. And the voice acting is awesome despite the bad comments i've been seeing around. Reminds me a bit of myst combined with the craziness of stanley parable.  I strongly suggest this game if you 're into mystery/atmospheric games and like playing through a story.  ---UPDATE---- I'm sorry if I offended a general group of people, certainly wasn't aiming for that. About the teenagers part, i said 'probably' and what I was trying to say is that a big percent of the teenagers can't appreciate this game properly, hence the bad reviews about things in this game i found prety interesting and amazing. I never said this game is perfect or doesnt have problems, i just recommended it and found the devs work really good for a free indie game.  About the incoherent jumbled mess of the story,I just love how abstract this game is, it draws you in and u have to think on your own what the hell is going on, just like reading a well-written book.  In the forums you can find alot of very logical and good explanations regarding the story, that make sense.",
            "review_score": "1"
        },
        {
            "review_text": "For free you could definitely do worse. The message is pretty cool and it also has some interesting mechanics and good/bad design. It helped me think about how to design videogames to accomplish goals and convey things to the player as well as different mechanical ideas.",
            "review_score": "1"
        },
        {
            "review_text": "  Only If there was a Review...",
            "review_score": "1"
        },
        {
            "review_text": "'Avoid, If at all possible.' The words of Douglas Adams are to be headed here. This game disregards all standards of gameplay and player psychology, and punishes the player for not being able to read the creator's mind. You will find yourself unable to complete a section over and over again. Not because you are bad at the game, but because the game never taught you any basic mechanics.  Do NOT be fooled. This is NOT a puzzle game. There are no puzzles here.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm gonna be honest, a few levels are utter trash. The movement is pretty bad. But the ending. Dear god the ending.  That was amazing. You have to suffer a bunch of it, and some of the riddles are vague. But you know what. The ending is great. Like I was satisfied that that was the ending. And I am a cynical bitter sadistic ♥♥♥♥♥♥♥ who hates everything.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics and voice acting are great. Puzzles are mostly amusing, but irritating at times. Can't say much about the story itself but it is an interesting game to play through at least once.",
            "review_score": "1"
        },
        {
            "review_text": "This game is basically a forum troll in game form: something terrible and without merit that is trying to get attention it doesn't deserve.  The game: The controls are terrible and later in the game they introduce platforming that you have to get through to proceed, using those same atrocious controls. Imagine precision jumping on tiny platforms, in floaty 3D environments, with sloppy tank controls. Also you can't see your feet, or your shadow. Every landing is a guess, and sometimes platforms just drop you anyway if you're too close to the edge.  The narrator: The on again/off again narrator is verbally abusive throughout, offers no insight, and is just annoying every time he chimes in. He's basically just there to threaten to kill you if you don't play along. That's it. No wit, no humor, no insight, no point.  Level design: The levels don't take the game's own setting into account and the level design just devolves and gets lazier the further you go, and the 'twist' at the end reveals that you never left reality, so those 'lazy dream world' levels make no sense.   The plot: The entire story, if one can call it that, is just an immature and juvenile mess. It is revealed in its entirety at the end of the game, in the visually deprived ending sequence. By this I don't mean you are lead down a trail of hints to piece everything together at the end. No, you are just lead through levels at literal gun point and told the story ONLY when you reach the end of the game. And it's not worth the effort. It's sloppy writing the likes of a 15 year old trying to be edgy would write. You're just some dude and your girlfriend's step father kidnaps you, puts you through hell(somehow), all because apparently, you and your girlfriend are blood relatives... He kidnapped someone, held them captive against their will, threatened their lives (and murder them if you take into account the fact he kills you if you fail any of the badly laid out task he throws at you, some of which are entirely based on GUESSING.) and his reason is 'I didn't want you to have sex with your sister'... then how about just telling him they are related? In fact, she girl chimes in and says she just found out and was going to tell you, but her step dad kidnapped you first.   What was even the point.",
            "review_score": "-1"
        },
        {
            "review_text": "Only If I wasn't so ♥♥♥♥♥♥♥ curious to see what this game was.  'Only If', a first person adventure game. I really don't know what add to this. I guess they tried to make a game like 'Stanley Parable' or 'Gone Home': you walk around, solving 'puzzles' and understanding more and more the plot. What's the problem here? The plot. I couldn't understand a thing, maybe I got 10% of all this. I have no idea of what they planned to make us think, but.. look, I seriously have nothing to work with here.  You are some guy who goes to a party, and after something happens (apparently they're not good enough to create a party scene) you find yourself in a bedroom. You wake up, and some weird black fog, maybe the same one from Lost, makes you faint again. After a while you meet this not-so-friendly voice from a radio, that will escort you through the game.  Already after 5 minutes into the game, I saw some major problems: the voice acting was one. I can clearly hear that they were trying pretty hard to make it look like a normal converstation. I admit it, sometimes it kinda worked, but for most of it, it was.. odd. Expecially 'cause the guy from the radio haves this stereotypical black man voice, even tho' probably the voice actor wasn't even a black man (I can't prove it). Another problem were the puzzles: apparently this game haves some kind of puzzles. What's the problem with them? You don't even know where to start. Sometimes they don't even give you a clue, sometimes they throw you random information that you can't use. I had to look up through a walkthrough bunch of time to understand what was goin on.  After a very little while, you have to choose what pawn to pick from a chessboard: white or black. From what you choose, you'll get a totally different ending, but also a different 'game'.  The white pawn was.. I dunno. Enjoyable, I guess? It was weird, still kinda bad, and had no explanation, but for some weird reason, I enjoyed it. Maybe because the gameplay was still the same one from the intro, easy and weird at the same time. I found myself doing the most weird things during this gameplay. I won't spoil them, but man, that was odd. But you know what? I felt like I was watching one of those B movies. You know the one, the movie that is so terribly written, with horrible acting and impractical montage. The one that you know it's terrible, but you have to finish it, because you're actually enjoying it. Same goes for the final of this: weird, totally not self-explaining and almost made no sense. I was kinda happy with it.  Then I played the black pawn ending. By god, why did I had to. I actually didn't even finished it because ITS ♥♥♥♥ING IMPOSSIBLE. I'm not joking around, the game suddently turns from goofy random puzzles to survival 'horror'. Is like Amnesia, but bad. Really, really bad. And impossible. Expecially 'cause there is a straight line to follow, but guess what, there is NOTHING THAT EXPLAINS YOU WHERE TO GO. And if you don't follow the line? Game over man, start from last checkpoint, that maybe is really far away from where you was. I couldn't finish that ending cause even the playthought was so clueless that didn't gave me any sign of what the hell to do next. I gave up.  The graphic is pretty good, even thought some texture looks really horrible. Well, it is Unity. And the soundtrack is almost absent, probably some songs got from youtube users.   So, what do we get in the end? A free game on Steam that makes no sense, it's badly written and gives no lession whatsoever. But I enjoyed my time with it.  Final Score: a Pot/10  TL;DR  Is it bad? Kinda. Should I play this? Yes. But just don't pick the black pawn.  PS: ACHIEVEMENT MEMAS LOOOOL :-) please crawl back into your hole.",
            "review_score": "1"
        },
        {
            "review_text": "+ Fantastic visuals + Funny, quality voice-acting + Some of the puzzles actually become quite difficult  - Like others, I had a bug or two with the achievements, but they seem to be working properly now - Very short",
            "review_score": "1"
        },
        {
            "review_text": "This game has had my most favourite ending achievement yet",
            "review_score": "1"
        },
        {
            "review_text": "How a puzzle works: A goal is outlined or suggested and either the tools are provided for you to utilise to reach the goal, or you are left to discover the tools for yourself in order to reach the goal.  'Only If' doesn't provide you with a goal or direction of any kind and just plonks you down in a burning field while making you hammer E every 5 seconds, then resets you back to a point because you've apparently gone the wrong way when the game hasn't given you any suggestion at all where or why you're supposed to be going.  This game is a waste of life, go play Minesweeper or Sudoku or Mahjong or literally any other game in existence.",
            "review_score": "-1"
        },
        {
            "review_text": "The game has some very awesome and surreal enviroments. That's about all I can recommend for it.  The character you play as, Anthony, has horrible dialogue and a terrible voice actor that brings you out of the experience. The jumping and collision mechanics will anger even the most patient gamer. And don't play this game if you get motion sickness at all.  Maybe worth a shot since it's Free to Play, but don't go out of your way to finish the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Reluctant thumbs up on this strange indie studio entry. Another reviewer mentioned that this game had some influences from The Stanley Parable, and I think that's the closest experience that players can find to this game. The difference for Only If is that the puzzles, such as they are, are a bit more rudimentary, or unpolished. Many solutions are hidden from the player until they explore their environment fully (sometimes even using disappearing objects or disappearing walls to do the job)  One scene in particular has the player pressing E repeatedly to keep from blacking out or falling into 'darkness'. But the player isn't given any instructions other than that. So I spent at least 10 tries of trying to explore my environment (as the game encouraged me to do all along) and ending up running head first into a blackout. Eventually I saw that spamming the button and running straight through one particular part seemed to be the only way to succeed at the scene. I'm glad I stuck with the game, because it has some stylish scenes and setpieces, but the frustration was close to souring the whole thing for me.  Story wise, the game tries for a very young, hip aesthetic, with snarky comments from the game's antagonist intended to make the player laugh as they're given ambiguous or frustrating instructions. After a couple of full playthroughs, I was honestly exhausted from all the wisecracks and reloads that the game threw at me, and glad it was finally over. But I enjoyed the genuine surprises the game threw at me as well, so I found it was worth playing, especially since I didn't have to pay for it.",
            "review_score": "1"
        },
        {
            "review_text": "This game  Its a great story!  When i played this i was really into it i enjoyed playing every part  Great graps I recommend you play it! Its free!",
            "review_score": "1"
        },
        {
            "review_text": "This is a Free game on Steam and considering that .I really dont understand all the negativety.The graphics are stunning the storyline bizarre and off the wall.If you like adventure games with puzzles that make no sense and a storyline that will keep you scratching your head like 'what was that all about'? This is a must. Again its free.... why? I have have no idea! Im confused about that also! Some achievements are broken and you may have to try them 2 -3 times or leave the game and do them over. How can anyone not give this game a thumbs up. THANK YOU ! team Creability for letting me play your game.",
            "review_score": "1"
        },
        {
            "review_text": "If you think Bioshock Infinite is the peak of pretentious hipsteric crap, you haven't seen Only If. Jesus Christ, my brain melted listening to this ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic game! Fun puzzles, Funny gags, and a hilarious ending. Anyone who is looking for a fun puzzle game, this is definitely worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit, this was a unexpected experience. o.O if you haven't played this yet. what are you waiting for. This game was really amazing. Puzzles might get a bit confusing but in the end it was awesome. 10/10 lol",
            "review_score": "1"
        },
        {
            "review_text": "It was a intesting game with mind bending puzzles, heart-stopping suspense, and surprises that leave you confounded! It's a little bit of an exaggeration, but nonetheless, it was an amazing game!   There were problems with impossible answers that you seemed to stumble through but left you feeling like a genius after completing them. The ending wasn't the best but as they say, it's not the destination, it's the journey. I would definitely reccomend this game to, well, anyone (Except for young children, the dialogue was definately not the cleanest).",
            "review_score": "1"
        },
        {
            "review_text": "great game, small but beatufiul",
            "review_score": "1"
        },
        {
            "review_text": "I haven't gotten to the end yet, so I'm not sure if the ending is worth a change in my review. I'll edit this review when I get to the end, but for now I have to comment on this title's bizarre gameplay.  Other negative reviewers have basically taken the words out of my mouth... It's certainly not an intuitive game, it's difficult to manuever in and more times than not, it is frustrating instead of enjoyable. Trust me, I really tried to like this game. I would tell myself that the fun was in the exploration, and to an extent, it is. This game is gorgeous. If you accepted the notion that you weren't going to have much success in completing the tasks, you could enjoy it. But one can only do that for so long and for all this game's faults, it's very suspenseful, and you'll be frustrated by your lack of progression. I've played a number of games where the game leaves very cryptic clues and you have to figure out what to do next. If you don't like these games, you'll absolutely hate this one, because it's even more cryptic than most. The clues disappear   (such as in the room with the bowl you drink from, the paintings turn into verbal clues, but only for a few seconds)   or sometimes leave you searching for a long time, or perhaps if you don't follow the directions exactly so, you'll misstep and lose your direction entirely. I barely had the patience for it, and I was interested in the storyline! If the storyline seems too pretentious or you just don't care for it, you won't enjoy this game.  Pros: -Beautiful graphics -Suspenseful/compelling story -Sometimes makes you think (a little)  Cons: -Jittery camera -Cryptic clues -Excessive/nonsensical swearing (And I love to ♥♥♥♥ing swear!) -Weird audio effects (hint: don't be too far from the radio or you won't be able to hear it anymore) -Achievements don't work   Basically, if you like pretty graphics or maybe want to think a little out of the box, this game might be good for you. But there are other games that can accomplish this without being so broken. Instead, how about watching a decent walkthrough?",
            "review_score": "-1"
        },
        {
            "review_text": "a little weird but good voice acting and exciting game",
            "review_score": "1"
        },
        {
            "review_text": "Sooo frustrationg game, it has an interresting idea, but the execution and the gameplay the design is very poor, making playing it frustrating rather than rewarding.",
            "review_score": "-1"
        },
        {
            "review_text": "i have no idea what i just played but it's amazing i'm recomending this to all my friends",
            "review_score": "1"
        },
        {
            "review_text": "Don't play unless you have enough drugs to understand what's going on.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Only if I knew where to start abou tthis game?   Well, To say the least this game is Charming, Funny, and Dark at times. This games puts us in a very convincing dream world with well calculated puzzles for you to solve. The puzzles aren't frustrating in the least bit, however, they are interesting enough to keep you etetained and invested. That said, this game can stand beside some of the best puzzle adveture games out there i.e. MYST. Give this game a try it's free and see for your self that this game is a well writtend/built indie master piece.",
            "review_score": "1"
        },
        {
            "review_text": "This game has it's fair share of thinking that they play on you. The game in itself brings a lot of crazy parts where you are puzzled and have to follow what this voice tells you. You find dialogue and some interesting conversations. As you traverse through it, you can find hidden easter eggs left there which are catching. However as for the matter of how hard the game can be on some parts, it's literally overbearing and to be honest, not that bad. I find that the annyoing part here is not too much action but this game has it's nice metaphors and analogies to play on here. Play this if you got time to spend. It's a mixed review for me because I found some interesting parts here. a 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "Worth a play-through.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, weird in some places, very weird in others. Yes there is a set path to follow and that may not be for everyone but it's free to play so take a look. There's some genuinely confusing and funny moments as well as some terror thrown in with a really weird plot twist!....",
            "review_score": "1"
        },
        {
            "review_text": "Very Good. I really enjoyed this game, i found it quite amusing at some parts and difficult at others but I was a good balance. I would recomend this game to anyone who is bored and needs a good fix of entertainment. I dont know how long the game is but I was playing for 20 mins and I seemed a great game cant wait for the ending. I also love the design of the game. Even running on the fast settings (wich I have to because of my old pc, but it runs fine) It still looks great. Good job. And best of all. ITS FREE !!",
            "review_score": "1"
        },
        {
            "review_text": "After playing through this once myself and watching my gf play im still left saying 'DAFUQ!?' Very out of the box little romp through scenerios that leave you questioning what the hell really just happened there? Voice-over was hilarious too...",
            "review_score": "1"
        },
        {
            "review_text": "Its really good, and i love the detail in all the environment, the only problem i have with it is all the swearing, a little exesive. but still a good game though! :)",
            "review_score": "1"
        },
        {
            "review_text": "the game is buggy and the camera movement made me nauseous ,  but they said n­igga and fa­ggot so It's okay",
            "review_score": "1"
        },
        {
            "review_text": "Kinda fun but is not scary unless you are scared of your own shadow Vinny is funny to be honest, I do enjoy his conversation  However, I hate that you cannot pause the game properly, it will run in the background. You cannot skip anything, no intro skips, no skipping the talk so you are forced to sit through it. Specially annoying for achievement hunters due to they are not working properly and can take up to 3 tries to actually unlock -_-  You often need to reload your game and verify your files over and over again for achievements to work &amp; even then it can fail to verify your files.  The game also often loves to lock my cursor and other things running such as the Steam over-lay or Chrome to where I need to force Task Manager up.  Some actions need you to be perfect otherwise have fun restarting over and over again in hopes you get it right.",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game.   Even though that i ragequitted 24 times in just one map in this game, it still really good.   The voice acting, the graphics and the way that they tell you the story of the game is amazing.   I'm also surprised that this game is free too.",
            "review_score": "1"
        },
        {
            "review_text": "A game where you wake up after a party, you're a bit messed up, and there is an unseen person that talks to you and seems to be in control of the house; bad things happen; involves a mix of paranormal and plain serial-killer pupeteer stuff going on. You try to solve puzzles, riddles, and find things in the environment to get you to the next 'level', and ocasionally run away and hide from danger. It would be interesting, if it worked.   Here are some complaints:  I checked the controls before playing (it got that Unity configuration screen on launch), but the game kept throwing new ones at me as I played.  Voices are often too low and mumbly; but if I turn the volume up to be able to hear them, there some sounds that are too loud, and I still can't make what is being said some times.  It is glitchy, but not in the artsy sense; I kept getting stuck in some places, it was too easilly to accidentally get outside some the areas that the game expected me to remain inside and hard to find my way back to where the scritpted events would get trigger to move the game onwards; in some places there was not enough feedback on whether I was doing the right thing and but the game was simply too hard to get right or if I was actually stumbling on a glitch of the game (but after trying many different alternatives, in at least one case I realized it was not my fault; later I stopped playing after reaching a point where I don't know if I'm wasting my time bashing my head against a glitch or if I've just not figured out how to make the puzzle work yet).   Ocasional fast repetitive key-pressing; I almost couldn't get past certain spots because it required the same keys to be pressed over and over again extremely fast.   Password based 'saving'; you need to memorize (and in some cases guess first) the level name you wanna come back to if you don't wanna start from the very beginning. Dying while playing just brings you back to an earlier point most of the time; but you ocasionally have to endure an first-person cutscene everytime at certain points.   If you don't mind all these issues, then yes, I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game.   Even though that i ragequitted 24 times in just one map in this game, it still really good.   The voice acting, the graphics and the way that they tell you the story of the game is amazing.   I'm also surprised that this game is free too.",
            "review_score": "1"
        },
        {
            "review_text": "Love it or Hate it &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Feels like a student project, probably is? Game is pretty short and very meidocre. Only thing going for it is the weird atmosphere and the story is kinda funny. The ending was great but i'm not convinced it's worth the time investment it takes to beat this game. I'd recommend it cautiously because it's free and if you've got nothing better to do for a few hrs why not? Just don't expect anything to impress you in this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game ho ho this game. This game here is a perfect simulator of monotonous clunky gameplay. From unavoidable stabbing incidents to incredibly poor conveyance and structure all the way to never ending (unskipable) cutscenes. The game either gives you absolutely no clue as to what you are supposed to be doing, or beats you over the head with 'cryptic' clues, which essentially amount to 'do this dummy.' And it is neverending.   The thing has a grand total of like six button controls wasd and m1+2 add in pause menu and were all good here. The only character who's voice can be tolerated for more than a few seconds is Andrew's but he never shuts up! Seriously, from his point of view he's been kidnapped and he constantly makes decisions to his apparently malevolent all powerful omnipresent kidnapper that no sane person would ever make.  And the cutscenes, dear god the cutscenes. Each and every one of them is long and boring and essentially pointless. They don't further any story and provide loosely contrived reasons for anything that's going on. And you cannot skip them. You have to watch them every time you die SO BUCKLE UP! You are going to die a lot. And oh ho ho do I mean a lot, hoo boy. So get used to those cutscenes. ANd no there's no checkpoints per level, what do you expect? Actual gamedesign? Even if you know where something is from having died before (or having to restart the entire game to pick the new path) you have to sit through the entire thing. Over and over again. And you die. Rinse Wash and you get the picture.  There is one level with a checkpoint ONE!!! and no if you quit and type in the level name you don't start at that checkpoint either. And it starts you in the middle of a parkour section with completely out of the blue and yu will accidentaly jump off. The shooting mechanics in this portion are also shotty if that at best until the targets become so big that you'd have to look the other way to miss. Again 'do this dummy.'  No I do not reccomend this game. I only spent two hours on the thing anad it's free, and somehow I still feel like I've been cheated. I want my money back on this purchase and I spent nothing on it.   Overall I'd say it's a waste of hardrive space.",
            "review_score": "-1"
        },
        {
            "review_text": "It's fun, funny, and free. There's literally no reason to at least TRY this game. The puzzles are a little tough, but they're interesting enough. There's some pretty unique mechanics in here that I haven't really seen done before. It's short, and as a result I can't think of a single time where a puzzle is repeated (except once, but you can't really call it much of a puzzle and it's for the story) so I'd say it's pretty good value for the 0 dollars you've spent. There's also some anime pictures. I don't know why. Doesn't that infringe on copyright? I guess it might not matter since they aren't profiting off it, so eh, whatever. I look forward to any other games made by these guys.",
            "review_score": "1"
        },
        {
            "review_text": "An extraordinary game. Going into this game I expected something very, very different. Boy was I wrong, this game caught me by a huge surprise on the story and puzzles. It was extremely difficult, but that brought out my creative side. Graphics are amazing, story is amazing, and voice is supurb. Overall; 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Surprisngly awesome. Probably the best free game I've ever played. Me and my girlfriend just had a laugh playing this together for the past hour.",
            "review_score": "1"
        },
        {
            "review_text": "This game will confuse you, puzzles are pretty good and it's free. Play it, it's worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "I'm really sorry, I try to be supportive of free-to-play games and indie developers, but I really didn't enjoy this game. The description sounded right up my alley, but the execution has done nothing for me. I love puzzle and exploration games, but I found this game to be completely unintuitive, and even after looking up how to progress I still just simply didn't find the gameplay itself fun. It also completely lacks a pause button, or if it does have one I never found it. Considering that a lot of sequences in the game are timed, this seems like a critical oversight. I also feel like this game is a lot more cut scene than it is game, and I end up just sitting around drumming my fingers a lot. I may come back to this game some other time for another shot, but at least as of now, it's left a very bad taste in my mouth.",
            "review_score": "-1"
        },
        {
            "review_text": "Very beautiful game. I absolutely reccomend people to play this. Yes, the puzzles can be annoying sometimes but at the end of all of them it's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR Myst like ambience, Stanley Parable gameplay, Amnesia based action.  A class of whiskey and this game: perfect way to spend your evening.  The people that say this game is too hard and there aren't any clues are pretty dumb. The perfect amount of mystery without giving everything away. Granted, I do love the Myst series so I'm prone to enjoy picking up details and taking the time to solve a puzzle. Speaking of, there are some great Myst like ambiences in this game, mixed with the gameplay of The Stanley Parable with the action orientation of Amnesia.   Thought they killed it.",
            "review_score": "1"
        },
        {
            "review_text": "I dont feel like I can shoot this down too much since it was free, but the only thing i liked about this game were the graphics and i dont consider those too important in a game. Managed to play for 1 and a half hours with difficulty since i was so bored for most of it.   ",
            "review_score": "-1"
        },
        {
            "review_text": "the only game where i liked being yelled at constantly",
            "review_score": "1"
        },
        {
            "review_text": "The game really wasn't that bad but the fact that after two years the bug of achievement being unacheivable is still not fixed is beyond annoying. You CAN NOT get half the achievements, for example I've finished the 'white pawn' part of the story three times and still have not gotten this achievement.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting concept and execution, but the wildly shifting camera angles gave me the worst nausea. Also, there's an achievement for looking at anime boobs on a poster. Would not recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "The ending for this game is freaking hilarious.  That is all I can say.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "It has such promise,but fails because it doesn't teach the player the mechanics of the game You can't keep killing the player without them understanding what to do!(The windmill) The games so well put together as well...so disapointed",
            "review_score": "-1"
        },
        {
            "review_text": "pretty fun, very confusing though",
            "review_score": "1"
        },
        {
            "review_text": "It's Okay, would love to play the game more though.",
            "review_score": "1"
        },
        {
            "review_text": "I Realize its suppost to be a survival/horror type of game and i guess for a free to play it was a nice try if anything. *Spoiler not much though nothing game breaking* PS. games already broken. people might say its challenging but thats only bcause the game litterally gives you no direction you walk through a door teleport to a fancy house get sucks into blacknees and now theres a guy (terrbile voice acting but tolorable) who riddles the ♥♥♥♥ out of you and make you find items that just randomly appaer in your face no action to make them appaer there just there *poof* ♥♥♥♥ing magic thought this was survival not magic. Then the one time the game gives you some direction it says press e guess what you dont press it you hold it seems like an easy fix to me. basically this game is ♥♥♥♥ at what it tries to call 'survival' is nothing more then a bad attempt at a stanely parabole.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible. Terribly confusing. I got stuck on the white pawn path, in blind, trying to get to the 3rd door. Every guide I look up says something different, so I just said shove it. It's not THAT interesting of a game, tbh.",
            "review_score": "-1"
        },
        {
            "review_text": "As someone who has an azerty keyboard this game sucks. I have to put my hand in this really weird position to be able to play and i can't find the option to rebind the keys. I also completely lose the use of my mouse and there is no way for me to quit the game except force quit it because my escape button isn't reacting either. It's kind of impossible to say anything else about the game because i only got to the key/clock before i was seriously sick of the position my hand was in.",
            "review_score": "-1"
        },
        {
            "review_text": "Only If is a very surreal experience. You play as an average joe named Anthony. You were invited to a party. You get totally ♥♥♥♥♥♥♥♥d at said party. You wake up in a strange house, with a strange man talking to you through a radio. You wander through corridors, abandoned houses, and surreal dreamscapes. The game is very similar to the Stanley Parable gameplay-wise. Only If was constructed entirely on the Unity engine, and it is hands down the best looking game I've ever seen come out of that engine.  Only If's main downside is the lack of replayability. In the Stanley Parable, you have several interesting and varied endings that you can receive, all of which are based on your decisions made during the gameplay. In Only If, there are two endings, and the ending you get is based on one decision made fairly early into the game. I really wish the developers took a more complicated and versatile approach to the game's endings, because one of the endings is, albeit hilarious, really immature.   Overall, Only If is a very good game, and a very interesting experience for a free to play game. I recommend you give it a try.  OVERALL RATING: 8.75/10       ...  Perhaps it's time to wake up.  ...",
            "review_score": "1"
        },
        {
            "review_text": "This game is really confusing, sometimes you do not know what to do, at first he keeps saying press E or SPACE, but you do not know if you should press or hold. And the game becomes very boring, did not even reach the end of it I was so bored with this game and his bad mechanics.",
            "review_score": "-1"
        },
        {
            "review_text": "No. THE GAME IS NO GU. it may look pretty but the level desging or egh. the gameplay is UGH! and they give you time puzzles in which if you fail you die starting over making the player furious. I recommend not playing it. at all. take a look at the pictures and then leave. cause the game's graphics are okay. voice acting is eh i guess it works. and gameplay is not good.",
            "review_score": "-1"
        },
        {
            "review_text": "Only If is a very surreal experience. You play as an average joe named Anthony. You were invited to a party. You get totally ♥♥♥♥♥♥♥♥d at said party. You wake up in a strange house, with a strange man talking to you through a radio. You wander through corridors, abandoned houses, and surreal dreamscapes. The game is very similar to the Stanley Parable gameplay-wise. Only If was constructed entirely on the Unity engine, and it is hands down the best looking game I've ever seen come out of that engine.  Only If's main downside is the lack of replayability. In the Stanley Parable, you have several interesting and varied endings that you can receive, all of which are based on your decisions made during the gameplay. In Only If, there are two endings, and the ending you get is based on one decision made fairly early into the game. I really wish the developers took a more complicated and versatile approach to the game's endings, because one of the endings is, albeit hilarious, really immature.   Overall, Only If is a very good game, and a very interesting experience for a free to play game. I recommend you give it a try.  OVERALL RATING: 8.75/10       ...  Perhaps it's time to wake up.  ...",
            "review_score": "1"
        },
        {
            "review_text": "Windmill level is impossible. ",
            "review_score": "-1"
        },
        {
            "review_text": "If only it didn't suck.",
            "review_score": "-1"
        },
        {
            "review_text": "As a free game it's worth taking a look, but overall the game isn't really that fun. The graphics are amazing though! Unfortunately, that's about where the positives stop. Confusing story, not much in the way of a tutorial, HORRIBLE voice acting.  Do I recommend it? Not really, no. The few positives just aren't enough to justify the time spent playing it.",
            "review_score": "-1"
        },
        {
            "review_text": "8/10 enjoyed it very much. The only thing that could've been done better would be the movement (♥♥♥♥ing unity (it is unity, right?)).",
            "review_score": "1"
        },
        {
            "review_text": "Great game, it's like a cross between Myst and Portal. Also if you like Point &amp; Click/Escape type games it has a bit of that too. Takes a bit of learning and patience, requires understanding of basic FPS controls like running, crouching, running+jumping.   Finished the game in ~three hours, all 10 achievements (with a little help of the community hub).  ... and it's free!  E E E E E E E E E E E E E E E E E E E E E E E E E E E E",
            "review_score": "1"
        },
        {
            "review_text": "Just tryout this game. It's a rather interesting game. Funny storyline and amazing puzzle with good graphics to suit the gameplay. A few interesting scenes and some very challenging puzzle (couldn't solve most without guides) . Very suitable to players who seek out puzzle like game.",
            "review_score": "1"
        },
        {
            "review_text": "Kind'a reminds Me of playing Myst back in the day, but with better visuals, &amp; controls (never could get My X360 for Windows pad to work even though the game DOES recognise it...), be warned though, if you're schitzophrenic, this game will prob either freak you out, or even perhaps offend you LOL All things considered it's cool, &amp; it's free so you cannot go wrong!",
            "review_score": "1"
        },
        {
            "review_text": "Avant garbage!  One of the worst games I've ever played, period The game is trying WAY too hard to be edgy and avant garde but ends up as a confused mess of pretentiousness. I've played Dear Esther and I've seen how a surrealist environment can be done well, this game has none of the charm DE did. The story is confused (My guess is a bad writer trying to be artsy.) The gameplay is awful (At no point are you ever told what anything does beyond 'push c to couch') The graphics are good but it just makes me more disappointed that everything else just flat out sucks.  Not even worth the free download.",
            "review_score": "-1"
        },
        {
            "review_text": "trying too hard",
            "review_score": "-1"
        },
        {
            "review_text": "The most awesome ♥♥♥♥ing game in the god damn WORLD ( ͡° ͜ʖ ͡°)lolo",
            "review_score": "1"
        },
        {
            "review_text": "one of the strangest game ever played. Excellent setting, story that keeps you in suspense until the last moment",
            "review_score": "1"
        },
        {
            "review_text": "11/10 Would Sexual Harrass A Radio Again!!!!!!!!!!!!!!!!!!!!!! ^.^",
            "review_score": "1"
        },
        {
            "review_text": "*SPOILER ALERT* It was a good game.... ...Until I found out I slept with my sister.",
            "review_score": "1"
        },
        {
            "review_text": "Just tryout this game. It's a rather interesting game. Funny storyline and amazing puzzle with good graphics to suit the gameplay. A few interesting scenes and some very challenging puzzle (couldn't solve most without guides) . Very suitable to players who seek out puzzle like game.",
            "review_score": "1"
        },
        {
            "review_text": "This game shows you exactly why you shouldn't do drugs.",
            "review_score": "1"
        },
        {
            "review_text": "Only If is a first person puzzle game devoloped by Creability on the Unity Engine, in which you go to a birthday party with the hopes of getting  it OOONNNN  with your crush. You wake up in her bedroom after the party, and make an attempt to leave the house, guided by a short tempered voice on a radio.  Only If is NOT a very good game. The puzzles in the game are contrived at best and straight up broken at worst. The controls are alright when all you do is explore, but they aren't very helpful for precision platforming on flying painting or giant gold pillars.   The voice acting on the radio character is actually rather good, it has a decent amount of character, but some unrealized motivation. The main character's voice is not very good however, sounding cheesy and stilted. It doesn't help that the main character is pretty much just a horrible person, which could be used as a charcter study, or even a simple moral, but all it builds up to is a frankly weak ending that's comepletely irrelevant to the themes already presented.  The whole gimick of Only If is that the world can change around you as you solve puzzles. And this is alright, but it's never really used to make intersting puzzles, the creators instead care more about confusing the player. I will admit that the puzzles tend to have an atmosphere of oddity that I assume the creators were going for. The ways things play out usually is pretty intersting, leaving me quiet for most of the gameplay. But that doesn't excuse how broken the rest of the execution is!  Overall, Only If is an unplayable game. It has some interesting ideas that never go anywhere, unused potential that could have been great, and shoddily done voice acting. But hey, at least the games pretty to look at.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing Game!! Great Fun to Record, Although my Head Hurt Afterwards.",
            "review_score": "1"
        },
        {
            "review_text": "What the ****... This game just broke my brain...",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sure what to say about this game, I'm not sure if there IS anything to say about this game. BUT. heh heh, but... BUT it is a cool game, seriously though it's an interesting game to say the least, and if i were you i would try both endings, as they are both interesting in their own way, it's almost like a completely different game with each one. Otherwise, the game constantly messes with your mind. and if you can tolerate the puzzles/constantly changing storyline/completely random events that have nothing to do with anything. THAN GET IT! :D besides. It's free. so. y'know. why not...",
            "review_score": "1"
        },
        {
            "review_text": "Even though enjoying an art game for the sake of it being edgier than the rest a very immature statement, I'll take it that this is pretty much more entertaining than the usual art game because of it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, it's like a cross between Myst and Portal. Also if you like Point &amp; Click/Escape type games it has a bit of that too. Takes a bit of learning and patience, requires understanding of basic FPS controls like running, crouching, running+jumping.   Finished the game in ~three hours, all 10 achievements (with a little help of the community hub).  ... and it's free!  E E E E E E E E E E E E E E E E E E E E E E E E E E E E",
            "review_score": "1"
        },
        {
            "review_text": "it looks like it could be a VERY good game, but you can't change the key configs, im left handed and i can't use wasd and i can't change the keys to the arrows, so thats my only true complant but its still a big enough issue for me not to like it",
            "review_score": "-1"
        },
        {
            "review_text": "Trippy, frusturating, and all out confusing. This 'Drug Simulator' makes you wonder what is reality and what is absolutely insane. Im not really one to play games that go through a linear story, but this one is amazing. recommended for anybody who loves a good storyline. HILARIOUS twist at the end. Way to go Creability. 10/5",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome game. Who ever likes puzzels should definitly try this game. Although the end had me screaming what until the main menu.. WHAT!?",
            "review_score": "1"
        },
        {
            "review_text": "I just don't know what's weirder. The overall nature of this experience or the fact that you can experience it for free. Either way, if you do enjoy these 'food-for-thought' kind of games like Dear Esther, you MUST give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "Even it's free I still can't believe how bad this game is. Gameplay is bad &amp; Voice acting it's terrible to show on public  Nope to this game. I'm outta here",
            "review_score": "-1"
        },
        {
            "review_text": "lets make a game thats autistic to play  but lets give it a funny trolle ending from 9gag sam is his sister  ♥♥♥♥ this piece of trash  ",
            "review_score": "-1"
        },
        {
            "review_text": "I've played 23 minutes until this game lost me. Stuck at Windmill level,died about four times unsure whether I was supposed to continue to die or find a different route. It's pretty linear and I kept dying from fading (And disappearing) black spheres or non existant ones? As early as the Windmill level and as linear as it is, I should've known how to progress. But I did not.  Beginning story and direction are a big drag.  I found the voice of the antagonist quite annoying and predictable. Of course, a mafia boss. His character introduction could've been to befriend you before he turns on you. I feel that would be more compelling than to insult you as you begin. That way you can build some connection, you expect a mafia boss to be a ♥♥♥♥ anyway. Black spheres maybe introduced a little more clearly early on.  Elements that break my immersion are using the same painting on the walls. The simplistic black sphere effect, light source from windows with no actual outside light source. In the beginning two balloons that line up perfectly on a grid. More attention to detail is needed otherwise it just feels like it's lazy. Intrigue us, make us question the reality of the world.  Cut scenes were a little offputting at how a gigantic half-your-size rock does not kill you nor a falling windmill.  Graphic design of title is decent. Gets the idea, could be a bit better even for a simple game. Trailer created is pretty good. I do like the rooms that were made. Decent game for something free. Would not pay in its current state.  For those who are tenacious, play on.",
            "review_score": "-1"
        },
        {
            "review_text": "This is fairly terrible. The voice acting is nonsense and the puzzles are stupid. It's hard to be worth less than $0, but this game somehow manages it.",
            "review_score": "-1"
        },
        {
            "review_text": "If only this game didn't exist.",
            "review_score": "-1"
        },
        {
            "review_text": "I will probably be in the minority about this, so be it. I could not get that far into the game because there is some male idiot screaming obscenities at me. I do not like this in real life, will not tolerate it in a game.",
            "review_score": "-1"
        },
        {
            "review_text": "Definetly, better than Destiny. Hands down.   Would I recomond it?  ♥♥♥♥♥♥♥ YEA!!",
            "review_score": "1"
        },
        {
            "review_text": "A little harsh on the eyes, the graphics are pretty nice though in most places but Im stuck in a room with no options and no idea what im to do even though im following what im being told. Looks great but thats about all I can say",
            "review_score": "-1"
        },
        {
            "review_text": "I loved this game. This was the best free to play game. for a year we got nuthin but crap free games. Now they bring us some gold. Literal Easter Egg.",
            "review_score": "1"
        },
        {
            "review_text": "You know that game, that is a bit twisted, a bit weird puzzling kind of game that gives you a lot of satisfaction after the game because you managed to solve the puzzles regardless and the ending is just perfect?  Not this game.  That game that drags you into a ton of nonsense, irritation and that you keep on playing in the hope of glory, which you'll never get? This game!  While I was hoping for that 'gone home' experience of storytwists and genious puzzles, all 'only if' will give you is random nonsense that won't even make you pat your back after 'solving' something.  Granted, the game started with good graphics, nice voiceover, not too annoying controls and so forth. However, my goal for this game was none of those. I wanted mystery and weird stuff. Nonsense does not equal mystery. I ended up frantically clicking all over every room in the hope to activate anything.    Maybe the concept of making a puzzle game illogical is just no fun.. You finally discover a way to get out (That's what it felt like after a while) and looking back all you did was 'trial and error'. Exactly the thing you wish to avoid in puzzling.  This game is free to play for a reason.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't do drugs unless you wanna bang your sister.",
            "review_score": "1"
        },
        {
            "review_text": "69/69 would ♥♥♥♥ sister again ",
            "review_score": "1"
        },
        {
            "review_text": "the story was great really enjoyed playing this game 10/10 :D",
            "review_score": "1"
        },
        {
            "review_text": "Ended up at the Windmill place with the burning flowerfields. Don't know what that is... Press Space, Press E. Startover again. Press Space Press E. Totally dumb. I do not know who enjoys this but definitely I don't...",
            "review_score": "-1"
        },
        {
            "review_text": "This is well a confusing game because i couldn't even get past the first level, it's ♥♥♥♥ and I don't recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "It's different, that much i'll say. I struggled with this but it's alright if you like puzzles.",
            "review_score": "-1"
        },
        {
            "review_text": "Haven't been able to finsh so redownloading just to complete it!",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a decent story to follow and something profound to reflect on, I would steer clear of this game. The writing is poor yet tries desperately to appear deeply introspective, the characters are shallow, and the ending falls into a deus ex machina to clean up it's many loose ends, yet still does a terrible job of it all-the-while. I also found it hard to sympathize with the protagonist due to his use of homophobic and sexist slurs. Don't get me wrong--I can see the value of of doing this to build character and chart growth and development (or lack there of) for the sake of the story line, so I really did withhold my judgement until the end. But upon reaching that point, I was left dissappointed and unimpressed with his 'moral repertoire'. Instead, the insults felt thrown in there without intention, which seems to normalize their usage instead of providing any context to the already suffering plot.  That being said, the graphics are impressive (especially for an inde title) and some of the puzzles were fun, though I felt like I had done them before in other games... But neither of these things were able to overcome my chagrin for the poor writing. A lot of people seem to have a 'wtf' reaction to this game, and if that is a reward in-it-of-itself you'd be interested in, then give it a try. But if you hope to find substance in this quagmire of random philosophy references and juvenile humor, you'll be disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know what to think. I played the game through to the end and the ending was well, awful. It was a really random non sequitur joke and then a goofy song plays and everyone slaps their knees and I'm just sat here confused and unsatisfied like I just got told the longest joke in the world and the punchline makes no sense. For a narrative driven game, to end on such a low note is really really bad. If you intend to play this game, don't go in to it for the plot because nothing will ever be answered, and trust me, it's not that you can't figure it out, it's that there genuinely are no answers. The developers themselves probably don't ahve an answer, and that's not a good thing.  The puzzles are ok, although some are tedious. They're enjoyable the first time, but after finding out the surreal coating of the game is a complete sham then there's not much point to them, and late in the game they get really really really REALLY tedious. You don't feel clever for solving them, you just veel like oh my god did you really just make me shoot 100 vases.  Oh yeah, and one big problem is the fact that the audio mixing is horrible. The radio is painful to listen to and, trust me, you'll hear it a lot, while hte main character himself is really quiet. Aside from that, the voice actors themselves are really unclear in what they're saying, and there's no subtitles option. It's certainly a unique game, but it's an unsatisfying one and I feel more like the unique part of it is just the developers trying to disguise that they don't know what they're doing.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "I really tried to like this game. I liked the start in the house, seemed like exactly the kind of trippy and unusual game I would enjoy. The whole 'press E' in the Windmill level just annoyed me too much. I can't get passed that point because having to repeat the exact same bit over and over because I put a foot wrong and it gets to frustrating and just boring. That part of the game just felt very 'trial and error' and really not needed. I know It's a puzzle game but that part is just really not fun. It's such a shame because I feel like this has potential but it's ruined for me by that part. I gave the level 3 chances, about a week apart but I like it less each time. I really hope a future update for the game will remove E-mashing or at least give you more than a second of stepping off the path before getting thrown back to the start. I've not given up hope yet and if I see an update for the game, I will try playing again.",
            "review_score": "-1"
        },
        {
            "review_text": "Not even worth the download.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best games I have ever played. If you like the Stanley Parable then you'll love this. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I really tried to like this game. I liked the start in the house, seemed like exactly the kind of trippy and unusual game I would enjoy. The whole 'press E' in the Windmill level just annoyed me too much. I can't get passed that point because having to repeat the exact same bit over and over because I put a foot wrong and it gets to frustrating and just boring. That part of the game just felt very 'trial and error' and really not needed. I know It's a puzzle game but that part is just really not fun. It's such a shame because I feel like this has potential but it's ruined for me by that part. I gave the level 3 chances, about a week apart but I like it less each time. I really hope a future update for the game will remove E-mashing or at least give you more than a second of stepping off the path before getting thrown back to the start. I've not given up hope yet and if I see an update for the game, I will try playing again.",
            "review_score": "-1"
        },
        {
            "review_text": "Not even worth the download.",
            "review_score": "-1"
        },
        {
            "review_text": "For a free game, this is a must play! (I don't agree with the tag horror btw. Strange and mysterious, but not frightening)  It is actually brilliant! Yes, it has some problems, but if you are willing to get pass those, the experience is great. You could always look at a walk-through if you are completely stuck, but I encourage you not to. The game is not difficult, just a little odd at times, but that is also a good thing. Don't expect the same ol... This game goes deep.  What really excels, is the music, sound and voice acting. Yes, there are some problems with the mix, making it hard to hear at times (headphones highly recommended) but I am really impressed with the overall quality, especially the music, being a composer myself. I would say that it is as good as an AAA-title in that regard, and I'm surprised there is so much fine work within a free title.  At times, the game is frustrating and confusing. You end up repeating some parts, especially the beginning. But I also believe that some of these frustrating parts are part of the game-play, not just bad design.  The puzzles in the game become an experience itself, rather than just something to complete in order to progress. It is dream-like and mysterious. I found the ending has little to do with the real message of the game, and it felt it was put there to have a sense of competion. I encourage you to find your own meaning in the game instead though. It will leave you reflectinging for a while, and it is great when I game can do that.  I wish for more games like this, where you don't know what is going on, where you are in for a fresh experience with no handholding.",
            "review_score": "1"
        },
        {
            "review_text": "Trippy and challenging. It's a free game. Yay",
            "review_score": "1"
        },
        {
            "review_text": "A great puzzle game that will leave you wanting more. Plus, it's FREE, so why not?",
            "review_score": "1"
        },
        {
            "review_text": "The premise sounds interesting, the screenshots look intriguing. The game is as enjoyable as dog crud stuck in the souls of your shoes in the middle of summer. I was intrigued for the first few levels - not explicitly giving directions for how to progress can be fine, sassy antagonist. However, the game seems to confuse opacity with cleverness. And the controls suck cat furballs through an inconveniently small straw. I gave up while wandering the Windmill level (by the way, *very* clever making me type out the name of the level to pickup where I left off) unable to run, unable to jump, getting prompted to mash E every 5 seconds (that's not hyperbole) or have to start the level over again.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad graphics not worth installing",
            "review_score": "-1"
        },
        {
            "review_text": "9/10. Why not 10? Sometimes you have no idea what you should do. But you will get there. Very original. I recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Only If - The game was good.",
            "review_score": "-1"
        },
        {
            "review_text": "This has to be one of my all time favorite games. The variety, puzzels, challenges, easter eggs, secrets, and especially the dialog just wrap up the smooth graphics and fun storyline in a neat little bow. Best. Damn. Game. Ever. And it's free, what are you waiting for?!?!",
            "review_score": "1"
        },
        {
            "review_text": "I had to lick a piece of paper, then stick in the middle of my screen to actually hit anything with the ♥♥♥♥♥♥ gun.   Thanks game, at least I could skip to the end and shoot every single pot because I had no clue what the ♥♥♥♥ I was doing because the ♥♥♥♥♥♥♥ yelling 'mean things' at me was practically illeterate.   Thanks fam.  2/10, would reach for the gun to kill myself again",
            "review_score": "-1"
        },
        {
            "review_text": "THE BEST GAME EVER. BETTER THAN SKYRIM. BETTER THAN BIOSHOCK. BETTER THAN PORTAL. BETTER THAN ANY GAME I HAVE EVER PLAYED. I could elaborate, but the more I say, the more it spoils. It is for everyone, you want anything, you get it.",
            "review_score": "1"
        },
        {
            "review_text": "Oh boy... where do I begin? So far I'm loving it in a very different kind of way.  Sometimes it frustrates me to no end because I have no idea what I need to do in order to move on. However if you stick with this game and let your mind warp into the strange logic it presents you with, you're going to have one hell of a ride.   Also, it's free so try it out anyway.   One last note, the best thing about this game are it's puzzles and while they are difficult try and get as far as you can without a walkthrough. Only look at one if you're really stuck, otherwise just try and muscle through.",
            "review_score": "1"
        },
        {
            "review_text": "I loved the white pawn scenario, the black pawn, not so much. The essence of a puzzle game is being given everything you need, and having to figure it out, vs having to find everything you need and then it becomes obvious. The white pawn does this quite well. The black pawn however, does not. The beginning makes little sense, there is no puzzle here, you just have to figure out what the game wants you to do. I also managed to screw myself in the black pawn scenario because I missed something and then passed a point of no return. I would be okay with this in some situations (ever play Maniac Mansion?), but, I spent 30minutes running around before deciding there is nothing I can do, opened a walkthrough, to find there is indeed nothing I can do.  I recommend playing this, and not even touching the black pawn scenario, if I forget that existed, then its a great game. Great riddles, great ideas, like Antichamber meets Stanley Parable.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty solid game. Very outside the box. I had a good bit of fun. The only thing I didn't really like is that you often can't hear what Vinnie is saying (particularly egregious in a certain room that turns upside-down, leaving the source of his voice on a far away ceiling).",
            "review_score": "1"
        },
        {
            "review_text": "The voice actors in this game need awards. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game's story and mechanics are just as vague as its title. If you want a game that will screw your mind to oblivion or you simply want to throw logic into the trash, then be my guest.",
            "review_score": "-1"
        },
        {
            "review_text": "Very nice graphics, sounds great too. Very nice!",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game. Absolutely recomend it loved the bro mance ",
            "review_score": "1"
        },
        {
            "review_text": "Best free game i have played so intrestingt and so fun to play!",
            "review_score": "1"
        },
        {
            "review_text": "NO, this game is just NO.  I don't get why would such a game even exist, I don't know the story behind the developing but the game does not deliver anything good at all. Also, it is free, so it is not even a way to 'steal' money from customers....so I don't get the point of this game. I love walking simulators and riddles but this was none of the two. The thing I will remember forever is how annoying the voice from the radio was and how many times the F word was used. Such a bad taste, really. Play Fingerbones if you want a short free game that delivers emotions.",
            "review_score": "-1"
        },
        {
            "review_text": "Good. Immersive. Probably better when high. But very, very enjoyable. Hard to complete unless you're innovative, but yeah um Worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "The game is really easy to finish, and its worth it :)   Dunno why so much hate for it thou... 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Just the way the charcaters interact with each other is so vibrant and not like any other game where a narrator just tells the player what to do and the play just does it. This time it feels like you actually are a character with logic. My favorite character was the guy in the radio, it was so intimidating and especially in the end,uggh I love it. The graphics are another quality that makes this game so beautiful. I also love how the story played out and the big ol' twist at the end just blew my mind. The only thing I had trouble with were the puzzles and the part where you gotta jump the platforms and ♥♥♥♥ but other than that it was the best.",
            "review_score": "1"
        },
        {
            "review_text": "Thinks it's far more clever than it is. Irritating and frustrating. You get what you pay for.",
            "review_score": "-1"
        },
        {
            "review_text": "I simply cannot recomend this game to anyone, especialy if you are using a Mac. I wanted to like this game, I realy did. But I couldn't. I can't. Here are my reasons why: 1. There is a narrator who heavily swears and crudely insults you throughout the whole game. At first, it isn't such a big deal, but trust me. It gets old quick. 2. There are many glitches and bugs both gameplay and graphicaly related. 3. Plot holes. There are just too many of them. I love games with a story, and this did not deliver. 4. Character development. I was given no reason whatsoever to give a darn about any character. So I didn't. 5. No real save feature. You have to play to checkpionts, then remember the name of that check piont for the next time you play. If the devs were going to do that why wouldn't they just have a chapter list, so we could just select the chapter instead of trying to remember some key word? The game did have a few good things going for it like: 1. Entertaining graphics and affects. 2. Your character always seemed to say what you were actualy thinking. 3. There is a gun in it. That's it. It's a shame; the game had potential. However, to be worth either my time or yours, it has a LONG way to go.",
            "review_score": "-1"
        },
        {
            "review_text": "glad it was free",
            "review_score": "-1"
        },
        {
            "review_text": "funny &amp; puzzling, reminds me of stanly parable, very fun to play, amazing content, one of the best free to play games.",
            "review_score": "1"
        },
        {
            "review_text": "The puzzles don't make sense. Boring voice acting, and boring gameplay  3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Pros:  +good graphics +Free  Cons:  -bad voice acting and sound quality (you can barely hear your own character speak) -no idea what I'm doing because no tutorial/backstory -during the falling windmill level, there are giant black blobs that you 'fight' by button mashing E, often to no avail, causing you to die and restart the level.  Overall opinion: This game is very poorly made and doesn't make any sense. From the description: 'In Only If, you will fail a lot, you will die a lot, and you will undoubtedly be confused. Or will you?' That confusion stems from the fact that you are basically playing guess and check to move your way through the level.",
            "review_score": "-1"
        },
        {
            "review_text": "I would talk about this game, if there were actually a game here. You have no real control and there is next to no immersion once you start touching the disorganized and often unresponsive controls. In a nutshell, you just keep pressing E and hope this makes some progress...maybe...hopefully...if you're lucky  I want to like this game, I really do. It has great visuals, passable dialogue, and an atmospheric stream-of-consciousness form of gameplay that in other titles (i.e. the Stanley Parable and Gone Home) has been wildly successful and has helped drive player immersion. Only If could have been something memorable. It just failed to do so and failed spectacularly.  Now, I've played some lousy games (Superman 64 and 50 Cent: Bulletproof, to name a few), but this game takes the cake and eats it...mostly because, in this day and age, when even low-budget indie games are able to successfully compete with AAA titles, this is unacceptable.  The only good thing about this 'game' is that it was free.",
            "review_score": "-1"
        },
        {
            "review_text": "it was interesting.....",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of my favorites",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and well written.  3hours of my life/10",
            "review_score": "1"
        },
        {
            "review_text": "i have no bloody clue what is supposed to be happening, but i kinda lake that .-.",
            "review_score": "1"
        },
        {
            "review_text": "Very good. After coming through an existential dilemma of my own, this game spoke in just the right ways. Don't believe the negativity spouted by uninspired dregs, the game is worth every moment you decide to spend with it. I beat the White Pawn scenario (my first and only choice) in 92 minutes, and I realize there is more. I really gotta thank the devs that this is free. It is an experience which should be free.",
            "review_score": "1"
        },
        {
            "review_text": "Personally I found this game to be incredibly well made. The voice acting in it is superb, and the visuals even on one of the lowest settings still are astounding. I will admit there are a few times that you get tripped up playing it, but in the end I highly recommend playing it all the way through.",
            "review_score": "1"
        },
        {
            "review_text": "it's great game and there are good ideas in it but the puzzles are very difficult and the problem is there aren't enough clue to solve them and takes too much time to figure it out. most of the time you should use guides to pass the level. but you can try the game and it's free!",
            "review_score": "1"
        },
        {
            "review_text": "I JUST CALLED THE COP TO COME AND GET YOU MOTHERF***RS!!!!! I HATE THIS F**KING GAME!!!! I HATE IT I HATE IT I HATE IT I HATE IT I HATE IT I HATE IT I HATE IT I HATE IT I HATE IT I HATE IT I HATE IT I HATE IT I HATE IT I HATE IT I HATE IT I HATE IT I HATE IT I HATE IT !!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "This game has no logic or sense",
            "review_score": "-1"
        },
        {
            "review_text": "Crappy, dont play it",
            "review_score": "-1"
        },
        {
            "review_text": "What an ♥♥♥♥♥♥♥.  I ♥♥♥♥ed my sister.",
            "review_score": "1"
        },
        {
            "review_text": "Its a weird game.. that is about all i can say about it",
            "review_score": "-1"
        },
        {
            "review_text": "good game, kind of hard to figure out contols but overall its good",
            "review_score": "-1"
        },
        {
            "review_text": "One of the craziest games I have ever played. I did get stuck on one dumb part, but the rest was great!",
            "review_score": "1"
        },
        {
            "review_text": "no graphics options sucks . this game badly needs anti ailasing and vsync . too much frame tearing hurts my eyes .tested on ubuntu 14.04",
            "review_score": "-1"
        },
        {
            "review_text": "the game is good. i just dont like the main guys voice acting.",
            "review_score": "1"
        },
        {
            "review_text": "One of those underdeveloped, Irritating as hell games where you can't get anywhere even with a walkthough. Don't waste your time. It's free and I STILL want my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "Because smoking w33d has never been so much fun than expected in reality!",
            "review_score": "1"
        },
        {
            "review_text": "I played this for the pervert achievement.",
            "review_score": "1"
        },
        {
            "review_text": "For pity's sake, just do not bother. The game actively insults you for playing it. Stop trying to be the Stanley Parable and tell us how worthless we are for engaging in amusement activities.",
            "review_score": "-1"
        },
        {
            "review_text": "its alright.",
            "review_score": "1"
        },
        {
            "review_text": "YES! ONE OF THE BEST FREE TO PLAY GAMES THERE IS!",
            "review_score": "1"
        },
        {
            "review_text": "Okay, so I never like writing bad reviews/responses for things. Positivity is very important to me. But this was a complete waste of my time. Look, I'm familiar with the 'masculine, vaguely threatening dude gives mysterious and inscrutable tasks to you through a radio while shouting obscenities at you' and 'bizarre lateral-thinking puzzle type gameplay revolving around vague keywords' cliches of modern gaming (which I totally unironically love), but they have to lead to something. This was completely pointless. The annoying banter with your captor is utterly meaningless and the ending resolves nothing. I guess the gameplay is pretty surreal, but it's never interesting. On top of that, I was expecting a story-based type of game experience (at least for a generous definition of 'story'), but this is definitely not that. Near-constant, terribly voice-acted cursing, drug references, memes (yes, actual memes), and a ♥♥♥♥♥♥ 'twist ending' that had no relevance to anything previously established do not make a compelling story. This may honestly be one of the worst games I've ever engaged with. Please don't bother playing it.  And I know some people will say 'oh, but it's free!' Time is more valuable than money. I'm not criticizing it on the grounds of the engine or the limitations of a small-scale game (although the bizarrely antiquated save system did raise an eyebrow). I'm not complaining about spending money on it. I just think that all of the effort put into this game was clearly spent in the totally wrong direction.",
            "review_score": "-1"
        },
        {
            "review_text": "One of those underdeveloped, Irritating as hell games where you can't get anywhere even with a walkthough. Don't waste your time. It's free and I STILL want my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is awesome. its like antichamber, but more inappropriate.",
            "review_score": "1"
        },
        {
            "review_text": "this game had me caught in 'e' hell.",
            "review_score": "-1"
        },
        {
            "review_text": "What a wierd fun game. Its free so you can't go wrong there but its definitely an odd one. Still, I'd say the developers worked pretty hard for a free title, so its defintely worth playing. A very unusual game with some platforming and puzzles but with a really cool environment. Definitely worth playing for a few hours and then never again.",
            "review_score": "1"
        },
        {
            "review_text": "I was frustrated by the broken achievements (on Mac) and seemingly senseless, non-sensical storyline. But I stopped playing when the game resorted to a clumsy &amp; awkward 1st person jumping puzzle. I'll be generous and give it a point for a sometimes pretty sense of design and a point for a genre-centric psychological mystery... so 2/10.",
            "review_score": "-1"
        },
        {
            "review_text": "First glance? Game is beautiful! But unfortunitly, looks don't help the complete and udder stupidity that is, 'Press E' oh, and now that you've done that, you need to, 'Press E!' Press E some more, Press E some more! Not enough, press it some more! Can't get passed the windmill. Not possible. My fingers are cramping from trying, repeatedly. This really is a shame becuase it seems like this game really could be awesome. But as that first stage, or level, or whatever they wanna call the hell that is the windmill, is NOT possible to complete, well, I guess I'll just never know what the rest of the game looks like. Thank GOD it was free. I feel bad for anyone who ever pays money for this aggrivation.",
            "review_score": "-1"
        },
        {
            "review_text": "I really liked this game - at first.   Okay if you're ready for a 'different' experience and like going in to games not knowing anything - give this a go anyway. You'll probably enjoy the experience mostly, like I did.  SPOILERS BELOW  Still reading? Ok.   If you ever got caught up in the Lost series, you will feel the same way after playing this game. (I didn't, but I hear it goes along the same way.) Stringing you along with randomness making you think 'Woah, seriously, what is going on here, I can't wait to find out!' only to find out... it's all ♥♥♥♥♥♥♥t. The writer had no idea where it was going either - just putting random ♥♥♥♥ together to keep you guessing, not realising the only reason people are still following is because they are more and more eager to see how this comes together and makes sense. It's human nature. And when the ending is ♥♥♥♥, we legitimately feel jipped, and all of the 'intrigue' we felt before is replaced with a feeling of having wasted your time.  In the end, this game is pretty much a guy messing around in Unity, coming up with a bunch of random mini games, and loosely tying them together with 'drugs' as an excuse (how original) and then inventing the 'incest' ending hoping that the shock factor would hide the fact that this game isn't really well thought out and is just pretentious wank. It wouldn't be so bad as a mild distraction if the author didn't think he was a flipping genius... check out his blog. His next game is just more of the same.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just strange, it's pure luck to find what to do next 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Wow .. this is a really hostile game! It gives you very little direction and actively works against you. I used mostly trial-and-error to get through the begninning levels, but gave up and started using a guide. It's difficult because it doesn't give you an objective or even a direction, and the person on the radio is spouting nonsensical information that barely helps. On top of that, the map changes during playing and only provides the tools to escape toward the end of the time given to complete it. The dailogue is entertaining, but has too much swearing. The story starts off funny, but then I had no idea where it was going and the direction wasn't that appealing to me so I lost interest.",
            "review_score": "-1"
        },
        {
            "review_text": "I really though this was going to be a decent game but as I progress I just keep getting mad at these pycho random puzzlesto the point at a certain 'gansta green jar durgged enduced coma like dream' or what ever the creator thought was a creative way to propose an interesting premise just kept glitching out and just made the game down right boring and rage-like. Don't play for sure, just go watch someone else have a headache for 3 hours instead.  EDIT: Gave it one last shot: that was a mistake Overall Ending/Plot was literally the most bleeping stupid thing I've ever heard of  negative 11/10   May consider getting cancer so I can go to Make A Dream Foundation so I can have a dying wish of killing the creators of this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Game says: 'Press Space' I press [SPACE]. Game Says: Press 'E', I press [E]... and back to the white room we go, repeat Game says: 'Press Space'... Well maybe I'll try it again when I have played throug all the other games in Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh boy oh boy this game. It is like they played The Stanley Parable, and thought that the thing that made that game enjoyable was walking, cause you will do a lot of that. Walking and looking at things, also listening. And that is the worst part, because throughtout the game (or atleast the first ten minutes or whatever, I didn't want to torment myself more than that) you are being shouted at by an angry, drunk jamaican mafia mobster, who you simultaniously can't understand or ignore, because you have to hear everything he says, it is literally your only way to survive, well accept blind luck, which is how I got through most of the first few rooms.   Only If (I had no other means of entertainment and was chained to my computer, would I play it) is the only first person whiner I have ever seen, and I guess it does that well. You play as Susan B. Anthony after her sex change operation, who goes to a local bible club meeting, but accidently snorts some marijuana and die. Accept you don't die but wake up in the bedroom of the worlds only autist hotel, after a clown congress. The room is decorated with a giant picture of an anime, and I don't think we will ever know why, and a stupid Portal reference that made me circumsize myself. Then you open a door and let the black people in, then you follow a glow in the dark beach ball. You enter a room that will be the bane of your existence and talk to that angry man. You will open many doors, inviting in many blacks and cut of your foreskin many times.",
            "review_score": "-1"
        },
        {
            "review_text": "This was an amazing, yet creepy game that brings a new type of perspective. I'd definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I wish I could even try to play this game. I played a few time s and cant go five mins with feeling the beginnings of motion sickness. This is the only game that this has ever happened to me. Ugh. I wont be able to give an accurate review at all becasue of this. I tried it and just cant. Not my first 1st POV game at all.",
            "review_score": "-1"
        },
        {
            "review_text": "I can mainly recommend this game for it's amazing achievements!!! other than that, it has a couple of hours of trippy gameplay; that of which the Black pawn has a much better storyline than the White pawn does.  This game has good graphics, music and sound, very funny but mature dialogue and also decent puzzles that remind me of 'The Stanley Parable'! there are also a few references to other games, shows and movies which is nice to see. This game still needs a little work and improvement... other than that, I would give it a 7/10 easy. gg  Also this game is free: which is my favourite price for things...    In the words of EuroTrip's Cooper: 'YOU MADE OUT WITH YOUR SISTER, MAN!' (&amp; then some)   ",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what to say about this... weird at least... with perfect voice acting Overal: mindf**k!!! P.S. 100% at around 5 hours",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good, I can't remember playing it?",
            "review_score": "-1"
        },
        {
            "review_text": "Overall i would recommend this game becouse its good enough and its free. Even if you dont like it, its not like you're losing anything if you try it out.  Pros: - Free - Great graphics - A little weird but legit puzzles - Good soundtrack or at least i liked it. - The game has Yoko (Tengen Toppa Gurren Lagann) and a achievment for her. Even if you dont like puzzles, you just NEED to play this for at least 5 mins to get that achievment!   Cons: - Its too short, if you know what you're doing it can be done in less than 30 mins. - The ending is pretty terrible.   ====================&gt;SPOILER&lt;====================  Like i said, the ending is pretty terrible. I was expecting that the 'villain' is some sort of a demigod of chaos or something, thats looking to pass down his powers to someone and thats the reason hes ♥♥♥♥ing around/traning the main charecter. Turns out they're high as ♥♥♥♥.... oh and he slept with his sister... WHAT A PLOT TWIST! But its still fun enought to play thrue.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine your mind is going down an alleyway. Someone offers to show it a magic trick. Your mind says yes. The next morning you find your mind bent and twisted in a ball and tied to a bed. Like 50 Shades of Grey but your mind is the one getting violated.  11/10 would get violated in the mind again.",
            "review_score": "1"
        },
        {
            "review_text": "  cant find key -1/100",
            "review_score": "1"
        },
        {
            "review_text": "buggy and crazy , need more work with textures and lighting , interesting game with cool voice acting",
            "review_score": "1"
        },
        {
            "review_text": "if this game waas free roam it would be beast! i caant wait for part 2",
            "review_score": "1"
        },
        {
            "review_text": "I heard this game was a thinking game and it was free and for linux so I said what the hell. Note that I played it through with the aid of a walkthrough so that I could best get the arc of the story without the game-mechanic-interruptions that so often plague rather than propel videogame storytelling.  The ending reveals   drugs   and   incest   as the main ideas behind the whole scenario. What follows is a personal reflection that I wrote immediately after playing the game. That is to say, it is what the game made me think of,  not  what I though of the game.    Thing is though, drugs wear off with time. I understand the 'is anything even real?' agenda that the game pushed, but IRL most drug-induced hallucinations (and regular dreams too) end with time. What you do doesn't matter; it's all just a waiting game. For me, when I'm dreaming, if everything is just too absurd, I stop everything and sit down and wait for it all to blow over. And then eventually I wake up. A game like this would work for me if there was a strict time frame for the 'trip' portion of the game, and then you'd automatically become less and less drugged until you actually regained sense. Alternatively, for a non-drug-activated trip (i.e. a regular dream), there would also be a set time frame (say, 30 minutes) where the dream would occur. If you wanted to see how the dream story plays out, you'd have to either work quickly and effectively the first time through, or voluntarily fall asleep multiple times and attempt to progress further and further along the dream-storyline. This is something that actually happens in my dreams: I have recurring storylines that I revisit periodically and progress further and further in; I get better at advancing the story to where I left off with each attempt.    The concepts are as intriguing as they are blatantly lifted from source material; that is to say, it's moderately interesting, but those interesting components clearly have seen better days. If you have 2 hours (or more, if you don't want to use a walkthrough), go ahead and get this game. As a tool for getting me to think, it has succeeded. As an actual game with solid production value and replayability, this game does not meet standards.  If you absorb these sorts of psychological topics best through gaming, play this game. If you don't, don't. There are other works in different media out there that better address these concepts. If you don't want stimulating material at all, then steer clear.   It did get pretty annoying at times.",
            "review_score": "-1"
        },
        {
            "review_text": "It's AWESOME but hard as nails + It's FREEEEEEEEE!",
            "review_score": "1"
        },
        {
            "review_text": "waste of time only if youre poor guy you can play this game til end lol",
            "review_score": "-1"
        },
        {
            "review_text": "What a stupid, boring, idiotic, pointless waste of time. No continuity whatsoever between situations....no explanation for what's going on.....no clue as to what you're meant to do....and completely illogical puzzles you only solve by randomly clicking on everything.  Also, achievements are broken.  The worst of the worst of 'escape the room' Flash games....but now with added quicktime events! Yay!  This may be free, but it's not worth your time.",
            "review_score": "-1"
        },
        {
            "review_text": "Worth Every time I spent on...",
            "review_score": "1"
        },
        {
            "review_text": "Such a dramatic video. Nice job Creability. Don't stop make fun games.",
            "review_score": "1"
        },
        {
            "review_text": "This game ♥♥♥♥ing sucked big time, waste of time",
            "review_score": "-1"
        },
        {
            "review_text": "PAY ATENTION TO WHAT THEY SAY!!!!!!!!!!! Thats my advice. Use headphones. But a good game over all. Had fun. :)",
            "review_score": "1"
        },
        {
            "review_text": "The language in this game was so foul it killed my desire to play it",
            "review_score": "-1"
        },
        {
            "review_text": "This game teaches you a VERY IMPORTANT lesson. What's the lesson you ask? It's don't fu*k your sister. Unfortunately I found out too late...",
            "review_score": "1"
        },
        {
            "review_text": "Basic, somethings are weird. decent for a first time gamer that doesnt want to shoot anything. other than that, boring.",
            "review_score": "1"
        },
        {
            "review_text": "just not at the moment huge bug u can see oeple yourself and at windmill theres no clue what to do. u got left u get glitched between a rtock and ground. u got left u get shot. please fix these bugs.",
            "review_score": "-1"
        },
        {
            "review_text": "There seems to be a common issue of lag when it comes to this game. I've tried setting resolution/quality to the lowest and have a rig set up to run some pretty graphic-intense stuff, so it appears to be a game-issue. Sadly, it makes it unplayable, which is a shame because it really does look very intriguing.",
            "review_score": "-1"
        },
        {
            "review_text": "About as enjoyable as smacking your head with a 4 day old fish.  The real pleasure is when you stop.  ",
            "review_score": "-1"
        },
        {
            "review_text": "It's for free. That is literally the ONLY good thing I can say about it. Don't waste your time, folks.",
            "review_score": "-1"
        },
        {
            "review_text": "11/10 would play 69 more times",
            "review_score": "1"
        },
        {
            "review_text": "what is the purpose of the game?????",
            "review_score": "-1"
        },
        {
            "review_text": "XD!!!  Ending is hillarous, i laughed my pants off.  Nearly screamed 'PLOT TWIST!!!'  Haha, ending isn't what i expected. ",
            "review_score": "1"
        },
        {
            "review_text": "One of...THE WORST...HORROR GAMES I HAVE EVER PLAYED.... I swear the only part I could actually get through was still impossible. If around the first 2-5% of a game is button-mashing, then I'm sorry, but you've already made a terrible game. This game also being classified as a horror game is another big stretch. THIS is supposed to be scary? I've honestly seen things much scarier than just some stupid black mist following you. I was bored when I booted up the game, and I exited it even more bored and disappointed that this game (If I can even call it that) is classified in the horror genre. Only If...Yeah...Only if this was a decent game. The trained eye of a gamer would turn away from this 'game', because it requires the need for any other skills than being able to repeatedly slam your finger into the keyboard for the first 10-20 minutes of the game. I won't completely trash this game because it does have a nice look it and the dialouge is...OK...but that doesn't make it any better. The voice acting was horrible, for a horror game. if this is a horror game, then where's the actual emotion in the main character's voice? The only person that I think gives some interesting voice acting in this, is the guy who does the mysery man on the radios in the beginning of the game.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Suffers from the same problem The Stanley Parable does.  It tries to be surreal and 2deep4u, but it fails, it's just walking around, collecting stuff, and listening to the narrator spout profanity.  Also, framerate bugs.  My computer isn't the best, but if it runs Far Cry 3 on medium, it should be able to run this on good without hiccups.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "what the ♥♥♥♥ is this？",
            "review_score": "-1"
        },
        {
            "review_text": "Only IF WTF?????? this is ****...",
            "review_score": "-1"
        },
        {
            "review_text": "Where do I even begin? Without a doubt, one of the most unintuitive games I have ever had the misfortune to attempt to play. There is little (if any) telling the player what they're supposed to be doing, leaving you to guess and guess and guess what you're doing wrong. Dialogue is a bit quiet and forced (typical cardboard characters), though granted it IS an indie title and professional voice actors and equipment is probably not in the budget. My only solace is that it didn't cost me anything.  End of Line",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, keeps you interested in the story like a movie or book. At the same time, it involves you playing as the character to solve puzzles with a lot of challenge. Very very good for a free game.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to a weird-o game that will mess with your head and kinda creep you out, while still being a pretty cool and nice looking game? That's this game. It is really pretty at some points and seems put together well. But also is terrifying too. Quite short game, fun to play, will not forget this game. Just a little strange, definitely worth playing though.",
            "review_score": "1"
        },
        {
            "review_text": "Normally a big fan of indie games, especially, in the adventure game genre. I heard a lot about this game so I thought I would try it out.  First off, overall, well-done visually. The park was the most detailed. I also liked the combination of text input....while non-descriptive in that I could actually type in-game...always an interesting add-on from olden tymes.  Aside from that, I think this game tried too hard. Both main voice actors were abrasive to the point of me cringing at them speaking. There was sound clipping on both on several occasions. I am not disgusted or generally annoyed by excessive cussing but I really did feel it was over the top...most of it was just too much.  The ending was anti-climatic because the music was so loud I could barely understand what they were saying. I had to go look up someone recanting the ending online. That single point demonstrates inconsistent production of sound quality combined with story driven design. If you want loud music, while voices are speaking, drop the volume of the music! Not everyone hears at the same level. I am not hard of hearing but subtitles and decreased volume on voice tracks would have really helped.  I give a nod to the developer and team for thinking of a 'different game' and strongly encourage them to try again. But to me, that 'different game' was not fun nor did I walk away with an enlightened (or puzzled or horrified) mind. If I want edgy, spunky stuff, I will go play Bad Mojo, Katamari Damacy, Jazz Punk, Sanitarium, Total Distortion, Dear Esther, Papo &amp; Yo, Kairo, Harvester, Catherine, or Michael Jackson's Moonwalker. None of these have such an abrasive play experience and to me were really unique standing amongst the populace of indie games.",
            "review_score": "-1"
        },
        {
            "review_text": "I came to a safe, and i couldn't see the numbers on it, theres no zoom button in the game so i couldn't go througt that safe... don't recommend this game",
            "review_score": "-1"
        },
        {
            "review_text": "OK so first off there are parts of this game that really ♥♥♥♥ with you head, though it is extremely entertaining. though the ending just blew my socks off. it was something completely different from what i thought it was. i would really reccomend this game to anyone. its not a very long game but it has its great entertainment value, and its beautiful.   P.S. its also free, which is cool",
            "review_score": "1"
        },
        {
            "review_text": "Creepiest free game with only your own mind to mess with you",
            "review_score": "1"
        },
        {
            "review_text": "This game turned out to not be my style. While it's a decent game, I dislike games like this. I'm sorry, I can't recommend this one. But the dev has quite the potential.",
            "review_score": "-1"
        },
        {
            "review_text": "This game tries really hard to be the Stanley Parable, but ends up failling due to a few reasons.   While the puzzles are pretty decent, they are presented in a format that screams 'MESSAGE.' While I applaud a game for trying something new, trying to imbue meaning into something that is rather shallow ends up looking bad. This is especially true for the vase jumping part. It tries hard to make the vases seem like drugs, but the ingame message is that the vases are good, powerups. This relays the message: Drugs are good, without adding anything to that idea.   The worst part is the story, which revolves around Anthony and Vinny. Vinny drugs anthony and all of the story takes place in his dream. None of the continuity is explained and it becomes a mess by the end while we wonder what the ♥♥♥♥ is going on. We are supposed to like Vinny as a character based on how he is charismatic and funny, but he acts downright evil in the windmill section. Was him trying to kill you part of the dream? If so why would he act so nonchalant during the final scene. This 'it's all a dream' excuse ♥♥♥♥s with the story way too much in that you might as well ignore it and just go with it by the plays.   The splitting off part was a stupid move by the creator as it meant that a huge section was barred off from the main playthrough. Splitting resources like that for the sake of an artificial choice is stupid in triple A games and it's stupid here.  With the dumb choice forced in and the omnipotent narator it almost feels as if the creator was going for a Stanley Parable vibe. If so, then he failed. It wound up feeling just about as interesting but a hell of a lot less satisfying.  Despite the rawness of this critique I actually kind of enjoyed the game. It was interesting and varied and it tried something new with a new aesthetic that is rare from games like this. It was free to play after all, a choice I admire from the creator, and the puzzles were pretty engaging at times. I'd recommend this to a friend for the sake of having a conversation about it. It is the kind of game that invokes thinking and that's always a good thing.",
            "review_score": "1"
        },
        {
            "review_text": "I can't really recommend this 'game' for anyone into puzzles. It's got nice details but the language and volume fluctuating made my head hurt. Then there is also the vagueness and unforgiving nature of the puzzles.. completely NOT my style of gaming and not sure it'll appeal to others I'd know.",
            "review_score": "-1"
        },
        {
            "review_text": "I started the game, no instructions, no background and no idea what to do. I walk into the room where you had to 'Find the key'. I had NO idea what to do, where to look. it took me like 20 times. Then I go into the pawn room. I found the pawns BEFORE the audio started and i picked one, I glitched the game and had to start over. Then when in the white pawn room i couldent figure out what to do. just die and die over and over? graphics are good, everything but the plot. you have no idea what to do but click around.",
            "review_score": "-1"
        },
        {
            "review_text": "game seems promising. but for some reason i cant continue game... well still minor bug so worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting, but too many instant fail states.",
            "review_score": "-1"
        },
        {
            "review_text": "Well nothing happened past the fountain after I sacraficed myself about 3 maps before the park. So I guess I beat it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best mind bending games i have ever played in my life!",
            "review_score": "1"
        },
        {
            "review_text": "I'd only played this game for fifteen minutes and already had to use a walkthrough. And even with a walkthrough, I'm just so totally completely lost.   I wish the darkness wouldn't be so hard to beat - I'm pressing E like a mofo and nothing seems to happen. Am I just following the wrong path? I have no idea. The game doesn't give me enough time to look around to see which other way I might go.  Maybe if there wasn't a time limit or if the darkness wasn't so hard to beat, I might be able to say something about the storyline, because that seems to be alright (and the script &amp; voice acting are pretty awesome, very 'real', albeit abusive towards the player).  Instead, I'll just watch a playthrough and watch others be as frustrated as I am.   Oh, btw, I got one achievement, by accident:   crawled into the fireplace because I had to do something with fire, I guessed?   It was pretty funny, made me laugh. :)",
            "review_score": "-1"
        },
        {
            "review_text": "This game got horrible reviews by other websites, but honestly, this is probably one of the most creative games I have ever played. The story is great, along with the characters, it actaully makes you feel like the person you play as in this surreal world.  btw incest  10/10 would wincest again",
            "review_score": "1"
        },
        {
            "review_text": "very glitchy in some cases, and the instructions arent always clear, but the game is beautiful and i enjoyed every minute of playing",
            "review_score": "1"
        },
        {
            "review_text": "What's the point of this nonsense?? In the first level I'm instructed to find the key but when I do I can never pick it up! I replayed the level 10 times but the key can't be picked up and then the darkness comes and i have to replay again...graphically looks OK",
            "review_score": "-1"
        },
        {
            "review_text": "I like the bit where you mash E to not die.",
            "review_score": "-1"
        },
        {
            "review_text": "A very weird game. Sometimes it's hard to understand the instructions so it can be very frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "Awsome game very challenging and it pulls you in from the start. I think this could be a very popular game if enough people tried it. Keep up the good work!",
            "review_score": "1"
        },
        {
            "review_text": "'Only If' has an incredible potential, but does not use it. What's annoying in this game, is that it want us to guess what to do : nothing to guide us, or give us clues. The story is upside-down too. We do not understand what is happening at all...  Maybe there's something harder to find out. Maybe we're not ready to understand it. Who knows ?... But yeah, I really do not recommand it. It is a waste of time on your computer I think. Better to watch some Let's Plays on YouTube. I know, I should not be rude like that... But hey !",
            "review_score": "-1"
        },
        {
            "review_text": "Wow, I found this Really Challenging but Fun, It got a bit Boring after a While.. I think i would rate it a 5/10 so, really I don't Know if I should go with a Yes, or a No. Im just gonna go No.. Sorry..",
            "review_score": "-1"
        },
        {
            "review_text": "!",
            "review_score": "1"
        },
        {
            "review_text": "A game with choice? More liek a game with the illusion of choice. No matter which pawn I pick it forces me to the windmill. I can't get past the windmill since the path I have to take is blocked off and I keep dying. Probably a bug, but I'd wait until it gets fixed or something.",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome",
            "review_score": "1"
        },
        {
            "review_text": "Only If... is a wonderfully done puzzle game. I classify it in my mind with games like Penumbra, Cry of Fear, and Scratches. However, it's not exactly a horror game. It uses elements of horror games to create tension and atmosphere, but it's nothing that will keep you up at night.   Personally, I really enjoyed the graphics and atmosphere of the game. It has some beautiful scenes and is well crafted. The story is rather well thought out as well. It plays well and has some difficult puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "It's a very good game, and shocked to see that it's free. It's that good.",
            "review_score": "1"
        },
        {
            "review_text": "PRETTY CRAPPY GAME WOULD NOT RECOMMEND",
            "review_score": "1"
        },
        {
            "review_text": "This game barely gets a Reccomendation from me. The first thing to make note of is that you need to turn up your volume a bit to hear the dialogue because it's pretty quiet. And there is no subtitles.  The second thing is that the dialogue is pretty randomly vulgar. Not a big deal but some people dislike swearing and you'll need headphones if you plan on playing this at work.  Thirdly, The game gets rather frustrating at times, Due to arbitrary puzzles, the general confusion and bad checkpoints in the 'Immensity' level, Or bugs. Which brings me to my next problem.  Fourthly, The game seems to have a lot of bugs. Notable bugs being:  Clipping through objects, Usually when sprinting.  checkpoint probems(On immensity, After shooting the second giant pot and then dying, You are taken to where the pot was, But there is no pot and your jump is not high enough to reach the next platform anymore.),  Area reload problems(Again on Immensity, There is no way to load 'Immnesity Part 2', Whether this is due to the typo or not, I'm not sure. And when reloading Immensity you start with a jumping height of when you've broken the first Giant pot. This may have been on purpose as a way to alllow someone to get back to where they were quicker, But that was never made clear if it was.)  Lastly, The ending ruins the story. You can play for yoursself aand see what I mean, Since otherwise the game is fun. I enjoyed how things were going with the stor and then they just end it with a bad joke ending. Annoying.",
            "review_score": "1"
        },
        {
            "review_text": "Very decent beautifully detailed puzzle game with some twists. Love games that require a little bit of thinking to overcome challenges. Would Definitely recommend to any gamer that loves logic based puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "Get shouted at and experience bad voice acting!  10/10",
            "review_score": "-1"
        },
        {
            "review_text": "Started of interesting and enjoyable but then became a hard to play abomination of invisible mexican gangster's with flashlight guns trying to kill me. Sounds like fun but then you realise how intensley boring this is after half an hour of talking to some guy and then being shot at by said guy and then talking to said guy again in the same room and then.....you get the point, repetative and obviously has reason for it being free.",
            "review_score": "-1"
        },
        {
            "review_text": "You shoot vases that turn into cupboards in purgatory and shove your face into a trashcan to upgrade your revolver into a tommy gun. Then it turns out you had sex with your sister. I just skipped most of the game by typing 'ending' on the password screen. There's no deep meaning behind it all, it's just a waste of time",
            "review_score": "-1"
        },
        {
            "review_text": "something new. Think outside the box with this game",
            "review_score": "1"
        },
        {
            "review_text": "I really wish to give this one a positive review for the work that has been put up for it but.... I can't. I can't find anything enjoyable in it and the mechanics are too sloppy.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not recommend, for many users the mouse sensitivity/ mouse acceleration is way to high, to the point of not being able to play. There are no ingame configurations, nor any comfig files outside the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Very weird game but still fun graphics look good and the gameplay is good too.",
            "review_score": "1"
        },
        {
            "review_text": "so i just completed it.....and..... what? who wrote this? you need help?! im still confused..............",
            "review_score": "1"
        },
        {
            "review_text": "Terrible. Just, terrible. Dialogue was written by children. 'Story' is non existent. Just walk everywhere while pressing 'E' and you'll eventually find out what the stupid voice on the radio is blathering about. But that won't make it any better. Yuck.",
            "review_score": "-1"
        },
        {
            "review_text": "Only if you want to kill a bit of time and say to yourself 'what the hell did I just play'.   I won't spoil anything in fear the game will become unbearable for you.  The plot is terrible, there is no accomplishment or point to it all that justifies the experience the protagonist is facing. There is nothing driving you to continue other than your personal curiosity and need to finish.   Word of advice, press escape in every new area to get the name of it so you're able to return to the same spot after stoping. There are no checkpoints or saves, if you quit in the middle of an area, you start over. Which albeit it, doesn't matter since they aren't too long anyway. To return to the last area you were, press space and they type out the name.   There are a few parts where you use this same type of control for instance when the voice asks you what do bees make (honey, fyi) but this method of gameplay does not develop or continue throughout.   I get where they were trying to go with the riddles or 'pun' as the voice said at one point but they don't really make you think, instead they just spell out what you have to do.   The cursing is unnecessay. The protagonists and antagonist attitudes are not merrited, there is no context for them. In their basic form (annoyance/anger) yes but not in the form they are presented (poor voice acting maybe).   The interior design is terrible but I digress. The music at the end is too loud to hear the voices properly.   With this all said however, the level of design detail and graphic are great for this caliber of game. The transitions were long but executed well, the door puzzle concepts, mazes and jumps were great and more emphasis should have been placed on them to make them more complex or at the least longer.   To summarize, the idea behind the game, design and puzzles (although could have been executed better) give player enough momentum to push through, but the lack of context for the dialogue, goal and overall point to the entire game left me wanting more. They basically had a good idea but instead of connecting everything in a way that made sense, they left the holes in place, slapped everything together and allowed us to explore. Considering it's free, I'm not complaining but if I had to rate this game, I'd give it a 2/5, it has/had potential but I'd suggest using it to kill an hour or so.",
            "review_score": "1"
        },
        {
            "review_text": "Was ok game for being free but the level select didnt work for the vase level so stopped playing it",
            "review_score": "-1"
        },
        {
            "review_text": "AMAZING gamepllay!! there needs to be a second one with more content!! :D",
            "review_score": "1"
        },
        {
            "review_text": "I would highly recomend this game. I finished the entire white-pawn with no faults in under 2 hours. I'm probably the best at this game. I'm not even kidding. It was easy as ♥♥♥♥, and if you have to look up a guide, you are ♥♥♥♥, a worthless peice of ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "The Game Is Very Broken And I Finally Made It Past A Hard Level It Glitched And It Spawned Me Back And I know it did because it took me before my llst checkpoint",
            "review_score": "-1"
        },
        {
            "review_text": "This game full of motion sickness (made me dizzy) couldn't play any more,pressing buttons can restart the level again and maybe next level you try not to press will restart it also not sure if troll or annyoing thing the game idea is good but the style of playing as fps but no tool/hands showing is kinda bad  i hope they put more and fix more in part 2",
            "review_score": "-1"
        },
        {
            "review_text": "You will like this if you like to hear cuss words every 2 seconds.",
            "review_score": "-1"
        },
        {
            "review_text": "Only if I knew what to do in that one part of the game where you have to do something but I just cant figure it out.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting puzzles, not too difficult or long. Strong language. Story is pretty abstract and hard to keep track of what's going on because characters are often hard to understand due to mumbling and volume: needs subtitles. Overall was ok, nothing spectacular. Free is a good price though. It took a little under 3 hours for me to beat.",
            "review_score": "1"
        },
        {
            "review_text": "Eventually, that dialogue - it just gets to you, you know?",
            "review_score": "-1"
        },
        {
            "review_text": "Got stuck on a level. 10/10 will get stuck again.",
            "review_score": "1"
        },
        {
            "review_text": "I would prefer it to be slightly longer It was fun, funny, scared me a few times, it was deep, majestic, and all that nonsense but it would be so much better if I had a few more hours of gameplay",
            "review_score": "1"
        },
        {
            "review_text": "The first level was fine. Easy to understand, good progression, little setbacks for failure. The second Level, was ♥♥♥♥. You have to mash super fast, to a point where I would rather not try and mash it. And once you finish the ♥♥♥♥♥♥ 'qte' then you are greeted with a face full of grass you have a hard time looking through and are told to crawl, and stay in the grass. The grass that is really hard to figure out what hides you and what doesn't. Because if you so much as poke your head out, then you're dead. Not only that but when you die you have to do the qte over again. I feel that this was designed in this manner to pad out the gameplay. This isn't NES Hard, as it were. Because progression is blocked by unclear directions. I don't feel like I'm closer each time. I am stuck in the same bush and I die over and over for a cause I don't understand.",
            "review_score": "-1"
        },
        {
            "review_text": "The game seemed like something I'd enjoy. But after having more cutscenes than gameplay and two quicktime events i decided to drop this game. Don't get me wrong, I want to know what's going on and this might be one of the few times where I'll just hit youtube.  The main menu is a joke. Esc to quit, click for new game and space to continue game, no other options what so ever, i can't even rebind the keys, nor get a correct list of what keys are used. And to continue a game you need to remember a certain word to get to that room/level. This is something i could expect from say... Goof troop, the old SNES game. But having this as a system to get back to where you where... No, just no.",
            "review_score": "-1"
        },
        {
            "review_text": "oh, my God is this game good! The choices, the atmoshpere and the voices keeped me going. The puzzles are a bit miss leading but ounce it clicks in your head, you start to unserstand. The ending is a kicker and is worth the work.",
            "review_score": "1"
        },
        {
            "review_text": "I like the idea behind it and really wanted to get through it, but I have no patience for it. It would probably be worth playing for someone who does. I found it to be a little too challenging for my taste and the controls didn't really jibe well with me. This is more of a 'play at your own discretion' review rather than a 'I wouldn't recommend it' review.",
            "review_score": "-1"
        },
        {
            "review_text": "What a Mind♥♥♥♥ this game was...  Enjoyable...but confusing and will make you want to come back for more...  I hear there's multiple endings so I'm off to the madhouse",
            "review_score": "1"
        },
        {
            "review_text": "'About this game: (...) you will undoubtedly be confused. Or will you?'  I was confused. Or was I? This pretty much sums up my experience with this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is simply awesome, the story moving, the graphics stunning the over the top acting set this game apart from everything I have seen, I'm really waiting for &amp; to come out from these developers, they have a really bright future in their way",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game. Just, ♥♥♥♥ it.",
            "review_score": "-1"
        },
        {
            "review_text": "Feels like a half-life mod. Not a great game by any stretch, not really that good either. The hardest part of the game is maintaining interest throughout the okay voice acting and pretty horrible dialogue. Not once did I feel invested in anything going on. About twenty minutes in I found myself wondering why I was still playing, and that's when I found myself in a park wandering around in circles waiting for a scripted series of title-overs to decide to play out. After three minutes without a single bit of dialogue/clue/hint/goal I realized this game was severely wasting my time and was giving me back nothing to show for it.  I'll add that the interface for the game is kind of a mess. A lot of the time you don't get captions telling you when you can interact with something even though the early game implies that you will always get these captions so you know what to interact with. Sometimes, not always, they simply don't appear and you'll just wander around clicking on random geometry hoping something happens.  This is not the kind of game that can get away with wasting your time.",
            "review_score": "-1"
        },
        {
            "review_text": "This game blows, I can't get past the part after you get out of the water, I keep getting shot or I die randomly and I'm pressing E.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game, interesting puzzles. Very abstract. Definately worth the hour and a half I spent playing it!  8/10 because some walls got buggy or made the game choppy if you got too close.",
            "review_score": "1"
        },
        {
            "review_text": "This is a hard game to review. Since it's free, I recommend everyone try it out. It's pretty short, and it's interesting, but it can be extremely frustrating at times. The narrative, and it's delivery, are strange and unusual. It's a pretty game, and it runs well. However, some aspects of the gameplay are aggravating from a technical standpoint.  Bottom line: There is much to like here, if you can get past some of the flaws. At the end of the day, it's a free game. It was a fun way to spend a few hours. Give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "this game is good but kinda hard for me cause it is challenging for me :D",
            "review_score": "1"
        },
        {
            "review_text": "So finnished this game in less then 3h, both black pawn and white pawn storys with 6/10 achivements nailed, got the pervert one directly wich says something about me I guess.  Great free game, I was expecting WAAAY less from a free game like this.  It feels like a mix of Amnesia and MYST with twisted humor, its not very hard but some things might require several tries to get it right.  I strongly recommend this game for a few fun hours,  ",
            "review_score": "1"
        },
        {
            "review_text": "Roasted Pataties",
            "review_score": "1"
        },
        {
            "review_text": "I had a great time playing through this, although it's extremely difficult and i had to use a guide 75% of the time. It has a hilarious story and ending,and it was a whole lot of fun for a free game. 10 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "'Getting trolled out your ♥♥♥ while on LSD and heroin combined and going to hell for everlasting wtf feelings' simulator. A digitally crafted psychological torture instrument. Would allow mind to be ♥♥♥♥♥ again. 10/0.1",
            "review_score": "1"
        },
        {
            "review_text": "I Enjoy This Game Thats All",
            "review_score": "1"
        },
        {
            "review_text": "Audio is required to solve the puzzles but there isn't subtitles. Have to replay same level over and over again just to hear the instructions.",
            "review_score": "-1"
        },
        {
            "review_text": "I simply could NOT get past the windmill stage! I kept hitting E every single time it told me to. I tried holding it, I tried hitting it repeatedly. I tried every variation of pressing E that I could think of, but it kept blacking out. That was a complete waste of time. Also, just a note for the future, littering writing with F-words doesn't automatically make it good. Or intense. Or even worthwhile.",
            "review_score": "-1"
        },
        {
            "review_text": "Only If is, in my opinion, one of the best free-to-play games that Steam has to offer.  PROS -nice atmosphere: every level if unique -soundtrack: goes with atmosphere. But I found the soundtrack to be pretty soothing -graphics: I didn't expect much from a game that was free-to-play, but I was astounded at the beautiful graphics, especially in the Park level. -antagonist: The man in the radio (Vinny) is an oddly likeable character. At first he was frustrating but as I kept playing I grew to really like him. Vinny is snide, cynical, and mean, but he does seem to have moments of kindness or mercy. -protagonist: Anthony is surprisingly likeable. Most FTP 'horror' games have dull, boring protags who offer little (I'm looking at you, The Forgotten Ones). However, Anthony's personality and reactions to what happen to him are relatable and make sense for a teenage boy. -puzzles: the puzzles in Only If are difficult and actually make you think, though I will admit some are very hard.  CONS -volume/voice acting: while I adored the soundtrack, it was too loud and wouldn't turn down when the characters were talking. While Anthony could be heard easily, Vinny was difficult to hear at points; hearing him is critical to the story making sense to the player. As far as I know there is not an option for subtitles either. -puzzles: while some were great, others were arduous (mostly the Blind and Immensity levels). It took me a while to figure out what was actually going on. -checkpoints: there are hardly any checkpoints; if there are, you can't see them. this makes it very frustrating when you mess up and have to start all over. -villains: it's clear that Vinny is the primary antagonist but other villains like the dark cloud just pop up randomly with no real connection to what's going on.  Overall, I give Only If a 6.5/10. Definitely worth a try! ",
            "review_score": "1"
        },
        {
            "review_text": "So confusing, oh man! Just confusing and not clear at all. I understand it maybe was a decision to make more impersonification with the main character, however I refuse to do a game completely with someone that tell me everything to do. In a guide, external to the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I cannot sya that I really enjoyed it. Seems people either reaally like it or really don't. Nice look but the interface feels clunky to me and the surreal storyline did not grab me. Since its free why not try it and see what side you fall on? If there was a 'meh' option instead of 'recommend: yes or no', I'd choose that.",
            "review_score": "-1"
        },
        {
            "review_text": "emmmh... yes, good choice, is worth nothing, u can just download it for free...",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic game, models and textures are well done, the game idea is awesome and probably a lot of imagination was needed to come out, it is really difficult to find out what to do without a guide, so i recommend you having one opened up while playing, should be sold atleast for 5 euros, my greetings creability!!!",
            "review_score": "1"
        },
        {
            "review_text": "So, I have to say, that the ending is one of the greatest. I loved the gameplay all the way up to the end and then only to have that story play out. Love it. Oh, and Sam is a b*t*h and Vinnie is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "This game was a great experience The gameplay was clever, and the voice acting was on point. The ending (don't worry, no spoilers) was incredible, and laughable :) There were some tiny details i didn't like (the fov changing when running, even though you're standing still), but all in all, worth the hour it took.  i would give it a 9/10, and you should try it out, just for fun :) (minor warning - they swear alot)",
            "review_score": "1"
        },
        {
            "review_text": "I like the beat used in the trailer- and the big picture you see in your friend's room when you wake up.",
            "review_score": "1"
        },
        {
            "review_text": "I took the Black Pawn. 10/10 would do it again.",
            "review_score": "1"
        },
        {
            "review_text": "So Far I am in college and I started playing this during class. So when i first spawned in the bedroom and saw the picture of that anime girl, I had to shut it down emediatley. but other than that the opening of the game seemed really cool. I would definetly play this game. :)",
            "review_score": "1"
        },
        {
            "review_text": "Nice story.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Quirky little references throughout the levels and a lol-worthy ending. Love it.  Got nothing to do in your free time? Play this.",
            "review_score": "1"
        },
        {
            "review_text": "This game was a very pleasant little surprise for me. Aside from a pair of personally-frustrating moments, largely enjoyed the experience. Game mechanics are fun. Soundtrack is excellent. Story is creative and clever. Will definitely recommend as a short but worthwhile game.  Thanks a bunch Creability!",
            "review_score": "1"
        },
        {
            "review_text": "This is a Great Game, The Style of the game was Nice, Great Detail, and Hilarious Ending. The Ending was way unexpected but other than the Ending, this game was difficult when coming across the Puzzles but thats what makes it a Good Game. You have to use your time to Solve the Puzzle/Challenge then as a Reward, you get to go to the Next Level. I Definitly Recommend this Game.",
            "review_score": "1"
        },
        {
            "review_text": "Just... I don't even know. Terrible audio levels, no subtitles, no settings for a terribly oversensitive mouse... a messed up 'save' system. No crosshair or anything to get your bearings which makes you motion sick. The only good part about this game is the price of free.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a pretty short game with alot of riddles puzzles and all sort of brain twisting scenarios. This game does have alot of mature content as well as people who love to swear alot.   Game has alot of issues i pointed out. One being that the voice acting is okay but sometimes you cant hear what they say and you have to repeat the scene multiple times. As well as the volume on everything is just bad because you cant adjust anything(not that i know of though) Must of the times it was the music overlaping their voices or you just couldnt hear the voices very well. Game was hard (for me) but it does have very likeable puzzles. Although the end is bad because you cant much of the dialougue as well as it was just well... confusing for me as i would say.   Besides all that its a nice, short singleplayer for when you get bored and need to kill 1-3 hours. The graphics were above awesome for a free game. it was fun weird andd obviously challenging i would reccomend to play it so that you get a weird little story in, but do remember this game is hard and you may not get everything on the first try so keep trying until you get ♥♥♥♥♥♥ enough to go look up a walkthrough.   My rating being 1/10 is going to be a 6. Its short, sound was horrific and ending was just well bad. But the game does have a nice trippy feel to is as well as the experience is cool but the one thing that rises through out all is the graphics. They are nice easy to run and gives out a perfect detailed free game.",
            "review_score": "1"
        },
        {
            "review_text": "What to say that won't give it away? Quite a few times i was confused and annoyed at what to do but the concept of this is well done, i thoroughly enjoyed the ending, not what was expected. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful graphics and music. The concept is great. Although, they should make a better zoom feature. The puzzles are a bit tricky, but it's fun. I recommend it, since it's free. DEVELOPERS PLEASE FIX ACHIEVEMENT: 'You have no idea what you're doing, do you?'",
            "review_score": "1"
        },
        {
            "review_text": "Original, Encaptivating, Fresh!  Let's get it out of the way that the voice acting isn't very good. Also some of the puzzles are a bit abstract and can be difficult. I think these are the two main reasons people are down voting this, but I don't think that is a fair evaluation of this game, after adding in all of the strengths. Right away, you notice that the gameplay is very unique and meta. With dialouge and puzzles that break the fourth wall, but also with gameplay mechanics and visuals that inspire your imagination. I appreciate that the developers took a very out of the box route, taking a lot of influence from the 'no rules' ideaology of the film Inception.  Bottom line, if you're looking for something fresh, imaginitive, and intruiging, than take this game for a spin!",
            "review_score": "1"
        },
        {
            "review_text": "I don't like giving negative reviews for games and this is no different, even when the game itself is actually quite good. The game, however, is not user-friendly at all. You can't actually save your game and it is very frustrating to play as it isn't very clear what you are doing wrong and why you keep dying, especially in the 'Windmill' level. This truly feels like a good, free indie game, but because it is released on Steam, I have to review it harshly. Sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "vVery intresting game , it kept me hooked the entire time and with its duel story lines and mystery style clue system it just makes it even better, its a great game.",
            "review_score": "1"
        },
        {
            "review_text": "I love the tone and humor set in this game. The humorous narrator/dictator in the game who is kind of a ♥♥♥♥ and the funny reactions the player's voice has, sets a very funny setting. It isn't followed up on as much as it could, and there a ton of unexpected turns and odd changes. But the game captivates me and makes me want to know more, get to the next part, and finish. With all the AAA titles out there that can't captivate me at all, that's already half the battle. And considering that it is free to play, its is a no brainer. After playing tons of little puzzle games while intoxicated (Stanley Parable, The Guest, etc) this is a nice addition to run through once. Definitely recommend",
            "review_score": "1"
        },
        {
            "review_text": "Tell the haters to do one, this game is awesome!   Cool and original concept, fun storyline, and free!  ",
            "review_score": "1"
        },
        {
            "review_text": "The biggest mind♥♥♥♥ I ever experienced.",
            "review_score": "1"
        },
        {
            "review_text": "pretty good for a little indie game",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "Very odd but captivating puzzle game. My only major complaints are the lack of subtitles and that the Windmill level is balls.  And it's free! Legit free! Can't complain about that!",
            "review_score": "1"
        },
        {
            "review_text": "I can't really recommend this 'game' for anyone into puzzles. It's got nice details but the language and volume fluctuating made my head hurt. Then there is also the vagueness and unforgiving nature of the puzzles.. completely NOT my style of gaming and not sure it'll appeal to others I'd know.",
            "review_score": "-1"
        },
        {
            "review_text": "I find this game to be one adjective: Intriguing. And to be honest, that's all I can really say. Because I don't know what else to say. I can't tell you if it's good or not, I can't say if I like it, and I certainly can't tell you how to make it better. What I'm getting at is that I want to play more and more, to find out how I should-- no, how I COULD properly judge it. But I can't, because I'm afraid to. It seems like this game is against me completing it. The game is overwhelming.  It's overwhelming in the number of choices you as the player have to make, and it's overwhelming in a sense of fear. You are constantly running from this strange, unpredictable man, who totally isn't exactly like Vaas in every way (if you didn't catch the sarcasm, I'm saying he's exactly like Vaas, in every way. Not that that's a bad thing). You're also running from this darkness, which seems to pop up around every corner and only lets you pass by trial and error. I have no idea how to tell you what to do with this game. But I will say that you should play it. You should play it, because the sense of accomplishment you get after beating that one strange puzzle that made no sense that changed after you went back to the main menu is incomparable. I'm not sure if it's bugged, poorly designed, or well designed. But it will certainly make you feel two things: Stupid and scared.",
            "review_score": "1"
        },
        {
            "review_text": "This game blows, I can't get past the part after you get out of the water, I keep getting shot or I die randomly and I'm pressing E.",
            "review_score": "-1"
        },
        {
            "review_text": "great game very fun and entartaing before i knew it i had already played an hour but i have to give it 3 out of 5 stars because while having a great story the main character anthony had terrible voice acting he didnt sound real he sounded like he was reading off of a script but Viny was a great character and was my favorite ",
            "review_score": "1"
        },
        {
            "review_text": "Bewarend: kinda scary but it is fun in alot of ways does swear (so play this when youre family is gone ;)",
            "review_score": "1"
        },
        {
            "review_text": "This is quite a good game, I loved it, a stunning idea excecuted well. This game and other like it remind me why I love the Steam community so much. Its short, hilarious and sweet... er actually its not sweet, its brutal and unforgiving and its very difficult because lots of the game consists of mind trips, being ripped from other worlds and game ending glitches. ( Again rememeber that I loved this game when I say this ) You can look at it different ways but the first time it all went over my head. But one thing its not for, is people who are offended easily. The language is graphic and grotesquely descriptive and would make some people lose feeling in their limbs. Not what I expected at all but I loved it. I didn't want to say anything about the story itself because you need to play it.",
            "review_score": "1"
        },
        {
            "review_text": "This game... Is weird. The good weird. I mean it gets frustrating at times but fun at others. It references a heck load of stuff. Anime, movies, songs, other games... Most aren't as obvious as others like the Den Den Mushi from One Piece or   the Amnesia like gameplay  . The puzzles are actually quite clever actually. The best part is the voice acting. The timing is amazing. Usually in games you have that voice acting style where the characters have turns and don't interupt each other, but in this game there is much more realistic dialogues while still being clear.  That in mind I had some issues trying to understand some of the dialogue. The main character tends to mumble and sometimes that is vital information for progression.   This game succeeds in what it set out to do. MIND F***. Actually even better than Stanley Parable. And that for a Free game. I did not get the story though. I mean I know what happened, but I did not get the end much. Was a bit weird. Then again what wasn't xDD  I did have a problem with the achievements. I should have gotten some of the progression ones but for now only the very first hidden achievement popped.",
            "review_score": "1"
        },
        {
            "review_text": "good game, with interesting ideas behind it. My only issue is that on my system there is a fairly significant frame rate drop from playing the game. don't know if its the game itself or my pc",
            "review_score": "1"
        },
        {
            "review_text": "SPOILERS!!!!!!!!!  Meh ok, the fact that the end was really confusing and what the purpose of all that ♥♥♥♥ was with the drugs and sam being his sister . it was just really confusing and i excpected a better ending",
            "review_score": "1"
        },
        {
            "review_text": "Very decent beautifully detailed puzzle game with some twists. Love games that require a little bit of thinking to overcome challenges. Would Definitely recommend to any gamer that loves logic based puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "If you like a game that makes you feel like you are tripping balls and in the end makes no sense then this game is totally for you :)",
            "review_score": "1"
        },
        {
            "review_text": "Wow. I loved this game. Really weird and confusing, but thought-provoking.",
            "review_score": "1"
        },
        {
            "review_text": "It's a very good game, and shocked to see that it's free. It's that good.",
            "review_score": "1"
        },
        {
            "review_text": "PRETTY CRAPPY GAME WOULD NOT RECOMMEND",
            "review_score": "1"
        },
        {
            "review_text": "I only have but one question: Why is it free? This game has loads of potential and originality and I wish I had have spent a few dollars for it at least.  The game makes you do some critical thinking and some of it is just so plain easy you kind of forget how to think. So some puzzles take longer than others. I highly reccomend this game if you're into dark and mysterious puzzle games (kind of like the first portal imo). I do warn there is a lot of swearing and vulgar conversations, but the dialogue was fairly well throughout the game.   But theres something about the way the camera moves. When there was a lot of screen shaking and rapid movement it made me feel lightly nauseated. I never hade this problem before, but I don't know? Maybe it's just me. lol  Everything but that 9/10 game",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun to play, but frusterating at some points because it messes with your brain. Good game",
            "review_score": "1"
        },
        {
            "review_text": "A fun and interesting little game. The puzzles were clever, the voice acting was decent, and the plot was surreal(although a little muddled). Still, for the low price of free and a few hours of our time, it's a truly fun experience.   And if you like achievements, it won't take you long to get all of them, but neither are they all 'gimme' acheivements.",
            "review_score": "1"
        },
        {
            "review_text": "This game shouldnt be free. When I saw this game was free, like a lot of other people, I was probably like, yeah, sure, why not, its free of course, I dont regret anything playing this. First off, when I got into this, I guess you could see that it wasnt the best looking game, I mean it could have been a lot better in terms or quality, I may be wrong, but you dont have to take my advice on it, just go play it for yourself, the story is, well...♥♥♥♥ed up aha, like I said you should play it for yourself, just stop reading this and play it! you wont regret it.",
            "review_score": "1"
        },
        {
            "review_text": "lol i just got done playing and the only thing i can think is wtf just happend. i highly sujest you play it xD",
            "review_score": "1"
        },
        {
            "review_text": "Don't do drugs, kids. This game is full of puzzles that can take quite a bit of thinking and listening to solve. Keep on your toes, and keep your ears open. It is an interesting concept for a game, as well. It's free, just get it. It only takes like, 1-2 hours to beat.",
            "review_score": "1"
        },
        {
            "review_text": "Nice looking game, but the game is so vague and non-intuitive. I got to the second small puzzle 'find the key' and I can't see it laying out. I don't know how to open drawers and doors, I figured out how to crouch (didn't help me find it), and I felt rushed. If there was a bit of hand holding in the begining to show 'how' to do things, maybe I would give it another try. As of now it has been baleeted and I would not recomend it.",
            "review_score": "-1"
        },
        {
            "review_text": "'Only If' is one of those rare games that'll have you talking with everyone in the house, trying to solve the next puzzle.  With nice visuals (even on my dinosaur Mac) and fairly good voice acting, this is a unique experience that I will most definitely, happily stumble down it's rabbit hole again.  I enjoyed the subtle nuances the game shares with it's player and the juxtaposition of who you are as the player.  A random find on my part, and one I was so glad to have taken the time to play it.   The ending made me laugh, a lot.",
            "review_score": "1"
        },
        {
            "review_text": "The Game Is Very Broken And I Finally Made It Past A Hard Level It Glitched And It Spawned Me Back And I know it did because it took me before my llst checkpoint",
            "review_score": "-1"
        },
        {
            "review_text": "A fever dream first person.... somthing. Kind of like a point-and-click adventure game wearing the skins of several of it's siblings; a little platformer, a little interactive narrative, a little FPS all stitched together with indie thread and thrown on like a kid wearing daddy's trenchcoat. It's certainly atmospheric, it's just not for me. I think I'd have burned out on it even faster had I made the right choice in the parlor and not accidentally skipped the first half of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is a total mind screw, totally play this game if u wanna go WTF every minute u play. great escapist theme...interesting story",
            "review_score": "1"
        },
        {
            "review_text": "i was too stupid to complete.",
            "review_score": "1"
        },
        {
            "review_text": "controls don't work, can't save",
            "review_score": "1"
        },
        {
            "review_text": "if u r looking 4 a fun free indie game that is one of the best in the world then u should play ONLY IF it has everything but WARNING lots of SWEARING so wear headphones it may seem scary but its not that scary even though i havnt finished it but u should go and download this game instantly i mean right now dont even bother reading this just go FREAKING!!!!!! DOWNLOAD IT ",
            "review_score": "1"
        },
        {
            "review_text": "this game is gucchi",
            "review_score": "1"
        },
        {
            "review_text": "A very weird game. Sometimes it's hard to understand the instructions so it can be very frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "81 mins of what the hell.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun game that will not disapoint",
            "review_score": "1"
        },
        {
            "review_text": "I can't understand why some people are rating this game so bad.  I really enjoyed playing it and, for a free game, that's what counts. You too should try it before judging it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game really interesting story line, never played anything like it, whens the next one coming out?",
            "review_score": "1"
        },
        {
            "review_text": "Very odd game. In the same vane as The Seventh Guest or Phantasmagoria. Did I just date myself with those?  Anyway, it's got a good mystery, so I'll keep at it.  It could use some more clarity in some of the things it tells you to do (like pressing Space when climbing out of the water).",
            "review_score": "1"
        },
        {
            "review_text": "I thought the game was interesting, though at times annoying/frustrating. The concept was intriguing enough to keep me playing, however sometimes the puzzles would be glitchy and cause me to restart the level. The puzzles were not too easy and at the same time not too hard. The game gives you little hidden hints throughout the levels you play on to help you through the puzzle but it does not simply give it away. The game ran fairly well except for some glitches that would cause the character to get stuck for a second or would cause certain commands to stay on the screen, which can be annoying. My only problem with the story is that at the end it answered most of the questions I had throughout the game rather than hinting at an ambiguous ending. I think with surreal games like these those kinds of things are best left to the imagination. Overall, though, I would reccommend the game because it keeps you interested, it looks beautiful, it's free, and it doesn't take very long to finish anyway.",
            "review_score": "1"
        },
        {
            "review_text": "'Only If' Only if it was your reality, you think it is at first, then you find out it isn't, It's inception, it's someone playing with your mind, making you question why the heck are you doing these crazy things you end up doing. It shows you you can do things you thought you were not able to, it makes you think what would you do to save someone you care about. Makes you think, wow some day people may end up being able to get in your head, and think these crazy things, make you do things you wouldnt want to do, just to survive, pretty much how the world works sometimes.     I enjoyed this game, I like the whole crazy inception idea, people say how its stupid because there is no storyline, and it goes off into random directions, and makes no sense... IT IS'NT SUPPOSE TO MAKE SENSE, It is like a dream you have lots of dreams, do these dreams have a reason? Does each dream you have relate to the other? No.     It can be a little confusing at times, but it really does give you hints on what you are suppose to do through out the game, which is great, compared to other games I have played where you honestly were not even given a clue to what to do next.    The tricky part of this game is where you need to type, Im not really sure what happens when you take the black pawn, but there is a clue in the room that tells you kinda that you need to type. Just a heads up you wont see what you are typing.    I also like how when it gives you the credits it continues the game play, I thought it was over, but then when the credits came up again flashing up, then back to game it ended up being over, and I was upset to see it end. It was a short game, and I enjoyed that it was a free adventure point&amp;click type of game, you don't really find that.     If you are into these types of game it is worth playing, specially if you enjoy mystery, or mess with your head type of games (but not the scary kind D:)   ~That is all~ Hope it helps. haha :)",
            "review_score": "1"
        },
        {
            "review_text": "To put it out there I played up to the level windmill, and I found the game to be a jumbled mess. The pre-set options let the framerate for my pc to drop tremendously. My Pc is not a low ram craptop, and it still doesn't really work. Hey I don't care about the fact that I was completely lost, it only took me about 2 minutes to glitch out the first room after the black corrador. The camera is realistic but it still makes me feel like a beached whale. It looks like the character was drugged. The voice acting (what little I heard) was on the verge of bad and Ok. The progression from the first scene to the 4th or so was so substansally weird, it seems like they are unrelated. I govern my rating on the fact that most games that are mysterious or maybe psycotic still have to contain some sort of binding factor, It has to add up somehow. The worst part is the fact that a sequal is being created, while the first doesn't have vital options like subtitiles, and some sort of tutorial based off of somthing. I mean I like puzzle games and all sorts of brain benders, but completely unrelated items giving you an unsuspecting key... What the Heck, breaking all physical laws, which would make sense, if were a dream... You need some exposition, besides waking up in a bed looking at a very conspictuous anime picture. The camera like I said is just plain disorenting, I couldn't even play more than half an hour. I have a feeling this is what being on drugs is like.   Pros:  Tells people the damaging effects of alcohol in parties 'Beautful' Graphics  Gives kids a reason to pitty those who do take drugs The dissorientation causes nausia in most people and Animals (try it on who you hate) Puzzles make you think outside the box (quite litterally, on the first level I was able to collide with some many things I broke the non-colliding ceiling) and lauched outside the box of walls no more need for expressionistc art to confuse you, this does the trick No DLC (thank goodness) No Pay2win (oh wait you don't win either way, oh yes  So overall 4.5/10 I can't recommend it but Its not the worst game  One month later: wow, no changes to this broken game... Explination: a sequel like I said before fix your game before you make a sequel, I had to turn my graphics down to 'good' to accually not have lag durring windmil... still haven't beat that level. apparently the developer thought oh the player is in a lake, so let's seemingly strap an squid to his head to make his vision go black randomly and spam E and space to punch it and tell it to stop squirting ink in his face.   What the heck Developer, New score 1.2/10 can't even play it, its so bad (half the objects are of no mass, puzzles are unlogical and require a spamming of E to acually get the object. The voice acting is so terrible from what I heard, I can't bear listening so I turn off the volume.   the game is broken and definatly not inCredable",
            "review_score": "-1"
        },
        {
            "review_text": "10/10  Hurts my head",
            "review_score": "1"
        },
        {
            "review_text": "This game, entirely, is a wonderful work of art. The surreal feeling and atmosphere you get when you start off in this mystical world is unmatched and stupifying. The weird and fantastic that you have to go through to get to the end brings a feeling that reminds me of Avatar's environments, and Inception's genius curiosity to the 'rules' of life..which are bent frequently. Without ruining the game for you, that's all I can say. My suggestion? Don't play in front of your kids...but play it. Play it to it's entirety, and love it.  My compliments to the writers, and the music orchestrator, Steven O'Brien for their fantastic and very enjoyable work. I look forward to seeing what you can do, guys. Keep on playing.  9.6/10  -'Epic'",
            "review_score": "1"
        },
        {
            "review_text": "I hope there's a subtitle..",
            "review_score": "1"
        },
        {
            "review_text": "For a free game this is very interesting, I didnt quite understand it at first but then I got it and played through it some more. Achievements don't activate when you earn then however, I only have achieved one, not sure if I was stupid or the game glitched but I got stuck in the Park after making the fountain.  Good but a bit of a fixer upper.",
            "review_score": "1"
        },
        {
            "review_text": "Only played for a short time but it is a new favorite. Original and refreshing with the price tag of free. Gotta love it!",
            "review_score": "1"
        },
        {
            "review_text": "Fancy graphics, but truckload of bugs, glitching items and annoyances. 'Press [SPACE]' or 'Smash [SPACE] like its C64 all again' ? I'm not sure what this is, can't recommend but hey, it is free.",
            "review_score": "-1"
        },
        {
            "review_text": "'Only if' you have a lot of time you want to wast in your life then go play this game, otherwise it is not recommend. Puzzle game? I don't think so, misleading player yes.   Example: radio say glue your eye to the clock and find the key in one minute. I thought the key in the clock so I do what it say but no matter how you see the clock you can find it, it turn out the key is somewhere else in the room but the ♥♥♥♥ing clock and you don't find the key in one minute you have to startover.   ♥♥♥♥ ♥♥♥♥♥♥ game it is not puzzle just mess you up. I don't believe this is a proper game design. If it is a puzzle game you have to give clue to player and let player figure it out and this is the spirit of puzzle game. The room for instance.  Game is design to challenge player and player enjoy the successful not treating player as stupid and fooling around.   Last how the ♥♥♥♥ to save this game? you have button 'Continue' and when i click it the game display what is the last place you visited? in there I can only press space to go back main menu, beside that in-game menu does not have option to save the game progress or game does not auto save. Really, is this some kind of ♥♥♥♥ to mess around player again? only thing i can do is restart from the very begining.  In short ♥♥♥♥ this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is another phenominal game. There are occasional lighting glitches, and some of the textures are stock, but this really does not detract from gameplay. There are some points where you just don't know what to do, however, if you listen closely, and think about it, it is a really entertaining and easy game. The story has a great twist, and I have yet to finish the second half of the game, however, after playing the White Pawn scenerio, I was extremely pleased with the game, and the ending. I can't wait to discover what else Creability is working on. I am extremely upset that I did not know about the beta, and I would be more than willing to pay for this game.  This is a phenominal game. Play it and see for yourself!",
            "review_score": "1"
        },
        {
            "review_text": "First Time playing 'Only If' was very fun and long (if you got stuck) game ,that shows you a story of a guy named Anthony and, his crazy adventures after a party. Not much else can be said for spoilers. My rating of 'Only If' whould be a 4.5 out of 5, only thing i would change was adding a sound option so you can turn down the music and, increase the voice's since dialouge is a major part of the game.",
            "review_score": "1"
        },
        {
            "review_text": "there are no words in the english language to describe how crazy this game is. no matter what kind of videogame genre you prefer, this game will blow your mind. 11/3",
            "review_score": "1"
        },
        {
            "review_text": "WHHHHHHHAAAAAAAAAATT TTTTTTTTTTTHHHHHHHHHHEEEEEEEEEE AAACTUALLL FUUUUUUUUUUCKKK???!!!",
            "review_score": "1"
        },
        {
            "review_text": "Mind and perception bending. Puzzles are difficult, but not unsolvable. Only downside is that voices are a bit difficult to hear, and no subtitles. Other than that, great game.",
            "review_score": "1"
        },
        {
            "review_text": "For anyone out there who is interested in playing this I should warn you that this is without a doubt the most messed up game ever. I think for fans who like Cry of Fear and Amnesia will probably find this to be entertaining and similar in terms of a good story and puzzels. One last thing, when you do quit the game you have to take note of what room your in because when you go back on you have to type it in on the link that says 'space to continue'. Overall this is probably one the best short indie games I've played in a while, good story to it, great puzzels and a good visuals to the game as well, if there be one thing I would change, less swearing and perhaps also as to how the saving works.",
            "review_score": "1"
        },
        {
            "review_text": "Great Puzzle game. I would Like to see more games from the developers too",
            "review_score": "1"
        },
        {
            "review_text": "Confused... I Love It... But I Can't Say Anything About The Game Whatsoever... It Would Ruin It... Get It Now...",
            "review_score": "1"
        },
        {
            "review_text": "Very strange and surreal. Unique amongst other games. The story and characters were well thought out. I liked it.",
            "review_score": "1"
        },
        {
            "review_text": "The concept is amazing but the game play reminds me of sega cd and/or point click games. Also, the game glitches out so much when I explore; fell off map several times or squeezed between walls (mostly near blue basket eye area).",
            "review_score": "1"
        },
        {
            "review_text": "'Only If' I knew what was actually going on.   Only If is, at its core, an 'escape the room' game while at the same time deviating from the 'find the item(s), move to next area' model. Its approach is unique, but there is quite a bit of work to be done.   The good: Barring the lack of subtitles to completely understand what's going on, being trapped by the disembodied voice of a maniac was way funnier than it should have been. The dialogue is nonsensical at certain points, but I appreciated the banter between the protagonist and his capturer. As I mentioned earlier, it's not a game where you have to collect an assortment of items and mix and match to move onwards so I appreciated that. Even though it was a bit disorientating sometimes, the surreality of it was also a big plus for me.   The bad: The main issue is the lack of 'game elements'. By this I mean that the game is played solely by ear, so to speak. There are a few instructions, like c to crouch and shift to run, but other than that you have to figure out the rest on your own. While experimenting is fun in and of itself, it is a little frustrating when you have to utterly guess at what to do next. One instance is the fact that at certain points in the game, you must type out an answer but there is no indication anywhere that keystrokes are being registered and recognized as a 'typed answer'. The platforming level is unintuitive.   There are other things I forgot to note as I played the game, but these were all the glaring pros and cons in my eyes.  I am actually glad I played this, but I wouldn't forward it to my friends as it's a bit, 'out there'? However, for a gamer looking for something different, then you found it.",
            "review_score": "1"
        },
        {
            "review_text": "Good game with an unexpected, incredible ending. Too bad the developers have no way of recieving support, as this game was free.",
            "review_score": "1"
        },
        {
            "review_text": "For people who thought the Stanley Parabole made too much sense...",
            "review_score": "1"
        },
        {
            "review_text": "Below average. Its a good idea and I like the concept and all that but I never have a clue what I'm meant to be doing",
            "review_score": "-1"
        },
        {
            "review_text": "i would deffinantly recommend playing this game. it is amazing i love it&lt;3 8/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, keeps you interested in the story like a movie or book. At the same time, it involves you playing as the character to solve puzzles with a lot of challenge. Very very good for a free game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game.. Very challenging puzzles..But that ending though... It was really messed up.. But good job on the game I loved it..",
            "review_score": "1"
        },
        {
            "review_text": "WHHHHHHHAAAAAAAAAATT TTTTTTTTTTTHHHHHHHHHHEEEEEEEEEE AAACTUALLL FUUUUUUUUUUCKKK???!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a combination of adventure, puzzle, and simulation games it puts you in the shoes of a guy who is locked iin a house after a huge party. As a mysterious voice guides you through the house, good luck to getting out. If you like a good mystery, You'll love 'Only If'.",
            "review_score": "1"
        },
        {
            "review_text": "I only played for a while, but compared to many early access games this was pretty complete in its feeling. Ofcourse once again ypou are alone, only with voice audio to guide you but...well...even if the puzzles were illogical and vague I had a good time. For free, definately worth the try.",
            "review_score": "1"
        },
        {
            "review_text": "Stick with this game, some parts was a little difficult to find the way out but if you stick with it, youll be rewarded! the plotwists are amazing &amp; the story is 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "Great game (If you are immune to cursing and jumpscares :P) some puzzles are very very hard, but it feels great to finish.",
            "review_score": "1"
        },
        {
            "review_text": "If it stays free, get it. If you have to pay--forget about it. Trust me.",
            "review_score": "1"
        },
        {
            "review_text": "It is strange and stimulating for your mind! Try and figure it out! I double dog dare you! Doubt you can!!",
            "review_score": "1"
        },
        {
            "review_text": "very interesting. love puzzles ^^",
            "review_score": "1"
        },
        {
            "review_text": "I would say this is a gppd game besides the swearing I love how it can be scary but also be happy in one blink",
            "review_score": "1"
        },
        {
            "review_text": "What the f***.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "i like the puzzles and what not in the game, but if you rage at games in any way.. this is not the game for you.  - game gives you the wrong instructions on screen.. [press E] i press e, i still get put back to the start of the level ( i was supposed to hold or mash the E key.. still not sure)   - at random points for no reason i failed the mission and was put back to the start of the level ( EXTREMELY FRUSTRATING )   - sound levels in the game are shocking. Very loud background noise overshadowing the players voices(which are supposed to give clues.. )   If all of these things were fixed i would definitely recommend the game. but it is free so........",
            "review_score": "-1"
        },
        {
            "review_text": "this game ♥♥♥♥ing sucks ♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "So entertaining felt like it needed to coninue more and more like i didnt want it to end",
            "review_score": "1"
        },
        {
            "review_text": "I like the idea of what they're *trying* to do, but it doesn't quite work. A game like this, which wants to be a more cerebral experience, really demands a silent soundtrack with no voice acting. 'Show' is more important than 'tell' in a case like this. Still, it's a promising start for the first-time developer, so I'll be keeping my eyes on them for sure.",
            "review_score": "-1"
        },
        {
            "review_text": "Just the most beautiful puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games i have played. but some of u m8 not like it. its up to prefference",
            "review_score": "1"
        },
        {
            "review_text": "What were the devs smoking when they made this game? 420/69 Best FTP campaign.",
            "review_score": "1"
        },
        {
            "review_text": "For a free to play game Only if is surprisingly good.The levels you enter really fit in with the theme of the game and for a prototype of what is to come it is very good.The story may be a little unclear but the flow of the game helped.Highly recommend giving it ago as has a similar style to stanley parable in some ways. Looking forward to what could be coming in the future.",
            "review_score": "1"
        },
        {
            "review_text": "he asked somethhing about sweet? I don't know what to do",
            "review_score": "1"
        },
        {
            "review_text": "Alright, well, I played this game to see if it would be fun, like any other game, but I will admit, I've spoiled by other games similar to it. Only If doesn't have the same feel to it like, let's say- the Stanley Parable, and I completely understand that they weren't going for a similar feel or gameplay even. But, they left out things that made the Stanley Parable fun.  Firstly, I feel like the motion is very very hard to watch. I'm usually really good with fast pace games- heck, I play first person shooters all the time. This game, however, made me feel like I was running in slow motion in a dream where I can't really tell what is going on. Which, again, is part of the point, but it was annoying at times. ESPECIALLY the cutscenes. And- half of the time, I wasn't sure if I was still in a cutscene or I was given control of the keys again. Now, the imagery in the game is actually very pretty. I like how the rooms and environment look. Unfortunately though, due to the movement, everytime I move my mouse, I get a sense of motion sickness and can't really see what I'm looking at. It makes parts where you're supposed to be quick about your actions seem like a blur and much more difficult than they need to be. Secondly, the sound needs to be improved. I had my volume at around medium and I still couldn't hear what the protagonist was saying sometimes. He mumbled a lot, which just bothered me a little. Though, I will give the voice actor credit, because I don't think that was his fault, but the game's sound volumes. Like- the 'antagonist' also is hard to hear sometimes, mainly because you must be right next to him to hear him. When looking around a room and being directed by his voice, it means that I have to stand perfectly still next to him until he's done speaking, or I'm going to miss something.  Thirdly, I just didn't like the quick-time events. I know some people find them more interactive in a game, but God, I couldn't stand it. It makes your vision much much more blurry (which I understand is supposed to make you disoriented, but given that I can't move normally without somewhat blurry vision to begin with...) and while you're walking it expects you to repeatedly click one button or else you die. And you have to restart from when the chapter began. I don't like having to restart a quick-time event because of me messing up another.  Oh and can we have the chapters start at gameplay, not cutscenes? If we were given the code to start again, it should mean that we've seen the beginning cutscene already. So, anyway, Only If is a game that has some technical flaws and so far I'm a not huge fan of it, but I can see where they were going with it. The storyline has... what I'll call potential, the acting is decent enough fo the game, and the environment is made actually surprisingly well. It's still a brand new game, but it needs a lot of work.  'In Only If, you will fail a lot, you will die a lot, and you will undoubtedly be confused. ' You sure got that right, game. But I don't like dying over and over and getting confused when trying to do the most basic of tasks. The first few minutes of the game shouldn't make my eyes hurt. Just saying. Oh- which is why I couldn't play more than 20 minutes by the way.  I wish I had been able to keep playing too, because it sounds like Only If might have a better storyline near the middle and end, but if I can't get into a game in the beginning because of simple game mechanics, I just can't. But, if you like this game, good for you. I can see why you might enjoy it, I guess? For me, however, I've played better games with a similar type gameplay. And this just doesn't compare at all. So, I won't recommend this, sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting story, challenging and worth finishing, the end was great.",
            "review_score": "1"
        },
        {
            "review_text": "Achievements did not work. I mean, crouch into fireplace is not something you can fail at. Also no subtitles. But it's free, yeah.",
            "review_score": "-1"
        },
        {
            "review_text": "Although visually stunning, this game lacks a lot of key elements. The controls are shifty/tricky, the gameplay is inconsistent and the dialogue is choppy in some places. The voice actors didn't have a lot to work with, so it suffers there as well. I had to quit playing about 30 minutes in because the deaths were so frustrating, as there is no rhyme or reason when avoiding them in the fire/forest scenes. Fix these problems and you'll have a fantastic game on your hands.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun game. Though I always die on the Windmill scenario.. no one told me to look back. I actually just finished it today, and I'm glad I did! Wonderful game, I like it, and... It's free! 10/10. haha  (I still don't understand why I didn't get the White and Black pawn achievenemts.. does it not count if I quit then continue?)",
            "review_score": "1"
        },
        {
            "review_text": "This game is really good, for a free to play. Graphics look good. I was able to run this game on my OK machine. I have 16GB ram, Nvidia 620GT, I7 Processor, and running windows 8.1. You could definitely compIete this game in one sitting. It only took me 4.5 hours. Almost no replay value. The story is a little bit hard to follow but it does make sense once you complete the game. Overall I would give this this game a 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "dark storyline so i reccomend it for that but very simple",
            "review_score": "1"
        },
        {
            "review_text": "This is an absolutely amazing and beautiful game, really funny, interesting, sometimes hard but that's why you have the internet. I recommend it to everyone who's interested in (Not Horror) Indie games.",
            "review_score": "1"
        },
        {
            "review_text": "I love how this game is made. Very quality work. I would reccomend it to all. :D",
            "review_score": "1"
        },
        {
            "review_text": "I honestly couldn't play for more than 30 minutes. It's confuse, messy and unclear. Maybe when it further progress on development it may get better. ",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoyed it, and it had some good tunes in it too... I love this 'vinny' character, so yeah thats pretty neat. Challenging, yet not impossible obstacles, that if you play through very quickly, take 1-2 hours to beat. Its also pretty nice, when you get achievments, lol.  Overall i rate it a 9/10 I really enjoyed it, and i'm looking forward to a new similar release if any by Creability. WTF at the ending tho  By the way!  Who rates it a 36 or whatever out of 100... Those guys are pretty freaking stupid, this game's awesome. ♥♥♥♥ Metacritic...",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't played this game... Do it... Now.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable game. There's a good bit of cussing and the acting can be a little wonky, but other than that, this game delivers a perfectly unique and odd 2 hour adventure that will leave you lauging the whole way. ... Although there is one thing that's kinda BS about it. *POSSIBLE SPOILERS?* near the beginning of the game you are given a choice that sends you down path A or B. i thought since i did A and got to the end that path B would have a different ending. I was wrong. Path B leads you right back to do Path A. which pisses me off cause playing part A first then doing B and finding out i had to do A again??? UH UH. no. thats just BS.   And while have taken most of this review complaining about BS choices, play the game, its hilarious, unless your easily offended because there is some cussing and other stuff, but it is such a unique 2 hour free adventure.   Check it out guys.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "If you are a linux user, I would wait until fixes are placed. when I played, my character was stuck looking up at the ceiling without me able to do anything about it. this rendered the game unplayable. as it turns out, many other linux users have reported this exact same problem in the steam forum for this game.",
            "review_score": "-1"
        },
        {
            "review_text": "i loved the game it was confusing IN A GOOD WAY but sometimes you go like wat the fuq i mean it was very confusing ",
            "review_score": "1"
        },
        {
            "review_text": "A first-person puzzle game with charm for days. Absolutely recommended.  In this game you're apparently some kid who attended a friend's party and got WASTED and woke up on the friend's bed, but once you open that bedroom door, you'll question whether or not what you're seeing is real. I won't spoil the ending, but I will say that it's not at all what you would expect. AT ALL. Also, lots of swearing, so be mindful of that.  The puzzles are great, well thought out and never too hard for ya. The voice acting can vary between excellent and decent, but mostly excellent. Vinny is a great character. Great platforming segment by the middle, but the last level had me wanting more.  This game is somewhere along the same lines of The Stanley Parable, but much shorter. Yes, the length can be a bummer, but hey, it's a free game, so I'm not complaining. It's also multiplatform, so you have no excuse not to play this.  9/10 - Must Play!",
            "review_score": "1"
        },
        {
            "review_text": "The krautrock of games  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Well nothing happened past the fountain after I sacraficed myself about 3 maps before the park. So I guess I beat it.",
            "review_score": "1"
        },
        {
            "review_text": "Only if...I didnt try this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Only if    im lost for words on how great this story  for a free game i would have easly paid for this off the shelfs of a store  so the setting is  you play as this guy Adrian and your heading to a party your 'good' friend Sam is throwing, only to get that drunk you passed out and wake up in a random room unsure of were you are.  you head for a door only open it and find darkness dragging you in...  along your path you come across Vince a deranged psychopath that talks to you through a radio about how he would like to 'correct you and your ways'  this game is a mster peice, it's not easy, its not kind and nice. its a trip and a fun one at that  if you get an hour or two play it your not wasting your time at all",
            "review_score": "1"
        },
        {
            "review_text": "Great idea, flawed execution.  Let me start with the pros: I love the characters, even Vinny, who I only briefly grew tired of and then loved again.  Cons: Couldn't even finish the game because one path was buggy, and the other was unclear as to what to do.  One path appears to be a quicktime event, but another review leads me to believe that this isn't true, despite what the game tells you. This may be why I couldn't finish it, and eventually quit after being booted to the beginning of the level seven times.  The other path is a puzzle of sorts, but I'm not sure what the answer is. What the radioman says changes after the first time you play the level, and there are also party supplies that disappear when you go into a sideroom. I'm about to look up what the answer to this 'puzzle' is, because everything that seems like the correct answer is either wrong, or just not being inputted correctly (the game fails to say whether you're on the right path - I assume I'm supposed to type the answers in, but there's no indication if this is right or not).  In Only If, you will fail a lot, you will die a lot, and it will not be your fault.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a game that requires alot of thinking and observing can get very annoying (well for many people). If you want a game that wastes your precious steam time, then go right ahead, and even better.... its free! So have fun with hours of mind crushing nonsense!",
            "review_score": "-1"
        },
        {
            "review_text": "Got stuck on a level. 10/10 will get stuck again.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "What a game. Probably the most ♥♥♥♥ed up I've ever played. It looks like a weird game, though there are some interesting plot twist and the ending is really wtf-ish. Really enjoyed this one, funny puzzles, some hard to understand, will entertain you for a few hours. Only cons: achievements are somewhat buggy, sometimes they won't unlock - for instance, the white/black pawn achievements I couldn't unlock, even though I completed the whole story a few times.  Also, this is probably the game in which the word '♥♥♥♥' is used most times. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "way too hard and fast, even for my sibling who is very skilled at video games. the graphics are gorgeous, the story seems interesting, though the dialogue of the characters sounds like an annoying, vulgar 12 year old boy. i love story-rich games and I want to like this game but it is basically unplayable because it has too many command too fast.",
            "review_score": "-1"
        },
        {
            "review_text": "Well...this game is really heady. I loved it. Totally worth a playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "A game with good intentions yet utterly unplayable. Unclear goals, repeated death sequences, and laughably bad voice acting ultimately make this a ♥♥♥♥ing joke of a broken experience. Not a game, a game would be playable, this is an experience, and a bad one at that.  Also it's just ♥♥♥♥ing unforgivably bad with QTEs. I've seen ant farms with less bugs.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is soo amazing! PLZ MAKE ANOTHER! I WOULD PROB PAY MONEY IF DEY MADE ANDOTHER, and a strage way on how to play this game is for u and a friend to both play it and if u encounter somthing try doing what they do diffrently (if u can) i did it with my friend and it helped both of us! (hope u like stupid this game HAS TONS!)",
            "review_score": "1"
        },
        {
            "review_text": "fun game very good looking and funny its kinda all over the place sometimes though. ",
            "review_score": "1"
        },
        {
            "review_text": "This game, this, ♥♥♥♥ing, game! Its not even complete. Its terribly optimized, and in certain parts, it plays like a slideshow, but I'm getting ahead of myself. The first few rooms of the game are enjoyable. Yes, things spawn like keys, doors, and mirrors, but it added to the experience in a positive matter, its a weird mystery where you walk through a room and suddenly the room that was behind you is a solid wall. Vinny, the voice you hear, is an interesting antagonist, at least until he starts whining and acting paranoid (also, canoles? Alright, we get it, he's Italian). Right after the pawn 'puzzle' (seriously, how was that even a challenge?) you are taken out of the house/mansion and the game takes a weird turn. Suddenly you're outside and are being plagued by tons of button prompts (I get that you're trying to immerse the player in the environment by crippling them just as the Protaganist is injured, but there has to be a better when as soon as I get to 3 spawning shadows, I can never get past them (unless they glitch out and then I die instead of just respawning). I would've liked to stay in the rooms, where my FPS didn't take such a sudden dip.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty well done for a free indie game. Difficult with just enough mindfu*king throughout. The controls are a bit lacking, and because of that I still haven't been able to pass windmill. A strong 7/10",
            "review_score": "1"
        },
        {
            "review_text": "I really, really, really loved this game. It twisted reality in my head while I was playing, made me doubt myself and rethink everything and there's not a lot of games that are able to do this. The grapics are amazing, the voice acting is pretty good and it's got an interesting story.   I died a few times, but it was because I was confused. You don't have to be confused if you pay attention to your surroundings and understand what's going on.   If you're looking for something to make you think differently, then Only If is definitely a game you should consider playing.",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting game. It should have been longer, but hey it was free. I didn't experience that much glitchy game play as much as I experenced problems with the game cache to get the achiecements.   I would recommend this game. It's a little different and that's great! Sure it has some bugs, but again, I found the game play to be acceptable.  Give it ago!",
            "review_score": "1"
        },
        {
            "review_text": "boring, couldnt understand the storyline, the narrator vol is too low. could'nt get the the settings.",
            "review_score": "-1"
        },
        {
            "review_text": "Only if...I didnt try this game.",
            "review_score": "-1"
        },
        {
            "review_text": "You shoot vases that turn into cupboards in purgatory and shove your face into a trashcan to upgrade your revolver into a tommy gun. Then it turns out you had sex with your sister. I just skipped most of the game by typing 'ending' on the password screen. There's no deep meaning behind it all, it's just a waste of time",
            "review_score": "-1"
        },
        {
            "review_text": "hate it",
            "review_score": "-1"
        },
        {
            "review_text": "I hoped to be able to play something somewhere between Portal and The Stanley Parable, two games that I loved deeply. But 'Only If' can't be compared to them in any way.  'Only If' personify mediocrity, and for all I've heard and read, the only feeling it can give a player expecting a semblance of quality in gameplay or in plot is a raw disappointement. 'Only If' is tedious to play, even with a simple walk-through to actually explain what the game expected of me.   I didn't stop after the three first levels because the game was too hard a challenge, but because there was simply no point in going on. So I used the keywords to skip annoying levels, which turned out to be each single oneI would advise to check the ending with the eponimous keyword if you quickly want to get an idea of the plot. Because there isn't that much to spoil anyway, and it may save you precious minutes of your life which you could use to replay the Staneley Parable, Portal, Quantum Condrum, Q.U.B.E., or even Vitrium.  I am not sure whether 'Only If' is still in beta—that would explain why there are no option menu at all to toogle sound or fullscreen while in a run. I'm not going to criticuze the absence of proper save/load system, since the keywords system is the only think that allowed me to keep sane by skipping the lousy parts until the end to get an opinion on the game as a whole.   The good things : nothing to pay, decent graphics, good audio quality.   Now, the painful : - Loud, lousy, long-winded dialgues.  - A lot of profanity that doesn't add anything to the characters or experience.  - The concepts of subtelty, clevernes or finesse are zeroing from the very beginning to the ending. - And that means that metaphors and symbolism are touched awkwardly, and most things are pointlessly surrealist. - A loose plot-line with, in the role of the evil mastermind, a burlesque antagonist who show the IQ of a clamp and thinks his simplistic and heavy kind of humour very clever. - A pace that tries to be original, and just gives the feeling to be testing something in alpha stage.  - The Gameplay of a repetitive, nebulous, bleak thriller. - To my surprise, I found the ending even worse than the game iself. Especially the pace. The way they handled the music in an attempt to create humor with the /final revelation/ is as exasperating as a bad movie blockbuster.  Conclusion : I must admit that I have played worse games than 'Only If' here, still, I can't help but feel like I've wasted more marbles on it than what it was worth.",
            "review_score": "-1"
        },
        {
            "review_text": "My minds full of ♥♥♥♥. Also the jumping parkour with the pillars and pots made me rage. 7.8/10-IGN",
            "review_score": "1"
        },
        {
            "review_text": "Not bad. It feels like someone's college project, but that isn't always a bad thing. It's creative, mind-bending, artsy, and interesting. It's quick. Worth a run.",
            "review_score": "1"
        },
        {
            "review_text": "just started playing and i love it.....the opening has an almost silent hill twist.....",
            "review_score": "1"
        },
        {
            "review_text": "This game got horrible reviews by other websites, but honestly, this is probably one of the most creative games I have ever played. The story is great, along with the characters, it actaully makes you feel like the person you play as in this surreal world.  btw incest  10/10 would wincest again",
            "review_score": "1"
        },
        {
            "review_text": "'Only If' is a game that ♥♥♥♥s a little bit with your head then, ♥♥♥♥s your sister and then your dog, in this particular order.  But I had fun with it. It is something that I don't see quite often, well maybe that's because I life in a dark cave 6 feet under the surface of earth...",
            "review_score": "1"
        },
        {
            "review_text": "Now Only If is a free-to-play eight minute demo that is a surreal first-person puzzle with some platformer elements that puts you in role of Anthony Clyde who after a heavy night of partying at his female companion’s house by the name of Sam he passes out. When he comes to he has no memory of the previous night all Anthony knows is that he needs to find Sam. Upon his search Anthony comes across a voice on a radio that introduces himself as Vinnie who clearly has it in for the protagonist to point he wants to keep him in the world he created. And as far as antagonist Vinnie goes the best way to describe him as a twisted version of Jekyll and Hyde type personality.  The world in general in only if likes to trick and toy with you in the environment by implementing riddles, puzzles, choices, observation or combination, while at certain times dealing with obstacles in the environment itself in order to progress which this games does this very well in both creativity and difficulty. Also the world itself changes as you progress which some of these changes can be settle while other changes can be extreme which result in some trippy moments that will make you wonder all until the end (Is what the protagonist experiencing and hearing is real? Is it in his head? Is he dreaming? Is he even alive?). Lastly the world in only if doesn’t follow any type of rules especially when it comes to which path/choice is right or wrong (right path/choice = wrong and the wrong path/choice = right, and vice versa.) Now there is something I should point out here the path/choices are kind of on the linear side and don't really have a impact on the ending which is a little bit on the disappointing side.  Philosophe/Dialogue – Now the game takes in a mixture of serious believable philosophical quotes in the form text, while at the same time adding entertaining is the best way to describe it which comes from…you guess it Vinnie. The reason this is a strength in only if because not only how it’s set up but also how entertaining and funny hear the dialogue between Anthony and Vinnie, especially Vinnie.  Keyword Typing – Another thing that stood out was this particular feature both in the menu and the main game. Now how this feature works is by you having to type a word or phrase in order to continue from the level you left off which works fine (note: No need for spacing or upper case letters as far as I can tell. And providing you remember or wright down the name of the level.) While keyword typing in only if is interesting and unique idea and I would like to see this feature put into the full game, however I didn’t enjoyed this feature as much that I wanted to which part of the problem is that the even though I typed the correct word in the game wouldn’t register what I typed in which forced me to type the same word multiple times just to progress (thankfully though there is not to many of these in the game/demo).  Replay ability-Now there is some form of replay ability for a game like this in terms of achievements.  Ending - In my opinion the ending seems disconnected from the game itself, however does remind me of one of those hilarious/awkward/what?! punch line moments you find in certain movies.  In generally I really enjoyed my time playing 'Only If' and I recommend anyone at least give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game for a total of probably 30 minutes. I can honestly say no, just no. People talk about the visual graphics in the game as if they're something to be praised, well they're not and you're mistaken. They put no time or effort into it. People comment on how the story is so engaging, I felt like the first impression I got was 'Hey man, are you here for a story that will grab your attention? Well keep on looking because we have no idea wtf we're doing here and we had a 5 year old write out the plot for you' The game is linear, as well as poorly constructed. It's a clicking simulator, and provides no objection what so ever. Sure I'll press [space] and [e] for 3 million years and finally realize that I'm supposed to be progressing forward. I guess the point of the game is to...  1. Install. 2. Play for a grand total of 20-30 minutes.  3. Uninstall. 4. Try to find something better.   I thought this game was going to be somewhat similar to Stanley's Parabole but no. It's nothing but a huge waste of time.   0/10 Would not recommend to an autistic hippo.  Stupid.",
            "review_score": "-1"
        },
        {
            "review_text": "Ya know... I don't see too much of a point in trying to be extremely critical of this game. I enjoyed it personally! I love surrelistic weird shiz. The voice acting is pretty good, the humor is good, the scenery and environments were really quite stunning, and the twists are interesting. For a free to play game that does not take that long to complete, why not? If you dont like it... well its not like you paid anything for it. For me it was a fun afternoon playthrough to talk about with my friends. Simple as that.   Id avoid playing on LSD, Shrooms or anything like that.... or would I? x_x",
            "review_score": "1"
        },
        {
            "review_text": "This game was hilarious, rage-inducing, and very very beautiful, the graphics of this game were amazing, but the story was better, the White Pawn Ending was the weirdest ending to a video game I have ever seen. Although the ending was really messed up, I would definitely recommend this game for anytime. The only bad thing is you can't really separate the game into parts, so I wouldn't recommend doing this game for YouTube.",
            "review_score": "1"
        },
        {
            "review_text": "Let me start off by saying this, Only If is a fantastic game.  The game only took me a little over a hour to beat, but its free so i wasnt expecting it to be long at all. The game is free so that is a huge plus, i have to admit i wouldnt mind paying a few bucks for this game (it was that good)  The puzzles are somewhat easy to figure out but also require some thinking through and it may take you more than one try to finally get it right.  But, The best part about this game, is the ending. The ending is fantastic. I literally rolled back in my chair and laughed for a while XD  Overall this is a great game and i highly recommend it",
            "review_score": "1"
        },
        {
            "review_text": "Vinnie was the best part of Only If; he seemed to come straight out of Borderlands and his mad cackling was a delight. That was the only part of the game that actually felt interesting or surreal. I REALLY wish 5.1 sound had been used, though. The dumb Bro you play would have been better off subtitled than voiced, and it wouldn't have killed the dev to at least give you some feet. Pants too, maybe, unless it's king of no pants day.  So one of the only things I hate more than not letting you change controls is giving an option to change controls, and then completely ignoring it. Not including half of the buttons it uses counts against the game too, but it doesn't matter anyway. I hated the controls but tried to get through for the game's sake.  The graphics are there, I guess. A few scenes are quite well done, most are just phoned in to get the job done, but it's enough for an indie.  The plot and puzzles suck. I just gave up after a while, the game didn't actually have puzzles so much as it just keeps ♥♥♥♥ing with you until you get sick of it, especially when it makes you repeat tedious levels over. and over. and over. And when it ran out of puzzles, it turned to first-person platforming, that was a facepalm. The plot is just, 'dude, wait, what?' repeated, it never seems to go anywhere. I'd like to see the ending, but I'll probably just watch someone else suffer for it on Youtube.  I could deal with a thin plot to string together good gameplay, or bad gameplay for a great story, but I didn't see either.  Good ideas though, I hope someone else does something great with them.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has a lt of humour in it but it is also very serious at some points. It is challenging at times as well.",
            "review_score": "1"
        },
        {
            "review_text": "There are no Hints on any puzzles, barely made one that has the 2 doors that are synced, gave me killer headache, and, but if you actually look at a guide to the game, I would recommend the game because it has a weird story line, so just try it, no wonder it's free, it's free because of the plot twist at the end and the random things that happen in the game.",
            "review_score": "1"
        },
        {
            "review_text": "Take the Black pawn!   First I hated it then I loved it. Disjointed and weird in the best ways, this is a strange mental journey that'll keep you wanting more. Can't beat it for the price!",
            "review_score": "1"
        },
        {
            "review_text": "No invert mouse =&gt; unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was frustrating. Without help from a guide, I wouldn't have gotten as far as I did. Action (jump) oddly difficult to use. The graphics were par.",
            "review_score": "-1"
        },
        {
            "review_text": "A first-person puzzler, whose challenge lies only in the vagueness of the string of clues. This isn't inherently a bad thing, but there are no intuitive 'building block' puzzles to give you a line of logic to follow or introduce you to new concepts. The game looks fine, with a decent amount of detail though the environments are never particularly big. What really tested my patience, even moreso than the unguided stumbling around, were the attempts at comedy which fall flat every single time. I've never experienced characters so minimal yet so annoying. Better voice actors wouldn't have helped. I got the game for free, and while I don't regret the time spent, I would never have paid money for it.",
            "review_score": "-1"
        },
        {
            "review_text": "It took less than 7 minutes to make me motion sick. I don't know if this is a good game or not, but the camera waves around like crazy and it has bad voice acting.",
            "review_score": "-1"
        },
        {
            "review_text": "not a very good story line. potentially a good game though",
            "review_score": "-1"
        },
        {
            "review_text": "Stupid stupid game. Looking through online walk throughs, most of the 'tasks' that are needed don't jump out at you during play so I was constantly stuck on levels thinking WTF. Avoid!",
            "review_score": "-1"
        },
        {
            "review_text": "Its a good, story rich and atmospheric game. I dont see whats wrong. Most of the negative reviews are people complaining about lack of action gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "- Bad Controls - Bad Level Design pretty but really bad. e.g. can't make a jump very well   + Good Voice Acting &amp; Choice of Music",
            "review_score": "-1"
        },
        {
            "review_text": "I shot a vase and it turned into a china cabinet  10/10 would china cabinet again",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥...",
            "review_score": "-1"
        },
        {
            "review_text": "STUPIDEST ♥♥♥♥ING GAME EVER SHOT A ♥♥♥♥ING MILLION VASES FOR A ♥♥♥♥ING INCEST ENDING I THOUGHT IT WAS THE BEST GAME AT FIRST WHAT A ♥♥♥♥ING WASTE WAIST OF MY LIFE 0/10 ♥♥♥♥ THIS GAME",
            "review_score": "-1"
        },
        {
            "review_text": "The narrator made my day :3",
            "review_score": "1"
        },
        {
            "review_text": "I find this game's love/hate is defined by two groups: people who hate cursing and abstract puzzles with very subtle hints at best, and people who love an undeniably unique atmosphere paired with exceptional vocal performances. Only If plays like the Talos Principle as designed by an OG beatnik. Trapped in an oddly beautiful and deeply psychological universe you're constantly taunted by a foul-mouthed stranger who serves as a powerful and genre-bending contrast to a backdrop of gigantic roman pillars, floating amethysts, antique wardrobes, a gorgeous park, and more vases than a single house should ever contain.  Only If's presentation is a one-of-a-kind experience backed by consistently good voice acting, particularly from the exasperated main character who just wants to get the hell out of there. The puzzles weren't as hard as many of the reviews seem to suggest, provided you take everything your seemingly mad companion says into account. The only time I got really stuck was in the park. Just remember that you can type answers to yes/no questions (with a couple of exceptions).  I've only taken the white pawn path thus far, and I'm definitely going to go for the second one as things evidently change a lot.  If you want a unique dreamlike experience, or the concept of an adult Boondocks style Alice in Wonderland story intrigues you, then go for it. I wasn't disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "amazing graphics, immersive, complex, and challenging. five stars for real.",
            "review_score": "1"
        },
        {
            "review_text": "At the part where you have to tap E, literally im tapping extremely fast and it keeps restarting. im done until this is fixed im not recommending,",
            "review_score": "-1"
        },
        {
            "review_text": "Having fully completed this game, I now would say that the game was a disappointment.   It began on a path of mystery, where the 'Voice' was our main form of exposition and the player needed to solve riddles and puzzles to further digress along the plot. However, as you get into the riddles of the white pawn (save the girl) they become more of a hallucinogen-like drug trip than a fantastical riddle/puzzle. The black pawn scenario (save yourself) reveals more about the plot outside of the riddles, while still giving puzzles and mazes for the player to solve. Although the black pawn scenario goes against most of our human nature in terms of choices, it is the better option for gameplay and plot.    The mechanics of the game are smooth and feel natural when playing. The proportion of objects is normal size, and doen't make the main character seem too small or too big for the world around him.    The idea behind the game is not new. I remember having the same feelings playing this game as I did playing Myst, an older, better and well planned puzzle/riddle game. The only difference with Only If is that I found myself constantly going online for playthroughs and solutions to the puzzles due to poorly designed hints and puzzle design.    The characters were interesting, and made me want to play the game to find out more about their stories, but there is a continuity error in the plot from the White Pawn and the Black Pawn. This needs to be fixed for the players who play the game for the achievements.    The achievements needed to be more vague, due to the fact that I found myself easily accomplishing the tasks neccessary to get them. It felt more like a numb agreement more than a hard earned success.    I hope to see this game developed further due to it's potential, but right now, it is not ready. If you want to play it, go ahead, but I would wait until the game is improved.",
            "review_score": "-1"
        },
        {
            "review_text": "Did this game for the achievements. Still it's a free game. Worth the time to play.",
            "review_score": "1"
        },
        {
            "review_text": "Only If I Could Play Only If XD Jk this game is great :3 a bit of humor and creepiness to",
            "review_score": "1"
        },
        {
            "review_text": "all i have to say is the ending is really unexpected but was a great and funny game 10/10 would ♥♥♥ again",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fun, long puzzle with a lot of funny jokes. I love it. Go play it yourself.",
            "review_score": "1"
        },
        {
            "review_text": "I keep choosing the white pawn andi still get the black pawns death what THE ♥♥♥♥ ",
            "review_score": "-1"
        },
        {
            "review_text": "frustating, levels dont work, headeace warning 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game has absolutely no point, and I was left walking away with more questions than answers. The plot resolves very poorly, and the drama (esp. on the black pawn route) isn't really relevant to the ending and doesn't contribute to the ending at all. I was very disappointed and expected much more considering how the game began.",
            "review_score": "-1"
        },
        {
            "review_text": "At the part where you have to tap E, literally im tapping extremely fast and it keeps restarting. im done until this is fixed im not recommending,",
            "review_score": "-1"
        },
        {
            "review_text": "when people like  Bokchoy () can't review this game in good faith. you know it's a good game..",
            "review_score": "1"
        },
        {
            "review_text": "Confuslingly beautiful. Fourth wall broken so many times that you become 'Anthony'",
            "review_score": "1"
        },
        {
            "review_text": "Kinda really hard to understand and story is unclear. 4/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Great idea, interesting story. Buggy gameplay and ending didn't feel serious enough",
            "review_score": "1"
        },
        {
            "review_text": "The controls suck. The Voice acting is worse then Ride To Hell: Retribution. And don't get me started on the gameplay. 0% out of 100%",
            "review_score": "-1"
        },
        {
            "review_text": "Does this game make you feel what it's like to be on drugs?? One of the more interesting games I have played. It is definitley worth the play. It's crazy how everything just happens",
            "review_score": "1"
        },
        {
            "review_text": "Puzzles are decent- there's a point where you need to make a moral choice, the 'evil' choice is definitely the stronger of the two paths. Towards the end it starts to get weaker, especially the story (which is nigh incomprehensible anyway) but overall a good little puzzle game to kill a few hours.   The voice acting is a bit grating (certain parts are worse than others), so mess with the sound settings until you find it bearable. Warning for bright, flashing and wonky lighting- if you're migraine prone or epileptic, pass on this game.",
            "review_score": "1"
        },
        {
            "review_text": "I think I got it for dirt cheap and for that it was definitely worth it. A nice attempt at creating something different. Only If is kind of like a weird, puzzle game with a tripped out narrative. The puzzles aren't particularly clever, in fact they're a little frustrating at times and it could really have used some subtitles but I had some fun with the game and I appreciate an aspiring game developer trying something out of the ordinary.",
            "review_score": "1"
        },
        {
            "review_text": "nicely done! I hope to see more from this dev ^^",
            "review_score": "1"
        },
        {
            "review_text": "A mind trip. Very Fun. Tense moments and creative puzzles tie together a well made story thatll have you banging your head on your desk or scream 'I knew it!' at the end.",
            "review_score": "1"
        },
        {
            "review_text": "Last I played it, the game design was flawed at best. Arbitrary instructions, leading to puzzles being trial and error.",
            "review_score": "-1"
        },
        {
            "review_text": "  This game was very trippy. But so much fun. Lots of puzzles to work through. Great ending.",
            "review_score": "1"
        },
        {
            "review_text": "A short but fun game.",
            "review_score": "1"
        },
        {
            "review_text": "It really fun and show you the insanity of life",
            "review_score": "1"
        },
        {
            "review_text": "make you think really hard. took me two hours to cmoplete",
            "review_score": "1"
        },
        {
            "review_text": "amazing one of the best indie games ever ",
            "review_score": "1"
        },
        {
            "review_text": "voice acting is cringe worthy. Youre not given any clear instructions on what to do",
            "review_score": "-1"
        },
        {
            "review_text": "Frustrating",
            "review_score": "-1"
        },
        {
            "review_text": "Even so,this game was a bit hard to understand..especially part where I had to find the key (which made me frustrated),I still find this game interesting and I would recommend it to someone who has strong nerves for the most of the 'levels'. The ending I got made me laugh,good job on that one. I might re-play it again,just to try out other choices and see how it goes. Wonderful graphics also. And it's free.",
            "review_score": "1"
        },
        {
            "review_text": "After about the 300th 'Verify Integrity of Game Cache' the achievements are actually obtainable.",
            "review_score": "1"
        },
        {
            "review_text": "SO, I played this game for 1 hour, then i closed it and when i came back to continue the story... nothing. Just like i neer played. not to mention the gameplay. I have understand nothing. I died for no reson and it's full of bug. E' UN SACCO DI ♥♥♥♥♥ FUMANTE",
            "review_score": "-1"
        },
        {
            "review_text": "Really good story game set up to begin with. Kind of glitchy towards second cut scene and can't progress beyond field scene as the game freezes. Overall not really that great.",
            "review_score": "-1"
        },
        {
            "review_text": "Thanks to H2O Delirious, he uploaded gameplay of this, it was awesome. When I played it, it was meh. 10/10 for YouTube",
            "review_score": "1"
        },
        {
            "review_text": "While one of the final levels has some frustrating platforming due to some poorly registered hitboxes on the platforms, this game is a fun experience that actually takes the 'indie absurdity' genre and gives it some concrete meaning for once if you pay close enough attention. Great music too.",
            "review_score": "1"
        },
        {
            "review_text": "Just a foreword, but I played this right around when it first came out, before I started doing reviews. I however watched a YouTuber play this game recently which gave me the idea to actually write a review.  I played this as my very first horror game, and before I get further, it's not really scary (and I jump easily) but it does mess with your mind. As I played through it, I became very confused very quickly and so I used a walkthrough to progress through the game. This is my main reason why I don't recommend the game. I tried playing without the walkthrough for awhile, but it took literally a few minutes or so before I pulled it back up again. Grant it, I don't play many puzzle games, and I still don't really, but even through my stupidity I could tell these puzzles were a little out there.  Storywise, it made little sense to me. It also seemed to confuse the YouTuber I was watching play it. Few things make sense, BUT BUT BUT, if the devs for this game intended for that then they did do a good job.     SMALL SPOILER  -----&gt;    I knew from square one that drugs were involved somehow :D      Thanks for reading! Check out these other links!   My Curator Group   Other Game Reviews ",
            "review_score": "-1"
        },
        {
            "review_text": "Only If is an interesting game, which puts you into horrific, beautiful and abstract places. It has not much content and is easily beaten in a few hours or even less, but than again, it's free. It has a couple of bugs and isn't optimized that good, so you may have some framedrops even on a decent PC. If you are into something weird, try it.",
            "review_score": "1"
        }
    ]
}