{
    "app_id": 298360,
    "name": "Immortal Defense",
    "release_date": "2015-08-31",
    "developer": [
        "Studio Eres"
    ],
    "publisher": [
        "Studio Eres"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Action",
        "Strategy"
    ],
    "achievements": 40,
    "positive_ratings": 116,
    "negative_ratings": 8,
    "price": 6.99,
    "description": "Immortal Defense is a story-driven tower defense game in which you give up your body and life to become an immortal &quot;path defender&quot;, and defend your home world from destruction, forever. The game takes place over millions of years. Is there anything you would give up everything to defend?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/298360/header.jpg?t=1497729111",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8, or 10 Memory: 1024 MB RAM Graphics: 128MB DirectX: Version 9.0 Storage: 350 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I find it difficult to put into words how I feel about this game but here is my best attempt.  In 2007 (2008?) I was beginning to gain interest in, 'indie games.' One of the games that I saw was the most highly acclaimed was Immortal Defense, reborn on Steam after 8 years.   I was never very good at tower defense games, and to be honest I'm still not good at them. Back then I tried to get through as much of the story as I could (on difficulty 00 never the less) but I think my brain stopped being able to handle it around the half way point of chapter 3. The game is difficult and can take a lot of thinking to fully understand. Part of this is because there doesn't seem to be an, 'optimal,' strategy for each level. There are ways that don't work, but especially later on you can figure out many different ways to beat them. I ended up cheating my way through a lot of the game from that point. Sorry Paul, I did it back then and I might have to do it again. I'm just not clever enough for your later levels.  The visuals, while simplistic, make up for it in terms of color, style, and how fitting they all are. The game looks really damn nice now. Still simple, but even more juiced up with all kinds of interesting effects.  The music can range between infectious and grand with some great melodies but you can definitely hear that it was a bit of a budget affair. I spotted some midi bass that seemed out of place.  But the real thing that makes Immortal Defense so special to me was its story and how it affects the gameplay. You play K, a person who has given up his body to defend his home world from invaders, detacting himself from the physical world to defend it from pathspace. K left all he loves physically - but not mentally. In pathspace, K uses parts of his being, mainly his emotions manifested into towers to destroy enemies in pathspace. They speak out in the middle of the game with character, making the battlefield feel alive.  K's journey is a philsophical one that tackles a lot for a game: what matters to a person, what drives them, what the nature of reality is, what the nature of truth is, how powerful you can become and how it influences others, and how it would be like to live alone, forever in a place away from any mortal eye.   The writing is very well done. It is never these huge philosophical rants, rather the characters give you information and story through the use of subtle phrases that you can put a lot of thought into.  Not only that, the levels range from abstract to very purposely made symbols that represent what is happening in the game.  The point is: The story and mood of Immortal Defense seems into every crevice of the game. Every element in the game seeks to bring you into the story of K. His story is a hypothesis on what might it be like if you, the player, were to embark on this grand journey a million years long.  I finished the game long ago in 2007 (2008?) early in the morning. It made me think about my own place in the world, made me feel profound emotions and has given me a quote to live by to this day. Rethinking about the game gives me chills and to this day fills me with the feelings of...I can't really put them into words.  Maybe it was me being naive and being sensitive. I'm a sensitive guy, what can I say? But this is my experience from the game. Even if no one else feels the way I did, this game hit me hard and inspired me in many ways.  When you have nothing left, you must create your own reasons for existening. Some people cling to the past, others surround themselves in their own creations.   Here are two quotes that have stayed with me all these years.  'There's one thing you can rely on in this universe: being as wrong as often as you are right. So whether you're right or wrong -- Be exceptional at it. That's morality.'  and   'I love you grandpa.'  Thank you Paul and the rest of the developers behind Immortal Defense. I'll never forget this.",
            "review_score": "1"
        },
        {
            "review_text": "The first and still the best Tower Defense game to weave expert storytelling with solid gameplay and a beautiful soundtrack. Place towers along a curving path and assist your towers during each wave with your own ship-cursor's regular and high-power shots. Many towers react with each other, or with your own attacks to deepen the gameplay. Each level has an evocative introduction that casts new light on what you're doing.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most unique and compelling tower defense games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Simply, The Most Interesting tower defense I have ever played.  The stories are well written and slightly touching.  The gameplay are Awesome and Repetitive.   That's all I have to say. LOL. Anyway, The overall is Awesome and Worth of cash. ;)",
            "review_score": "1"
        },
        {
            "review_text": "I put tons of hours into this game almost 10 years ago. Best story in a TD ever.",
            "review_score": "1"
        },
        {
            "review_text": "While there are no shortage of tower defense games in the steam marketplace, if you enjoy the genre then you should give this one a go. The visuals and story feel like an old sci-fi serial, with nonsensical names and trippy colored backgrounds creating a vibrant space as you play, the tower types each add their own personalities into the story... it all works pretty well to keep you engaged. The cursor acts as a tower as well, firing a steady stream of damage that gets larger as the round progresses, allowing you to prioritize the enemies at your door instead of feeling helpless. The tower types are fantastic though, with firing patterns that match their personalities and they cause you to think about where they should be placed to maximize effectiveness which is one of the tennants of TD as a whole. Overall, this game is well priced for the experience, has a ton of customization and creativity involved (Custom levels and diffficulty settings) and is chock full of enjoyable content.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say that has not been said by others?  I have forgotten what I could say.  I have to keep defending.  All I am is a path defender.",
            "review_score": "1"
        }
    ]
}