{
    "app_id": 298400,
    "name": "Knightmare Tower",
    "release_date": "2014-06-16",
    "developer": [
        "Juicy Beast Studio"
    ],
    "publisher": [
        "Juicy Beast Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 6,
    "positive_ratings": 388,
    "negative_ratings": 28,
    "price": 2.79,
    "description": "Break through ceilings, rescue princesses and escape boiling lava as you slash your way to the top of the Knightmare Tower!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/298400/header.jpg?t=1447361664",
    "minimum_requirements": "OS: Windows XP Processor: 1.2Ghz+ Memory: 1 GB RAM Graphics: 256MB Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I bouth this solely to support Juicy Beast. It exists as a free flash game, and it's essentially the same thing as the steam version. But hey, It's pretty fun. However it is short.",
            "review_score": "1"
        },
        {
            "review_text": "This game has been criticized for being a flash game, originaly avaiable for free. While it's true that there is a free of charge flash version, the one avaiable on steam has been completely rebuilt on the Unity engine. Now, moving on to the acttual review.  Knightmare Tower is an arcade style game. You play a night going up the tower to save 10 princesses and ultimately deffeat the boss at the top of the tower. Seem's pretty bland, right? It would be, if not for the way you ascend the tower is by hitting your enemies with your sword. You basicly fly around at the top of the screen, slowly falling dow until you hit an enemy or dashing straight at them so that you can get up again. It's the type of arcade game where you're gonna keep failing until you purchase the right upgrades.  Speaking of upgrades. While ascending the tower, you will keep finding stuff that'll aid you in you journey. Bombs that'll deliver a hit to each enemy curently on the screen, horn that will spawn odd, non hostile creatures you can wack down to go up higher and gain some gold and, well, bags of gold. The last one is obviously used to purchase the previously mentioned upgrades. Those are chategorized as: Equipment, Upgrades and potions. Upgrading your equipment will make your rocket go higher, make you able to withstand more damage or deliver it or just make your movement more fluid. Upgrades are less noticeble, but they still help you a great deal! Potions are another item you can find, and upgrading it in the store will keep adding effects to it like speed or damage boost.  The game features a variety of different foes. From the harmless demons you use as fodder for your sword, to weird, centipede-like things that you can only hit in the head. Some ill shoot at you, others will blow fire, some others will just use spikes to protect themselves. You've gotta be carefull and time your dashes just right to nog get hit. Also, it's important to note that if you dash and hit no enemys you will fall of the tower. A rocket will quickly get you back up, but you will lose a great deal of your speed, wich will leave you vulnerable to the biggest foe of them all. Lava. Lava will start following you if you don't ascend the tower fast enough. It doesn't mess around. If you fall into it, game over, no matter how much damage you can withsand.  So you've gone up the tower, saved all the princesses and and defeated the final boss. What now, you might ask. Well now, you unlock a survival mode. The tower is infinite in height and the monsters more fierce than ever! This is where the 'endgame' begins. If you want to squeeze a bit more out of this game, you'll have a lot of fun trying to get into the leaderboards! Now, the monsters in this tower are always the same, and the only thing that changes is their health, spawn rates and the speed of the lava, as you go up the tower. Make no mistake, though, this get's real hard, real quick!   As for achievements, the game only has 6 of them, wich will propably turn off anyone who look's to bump up their achievement count, but if you're looking for a challenge, you're gonna find it here. Sure, finishing the game and getting everything there is to get in the shop aren't hard achievements, but getting up to 100.00 meters in survival mode? Good luck.  Honestly, I cannot reccomend this game enough. I am having tons of fun with it, and I bet most of you will too. Happy gaming!",
            "review_score": "1"
        },
        {
            "review_text": "Holy cow is this game addicting. It's really minimalistic in its controls, but the way it's executed makes it an intense game of skill with a little bit of luck.  Here's a quick look video if you want to see gameplay with my impressions of it. If you'd rather read, just continue below for generally the same thing.          YouTube™ Video:  Knightmare Tower Quick Look&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Superb! This game is very addicting and simple to get adjusted to. Whoever likes games where you constantly get rewarded after failing and upgrading to do better should give this a shot. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Minigames available on Steam!",
            "review_score": "1"
        },
        {
            "review_text": "I made a video review to show off some of the features and gameplay of this game!         YouTube™ Video:  IndieView - Knightmare Tower&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I'm fairly rubbish at this game, when im not in the mood for any thing to heavy this is the one! Simple game but super addictive. Dont even remember buying it, maybe it was a sale or a coupon who know!s? It's a sure shot tho...cant help but enjoy it. Your not ganna sit there and play it for hours on end, but in short bursts this game is awesome!!! Proabably a moblile game or for the tablet who the f*** knows just buy it...Or your a tramp gypsy tightass mf  would insult a large portion of the community for not buying this game again 8/10",
            "review_score": "1"
        },
        {
            "review_text": "this game is one of my faves. why? is it because its flash game based. yes, but thats for later, is it because its simple. no and NO. its not that simple to master. is it because its controller supported? ....yes. but its mostly because its made by juicy beast. the people that are famous for burrito bison. they ported a game over to steam, added new things. bla bla alb ♥♥♥'N BLEH. but its mostly that its fluid. it controlls like... well, think of firing a factory new gun thats extra lubed. its slippery but not like ♥♥♥♥in ice. its rough, but unlike sandpaper. its a mix of rough and smooth. just like a whetstone gently massaging a babys bum. the bum is smooth, the stone is rough. the friction caused by both the rectal cheeks and the manufactored massaging rock is the controls of knightmare tower. the story is like that of an old game where guns sound like thor having c4 dumps. its not suposed to tell you anything. it gives a brief backstory like, 'yo bich, the princesses got nabbed, MOVE, you ♥♥♥♥.' and just drops you in the game. (ps, knight on a gameboy, nice touch. :3) the graphics are ranging, to adorable, (i.e. the knight, the bat spitting fireballs.) to pants ♥♥♥♥-rocketing disturbing. (i.e. the cartoony wyrms where you have to hit ONLY the head. and the winged mobs that protrude spikes out of their forehead) also the boss is a rage face. 10/10 if you didnt buy this game, get it NAOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOW!!! its on sale, it lasts for 11 minutes and 24 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Knightmare towar is a fun and unique game. I enjoyed it, and while it can be punishingly difficult, it's also highly entertaining and skillful. You will probably enjoy this game, even though it's sadly short",
            "review_score": "1"
        },
        {
            "review_text": "It is a very short game but is worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game 8/10 star. saldy not mouse control system (yet I hope they add that ) and too short   ",
            "review_score": "1"
        },
        {
            "review_text": "This is a great fun game. Bought it for 1.99 €, didn't expect much. Started the game, immediately started progressing and unlocking upgrades. Very addictive. And the music is EPIC.",
            "review_score": "1"
        },
        {
            "review_text": "Great addicting game, couldn't stop playing it.  It will take you around 3-4 hours to complete the game though.",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice little arcade game, but I'm afraid once you complete everything there won't be much to do, and that's rather quick. I did enjoy the time playing it, but I didn't get more than 4 hours out of it. The gameplay is lots of fun though! But I myself need a goal to continue playing, and I just didn't have any after doing everything there was to do. I'd still recommend it, I think it's worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Feels like a flash game that's been upgraded to a full title. Decent game, pretty fun. Easy to pick up, but provides a decent amount of challenge if you really want to get 100% on the achievements.  Certainly better that some other games out there! Perhaps wait for a sale?",
            "review_score": "1"
        },
        {
            "review_text": "It's one of the most addictive Jetpack Joyride clones that isn't JJ. Very fun stuff. So many things to upgrade, lots of humor, and just plain fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is good.",
            "review_score": "1"
        },
        {
            "review_text": "Very COOL Game! But at some point you have to grind a lot for the best equipment. The prices at the stop should be lower! ^^ well spend 1,35€",
            "review_score": "1"
        },
        {
            "review_text": "Feels like a flash game that's been upgraded to a full title. Decent game, pretty fun. Easy to pick up, but provides a decent amount of challenge if you really want to get 100% on the achievements.  Certainly better that some other games out there! Perhaps wait for a sale?",
            "review_score": "1"
        },
        {
            "review_text": "Wow, I did not expect this game to be so good! I managed to pick this game up at a discount, but it's current $3.99 price tag is still makes it very much worth it.   The Good",
            "review_score": "1"
        },
        {
            "review_text": "A fun game to play :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. I hate games like this, VERY MUCH. However, this one does it right. I first encountered this game on my Ouya. It was the first game I purchased on there cause when I played the demo, I knew right then and there I had to have this game. Years later, I saw it floating here on Steam and decided that it had to belong in my games collection for the PC. (Yes, I bought it twice.) Taking another trip down this game was just as enjoyable as it was the first time I ever played it.  Grinding in this game isn't a chore.... it something that you look forward too. You spend a good part of your time debating on if you should: A: Quit the game and take a break (or) B: Go just one more round, to see if you can get those few extra coins to update your character... which may make or break you rescuing a princess on another round. If you choose B and then have enough money at the end of your turn, you are then faced wth another series of A / B choices on if you want to go just that 'one more round' and before you know it... you've wasted more time in this game than you wanted to. :)  My hats off to the developer for this great game. I have really enjoyed it not once, but twice. Game is very well made and greatly polished. The fact that you can get it on the summer sale on Steam right now almost gives you a feeling that you really got away with some time of crime. I almost feel guilty for buying it so cheap. This game is EASILY worth $10.00.",
            "review_score": "1"
        },
        {
            "review_text": "I have completed this game online before and wanted to support a good game company. Unfortunately the game has one major flaw. It constantly loses saves. I have had to restart the entire game after nearly completing it three times and I'm sick of it.  Just go play the free online version.",
            "review_score": "-1"
        },
        {
            "review_text": "Price is pretty steep for what is essentially a mobile game ported to pc. If you get it in a bundle or so it's a good bit of fun but absolutely not for that asking price.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, actually I like the game a lot, but something very frustrating have happened. Every time i close the game all the progress is reseted...... I'm using linux, and i won't recommend the game until this problem is fixed.",
            "review_score": "-1"
        }
    ]
}