{
    "app_id": 298630,
    "name": "The Escapists",
    "release_date": "2015-02-13",
    "developer": [
        "Mouldy Toof Studios"
    ],
    "publisher": [
        "Team17 Digital Ltd"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Pixel Graphics",
        "Strategy",
        "Crafting"
    ],
    "achievements": 37,
    "positive_ratings": 11629,
    "negative_ratings": 1432,
    "price": 12.99,
    "description": "The Escapists provides players the opportunity of experiencing a light-hearted insight into everyday prison life with the main objective being that of escaping!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/298630/header.jpg?t=1549977515",
    "minimum_requirements": "OS: Windows XP Processor: Dual Core CPU 2.4 gHz Memory: 2 GB RAM Graphics: Intel HD Graphics 4000, Nvidia GeForce 8000, ATI Radeon HD 4800 Series Storage: 2 GB available space Sound Card: Windows Compatible Card Additional Notes: We recommend updating your PC's hardware drivers before playing. If your PC is no longer supported by your manufacturer and your hardware drivers are very old, you may experience difficulty running the game. Please check with your PC manufacturer for more details.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Awesome!Just some suggestions...  Great game in general, though a little tedeous at times. I think everything in this game is perfect except for one thing...  Make this game multiplayer. Imagine escaping prisons with your friends and working together. i personally think that would be AWESOME! So add that.",
            "review_score": "1"
        },
        {
            "review_text": "Chipping trough walls with plastic forks. Crafting make-shift weapons. Scouting out the prison. Getting the right items. Dodging guards. Living prison life. Getting keymolds. Getting better jobs. Leveling stats. Getting a guard outfit. Covering up dug holes and chipped walls. Finnaly getting out to the perimiter wall. Get shot by a guard in a tower, taking all your items and putting you into solitary. Trying again. Succes. Reliazie this was the easiest prison, and a even harder one awaits you.  Sounds like fun? It is fun.  Pros:  - 6 defualt prisons, along side 2 custom. (3 if you had early acces) - A sea of non-craftable and craftable items. - A easy to understand crafting system. - A helpfull and lovely community. - Amazing soundtrack. - The abillity to name all guards and in-mates. - 9001 ways to escape the prison. - Very polished and alsmost bug free. -PRISON EDITOR  Cons:   - Very rage inducing.   So all in all, The Escapist is an amazing game and should be played at all costs. Fun and compelling, challenging and extrmely high quality. Easy to get into, hard to master. Well, I am off to see if my plan works this time.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a game about escaping from various prisons. The 'levels' are the prisons.  I like the old-school pixel graphics. The GUI is incredibly fast and responsive. Controlling the little guy that tries to escape is a fun challenge. I like how you have to think out a plan and can bide your time to execute it. The independent lives of the other inmates is fun, and they can also give you missions and objects to use.  The mouse-clicking for moving objects can be a bit finnicky, I would prefer the option of using the keyboard for everything. Also knowing which things can be crafted into what (like a bar of soap + sock = a weapon) could be more discoverable in-game.  It's a pretty polished and fun game.",
            "review_score": "1"
        },
        {
            "review_text": "A very polished and clever experience, but it seems that there is usually only one way to escape. It would be nice if future maps included more than one way to escape, and a reward for escaping in every way from one prison. Other than that, just damn fun to play. Good now, even better when Multiplayer rolls out.",
            "review_score": "1"
        },
        {
            "review_text": "-Went to lift some weights in game -Mashed q and e -Got 100% fatigue in game -Got 100% fatigue in real life -Eats chocolate bar in game -Eats chocolate bar in real life -Keeps mashing q and e   Best game 10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "This game makes you always have a nifty schedule completely irrelevant to any regular prisoner, perhaps go stash your contraband in your vents during breakfast, and the fun interactive gameplay is great, and this game isnt even complete, its amazing and it is one of the best games you could ever get on steam  --------------------------------------------------------------------------------------------------------------------------------------------------  When i reviewed this game in Early Access in January 2015, i played around with the game. I kept the review above, but getting down to the basics of the game, the prisons used to be pick whichever you want, that has now changed, it is now integrated into a much more refined unlocking style. I do think the game has gotten a lot better since early access. This game is a absolute buy if you got the money. I do enjoy this El Chapo simulation.",
            "review_score": "1"
        },
        {
            "review_text": "All that stands between you and freedom is: one fence, one wall, a bunch of suprisingly perceptive gaurds, and a few snipers ready to blow your head off at a moments notice. Good Luck!",
            "review_score": "1"
        },
        {
            "review_text": "lifted wieghts  Got so jacked guards said to stop lifting Kept lifting  Guards atack Beat $#it out of gaurds Went back to lifting Guards were to scared to come after me so left me alone 10/10 Would get jacked again",
            "review_score": "1"
        },
        {
            "review_text": "Attempt #1 Crawl through the vents FAILED  Attempt #2 Steal a guards clothing, weapons and key FAILED  Attempt #3 Create a some clay, Beat up a guard and create a key mold out of a key and clay. Safely return the key back before the guard wakes up, Use the key at night time to bust out of the prison while no one is watching. FAILED  Final Attempt Beat up a guard with a soap in a sock SUCCESS",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favourite early access games so far. It's just fantastic, so many different ways to carry out your escape and the road/leadup to the escape is where the fun is! From contraband to contraption, The Escapists will leave you begging for more, even after nearly 100 hours.  I can't wait for the community prisons via the editor. Bring it on and get involved! A true no-brainer for the price!",
            "review_score": "1"
        },
        {
            "review_text": "This game has a sense of humor you don't get from most games. You start to be your character, as that it is a free as a prison game can get. There is no grinding, and how you earn you money is up to you. When I finally escaped I felt a sense of accomplishment you don't get from many games today. The gameplay is innovotaive, like who would've thought hitting guards with hot chocolate would knock them out? Some people look at the graphics and say 'Its crap' but its all it really need to be. I would recomend this game to people who like strategy and don't enjoy waiting for things to happen.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, I've been wondering what a light-hearted yet realistic prison would look like. You'll find it here.  The community makes custom maps everyday so you will never run out of stuff to do  Get this game when it's on sale ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, I have low hours but I used to play this on another account, completed the games, really fun, can't wait until the new one.",
            "review_score": "1"
        },
        {
            "review_text": "Personally I really enjoyed the game. I like the genre and the art style. The music was actually good and the mechanics are very good. The prison customizing thing is really hard to use and confusing but i don't really use it that much so it doesn't bother me.  I don't think that this game is one that everyone will like but I definetally have enjoyed it so far and i will continue to play this game",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game for the price I bought it at...",
            "review_score": "1"
        },
        {
            "review_text": "The Escapists happens to be a very well-built game, but like all games, has it's fair share of flaws.  Pros    Very fun    Gives you an achievement for flooding 30 toilets    Comes with a prison designer (also known as the 'Map Editor') so you can make your own levels and send them to the world   Cons    Can become tedious after a while    Your stats deteriorate a bit too quickly    The officers sometimes become suspicious when you're doing nothing wrong whatsoever   Overall, The Escapists is worth playing, and the addition of a mode where you play as an officer would be a very welcome one. After all, it would be fun to learn just what the officers do offscreen.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS A MUST BUY!  This game is amazing! From the character stats to the escape methods I LOVE THIS GAME! I have recommended this game to a few friends as well. This is most likely the best game l have ever played this game would definitely be on top ten games I have played. My only problem with this game is minor time glitches whenever I have to leave for a few hours and close my computer and come back to the game the timer goes from 15:00 to 16:15 in about 3 seconds which adds a ton of heat. My only other problem is there is no multiplayer but IDK how they could make it a multiplayer.  Overall: 9.5/10 (only because there is no such thing as a perfect game)",
            "review_score": "1"
        },
        {
            "review_text": "I knocked someone out by throwing hot chocolate on their face. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The art style is amzing the gameplay is fun I wish I didnt have to wait till the end of the day to save    AMAZING GAME :-) ",
            "review_score": "1"
        },
        {
            "review_text": "been playing this game for over 30 haurs and i stil love it and now there is a second one comming up i wil be playing that one even more",
            "review_score": "1"
        },
        {
            "review_text": "The. Escapists.  Woah.  It's tough, real tough. Gets 'ya thinking your socks off. And then you put soap in your socks to make a sock mace. Or a battery instead, to make a super sock mace. Well worth the £6's.  It's got DLC for the people who think HMP Irongate is easy (HMP Irongate is the hardest non-DLC prison).  Most of all, you get to craft nunchuks and be a ninja.",
            "review_score": "1"
        },
        {
            "review_text": "Who doesn't like a good puzzle?? If you don't, make time for this one because if you aren't down with the puzzles, this game lets you have fun! You're in prison. Objective: break out. Do favors for inmates, assault them, assault the Correctional Officers (if you dare), make an honest prisoner's wage, buy materials, steal materials, make alliances, whatever it takes to survive and escape! Think top-down old school Zelda-style play action but your options are only as limited as your efforts. Break a hole in the wall all Andy Dufrane-like, cover it with a poster, dig a tunnel and hope you come out clean on the other side!   Do not miss this one!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really thought out and makes you think strategically. When you escape a prison you truely get a sense of accomplishment. Planning is essential, especially in the tougher prisons. If you like these types of games, get it now!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good I want to go to jail now",
            "review_score": "1"
        },
        {
            "review_text": "This game is masterpiece. It is suprisingly deep. I guarantee that when you play this game you will have an amazing time like I did. No wonder it's getting an Xbox One release. I recommend buying this game. It deserves to be brought, played and loved. It is definitely worth an $18 price tag.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, definitely worth the buy.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game :3 It's first strategy game so far, what I enjoy :) 10/10",
            "review_score": "1"
        },
        {
            "review_text": "As someone who's not aggressive as a player, this game is really dangerous for me in terms of wasting the days away just sort of getting money or resources and not acting. Buttt, this game is so great. Good music, easy to learn controls, the only thing I say is consult a crafting list. You can do without but it really helps. :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Its challenging and takes strategy. I have defeated Center Perks and Stalag Flusht and they were both very hard. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "There are certain games that most everyone likes but just don't capture you for some reason. It's often not the fault of the game but just a bad marriage between game and gamer.   So it is with me and The Escapists. To be honest, I don't get it. There's no direction, the art style is best phrased as butt-ugly and the controls aren't easy. I'm forever getting stuck on the edge of doors because you have to be lined up perfectly to get through them. I don't find the gameplay very compelling.   I know what I'm supposed to do - work on your stats, get into a job that allows you to steal the components you need to escape and then do so - but I don't find it very engaging. In that I know I'm in the minority. That's ok. I'm just not good at it. The side quests are simple, the other prisoners seem to be fairly faceless, the routine dull and just the whole thing for me falls flat. I haven't even been able to escape the first prison and to tell you the truth it's not really worth my time trying. I should like it - I'm a fan of strategy - but I don't.   Now again, that's just my experience. But I also know I'm not the only one. A friend of mine also bought this and felt the exact same way. In the meanwhile the reviews are very positive, so I know and accept that I'm in the minority.   Yeah, if this sounds like the classic 'it's not you, it's me' line, it pretty much is. I'd probably like the game much more if the controls were better, if the graphics are clearer and if the strategy was more robust. But it's not and I regret buying this one. If returns were allowed when I bought it, I would have done so. But they weren't and so it gets a thumbs down from me. YMMV.",
            "review_score": "-1"
        },
        {
            "review_text": "I have been eyeing this game for quite a while, in fact almost since it was initially released. I was really excited once I actually bought it. Then I played it.   The game has an amazing idea, fun graphics, and a lot going for it. As you can tell by most of the reviews people like it. There are a lot of things that ruined the game for me.  First off, there isn't a real tutorial. It doesn't teach you anything of real importants, in fact the tooltips throughout the game do more than the tutorial. It took me over ten minutes to figure out how to lift weights in the exercise room, and I only figured it out because I went online looking for help on a wiki.   Second, many of the mechanics of the game are not very rewarding, nor very interesting. To raise your strength, you have to smash down on your a key for several hours before you can start to take on even another inmate, which leaves your finger aching and you a little frustrated. Then running to build up your movement speed is a similar situation, just a little less button mashy after you build it up during your workout. It's fun to start tunneling or exploring the vent systems, except the guards have x-ray vision and as soon as they find anything out of the ordinary it's your fault. In fact I remember one time I was just sleeping and I got caught when I had a fake vent up (Which is supposed to be fool proof by the way.) So the game mechanics weren't super well thought out, and could get a good fix. It would be awesome if the guards didn't have good vision and if you have mutliple ways you're trying to escape from, they only get rid of the one they found, or you could get other prisoner's caught for something you did, such as build a tunnel in their room while they're not in it. In other words, I would love if the game actually was more realistic, and less, you get fat overnight if you forgot to work out one day because stealing stuff and all, as well as less button mashing (bad for my fingers and potentially for my keyboard too.) and guards that weren't all seeing gods in mortal bodies.   The game had a lot of potential and could have been something ground breaking, except they shortcutted through a lot of the functions, making the game more frustrating and ridiculous than immersive. If there was a reboot or update to this game to fix several of these mechanics, I would most definitely get it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is...not that great. It gets dull real quick. I honestly have no idea how I got almost 12 hours in the game. I wouldnt suggest getting this game unless it is on some crazy sale. Not worth the full price.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game but, gets a little boring after a while...",
            "review_score": "1"
        },
        {
            "review_text": "My dad thought I was playing one of his Atari games once he saw the pixels 11/10 Would pixel again",
            "review_score": "1"
        },
        {
            "review_text": "Add multiplayer and this game would be utterly perfect.",
            "review_score": "1"
        },
        {
            "review_text": "I loved how much you had to think about what you were doing and how do do it to get out of the prison you are in. It also has really good gameplay. And its really fun beating up prisonors",
            "review_score": "1"
        },
        {
            "review_text": "Add multiplayer and this game would be utterly perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Overall Very well Game. One flaw are the fact that you HAVE to sleep at night in order to save the game. A big god thing here is the unique challenge every prison has. No two prisons are the same. For example, (SPOILERS) The HMP Irongate is very VERY similar to the Shankton State Pen, But the fact that the HMP has different weapons, the challenge is never the same.",
            "review_score": "1"
        },
        {
            "review_text": "Challenging and fun!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, won't get bored for ages!",
            "review_score": "1"
        },
        {
            "review_text": "100/10",
            "review_score": "1"
        },
        {
            "review_text": "Guard attacked me while showering ( I was naked)  11 / 10 would shower again",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME IN THE WORLD ",
            "review_score": "1"
        },
        {
            "review_text": "It's so fun to play 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Very challenging, but can be repetitive.",
            "review_score": "1"
        },
        {
            "review_text": "make a mac version please",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "nice game to pass time",
            "review_score": "1"
        },
        {
            "review_text": "This game is addictive, yet very challenging. On day 1, I lost my job for some unknown reason. On days 2-4, I was attacked numerous times. And yet I can't stop playing",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game and really fun!  You get WAY more gameplay than 15€!",
            "review_score": "1"
        },
        {
            "review_text": "ADD 2 PLAYER PLEASEEEE  Apart from that AMAZING GAME",
            "review_score": "1"
        },
        {
            "review_text": "This Game is Great. But They should add multiplayer to play with friends. That would be cool, but since they dont have it, it leaves so much potential waiting to be used. ADD MULTIPLAYER!",
            "review_score": "1"
        },
        {
            "review_text": "Hard as ♥♥♥♥ but its fun &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Ok This is the best little game that i have ever played 100% recommend it. P.S hope fully they add co-op or something :). P.P.S get it its fun",
            "review_score": "1"
        },
        {
            "review_text": "I like it but it can make you rage quit",
            "review_score": "1"
        },
        {
            "review_text": "its is a really fun game it is harder then it looks i love it buy this game and see if you like it",
            "review_score": "1"
        },
        {
            "review_text": "Great!",
            "review_score": "1"
        },
        {
            "review_text": "oh, the escapists. it's a love/hate relationship between you and me.  you play as a little prisoner who was sent to jail for an unidentified reason, and you must collect materials to slowly, yet sneakily break out. the escapists is a prison simulator that can really test your ability to be sneaky and stuff.  there are about 6 maps currently, which range between difficulty. the hardest, being HMP Irongate, that isbased on alcatraz. (You know, the prison on the island in san fransisco?)  you can buy materials off of other prisoners too, but only with money, which can be earned by doing a favour for a prisoner (like beating up 'this' person) or doing your job. your prisoner starts off with puny stats, and you can improve these by going on a treadmill or doing push ups. Also going on the internet raises your 'intelligence' so you can craft better items and apply for better paying jobs.  I really like this game, but i hope for more to it in the future.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "i beat up the guards until they let me go  10/10 would beat guards agian. ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Pick one of 6 prisons and try to escape in multiple ways. Seems simple, but turns out to offer quite a challenge. Get used to the mechanics in the first prison, then move on to harder ones, with different escape methods and different routines, locations and mechanics.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game all around, really makes you think and plan ahead.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game. Has Certain contraband settings as well as speed, strength, and intellect. Sure, 'How can you fit all this stuff in your pockets?!??!' Who cares???? 'Why can't they make it where it isnt 8-bit?' It would be very hard to make and make alot of lag. 4 words. This. Game. Is. Amazing!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Epic Showering music  11 inmates out of 10 inmates",
            "review_score": "1"
        },
        {
            "review_text": "Okay so this game, First off I should start with, it has to be the best game I have ever played. Second, even if you don't like this game, there is a good chance you will come back to it and love it. As I have done.",
            "review_score": "1"
        },
        {
            "review_text": "After watching Markiplier play this game.. I thought it would be easy (since mark usually makes things harder than they should be xD) but.. I was so very wrong. So many options, so little time! I love it!",
            "review_score": "1"
        },
        {
            "review_text": "Dialogue in this game in a nutshell...  Luis: I hear Luis's a snitch Mick: I hear Mick's an undercover cop Guard: As my dear old nan used to say... That reminds me... Let me tell you cons how it is... Someone broke into the tool shed  Guard: As I used to tell my cheated ex... Never forget you're the dross of society",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game with a great design. Very strategic gives you a huge variety of different options from digging out with a spoon to causing a riot. Bravo.",
            "review_score": "1"
        },
        {
            "review_text": "Opened game. Tutorial finised. Started the 1st prison. Went around the prison. Dropped the Soap. Went to Bed. Planned the escape. Failed the Escape. Restart from last save sim 10/10 would fail the escape again. P.S Dont get me wrong this is a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Should get multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "really fun game to play on a plane or somthing just to get in to it for a long time!",
            "review_score": "1"
        },
        {
            "review_text": "Good game, needs multiplayer. 9.3/10.",
            "review_score": "1"
        },
        {
            "review_text": "  The Escapists is a really fun game, i definitely recommend you getting this game. Hours of non stop enjoyment!",
            "review_score": "1"
        },
        {
            "review_text": "⁨",
            "review_score": "1"
        },
        {
            "review_text": "VERY GOOD GAME THIS game is just awesome, get arrested, make items beat up prisoners, cops, make stuff, break a wall, and close it with a nice PlayBoy magazine xD, and hide stuff behind the wall :D",
            "review_score": "1"
        },
        {
            "review_text": "This is the tv show Prison Break with SNES graphics.  Tutorial done in 3 minutes, good i understand the basics. First very easy level, pfft this should be done in 10 minutes.  5 hours later... ARGH, They caught me again! This game is awesome, it thought of everything.  I've been buying many new games recently. Steam is plagued with incomplete games made by trashy developpers trying to make a few bucks. This is not one of them.  This is by far my best purchase. I can't imagine someone buying this and regretting it.  Buy it now. Especially if you're browsing for any cool game and you're unsure which one will be worth the most. Trust me, this is the one.",
            "review_score": "1"
        },
        {
            "review_text": "The Escapists is a fun strategy game where you have to find a way to escape different prisons. I think that it is a great game! I made a guide for how to escape the first prison. Check it out!",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game. The graphics are great and the sprite arts are very well made. The gameplay is fantastic, but their are a few glitches. Keep up the good work Team 17!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, but I really wish there was an alternate save function other than sleeping. Its frustrating when you lose a lot of progress by making a simple mistake, especially since a minor slip-up can throw away quite a lot of work and time. Saving anywhere would remove some of the challenge, but if there were save locations other than 'going to sleep' I would not rage quit as much.  It is still worth a play, but I think its present price tag is a little high. Wait until it goes on sale to buy.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! If you like games that challenge your creativity then you will love this game.",
            "review_score": "1"
        },
        {
            "review_text": "To play this game you have to be able to accept failure. You will fail at least five times before you escape on average. If they ever come out with multiplayer it will be one of my number 1 games",
            "review_score": "1"
        },
        {
            "review_text": "LOOK, i know ive only had this game a couple of days but i feel like should already make a review on it, its amazing lots of hours already, and many more to come got to the third prison now and so far it runs, and the graphics and gameplay; and especially the music, that is outstanding. now i cant wait for future DLC for this game 10/10 IGN :P",
            "review_score": "1"
        },
        {
            "review_text": "I wish this was cheaper ;-;",
            "review_score": "1"
        },
        {
            "review_text": "I think it is a great game to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "Games that expect you to use a wiki to figure everything out are not my thing, and the systems in this game are designed in a way that makes me feel gross.  You find crafting recipes or buy them with character-specific dollars, and your 'crafting recipes found' journal is per-character. This makes me feel like I have no progression because I want to start a new character if I end up hating the layout of the loot and how I've done on my current character and I always start from square 1 with the crafting stuff.  There is only one prison until you beat that first one, and beating the first one is a hell of a task. This means if you ♥♥♥♥ up on the first one 25 times and start to get sick of the exact same routines and level layout every time you are SOL unless you manage to beat it or play the other two, much harder prisons that are unofficial.  The fullscreen on 16:9 monitors is just the normal aspect ratio of the game stretched grossly wide, like an emulator set to stretch an NES game to 1080p that makes Mario twice as fat. It's really terrible and is the only option.  The emergent gameplay of the prison is minor and less deep than it seems at the outset. You can easily knock out any prisoner by hitting them once and then running them into a guard while they chase you, let them hit you once and then the guard beats them to unconsciousness. You can make people miss their quota for their job by beating them up a bunch during work hours and then take their job. You can plant contraband in their cells. You can make people hate you and then coax them into fighting you and use them to cause a distraction or go somewhere they wouldn't. These things are kind of cool. But not enough to base a game around.  If you fight a guard, all you can do is knock them out for 30 seconds, and if you take one of their keys they immediately game over you when they wake up. Also, if you run away after beating them up sometimes they just forget, sometimes there is no repercussion, sometimes they chase you around forever, and sometimes an unseen sniper in the corner of the map will shoot you in the face until you die. Which of these four things happens is decidedly random.  Escaping, the whole point of the dang game, sucks. Digging is this awful minecrafty thing where you have pickaxes or pickaxe-like items that very quickly decay as you use them to dig through a foot of dirt, and then when they break you have to go get more. Tools you need desperately are either totally randomly found, difficult to craft with no way to figure out how the recipes work, which have some amount of sense, but, come on, paper meche = toilet paper &amp; super glue? People who have played the early access version rattle off absurd, stupid crafting items like a 'bed decoy' and 'fake vent cover' that just scream that the game's systems are buried so deep in their own BS that they feel the need to overdesign to cover their own flaws. Why build a game where you need three tiers of pickaxes and bed roll decoys and cell curtains and instant death snipers? Silliness.  Vital items are hidden in one-time random loot crates that disappear forever after finding them and can contain garbage or incredibly valuable things and the seed changes every time you load so you have to save scum if you want something in particular.  Oh and all the text stuff is all over the place in grammar and spelling, full of memes and nonsense most of the time, and you read it all within the first few hours. Sure there's some neat ideas but pulled off in a way that feels very mediocre.  I still find myself coming back and might revise this review. It's kind of fun in some ways but just so frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "If you want acess to all maps on the map screen do this code: Up Up Down Down Left Right Left Right",
            "review_score": "1"
        },
        {
            "review_text": "Overall, this game isn't bad, but a co - op mode where players could both live in the same prison would be great.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like a childs dream. You have a pixel guy and you run around hitting others.While parents(Guards) dont let you  leave the playroom (prison), and the dad (snipers) dont let anything bad happen",
            "review_score": "1"
        },
        {
            "review_text": "1. find out i need lots of ducktape 2. find out i need lots of intel 3.find out i need lots of metal 4.need to build up intel again  5. FIND LOTS OF DUCKTAPE  6.made lots of friends  7 goes to escape by brute force  7.1. gets QWIKSKOPE NOSKOPED BY MLG SNIPER 2 PRO AND 2 SPOOKY 4 Y M8",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game worth the $!!!",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, it's a great prison escape simulator. (I think that works) The default prisons are great and you'll love going to the next prison for a better challenge or just a different environment. If those aren't enough, there are hundreds more prisons made by other users! And if you've got the creative mind for it, then mak your own prison, it's easy to learn.",
            "review_score": "1"
        },
        {
            "review_text": "Killed a man will a sock full of soap then started a prison riot. 10/10 would go to jail again.",
            "review_score": "1"
        },
        {
            "review_text": "'Fill my hole you dirty ♥♥♥♥♥', I shouted to the 15 people whom were all named 'Farmhand' by me.   What a game, you could almost say it's... turtle ♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "this game sucks",
            "review_score": "1"
        },
        {
            "review_text": "I wish that they'd release a Holocaust deathcamp map where everyday you have a chance to die and living conditions are horrible.  Immoral you say? Probably.",
            "review_score": "1"
        },
        {
            "review_text": "Great im going to try give an accurate guide on how to escape the first prison (very easy)  1. train up your HP to 100% (untill your hp is 50)  2. train your intellect a bit 3. get a metalshop job (this is the job you get paid most for)  4. fill your desk with forks and knives get a screw driver too  5. move your desk so you can climb the vent in your cell  6. at night time use the knives to weaken the vent to 5% durability (dont let the guards see) use your scredriver to finish off the vent (it should appear in your inventory) make sure to place a bed dummy (this is really important) cover up the vent too 7. search for loot 8. steps 4 5 6 and 7 were optional so if you don't want to bother you dont need to  9. get 2 pieces of timber and some green wire  10. craft nunchucks (powerfull weapon) 11. get some rope  12. get a guard outfit  13. during free time knock out guards when they are alone and strolling by themselves 14. tie them up with the rope  15. knock out all the guards you can 16. tie them up with rope if you have some  17. you should get a letter from the warden about the main gate being open 18. put on the guard uniform 19. walk through the front gate like a boss 20. you've escaped and should've got a achievement have fun guys ;)",
            "review_score": "1"
        },
        {
            "review_text": "i love this game",
            "review_score": "1"
        },
        {
            "review_text": "10 / 10 would escape again",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, to be fair only thing that lacking was a controller option. The Walking Dead version had that though, so its all good :D",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Requires a lot of strategizing to make sure you don't get caught. The level editor is amazing, too. Would definitely put this as one of my favorite games of all time :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is stupid 10/10",
            "review_score": "1"
        },
        {
            "review_text": "even though this game is difficutl i love it thanks to jacksepticeye but one little tweak would be to add a co-op escapists mod for free where up to 5 people try to escape toghther grabbing gear for each other and so on please make it happen i would be very happy if the mods added some one please message me and say so",
            "review_score": "1"
        },
        {
            "review_text": "Play it for 5 days straight, then forget about it until you hear there's a new map. Then play it again for 5 days straight.",
            "review_score": "1"
        },
        {
            "review_text": "Pure mind game. This game destoryed my brain cause i am so stupid. dident even go throug first level. still 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Requires a lot of strategizing to make sure you don't get caught. The level editor is amazing, too. Would definitely put this as one of my favorite games of all time :)",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and addicting game.",
            "review_score": "1"
        },
        {
            "review_text": "  Loved the Game. Totally should get it! Im still stuck on the first prison! xD! Like what the ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "The escapists is a very fun game, a bit grindy when you get into the later levels but still a very good game, and EXTREMELY satisfying when you escape",
            "review_score": "1"
        },
        {
            "review_text": "Now the game is fun don't get me wrong but, it gets boring around the shankton state prison level because it's just the same thing over and over again and it just wears you out and you leave and don't come back. If there was more then I'd recommend it but it just gets so boorring after the 3rd level. Plus there are some things that don't make sence for instance the fact that if your escaping and backup arrives your IMMIDIETLY GOTTEN, but if a guard spots your (or 5) then they come after you and your left with going wtf? Not even cool looking guys with assualt rifles that will shoot you if spotted? SERIOUSLY I was escaping a prison and a guard noticed me so I did a little benny hill around a bush and he lost me(somehow) and I WAS LITERALLY TOUCHING THE END and they got me. IDK WTF HAPPENED BUT THAT WAS LITERALLY CHEATING ON THE GAMES PART!",
            "review_score": "-1"
        },
        {
            "review_text": "will there me multiplayer? ",
            "review_score": "1"
        },
        {
            "review_text": "It is rather repetitive and there just isn't that much to do in the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Beat a guard half to death with a spiked baseball bat, Guards are slightly upset, but forget everything by dinner that evening.  Bring a roll of duct tape into the laundry room. 99% heat, prison goes into lockdown and I am shot the second I walk out of the room.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Love it!! Challenging yet creativity is key!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game because it is complicated and I like games like that but it is also easy. So please show the developers love by buying the game. And some DLC maps PLEASE",
            "review_score": "1"
        },
        {
            "review_text": "Read more negative reviews or watch some gameplay video before buying this game.  Mostly a let down, it doesnt simulate anything very well and nothing is explained. I played it to long to get a refund but most of my time on it was not having fun. I might try to continue going to see if it gets better as I learn more but so far it is very lack luster.  Although it is claimed that there are lots of ways you co do things almost anything you try will fail due to illogical AI  Here are some examples.  All gaurds carry various keys but you can't pick pocket them and none of them go to the main gate. If you knock out a gaurd and take a key then run and hide, when he wakes up you will be magically teleported to solitary confinment without them finding you.  Stashing contraban in another prisoners cell does not get them in trouble.  Also no one can permantly die, you don't have an actual sentence or anything and there is no long term repercussions for good or bad behaivore just a bit a skill drop if you spend the night in solitary,  It's hard to explain in text but the game just feels stifling and pointless.  There is no shake downs or lock downs. You don't follow inmates in line or get marched around, really its all choas.  you can spend the whole day hiding or doing something you not suppose to get caught and then hit a gaurd with a weapon and then just run in circles until your Heat level dies back down. Or just walk right past gaurds and go somewhere you shouldn't be and they just complain a little and do nothing until your heat is at 90% and again you can just run around in a circle and wait for it to die down to 89% and then just go back to where you should be.  Nothing makes any sense in the game, like none of it is simulated. i could go on but really I have nothing good to say about this game except that maybe its a challange.  Read more negative reviews or watch some gameplay video before buying this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun concept, but too many tedious things to do.",
            "review_score": "-1"
        },
        {
            "review_text": "you can walk around the prison in your underwear  11/10",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING GAME! I love the 8-bit style! just amazing...",
            "review_score": "1"
        },
        {
            "review_text": "This game is extremely annoying at times because the the variable that you have to think about before you can escape, or when the guards find you out of your cell after night time. But despite all the times I rage quite and go crazy I find this game very fun and challenging unlike most other pixel games like this. I would suggest this to anyone looking for a reasonable way to burn time.",
            "review_score": "1"
        },
        {
            "review_text": "there was an inmate in Center Perks (first prison) called Hunter. Hunter telled me that the Hunter is going after me. best logic ever",
            "review_score": "1"
        },
        {
            "review_text": "Great Game on a scale of 1 to ten this game is a 9. A few kinks like when pausing the game and shutting my laptop unpausing the game causing the time to skyrocket. other than that its a great review ",
            "review_score": "1"
        },
        {
            "review_text": "Its a really awesome game I vote it 9/10 and if you finished with the six prisons you can buy other prisons or install them from the workshop But this game is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "there was an inmate in Center Perks (first prison) called Hunter. Hunter telled me that the Hunter is going after me. best logic ever",
            "review_score": "1"
        },
        {
            "review_text": "this game is fun and very hard game. LOL. Will be perfect if have detailed graphic (not pixelated)",
            "review_score": "1"
        },
        {
            "review_text": "Steam Workshop = Lyfe",
            "review_score": "1"
        },
        {
            "review_text": "OMG YES  PLAY THIS GAME IF U LIKE BEING A BOSS TAKEING DOWN GARDS AND PLANNING TO ESACPE WITH ALL THE NEW DLC SPOULERS BULD A TANK AND BUST OUT IS SOO COOL now done with that now with the stuff that i would like and i think pepole would like to it would be so cool is multy palyer BUT the doors must have keys or something that u get cuz it would be way to hard to escape if some one keeps steeling our stuff and make more stuff u can have 2",
            "review_score": "1"
        },
        {
            "review_text": "very good game and is very detailed and hard which is a very good thing",
            "review_score": "1"
        },
        {
            "review_text": "I can't escape this game.",
            "review_score": "1"
        },
        {
            "review_text": "GIL: 'Can you get me chocolate for 20 bucks?' ME: 'Sure mate' *beats up Gil and steals chocolate* *hands Gil his chocolate* ME: 'Here you are !' GIL: 'Thank you very much !'",
            "review_score": "1"
        },
        {
            "review_text": "GET MY ♥♥♥ OUT FROM THE PRISON WITH PLASTIC THINGS 10/10 WOULD PLAY AGAIN. BEAT THE ♥♥♥♥ OUT OF THE OFFICER!",
            "review_score": "1"
        },
        {
            "review_text": "So tedious you might fall asleep. honestly this ♥♥♥♥ takes forever. its incredibly slow paced",
            "review_score": "-1"
        },
        {
            "review_text": "Cant open!!!! best game ever tho",
            "review_score": "1"
        },
        {
            "review_text": "This game sums up my life. Impossible to get out of bed. 5/7",
            "review_score": "-1"
        },
        {
            "review_text": "AY OI M8 I DID IT I BEAT THE EASIEST ESCAPISTS LEVEL TOOK ME 4 HOURS    10/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "I broke the game",
            "review_score": "1"
        },
        {
            "review_text": "Want to be El Chapo Jr? This is the game for you....",
            "review_score": "1"
        },
        {
            "review_text": "Its so bosss ",
            "review_score": "1"
        },
        {
            "review_text": "I couldn't escape from the first prison because I felt bad for leaving......",
            "review_score": "1"
        },
        {
            "review_text": "Good concept: puzzle of escaping different prision scenarios with a live schedule. But I couldn't get to the puzzle as I stuck at two dealbreaking mechanics: 1. Crafting system needs alt+tabbing to a wiki. If you relly on the game, you can find 1 random recipe about every 15 minutes, or you'd need to go for trial and error as there are only a few combinations. I mean, most ingredients are good only for 1 or 2 recipes and there are lots of quite useless items. 2. Farming stats at the gym is button smasher,  I did try a while, but the farming is too slow and uninteresting. At least I didn't get annoyed by the RNG of item drops.",
            "review_score": "-1"
        },
        {
            "review_text": "its a good game but it keeps crashing on day 3 plez fix it",
            "review_score": "1"
        },
        {
            "review_text": "Very good and fun game, even though it has lengthy processes it is all worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Nice and Ez Game !",
            "review_score": "1"
        },
        {
            "review_text": "Nice retro vibe. NPC's are all the same though and AI is predictable.",
            "review_score": "1"
        },
        {
            "review_text": "In this game it took me 9 hours just to figure out how to escape the 2nd prison (Not including tutorial) really good game but you should make a deadline for after about (this many days) you can escape or just be let out for you're life spent in prison but other than that really good game. I would rate 8.5 outta 10 one of the better games I have played on Steam",
            "review_score": "1"
        },
        {
            "review_text": "STUPID COPS!",
            "review_score": "1"
        },
        {
            "review_text": "Great Prison escape game!",
            "review_score": "1"
        },
        {
            "review_text": "amazing game if you like zombie survivals and minecraft",
            "review_score": "1"
        },
        {
            "review_text": "Good concept: puzzle of escaping different prision scenarios with a live schedule. But I couldn't get to the puzzle as I stuck at two dealbreaking mechanics: 1. Crafting system needs alt+tabbing to a wiki. If you relly on the game, you can find 1 random recipe about every 15 minutes, or you'd need to go for trial and error as there are only a few combinations. I mean, most ingredients are good only for 1 or 2 recipes and there are lots of quite useless items. 2. Farming stats at the gym is button smasher,  I did try a while, but the farming is too slow and uninteresting. At least I didn't get annoyed by the RNG of item drops.",
            "review_score": "-1"
        },
        {
            "review_text": "Well let me get started,  the escapists is a game where you escape a prison (duh).  -i made all preparations to complete shankton state pen.... i couldn't find my bed dummy -i made a new bed dummy..... -i got cell searched... guess what!? -my bed dummy was in my desk....  -the gaurds found it...  -i made 6 hot chocolates in central perks....  -killed all the gaurds... -i didn't escape, i just took their clothes... -now the whole prison staff is naked.  -i went to the shower -i dropped the soap -i got an achievement -achmed the terrorist (name of a prisoner) screamed SOMEONE CALL 911 -guess what?!........  -i got killed for dropping soap  this game made me ragequit more in 13 hours then i did in Call of duty... (i play cod for 2-3 years now)   i escaped a prison in 1 day by only using chocolate, plastic spoons and plastic knives. gaurds keep talking about how they had sex with my wife...... i escaped stalag flugt by giving all the prisnoners money until they liked me enough to help me escape... i guess money can buy u love. I killed a gaurd with a pillow... -trhis game has some extreme random sh*t in it...  i rate 420/360  -would drop the soap again...",
            "review_score": "1"
        },
        {
            "review_text": "If you liked shawshank redemption, you'll love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Center Perks: Day 6  Steals random stuff, runs around, fails to beat up guard, ends up in Solitary...  Center Perks: Day 27  Thinks game is unbeatable. Every single prisoner has bad opinion of me, low stats, restarts game  Finds Wiki *YAY*  Center Perks: Day 1  Steals Guard Outfit from laundromat, uses plastic utensils to escape a prison. At night. Plastic Utensils.  11/10 Will Wiki Again  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! It's got the perfect balance between aiming for the endgame goal and having fun getting there!",
            "review_score": "1"
        },
        {
            "review_text": "i want my money back because its not worth 18$",
            "review_score": "-1"
        },
        {
            "review_text": "Very funny game(make an enemy,let him punch you and go to the guards.) The ♥♥♥♥ing problem is finding pillows. 10/10 would strip prisoners again",
            "review_score": "1"
        },
        {
            "review_text": "BOOOORRRING. Looked good. Played it. Played it some more. Got bored. Deleated game. Never played it again.",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game. It has great mechanics and is quite challenging. You need a great plan first off. Executing it perfectly is harder than it seems. Buy it now.",
            "review_score": "1"
        },
        {
            "review_text": "I escaped the first prison in 12.3 hours.  It was pretty easy  123/10",
            "review_score": "1"
        },
        {
            "review_text": "when i saw this i just thought of a small little indie game so i left it alone until i saw a bunch of youtubers play it so i thought i'd give it a try and i love it 4 out of 5 stars",
            "review_score": "1"
        },
        {
            "review_text": "Breaking out of prison in this game is as hard as Michael Bay at bomb test facility.",
            "review_score": "1"
        },
        {
            "review_text": "outstanding graphics for a 2D game great game overal many prisons to beat only beat one prison so far! realistic situtations thinking they should make a campain or a little story to it then leave to your own instead of just a tutorial telling you about one way to escape",
            "review_score": "1"
        },
        {
            "review_text": "Hi if game developers are seeing this please could you add multipleyer online. if you can thanks",
            "review_score": "1"
        },
        {
            "review_text": "it is a cool game",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. I can't stop playing it! One of the greatest games of 2014!",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Collects a ton of stuff for escaping &gt;Removes room posters &gt;Goes to fence &gt;About to escape &gt;Forgets to put bed dummy in &gt;Gets caught  10/10 would bed dummy again",
            "review_score": "1"
        },
        {
            "review_text": "you get to escape like a boss and beat people with giant lollipops",
            "review_score": "1"
        },
        {
            "review_text": "WHY DOESN'T IT SAVE THE GAME WHEN YOU START A NEW GAME?!?! I spent so long getting the right avatars and names ;_;",
            "review_score": "1"
        },
        {
            "review_text": "outstanding graphics for a 2D game great game overal many prisons to beat only beat one prison so far! realistic situtations thinking they should make a campain or a little story to it then leave to your own instead of just a tutorial telling you about one way to escape",
            "review_score": "1"
        },
        {
            "review_text": "Good game i was here for early acsees spealed it whrong and that one too lol so yeah very very very good game it gets repetof sorry bad spelling now but now with the prison editor i get to make my own prison 1/10 ign",
            "review_score": "1"
        },
        {
            "review_text": "Really tried to get into this game. Controls are a mess and unresponsive. NPC bubbles are hard to read and there is no 'chat window' or something. I figured that my prison had a random cell search on day 3 because I could not figure out officer's chat. A lot of 'quests' are just boring. The game also sometimes just punish you for no reason. Got beaten by guards on exercise time for using the treadmill (??). Seemed to be a good game from trailers.",
            "review_score": "-1"
        },
        {
            "review_text": "When you start playing, you can't stop. But when time passes you stop playing and never return to this game because it gets boring...",
            "review_score": "-1"
        },
        {
            "review_text": "Escape The Popo Simulator 2015",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would prison again",
            "review_score": "1"
        },
        {
            "review_text": "wow the game is alot of fun thanks to who ever made this he or she should earn a reward for best game.",
            "review_score": "1"
        },
        {
            "review_text": "every time i wake up in the game the guards kill me i cant have weopens",
            "review_score": "-1"
        },
        {
            "review_text": "Where is multiplayer?",
            "review_score": "1"
        },
        {
            "review_text": "I escaped the prison with a Sock Mace.    Wow...      I was a beta tester      I recommend this game to people who want to SHANK AND DESTROY! I mean escape!",
            "review_score": "1"
        },
        {
            "review_text": "I can't play",
            "review_score": "1"
        },
        {
            "review_text": "this game sux!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "killed somebody with a pillow broke through the gym wall with a couple forks 99999999999999999999999999999999999999999999999999999999999/10 would pillow-kill again",
            "review_score": "1"
        },
        {
            "review_text": "this game sux!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Great game! But horrible at the same time. I wasted $18.00 AUD on this game and when i first played it i could barely do anything. Now it's completely broken, i can't play on it. That $18.00 AUD was for a picture in my profile. And now i can't get a refund!  If i had to rate this game it would be a 1 out of 5 stars.",
            "review_score": "-1"
        },
        {
            "review_text": "really good game!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and frustrating, and I can't stop coming back for more!  Mdeuias wanted a sponge. Mdeuias came into my cell and so I beat him up. In his inventory was a sponge. I only named one Mdeuias.  Zadsw wants me to beat up Zadsw. I only named one Zadsw.  11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY 11/10 GOTY",
            "review_score": "1"
        },
        {
            "review_text": "Stole a guys toothbrush and got beat up by 3 guards 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is so cool I recommend it! The only problem is that some times when i close it i never stops running!",
            "review_score": "1"
        },
        {
            "review_text": "Totally recommend this, but it would be great if i could find the sprite sheet and edit a charactor to have extra memes.",
            "review_score": "1"
        },
        {
            "review_text": "Named character El Chapo, escaped without trying. Instant freedom",
            "review_score": "1"
        },
        {
            "review_text": "Category: Resolved Security Risks Date &amp; Time,Risk,Activity,Status,Recommended Action,Path - Filename 7/5/2015 8:53:11 PM,High,theescapists_eur.exe (Trojan.Gen.2) detected by Virus scanner,Quarantined,Resolved - No Action Required,c:\\program files (x86)\\steam\\steamapps\\common\\the escapists\\theescapists_eur.exe  ",
            "review_score": "-1"
        },
        {
            "review_text": "great game love all the pixels so well crafted glitchs and more glitches SOLD!",
            "review_score": "1"
        },
        {
            "review_text": "This game is way too hard. You get busted all the time and lose all the good stuff you have spent (in-game) days and weeks collecting, and so you have to start over.  You might dig a hole under your desk that doesn't lead anywhere yet, but they still manage to find it within a day.  Another thing is that the skills deplete so fast that if you want to max them out and keep it that way, you have to spent a good portion of the whole day maintaining your strength, speed and int.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best 8-bit games I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "This game is tricky as ♥♥♥♥. It can be fun but i also do not like it too much. You have these ♥♥♥♥♥♥-♥♥♥ box head people, but that's not the main problem. The cops take my mother♥♥♥♥ing money?? WHY? Also the other people i try to loot them when the cops kick their ♥♥♥, and then they beat my ♥♥♥, and but me in a hospital bed after i get knocked out, THEN take my mother♥♥♥♥ing money. Make this game better and i will change my review. Take your time to read it too.",
            "review_score": "-1"
        },
        {
            "review_text": "After about 3 hours it becomes rather apparent how repetitive the gameplay is. The game is very reliant on RNG for deciding what items appear, which means you'll spend a lot of time waiting for the right items to appear to stea/buy to craft whatever you need. It also highly encourages you to follow the same routine every day (which I wouldn't mind as much if it wasn't pure button mashing).  In some instances the game will instantly teleport you to solitary confinement for certain behaviours which is pretty frustrating considering you'll lose most of your crafted items in your inventory. This wouldn't be as bad if the saves you can load back to didn't all start at the beginning of the day (meaning you have to repeat the daily routine all over again).",
            "review_score": "-1"
        },
        {
            "review_text": "As much as I want to like this game I can't because of it's steep learning curve and the fact that guards some how know everything as your escaping, I've applied for a refind and hope to spend it on a worthwhile game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is great. I have been hooked ever since I bought it! 10/10 would play it again.",
            "review_score": "1"
        },
        {
            "review_text": "With the contents of this game, I now know how my uncle escaped from prison.",
            "review_score": "1"
        },
        {
            "review_text": "As a few people have highlighted, there are some major flaws in the gameplay on this game. Its a nicely put together title in the 8-bit format, and it reacts as you would expect in terms of interface. But the issue here is with the gameplay which is the main focus for 8-bit format titles. The instant bust is a killer in terms of your trial and error attempts to escape. The main issue being where you hide your contraband in that any point you are busted doing anything escape like your entire cell and stash is taken.  hiding stash in vent shafts can work but you need a ton of fake vents on hand as there is no warning when they will and at a night you then have no chance to fix it and again lose all your stuff.   Let alone snipers picking you off in the middle of the cell block and keys being traced back to you?!?!  Some of the failings (and this is on the first level mind!) are just too tough to get around especially when learning the game. The issue that you can only save at night (when you want to put your plans in action) means to save you need to wait a whole other day then try again. Why not just add a quick save and let people play and try to beat the game!?  Anyway its an alright title but with some major frustrations that once you lose a days play there isn't enough in the game to make me go back and keep repeating it - and on that front for the money i can't recommend it.,..",
            "review_score": "-1"
        },
        {
            "review_text": "If you're looking for a positive review, then you're in the wrong place, HOWEVER, if you're here for a tremendous chicken Stir Fry recipe, THEN LOOK NO FURTHER!  - Serves 4 - 10 mins to prepare and 10 mins to cook - 325 calories / serving - Healthy  INGREDIENTS:  - 1 orange, zested and juiced - 2tbsp soy sauce - 2tbsp sesame oil - 250g (8oz) tender stem broccoli - 5cm (2in) piece root ginger - 1tbsp sunflower oil - 1 garlic clove, finely sliced - 1 red pepper, deseeded and thinly sliced - 150g Straight To Wok Noodles - 400g (13oz) chicken fillet, cut into thin slices  METHOD  Step 1 - Mix together the orange zest and juice, soy sauce and sesame oil and set aside.  Step 2 - Blanch the broccoli in boiling water for 2 minutes, then drain well and set aside.  Step 3 - Finely shred the ginger. Then heat a large frying pan or wok, add the sunflower oil, heat it until sizzling, and fry the ginger till it's crisp.  Step 4 - When it's done, remove with a slotted spoon. Add the chicken and garlic, and stir-fry until just browned. Remove the meat using a slotted spoon and set aside.  Step 5 - Add the red pepper and broccoli and stir-fry for around 2-3 minutes until it's just tender. Add the soy sauce mixture, bring it to the boil then return the chicken to the pan and heat through. Serve with noodles.",
            "review_score": "1"
        },
        {
            "review_text": "Takes way too long to do everything, also there's no room for error. Really not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "its good for about 15 minutes - an hour",
            "review_score": "-1"
        },
        {
            "review_text": "It was ok then it got boring",
            "review_score": "-1"
        },
        {
            "review_text": "Bullcrap, Why would I just give up if someone sent me some stupid asf letter saying they think im stealing from guards!? WTF!! WHAT ****ING LOGIC IS IN THAT!?",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just way to hard even the first level is just impossible i geuss",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so bad that I'd rather staple my left testicle to a bear's paw and watch it try to slap it off while I furiously masturbate with a cheese grater than play this for another second.  It's terrible.  please dont buy this",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this because it looked like fun on Twitch. Turns out to be boring and frustrating.  My opinion is that it lacks hints.  The game is pretty much die and retry but instead of being challenging it makes you want to give up because you never know if you're getting closer from the escape or if you're not going anywhere...",
            "review_score": "-1"
        },
        {
            "review_text": "Don't like the game, why isn't it in full screen. Overall, sucks ♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get me wrong , I can understand why people may enjoy this game but me personally ,I don't.   I kind of wish i had requested a refund earlier on this game because it's so bloody confusing , basicly if i duisguise myself as a gaurd : they kill me , accidently step on a table :they kill me , take a ♥♥♥♥ on the ♥♥♥♥ing toilet , they kill me and all this is on the 'very easy' level",
            "review_score": "-1"
        },
        {
            "review_text": "Can I please have a refund? Steam won't allow me to get a refund because I have 1 hour too much played on the game. Most of witch was spent on erasing and re making a save file.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ING STUPID I LOST ALL MY PROGRESS I WAS UP TO LAST PRISON AND NOW I HAVE TO START AGAIN",
            "review_score": "-1"
        },
        {
            "review_text": "The American Civil War was a civil war fought from 1861 to 1865, to determine the integrity of the United States of America as it defeated the bid for independence by the breakaway Confederate States of America. Among the 34 states in January 1861, seven Southern slave states individually declared their secession from the U.S. and formed the Confederate States of America. War broke out in April 1861 when they attacked a U.S. fortress, Fort Sumter, and ended with the surrender of all the Confederate armies in spring 1865.  The Confederacy, colloquially known as the South, grew to include eleven states; it claimed two more states and several western territories. The Confederacy was never diplomatically recognized by any foreign country. The states that remained loyal including border states where slavery was legal, were known as the Union or the North. The war had its origin in the factious issue of slavery, especially the extension of slavery into the western territories. Four years of intense combat left 750,000 soldiers dead, and destroyed much of the South's infrastructure. The Confederacy collapsed and slavery was abolished in the entire country. The Reconstruction Era (1863–1877) overlapped and followed the war, with its fitful process of restoring national unity, strengthening the national government, and guaranteeing civil rights to the freed slaves. ",
            "review_score": "1"
        },
        {
            "review_text": "I played it I remembered how sihtty it is I uninstalled it and requested a refund. 10/10",
            "review_score": "-1"
        },
        {
            "review_text": "My usual reviews have a list of comedical flaws. But not this one. No, this game is $hit. You`re throwing your money down the well buying this game. Welcome to hell, the newest edition of Clicking Simulator with no stimulation. Crafting in this game is like a dumber minecraft, where you look through wiki pages, but instead of finding what you want, you find 20 other things you need to do and craft to get it, until you realize you`re missing one valuble thing to do any of it.  THE FLAWS:  - Bad Game. Sorry to anyone who likes this. You live a sad existence.",
            "review_score": "-1"
        },
        {
            "review_text": "OK. got a refund because santa dlc wouldnt work",
            "review_score": "-1"
        },
        {
            "review_text": "don't drop the soap.",
            "review_score": "1"
        },
        {
            "review_text": "The only Reason Why Im not recommending this gane is because theres no Coop if you wanna play with friends it be even more fun! but noooooo they just make it solo so this game is a 8/10 reason no coop and you can get caughted by digging in other cells?! thats really stupid",
            "review_score": "-1"
        },
        {
            "review_text": "Impressivly tedious!  This game takes item durability mechanics to a new horrifying level. All starting tools break after 8-10 uses. A true gem of a game. The most fun I had was trying to figure out how to play it because the tutorial is 30 seconds long and tell you nothing. That fun lasted for 30 minutes and then I spent the next 8hrs doing the same crap over and over, working out, making license plates, eating lunch, eating dinner, going to rollcall, buying items, crafting items, hiding items in the vents, and beating people up out of boredom. I could go on and on about all the flaws in this game but instead I will just say, the people that think this game has a lot of depth must only play games on their iphone.  2/10 easiest uninstall of my life.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a very goodgame and ive already spent a long time on it and plan to spend much more, but recently, snce the 1.05 update, ive been bumping into this glitch which causes time to go super fast and all the events happen instantly. Id like to se this fixed as it has happenend to me about 4 times in 3 days.",
            "review_score": "1"
        },
        {
            "review_text": "this game is great. nuff said",
            "review_score": "1"
        },
        {
            "review_text": "I have found this game to be REALLY adictive. And the music is great. i haven't beat the 1st prison, but the game is defenetly a game I would buy any day. ",
            "review_score": "1"
        },
        {
            "review_text": "The game is pretty cool actually. Escaping from prison isn't something we see in a lot of games these days. It works on just about any system without too many problems. Gameplay and mechanics are all pretty good and the game is pretty easy to pick up and play.   However ..... this is a game that fits into the 'YouTuber Bait' genre. As good as the game is I feel its success is bulit up on being popular on YouTube and not because of how good the game is. A minor complaint to be sure, but its something for you to think about.  I still recommend it though. It tries to offer something different, instead of the same mindless first person shooter / minecraft clones. Its not a bloody rogue like and its not a metrovania style game.   Seriously though give this game a go. Worth a buy, but not at the full £12.99.",
            "review_score": "1"
        },
        {
            "review_text": "i Really like this game its fun for your friends to play and for you to play.In the game you must tired your hardest to escape 6 prisons good luck",
            "review_score": "1"
        },
        {
            "review_text": "so far this is a great prison escape simulator it is very fun to play and hard to learn at first hard to start out with but a great game to play if you like prison simulators",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best games i ever played. Escaping each prison is a challenge, that I enjoy. I only had it a week or two but i already invested over 70 hours, and escaped the 6 main prison.",
            "review_score": "1"
        },
        {
            "review_text": "great game highly recommended it is deffinently worth 18 dollars it is so much fun trying to escape and do whatever you want in a prison",
            "review_score": "1"
        },
        {
            "review_text": "In 1966, Lexdyslic escaped from Centre Perks Prison. All they found from him was a muddy set of prison clothes, a bar of soap and a rockhammer, damn near worn to the nub. I remember thinking it would take a man 600 years to make a tunnel out. But all it took was 28 days and a poster to hide the hole.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game its the best it is worth the money!",
            "review_score": "1"
        },
        {
            "review_text": "amazing so many ways to play the same game in so many challenges once you key into how the game works it gets easyer but luck is still a challenge to master",
            "review_score": "1"
        },
        {
            "review_text": "Basic attempt to escape prison: escape via vents and cut the outer fence (center perks, first prison) attempt 1: Removed the vents, was on mah way to the ladders that lead to the roof, was arrested and sent to solitary because my vent was missing. attempt 2: Removed the vents, placed a fake vent cover, and was on the way to the ladders. got on the roof, and was immediatly shot dead because you cannot get onto the roof. attempt 3: Went at night(lights out), placed a fake vent cover, and made it onto the roof safely (no searchlights). was arrested becuz there was no-one in my cell and we were supposed to be sleeping. attempt 4: stuck a bed dummy on my bed during lights out, stuck a fake vent cover, made it onto the roof successfuly. couldn't get down because i forgot to bring a length of rope. was eventually arrested when i was returning back to my cell.  Honestly, it would be cool if you could make your own prisons, although I know the guys that made this game are probably working on that. Maybe that could somehow implement mulitplayer? Like mulitple guys assist each other in escapping, or it could be cops and robbers all over again...",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best ",
            "review_score": "1"
        },
        {
            "review_text": "Was fun until I dropped the soap.  11/10 - IGN",
            "review_score": "1"
        },
        {
            "review_text": "Still trying to escape the first prison...   200 days.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! I used all my money on it and I really want GMOD but I guess this is good. The Escapists has this feel that makes you want to escape all the prisons so you can be the top escapie. (DONT KNOW IF THATS THE RIGHT SPELLING) I would suggest buying this, its worth the 17.99 used on this.",
            "review_score": "1"
        },
        {
            "review_text": "I have come across a huge conspiracy theory.*Plays 'The X-Files' theme* This game takes place in the year 2138, when asexual aliens, known only as 'the guards' have invaded Earth, and destroyed most of the planet. The few survivors, are put in prisons. This would explain why, even in POW camps, the guards are all the same. I also believe that the following prisons are not located on earth: -Camp Epsilon -Jungle Compound -HMP Irongate And the reason stats drop so quicly, is due to a chemical placed in the muscles of you, and only you. The aliens see you as a threat, and have decided to try to stop you. Allied prisoners have had chips implanted in their brains to forget about you, which is why they lose opinion so quickly. I have more, but someone is at the door.",
            "review_score": "1"
        },
        {
            "review_text": "its great for a fun and inventive time",
            "review_score": "1"
        },
        {
            "review_text": "Great Game bit hard at first but soon enough your get the hang of it and be a escaping master mind MAHAHAHHAHAHHA 1000000000000000000000000000000000/10",
            "review_score": "1"
        },
        {
            "review_text": "Love this game so much, but we need more prisons, more ways to escape and not as much lag.",
            "review_score": "1"
        },
        {
            "review_text": "OH MY GOD SO GOOD The retro graphics just pull it all together &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Love the game! All of the routines, and choices you must make to escape really shape the game. You did something special with this!",
            "review_score": "1"
        },
        {
            "review_text": "it is great but ever since the full relese and now i cant play the game im very upset",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game! Prison Editor will be soon. Can't wait",
            "review_score": "1"
        },
        {
            "review_text": "amazing game id buy it 5 more times if i could. all it needs is a map maker or editor and and a map sharing system",
            "review_score": "1"
        },
        {
            "review_text": "ok i love thus game but it stoped working D'= it says Steam Initalitialization failure",
            "review_score": "1"
        },
        {
            "review_text": "I really LOVE this game. not too too hard but not too too easy. It is a prison life game that you have to escape almost 10 different prisons and a tutorial. so... I LOVE IT!!! 7/10",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING. his game is a fun and challenging experiance",
            "review_score": "1"
        },
        {
            "review_text": "this game is awsome !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! :D",
            "review_score": "1"
        },
        {
            "review_text": "Great strategy game for everyone I would love for it to have custom controls but apart from that it is great especially the soap acheivment",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would rate again",
            "review_score": "1"
        },
        {
            "review_text": "Serious lack of game mechanics, items, favors, intelligent AI, and just about everything else.  Still can't understand how this is getting so many positive ratings. It is boring grind.  The concept is great and with some more time it should be an awesome game. As of this review, it is not worth the full price. Get it on a 80% sale because that is what it is worth.",
            "review_score": "-1"
        },
        {
            "review_text": "the escapists is a very well done game i adore the escapists but you should watch jacksepticeye he is boss at it and you should subscribe to him that would mean a lot to him :) ;) HAPPY",
            "review_score": "1"
        },
        {
            "review_text": "Really good game though the pixels are differant but i like it also there are some glitches once a guard went through a wall and took all my stuff which is annoying but other than that good game and fun",
            "review_score": "1"
        },
        {
            "review_text": "i started the game and the screen is tiny and is just on the top right of the screen and when i try to start a prison the screen is just black and white circles",
            "review_score": "-1"
        },
        {
            "review_text": "Fun, cute visuals, and with a workshop it adds massive replayablity, and to challenge your friends. Overall, I love this game (shame i don't play it alot). Shame some mods are buggy.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "i recommend this game but the map editor is borken for me and there is no where that i can see to unbrake it it just popes up then you need to pres new project then it f ucking crashes and there is no where i can fine a way to f ucking fix this sh!t it is anoying",
            "review_score": "1"
        },
        {
            "review_text": "its good buy it with your tokens",
            "review_score": "1"
        },
        {
            "review_text": "What's to say about this game? It reminds me of the SIMs but instead your injail and have to escape with out getting caught, and no matter what you do, you'll always end up in trouble with the guards or other inmates so if your looking for some laughs get this game",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game that I used to play until I switched to mac... Please allow OSX compatability ",
            "review_score": "1"
        },
        {
            "review_text": "This game is hard, but very rewarding!",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Fhurst peak is awesome. Game design is beast. Would rate 11/10! Escaped in day 3 on center perks just by going out the back of my cell at night :D. 2nd day i got beat to death with a sock filled with soap.",
            "review_score": "1"
        },
        {
            "review_text": "it is fot ♥♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Love it but I really do wish I could play with friends, it kind've gets boring by yourself after awhile",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would escape again",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite games I have on Steam. I would reccomend this game to anyone. If you ar econsidering getting this game, get it!",
            "review_score": "1"
        },
        {
            "review_text": "I Escaped a Maximum Security Prison IRL, by using tactics i learnt in this game.  10/10 game, Plastic Spoons are truly a magnificent item",
            "review_score": "1"
        },
        {
            "review_text": "I reccomend The Escapists for anyone who has two hands, so you can play. Heck. One hand will work, too.",
            "review_score": "1"
        },
        {
            "review_text": "i love the escapist it has to be one of my fav games in the universe i love the idea of you trying to escape a prison theres barley eney fun games like that besides the escapists",
            "review_score": "1"
        },
        {
            "review_text": "evertime is trie to go to stalag flucht it wont let me ",
            "review_score": "1"
        },
        {
            "review_text": "A very addicting and enjoyable pixel game! I still can't escape though. :(",
            "review_score": "1"
        },
        {
            "review_text": "The Escapists! This is a very fun game and a great strategy game that I personaly enjoyed!  Though, this game is made for patient people. You cannot finish the first map after you are at least a few hours into the game. It was hard, frustrating, difficult but still a fun experience to play the game and I really recommend buying it!",
            "review_score": "1"
        },
        {
            "review_text": "Great game  ",
            "review_score": "1"
        },
        {
            "review_text": "i would like to tell you about one of my first experiences with this game, still in center perks even. victory was within my grasp. i was camping the visitation at night, a whip in my hand. i knocked out a guard, and bound him with my rope i had trouble finding. one guard down four to go. for a minute no guards passed the visitation, so i began to search around. then i suddenly recieve a letter from the warden. SILLY ME!!! i had forgoten to make a bed dummy and had been put in solitary. all my hard-earned tape and rope, gone in the wind! i then proceded to rage and created this review, this is a great game and requires some deep thinking. sadly for me i forgot my ducky tube and drown in the finale. i only had one problem. when trying to recruit a buddy no button appeared that allowed me to recruit him.",
            "review_score": "1"
        },
        {
            "review_text": "love this game ten outta ten would escape agian         10/10 IGN would escape agian",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "This game had great potential from the begining, I am looking forward to see where they go with it.",
            "review_score": "1"
        },
        {
            "review_text": "As long as you find some bloody Duct Tape then it is fun",
            "review_score": "1"
        },
        {
            "review_text": "Very good I'm being forced to do this :*(",
            "review_score": "1"
        },
        {
            "review_text": "Has great potential. Highly recomend.",
            "review_score": "1"
        },
        {
            "review_text": "Sadly I would recommend this game, if it weren't for the old and current price. I was stupidly persuaded into getting it and regretted it. The Escapists is fun but is really repetitive and there is no real sense of achievement. The workshop intergration and the map creator is fun but it is also really hard and there is no templates you can use.   Overall- Do not recommend game unless it is on sale or gets a good update in the future",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome game I recommend It! graphics: great graphics its a game that any kid, teen or adult can play! gameplay: great game i just found a flaw when someone else logs on your computer with your steam it will change you're data to theres soo i have to do Stalag Flucht all over again Ideas: add multiplayer and add more prisons Flaws: That Log in thing up there,a guard glitch where they will continuously unclog your toilet when it gets clogged sometimes. Overall Review:Its great game!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is AMAZIN and worth every penny BUY THE GAME",
            "review_score": "1"
        },
        {
            "review_text": "Great game!! Worth the money",
            "review_score": "1"
        },
        {
            "review_text": "Pretty nice, although it can be quite hard(still haven't completed the first level :|). One small defect is that it can be slightly monotonous(repetion of tasks). I really enjoy laying this game, and I hope others will consider playing it as well.",
            "review_score": "1"
        },
        {
            "review_text": "Started new profile. named some guy batman. Batman asked me to beat up batman. 99999999999999999999999999/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10. Great game for casual gamers, never becomes boring, can make custom speech files, has the references for thr adults. How much more could you ask? All that i would have them add is a zoom feature on map editor.",
            "review_score": "1"
        },
        {
            "review_text": "it is a fun strategic game for all ages.",
            "review_score": "1"
        },
        {
            "review_text": "My friends said that it was great so i bought it but found out soon that it swears. I sadly tried to get my moneys worth by playing it alot before they made refunds available so i cant get a refund",
            "review_score": "-1"
        },
        {
            "review_text": "The game still needs work but its the best prison escaping game on steam by far, I love it.",
            "review_score": "1"
        },
        {
            "review_text": "With inivative ideas and simple gameplay combined in the wonderful game that is The Escapists i woud honestly have to give it a 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "i dont know how but it seems like ive been playing 2-3 hours but ive been playing 8+ i enjoy this game and i play it when im not watching youtube in my free time a special thanks to Jacksepticeye for playing this and making me wanna play it    ------------  | o o |  | |  | ----- |  ------------",
            "review_score": "1"
        },
        {
            "review_text": "I really like the game for its level editor, it gives you the option to create EVERYTHING in the prison which is so cool! The game itself is also great, so many ways to escape it just makes you want to go back to some prisons to try escaping in a different way!",
            "review_score": "1"
        },
        {
            "review_text": "It should have controller support!",
            "review_score": "1"
        },
        {
            "review_text": "i think the game is great if you put it all together and the games about planning, character and being fabulous",
            "review_score": "1"
        },
        {
            "review_text": "This is very good game",
            "review_score": "1"
        },
        {
            "review_text": "Day 1- First day in my new prison. Have no idea what im supposed to do. Day 2- Find out I can dig out with plastic spoons.  Day 3- Get shot while trying to dig, and has to restart again.  11/10 Spoons.",
            "review_score": "1"
        },
        {
            "review_text": "its a lot of fun",
            "review_score": "1"
        },
        {
            "review_text": "Found dirt in my cellmate's desk and had to turn him in Hector didn't want me to and offered to let me come with him, doesn't he know I like it here? In Center Perks I get free WiFi! So, first thing I done at breakfast the next day was give the dirt I found to Officer Axel, he said 'thanks to me' but all of a sudden all surrounding guards jumped me... I'm know in solitary writing this review (I know the WiFi password, shhhh).  10/10 would dig through concrete with plastic spoon again",
            "review_score": "1"
        },
        {
            "review_text": "hi its a good game 15/11 IGN ",
            "review_score": "1"
        },
        {
            "review_text": "This Games Awsome You Can Do Lots of Stuff in it :)!",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game just one thing when I turned on the escapists it put me on center perks when I was one the second prison and when I closed the game it didn't fix it. So just check and make sure it didn't happen to you.",
            "review_score": "1"
        },
        {
            "review_text": "The first impression of this game so far is very very good, i'm mostly thinking 'how can this be so good? it's so simple' but that's the power of it, it's deeper than it looks but doesn't feel needlessly complex or unfair in any way.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun to do in my spare time! I'm always bored, gaming, watching YouTube... And The Escapists is a game I play almost daily! I only need a one day break a week because after guards catch me, it gets frustrating fast. This game has actually taught me to deal with annoying people in my real life, too. So it helps you to stay calmer in situations, teaches you strategies, and is a fun way to pass time! Or stay up late... Another thing, the map editor is so much fun! You can either play others' maps, or make your own and play it! And if you want to play mine, it's: BOSS Enough Jack And that brings me to my next point. It's always fun for me to watch my favorite YouTubers play this game. Two examples are Jacksepticeye and was Markiplier. I watched Jack play first and got the game!  My main point being on a scale of 1-100, this game is a 9.999 trillion. I just love it so much.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 BUT!... After the 1.05 update i lost Fhrust Peak Correctional Facillity, which i bought and download the game and dlc today. Please send me a comment on how to fix or get it back if this review help",
            "review_score": "1"
        },
        {
            "review_text": "Is my guy deaf, or is all the text going blank just a bug?",
            "review_score": "-1"
        },
        {
            "review_text": "I love the game its so good its so awesome",
            "review_score": "1"
        },
        {
            "review_text": "There should be a multiplayer...",
            "review_score": "1"
        },
        {
            "review_text": "love the game but  ME WANT ADD-ONS",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love this game! Worth buying; a lot of fun to play. The only thing that could improve this game is a co-op mode. Fun while you're doing well, devastating if you get caught. I reccomend The Escapists to anyone and everyone.  MY EXPERIENCE:  Day 1: Accidentaly got locked outside at night and was shot for not being in my cell...  Day 2: Miraculous recovery. Tried to beat a few people up as favours to others, ended with me being carted to the infirmary... again...  Day 6: I have developed a plan to tunnel out. I must bide my time and collect the equipment i need.  Day 16: The tunnel is almost done, only a day or two to go!  Day 18: I was caught. My tunnel was filled in and my equipment confiscated... I need a new plan...  Days 19 to 42: WHY IS NOBODY SELLING ANYTHING I NEED!?",
            "review_score": "1"
        },
        {
            "review_text": "I love everything in this game but i wonder when a prison editor will be out. Does anyone know when a prison editor will be out?",
            "review_score": "1"
        },
        {
            "review_text": "Love the game, I played one level at my friends house on his xbox one. The two versions are nothing alike, there a contraband detectors which are annoyin, but other than that it's great!",
            "review_score": "1"
        },
        {
            "review_text": "I love the game! its really fun and its worth every penny since the game is edgy and has lots of play time. Im still on the second prison and im doing terrible but its really fun! Keep them updates comong :}",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game you can play maps and create maps and there are no games like this",
            "review_score": "1"
        },
        {
            "review_text": "I very well recommend it! The gameplay is great, and it's just very addicting! If there was a map editor here, I would play this all day long.",
            "review_score": "1"
        },
        {
            "review_text": "There is so many ways to escape Great game!   ",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent indie prison escape game. From the soundtrack, to the hilarious comments the guards and inmates sometimes say, this game is AWESOME! The recent addition of a level editor is pretty cool too, where you can build and upload your own prisons! If I had the power to tell Team 17 one thing to add to this game, it would be co-op. Just imagine how fun that would be! Escaping prison WITH FRIENDS! The DLC is pretty awesome as well, too. They managed to recreate Alcatraz in this thing! All in all, buy this game, and when you do everything, play Alcatraz!  MangleMonster Out!",
            "review_score": "1"
        },
        {
            "review_text": "I love the game and everything but what would be great if you would put it on XBOX 360 Since its on Xbox 1 and PS4 but i cant afford both of those and i already have an xbox so if you putted on xbox360 that would be awesome   -General",
            "review_score": "1"
        },
        {
            "review_text": "Huge learning curve when you first start, until you keep trying at it for the first few hours and not knowing the crafting recipes, it's not easy to get into but when you actually get a plan and make your first steps to escaping it starts gets addicting and is generally tough and several ways to escape.  My only cons is the lack of recipes, charcters to select, and the fact that without the crafting guide on the wkia page, your won't know what to do, even if you collect crafting notes as you can only have a certain number of pages in the easier prisons. The first only gives you 2 pages of 4 or 5 recipes. So the crafting notes seem really useless besides the achievement.  To make it realistic, when you turn off a generator maybe have it turned off till a guard notices than a short period, it might make it easier but it's more realistic that when you turn off a generator it stays off, and not magically start again in 1 minute or 2 cause ghosts or some unseeable entity turned it back on.  More recipes (duct tape + nails + silk hankerchief = spiked knuckles, etc) and maybe a proper character creator would be great, seeing as it's sprite work wouldn't be that hard, gonna check the game files and hopefully I could mess around with the spritesheets.",
            "review_score": "1"
        },
        {
            "review_text": "great game, would recomend",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "      Topic   Rating       Graphics   9/10       Gameplay   9/10       Fun   10/10       Stressfulness   10/10      With almost 100 hours of my life spent in this game, I can say I don't regret it.  This game is an original concept with pixelated graphics and simply amazing gameplay that will get you addicted quite easily. I originally bought this game in early access thinking I'd just try it out and soon found out that I'd actually really enjoy it. I love this game deeply but at the same time want to throw my computer at a wall because of it. The increasing difficulty really challenges you and makes you look back at the last prison you played and say 'That was ♥♥♥♥♥♥♥ easy' or 'I wanna go back'. At the current time, I'm still trying to figure out my escape for San Pancho and from time to time playing some workshop prisons.  In conclusion, whether you want to throw your keyboard at your neighbor or bribe a guard to get out of Alcatraz; Buy this masterpeice of a game.",
            "review_score": "1"
        },
        {
            "review_text": "Epic game but map editor doen't seemto work on my computer...",
            "review_score": "1"
        },
        {
            "review_text": "An AMAZING Game, Doing a series on youtube, but i don't know how to make a support for when i'm digging below ground, Nothing at all wrong with the game just don't know how to make one, if anyone could tell me i would be very thankfull.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome!  Reasons ^-^ 1.Cute pixel characters 2.AWESOME AI and the prisoners chat ^-^ 3.Cool items you can craft and try to escape! 4.Create sweet levels and download them 5.Not just 1 prison but there's even more and harder prisons!  6.Name  characters! &lt;3 7.Just download this game and have fun ^-^ &lt;3 &lt;3 &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "This game is really basic, but really fun. I love the pixel art and the music. I would love to see a multiplayer feature.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. SUPER FRUSTRATING. I only recommend this game if you are able to not rage at this game.  Pros: -cops are dumb and won't take a look at what you're doing around the corner -cops see you get hit and attack the inmate who is trying to knock you out -inmates don't steal from you, but you can steal from them and it won't matter one bit  Cons: -cops see you attacking ANYONE and they start attacking you -if you make the mistake of stepping on something or picking anything up they yell at you -they will start attacking you if you get yelled at too much  I might change this if i can?",
            "review_score": "1"
        },
        {
            "review_text": "Earlier this week on stream I was recommended by a viewer to purchase and play this game. Prior I had no knowledge of how to play I took it upon myself to learn and try to complete the game. As I've spent nearly 7 hours on the easy and first level of the game, I've came to the conclusion that this game isn't actually possible to complete as the guards will always catch you, whether you max out your stats and collect all keys, if you steal the guards uniforms, and even try to clip the gates away. There will always be a variable in the game that will force you to restart from scratch because the guards will later raid your cell and you'll be forced to start over. Do NOT recommend, 0/10 I now have squirrel aids. SQUAIDS. It's rare.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome so cool",
            "review_score": "1"
        },
        {
            "review_text": "The Escapists had a lot of potential to be an engaging way to plan an escape. However, the rules of the game are oftentimes vague (like not knowing where items can safely be stored). The crafting system offers a lot of variability in what you can make, but it is damn near impossible to figure out most combinations on your own, requiring to luck out and find or buy crafting notes from other prisoners. The way to gain stats is grindy as all hell, and trial and error gameplay is just too necessary. I wanted strategy, not grinding and guessing.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the best game ever",
            "review_score": "1"
        },
        {
            "review_text": "is game reminds me of cop n robbers because it is so funny. i find it funny that you get told of for going in somones room and you dont get told off and you dont when you are diggy a hole and how do you get shot and you dont die...",
            "review_score": "1"
        },
        {
            "review_text": "Holy balls dudes. HOW CAN YOU NOT LIKE THIS GAME?! So much planning... so much fail... BUT IT'S SO REWARDING WHEN YOU ESCAPE!! 10/10 - IGN P.S. Would drop the soap again. And for real now, it needs multiplayer xD.",
            "review_score": "1"
        },
        {
            "review_text": "escaping prison with a plastic spoon simulator 2015",
            "review_score": "1"
        },
        {
            "review_text": "This game is very hard and challenging but it is super fun. I would reccomend it",
            "review_score": "1"
        },
        {
            "review_text": "The game is a semi-realistic approach to how prison life is, to some extent. The humor from the inmates' dialogue and the somehow hilarious bellittling from the gaurds is an uplifting tone from an otherwise extremely horrible experience. If I was given a scale from one to ten, one being stupid and ten being the best game in the world, I would say an eight.",
            "review_score": "1"
        },
        {
            "review_text": "I really want to meet the people who actually figured this stuff out",
            "review_score": "1"
        },
        {
            "review_text": "very good i recommend it to the time spent playing i played 148 hours of it ",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, spent lots of time on this game playing prisons over and over again trying to find the best ways out, still haveing trouble with some but I have trouble playing this game for long periods of time, it sort of loses my attention once I stop playing. But all in all its a fun game and would R8 6.66/8",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun and a great time killer. I have played 10 hours and it has felt like nothing. I really reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, only managed to make it past the first non tutorial level so far, there is lots of stuff to learn and practice",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game for anyone who likes puzzles, strategy and overall fun.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, but challenging, so if you're into those kind of games it is fun, and don't believe that the real game is as easy as the tutorial, I did :(",
            "review_score": "1"
        },
        {
            "review_text": "Playing the Escapists was really fun. It is a fun challenge to figure out a way to escape. Although, when I escaped around 5 prisons, it got really boring. I like this game overall. I recommend this game, but the prisons take lots of time and effort and it gets boring after a while.",
            "review_score": "1"
        },
        {
            "review_text": "this game is so fun it about stratergies to get out of prison so fun ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game I completely recommend it to anyone that has a lot of extra time, such as me that love to make something out of it such as completing a very good game.",
            "review_score": "1"
        },
        {
            "review_text": "i suck at this game but it is fun",
            "review_score": "1"
        },
        {
            "review_text": "if you are looking for a game with multiple choices, this just might be the game for you. i have only watched DanTDM play this and i begged my mum to get it. first thing i did when i bought it, played it. offers a variety of choices.",
            "review_score": "1"
        },
        {
            "review_text": "i would rate GOTY",
            "review_score": "1"
        },
        {
            "review_text": "This game is so fun and hard that I would rate this 10/10. like moms say these games rot your brain but what about this one? This game has so many ways to escape and get better at the game that I forget most of them. Best game 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "My name is BaldEagle. I spent my days throttling Darren, the unfortunate fellow prisoner who had the bad idea of picking a fight with me on my first day. Days are spent kicking Darren out of his seat at breakfast, lunch, and dinner, beating him up when the guards are around or not, and flushing his teddy bear and clothes down his own cell toilet. I occasionally have the drive to attempt breaking out of jail, and usually fail.  One morning I just throttled everybody in the jail and ran out the front door with a ducktaped guard lifted over my head.  10 sock maces / 10 sock maces",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun! It would be even better with multiplayer players could dig underground tunnles to connect their cells and trade items at night or they could go throw vents and rob players too! Long story short... multiplayer!",
            "review_score": "1"
        },
        {
            "review_text": "this is a very good game",
            "review_score": "1"
        },
        {
            "review_text": "Defenitly worth the money i could play this game hours on end and even better they're still adding Dlc to the game!",
            "review_score": "1"
        },
        {
            "review_text": "Addictive and fun",
            "review_score": "1"
        },
        {
            "review_text": "lifted weights until i got 5 cup of molten chocolates and tape. walked out the front door. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Don't Think about it, just buy it... Now...",
            "review_score": "1"
        },
        {
            "review_text": "This is the cool ist game innnnn the wwwwwwwwwwwooooooooooooooorrrrrrrrrrrlddd .__________. buy it",
            "review_score": "1"
        },
        {
            "review_text": "Locked up for life without a backstory, you wake up in a 2-D topdown prison simulation. Great game, really fun to play. Just escape the prison and- (Yeah there's no follow up story either, except that you ended up in prison again because you love it so much!)",
            "review_score": "1"
        },
        {
            "review_text": "I friken love this game to bits but the one problem I have with it is that its a litel bit to luck based luck is good in games dont get me wrong but its to much. One recamendetion I have is that you right click a guard and it shows what key they have.And maybe if you do a favor for someone and you get one item free from them.But I do love this game! :)",
            "review_score": "1"
        },
        {
            "review_text": "The DLCs and the harder maps are complacitedly fun if you like a challange ",
            "review_score": "1"
        },
        {
            "review_text": "The Ragists - The Great Escapism Fails 2015",
            "review_score": "1"
        },
        {
            "review_text": "This game is a true work of art. This gem may not have fancy graphics, but there is a cunning type of strategy implemented into this game. There may be a couple of moments where you will get stressed, but that is just a way for you to learn how to do better. Overall, the gameplay is great. The crafting takes some time to memorize, but is basically the only way you can get out of the prison. You need good tools for each of the prisons to avoid getting caught. Great strategy, great game. Buy it, play it, and then replay it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pure awesome. Not only can you escape prisons that the devs have made, you can now make your own prisons to post on the workshop or download some and play them for yourself.  Pros - 6 main prisons + 4 bonus prisons (including DLC) - Prison Editor - Console versions (Xbox One and PS4) - Works on most versions of windows (no mac version) - Nice sound and music - Nice graphics  Cons - Stats degrade too quickly - Game can get frustrating at times, especially on the harder prisons   ",
            "review_score": "1"
        },
        {
            "review_text": "Super fun trying to escape!! Definitely try this game! And because of the workshop, you can escape as many prisons as you want!!",
            "review_score": "1"
        },
        {
            "review_text": "Love it.   This game really tests your patience, and at times things can feel slow and unproductive. So it might not be for everyone. But the longer things take, the more intense the escape. It's great to go through situations of long term planning and taking risks to execute the steps in that plan.   The only thing that's missing is multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "someone beat up a guard.  the guard lost.  I took his key when no one was around.   'Nice try whipmario,'  How do you know know it's me ",
            "review_score": "1"
        },
        {
            "review_text": "More of a '30 seconds of fame' game.",
            "review_score": "-1"
        },
        {
            "review_text": "At first this game can be pretty enjoyable. Trying to figure your way out of a prison can be interesting and a real challenge. But really there are far too many problems for me to recommend.  The biggest problem, and what really forced me to stop playing is the aquisition of items.  Seriously, you can spend DAYS searching for a specific item you need to continue and at first it's easy to ignore while you do other things, but it quickly becomes a problem. Having to spend so much time just waiting for a roll of duct tape to magically appear in another inmates inventory or being unable to find the last ingredient to something gets annoying and tedious. I'm all for challenge in a game, but that's not a challenge its a wall you have to wait to get over, and that's not enjoyable.  Secondly, the game does a very poor job of giving the player information. In some ways its understandable, in others its pretty annoying. For instance, did you know you need a vent cover or else any guard who happens to wander near by will immediately spot it and throw you in solitary (confiscating all your items), that's okay, that should be a bit obvious I guess. But did you know you could cover the bars on your cell with bed sheets so they won't spot it? Did you know how to make a makeshift vent cover? No? Well good luck finding out. The best way to learn crafting rescipes is to go to the wiki, which just simply shouldn't be. You could of course try to figure out the recipes yourself, but as above you don't want to waste valuable resources experimenting you don't want to do that. You could of course buy or find the recipe and it will appear in a very unorganized list of all the recipes your character learned (a search function for the list would be fantastic).",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun, it really is, and it would absolutely be a positive rating if it wasn't for a few things:  The items in this game are randomly generated, and it is TEDIOUS as all hell trying to find the one specific item you need. Its especially more tedious when it comes to the fact that the most important items needed spawn even less then the normal items. Need a book? All you will be able to find is toothpaste. Need toothpaste? All you will be able to find is books. Like, seriously. I spend more time wandering around the prison, tediously checking every inmates desk day after day trying to find one specific item than I do actually escaping the prison. There are inmates that sell items, but they seem to always sell the same items, and rarely is it anyting important.   The game also gets kind of boring pretty quick. The only really fun, heart pounding parts are when your actually escaping the prison, knowing that at any moment, you could be caught, and all your progress could be diminished. But, thats really the only good part. The rest of the game is pretty much what I mentioned above: Walking around checking inmates desks hour after hour after hour, hoping you find what you need. The 'favors' you can do for your inmates are pretty bland, pretty much consisting of 'find me this' or 'beat up this guy'.  So, in conclusion, yes, this is a great game. However, lately, I've found myself playing it less and less because I know that all I will be doing if I do play it is wandering around, checking desks for hours and hours. So, if they can fix this issue, then I will be happy to give this games a thumbs up. But, for now, I'm pretty much forced to give this game a thumbs down.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is very awesome! It has very detailed crafting recipes,and its very simple,but very complex at the same time. Im currently on the third prison,Shankton State Pen,and im already having fun. But in this game you have to be really patient.BUY THIS GAME!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "i escaped prison with spoon 10/10 would escapist again",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely amazing, 11/10",
            "review_score": "1"
        },
        {
            "review_text": "only played 107 mins and im already addicted 1/10 -Its Aight",
            "review_score": "1"
        },
        {
            "review_text": "A very good prison game about how you need to escape a prison, the contraband and different maps+ super fun. what more could you ask for? oh yeah a cup of molten chocolate!!",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game, and the prisons are good, but when i make my own prison everyday i randomly get 100% heat, and the guard towers kill me, and also it doesnt render whats outside, so at night when i walk out, i get shot, i miss rollcall, and then backup kills me after 100 seconds. So game delvelopers, PLEASE fix this, because i want to play my prison in peace. But otherwise, Awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "i wish i had escaped before buyingthis",
            "review_score": "1"
        },
        {
            "review_text": "We need multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "Fun to watch YouTubers play but not very fun on it's own. :/",
            "review_score": "-1"
        },
        {
            "review_text": "A great little indie game that gave the life of me a prison break.  This might as well just be called 'Very Accurate Prison Breaking Simulator' but that would be long of a title.   This game is an incredible game that really sparked my interest.  I recommend this game. It's great.",
            "review_score": "1"
        },
        {
            "review_text": "seems like fun but i just saw it as the same thing over and over again",
            "review_score": "-1"
        },
        {
            "review_text": "This Is Easily The Best Prison Game Ever Made. Reminds Me Of Earthbound. Very Challenging. Duct Tape Is A Pain In The @$$ To Get. Great Gameplay.   Its Good In General. 10/10. No Lag Problems Whatsoever.",
            "review_score": "1"
        },
        {
            "review_text": "Great game and time passer. The graphics are simple but look great. They bring me back to playing pokemon as a kid.",
            "review_score": "1"
        },
        {
            "review_text": "This game is hard. It was a kick playing the game but in the end the difficulty got to me. This is one of those games that is fun to just talk with your friends and play together with, but I can't see myself playing this game for hours on end trying to escape.",
            "review_score": "1"
        },
        {
            "review_text": "awesome  problem: - buggy  few ideas:  1) maybe create some kind of settings or configuration that can increase variety of inmates staff. If you not-hardcore gamer you probably don't want spend an hour to find one or two Roll of Duct Tape or Ta;♥♥♥ Powder :) 2) maybe some guards can sell fixed (not random) set of things that can be used to escape",
            "review_score": "1"
        },
        {
            "review_text": "I found a glitch... If you eat by a wall and sit down and click sitdown again you will pop through the wall and be stuck in the wall... I did it at breakfast and i was stuck all day...",
            "review_score": "1"
        },
        {
            "review_text": "why am i in jail in the first place?",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun when you know everything in the map.",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome and holy crap they're making walking dead dlc hopefully its free for a 17 dollar game... hint hint this is still pretty cool would recommend, retro but not over done with it like other games try lol they didnt go overboard with the old game pixel style..",
            "review_score": "1"
        },
        {
            "review_text": "The Escapists is a very unique and creative game that I would recommend to anyone who wants to try something new. The only problems with the game are that there are a few glitches here and there and that getting valuable items is mostly up to random chance. Overall I would give this game a 9/10 because of its creativity and complexity.",
            "review_score": "1"
        },
        {
            "review_text": "To win this game you need the best combination of brain, brawn, duct tape, duct tape, duct tape, and duct tape.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a very fun game and a really deep game.But can you make a mode where YOUR THE GUARD instead of the prisoner?",
            "review_score": "1"
        },
        {
            "review_text": "This game is already amazing and im only on the 1st prison. cant wait to see what the devs add. its perfect enough for me but i wouldnt reccomend for impatient gamers.",
            "review_score": "1"
        },
        {
            "review_text": "I think the creators of the game should let the people that bought the normal game be aloud to buy JUST the extra stuff instead of buying it all over again.",
            "review_score": "1"
        },
        {
            "review_text": "A funny game where you play as a prisoner.i HIGHLY reccommend this ecpesssialy if you'r bored",
            "review_score": "1"
        },
        {
            "review_text": "this game is the best games in 2015 relley is true I likit its take time is escape in each prisen I like the workshop you did is nice thank you of making this game I like the map you cab build on this game bloo my mind to the sun awesome game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The Escapists' Map Editor is really cool. Now you can build your own prison.",
            "review_score": "1"
        },
        {
            "review_text": "It's a really fun and addictive game, it can be buggy but the gameplay makes up for it 100% of the time.",
            "review_score": "1"
        },
        {
            "review_text": "beating up guards",
            "review_score": "1"
        },
        {
            "review_text": "I most certainly recommend this game! It is fun, exciting and a workout for your brain as you think of bigger and more elaborate ways to excape. Its great for all ages as it isn't inappropriate yet is fun for the older, more mature audiences. Personally my favorite part is that I can actually run it on my computer as it requires little of my 3 year old netbook. All in all 10 out of 10!",
            "review_score": "1"
        },
        {
            "review_text": "I loe this game so much my cousin game shared it with me but im on the first prison and it's hard for me even though i watch this game alot so i should be Golden but im not xD ",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the most fun games on the steam market. The developers took time to make this thumbs up on that. Pros:  -Fun  -Realistic -2D -Decent price  -Big on steam community  -I R8 8/8 G8 B8 M8 -Vent cover is unlimited for me Cons: -Game crashs from time to time for me -Getting expensive..and not enough dlc need more -You dont Have it -no multiplayer MIGHT be good feature",
            "review_score": "1"
        },
        {
            "review_text": "i would give this game a ten out of teen rating ",
            "review_score": "1"
        },
        {
            "review_text": "Tried to escape through vents= Got caught Tried to escape through tunneling= Got caught in shakedown Tried to thorougly plan an escape, stole a guard outfit, created plastic replica key, placed bed dummy and grabbed cutters and left at night to escape= Caught in 20 sec  Made nunchucks and grabbed 2 pals and beat the litteral ♥♥♥♥ out of 4-5 guards= SUCCESS   .......  Onto the next prison",
            "review_score": "1"
        },
        {
            "review_text": "Too dank. That is all.",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome the only thing that could make it better is if there was a multiplayer ",
            "review_score": "1"
        },
        {
            "review_text": "A friend of mine keeps joking about how a plastic spoon can break down a wall. Don't be like this friend.",
            "review_score": "1"
        },
        {
            "review_text": "When your sent to prison,what do you do? Grab some plastic spoons and start digging of course! This is a great prison sim,and it's definetly worth the price. With so many ways to escape,and so many different maps,this is a wonderful game to lpay,whether your playing to waste time,or find the best way to escape all the prisons. 10/10,game is great.",
            "review_score": "1"
        },
        {
            "review_text": "This one of the best games i have played on steam, its so fun and its so addicting in a good way. Wanna spend your money on a game then The Escapists is what game you want to buy!",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful, hard, but beatuiful. Here's why, Isaac asks me to get him a muffin, I look in Isaac's desk and he has a muffin. Naturally I took his muffin to sell it back to him. 10/10 would sell someone their own muffin again",
            "review_score": "1"
        },
        {
            "review_text": "Graphics 4/10 Gameplay 7/10 Sound 2/10  It's a good game with challenging AI and with great gameplay, but it hurts my ears and eyes.",
            "review_score": "-1"
        },
        {
            "review_text": "Really creative and well constructed game. Lots of replayability so you will most likely not get bored of it. I highly recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "Didn't expect much from a pixel indie game but holy crap this is fun.",
            "review_score": "1"
        },
        {
            "review_text": "i play this because i like the 32 pixel gameplay cause' im into retro type games.",
            "review_score": "1"
        },
        {
            "review_text": "can you have the escapists in mac please",
            "review_score": "1"
        },
        {
            "review_text": "The only game where I can walk into the showers full of naked men and not feel insecure about myself.  This game helped me accept who I am.  I can't wait to go to actual jail.",
            "review_score": "1"
        },
        {
            "review_text": "Found out that my plan had a flaw. Literally had to flush all my hard work down the toilet. 10/10 would flush again.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game, it reminds me of the 8 bit days in the most nostalgic way...  This being said it isn't a play on the nostalgia factor but instead a very well developed game (some of the diologue could be fixed up a bit for sure) but for the ammount of thought that went into the other aspects of the game this is a moot point...  From hitting first roll call to figuring out the daily routine for each prison.. Figuring out and stashing what you need... Finding out the layout of the prison and ultimately putting together and executing the perfect escape... Or being caught and starting from scratch...  By day 5 of the first prison I felt for my 8 bit character and his digital plight and by the time I finally escaped (day 14 or so the first time) I felt like I might never get out from accidentally setting myself back a couple times...   The first escape was incredibly satisfying... For all the small steps you take day to day to culminate and pay off like that... Its a beauty of a game and for anyone nervous about buying an 8 bit game in a world where graphical realism is becoming almost indistinguishable from a live movie... Well you'd be hard pressed to find a game that draws you in like this..  And furthermore if the dev reads this... You develop the engine a little and you could definitely make this a running series with minor gfx updates (Like escapists 2 in 16 bit?) haven't ever played a game quite like this.. Very well done 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is my full verdict on The Escapists: I love the fact that the speech bank is completely random during rollcall- 'As I used to say to my cheating ex, someone flushed the wardens hat down the toilet' or 'As my old man used to say, I'll nod when you can speak' xD.This game is a bit costly and it gets a bit fustrating with the trail-and-error on every prison you go to and bang up in solitary confinement countless times (Also the stats for intelligence,strength and speed decrease too fast) but other than that The Escapists is a fun, colurful and creative game with so many awesome ways to escape the prison-My favoutite method is to disable all the cameras and bash the guards lights out (This method is callled a prison takeover). I also like the well thought out routines to keep the players from breaking out on the first day and I love the exercise machines which change on every prison( My personal favourite is the speed bags). It also has a wide variety of items to craft with over 16 pages worth of items in your crafting journal and the items that you usually find in desks or prisoner stashes. There need to be more prisons though but you can create your own prison with the level editor (I have made 1 or 2 decent prisons but the rest should be burned). I give this awesome game 8.7/10!( I still can't get past Shankton State Pen, though).",
            "review_score": "1"
        },
        {
            "review_text": "I love every last detail about this game. The only thing bad is the frustration of getting a certain item, which makes you want to play it even more! I've currently escaped the first four prisons, and the fifth one is getting me angry, but, this game is worth the $17.99 plus three DLC's   99.9999999999999999999999999999999999999999999999999999999999999999999999999999999999999909/100",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. I like the fact that, with games that have amazing graphics like Battlefield, the developers decided to go with pizels. The only problem i have with this game is with the map editor, there are no tutorials so it is a little difficult to use at first, and it takes a little while to learn.",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░▐▀█▀▌░░░░▀█▄░░░ ░░░░░▐█▄█▌░░░░░░▀█▄░░ ░░░░░░▀▄▀░░░▄▄▄▄▄▀▀░░ ░░░░▄▄▄██▀▀▀▀░░░░░░░ ░░░█▀▄▄▄█░▀▀░░ ░░░▌░▄▄▄▐▌▀▀▀░░ THIS IS SPOOKY BOB ▄░▐░░░▄▄░█░▀▀ ░░ ▀█▌░░░▄░▀█▀░▀ ░░ COPY AND PASTE HIM, ░░░░░░░▄▄▐▌▄▄░░░ SO, HE CAN TAKE ░░░░░░░▀███▀█░▄░░ OVER THE WORKSHOP ░░░░░░▐▌▀▄▀▄▀▐▄░░ ░░░░░░▐▀░░░░░░▐▌░░ ░░░░░░█░░░░░░░░█░░░ ░░░░░▐▌░░░░░░░░░█ ",
            "review_score": "1"
        },
        {
            "review_text": "Fun to watch YouTubers play but not very fun on it's own. :/",
            "review_score": "-1"
        },
        {
            "review_text": "A very addictive game in my opinion, Worth the $17.99",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun, but after a while feels very repative and really isn't my genre, but still lots of fun! If you aren't really into strategic games, there is a 50/50 chance of you liking it, and I think it was well worth the money, but whenever I get on again, I just get really bored. $15 for about 25 hours. It was worth it, but I don't think I'll be returning to this game soon.",
            "review_score": "1"
        },
        {
            "review_text": "A Great Game To Play! Great Simulator And A Good Way To Pass The Time! (Always Get The Red Key First!)",
            "review_score": "1"
        },
        {
            "review_text": "GRATE GAME LOVE IT.",
            "review_score": "1"
        },
        {
            "review_text": "Don't Think about it, just buy it... Now...",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AWSOME!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game has got that good good",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game around December 27th 2014 And it has improved highly And i would rate this game 5 Stars.",
            "review_score": "1"
        },
        {
            "review_text": "Holy Hardness! This game is hard! But it's good.   Okay first off, Gameplay. This game has okay gameplay. It's not bad, it just isn't amazing. You wake up, do a rollcall, eat breakfeast, get free period, and so on. It's simple. But after buying two screwdrivers and a file, a cookie, and a bed dummy, you go up a vent an escape! Sadly, you have to google many things to fully understand the game, but after that, the game is good! It is hard, but in three hours, I escaped Center Perks. The soundtrack is awesome! The only freaky one was the lockdown song. By the way, I once got stuck in a vent all night, and they had a lockdown. It scared the heck outta me! They never found me, so I had to delete the save file and start a new one.    In all, the game isn't worth $18, but it is a good enough game to stop your boredom and have a nice experience while it's a rainy day. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I love it just a few requests please add multiplayer a prison making mode and a mode where you play as a gaurd",
            "review_score": "1"
        },
        {
            "review_text": "I loe this game so much my cousin game shared it with me but im on the first prison and it's hard for me even though i watch this game alot so i should be Golden but im not xD ",
            "review_score": "1"
        },
        {
            "review_text": "You can punch prisoners and guards for no reason...... best game 10/10 would puch again",
            "review_score": "1"
        },
        {
            "review_text": "i love this game its the best it is worth the money!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazingly endless entertainment, HIGHLY RECOMMENDED. if you dont have this game then what you need to do is have this game. if you beat all the prisons you can just make more in the map editor and try those out, or download other peoples maps. all in all probably my favorite game I have so far.",
            "review_score": "1"
        },
        {
            "review_text": "It's even better now you can make your on prison's! And it's a puzzle game, and there always fun!",
            "review_score": "1"
        },
        {
            "review_text": "best game ever 71 plastic bags out of 34",
            "review_score": "1"
        },
        {
            "review_text": "this game is great to past the time. to even get close to trying to exit the jails takes hours of time and planing. would higly recoment it to any one",
            "review_score": "1"
        },
        {
            "review_text": "Great game, Fun for all!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, i have had it since Christmas an it was the best $10 I have EVER spent! This game is a game that I play whenever I'm bored because you get lost in the awesome power of it! Thanks Team17 and Moldy Toof Studios for making such an awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is cool and fun to play. You pretty much do anything and everything you can to escape from prison. Be sure to cover your tracks or else the gaurds will stop your escape attempt and lock you in solitary. Nothing is worse then forgetting to make a fake vent cover and having the guards stop your escape. This game is really fun...even though I haven't beat the first prison yet.",
            "review_score": "1"
        },
        {
            "review_text": "interesting action-packed gets your heart racing and has you stock up on so much duct tape 12/10",
            "review_score": "1"
        },
        {
            "review_text": "Played for 8 hours when I got the game, pretty addictive, bit repetitive(the part where you upgrade your INT/STR/SPD) Even though this still is an alpha it feels like the game is in some way complete. When you escape for the first time, you heartbeat starts going up like crazy(personally) which is great considering this, again, is still an alpha. Can be stressful from times to times. I do recommend it if you like strategy and prison escape type of games. For now, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game because  1. Theres customs 2. its fun 3. you can make friends 4. Youll be good at the game and finally  5. ITS THE BEST GAME EVER",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, the guards are weird as hell. Challenging but still fun at the same time, a great way to break up the day and worth £12 of anyones money!",
            "review_score": "1"
        },
        {
            "review_text": "There's nothing more nerve racking then watching your back while digging a whole through the floor of your cell as guards pace back and forth. Despite its pixel graphics this game can still make your heart pound while your hoping not to be cell checked. Definately worth the buy ",
            "review_score": "1"
        },
        {
            "review_text": "The escapist is an fantastic game that is really fun to play. The game is held in a retro style, which makes it stand out from todays ultra high photorealistic graphics in most games. The game is very polished, even though it is still in Early Access. Escaping from the prisons is really hard (and it doesn't help to have a group of people standing behind you teling you what to do ;-) ) The game is definetely worth the price and is also good for playing during registration period in the morning :-). It still has a few bugs, but they occur very seldomly and can sometimes even be used to your advantage (e.g. make others loose their job). I am really looking forward towards it coming out of early access. Btw, did I mention that it is made by the same people that make the worms series.  EDIT: I didn't notice it was already fully released, it isn't an early access game anymore.",
            "review_score": "1"
        },
        {
            "review_text": "This is quite honestly one of the best little time-wasters i have ever played, it not a game i can continuously play but i play it a day at a time and it was really quite fun, i hope everyone who buys this game loves it",
            "review_score": "1"
        },
        {
            "review_text": "This is perfect. Why has no other company done an 8-Bit prison escape game. This game has tons of creativity and variety. At some points it is a bit tedious but they make it fun. Some times you lose a good amount of progress but it always brings you back for more. I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with a lot of thinking and planing. I like this game because you need to complete and collect items and tasks to reach the final goal of escaping.",
            "review_score": "1"
        },
        {
            "review_text": "7.8 Too many Prisons Too Much Contraband",
            "review_score": "1"
        },
        {
            "review_text": "Good at first but there is too much Farming of skills and less expensive, for ten pounds this game should have better graphics and more action and creativity",
            "review_score": "-1"
        },
        {
            "review_text": "Quite an interesting game. It is something I really enjoyed playing for about a couple of hours. You can take 2 pathes in this game:  1. Pretend that Escapists is some sort of reality prison game and you just stay in the prison forever  2. Attempt to escape by all means necessary  I chose number two and succeeded in escaping all prisons except the last 3.",
            "review_score": "1"
        },
        {
            "review_text": "Okay this game is actually just the best. Been playing it for about 7 hours now (will be higher by the time you see this review) and I'm just in love with it in all aspects. I've barely progressed in the first prison, because it is actually very challenging to escape. I haven't even gotten close yet, but I've been caught many times with my vent open, a hole in my floor, or a missing wall that I hid behind a poster after chipping it with a fork. I love fighting the other inmates and the fact that you have to constantly train to maintain a strong character fit for fighting is wonderful Knowing how to craft many of the necessary items was almost impossible for me to do without the Wiki, but I suppose I didn't do enough trial and error with putting items together. All in all, this game is extrememly fun, has a high replayability value, and is at a very fair price with this sale. Strongly Recommend! ",
            "review_score": "1"
        },
        {
            "review_text": "Pretty nice, although it can be quite hard(still haven't completed the first level :|). One small defect is that it can be slightly monotonous(repetion of tasks). I really enjoy laying this game, and I hope others will consider playing it as well.",
            "review_score": "1"
        },
        {
            "review_text": "frustrating but so funny i would play this anytime anywhere  ",
            "review_score": "1"
        },
        {
            "review_text": "I've just played a few hours of this and I think this is absolutely fantastic,the prison editor itself is fantastic and easy to use. I took a whirl around with it and made (and publish) a prison. I took the liberty to take myself on and I manage to escape in about 7 days(a week time) I totally recommend this game,PLEASE BUY IT. Support the developers,they need the money and the luck!",
            "review_score": "1"
        },
        {
            "review_text": "I think they should make the escapist 2! What do you guys think?",
            "review_score": "1"
        },
        {
            "review_text": "Its fun and gets your mind working.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 -IGN 10/100 -That guy in the Breakfast area 360/420 -That MLG Foxy  UPDATE 12/04/2015: Today I've seen a glitch, I ''escaped'' Fort Bamford by just beating up someone and boom! I was sent to the escaped menu. I tried it again on another file on Center Perks and it didn't work! And I tried it again on the same prison and it didn't work. This is real! Fun fact: I didn't even escape Center Perks yet. P.S: I did that on Day 1.",
            "review_score": "1"
        },
        {
            "review_text": "Droped the soap simulator 2016",
            "review_score": "1"
        },
        {
            "review_text": "Fun in small bursts, just mastered the first prison though! I'm moving to the second on now though, I will be having the time of my life for hours! get this game!",
            "review_score": "1"
        },
        {
            "review_text": "Strangly addicting, beatiful music, and so undescribably and surprisingly intense. Though most games now are 3-D, high-resolution, and focus on shooting and killing; this game is the good ol' 8-bit and has more jokes put in this game than nuclear missiles in Tony Stark's Iron-Man suit",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game tons and trying many different escapes i have to say this game blew my mind i didnt think it would be as amusing and fun as it is!",
            "review_score": "1"
        },
        {
            "review_text": "Can flush 3 brooms at once. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has occupied so much of my time and I am not ashamed. While the stat training may be somewhat grindy, it doesn't even feel that way. It gives you time to consider your escape plan and take in your surroundings. The change in difficulty from prison to prison is extremely fluent. You can feel the change easily but it isn't overwhelming. The best part is it gives you a large variety in ways to escape. I've escaped by digging, cutting, chipping, running, fighting, etc. The possibilities are endless. I would definitely recommend this game. Long live The Escapists! 11/10",
            "review_score": "1"
        },
        {
            "review_text": "can flush mops without clogging toilet  11/10 would flush again  But seriously, this game is really fun. It's one of those games that makes you think, and it forces you to be patient.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game for almost anyone. If you like 2D games that are fun to play and you are a fan of escaping prison, then this is the game for you. The dev's on this game are known, they have made a lot of other games and they were actually good. (SHOCKER) This game is so fun, funny, and fun, and also a lot of fun. :D  ",
            "review_score": "1"
        },
        {
            "review_text": "Great fun! I started and i immidiately got hooked. I started wondering different ways to escape, and found out i could dig. I ran from everything and escaped in 51 days on what used to be the hardest prison. Flushing that punger was not a good idea, though. I got caught more that five times, adding to the challenge of escape.  If you are to get this game, I would suggest not looking anything up though. It ruins the fun if you know everything. I figure i'll wait awhile before playing and then come back when alot has changed.(or play it right now because of how awesome it is.   87/100  Thanks, Team17!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun , Pure fun ......thanx to some YouTubers i watched thier videos and got hooked on it , so i bought it and i gota say , it brings me back to the 90's with 8-bit nintendo games .    i do like the Sandbox feel to the game , but if i had to change something with the game , i'd say it was to make the days drag out a lil longer . . . feels like 10-15 minute days..goes by to fast for me.   Other than that , A+++ game i rate it 9/10 if i were you , i'd buy this game .",
            "review_score": "1"
        },
        {
            "review_text": "the escapists is such a good game it gets your heart pumping 5 stars *****",
            "review_score": "1"
        },
        {
            "review_text": "Very good game play and a range of things to do and complete, free world allowing you to control what you do in the game.",
            "review_score": "1"
        },
        {
            "review_text": "i think this game is great and is really thought out but what i want for the next patch or update is coop 2 player action trying to excape together THAT would be AWESOME.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best gmes ive played in the world. now i know how to escape prison if i ever get in :)",
            "review_score": "1"
        },
        {
            "review_text": "OH MY GAWD I WISH THIS GAME WAS ON ANDROID! PLEASE FOR THE LOVE OF ALL THAT IS HOLY GIVE ME THIS GAME ON ANDROID!",
            "review_score": "1"
        },
        {
            "review_text": "This game is extremely, extremely addicting. Also perhaps the best prison sim game out there. You can't wait to beat your prison so you can unlock the next to try an even more difficult mind game.  How will you escape? Tunneling under the fence? Using a grappling hook on a building? Or perhaps building a secret tunnel underneath your desk. The freedom of choice makes this game a indie gem worthy of the highest regard. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I got the game in Early Access. I was blown away. Early Access if usually unfinished games you pay $60 for that don't even launch. This game work perfectly. With everything going on in the prison it is filled with life. Sometimes, you won't even wan't to escape the prison. Just have fun, which is unusual for such an early game. I would DEFENATELY recommend as it is one of my favorite indie games and just because of this game, early access is worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I've never found it easier to say that I recommend a game to you all. The Graphics and Sound that went into this game are amazing. There are a lot of ways to escape, make friends and make enemies. This game got me instantly addicted because I loved going back to Prison 1 and trying different ways to escape and make friends. This game is amazing and is a best buy. This should be on the top of your Wishlist. Also, there is a lot of prisons and more to come in the future. £12.99(GBP) is a low price to pay for a game like this.  WARNING: SPOILER ALERT Scroll over black boxes to get the Spoiler. YOU HAVE BEEN WARNED     The kitchen job is the BEST. if you get the Kitchen Job, you can sneak food out and give them to your friends. Cooked Meat gets their opinion of you up SO FAST - But don't give any more than three to a single person within 2 periods as they will not like it and you will have wasted your chicken. This way, I managed to get the WHOLE prison on my side, making everything easier :) Hope this helps      Oh... I also made a Group about being an Escapists fan   Link  ",
            "review_score": "1"
        },
        {
            "review_text": "After completing the first 2 prisons in this game i would recommend. There are many ways to go about escaping. Though it will take you a while to get all the crafting recipes (unless you look online). My only problem with this game is that on the 3rd prison it lags quite a bit. Although i would highly recommend this game.  94 / 100",
            "review_score": "1"
        },
        {
            "review_text": "The game is about you as a prisoner trying to escape the many prisons that you can choose from. Even some famous ones such as Stalag Fluct or Alcatraz. I once really liked this game. ONCE. When you first start playing it will seem really fun. Like really fun. But when you beat all the prisons and want to do steam workshop prisons you get bored really really fast. Other than that its a great game but i assure you after 72 hours of it you will get really bored.  Layout- 8 Graphics- 10 Fun- 4 Overall- 6  ",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly one of the best games i have",
            "review_score": "1"
        },
        {
            "review_text": "Got ♥♥♥♥ wipped By a guy wielding a plastic fork 9000/10 would get eaten alive again",
            "review_score": "1"
        },
        {
            "review_text": "Best. Game. Ever. Really good AI and its very action packed. There is barley any violence in this game which makes it fun for everyone. So much to learn BUT SO MUCH FUN!! I look forward to multiplayer! can't wait to play with my friend 10/10 would do a prison takedown again",
            "review_score": "1"
        },
        {
            "review_text": "this game is good if you like being sneaky and love to do stuff you arent suppose to",
            "review_score": "1"
        },
        {
            "review_text": "Day in Escapists -   -slaps a idiot called Tommy -tommy slaps me back and screams like banshee -guards hear the wailing damsel and come to his stupid aid -tasers me in face -i run off -goes to daily morning meeting -after that goes in to work room -tommy goes in same work room -slaps the **** out of tommy -he goes unconsious -steals his stuff, including a hammer -flushes tommy's clothes down toilet -toilet floods -oh **** -janitor comes in, notices me flushing tommy's teddy bear too -janitor tasers the **** out of me -whallops janitor in face with tommy's hammer -goes to evening rollcall -they say tommy's room get searched -before going to cell to sleep, places hammer (illegal) in tommy's drawer with janitor blood all over it -goes to beddy byes  11/10 would frame tommy again",
            "review_score": "1"
        },
        {
            "review_text": "Quite an interesting game. It is something I really enjoyed playing for about a couple of hours. You can take 2 pathes in this game:  1. Pretend that Escapists is some sort of reality prison game and you just stay in the prison forever  2. Attempt to escape by all means necessary  I chose number two and succeeded in escaping all prisons except the last 3.",
            "review_score": "1"
        },
        {
            "review_text": "It's good but repetitive, I think its a good alpha but its not ready for release",
            "review_score": "1"
        },
        {
            "review_text": "An amazing way to spend the day. Keep an eye on the clock if you have somewhere to be though! A healthy blend of difficulty and ingenuity. The real hard part is not cracking down and looking up the most common way to escape. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. It shows you the ways of Prison life and how you can adapt it to escape. I'm heading onto San Pancho and I cannot wait. Each prison is unique and I love how it changes.  I would MORE SURELY recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "this. game. is. more. addictive. than. crack.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly i like it its a good game but what i wish is that they added multiplayer and dont play this if your not a 2D gamer and i hope that the developers read this and also add hunger bars, more food, and you have to wash the item that your putting in to the NPCs desk off so that there is no finger mark on it and when you are waering a police/Guard outfit then you can go past someone like nothin and also have a randomized law that you broke and plz add FULL controller support plz and i hope that the delopers read this and ima not stop playing if you dont and i can understand if some cannot be cuz makin games and stuff is hard cuz of the codeing but i hope this was helpfull",
            "review_score": "1"
        },
        {
            "review_text": "Great game, love it, one thing... how can I change the the resolution, it's too big and cant really read stuff, any help? ",
            "review_score": "1"
        },
        {
            "review_text": "this game is so good the best bit is when you think you have enough items and a plan to escape but you never know theres always a thought nagging at the back of your mind saying you have not prepared enough which makes you think the intire day before you try to escape am I ready which is so good",
            "review_score": "1"
        },
        {
            "review_text": "Very fun but .99 cent for one pack that dumb come",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game don't get me wrong. But it can get really annoying sometimes. Everytime I load a saved game all my items i hid somewhere disappear and I can start all over again. I really hope they can fix this somehow cause I dont wanna have to play each prison in one round. For now I would NOT recommend buying this. If anything changes this review changes...",
            "review_score": "-1"
        },
        {
            "review_text": "Great game Very hard to follow",
            "review_score": "1"
        },
        {
            "review_text": "i like the map editer but i dont know what to do can we gat a map maker tutorial",
            "review_score": "1"
        },
        {
            "review_text": "it is a great game. great for playing in prison ;)",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! I used all my money on it and I really want GMOD but I guess this is good. The Escapists has this feel that makes you want to escape all the prisons so you can be the top escapie. (DONT KNOW IF THATS THE RIGHT SPELLING) I would suggest buying this, its worth the 17.99 used on this.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game Really Recommend It",
            "review_score": "1"
        },
        {
            "review_text": "brilliant what a game 10 out of 10 whoever hates it as no taste in games",
            "review_score": "1"
        },
        {
            "review_text": "8 outta 8 great matw",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my absolute favorite games(if you can't tell from my hours). The game can be really challenging but i still manage to beat every prisons in Story and all the DLC's that i own. This to me is a 4 1/2 star game becuase of the little glitches here and there, but thats what makes the game fun.",
            "review_score": "1"
        },
        {
            "review_text": "it's a okay game but it's 1 thing after another and with 100's of ways to do it just wait and wait AND WAIT TILL THE OPENING Get a plan and put it into action lock the door hide the keys hire the garuds WHO CARERS I'MM TWEETING #MakeorBreak     BUY THIS GAME IT'S WORTH IT+MAKE YOUR OWN PRISIONS WITH THE IN GAME EDITER",
            "review_score": "1"
        },
        {
            "review_text": "crap complete crap after 3 weeks of buying it it would not open i payed $18 for crap ",
            "review_score": "-1"
        },
        {
            "review_text": "Hard, yet extremely fun to play and get dicked over by.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game i love it",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game i Love it So Much I Will Be Uploading Vids On It Soon Thank you guys for Makeing A Game Like this Or Better Ye This Game! I Love All The Work That You Have All Put In To The Game Thank you For Publishing This Thank You So Much ",
            "review_score": "1"
        },
        {
            "review_text": "amazing pixel art. its so much fun to play and is a great game to use up free time.  however the most annoying part of this game is when you are about to escape and a guard walks by and sees you then 3 other guards come by then you have to start from scratch cos they beat you up.   i would like the game to have a multiplayer mode or a co-op mode but the difficulty to be hard or above because you are 2 people trying to escape and have twice the chance of finding the items you need e.g. the ductape (its op).",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome and everyone should play it!",
            "review_score": "1"
        },
        {
            "review_text": "I genuinely love this game. I'm not much of a PC Gamer, but this is my most played game on PC definitely.  I decided to ♥♥♥♥ around and replace some of the game's music with fitting Undertale music and it's brilliant. Just try it xD  Anyway;  Pros: -A few really good pre-made main prisons, -Some more incredibly hard dlc prisons, -Workshop support -Showering with men -An achievement for dropping the soap in the shower -Trading cards  Cons: -Umm.... -There are literally none. -This game is perfect. -I love it.",
            "review_score": "1"
        },
        {
            "review_text": "The Game is great. But you need to put a multiplayer update in where you can play with your friends. Overall 5 stars",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is cool.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun. This is a surprisingly deep game, with all kinds of options. It is a real challenge to navigate them sucessfully without getting caught, let alone escape. It's a puzzle and stealth game all rolled into one. Now buy this game and I'll see you on the outside of the prison.",
            "review_score": "1"
        },
        {
            "review_text": "love the game. nice music fun gameplay cool graphics= good game",
            "review_score": "1"
        },
        {
            "review_text": "great game but cant use the map maker for some odd resion",
            "review_score": "1"
        },
        {
            "review_text": "Such a cool game once you get good at it",
            "review_score": "1"
        },
        {
            "review_text": "very good, the rules for itellect, strength and speed are quite clever but there needs to be more main game prisons.",
            "review_score": "1"
        },
        {
            "review_text": "not played much but what i have played was amazing best £12.99 spent",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilarious but also rage-inducing. I like the fact that you can complete your goal to escape, but can also mess around if you want to. Trust me, you'll definitely find humor in this game.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I have spent 200 hours on this game. Why? well, there are so many achievments to make me feel special, many ways to escape from each prison, and along with constant updates, including new items, prisons, and cheep DLCs. Its fun, but punishing. A strategy game covered by a AMAZING interface. I cant recomend this game enough. So, what are you doing still reading this? GET THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "Dont prejudge the game based on its looks (even though i love it). Its a REALLY fun game, with a lot of things to do even in Early Access, with challenging prisons that have different stuff in each of them, lots of items, a 'discovery-friendly' crafting system etc... Totally worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "All that stands between you and freedom is: one fence, one wall, a bunch of suprisingly perceptive gaurds, and a few snipers ready to blow your head off at a moments notice. Other than that it's a very fun and intresting game.",
            "review_score": "1"
        },
        {
            "review_text": "Very slow game but still fun. I wish it had multiplayer though.",
            "review_score": "1"
        },
        {
            "review_text": "While it is exiciting to see your escape plan work, the repetiveness makes it hard to continue after a few prisons also, the map editor needs some changes like not restricting you to one tileset, add prison specific objects (checkpoints) customization of scedule, and guard inventory, no limit on the amount of particilar zones you can make, patrol routs. though if I do see this game inprove (which I see a lot of potential with it) then this review will change.",
            "review_score": "-1"
        },
        {
            "review_text": "Fought a guy, stole his teddy bear. 10/10 Would beat up people to steal teddy bears again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun as a prison sim it is bassicly prison architect but in the prison.",
            "review_score": "1"
        },
        {
            "review_text": "This game isn really good and it sometimes has movie references and the Escapists is just a really a great game",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "soooo many craftable's and excape methods great game  ps please add exposives!",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand this game. They need a much better tutorial. The one they have explains the controls and a few game mechanics. Unless you watch alot of youtube on it don't get it.",
            "review_score": "-1"
        },
        {
            "review_text": "it is a great startegy game but i would like them to add multiplayer to the game ",
            "review_score": "1"
        },
        {
            "review_text": "This game is extremely repetitive and gets boring after a while. the only good thing about this is the editor. ivem ade 2 maps and i want to make a third. except, whenever i try to make a third, it just crashes. i would recommend this game if it didnt crash so often. until fixed, my review stays like this.",
            "review_score": "-1"
        },
        {
            "review_text": "This game isnt so great. Its great when you first get it, like with every other game when you just get it. Over time this game has gotten worse. Having to complete prisons to get to the next one. Too many DLC's get, and just not being able to choose the prison that you want to play is just bad. 7/10 may play again.",
            "review_score": "-1"
        },
        {
            "review_text": "Tip: Never expand the tab in editors mode. Just trust me.",
            "review_score": "1"
        },
        {
            "review_text": ":3 ",
            "review_score": "1"
        },
        {
            "review_text": "Onto a more pressing issue: Someone dumped in the pond",
            "review_score": "1"
        },
        {
            "review_text": "this game to me is fun because it proggressively gets harder and the concept of being able to escape like this is a good one to entertain ",
            "review_score": "1"
        },
        {
            "review_text": "Its a very good game but very hard (for me) because the note people will find where u are when u are missing and in the day there are snipers. I play on very easy and im still stuck but it is a very good game",
            "review_score": "1"
        },
        {
            "review_text": "its a classic 8-bit game that is addicting and an awesome escape prison game!",
            "review_score": "1"
        },
        {
            "review_text": "as an experienced firefighter / EMT, I can safely say that this game is the most stressful situation I have ever been in",
            "review_score": "1"
        },
        {
            "review_text": "The feeling of escaping a prison after a good week irl time spent ♥♥♥♥ing around, knocking out guards, getting sniped, stealing clothes, stealing jobs, stealing hand cream and giving it back to the person you stole it from for favour, having the wiki open, digging in minefeilds, immobleizing jeeps, stealing ID's and hourding random crap in toilets is just an amazing feeling that you cant beat. feels like a mild ♥♥♥♥♥♥. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game gives you alot of intense moments,parts pure consetration and makes you the happiest bunny when you actually escape.The inmates can be also extremely funny.I would rate this game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. Thats it...",
            "review_score": "1"
        },
        {
            "review_text": "I Hate It!",
            "review_score": "1"
        },
        {
            "review_text": "It's a cute game. The concept is neat too.   My experience with the game hasn't been what I was hoping for however. It seems as there are certain ways to break out of a prison and not all ways are prefered. Ie. It's railroaded as far as method goes.   I built a tunnel in the first prison and spent a very long time doing it, I seem to get caught every time i try to get out, yet you can just cut the main bars with a platsic knife and be out. Not so enjoyable in that regard..  As I said though, cute concept / game. Certianly for some people but not so much for me.. =/",
            "review_score": "-1"
        },
        {
            "review_text": "It's relatively fun.",
            "review_score": "1"
        },
        {
            "review_text": "Razor blades aren't contraband, even though they are used to make most weapons in the game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I love it but it needs multiplayer. SERIOUSLY!",
            "review_score": "1"
        },
        {
            "review_text": "'You know you've been in trouble a lot when both you, and the cop know each other by first names.'  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Cannot change screen resolution. Unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "'Whu - wait. Where am I?'  'Ssshhh! The guards will hear you!'  'I don't understand, where am I?'  'This is Alcatraz, mate. We're the criminals who got sent here. Don't you remember?'  'No! What's going on?'  'Well, we have to break out of this place and get back to the mainland. I could use the help of someone like you. Are you in?'  'Well, if it means getting out of here, then very well. What do I do?'  'Our first mission is to create a place to store all our stuff. I'll get a fork at breakfast and scrape a hole in the wall.'  'Very funny... wait, you can do that?'  'Of course! But don't ever do it when the guards are watching.'  'Right. What next?'  'We need to start getting items from people. Do jobs for people, get money, and try not to get caught. That can be your job.'  'Why do I have to do that?'  'Because you're the newest guy here! Anyway, the best time to steal items from people is after you've done your chores - you've got to do the laundry.'  'What if someone sees me stealing?'  'Well, you get beaten up. Actually, a lot of this escape involves either beating other people up or getting beaten up.'  'Why do people beat me up so much?'  'Oh, it doesn't happen very much... actually scratch that, it can happen for any reason. Either you've stolen someone's soap, or you look at someone funny; even taking a spoon from the cutlery tray when people are around!'  'Just one question: are you sure we can escape?'  '... on second thoughts, no.'",
            "review_score": "1"
        },
        {
            "review_text": "I Hate It!",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't have any cats  0/10",
            "review_score": "1"
        },
        {
            "review_text": "Replayable, enjoyable, and oddly relaxing. I love the game and gameplay!  The controls could be easier, but it's mostly a task of getting into them.",
            "review_score": "1"
        },
        {
            "review_text": "The Escapist is an awesome game. The aim, of course, is to escape all 6 (or more with DLC) prisons. It is a really fun and unique game and I recommend it to all Steam, Xbox and PlayStation users.",
            "review_score": "1"
        },
        {
            "review_text": "Sorry, but I just found it boring and repetitive",
            "review_score": "-1"
        },
        {
            "review_text": "I went through prison life and didn't drop the soap 10/10",
            "review_score": "1"
        },
        {
            "review_text": "i love this game because its fun and sometimes realy challenging [B.T.W dont hide contreband in any tiolets because when you load the game it disapears] any way i would also recamend bying 1 or 2 of the DLC's THERE GREAT.",
            "review_score": "1"
        },
        {
            "review_text": "this game is very good and hard and ricky you a lot of skittles:skills, it is very fun ",
            "review_score": "1"
        },
        {
            "review_text": "A great game that combines skill and will power to make your escape and it has a very good learning curve making the game easy at first and ramps up the difficulty as the game goes on. So worth the money",
            "review_score": "1"
        },
        {
            "review_text": "Alright gameplay, not brilliant graphics, but not a terrific game overall. I've played a lot, and found it gets very boring very quickly. Can only play it for an hour at a time, and the gameplay is too repetitive. I do not recommend this, not worth the money. :(",
            "review_score": "-1"
        },
        {
            "review_text": "Very, good game! i just love to play it and it also a great Strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game wich is easy to play but hard to master. It is very fun and hard to put away. Although there are some glitches like Gregg told me to get ____ from Gregg so I beat up Gregg and he had nothing. Sometimes you see a guard have someones empty wich look like a blue bed sheet but doesn't do anything. Anyway I would rate this game 9/10 because of the glitches it subtracts one. But the graphics are amazing, No lag, and since the update there hasn't been as many glitches. Get this game it is a must have!",
            "review_score": "1"
        },
        {
            "review_text": "pretty ez and gives you ulcers overall great game!",
            "review_score": "1"
        },
        {
            "review_text": "Best game i ever played in a long time and its chalenging just how i like it",
            "review_score": "1"
        },
        {
            "review_text": "Follow the routine, pay attention, don't get caught.  The only downside of this game is getting caught in anything, and you lose everything. Meaning you could spend weeks secretly tunneling your way out, but then you take a little too long in the gym and miss your job shift, suddenly you're beaten unconcious, wake up in the infirmery, your buff body is gone, your tunnel is gone, your horded keys and supplies are gone... And you might as well start all over from the beginning.  That aside though. This game just REAKS of 'just as planned...'",
            "review_score": "1"
        },
        {
            "review_text": "'The Escapists' is a fun little 'pixely' game where you have to escape a little prison. Exceeding in difficulty after each level, the levels get more challenging and fun! The game is great, yet it can get repetitive and boring in some occasions.",
            "review_score": "1"
        },
        {
            "review_text": "Should not have dropped that. should noooot have dropped that.",
            "review_score": "1"
        },
        {
            "review_text": "Definetly worth the money !",
            "review_score": "1"
        },
        {
            "review_text": "Cool game, nice mechanics, a LOT of different ways of getting out of the prisions, full of players content on the workshop. Totally worth it!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, only one problem. I'm stuck on the second prison ;(",
            "review_score": "1"
        },
        {
            "review_text": "Hey creators! I think you're most recent DLC (I think) Santa's Sweatshop and the at whole game is great. I like how you added the map editor so that way we can create prisons! If I were at a event and said what rating from a scale of 0-10 of this game, It would be 10-10 Bravo! And great game!",
            "review_score": "1"
        },
        {
            "review_text": "took somebody's clothes after beating them up 999999999/10",
            "review_score": "1"
        },
        {
            "review_text": "Dis game is fun 4 me",
            "review_score": "1"
        },
        {
            "review_text": "Its very good, I recommend",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. This game provided a challenge for me and its a great game if you want a game that you can just sit back and relax with. I love how there's not any specific ways in which you go about escaping; the decisions are yours alone which is great. Would highly recommend this game to a friend. This game would be awesome if they added some sort of co-op or multiplayer option, which I've heard is currently in the works, so I'm excited for that. Great game and definitely worth a buy.",
            "review_score": "1"
        },
        {
            "review_text": "Its simple, fun, and includes a map editor. Thier must be like a million different ways to escape. If you don't like The Escapists, then you must be demented.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so addicting. After you finish one prison, you can't stop. You must commit all the crimes and escape all the prisons. Thank God escaping prison isn't this fun in real life, because then people might even purposely rob a store right in front of a police officer.",
            "review_score": "1"
        },
        {
            "review_text": "very fun takes a coulple of hours to escape love it very addictive",
            "review_score": "1"
        },
        {
            "review_text": "realy hard but i love it soo much best game ever",
            "review_score": "1"
        },
        {
            "review_text": "i love this game so much! it was very hard at first but once i started learning how to use everything it was really fun to play and easy. There are so many choices of levels and characters.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game! The only problem I had was that even the prisons that said 'very easy' were SSSUUUPPPEEERRR hard please make the prisons easier! Please!!!!  Until then I rate this game 4 and 1/2 stars ",
            "review_score": "1"
        },
        {
            "review_text": "Love the game.  Lots of crafting. Lots of ways to escape. Lots of of planning. Lots of getting caught. Lots of beatings. Lots of stealing. Lots of searching. Lots of toilet blocking. Lots of Q+E.    ",
            "review_score": "1"
        },
        {
            "review_text": "Duct Tape Simulator 2015  It's like Art Attack, but with more duct tape.  Lots more duct tape.  Too much duct tape.  I think I have a serious problem.  Welp.",
            "review_score": "1"
        },
        {
            "review_text": "Please make this for controller 360 windows",
            "review_score": "-1"
        },
        {
            "review_text": "The Escapists, a cute little game that is very fun! It's about escaping from jail, and it may look bad because graphics and ♥♥♥♥ but it's actually really good.",
            "review_score": "1"
        },
        {
            "review_text": "Yo this crap trally needs to be translated into Chinese!!!!! PLEASE!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is easily one of my favorites lookin for a mind teaser game thats easy to catch up on after a little while single player but still great this game is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Good, but hard as balls.",
            "review_score": "1"
        },
        {
            "review_text": "This is art!!!",
            "review_score": "1"
        },
        {
            "review_text": "fun simulation and [rison game on;y problem is the map editor/creator dosent work on my msack so if you find out how to fix the problem contact me!",
            "review_score": "1"
        },
        {
            "review_text": "I suck at this game but I can't stop trying to escape and making massive maps  free me",
            "review_score": "1"
        },
        {
            "review_text": "day 876134871537613016.... still the first prison...",
            "review_score": "1"
        },
        {
            "review_text": "Did a beat up job on an inmate for another inmate Forgot to switch from violent mode to non violent mode Clicked on an inmate to speak to him, began beating him up Won easily because today I finished maxing my strength  Unfortunately it happened in view of an officer Beat the officer unconscious Took a key in case I needed it later, completely forgetting I'm meant to make a mold before he regains consciousness  Officer wakes up and puts the whole place on lockdown, so I go to my cell like everyone else Officers come in, beat the ♥♥♥♥ out of me, and put me in solitary  10/10 would forget to press space again",
            "review_score": "1"
        },
        {
            "review_text": "-has genius escape plan to get out of a winter prison -takes poster of wall -guard comes soon after -game doesn't let you put poster back because your too close to the wall -solitary   if your wondering about the plan (your most likely not, but if you wanna get outta flught, this is a good one) then I will write it down, spoilers.   -get woodshop job -make hole in work area so contraband detectors dont get you -make another hole in back of cell when nobody is there (breakfast or dinner works) -lay out some food and knives by gate 1 -get guard outfit and make bed dummy, then place bed dummy -cut first gate at night -make sure you have fake gate ready (3 wires) -use shovel to dig under electric gate (disabling the generator is guarunteed, I havent really gotten this far yet into the plan) -dig up (bring pickaxe for surprise boulders, and dont forget food) -sing Dora theme song as you escape  thats the plan I made, the original part is why Im not too far into the plan.",
            "review_score": "1"
        },
        {
            "review_text": "I found this game through PSJ (Paul Soares Jr) and I really liked the look of it so, I went and bought it. 13 hours played later I'm here writing this review. This.. This game is amazing!! I love every little thing about it and planning escapes can be fun and challenging. Please take my advice... BUY THIS GAME!",
            "review_score": "1"
        },
        {
            "review_text": "I have spent 200 hours on this game. Why? well, there are so many achievments to make me feel special, many ways to escape from each prison, and along with constant updates, including new items, prisons, and cheep DLCs. Its fun, but punishing. A strategy game covered by a AMAZING interface. I cant recomend this game enough. So, what are you doing still reading this? GET THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "This game is so fun and if you have rage issues YOU SHOULD NOT PLAY IT you will die alot in this game if your a newbie and they're are pugins       ",
            "review_score": "1"
        },
        {
            "review_text": "LOL it looks so easy but it is kind of hard at the beginning . My review is 10/10 especially now that its on sale!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun strategic game, can't wait for Escapists 2, because i want multiplayer :P",
            "review_score": "1"
        },
        {
            "review_text": "Now if there was a multiplayer mode...",
            "review_score": "1"
        },
        {
            "review_text": "This is an AMAZING stratergy game. i reccomend it :)",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ the police",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable to play. Fun to think about the many different ways you can escape and well worth the cost.",
            "review_score": "1"
        },
        {
            "review_text": "The Escapists is an extremely fun game that combines crafting, exploring and doing quests all together into a prison of all things. It is great fun and will last you a while (I've had this game on multiple accounts).",
            "review_score": "1"
        },
        {
            "review_text": "its really good",
            "review_score": "1"
        },
        {
            "review_text": "really cool game would play again 10 out of 9",
            "review_score": "1"
        },
        {
            "review_text": "At first, this game doesn't seem like anything special. Sure, it's a well-constructed prison sim. Anything else? You go around collecting contraband, crafting weapons and tools for your eventual escape. You beat up guards and inmates every once and a while (unless you're planning on being released for good behavior), and end up feeling pretty OP.  Then, it comes time to break out. This is when the anxiety and paranoia come in. Honestly, just the atmosphere in this game, and the feel of it. . .it's very hard to explain. But while you're escaping, your heart will start to speed up, your hands will get sweaty, the slightest movement by the patrolling guards will freak you out. Any noise will make you jump all the way to the moon. There's something about this game that just captures the feeling of knowing you're doing something naughty, and that you don't want to be caught. It FEELS like you're actually escaping.  12/10 amazing game!",
            "review_score": "1"
        },
        {
            "review_text": "Start Game Gone to lift some weight  Guards come and tried to punch me I fu*ked them all gg ez  10/10",
            "review_score": "1"
        },
        {
            "review_text": "The escapists is a very good game. The idea is amazing, it has very well polished with not much missing from the game. On that note I do belive that the developers could spend a little more time taking community ideas that have popular support and implementing them into the game. The ingame prison creator is very well suited for the game and I would very much like to see an installment of it in The Escapists 2. This game is a great play and worth the buy, even if a few more updates could make the game have a sharper edge.  EDIT: I rewrote this review. When I wrote this review I was pretty ♥♥♥♥♥♥ with other developers and expressed my hatred into this review, I have updated it to express my real opnions on the game, and hopefully I will have a similar if not better opinion for the next installment of The Escapists.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game.  10/10 Gameplay 9/10 Ghrapics 8/10 Musics ",
            "review_score": "1"
        },
        {
            "review_text": "this game is hard helish and cruel.     I F@#$^&amp;* LOVE IT",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game, but without the expansions, it's really just the same thing, with a different setting, can get boring, but though I do suggest the game, take caution people and don't burn yourself on it, take your time and don't get angry if it's not your style.",
            "review_score": "1"
        },
        {
            "review_text": "Takes a lot of time but with all the dlc and it is fun escaping over and over in different ways.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is really good but it can get boring after a while of playing on it.",
            "review_score": "1"
        },
        {
            "review_text": "A heavily enjoyable game with a large and great community behind it. I constantly keep coming back to mess around and try out new strategies.",
            "review_score": "1"
        },
        {
            "review_text": "Prison Break: The Game. Really fun, use your wits to break out of maximum security prisons, it is a little to hard at some points but that is what makes it fun, ill be getting number two when it comes out. This game nailed the immersive feel for me and I really enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "My submission for Best 8-Bit Game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most hardest prison escape games I ever played. But its really fun and requires time and planning!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, I loved how much interaction there is, and all the creative things you can do. I'd give it probably a 7 or an 8 out of 10. Maybe even a 9. Totally a great perchase, and worth the amout it is.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "this game is really fun and if you like planning/strategy games this game is perfect for you. the workshop maps make the game a lot of more fun and i highly reccomend for yopu to download some workshop maps if you are looking forward to purchasingf this game.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and there are many different types of prisons that you can escape from.",
            "review_score": "1"
        },
        {
            "review_text": "Really amazing game i prefer you'd buy this.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun and i reccomend it it is fun because it pushes you to the limites and makes you think hard ",
            "review_score": "1"
        },
        {
            "review_text": "It's a good but hard game, but it feels really wierd in its punishments... when you make the tiniest of mistakes, you lose everything, which makes sense (frustrating as it is)... but then it gives you an option to revert to an old save? Make up your mind, are you gonna punish players or let them have immunity from harm?  I feel like the savesystem itself could be changed to solve this problem. I think it should autosave frequently. The game as it is puts very little strain on your PC, so I feel like it can get away with autosaving after every time the period changes or maybe even less. Along side this, I feel it should autosave when you're caught. This would in my oppinion make the game harder, and also make it so I don't have to just leave the game running minimized when I stop playing partway through a day. I feel like this sort of savesystem should at least be added as an optional feature for those who want it (like a hardcore mode).  If this was added I'd feel that the game would be even better.",
            "review_score": "1"
        },
        {
            "review_text": "The escapists is a very good game. The idea is amazing, it has very well polished with not much missing from the game. On that note I do belive that the developers could spend a little more time taking community ideas that have popular support and implementing them into the game. The ingame prison creator is very well suited for the game and I would very much like to see an installment of it in The Escapists 2. This game is a great play and worth the buy, even if a few more updates could make the game have a sharper edge.  EDIT: I rewrote this review. When I wrote this review I was pretty ♥♥♥♥♥♥ with other developers and expressed my hatred into this review, I have updated it to express my real opnions on the game, and hopefully I will have a similar if not better opinion for the next installment of The Escapists.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. I've played this since I installed steam on my computer and it still ranks as one of the best games in my library. one of the best things about the game is the music which is why I wish they would release a soundtrack to the game so that I could listen to the music all day long while playing other games and while doing house work. the game design and A.I. make this game the perfect amount of challenging with multiple ways to escape from prision. I really love the graphics and simplistic nature of then which really go with the soundtrack in game.",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, there should be multiplayer though",
            "review_score": "1"
        },
        {
            "review_text": "Good game for people that are intrested in prison escapes good dlc I must say perfect for a game thats 2d only minus is that its 2d but ho cares :)",
            "review_score": "1"
        },
        {
            "review_text": "The Escapists is a very challenging prison escape simulator with RPG elements, and a slight learning curve. Not many games have me using google to learn how to play the game, this is one of them. I would recommend this game to anyone who's played Prison Architect or a fan of prison themed movies/games. Very difficult to escape the prisons. About 9 hours in my first prison and still haven't escaped. 8/10 is my score.  ",
            "review_score": "1"
        },
        {
            "review_text": "Plz tell me how they allow inmates to have nails and don't allow spatulas why lighter allowed?",
            "review_score": "1"
        },
        {
            "review_text": "very cool and addicting but it needs some remakes and multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "Complex, fun and interesting. Great game and great concept",
            "review_score": "1"
        }
    ]
}