{
    "app_id": 298820,
    "name": "Millennium 2 - Take Me Higher",
    "release_date": "2014-07-10",
    "developer": [
        "Aldorlea Games"
    ],
    "publisher": [
        "Aldorlea Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Female Protagonist"
    ],
    "achievements": 32,
    "positive_ratings": 36,
    "negative_ratings": 7,
    "price": 4.79,
    "description": "Can Marine, Benoit, Karine and her friends find 12 warriors to confront the 13 dreaded Lords of Mystrock? Will Jeanne the magical fairy still support them and unleash her devastating spells on the foes? Play Millennium 2, live the tale and find out!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/298820/header.jpg?t=1535992049",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8 Processor: 1.6 GHz Memory: 128 MB RAM Graphics: DirectX 9.0 Compatible DirectX: Version 9.0 Storage: 100 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A cool continuation of the Millennium series, pick it up if you are a fan of the first.",
            "review_score": "1"
        },
        {
            "review_text": "Millennium 2 - Take Me Higher is the second game in the five-episode Millennium game series. Before moving on to the actual review, I'd like to point out that it is highly recommended to start this series off with the first game, Millennium - A New Hope, if you have not already played it. It would be best to know the story from when, where, and why it began, rather than jumping into it when it's already near halfway over. It'll be a lot easier knowing some of the areas and characters from the first game, and actually understanding what the story is about.    Millennium 2 - Take me Higher, continues the story of Marine, a young girl on a seemingly impossible quest to find 13 warriors to face off against the goverment of Mystrock. Along with her friends, she goes off to continue her search for the remaining 10. That's basically what this entire series is about, find a total of 13 warriors to help you fight and change the fate of the poor. Sounds boring, right? It's not.   Unlike Millennium - A New Hope, this particular episode in the series felt much shorter, maybe even a little rushed. It took me about two days to FULLY complete it, and get all the achievements, where as the first game took me more or less five days to complete, and even longer to get all the achievements for it. I'll be honest, a lot of this episode felt like tedious grinding, and some of the areas were way too long and stretched. That's what took up most of my gameplay hours, trying to get through a long area or dungeon to move on with the story, just to find out that the exact same process awaits me on the other side. But, yet again, you are traveling all over the world to find 13 warriors, so I suppose that's needed, and just part of the game.   Like the first Millennium, this one offers special features that other RPGMaker games commonly lack. And, even a choice, if you would like these features, or not. So if you're into playing it on hard without knowing where to go, the game allows that, but if you're more of a casual type, and you'd prefer to be guided, the game allows guiding arrows to point in the path of the main quest. Something else I enjoyed was the art, and music. Together, they made a beautiful combination, just like the first game did. The areas, too, all seemed pretty, and detailed.    Now, for the conclusion of this review, I'll say that Millennium 2 - Take Me Higher, was a pretty good continuation of the series, yet a bit short. If you enjoyed the first game, then you'll enjoy seeing how the story progresses! Do I recommend it? Yes, I think this series has potential, and if given the chance, could be worth your time. If you're a fan of the first game, then Millennium 2 - Take Me Higher, is a must-have. I'm looking forward to the adventures that await within the next games, and, hopefully, an ending worth the wait. My only fear at this point, is that the series will turn into a pointless grind. So far so good, right?",
            "review_score": "1"
        }
    ]
}