{
    "app_id": 298850,
    "name": "Millennium 5 - The Battle of the Millennium",
    "release_date": "2014-11-07",
    "developer": [
        "Aldorlea Games"
    ],
    "publisher": [
        "Aldorlea Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Adventure"
    ],
    "achievements": 35,
    "positive_ratings": 21,
    "negative_ratings": 12,
    "price": 6.99,
    "description": "How can 13 peasants challenge 13 rich, powerful and well-educated martial artists? Enter the final, grandiose episode of a saga no stranger to the likes of Karate Kid, and carrying an uplifting message of hope, perseverence and friendship.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/298850/header.jpg?t=1535992056",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8 Processor: 1.6 GHz Memory: 128 MB RAM Graphics: DirectX 9.0 Compatible Storage: 200 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I will just say that I cannot recommend this game enough. It was truly a very amazing conclusion to the series and anyone who just dismisses these games for being made in RPG Maker is missing out on a great RPG. Though I do feel that while this game could in theory stand alone, all the best moments mean so much more when you have played the first four games and really understand just how much everyone went through to finally make it to the grand finale.  About the only real drawback is that you do have to level up all your characters pretty high to have a shot in the final showdown, it's recommended to just max them all out. That definitely took quite a bit of time, but the game does give you a very ideal chance to pull this off by basically having the plot send you off to go grind a ton.  I also do feel that it is obvious a lot of care was put into the dialoge for the tournament. The dialogue between your characters and their opponents not only does a great job of characterization for everyone, but it varies depending on what your current score is, whether you won or lost that time, and what the character's overall win/lose record is. Some of the dialogue is downright hilarious. The characterization here is really great as well. By the end of it I really had a good sense of what the Mystrock Lords and Ladies were like and actually even came to find a few of them to be interesting characters. I definitely liked Gisele and Mai a lot. Nate also was pretty interesting even if he was obviously meant to be hated. Truly, all of them were interesting characters with distinct personalities and that shows the love that was put into the final showdown. What was even more neat was the fact that enough care was taken to give each of them their own battle theme. The soundtrack in this game was quite good even if it's been good in all the games so far, but this one just had some added stuf that did a great job of making all the scenes all that much more emotional.  However what really makes the game is the ending. Even though it's pretty obvious that since we're playing as Marine and her friends that the true ending is for her to succeed, how this happens is not something that would be easily guessed. I won't spoil it, but it definitely got quite the reaction out of me. To me any game capable of making me feel something for the characters and events is doing it right.  I also feel this game did a much better job with the realism and having everything be well explained by the plot and done so well. For example the game gives a beautiful excuse to have the Bear unable to be in your party for most of the game because you'd rely on him too much and not train the rest of the characters if you could. The plot that came with that reason then gave a great excuse to use all those characters you haven't used since they games they joined in, though at times it was annoying because you'd get a party that really wasn't good and would need to grind a bit to have a shot. The monsters in this game are definitely tough!  Overall pros: +Quite a lengthy game, you're looking at about 30 hours of playtime and the tournament is actually not a large chunk of that. +The characterization is top notch here. +Very challenging monsters and the tournament is also pretty challenging as well even if the battles are shorter there  Overall cons: -A lot of grinding. While it's not as bad with it actually being justified by plot much of the time, there were points where it dragged because you needed to grind up a not so hot party. -Definitely going to want to get the guide for this one because the parties switch up so often and you have to be well prepared to even have a shot. The guide does a great job of advising without spoilers on how to prepare for all of this, howevr. -As of now, the game has 6 broken achievements so it cannot be 100%ed without cheating. The dev is aware and has been good about fixing them for other games, but it is likely to take time.  So in the end, I very much recommend this game and truly, play the series from the beginning if possible. The series ends up running at about 90 hours of play all together and a very large amount of that is very good and leading up to an incredibly epic conclusion that will mean all that much more if you started from the very beginning. The final conclusion will mean so much more when you truly understand all the things Marine has done to get to this point and it really starts off with that fateful day when Marine left Green Grass, tripped on something and met a little fairy who decided to live in her earring from then on and it means so much more if you get to see Marine grow from being a weak peasant girl to being a capable martial artist who inspied others to join her on her crazy quest to challenge Mystrock.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe if you've played the other games this is more fun but it seems like a generic rpg maker game.  Edit: Played a bit more while idling for cards.  So the game starts you off with a long cut scene that's just 13 (?!?) characters standing around arguing with each other for reasons? Again, got this in a bundle so maybe it's more fun if you've played the previous games, but for a first timer to the series it's just a bunch of people you know nothing about yammering on. Apparently we have to train to fight some dudes.  So you actually start playing. There's a sidescrolling platformer thing going on for the level, which is actually a pretty cool idea. You fight the actual enemies in your standard turn based rpg fight, which is a bit annoying as a new player because you have no idea what each character can actually do because again, the game assumes you've played the previous games.  This brings me to the menus... The game makes the weird choice to have almost half the screen space in each battle filled up by the character portraits. They're not bad portraits (altho the four people you start out with appear to be generic white anime teens... maybe the rest of the cast is more diverse? I think the angry old dude was black?) but it sucks that the also pretty decent monster art is being covered up/ squished. It's also a little harder to see the hp, ect, as it's layered on top of the character art and semi transparent. The out of combat menus also look a little weird imo.  About the art... The character portraits, the monsters, and the pixel character sprites all look pretty good on their own, but kind of clash when they're all on the screen together. The difference between the really clean character art and the more textured monster art isn't too bad, but they really don't look good on a pixel background. A lot the levels don't look great (especially the caves) and it looks like a photograph was used for the far background.  Other stuff: There's a knock off Wolverine called Wolfgang, what. The game is fully mouse compatible which is a nice change from most of these types of games.  Overall rating: Nah, man.",
            "review_score": "-1"
        }
    ]
}