{
    "app_id": 298950,
    "name": "Darkness Within 2: The Dark Lineage",
    "release_date": "2014-12-05",
    "developer": [
        "Zoetrope Interactive"
    ],
    "publisher": [
        "Iceberg Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Horror"
    ],
    "achievements": 38,
    "positive_ratings": 98,
    "negative_ratings": 43,
    "price": 6.99,
    "description": "In &quot;The Dark Lineage&quot; you re-take the role of police detective Howard Loreid, a man tormented by the paranormal happenings around him. Howard discovers that his own terrible past has some connection to the madness that is about to swallow him, yet again.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/298950/header.jpg?t=1447361702",
    "minimum_requirements": "OS: Windows® 2000/XP/Vista™ Processor: 1,8 GHz Intel® Pentium® or equivalent Memory: 1 GB RAM Graphics: 256 MB DirectX® 9.0c compatible Pixel/Vertex Shader 3.0 support DirectX: Version 9.0c Storage: 2 GB available space Sound Card: DirectX® 9.0c compatible sound card",
    "recommended_requirements": "OS: Windows® 7/8™ Processor: 2,4 GHz Intel® Pentium® or equivalent Memory: 2 GB RAM Graphics: 512 MB DirectX® 9.0c compatible Pixel/Vertex Shader 3.0 support DirectX: Version 9.0c Storage: 2 GB available space Sound Card: DirectX® 9.0c compatible sound card",
    "reviews": [
        {
            "review_text": "Unfortunately, DW2 takes a step down in quality compared to its predecessor -- this, I suspect, is largely due to the switch away from Scratches-esque point-and-click style to a fully 3d engine. Everything just looks and feels a little wonky (and occasionally buggy). Worst of all, the world is too soft around the edges and lacking in detail compared to DW1... I just didn't feel as immersed in the environments despite the increased freedom to explore. This lack of visual subtlety seemingly leads to a similar lack of subtlely in the story and characters (e.g. in DW1, Howard is understandably shocked by every strange thing that occurs; in DW2, Howard is carrying   a living homunculus in his pocket for most of the game and barely bats an eyelid  ). And while the inclusion of more characters in the world was ambitious, the more prominently featured conversation system is clumsy at best and occasionally broken.  DW2 does do one thing more effectively than the first outing: the flow of the game and its puzzles seemed much smoother and more intuitive... I never felt stuck simply because I had no idea what Howard was supposed to be trying to do (as sometimes happened to me in DW1).  If you played and enjoyed Darkness Within 1, I can recommend Darkness Within 2 simply by virtue of the resolution it (sort of) provides to the storyline and the healthy dose of Lovecraftiness. If you haven't played or didn't enjoy DW1, however, you should consider avoiding DW2.",
            "review_score": "1"
        },
        {
            "review_text": "Great lovecraft mood, made me feel uneasy playing this game :) I can recomnt to all horrors fans out there.",
            "review_score": "1"
        },
        {
            "review_text": "Laggy as hell, I rarely get more than 30 FPS on minimum settings. Buggy as hell, I fell through the ground several times and had to reload an old savegame which made me replay about half an hour of gameplay which isn't very fun in a glitchy puzzle game with 20 FPS.  Weird riddles you don't even know you have to solve. Some riddles are broken; I couldn't solve the elevator code riddle in the beginning because it didn't give me the feedback you need to be able to solve it.  Hours of backtracking for objects you can barely see. I got stuck because I didn't pick up a bottle. As it turned out it was a bottle standing between 5 or 6 other bottles I couldn't pick up. I had to backtrack to pick up a small wooden handle lying on a wooden floor in the shadows.  Walkthroughs aren't helpful because this is the Director's Cut Edition which changes riddles and object locations.  There's an achievement 'Find all 4 flashlights'. After I fell unconscious I lost most of my inventory, including my 3 flashlights. When I woke up, I found my inventory in the other room - but only 1 of my flashlights. When I got back to the mansion and found the 4th one, it didn't trigger the achievement because I didn't have 4 flashlights at the same time. Great job.  Seriously, this game was so good in the beginning, but after a while you start noticing what a mess it is. Worse than the prequel.",
            "review_score": "-1"
        }
    ]
}