{
    "app_id": 299170,
    "name": "Vault Cracker",
    "release_date": "2014-05-15",
    "developer": [
        "Gogii Games"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Hidden Object",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 12,
    "negative_ratings": 19,
    "price": 3.99,
    "description": "Help Melissa find her son, his kidnapper and avoid the police radar!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/299170/header.jpg?t=1447361722",
    "minimum_requirements": "OS: Windows XP/Vista Processor: 1.0 GHz Memory: 512 MB RAM Graphics: DirectX compatible video card DirectX: Version 8.1 Storage: 183 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Another hidden object game like the other hundreds of games of the same genre. According to Steam, Vault Cracker was released in May 2014, yet the graphics look like the game is from around 2001. There's a little story of a woman who's son is kidnapped... all pretty basic.   There are minipuzzles like cracking safes, trying to find the right person in a crowd through hints and lockpicking.  Personally, Hidden Object games aren't really my cup of tea but there are better games of this genre. It took me around 3,5 hours to complete without hints.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Filled with glitches. Inventory items disappear, cursor goes inactive, can't pick up objects etc. etc.. Only paid 50 cents but what the hey it wasted my time.",
            "review_score": "-1"
        },
        {
            "review_text": "Could not complete the game, because there was a bug in it. It was also a bit boring, because it was much of the same. 3/10",
            "review_score": "-1"
        }
    ]
}