{
    "app_id": 299160,
    "name": "Empress Of The Deep 2: Song Of The Blue Whale",
    "release_date": "2014-05-08",
    "developer": [
        "Gogii Games"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Hidden Object",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 53,
    "negative_ratings": 12,
    "price": 3.99,
    "description": "Anna must find a way up to the floating Temple of the Clouds and with the help of her mystic animal guides find and save the children of light from the evil Empress Pandora.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/299160/header.jpg?t=1447361722",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: 1.0 GHz Memory: 512 MB RAM Graphics: DirectX compatible video card DirectX: Version 8.1 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Short version: 73%",
            "review_score": "1"
        },
        {
            "review_text": "Like the first entry in this series, it's especially easy. However, there are now more and better hidden-object scenes,. such that you can honestly classify this as a 'hidden-object game.'  But I enjoyed it less than the first one. The go-there-do-this gameplay is boring, the story holds no wonder, and there's no additional revelation about the game world. It almost feels like a bonus level for the first game.  But production values are OK. If you enjoy especially casual point-and-click adventures, you might like this one.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, nice scenarios (still, creappy laugh once every 5 min is a little annoying, would have been great if they could take it off once a zone has been cleared) Totally worth the buy, good gameplay, good puzzles (not complicated, but enjoyable) story is good and charcters are nice. Get it on an offer price for full satisfaction.",
            "review_score": "1"
        },
        {
            "review_text": "A lot better than the first one.  They polished up the voice acting, graphics, had plenty of puzzles and HO scenes. Its pretty wierd roaming around freeing animals, but the story stayed true to the prequel's plot for the most part.  Puzzles were waaaay too weak though. I literally blew through them like nothing. Don't let the short game comments get to ya, a solid good quality 4-5 hours beats 12-15 hours of garbage anyday.  This is one of the higher quality casual games you will be able to find, I'm happy with the 5 bucks I spent, especially after seeing much much worse HO games out there charging more.",
            "review_score": "1"
        },
        {
            "review_text": "i play the first so i got the second to play . It start out ok for about 5 min. then it lock up. Not to bad the 1st time but the next couple of times i had to use the control , alt , delete and start a new task . the next time it was more serious . i try but it got lock up BAD and even left a icon on my bottom panel that i couldn't even get rid of . So i will just shut the computer down and hope that will take will take care of it . I really cannot recomment this game at all. Not even on sale .",
            "review_score": "-1"
        }
    ]
}