{
    "app_id": 299910,
    "name": "Forgotten Myths CCG",
    "release_date": "2016-03-21",
    "developer": [
        "Anchora Games",
        "Dream Harvesters"
    ],
    "publisher": [
        "Anchora Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "In-App Purchases"
    ],
    "genres": [
        "Free to Play",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Strategy",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 36,
    "negative_ratings": 32,
    "price": 0.0,
    "description": "Forgotten Myths is a free to play online collectible card game that incorporates deck building, card collection and strategic gameplay in a fantastic historical background incorporating several civilizations, myths and legends in the same universe!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/299910/header.jpg?t=1459032970",
    "minimum_requirements": "Memory: 2 GB RAM Network: Broadband Internet connection Storage: 200 MB available space",
    "recommended_requirements": "Memory: 4 GB RAM Network: Broadband Internet connection Storage: 200 MB available space",
    "reviews": [
        {
            "review_text": "I am enjoying this game, though i will admit it took me quite a few attempts to pass the first few missions, but once you have an understanding of the mechanics it is actually pretty good. Try it and stick with it until you have finished the tutorial and i am sure you will fall for the game like me. Hopefully i will not be the only one to do one of the tutorial missions 7 times to pass it :)",
            "review_score": "1"
        },
        {
            "review_text": "Very fun Game! If you loved MTG you will love this Card collectors game. It's very similiar. And very addicting!! I love that you can get a free card just for logging in everyday. I have gotten 2x Legendary cards this way!!",
            "review_score": "1"
        },
        {
            "review_text": "Just played for the first time and liked it! But have to practice more to get the rules and stuff clearly.  ",
            "review_score": "1"
        },
        {
            "review_text": "It's not a good game. The software is still full of bugs and the Graphics User Interface (GUI) is pretty bad. You have no idea what's going on. You basically have a deck, 6 spaces for an Attack Zone, 3 spaces for a Fortification Zone and you try to wheedle down the opponent's HP to zero before your's does. Dear Anchora Games, please ensure that the game is properly tested before release. Thank you.  PROS 1. Similar to other CCGs The combat system is similar to games like Might and Magic: Duel of Champions (MMDOC) with multiple lanes and auto-attacking units.   CONS 1. Bugs Lots of bugs.  a. You have problems registering an account,  b. The atacks are not animated so you have no idea what is attacking. c. Certain objects stack upon one another in the loading screens  2. Tutorial Extremely silly. You are forced to play the tutorial in a fixed manner, rather than a menu of all the actions.  3. Extreme Pay 2 Win Just like any other CCGs, you must buy more cards with cash. In this game, it's even worse as Rare cards are more powerful than their Normal counterparts.",
            "review_score": "-1"
        },
        {
            "review_text": "This game seems to be pretty good but not my kind. I like graphics, gameplay system and so on, but it is slow and a bit messy for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Recently, the developers admitted that they can no longer support the costs of Forgotten Myths.  'Nevertheless, there is a solid game design in FM, with a wide range of features, and a lot more to come. It has massive potential, and we know that many people who play the game actually think it's better than most of its competitors, but the lack of activity or sloppy implementation kills the fun.  All it needs is proper implementation and marketing (which I can't do on my own and without any funds). So, if anyone is interested in purchasing FM and keeping it alive or nurturing it, I am more than happy to do that and see it live rather than see it dead. Moreover, I am more than willing to continue working on FM, if the new owners can compensate me or pay me'  This are the words of the designer and developer of Forgotten Myths CCG. I am part of the community and i don't want to let this game die. I personally think it has potential and it would be a great source of income, if good invested. You can also watch the Kickstarter trailer gameplay for more visual information.  FOR ALL THE COMPANIES/PEOPLE INTERESTED INVESTING IN THIS BUSINESS CONTACT THE DEVELOPER   support@forgottenmyths.com  or  emre.ozturk@anchoragames.com ",
            "review_score": "1"
        }
    ]
}