{
    "app_id": 300060,
    "name": "ADR1FT",
    "release_date": "2016-03-28",
    "developer": [
        "THREE ONE ZERO"
    ],
    "publisher": [
        "505 Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "VR Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Space",
        "Indie"
    ],
    "achievements": 22,
    "positive_ratings": 779,
    "negative_ratings": 601,
    "price": 14.99,
    "description": "ADR1FT is the story of an astronaut who wakes up floating silently in space amongst the debris of destroyed space station…the only survivor of a catastrophic event, left with no memory, a critically damaged EVA suit leaking oxygen and no way home.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/300060/header.jpg?t=1467226033",
    "minimum_requirements": "OS: Windows 64 bits Processor: Intel Core 2 Quad CPU Q9550 @ 2.83 GHz / AMD Phenom 9850 @ 2.5 GHz Memory: 8 GB RAM Graphics: GPU: NVIDIA GTX 650 2GB or AMD HD7770 2GB DirectX: Version 11 Storage: 6000 MB available space",
    "recommended_requirements": "OS: Windows 10 64 bits Processor: Intel i5 4570 @ 3.2 GHz / AMD Phenom II 945 @ 3.0 GHz Memory: 16 GB RAM Graphics: NVIDIA GTX 970 / AMD R9 290 equivalent or greater DirectX: Version 11 Storage: 6000 MB available space",
    "reviews": [
        {
            "review_text": "ADR1FT was the first game I played all the way through using my Steam Link and Steam Controller. I streamed to my living room TV from a PC upstairs with an i5 6500 and a GTX 970 at a resolution of 1920 x 1080. I managed to maintain 60 FPS throughout on 'epic' settings.  I thought the game looked absolutely beautiful, from the way the station was designed to the way it had been wrecked and strewn about.  The storytelling was sparse, but enough was slowly revealed that it began to make me question whether I actually deserved to make it to the end of the game (an interesting feeling that games don't often evoke in me). It felt genuinely eerie to occasionally come across the corpses of your crew mates floating lonely in the void.  The pace was necessarily slow and at times the game felt like a cousin of some so called 'walking simulators' I have enjoyed such as Dear Esther and Gone Home. However, the constant threat of running out of oxygen or fatally damaging your space suit lent an urgency not present in those games. The task at hand felt almost overwhelming at times, but I never felt bored or frustrated with it.  The only problem I had with the controls was that occasionally I was unable to grab oxygen canisters. Despite holding down the correct button my 'hand' didn't reach out. I'm not sure why this happened, but it usually worked within a couple of attempts.  Another slight irritation was that some of the ambient music that became a little repetitive when you took too long to get through certain stages. The music choices were perfect for the setting, but could perhaps have been extended or varied to fill a longer period of time.  This is my first game review on Steam and I felt moved to praise this game in particular because of the mixed reviews it has received from others. It is not a game for everyone, but I loved it!",
            "review_score": "1"
        },
        {
            "review_text": "ADR1FT is an atmospheric space walking simulator where you are stranded in space, and must find a way to survive and get back home.  Check out my  Quick Review  here:         YouTube™ Video:  ADR1FT - Quick Game Review&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "If you own a VR Headset (Oculus DK2 works fine btw) this is a no-brainer. Looks great and feels really intense. Also you get a really good idea how to move and how to better move not in VR.  Without a VR Headset it is a kind of boring but also nice looking walking sim in space. Wait for a sale if you like such games at all.",
            "review_score": "1"
        },
        {
            "review_text": "I like it, even with no oculus rift, you can get something wonderfull. Play it casually tho and don't rush it. The emotion you get is priceless.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty and immersive and that's pretty much it. This is a space VR tech demo disguised as a walking simulator, there is no gameplay other than pressing buttons to progress. I played through the entire thing in one sitting and it took 4 hours. That being said it can still be confusing at times (mainly due to 2D compass).   Also, while the game has fantastic art assets and sound, the music is absolutely terrible. It's not the ambient tracks that kill it, it's the god-awful 30 seconds obvious looping techno music that pounds into your ear drums at nonsensical times and can not be turned off. Never before has video game music made my head hurt. The music is so terrible I almost refunded the game before I finished it, thankfully the horrible noise can be snuffed out by completing certain objectives. Once I disocvered this fact racing to turn off the music became more pressing than finding oxygen.   If you're anything like me, the ending will leave you pretty indifferent, as the story doesn't really build to a proper climax and the only reason to play the game again would be to show off the graphics to your friends or collect all the audio logs and misc. garbage. I like the little universe they established here but it's really only a snapshot.   Overall it's an OK game, it makes me wish other space games had the attention to detail, immersion, and cool aesthetic. This game's ability to create a realistic feeling outer space experience is why I recommend it, because it's uncommonly good in that regard. (it's nice to have a space game in my collection with mostly realistic sound)  Here's the question you have to ask yourself: is going 'woah cool' to yourself a few times over the course of 3 hours worth 20 dollars?",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommend this game - if you are looking for a COD shooter or a game that basically 'feeds' upi all the solutions then this is not the game for you. Something refreshing and a visual work of art. Tales a bit of patience and rememember small burst on the jet pack and let yourself drift will get you a long way. Looking forward to trying this on VR.",
            "review_score": "1"
        },
        {
            "review_text": "Needs a little polish but it's a game that you will want to play through in (mostly) one sitting. Basically you have to fly around repairing your suit and various systems of the station - if that sounds appealing you should enjoy this. That said there is no logic to the plot or the mechanics - everything is contrived for gameplay reasons, and you have to be willing to look beyond that. The biggest problem everyone seems to have is that this deserves to be a AAA game with the polish and action of Call of Duty - but it isn't, so everyone comes away feeling underwhelmed.   There is a mp shooter called Shattered Horizon that is pretty similar in theme so check that if you want a shooter.  Music is pretty jarring and the audio levels break the immersion [being fixed] There are no control issues (with keyboard at least) 2D radar is pretty dumb (elite got this right in the 80's with a vertical line to indicate up/down)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best experiences for people who don\\t have vr. Although I must say that I have not completed the entire campaign, this game exceeds in many ways. Some being the whole space survival aspect and some being the story. Their is no other game like this one that can give me a chance to be an astronaut.",
            "review_score": "1"
        },
        {
            "review_text": "1. take out your iPhone, enable bluetooth and connect to your hifi. 2. run Music app, search 2001 - a space odyssey, choose track no.4  the blauen Donau Op.314, but pause it for now 3. run ADR1FT, choose free EVA 4. resume the sound track, turn the volume up 5. put on your oculus rift or compatible HMD 6. get high  update: I think I have managed to de-orbit myself during EVA(EVA free mode) by making radial burns(applying thrust toward earth - thanks for another great game KSP), and finally reached the surface, so why all the troubles for the EEV? *lol*",
            "review_score": "1"
        },
        {
            "review_text": "Regardless of the mixed and negative reviews, I really liked this game! The atmosphere is great, the visuals are stunning and the oxygen canister hunt ends quite soon in the game after the first suit upgrade.. For me, it never was too frustrating...",
            "review_score": "1"
        },
        {
            "review_text": "Cost of a trip to space $20,000,000.00+  Cost of this game $10.99  BUY.",
            "review_score": "1"
        },
        {
            "review_text": "Really great experience on the Rift. Feels a bit like your just going from point A to B with minimal interaction at first but it gives an incredible sense of scale and looks fantastic. Controls are intuitive and simple. Rolling can give some motion sickness and overal it's quite an intense game but definitely one of the top 3 experiences I've had in VR so far. Would definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "F***ing beautiful.  I spent too long looking at space in this game and I died of no oxygen. RIP.",
            "review_score": "1"
        },
        {
            "review_text": "I can say that ti absolutely recommend this game ... if you have VR. I can only assume this however due to the fact that i do not. I really do enjoy the visuals, the controls, and the idea behind the game. However, without using a VR headset i feel as though my line of vision has a hindrance placed over it due to the slow motion achieved from moving analog sticks. I could see really loving this game if i had the headset to fully experience it but without one it feels like i am just being left out.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting experience, albeit a bit short. But we knew that from the beginning. I played it non-VR with Gamepad on my 50 inch TV and enjoyed it so far. It gets a bit repetitive to be honest - go to station, find something, fix something, go back to center, repeat three times, finish game. If you're not up for it, wait for a sale and then go for it.",
            "review_score": "1"
        },
        {
            "review_text": "Played this on Octopus DK2 originally using the awful xbox controller. Now I have HTC Vive and with the newly released Vive version this game takes on a whole new level of realism. Looks and feels very realistic now. VR controls are well thought out. Takes a bit of practice getting used to the range of movements. Very impressive.  ",
            "review_score": "1"
        },
        {
            "review_text": "Adrift is really well optimized, the visuals and animations are looking really good, you get the 'alone in space' feeling in the game, So far i dont know what to expect story wise of the game, as i havent spoiled too much of it for my self, so its just diving in, but its high quality so far thats for sure. So if you like exploration adventure, you should get this.          YouTube™ Video:  ADR1FT Gameplay - Part 1 - Walkthrough (No Commentary)&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "extremely good looking maxing out with i5 6600k and gtx 970 but point i want to get to is the game is not paced its alittle slow mainly for eye candy but game is great so far THUMBS UP!!!",
            "review_score": "1"
        },
        {
            "review_text": "The story may be short and a little heavy handed, but I loved exploring the station and navigating in zero G. $20 well spent.",
            "review_score": "1"
        },
        {
            "review_text": "Finally got to play this game on the Vive in VR today after a few months of waiting. Really enjoyed myself. I find most of the complaints about the VR implementation to not bother me at all. To me it's more realistic that the helmet look isn't mapped to your HMD movement, as that's how it is for an astronaut in space.   Similarly, the issue of the VR controllers not being mapped to your hands didn't bother me much (although it does look a bit weird). Would be cool if they could update that in the future, but I'm still really enjoying the experience regardless.  As for the game itself? I think it would be a bit boring if it I was playing it in 2D. In VR, I feel like I'm in the movie gravity in the best possible way.   I'm not prone to motion sickness, and I haven't experienced any here (there do seem to be some special controls in place to manage this for those who are sensitive to it).   My vote? For $20 it's worth it if you're into the idea of an astronaut simulation with a subtle but interesting story. If you can catch it on sale for 10-15, it's an absolute steal.",
            "review_score": "1"
        },
        {
            "review_text": "This is good but the game could havebenn better 6-10",
            "review_score": "1"
        },
        {
            "review_text": "Having only played the game for just under two hours, I have already fallen in love with this game. I can tell that a phenomenal amount of work and love has been put into the creation of this truly amazing game. The game controls well and feels right. the gameplay is intriguing and I aven't been able to put it down until I decided to write this. The scenery is truly breathtaking and every time I look around myself I am at a loss for words. I would recommend this game to anyone, even if they hated all things space, for this game has put me at a loss for words. I now cannot wait to try this in Virtual Reality.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome and breathtaking adventure. Its hard to learn controlls but don't give up and go forward.  Stunning graphic. Thank you for such a awesome adventure I just started.",
            "review_score": "1"
        },
        {
            "review_text": "Gravity The Game  Seriously, you can tell the inspiration here.   Controls need some work. Too sluggish.",
            "review_score": "1"
        },
        {
            "review_text": "Don’t let it go ! Adr1ft is the closest spacewalk experience ever offered by a video game. Visually gorgeous with ultra-realistic space views. This first-person spacewalk adventure immerses you in a stunning feeling of isolation, weightlessness and urgency to survive in space. The lack of direction to follow the survivor pass and the repetitiveness in actions progressively raise a feeling of frustration through the EVA experience. But this is all what a real spacewalk is about. Steady carefulness, slow motion, repetitiveness in basic actions, thinking ahead, spatial awareness and mastering the frustration of the suit limitations &amp; constraints are key skills to be mastered to perform a safe and efficient spacewalk, which requires patience dedicaction and determination. You’ll need all of these to make it through in Adr1ft !",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't going to be for everyone. Why? Because it's going to make many people sick. I'm starting to think there are two different kinds of VR games emerging:  1.) The stuff most people can play because it doesn't make most people sick 2.) The really advanced stuff that will probably make most people hurl, but that a select few will gladly play just to have the experience.  I think this game falls into the latter category. I'm playing on the HTC Vive. Let's talk about the Vive experience:  The controls are a little clunky. The menus have no pointer device as we expect. Instead, they use the D-pad on the left controller to navigate. This isn't clear from the instructions given, but once you figure it out, it's no big deal.  The controllers don't manipulate the hands in-game, but I didn't really care. You can still swipe at objects and make them fly away, which is cool.  Controlling the EVA suit is a *lot* like flying a drone. You have full 3d freedom. Up, Down, Forward, Back, Strafe Left, Strafe Right, Pitch, Yaw, and Roll. As such, it takes a while to master. The computer helps you a bit, as Pitch, Yaw, and Roll auto stabilize, but you still drift freely in the other dimensions. This means you have to learn to do momentum math in your head, just like with a racing drone. If you add thrust in the forward direction and you're already going forward, you go forward faster. The nice thing is that there is an 'EVA Brake' (both triggers) which will mostly stop all movement. I wish my drones had that feature!  I did feel nausea, but dude... I was in a freakin EVA suit in SPACE! You have any idea how much astronauts have to train to keep their lunch in situations like this? I feel like you're completely crazy if you expect to have an EVA spacesuit experience without the nausea.  I'll *never* actually be able to afford a trip to space, so this is probably the closest I'll ever get. I'll gladly hurl a million times in exchange for the experience.  BTW, I thought the nausea was controllable as long as I was expecting the movement. It became an order of magnitude worse when I would hit a bulkhead unexpectedly, or a piece of space junk, and unexpected movement would result. The auto EVA Suit repair station movement was the WORST. I almost hurled right there.  Still, it was all worth it and I'll be coming back for more.",
            "review_score": "1"
        },
        {
            "review_text": "Ghange my mind. Finally I have to say that the game is interesting. Greetings.",
            "review_score": "1"
        },
        {
            "review_text": "The attention to detail in this game, for a first-year VR game, is astounding. It completely pulls you into the feeling of being an astronaut on a heavily-damanged space station. You have to as much energy as possible, while you gingerly navigate around debree and rooms.  That said, there are some cons. The controls actually take time to 'train,' because they seem based on propulsion jets in your suit. In that way, the controls become part of the game itself.  Also, you're pretty much alone in an open-world-styled exploration. I think the atmosphere (no pun intended) is super cool and engrosing, but I can see how others, who want a little more flash-bang in their game, might bounce off this one.",
            "review_score": "1"
        },
        {
            "review_text": " Remarkably smooth zero-g controls and a very impressive presentation render  ADR1FT  immediately immersive. Players knowingly expecting a short and very slow-paced atmospheric experience focused on simple exploration should not be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "Breathtaking.",
            "review_score": "1"
        },
        {
            "review_text": "I personaly really enjoyed this game.",
            "review_score": "1"
        },
        {
            "review_text": "CLASSIFIED AD : I sell my car, my dog, my wife for symbolic 1 $ in EXHANGE FOR a complete equipment VR! any proposal will be studied! :D This game is right stunning! I explored only this short end of space and most of the wreck but what a trip! Don't listen the guys who have played during only 0.1/ 0.3 hour, they missed everything about the game and what it has to offer! this game asks you to take your time with relish! Look around you , float in the void, kiss walls , and run after the escaping oxygen cans ! and so many more! If you are european use the windows shortcut Alt+Shift in-game to get instantly your keyboard turning in Qwerty mode and that's it ! Thanks for the ride dev's ! Waiting for completing my trade above to play it again with VR ! :D   ",
            "review_score": "1"
        },
        {
            "review_text": "Short, but looks gorgeous in VR. Simple and easy to play. Now that it's 10 dollars, I can recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Floating in the space, no borders to hold on , completely free. First time i got out of the module and come to extraordinary our planet view i was astonished. Just looked in green planet surrounded by ocean and radiating atmosphere. i looked till i ran out of air. Like die of thirst while looking into fresh water lake, but not be able to come and drink it.   Uhh... i need better pc to run this beauty.",
            "review_score": "1"
        },
        {
            "review_text": "Fix the same space station modules 4 times while swimming in space for 2 hours.. What a waste of scenery. This could've been so much better.",
            "review_score": "-1"
        },
        {
            "review_text": "I'd heard of Adr1ft awhile ago when the VR headsets were really getting a head of steam going. It looked really cool back then and I was fortunate enough to pick it up in a Humble Bundle recently. I got right in and it looked really nice, had interesting mechanics that will probably always be a headache to use, and it seemed fairly linear, although you're in the vast recesses of space. The main problem I have with this game is the God awful radar. There is no indication of how far away from an objective you are, you get a 'It's either left or right!' indicator and then another arrow that pretty much always points up or forward, no clue which. As another reviewer so succintly put it, you're floating about in 3D space with a 2D radar. Gee, thanks. I spend most of my time trying to figure out where the hell my next objective is and get so frustrated I usually just let my oxygen run out so I can start at my previous checkpoint. I was sincerely hoping this was early access but it's not and I doubt the devs are going to bother making the radar NOT a useless pile. Right now I'm debating on whether or not I even want to bother finishing.",
            "review_score": "-1"
        },
        {
            "review_text": "Got this from the Humble Bundle. Played for a bit, died twice. It got really annoying trying to get used to the controls for 30 minutes. Half the time I'd run into the walls and have to keep repairing my suit over and over; sometimes, even just a tap of something or a tap of the wall at the lowest speed possible will break my suit. Everything is spaced out and travelling from the starting module to the next takes about 5-7 minutes without the thrust upgrade. Plus the radar is not great at all. Another reviewer put it clearly that it's a 2D radar when your playing in a 3D space.   UI is cool and graphics are great. I was able to run it max settings with a 1070, but with the frustrations I've had, I don't think this is worth it at all. I don't have a VR headset so I don't know if that's the selling point of this game. Using a mouse and keyboard works, but you can't change the keybindings.  The game looked cool, it's just not that   'fun.' ",
            "review_score": "-1"
        },
        {
            "review_text": "Won't recommand it for vr since the head tracking is useless... So nope i didnt really enjoyed it that way even if it could have been amazing they shoved up the VR feature like a last thing they forgot 2 days before release so yeah.... Won't recommand.",
            "review_score": "-1"
        },
        {
            "review_text": "Float through space and collect things simulator. DONT LOSE OXYGEN      Story was bland and not well displayed to the player. Player showed no emotion or dialog or life for that matter. Ending was 4/10.",
            "review_score": "-1"
        },
        {
            "review_text": "I had to quit after 10 minutes because I was about to puke. Don't buy this if you're prone to motion sickess. It's a shame because the game is exceptionally beautiful.",
            "review_score": "-1"
        },
        {
            "review_text": "Was looking forward to playing this with my rift, so I bought it while on sale. All I can say is that I am sorely dissappointed. Game performs very badly with frames dipping well below 50fps constantly while outside and that is a big no no while in vr and thus making it very uncomfortable to play. I have a gtx 1080 and i7 6700k and it still runs like poo. And there is no graphical settings to be found. Hate to see what it runs like on a lower card.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is 'ok' but you run out of oxegen too fast. You can't investigate and enjoy the game because your running everywhere to find the air. You fix your suit and it still looses air to fast. If you want people to really enjoy your game, look around then don't make it this difficult. Also, what about saving? save points? anyways, its a good idea but I got tired of it fast due to these issue and stopped.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm kinda torn about this. It's a glorified Tech Demo. On one hand the graphics are amazing and thats putting it lightly. But on the other hand the gameplay gets old very fast. It makes you do the same repetitive things over and over again. The first 1 or 2 times is okay but when it starts making you do the same objective 4-5 times it starts to get a bit repetitive. Espcially since its about 3-4 hours long. Also the game can be VERY difficult to navigate even with the HUD. About 90% of the game is just floating around going to the next objective. They took a 30 minute game into 3-4 hours. Now the other 10% is rather nice. But it's not enough. The voice logs give you a lot of info on the crew, what happend etc. Voice acting is very good aswell. I beat this game 3 times to give it a fair review score. So should you buy this game idk? I'd say wait for a sale at about 9.99$ and pick it up then.  My score 5/10 Wouldn't recommend it at full price. (19.99$) Get it on sale. If people like the game they will thumbs this down if you don't it'll be up. But we all know the truth that it's not worth the money.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok so im reviewing this AFTER the htc vive update, so I personally would give this game a 3/10 its just horrible on the vive, they dont allow turning of the head, they dont allow motion controller support, and they dont allow any movement. This game feels like it was designed for you to sit and your chair and play like a normal game with keyboard support, so I dont understand why people are excited about this being a great 'VR' game, it just doesnt work.",
            "review_score": "-1"
        },
        {
            "review_text": "This is not really a game. It is more a little bit anoying tech demo. What a waste of possibilities!",
            "review_score": "-1"
        },
        {
            "review_text": "This is not really a game. It is more a little bit anoying tech demo. What a waste of possibilities!",
            "review_score": "-1"
        },
        {
            "review_text": "While not necessarily a  bad  game (along with some  thekthy  visuals), its just so slow and boring  Shame because this is technically the 420th game on my Steam account, too bad that honor couldn't gave gone to a better game :|",
            "review_score": "-1"
        },
        {
            "review_text": "Way too many crashes in 22 mins. Good looking game just needs more work on making the world more open instead of just traveling through debris.",
            "review_score": "-1"
        },
        {
            "review_text": "before today  I've never EVER  played a game where hiring the FOV makes you see LESS  but I went and bough ADR1FT  and ♥♥♥♥ man You wear a helmet right cause its space right so I wanna look around and enjoy dem graffix so I turn FOV to half  and basically, the FOV just moves your eyes back, like normal FOV's do except the Helmet stays the same so basically, the Helmet on Low FOV takes up the edges of the screen, like 5% of the screen I'd say at 50% FOV, it took up half the screen and literally narrows your vision Also, from my 23 min of gameplay I got 2 other gripes 1) the game looks really good, but on medium, I was hitting 30FPS average, with drops to 17 and it looks good, but not THAT good, ya kno Keep in mind, I can play Mafia 2 and LA Noire at 60FPS with 8x AA and finally, good ♥♥♥♥in lord, the suit  if you hit your helmet or your back etc you take damage, which I expected tbh but if you bump into a wall with your front or even your LEGS you also take damage  I literally stepped out of the first repair bay, lowered myself to touch the floor and bam, my screens already starting to crack so yeah, refund time",
            "review_score": "-1"
        },
        {
            "review_text": "Looks great but I'm so disappointed that it doesn't support the greatest VR headset out there the HTC Vive. Sorry guys big thumbs down from this VR customer.   I'm almost a little tempted to ask for my money back because of the false advertising with having the HTC Vive logo / water mark on the second picture in when you look at the store page when it doesn't support HTC at all. Customers be warned.",
            "review_score": "-1"
        },
        {
            "review_text": "possible bug in ad1ft, once everything is done, eev door shuts if you leave cerbulum and come back, IT SAYS ITS OFFLINE",
            "review_score": "-1"
        },
        {
            "review_text": "This is my first review since I don't usually buy games on, or close to release, and rather wait for reviews to come in, to make a more informed purchase. Well, this was not the case with ADR1FT. I have jumped on the hype train since the first footage of the game was released. I mean what was not to be hyped about? Being stranded in wrecked space station orbiting earth, maneuvering in zero g, all with stunning visuals. These last two really sum up my experience. I really wanted this game to be great, but it falls short on anything but looking really nice. The plot is rather non existent, and I never really felt compelled to uncover the backstory behind the catastrophe that struck the station, since all the information that is feed to the player is not engaging in any way, and so are the characters. The main objective revolves around rebooting the station mainframe, and hopefully reaching Earth. In order to do this player has to    'burn' four disks and upload them into the mainframe.   Each of these quests is an exact carbon copy of one another, with little variation in the 4th attempt.  Throughout the game, the only resource you need to manage is oxygen, that is also used as a propellant for your EVA, but as you progress through the objectives, you'll upgrade your suit, and it's oxygen capacity. At that point it's pretty much impossible to die. Apart from upgrades, there are repair stations, which apart from aesthetics (basically removal of the cracks on your visor, which apparently is made from most fragile material known to mankind) don't do anything. As mentioned before visuals are awesome in every regard, but music is at times underwhelming. Apart from wonderful classical pieces by Debussy in the menu, ingame electronic music kicks in out of the blue and loops mercilessly especially around 'disk burn' stations - borderline annoying.  Movement in zero g is rather well executed, yet often times I found myself hitting walls and other obstacles, where I was certain I still had plenty of room around me.  My impressions probably would be a tad better, if I had experienced ADR1FT through a VR set, but on the other hand does that mean that all VR dedicated games can be lacking, as opposed to their screen display counterparts? It took me 3 hours to complete the game, and I'm leaning towards opinions that it's a walking simulator that has gone tech demo. All in all, at the current price of 20€ I don't recommend this game unless you are a space nut that happens to be equipped with a VR set. If you are a LCD pleb like me, wait till this game is on sale.  PROS: -great visuals -zero g movement   CONS:  -poor story -extremely repetitive 'mr fix it' quests -short -not challenging esp. after EVA upgrades",
            "review_score": "-1"
        },
        {
            "review_text": "*Warning, high probability of spoilers*  When I saw this game annouced I assumed it would cost less and be shorter, a proof of concept and excellent use of unreal 4 engine. It appears they expanded on their initial design to make the game longer, at the expense of repeating the same quest 4 times (with a slight twist) before being able to blast home. However an annoying reminder before you leave shouting 'Get all the collectables!'   Pros: - Beautiful - Gravity the Game - Physics worked well - about what I assume being in space would be like - Designed for VR, will be worth playing with a VR headset.  Cons: - Short, poor story - Story telling didnt tell much, a mash up of random recordings and some boring email strings to tell you whats happening - All I know is it's my fault cause im greedy... Lots of unanswered questions and empty plot points.  - Poor HUD / Waypoint system. Most of the time was spent trying to understand where to go. Wasn't impossible, could have been better.  Synopsis: A beautiful proof of concept of a game, excellent use of new unreal technology and stunning visuals probably built for an outstanding VR experience. Worth the $21.99 CAD? No, Suggest waiting for a steam sale, $10 would feel right for a game like this.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible controls. You'd want to throw up immediately.",
            "review_score": "-1"
        },
        {
            "review_text": "What a load of rubish. Really really hate this game. Floating about like a Tw**. There'as no gameplay involved. Total rip off. Do not buy this (IMHO). Trite.",
            "review_score": "-1"
        },
        {
            "review_text": "Playing on Vive, it keeps wresting control from me when I go past O2 cannisters, spinning me around and making me nauseous.",
            "review_score": "-1"
        },
        {
            "review_text": "Of all my 20 VR games, ADRIFT is the only one that has never worked, ever, no matter the install scenario. Machine is a brand new w7. an i7 w/1080 Nvidia, so...",
            "review_score": "-1"
        },
        {
            "review_text": "Really disspointing...  I was looking forward to playing this on the Vive after hearing all the hype from Rift users (mainly media) but after jumping in it reminded me of when a console game gets super hyped and when you try it on a PC you realise the hype comes from people who just dont know there's far better out there.  The graphics are decent, the audio is really nice but the gameplay falls flat, the controls (on the Vive) are terrible (they should have used existing standards for movement mapping) and the reason why you have controllers and hands is mind boggling, I have no idea who thought that would be a good idea to have both instead of just mapping the hands to the controllers or just getting rid of the arms and have floating hands. This was also the first VR experience I've tried since DK2 to make me feel uncomfortable (not competely sick but definitely uncomfortable), it might have had something to do with the clumsy control scheme but I'm sure the auto align stuff also had something to do with it, especially when it locks onto something you hadn't inteneded it to and it wips you round to look at it.  All in all the idea is cool and it has (had?) potential but due to what feels like a lot of really bad design decisions the excecution falls flat on it face.",
            "review_score": "-1"
        },
        {
            "review_text": "On Vive, this game is early alpha at best. The controls are a mess. They don't work as motion controllers at all, more like a broken gamepad. If you're going through the tutorial, make sure you have the right controller in your right hand and the left one in the left. Don't know which one is which? Yeah, neither did I. Oh, and don't try to reverse the y-axis -- it'll crash the game. And there's no way to recover from within Steam VR, you've got to go through task manager.  I've asked for a refund. That game had better remained a Rift exclusive.",
            "review_score": "-1"
        },
        {
            "review_text": "Have only played about 45 minutes and I have to say, while it looks really nice and runs perfectly smooth (all settings maxed at 1080P, vsync on at 120Hz) on a GTX 970 and 2500K, its just... not really fun or engaging. You basically just float around, banging your unmovable legs into things, trying to decipher the radar, figure out where you're going, and look for glowing bottles to refill oxygen. If I haven't done something interesting (DONE... not SEEN) in 45 minutes, the game is lacking something.   I might keep playing some time, but I don't get a lot of gaming time these days, and I have a lot of other titles to catch up on that I'm sure provide some entertainment in the first 45 minutes.  Its really too bad, because pretty looking games that have high production values and aren't M-Rated gore-fests are almost non-existent these days.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Apparently my helmet is 3 feet wide. If something gets into a corner, you'll bust your helmet open before you can get your hands to it. I feel more like I'm swimming than like I'm in space. Controls are sluggish, unresponsive and easily cause motion sickness. Also why does rolling burn fuel but all other kinds of turning don't?",
            "review_score": "-1"
        },
        {
            "review_text": "What a shame. This game looks great, but game play is poor and story unengaging. It really feels like a good game could have been here, but it never shows up. Frustrating at the start as I died many times learning how to feather the throttle on my suit. I eventually figured that out, but I was disappointed by the repetative nature of the game. Once you have repaired one quarter of the station you have basically played the game. Because there is little else to offer as you repeat the same task three more times. Took me around 9 hours to finish and it really started to drag on me. Can't recommend this one, unless you play around in free mode for a couple hours with a VR set. Other than that, I would pass.",
            "review_score": "-1"
        }
    ]
}