{
    "app_id": 300300,
    "name": "Ichi",
    "release_date": "2014-06-12",
    "developer": [
        "Stolen Couch Games"
    ],
    "publisher": [
        "Stolen Couch Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Puzzle"
    ],
    "achievements": 17,
    "positive_ratings": 517,
    "negative_ratings": 58,
    "price": 3.99,
    "description": "Ichi is an easy to play but challenging one button puzzle game. Don't be deceived by the game simplistic look, it’s a braintwister for sure! Collect golden rings by rotating objects, using teleporters, breaking blocks and more.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/300300/header.jpg?t=1447361780",
    "minimum_requirements": "OS: XP Processor: Intel core or AMD Memory: 512 MB RAM Graphics: Integrated Graphics DirectX: Version 9.0 Storage: 100 MB available space",
    "recommended_requirements": "OS: XP Processor: Intel core or AMD Memory: 512 MB RAM Graphics: Integrated Graphics Storage: 200 MB available space",
    "reviews": [
        {
            "review_text": "ichi is a simple and addictive puzzle game with crayon style, in which you have to solve a lot of puzzles.  Pros: - Simple and smooth gameplay. - Good soundtrack. - Friendly interface. - You can create your own levels.  Cons: - The online interactions are limited  Definitely i recommend this game if you love the puzzles like me. :)  10 / 10",
            "review_score": "1"
        },
        {
            "review_text": "Neat little puzzle game. While the initial 60 levels are rather short and easy, there are thousands of user submitted levels, and that is what truly makes this a nice game, and seperates it from what would normally be a mobile title.  I would rate it 6/10 and suggest buying it on sale or in a bundle.",
            "review_score": "1"
        },
        {
            "review_text": "With Ichi, what you see is what you get. It's simple, yet still challenges. The game includes a level editor too so you can make your own levels or play levels other people have created. It even includes a rating system. There is a significant amount of user created content offering plenty of gameplay to enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Thinking with triangles.",
            "review_score": "1"
        },
        {
            "review_text": "a really simple yet extremly fun puzzle game. I played through it straight in one sitting and playing custom levels is a great addition to it's longevity. Creating your own levels is really fun as well.   There's a few bugs but they're not to big of a deal, and try posting in the forums if you need someone to play your levels so you can get the 1000 point achievement.   I seriously can't recommend this game enough.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "An extremely simple puzzle game that seems to rely heavily on the community-made levels to keep you interested since there are only 60 in the base game which are very easy to figure out. No stories, no conclusions, just all puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Nice brain-twisting puzzle game where you simply need to guide a ball by rotating triangles in order to collect all the gold rings; however, there are obstacles to avoid as well as finding a way to do it the most efficient way as possible.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and easy,   The good: Creative kind of game, with a simple but nice interface and styling. When picking the good community maps, offers hours of puzzling.  The Bad: Plaqued by the achievements.  There are lots of bad puzzles in the community because of the grindy nature of some of the achievements (which require you to publish puzzles and get people to play them). To add insult to injury, achievements often don't register.  Game would benefit from more default puzzles, or creator-approved community puzzles.  For the price, recommended.",
            "review_score": "1"
        },
        {
            "review_text": "somehow, the music itselfs makes me feel good while playin. good game, simple but much fun. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "GAME OF STRATEGIES. IF YOU ARE INTO THESE GAMES, YOU'LL SURELY ENJOY IT.",
            "review_score": "1"
        },
        {
            "review_text": "Worth a 1$ or so. It's ok.",
            "review_score": "1"
        },
        {
            "review_text": "fun 1 click puzzle game deffinitley worth 5 bucks :D",
            "review_score": "1"
        },
        {
            "review_text": "Fun little puzzle game. Well made, and rather challenging. While difficult it isn't annoyingly so. It's fun to figure out what to do and how to do it. Overall it is a simple yet fun, and creative puzzle game. definitely reccomended.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty challenging and fun. To be honest, it's surprising it wasn't made sooner considering what it is about. Also it may be weird, but I find the music, graphic style, and general vibe of the game to be cute. Is that just me? Regardless, I recommend the game, but the price is sort of pushing it. (the game is usually $5, but I got it on sale for $0.50)",
            "review_score": "1"
        },
        {
            "review_text": "Fun and easy game with cool achivements.",
            "review_score": "1"
        },
        {
            "review_text": "suprisingly good got it for 0.49usd the music sounds great the gameplays so much fun lol",
            "review_score": "1"
        },
        {
            "review_text": "8/8",
            "review_score": "1"
        },
        {
            "review_text": "Nice and easy puzzle game. :) I love the graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Some reflex, decent challenge, refreshing puzzle-type.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun little puzzle game, but it's getting downvoted because it's a tablet game with a tablet interface, and works poorly on Windows. Since this is a Steam review, I can only rate this game on the Steam experience that most users will have.  As such, because of the poor interface and non-existent graphics settings (puzzle games don't need much, but none is much worse than some!) we're going thumbs down here. If you like puzzle games, buy this for iPad/Android. It's not a PC game and it's deceptive of the developers to market and publish such a bad port as a PC game.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a puzzle game where you click one button to rotate either a single triangle or multiple triangles to bounce a ball around. It's a game that makes you think but I didn't like it that much. But there are a ton of levels and points are awarded for how efficiently you solve it. If you like the sound of that go and get it.",
            "review_score": "-1"
        }
    ]
}