{
    "app_id": 300320,
    "name": "The Few",
    "release_date": "2014-06-18",
    "developer": [
        "BlackMoon Design"
    ],
    "publisher": [
        "BlackMoon Design "
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "World War II"
    ],
    "achievements": 10,
    "positive_ratings": 86,
    "negative_ratings": 70,
    "price": 5.59,
    "description": "Take command over RAF during the WW2 history turning point, the Battle of Britain! The goal of the game is to defend Great Britain against German bombing raids.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/300320/header.jpg?t=1447361781",
    "minimum_requirements": "OS: Windows XP/Vista/7/8 Processor: 2,33 GHz or faster Memory: 1024 MB RAM Graphics: Produced after 2009 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The Few's gameplay is simple and can be divided into two parts. First, airplanes, factories, and airfields are built and organized. Then, enemies attack the player and combat mode commences. The goal is to defend the country for certain (It's maximum 50 I think, at least as I saw of achievements) days and survive the enemy raids. The animations, user-interface, and art style are nicely polished and the music fits the theme. The voice acting and monologue for the commander are really kind of great for this game! This is biggest part of the game for me :p atmophere is important for me at every games.  The game is really easy to get into because of its simple game mechanics and built-in tutorial. But unfortunately, there's no hook.. The majority of the game involves waiting to be attacked, but this can be sped up or slowed down by changing the time-pace. Stopping and fast-forwarding through time is definitely a neat feature!! The designation of linear path movements for friendly planes is also part of the gameplay. The main character can also be customized, but it doesn't serve much use in the game. The pilots' names can be changed which is also nice touch to me.. Overall, the game has little variety still.. I don't play that much this kind of 'war' games but if we would say graphics and perspective doesn't matter for me, it's a great 1940 game... Your job is to defend Great Britain by controlling the allied airmen of the Royal Air Force.. And as I can remember the games name exactly comin from here.. So I bought this for really some low money. Cents maybe, I don't remember. But I prefer to review this kind of games, rather H1Z1, Assassin's Creed or bla bla bla a lot of famous games..         Graphics   6.1/10       Voice/Soundtracks   8.0/10       Gameplay   7.7/10       Story   3.9/10       Generally   6.9/10    ",
            "review_score": "1"
        },
        {
            "review_text": "This game is something I looked for, for a long time. 'The Battle of Britain' was not just about the brave pilots and fighthing in the air but several important factors were involved and decisive (experience of pilots, availability of planes, radar system and a few more) and all these factors are present in the game. Nothing is perfect, so AA power is definitely overrated (the entirely squadrons are wiped out but AA fire in this game!) Also economy is extremely simplified and - if you know a bit a reality of BoB - you will be shocked by the hundreds of Germans shot down every day. Anyway, I am picking on this game - something definitely not deserved! At present, it is definitely the best software game about 'The Battle of Britain' I came across. Big credit and thanks to the creators! Be sure that I did enjoy it as well as my 7 years' old son.",
            "review_score": "1"
        },
        {
            "review_text": "as a brit and a fan of the RAF i had to get this game and i have never gone back since this game is one that will keep you on yout toes and keep you gessing as to how big the german air raids will be.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun little game. You spend half your time building radar installations, training new pilots, setting up patrol routes and so on. The other half of your time will be spent commanding your fighters in the air to air missions.  Defending the British iles is pretty straightforward, you set your planes up to fly a little patrol flight around their airfield, build some new airfields, buy some more planes, and that's it really. There's not much to it and that's a bit of a shame, but it's fun enough.  The air combat is just as simplistic as the command mode, you draw paths for individual planes to follow and attempt to shoot down the enemy. They really fall into two catagories as Fighter and Bomber, and while there are slight differences between the different types of fighters and bombers it's negligible when it comes to how to press the attack. There's only 10-or-so plane types in total of which you can command only 2. And while that's pretty realistic I would've enjoyed hunting submarines with floatplanes as a side gig.  All in all, 2 bucks was a steal for this bundle of fun, and the developer is free to cash in another fiver whenever they make a sequal with more stuff to do.",
            "review_score": "1"
        },
        {
            "review_text": "☑ Nice sky war simulator and manager ☑ Hexagon turn based speed strategy ☑ Better then classic Battleship game  ☒ Plane shooting AI is bad ☒ AA guns do not help ☒ Air radars do not help",
            "review_score": "1"
        },
        {
            "review_text": "suprisingly entertaining. Little indie game that allows you to watch your helpless airmen get blasted out of the sky by overwhelming luftwaffe odds. Would of been nice if they created a two player game or allowed you to play the part of the sausage eaters but for the price you can't complain.",
            "review_score": "1"
        },
        {
            "review_text": "Rather repetitive. Once you grasp the basics, you find that there's nothing beyond 'basics' at all, but ton of micromanaging the same dogfights.  Lack of depth and gameplay development makes various UI bugs, random peaks in difficulty and localization problems fade in comparison.  Would be pretty nice for early access alpha build though.",
            "review_score": "-1"
        },
        {
            "review_text": "got it in a bundle .. got trading cards .. the stupid game only gave one back ground three times i got its badge ..  ",
            "review_score": "-1"
        },
        {
            "review_text": "Okay game. Worth $2.50.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like bugs, this is a game for you.",
            "review_score": "-1"
        },
        {
            "review_text": "This is not a historically based game. It is arcadish. It is repetitive, and at times tedious. The AI has some gimmicky aspects to it. It is only worth buying if the price stays as low as it is now. For under $10 USD it will give you a few hours of game play but probably not more than that.   I do not recommend this game.",
            "review_score": "-1"
        }
    ]
}