{
    "app_id": 300400,
    "name": "Unpossible",
    "release_date": "2015-07-03",
    "developer": [
        "Acceleroto, Inc."
    ],
    "publisher": [
        "Acceleroto, Inc."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Racing",
        "Fast-Paced",
        "Arcade"
    ],
    "achievements": 15,
    "positive_ratings": 89,
    "negative_ratings": 13,
    "price": 1.99,
    "description": "Unpossible will test your skills, your reflexes, and even your memory. It will make you smile. It will probably make you scream. You will die often and it will always be your fault. Fight to learn the obstacles…they already know how to fight you. Relentless. Thrilling. Unpossible!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/300400/header.jpg?t=1447361785",
    "minimum_requirements": "OS: Windows XP or newer Processor: 2GHz Memory: 2 GB RAM Graphics: DX9 / Shader Model 2.0 or newer graphics card Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A pretty fun and nice-looking reflex game. It has 3 modes of difficulty: Simplicity, Futile, and Ultra, and every time you play, the stage is more or less random with obstacles placed in a different pattern. You do get some types of obstacles more common in one difficulty than another, but their placement and pattern often varies. Your goal is to last as long as you can.  For each difficulty level you also get a special daily stage. This stage only changes after every 24 hours, so if you're not a fan of the randomness aspect, you can always play the daily stage and try to memorize your way through it.  There isn't much else that this game offers, so my only critique so far is that it needs more content, perhaps in a form of more game modes (not necessarily difficulty, but just different goals), but what it does have is pretty fun if you fancy to test your reflexes, precision, and decisiveness, and it costs hardly anything.",
            "review_score": "1"
        },
        {
            "review_text": "This game + Vaporwave, but we need purple and pink too.",
            "review_score": "1"
        },
        {
            "review_text": "Dodge, Spin, Twist, Crash Repeat :D  Very simple in principle and very fun in practice, go as long as you can and avoid all the obstacles you can. (You will hit something eventually)",
            "review_score": "1"
        },
        {
            "review_text": "Having played this game on my cellphone for quite some time I was happy to purchase it for pc as well. It is a good game and excels for wasting a few minutes of time should your mind find boredom waiting for other tasks to complete. Unpossible is simple to pick up yet difficult to master, requiring strong, constant concentration to avoid collisions. For its tron-esque appearance and addictive gameplay style I give it an 8.5/10.  I have compiled a brief list of my thoughts/ideas for improving either your play or perhaps the game itself. They are suggestions so take them with a grain of salt. It’s Unpossible that 100% of my ideas are good.  1. Have a 'training' mode where the user can select or deselect which types of segments will appear. (If there is a particular set of obstacles like the rotating triangles that keep killing you, then isolate them and practice running their gauntlet until mastery has occurred.)  2. Add variable speed scaler in either the (+) or (-) direction  3. Add color option to modify the luminosity/hue of Unpossible's color theme.  4. For PC add controller support for gamepads, analog sticks, etc....  5. Increase Max sensitivity range for controls.  6. For those who might be having difficulty add a 'ghost' mode that allows the player to follow a translucent line through the obstacles. Users can follow the path and become familiar with certain 'difficult' areas of the game.  7. Simultaneous multiplayer mode (VS.)  Personal improvement area (at least it helped me)  8. When playing, stare downrange as far as possible to see what is coming and use your peripheral vision to navigate.  9. Practice when you first wake up after you've had a good rest and some healthy food.  10. Try to position yourself on the upslope of the curve to see what is coming next.  Finally, in update 3 you asked what the super hard mode past 'ultra' should be. I would vote the simple route. Call it 'Unpossible.'",
            "review_score": "1"
        },
        {
            "review_text": "Me fail english? That's unpossible!",
            "review_score": "1"
        },
        {
            "review_text": "i really like this game, i would play it more but it keeps timing me out every day after 6 deaths and the cursor disappears on me ( i am playing on a pc) still it is very fun",
            "review_score": "1"
        },
        {
            "review_text": "probably one of the trippiest and best arcade racing games I've ever played. Great for the price too. Only thing I want are more themes, as the blue night gets boring after a bit. A reskin with a sunset skybox and orange neons would be pretty neat to have in an update. Also, the game doesn't have workshop support. That takes away from it a bit, but overall very good.",
            "review_score": "1"
        }
    ]
}