{
    "app_id": 300550,
    "name": "Shadowrun: Dragonfall - Director's Cut",
    "release_date": "2014-09-18",
    "developer": [
        "Harebrained Schemes"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Cyberpunk",
        "Turn-Based"
    ],
    "achievements": 39,
    "positive_ratings": 3488,
    "negative_ratings": 398,
    "price": 10.99,
    "description": "Harebrained Schemes' biggest Shadowrun game to date, and the definitive Shadowrun RPG experience available on PC. Now a standalone title with tons of new content &amp; improvements!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/300550/header.jpg?t=1536157123",
    "minimum_requirements": "OS: Windows XP SP3/Vista/Windows 7 Processor: x86-compatible 1.4GHz or faster processor Memory: 2 GB RAM Graphics: DirectX compatible 3D graphics card with at least 256MB of addressable memory DirectX: Version 9.0 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Disclaimer: This review was written when Dragonfall was a DLC and will be updated to better reflect Director's Cut in the future. If you are already familiar with the DLC version, skip to the end for my initial thoughts on the new features.  When Shadowrun Returns came out there were numerous complaints. Rather than ignore them, HBS listened to the fans and fixed many of them when they released Dragonfall. That wasn't enough for them, wanting to better address the players suggestions they re-released it as a stand alone game and freely upgraded everyone's existing copy.  In Dragonfall you are the newest member of an established runner team in Berlin. Through the course of events you end up leading the team and hunting a dragon. I could go into more detail, but the story is so well presented you are better off experiencing it for yourself.  Rather than repeat the linearity of the Dead Man’s Switch campaign, Dragonfall uses a hub approach. There are a series of missions which advance the plot, but in order to unlock them you need to earn nuyen from other sources. You have a computer which lists all available jobs and its up to you if you accept them or not. Do you do every mission possible and postpone the final battle? Or do you rush through to complete it as quickly as possible?  I recommend taking your time since this is a campaign which focuses on setting. Each of your team members has a strong back story and distinct personality.   I spent much of the campaign trying to learn what drove Glory to use such ancient cybertech and trying to get Eiger to stop questioning my leadership. I helped Blitz with his relationship problems and helped Dietrich find his path.   You also get to know the community. The hub is not simply a collection of vendors and quest givers, each character has their own personality and needs. The depth of detail means you actually care what happens to the hub, its more than a means to an end (unless you want to role play a heartless mercenary).  On top of the strong story, Dragonfall is currently the definitive source for official modding assets. It includes all the assets from Dead Man's Switch/Seattle, the Berlin DLC, and more newly added for the Director's Cut. All the props can be used together yet have a distinctly different flavor. The prop selection is strong enough that I can recommend Dragonfall over Dead Man's Switch on their merit alone. Enjoy working with exploding barrels, drakes, new portraits and much more. My only complaints are that the Dragon prop is limited in its re-usability and existing fan made content will need to be migrated to the new workshop.   If you enjoyed Dead Man's Switch, you will be amazed by Dragonfall. If you were disappointed by DMS, Dragonfall fixes a lot of the common complaints people had. If you haven't played DMS, but like cyberpunk and turn based strategy, Dragonfall is an excellent place to start. I strongly suggest giving the game a try!  Edit - 5 hours in - DLC vs Directors Cut Based on my initial impression, I am pleased with the enhancements.The combat interface has noticeably changed, making combat much easier to understand. The weapon interface is much better than the up/down scroll list in SRR and you can easily see what each attack does. Items and 'ware are equally clear.   As for the flow of combat, I now know exactly when I am in cover and when I have an exposed enemy. Each successful attack tells how much damage was dealt and why. We are told if we have flanking, if cover blocked an attack, and probably more information that I haven't realized yet. I am not yet sure how I feel about the new armor system though.   The new content seems to be carefully worked in, I am not actually sure what is an addition and what I simply missed in my previous play-through (with the exception of the new face I've met). I look forward to seeing what else is there and will update this review when I have more to say!  Lastly there is the new NPC advancement system. I'm very happy with this and hope it is easy to incorporate in my own mods! Yes, we only get two choices per level, but it is easy to understand and use, and seems to provide distinct tactics options. It also makes it clear exactly how they level up when previously it was a bit of a mystery.",
            "review_score": "1"
        },
        {
            "review_text": "Great game all around. Would definitely reccomend.  Did you like XCOM? Buy this game. Did you like Wasteland or Wasteland 2? Buy this game. Did you like Fallout 2? buy this game.  Pros: -Deep story. Lots of twists, sidequests, and alternative emdings. Make sure to talk to your companions! (for instance, Gloria has an awesome sidequest.) At one point I rescued an enslaved cyborg troll who had an ax and a chain gun for hands.  -The combat is very well done turn-based style. The diversity of spells, guns, body modifications, classes, and companions allows for many styles of gameplay. Also, the inclusion of spirits makes for really fun battles when the enemy is deeply entrenched.  -Runs fast, even on bad computers. On my 2010 macbook I managed to pull 55-60 fps consistently without overheating.  -Good graphics. Definitely not top of the line, but it works well for the cyberpunk atmosphere and isometric view.  -Doesn't hold your hand very much. You have to figure out the puzzles and where to go. But not as open world as Wasteland 2 or Divinity Original Sin.  -Steam Workshop has amazing alternate campaigns and add-ons. Seriously, a few of them are better than DMS which was the original campaign for Shadowrun Returns.  -Console is easy to use and gives opportunities to play with the game to your liking. Big Heads, movespeed, changing sprites, free money, etc.   -World editor is very intuitive. If you want to mess around with making new content, it is pretty simple to understand and grants a lot of depth and freedom.  Cons:  -Map for Kruezbar is annoying. Trying to find all the available merchants and running around took me a few hours to get used to and I still can't find the damn cybernetic place sometimes.  -A few freezing bugs. At one point I had to restart a level because the combat system got stuck on an enemy turn. Not a common occurence but definitely frustrating when it does happen.  -Fighting in The Matrix isn't nearly as cool as I was hoping for. A bit repetitive and sometimes overwhelmingly difficult.",
            "review_score": "1"
        },
        {
            "review_text": "Dragonfall is one of the best RPGs I've played in the last five years. Why, you may ask? Well, let me ask YOU a question, what do you want out of an RPG?  Let's say you want plot. A setting. Dragonfall has you covered. This takes place in the world of Shadowrun BEFORE the tabletop. You're about forty years past the 'Awakening', an event that rocked our modern world and brought forces and creatures of magic back into it. Chief among those were the great dragons, whom loom over both the setting and this campaign from on high. Along with magic, technology has surged forward, resulting in a cyberpunk fantasy mish-mash where your shamanistic mage can have an artificial eye, your hackers summon digital minions within the virtual world, and your drone-controlling medics can choose to fight with sword rather than gun. This strange mash of the cynical and fantastic makes a setting that is neither too grimdark nor too silly. A proper Shadowrun setting sets a perfect balance of moods and themes, and Dragonfall, fortunately, is no exception. I won't spoil the actual plot proper past what I've already said, but just know that it's full of twists and turns and has a wonderful depth.  Let's say you want party members. A good party can make or break an RPG, and Dragonfall's definitely 'makes' it. You have the dark, distant Glory, wielder of two terrifying cybernetic arms and skilled field medic. There's the aging Dietrich, a middle-aged punk-rocker shaman slightly past his prime, driven by his idol to keep seeking 'the good fight' until death. You have the professional, rigid troll marks-woman Eiger, with whom you will butt heads until you can win her respect. Aside from them, you also have Monika, team leader, local hero, and skilled decker, and Blitz, a former gang member decker/rigger who may or may not be more trouble than he's worth. Oh, yeah, and you also have a dog. No team is complete without a dog.  Each party member comes with their own backstory to explore, along with personal quests. The only thing missing is a love interest, but that's refreshing, in a way. You come to care about these characters because they're members of your team, not just because you want to get into their digital knickers.   Finally, let's say that you're willing to play literally any RPG as long as it actually plays well. Well, then I've got good news for you. Dragonfall's engine has been tooled up to be better than the one that was used with Shadowrun Returns, and there's a deep selection of character skillsets to invest in. Combat is fair and, for the most part, only punishing when you make a mistake. There was only one mission in this game that I felt was unfair, and it was mercifully brief. Levels are well designed and hold a plethora of options that are available to you if you invest in certain skills. The only real complain I have on this end is that you're rewarded experience not for combat, but for resolving quests/dialogue paths. However, this also adds a refreshing twist; this is finally an RPG where you don't have to murder everything to get ahead. At the same time, if you choose to pursue optional combat encounters, there's often a little bit of loot hidden in the area to reward you.  So, in the end, we have a game that's balanced on plot, characters, and gameplay. Not only do you have those three pillars of quality, but they're complimented by fantastic art and an atmospheric soundtrack. Dragonfall is the RPG of the year for me, and it left me feeling inspired to write and create worlds that are as deep and complex as this. If I had to recommend only one RPG on Steam, it'd be this one. That's how good it is.  ... Oh, and that's only the core campaign. Took me thirty-five hours. If you'll excuse me, I think I'll be heading back to try out some of the community-made fare...",
            "review_score": "1"
        },
        {
            "review_text": "Shadowrun: Dragonfall - Director's Cut burst from 2013's Shadowrun Returns like a blood-and-titanium phoenix. Harebrained Schemes' first Shadowrun game is an excellent turn-based tactical RPG whose strengths are offset with awkward save mechanics and limited team customization. It was followed by Shadowrun Returns: Dragonfall, which replaced many of the parent game's human failings with polished chrome. The director's cut is the pinnacle of this evolutionary leg. It's hard-wired with enough features to run like a top-of-the-line pleasure rig, free of any unsightly Essence loss or dumpshock. Dragonfall - Director's Cut is a great game packed with pathos, atmosphere, heists, and intrigue.  Dragonfall takes place in magical cyberpunk Berlin, home of countless free-states, gangs, and corporate interests. Like all good Shadowrun stories, the inital run is a rabbit hole into something far more complex. In this case, a simple burglary explodes into a conspiracy wrapped in fire, scales, scientific hubris, and the worst kind of cyber-stalker. On a more personal level Dragonfall revolves around the Kreuzbasar, an autonomous neighborhood in the midst of Berlin's urban chaos. The Kreuzbasar is more than a hideout and a resting place for the central crew of shadowrunners. It's a community to build, protect, or exploit. Visiting its inhabitants and getting involved in its dramas are welcome contrasts to excursions to the outside world. The residents of the kreuz are a persistent group, who scratch the same itch as maintaining a castle in Suikoden or a Breath of Fire town. Checking in on their lives deepens the world, develops a strong sense of place, and provides ample sidequest fodder.  Since the protagonist's personality and skills are based on the player's choices, the narrative heavy lifting is mainly handled by the Kreuzbasar's core team of shadowrunners. It's beyond risky to go alone on a run, so teaming up with a crew of dangerous, flawed criminals is the way to go. Glory, a frosty medic loaded down with vintage cyberware, and Dietrich, an aging punk rock shaman, are standout voices who exemplify and complicate familiar cyberpunk themes of dehumanizing technology and rebellion. Each team member's personality shines through in the moral choices made during missions.  The core runners are supplemented with a handful of specialists who can be hired for individual runs. However, they're generally not worth it since they demand payment up front and don't have the strong advancement abilities of the core crew. After every major run, the core team of runners gains several pre-determined skills. They also gain one of two advances, each keyed toward a different facet of their build. Eiger, the troll combat specialist, has different specs as a shotgun surgeon than as a sniper, although she's a ferocious beast either way. Some advancements provide bonus gear for the core runners, which repopulates after every mission. Grenades and medkits add up over time, so securing a renewable source of consumables is a worthwhile investment.  Combat is a turn-based affair. Each character has Action Points(AP), which govern how many actions they can take. Movement, normal attacks, spells, spirit-summoning, and fancy cyberware all require AP. Complex actions like reloading a grenade launcher or casting specialized spells require multiple AP. Positioning is very important because of Dragonfall's cover system. Hiding behind the scenery provides cover, which reduces the chance to get hit. Armor, on the other hand, prevents damage. Anyone who ends a turn in the no man's land of a bare foyer had better have a backup plan. Enemies use cover wisely, encouraging the player to tactically reposition or discover other techniques for bypassing cover. Magical or technological bombardmant are possible, but it's more fun to send a remote controlled drone through the air ducts or flank with a summoned abomination.  Despite the different ways a crew of shadowrunners can be organized, the scenario design is forgiving enough to allow for experimentation. While some character builds are more universally useful than others, no team is able to do everything in a single playthrough. This abundance of options provides freedom to explore a specific path without feeling like useful resources are irretrievably lost. If a team lacks the requisite skills to do something neat, it will probably have the skills to access something else worthwhile. Harebrained Schemes should be commended for this balancing act: it's difficult to put together a terrible team, but team design still has real consequences.  Every departure from the relative safety of the Kreuzbasar is a mission. Although it would be easy to see each mission as a traditional fantasy dungeon with go-go dancers and air ducts, the mission variety is morally nuanced and shaded with surprising twists. Most of the missions involve breaking into a building and shooting some dudes, but each one is laced with enjoyable twists, both narrative and tactical. NPCs further complicate missions. The office buildings, science complexes, and city streets traversed by shadowrunners are also places of business and everyday existence. Even the stealthiest team will occasionally encounter a janitor, office romance, or quirky personality who threatens to disrupt the integrity of a mission--or provides unexpected aid if everyone plays their cards right.  The five new missions introduced in the director's cut stand out as excellent examples of what makes the game so great. Three of them are partner runs keyed to individual teammates. These sidequests draw back the curtain to explore what really makes already nuanced characters tick. Guiding your allies through their crisis points does double-duty; while they grow, their moral quandaries work as foils for defining the malleable protagonist. Because the main character can potentially take so many shapes or builds, these personal missions turn the screws and force tough decisions. Is it worth allowing evil to escape if it saves innocents? Is it worth solving a dangerous injustice if its institutional causes are unassailable? Taking sides with Berlin's factions is inevitable, and rarely consequence free.   The other two new missions are further examples of the sublime torment of decision-making. Both ask the player how far is it worth going for money-or how much money is at the tipping point. Unlike many games interested in morality and choice, Dragonfall rarely offers a good option and an evil one. Instead, it presents a bad choice and a terrible one. Everyone in Berlin has an angle, whether it's salvaging a crumbling biotech franchise or trying to escape from a web of blackmail. You can't save everyone, but your choices will change the world.  Although the writing could carry the atmosphere by itself, the graphics and sound team up to further enhance the dirty, haunting paranoia. The music is generally subdued techno, well-suited for vigilant sneaking or meeting with seedy characters. Areas have enough background elements to look lived-in and decayed, but still house sparks of life and individuality. Berlin's neighborhoods display a variety of architecture and themes; its residents are similarly diverse in their portraits and designs. Living in the world of Dragonfall wouldn't be especially pleasant, but it's believable.  Games like Dragonfall don’t come about too often. For those of us who’ve grown accustomed to B+ grade titles, we forget what it’s like to experience a top-shelf game. Dragonfall is worth any RPG fan's time unless, I don't know, they don't like cyberpunk, dragons, or exceptional tactical combat.",
            "review_score": "1"
        },
        {
            "review_text": "A compeltely better version of both the original and the dlc. More missions, more content and overall one of the best rpgs weve had in recent years. If you enjoy shadowrun you owe it  to yourself to buy this game. The writing, soundtrack and combat are all excellent. As an rpg it delviers too. Very much so worth the price",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly great game! Here's the pro and contra:  Pro: + Much better and the already very good previous Shadowrun Returns (SR) + Great story/ characters + Many sidequests + Finally you 'own' your own team + unlike SR now you can use your teamates as Decker to enter matrix + better UI than SR + great immersion/atmoshere, through the story there are a lot of choices, but...(* read more at contra) + more balanced than SR + nice turn-based, story-rich, cyber-punk RPG  Contra: - nothing is voiced, you still need to read a lot of text - still cant enter combat on your own - some 'etiquettes' are just useless - mostly your choices have little impact on the story  All in all: 9/10, a must for Shadowrun fans and fan of turn-based games.",
            "review_score": "1"
        },
        {
            "review_text": "I was not sure about this when I first tried it, so much so that I left it alone for about a year after my initial experience. Rarely have I been more thankful that I went back to a game, it is now one of my favourite RPG's!  The game has some design quirks that can initially frustrate, you will get over these and may even like the simplistic streamlining of your team members level progression by it's end. Combat is mostly solid but I did find it was at it's best when I played as a mage/shaman, though it was probably easier in the early sections as a samurai with the opposite being true in the game's latter stages.  Some will tell of the APEX quest crash which thankfully did not happen in either of my two play throughs. I did what the devs said, no quick saves in this quest, regular save as little as possible, and make a back up before you embark as an extra precaution.  The story is good with many well thought out moral dilemmas that give your character a fully fledged selection of well fitting choices for the situation that they are in. One of the places where Fallout 4(which on the whole I enjoyed a great deal!) seemed to get things a little bit wrong.  It has several endings, one of which stands out as possibly my favourite of any RPG ever. I really can't think of another that finishes your adventure in such a perfectly executed and unexpected way.  On the whole I can't recommend this enough, a game I could have easily dismissed turns out to be an absolute gem!   ...also, for any fans of the old SNES Shadowrun like me, you may wish to know that a remake of that game is being developed as a mod for this and it looks like it will be completed in the next few months.",
            "review_score": "1"
        },
        {
            "review_text": "Duration - 26 Hours  Thoughts:  Another enjoyable installment. Be prepared to read lots of text though as nothing is voice acted. One thing that Shadowrun has is enjoyable turn-based combat. The system works very well and translates to PC in good form. The detailed system works well with lots of perks and skills. There are plenty of side-quests in this game, and they aren't all easy to discover. This makes finding and completing them extra satisfactory. Overall my time in Shadowrun was very enjoyable.   7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This 'indie' rpg sits heads and shoulders above the entire industry as an example--a game doesn't need a massive budget to be enjoyable. While the entire 'indie' industry has shown games this for a while, this game in particular stands out as a paragon of this message.  The Story: The story arc that is set out for the character to play through is ingeniously and meticulously designed to capture the essense of a universe that is so wide in scope and details that packaging it into a small game makes the game more obviously golden. At no point in the game should you feel like you need to go buy a sourcebook for the tabletop RPG Shadowrun (from which this game is based) in order to understand what is going on. Further, despite not needing to, I found myself digging through articles online to digest the rich history behind various events that you 'run' through. You are effortlessly immeresed into what 'running the shadows' is like. From the perspective of someone who has played other tabletop RPGs, I can tell you that this game is one of two games I have ever played that does a system designed to be played on tabletop does justice to said game. The story isn't one dimensional. Every character or class you play draws out anther element of the game. Even simply thinking about elements of various 'runs' you perform, you discover the web of conspiracies and lies that line the seams of the Shadowrun universe. BUT! again, you don't have to do these things or spend time philosophising to enjoy the game. The main story by itself is terrific. For fear of spoilers, I will move on.  The Characters: This is an aspect of games that I feel so few games do even remotely well. Even developers like Bethesda--for all the impressive things they spit out--have never made a game where I remember a single character's name for all the time I put into them and interacting with them. I understand many peoples' tastes on this matter in particular will vary. I feel that one thing that is most likely to make a game re-playable for me is remarkable characters. I will not get into the various characters in the game for fear of spoilers, but as bad with names as I am, I could probably name off all the main characters that you run with in the game. I get this deep feeling that despite the text medium with no voice over that I *know* these characters--that I have had conversations with them. *THAT,* from where I stand, is an incredible feat. The characters have various personalities and avoid 'cardboard' stereotypes. They feel fleshed out as opposed to the long list of games I could rattle off with characters so hollow, you could cook a meal in the middle of a flash fire warning zone without the slightest fear of setting fire to the forest you were in.  Style / System: This game is a top-down / isometric rpg design. When I saw screenshots of this, I decided to wait--I wasn't familiar enough with the Shadowrun tabletop game at the time to be a backer and I found that I rarely enjoyed isometric games. That fear was unfounded. When I began playing, the first comparison in my mind was the only other top-down game I had really enjoyed: Fallout (1). I don't enjoy that style, but this game streamlined it down (further in the director's cut) to a place where the story and the characters could shine. A bad system can overshadow and ruin the best of stories. Hairbrained took a style that I didn't enjoy and made a game that I both enjoyed and could easily put on my top 10 favorite games list. Are there things that could still be streamlined? Yeah--that's a loaded question though, because if you're honest, there aren't very many games that couldn't be streamlined. In this case, there might be one or MAYBE two things that could be streamlined more, but Hairbrained found a magical balance where this simple style allowed them to draw out elements of the universe that--for example--a first person shooter could have NEVER ever done.   If you enjoy RPG games for the story or for the characters, I have very little doubt that you would enjoy this game. Of course there's always the possiblility, but I find it unlikely at best.  Stop reading this and go run the shadows, already.",
            "review_score": "1"
        },
        {
            "review_text": "I don't even know where to start.  This game is everything I've ever wanted and so much more. It's an amazing story, the dialogue man it's flawless.  I cared about all my fellow Runners. All of them. Even Blitz though he's an ♥♥♥♥♥♥♥.   +Turn Based  +Amazingly written Dialogue and story.  +Branching side quests  +Loyalty missions for fellow runners  +Twenty plus hours of gameplay.   +Tons of re-playability.   Still reading? Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Now that I have completed the game, I wanted to review it. Director's Cut goes above and beyond what the original Dragonfall did. For one, a completely revamped combat system. It made the game both easier and harder. Harder because if you're out of cover or something, you will be mince meat. The same can be said about your opponents, and some AI have a tendency to sit in the open. Another point is that there are some new missions. They shed light on your fellow runners. Storyline is amazing in my opinion. There are moral greys as well as black and white, but the game doesn't really beat you over the head with what's the right choice at the time, more what may or may not be reasonable. The characters are great, your followers and the Kreuzbasar's residence all have life to them, you get to see them change as the story goes on, both subtly and in ways that you can affect. I really have no gripes, just future ideas for future games, which is what that would turn the review into. If you're looking for a turn-based RPG that'll pull you in and entertain you, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Harebrained Schemes captured the essence that emanated from the orignal Shadowrun games (SNES/Genesis).  The story is brilliantly written with care, creativity and realism (in terms of character dialogue). As for the audio, they could not have made anything better then what they offered. The character creation is pretty straightforward.  As this was their first attempt at Shadowrun, there are a few improvements they could bring forth in the future: a rotational camera (unless I missed that), perhaps an option to make the enemy characters 'redder', as well as better character creation and ingame enemies (often times, the avatars do not like like the characters. Also, the way you create your character is limited). Lastly, I wish that options ingame truly had an impact - your dialogue choices make practically no difference, except in a few instances where the outcomes isn't all that different anyhow.  Despite its flaws, the game developers gave it their all as they offered us a game with utmost professionalism. Aside from the shortcomings, the game itself is a masterpiece, and its flaws are easily overcome by the brilliant way it was brought forth. I mean, the music, the story, the characters, the skills tree etc. are simply so well presented that you wish one thing only: that Harebrained Schemes will continue making Shadowrun games, and hopefully expand their work to encompass something even more brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "Finished the game with a dwarf decker/rigger. Graphics and art style are really well-made, with vibrant colors even for a game that takes place in the 'shadows'. The soundtrack is a pleasure to ears 100% of the time. Story and character development are trully engaging. One of the few games that actually manages to make you care for your team outside combat situations. Also one of the few games that makes you NOT mash on the &lt;next&gt; button of a dialogue, since it has no voice acting and feels like a session of pen and paper goodness. Leveling (karma) system is done right and also makes you feel that your character actually gets better not by just getting a +1 on his Level counter, but for gaining 'actual' experience from the situations he faces. Combat mechanics are pretty decent as well. - could use a better aiming system though, since I missed plenty of times with 85%+ chance to hit and at one point I missed 3 times in a row with 99% chance to hit... Maybe it was the difficulty setting though, since I played the game at max difficulty level. Anyway, this isn't even an issue that downgrades your experience or one that would stop you from playing it. I highly recommend it if you love story driven, turn-based rpgs and a big plus is that you don't have to be a hardcore Shadowrun fan to enjoy the game",
            "review_score": "1"
        },
        {
            "review_text": "The developers of this revived classic; Harebrained Schemes are all for the gamer. That's why this game exists. They listened to user feedback again and again to bring us this refined cyberpunk turn based RPG that has amzing visuals, soundtrack, art style, storyline, action and kick ♥♥♥ characters. This is a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "I've been asked by many friends what the difference is between the Shadowrun Returns DLC for Dragonfall and the Director's Cut. I'm going to write from that perspective; there's already plenty of reviews telling about the game itself and I will be using spoilers. Let the reader beware.  First off, the overall plot reminded me a lot of Baldur's Gate II. Divine being-type entity split from its divinity and that problem becomes the player's problem, the player is required to raise a ridiculous amount of money to chase their adversary, along the way the player gets to know their companions better if they care to, and the player is offered side missions for each of their companions that gives each of them a slight boost. Despite all the similarities, I very much enjoyed the Shadowrun take on the story idea; enough to play it through several times and grab every achievement - as there are many 'hidden' achievements tied to how the game ends, that's saying something.  Where the Director's Cut differs from the DLC is mostly the inclusion of the companion missions, the Black Lodge audition, and missions on behalf of some of the Kreusbazar vendors [the majority of these are in both games, but I know the mission for Ezkibel was missing from the DLC for sure]. There are some other noticeable, but minor differences like less dialog options when dealing with Doctor Ezkibel after taking care of the sewers, but they do not really impact the game at all.  Edit: playing the DLC after the Director's Cut allowed me to notice that for some reason there are some dialog triggers and conversations that somehow failed to fire in the Director's Cut. For example, meeting Audran for the first time in the Director's Cut he just starts shooting when you meet him. Playing the DLC, he actually explained why the player's intrusion could not be forgiven and finally some companion lines made more sense as they reference that later.  I found that the missions and dialog included in the Director's Cut greatly enhanced the story and gave it a lot of depth that the player wouldn't know was missing until they experienced it as the DLC is not incomplete without it - it's just more complete with it.  The display and inteface is also slightly different between Dragonfall Director's Cut and the base Shadowrun Returns. While both games made use of keyboard shortcuts for things like inventory items, spells, and personal skills only in Dragonfall are they labeled on the display - playing the base game I never even knew those shortcuts existed and they enable the player to enjoy a quicker and smoother combat experience.  I also like how the weapon display was laid out in Dragonfall over the base game with all the information made available at a glance and number hot keys to switch to specific weapons. The only thing I would consider missing from Dragonfall that was present in the base game was the 'F' key to cycle through weapons when my attention was too focused on the scene to look up what number would correspond to whatever weapon, especially for a character whose loadout changes or an unfamiliar character.  Another item that is an improvement in Dragonfall in my opinion is the ability to lend not just consumable items to your team, but also weapons. In my first playthrough, for example, I made use of rifles and shotguns so whenever I could afford to upgrade my own gear I was able to lend my previous weapons to Eiger as they were better than her in built gear for a while. It also gave me the ability to outfit her with an assault rifle while the Shadowrun Returns Dragonfall DLC does not allow that to happen.  I'll be honest, I backed Shadowrun Returns on Kickstarter so the Director's Cut didn't cost me anything additional, but having played both I would gladly pay for the extra content and story that the Director's Cut offers and consider it money well spent.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. If you like cyberpunk, and rpg's, give this one a shot. I feel this game did a very good job of capturing the table top rpg feel.",
            "review_score": "1"
        },
        {
            "review_text": "Shadowrun! It's a great little RPG/turn-based action game. As far as combat goes it shares a lot of similarities with X-Com, however the addition of magic, and a wide variety of skills and weapons means that it's quite detailed and a lot of fun to play. The roleplaying portions of the game are fun, and you can assist or kill people and monsters you meet, as you see fit. There's some hacking and espionage elements that you can use during missions, or just blow everything up. I'm a completionist, so I like all the optional mission objectives and side quests. I haven't had a chance to play any of the user-created content, but there is some content out there for when you finish the main game. Overall it's good fun and a well-polished game, so I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "In how many games will you hear about a fat dwarf moving like a cheetah as he jumps to use his big, fat body to save a Turkish barista from getting shot? Well...this is one of them.  Pretty much an upgrade of the first 'Shadowrun Return' version. The world feels more complete and open and the quests are more. You also get your own team and they do not steal your money to go on your trips in the same manner. I do miss the old bar and I think I prefered Seattle in some places more than Berlin. But the game is overall a much more poolished version of the first version. Directos Cut is a clear buy if you like turnbased RPGs.   I raise the old 6,5 in Shadowrun Returns to a 7,5 in this one. Which I state as a 'Good game'.",
            "review_score": "1"
        },
        {
            "review_text": "BUY THIS GAME! It's not as good as everyone says it is, it's better! It has everything a great RPG needs; memorable characters, engrossing gameplay, a good story, and great mechanics. Plus, it's not ANOTHER medieval fantasy RPG! The original Dragonfall DLC was great, and the director's cut adds in more greatness. Why are you still reading!? Buy the frelling game already!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this quite some time back and then quickly relegated it to the Buyer's Remorse pile. I'd thought it would be a real fun Shadow-Watch type game (although, yes, that game had plenty of issues) - but it was just too confusing to me to start and the game world seemed too boring. I got into my first combat on hard as recommended for veteran turn-based players, but promptly got wiped to pieces.  six months later, it's christmas break. I finished witcher 3, and then dying light... so i decided i'd give dragonfall a spin again. this time, i wised up and chose normal mode... and I also completely abandoned any kind of min-maxing. I just decided to make a character that would swing a katana pretty decently, and then put plenty of points in things like intelligence and charisma so that I could say/do more things in dialogues than just yes/no/kill. well... it's 3am right now. i've been playing this for eight hours straight. yep, it's indeed very much fun, much more than shadow watch, and well written. theres little niggles like the mouse cursor is hard to place at times when too close to a character, but you just have to move it slowly and ... there it goes.  some people complain that some battles are too long, but i disagree. i love the waves and waves of enemies. its always dissapointing when you make a good team and all you get are clowns that peter out in 5 minutes. i'd go as far as to say that if you like xcom but wish you could have more control over your guys... well, this is the game for you. fallout fans will like this, too (the original games).",
            "review_score": "1"
        },
        {
            "review_text": "Much improved rules completely change the game. Shadowrun Returns was total noob mode. Just pile on the ranged combat skills and kill enemies whether they're behind cover or not. This game makes combat more punishing but not so much that you'll be reloading every fight. I don't think I've ever even died once yet.  Game is easy, but the dialogue is well written. This version of Shadowrun easily has the most fights with the most enemies compared to Returns or Hong Kong, but the increased difficulty is minimal.  Missions are the longest here, but the game is less linear. They're only less linear when you count the fact that you can take missions in any order you please, though. Given that you get karma during and after missions, missions you take after the other ones become easier until you hit a milestone in the story and take on missions like Bloodlines and MKVI.  Overall I'd say this game is deserving of its metascore, with a replay value of about 140 hours for me. I was trying out multiple builds, though, and running through the same story just to fight with different styles doesn't really improve replay value as much as you'd think. It would be better if there were much more different playstyles than simply 'you can skip combat if you have lots of charisma' and 'combat is easier if you don't invest in charisma unless you're a shaman.'",
            "review_score": "1"
        },
        {
            "review_text": "A Big Improvement over the Original „Shadowrun DragonFall” !",
            "review_score": "1"
        },
        {
            "review_text": "Good fun. The extra missions are awesome and the HD graphics are pretty. They've really improved the layout and made the combat system a lot easier to understand.  And of course, the story and dialogue are excellent. If you're looking for a good rpg to throw 20-30 hours into (in nice, easy to digest 1-2 hour missions) then this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible campaign, excellent writing, memorable characters, difficult choices and one of the best RPG's of 2014, in the likes of Wasteland 2 and Divinity: Original Sin. Bioware and CRPG fans alike and should check this one out!",
            "review_score": "1"
        },
        {
            "review_text": "I Kickstarted Shadowrun Returns and waited impatiently while it was developed. When it launched I was satisfied, but not delighted. It was a good game and I was not unhappy I had funded it, but the story failed to grip me. Reviews were in the 70s and I felt that was about right. Then, Dragonfall happened and I wasn't delighted, but ecstatic. This is an AMAZING game. All that was good with the original was kept and improved, but this time around the story was first rate. I kept playing and playing longer than intended just to see what happened next. Here I disagree with reviews as they were 80s, and I'd say this game is a 90 minimum. I was one of many who encouraged HBS to release it as standalone, because I felt that if someone were to buy in to Shadowrun, this would be the campaign to do it on. Well they listened, and here it is. If you like RPGs, you owe it to yourself to own this one. The story is top notch, the art style is gorgeous, the music is superb, and the mechanics are solid. I cannot recommend it enough.",
            "review_score": "1"
        },
        {
            "review_text": "The story and game mechanics are delightful, overall skill usage was diversified compared to original Dead Man's Switch campaign and a bunch of other improvements were made (more optional missions, manual save points, selling items option, etc.)  So I would heartily recommend this game to anyone having an interest in cyberpunk and/or turn-based tactical squad combat. (Despite the fact that after two major releases and countless patches, this game still have UI glitches)",
            "review_score": "1"
        },
        {
            "review_text": "Great story, great characters, and much better gameplay (than it was with Shadowrun Returns). 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I am a long time player of tabletop RPGs and tactical RPGs and I must say that I loved this game. I just finished the game for the first time in Hard difficulty and I plan on playing it again in the highest difficulty next. The game is the second in a serie of (currently 3) but I feel like the stories are disconnected so you probably can play them in any order.  The story is great and well set in the shadowrun universe. Characters are well written with a deeper and often darker aspect to discover. The storyline is not too complex to follow but complex enough to enjoy.  The battles in the game know how to be stressful. Many of the 'fights' are very well scripted with multiple actions to take in sequence that increase pressure on you. For instance there is a battle where you need to press two switching in two rooms in the real world while your decker has to open the way for you from the matrix. The game knows how to keep you on edge.  Graphics are nothing too fancy but perfectly integrated in the style of the game. Though I played on a not so good for gaming laptop and had to set graphics setting low.  The main issues I had with this game are linked to the UI. It can be very frustrating at times. Here are a few things I found annoying in the interface. I'll detail that because I hope the developpers will read this and do what they can in future versions. I give a fairly long list but that is mostly to the developpers benefit. The game is good !  -The combat rules are somewhat kept unknown. It is not clear to me what each statistic is doing or what some of the acronym stand for. A particular instance: Some weapon have a Ar-P statistic which I guess stands for Armor Piercing. When using it some of the armor points of the enemy unit blinks but seem to come back in the same round. I guess Armor Piercing is different from Armor Striping but making it clear would be nice. In the current form Armor seems to be a typical DR (damage reduction) and it is not clear to me that there is a real difference in practice between +3 Ar-P and +3 DMG.  -the UI can be very hard to read for me. Maybe it is becuase I am color blind but the overlays in same tone can be quite hard to read. In particular, the techniques icon in the matrix often features white writing on white background and the cooldown of a not yet used technique can be hard to read.  -the HP of an enemy can be very hard to read because its health bar is essentially hovering over the units head but whatever is behind that unit can make it hard to read. Even pointing to the unit does not really help: more information appear in box that is transparent and depending on what is behind the text might be very hard to read. It could be fixed by giving a setting for the opacity of these infobox.  -It is sometimes hard to understand what an action will do some actions might require you to move first but the 'trajectory line' is small so you might not realize your character will have to move to accomplish this action. In comparison in FireEmblem, a (too) heavy line will show you the path your character will take.  -Some attacks can damage neighbooring unit (shotguns, miniguns, glory's closecombat), it would be good if the units potentially in the line of fire could be indicated. especially the shotgun widespread shot can be fairly hard to predict.  -It can be very hard to point to some tiles in the game. Trying to move 4 characters on a 2x2 area is very difficult because you keep on pointing to one of the character.  -When healing outside of combat, I find it annoying that I can not see who has inventory and who needs healing. A simple tweak would be to display a 'currentHP'/'maxHP' information next to the character's name in the 'who to heal' dialog.   -In terms of gameplay, some things were annoying as well. You can not give an ally an item once the mission has started. I ended up in ridiculous situations where the leaders inventory was full but Glory's inventory was empty and when finding an item I had to send it to the stash.  -It would be good if some action (reload in particular) could span between two rounds. Often with the apex' drone shooting costs 2AP and reloading costs 2AP but the drone only has 3 AP. I'd like to be able to fire, start reloading and pay -1AP next round to complete reloading.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. An absolute gem in turn based RPG genre. And to think I got it for nearly nothing in a Humble Bundle.   Good story. Interesting characters. Deep combat. Originality.   What flaws could be mentioned? Well, art style can look a bit unattractive at first glance. Some game design decisions can be a bit confusing at first, for instance the things to do in Matrix or the fact you don't get gear for all the team like in other games, but can loan team members a weapon or consumables for the mission.   All things considered, this is one of the best RPGs I've ever played and I don't say that lightly.",
            "review_score": "1"
        },
        {
            "review_text": "Dragonfall DC improves upon Shadowrun Returns in every way.The battles are more challenging and tactical. The enemy AI is better and strategy matters. Melee oriented characters are now a lot more viable because of the changes to cover system. The new missions are really interesting and Blitz's personal mission is hilarious. There are choices to make which actually seem to have significant consequences and multiple endings. I consider this one of my favorite video games of all time. If you liked Shadowrun Returns, you'll love this. Even if you were disappointed with the linearity and brevity of 'Dead Man's Switch' I would recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Upgraded combat system is better and easy to read. The changes/additions help fill out an already awesome story. A must for strategy fans who enjoy good writing and solid combat.",
            "review_score": "1"
        },
        {
            "review_text": "RPG, heavy on text, XCOM-like combat. This is the best game in the series. They are all very, very similar gameplay wise, but Dragonfall's phenomenal writing is what sets it above Returns and Hong Kong.",
            "review_score": "1"
        },
        {
            "review_text": "Better main story arc, better combat with the addition of the armor system, sniper rifles add new tactical options to combat, more side missions with the Director's Cut, interesting side missions and story arcs for the companion characters, and levels with multiple approaches. One thing I really liked about this game was customizing a character to be both a smooth talker and firearms expert.",
            "review_score": "1"
        },
        {
            "review_text": "Leaps and bounds ahead of Dead Man's Switch in every way: combat, storytelling, companions, and even role playing elements have all been improved and refined to create a true Shadowrun experience. Offers a healthy amount of choice based on how you create and play your character as well, definitely a solid experience for any isometric rpg fans.",
            "review_score": "1"
        },
        {
            "review_text": "  Rise of the Feuerschwinge. Perfect",
            "review_score": "1"
        },
        {
            "review_text": "Really nice turn based XCOM style game. Avoid if you like skipping text because there's tons of it and that's what makes it especially nice!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games of the year. Terrific writing, wonderful characters, a mature and thoughtful narrative. They make cyberpunk magickal. I'm still revisiting the Director's Cut, but it makes a quality game, even better.",
            "review_score": "1"
        },
        {
            "review_text": "Much, much better than both the story and engine of the original Shadowrun campaign. This is a solid tactical RPG with an incredibly well-written story, nested in a well-crafted future Berlin. The combat lacks the polish of games like XCOM, but when taken as a whole with the excellent story and stylized art, it packs a hell of a punch.",
            "review_score": "1"
        },
        {
            "review_text": "A great improvement from the original Shadowrun Returns, the updated armor systems and companion advancements are really enjoyable, and the additional items/quests add a lot more to the game as well.",
            "review_score": "1"
        },
        {
            "review_text": "Dragonfall had the best writing of any roleplaying game I have played in many years. The plot is very interesting and captures the morally ambigous/ conspiratorial / dystopian feel of the Shadowrun setting well. The recruitable NPCs are well characterized and have their own unique voices. I especially appreciated that the female characters were as competent and complex as the men. Finally, the text descriptions throughout the game convey a unique and powerful mood.  I also enjoyed the music, the turn-based gameplay, and the many possible solutions presented. But for me, the biggest stand out was the writing. Here's to you, Dragonfall writers! I eagerly await your next game.  If you love roleplaying games or turn-based squad combat, you owe it to yourself buy Dragonfall!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game!!! I hope that HBS continues to add more campaigns in the future.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a strong, complicated story, tactical gameplay, and the grandpappy of all cyberpunk game settings, Shadowrun: Dragonfall the Director's Cut is a game you want to pick up.  For returning players who may have picked up Deadman's Switch (the original Shadowrun: Returns storyline), Dragonfall has a very different feel. Taking place in Germany, it deftly blends a sci-fi feel with heist, noir, and political themes to create a more fleshed out campaign setting. Characters you meet feel more real, and even the plethora of side missions add to the overall story and world.  Gameplay changes from the original Shadowrun: Returns make Dragonfall a much more enjoyable experience to play. More character customization for your team and a streamlined interface and controls, along with upgraded save features, make the gameplay smoother.  If you enjoy layered stories, RPGs, or tactical combat, this game is a great addition to your collection.",
            "review_score": "1"
        },
        {
            "review_text": "Dragonfall Director's Cut is an interesting game. It's based in Shadowrun, a fantasy-cyberpunk setting that's pretty neat. All of the usual players are here: dragons (a main component of this campaign), trolls, orcs, elves from the fantasy side; from the cyberpunk side you get stuff like artificial augmented limbs, The Matrix cyberspace, guns, swords, designer drugs that affect combat, and a lot more.  GAMEPLAY: It plays as a turn-based tactical game, bearing some resemblance to the newest XCOM. Actions are based on AP and there are various ways to alter that number, both for your characters and the enemies. Several attacks have -AP and often stun enemies for a turn, giving a bit of breathing room. There are also multiple ways to increase AP and give yourself more actions per turn and this adds variety and even more strategy on top. The cover system adds complexity as well, as there's a risk-reward choice inherent in there: do you stay safely behind cover and suffer reduced hit chance and the possibility that your shot will only hit for half damage? Or do you rush around to flank, possibly leaving yourself exposed but at a better advantage with an opportunity to maybe kill that enemy this turn? I enjoyed the style of gameplay a lot from this perspective.  The flip side of the hit % chance model is that it's all based on dicerolls, and the way the stats work out can lead to some funky scenarios. For example, my shotgun specialist character is standing at point-blank range with another enemy and I only have a 65% chance to hit? I played on Hard, because I found the vanilla Shadowrun Returns a little too easy, so that might have something to do with it, but it's still frustrating and a little weird that scenarios like that happen.  The gameplay gets an upgrade from vainilla Returns as well. Several new kinds of weapons are introduced, including Eiger's sniper rifle -- a weapon that increases accuracy the further you get from a target, instead of closer, and Glory's hand razors that can cause bleeding per round and AP damage. Weapon, spell and program selection is also a little easier this time around, as the HUD has been redesigned to show more information more easily.  The most striking difference between them, I think, is the fact that this time you get a more static party, and you can do more with them. This was definitely a complaint I had about regular Returns, in that for every mission you were hiring mercs to go with you, and you had no way to influence their loadout or progression. In fact, you couldn't even use team members to pass skill checks, which seemed arbitrarily limiting and frustrating. Not so in Dragonfall! Here, if you hit a Decking skill check, for example, you just call over your Decker and he passes it -- assuming his skill is high enough.  There are still some character-specific checks you need to pass, like some charisma or etiquette checks, but they're a little more reasonable in terms of general skills you can invest in to be able to still build the character you want to play.  The only major complaint I have is being unable to manage your companions' inventory outside of combat, or have them pick things up when they have free space. Just because my main character doesn't have more inventory space doesn't mean that I should have to leave health kits or grenades... but that's exactly what happened when I found some outside of combat. Inside combat, you can just control them directly and have them pick things up, but outside there's no way to take control of anyone but your PC. This could even be addressed by being able to start combat at any time to gain control of your characters, and then when you're done just hit End. Again, it seems unnecessary and a little arbitrary to limit items like this.  There's also some companion customization in terms of items and abilities, which is new this time around; every time they level up there's a new icon in the bottom right that lets you pick one of two options that increases one of their specialties. With Glory, for example, you can pick between better healing or a new pistol. It's nice to tailor them a little more to your playstyle without having to dive all the way into the level up screen and try to allocate points for five or six different characters.  STORY: I'll be honest, after the regular Shadowrun campaign I wasn't expecting that much from the story this time around. I had read that it was improved but the vanilla game left a lot to be desired, so really any improvement would be a welcome addition. I was pleasantly surprised, though. In terms of pacing, structure, and impact the writing in this game is miles above Shadowrun Returns. Even the nitty-gritty mechanics of the writing have been improved, as a lot of the awkwardness of the prose in the first game has been done away with. The characters are dynamic and a lot more fleshed-out, the moral choices and consequences seem a lot more difficult, and you find yourself not knowing who to trust or who is even telling you the truth.  Your companions receive a similar boost and they're all unique. They all have unique dialogue that relates to whatever mission you're on, and if they don't agree with something you're doing they'll let you know. You can also talk to them at your home base to get a sense of their backstory, though you'll have to complete missions before they really open up about their pasts. The conclusion to this is a companion quest, where you can't bring anyone else, and the two of these I played were superb, both in terms of mission structure and the quality of the writing. Some loose ends were left dangling, though I'm not sure if I just missed another quest opportunity for one because I was at the end of the game.  OVERVIEW:  All in all, I really enjoyed my time with Dragonfall, even if Hard was maybe a little too frustrating for me. The game definitely has some legs, as there's incentive to go back with a different character build and make different decisions. There are multiple major branching points where the paths seem to diverge quite a lot, and I'd like to see what some of the others are like. Different character builds offer more opportunities for passing skill checks as well, and bringing different companions will offer a new point of view on some of the events.  I played Shadowrun Returns first, and I don't think I regret it, but it's not quite as polished an experience as Dragonfall, and some of the characters do cross over, plus there are some minor references to the original campaign, Dead Man's Switch, in here. Mostly I'd recommend playing that one first just to see how far the team has come since then. Dragonfall is definitely worth your time, though, and if you don't want to slog through the first one (or pay the money for it) this is a perfectly recommendable title in itself.  If you like CRPGs based on pen-and-paper games, reading, and a really good story, you can't go wrong with Dragonfall.",
            "review_score": "1"
        },
        {
            "review_text": "Initially referring to this as an expansion was a mistake because it towers over anything related to Dead Man's Switch; it's as much as an 'expansion' as Hordes of Underdark was to the vanilla, perfunctory-at-best NWN campaign. It's not only 10x the game that Shadowrun Returns was originally, but arguably better than the SNES classic. I've been consistently surprised at the quality in the writing and characterization.",
            "review_score": "1"
        },
        {
            "review_text": "This review is written after 29 hours of playtime ('Dragonfall' campaign, start to end).   Short review:  The campaign 'Dragonfall' features (imho) one of the best storywriting in the industry. While playing, you will be able to roleplay your character starting by simply talking to others in different kind of ways up to deciding major plot points. Beware, you will need to read a lot of text, if you do not like that, you will prop. have a hard time. The tactic part is really solid and with the new additions of the 'Director's Cut' pretty indepth. That said, it does not quite reach the depth of other games (XCOM), which is understandable regarding the budget. The graphic is very atmospheric, but the animations tend to be a bit stiff. Thanks to the editor, you will be able to play new stories made by other players. If you like to read and influence a good story (and/or If you like pen and paper rpgs) or if you enjoy classic RPGs like Baldurs Gate, do try the game. I would recommend reading abit about shadowrun beforehand, but you don't have to. If you want to play this game: Save often, try to imagine how your character would act and read the texts carefully.  ",
            "review_score": "1"
        },
        {
            "review_text": "If you like Isometric RPGs, excellent writing, story changing choices, all with a shadowrun/cyberpunk flare you need to buy this...now.  Fantasic RPG, fantastic art and writing, all from a game company not even 1/4 the size of the big names, but doing it better.",
            "review_score": "1"
        },
        {
            "review_text": "What an incredible story. I finally just finished this game and I can't recommend it enough to someone that enjoys a good tale. It helps if you have previous knowledge of Shadowrun lore, but even still, I'm sure it would not disappoint if you're willing to put forth the effort and hear what everyone has to say.  I feel like I know every character in the game personally. Each one of them is very fleshed out and shines in their own particular way. They are all so very unique and getting to know them throughout the game is a pleasure. It feels like what you choose to say and how you say it truly makes a difference on your relationship with them. I've never experienced that in another game before.   Everything else is just icing on the cake. The character development, both yourself and NPCs, the deep turn-based combat, the unique art style, the variety of the missions, the heavy choices with even heavier consequences, and the soundtrack. All fantastic, but the writing is the true gem here. I feel like I've just read a novel after finishing the game, and I believe it will stick with me for a very long time.  I highly recommend Shadowrun: Dragonfall, and I will positively be purchasing Shadowrun: Hong Kong. I cannot wait to dive back into the Shadowrun universe. A truly magnificent place to turn loose the wandering mind.",
            "review_score": "1"
        },
        {
            "review_text": "Only played the first 2 missions and I already love it. The setting, the gameplay and specially how well is written! If you played the first Shadowrun, you gotta love this one.",
            "review_score": "1"
        },
        {
            "review_text": "If you are aching for a good and atmospheric turn-based RPG, Shadowrun: Dragonfall is the game you were looking for. It take on of the most intriguing sets - the fantasy-cyberpunk world of Shadowrun, and breathe life into it with such a caring? that is hardly ever seen in game development world of today. You will love Dragonfall's diverse set of characters, vivid locations and engaging plot.  Of course Dragonfall is not without its flaws. But whatever I've found not to my liking soon faded in comparison to all the great parts of the game which I just can't stop playing.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun playing this game. I've been a big fan of the cyberpunk genre since way back, and this game captures the essence and taste of it perfectly, and all in a package thats user friendly with a polished engine. The only thing missing from this game is a cameo from William Gibson.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely what the first campaign should have been! The characters are interesting and you get to actually make choices on their leveling like its a party and not just a gang of mercenaries. The story and writing are great and the combat is much improved from the original game. If you love turnbased RPGs, Shadowrun or both you should definitely pick this up.",
            "review_score": "1"
        },
        {
            "review_text": "Shadowrun: Dragonfall is the expansion to SR: Returns turnend standalone with a bunch of improvements. SR:R is a turn based tactical game set in the Shadowrun Universe (dystopian cyberpunk with elves, orks and magic mixed in). The combat sytem is functional but nothing to be too excited about. The story, character interaction and wonderfully written Dialogue is where the game in my opinion really shines. On top of that the game includes a complete toolkit for building your own Stories, so you can expand on the game as much as you want to. The Director's Cut improves some elements of the UI and either tweaked the armor+cover system or at least gave the player more information on how they work and if (and how much) enemies have either of them. It also changes/expands a few Missions and adds new ones into the main campaign. All in all great work and if you already have Dragonfall you automatically get the Director's Cut...now thats a sign of a great company. Rock on Harebrained =)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPGs I've ever played. It's a bit short (only about 25 hours or so), and I wish there was voice acting. The storytelling is tight, the characters are well thought out and written, and the flow of the action is fantastic. I never once got bored.   If you like the Shadowrun setting or are a fan of cyberpunk, you will likely love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Shadowrun: Dragonfall is easily one of the better turnbased RPG's I've played recently. The setting is probably the best part, I've never played any tabletop Shadowrun, but it seems very cool. Keeps a lot of the flair of the older Fallout games, with great story telling, and a nice helping of humor thrown in.  Combat is good, though some times a little frustrating when you whiff 3 attacks in a row. The only slow bits are the hacking fights, I just can't get into to the whole matrix thing.  Overall, a very excellent game. Easily a 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Unlike deadman's switch, I found myself going out of my way to access all of the game's content.  I'm writing this review because a positive one convienced me to invest where otherwise I would not.  Kudos HBS!",
            "review_score": "1"
        },
        {
            "review_text": "If the game says you have a 99% chance to hit, you have about a 10% chance to miss If it says 75% it really means you'll miss 3 out of 4 times If it says 54% youll miss 90% of the time  Just like the pen and paper version  My all strength and body goon settled more things through conversation than my intelligent face gun nut did  Just like the pnp version  An enemy threw a grenade at me poorly and killed 3 of her buddies  Just like the ...",
            "review_score": "1"
        },
        {
            "review_text": "Im a big fan of turnbased combat games like XCOM, Divinity:Original SIn and Wasteland 2, so steam recommended me this game. I watched a few videos on YT, and read the reviews, and decided to go for it. If you like games with lots of text and little action. Maybe it's for you, I just couldn't even get past the first mission. Combad is way inferior to any of the previously mentioned games. There's no Overwatch function that I could find, and hitting someone even at point blank range is next to impossible. In the end I just gave up. Maybe I will try it again some other day. Not recommended.  EDIT: After giving it another shot, im finally starting to get the hang of this game. It's not as bad as i first thought, but still, combat is still inferior to other similar games. What is good about shadowrun is the world. I really like the idea of mixed scifi and fantasy in one game. I still think that execution could have been done better, but once you get past the first mission it's an ok game with a great lore and story, even if there is a bit too much reading involved for my taste. Recommended but not for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "Original Dragonfall was an excellent game (loads better than Dead Man's Switch), but Director's Cut manages to improve it in lots of small, but very noticeable ways. More control over your teammates (yay! my personal favorite); more lore (I'm a lore freak, so this is a close second); new missions; and an interface tuned to be easily controlled from the keyboard. Overall - highly recommended to both existing and new players.",
            "review_score": "1"
        },
        {
            "review_text": "Shadowrun is such an interesting and captivating world and the Dragonfall - Director's Cut improves on almost every aspect of the original game. The combat is interesting, tactical and definitely at times quite challenging. The gritty German 'Flux State' which the game takes place in is impressive, the world feels alive, in it's own desolate, grimy way and although I don't envy those that live there, I certainly find myself going back there again and again.  This game definitely fits into my top five games on PC, and the Directors Cut will probably be in my top five favorite games of the year!",
            "review_score": "1"
        },
        {
            "review_text": "Got to be the elvish JC Denton AGAIN! 10 'What a shame's out of 10!",
            "review_score": "1"
        },
        {
            "review_text": "Great Atmosphere and Storyline! This was my first time experencing anything Shadowrun and this game made me a fan.  If you like Neuromancer this is a must have.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and immersive but this game has some game breaking bugs. A few times I ran into bugs that would not let me complete a mission and I had to restart or do something different completely to procede. It also murdered my eyes. I highly recommend lowering the resolution by a lot or your eyes will be burning.",
            "review_score": "1"
        },
        {
            "review_text": "The game mostly improves on its already good predecessor.  + Great story and characters. + Side characters are more developped. + Game is slightly less linear. + Non-combat attributes matter more.  - The music is still dull and repetitive. - One level in particular is quite repetitive (Apex rising). - The game lacks basic information about ingame items (ex: shared cooldowns on injectors)",
            "review_score": "1"
        },
        {
            "review_text": "The DLC version of this game is simply fantastic. The Director's Cut is the culmination of HBS' response to the feedback from the community and fans. It was nearly perfect before the standalone release. Now we can look forward to more content and polished and improved versions of the existing? Mind. Blown.  High-Quality Dialogue, Story, Combat, Equipment, Progression, Discovery, and even some painful moral quandaries were found within. It is an absolute steal for the price, and while I do not normally replay game very much after I complete them, this one will have me replaying each archetypical character build to experience the feel of the improved content from various perspectives, both regarding combat and PC personality.",
            "review_score": "1"
        },
        {
            "review_text": "This has turn based combat and definitely has the right Shadowrun look and feel. Oh and Dragons. &lt;--- not a spoiler, it's in the frickin' title.  If you like turn based role playing games, and/or are a Shadowrun fan - you may enjoy this game so... read on then go buy it.  Caveat: I'm not quite finished the storyline yet. It's been a pretty fun game so far. I'll finish it up someday. Honest. I'm at the end of Shadow of Mordor and haven't finished that yet either. It'll happen someday.  So, Dragonfall. I find it feels a lot like the pen and paper Shadowrun game I used to play. I plan on going through at least part of the storyline again. When I do I'll be re-making one of my tabletop characters just to see if I can get the character to turn out the way the pen and paper version did. Not sure if it'll work, but just thinking about it brings back memories of the players, and characters, from that particular game. This game gets a +1 just for makin' me all nostalgic.  When I started Dragonfall I kind of had the plan to make a non-cyberware based street samurai, but I wound up making a mage who also uses pistols and was quite pleased at how it turned out. The team you run with is fun, overall, and you get to choose who you bring with you. That can significantly change how you approach some parts of certain levels. With one character you can send a drone through air ducts to flank an enemy but wIth another you can hang back, bait the enemy in and snipe them.  I really like how they incorporated the matrix runs for deckers. In the table-top game it was tedious for four or five players to sit there watching someone do a run becuase a decker could do so many actions in a combat round while jacked in. In this game the decker gets a couple turns of cyber-combat then the game goes back to the action in the physical world. I personally thing it was handled really well, and it's fun. I'd usually try to do the cyber-combat without using any support programs, but sometimes using them just made a decking run way, way easier.  Stats are represented well, and each skill seems to be useful, even etiquettes can sometimes significantly change the way parts of the game turn out. That and not having the proper etiquette makes you sometimes frown because instead of that additional intelligence of body point you COULD have bought Corporate Etiquette and talked your way around a fight, or tricked someone into letting you bypass a security door. It's wonderful to have the option.  Combat and cover mechanics are handled fairly well, too. The stun grenades got annoying at times, but it adds another element to the combat and makes you really watch your positions. If you spread out just enough you can avoid multiple characters being hit by grenades. The weapon variety is okay, and you can 'lend' weapons to your team-mates on a per-run basis if they have a spare slot. This was a nice addition and opens up more combat options. I never felt like I had to give anyone a weapon, though, as each character is competent. You also get to make choices for the NPCs in your team when they level up, the game doesn't arbitrarily assign their skill choices.  As always, get it on sale if you're not sure but this one is worth the full price, if for nothing else to simply support the Devs. who I think have done a great job bringing Shadowrun up to speed.",
            "review_score": "1"
        },
        {
            "review_text": "Great Atmosphere and Storyline! This was my first time experencing anything Shadowrun and this game made me a fan.  If you like Neuromancer this is a must have.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed. Felt like I was playing one of their old books. Looking forward to playing the new Hong Kong Shadorun game.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of tabletop RPGs, you will enjoy this game. If you are a fan of Fire Emblem, particularly the 2D installments, you will enjoy this game. If you were a fan of XCOM: Enemy Unknown, but wish the plot wasn't merely functional B-movie schlock, you will enjoy this game. Simple-yet-tactical turn-based combat? Check. Well-written story? Check. Fully featured level editor to make your own campaign? Check. If these things do not sound like your kind of game, you should not play this game. It's okay. There are lots of games.",
            "review_score": "1"
        },
        {
            "review_text": "A big improvement upon Returns. As it was explained to me, Returns was a proof of concept, and this is the actual game and that shows.  I still haven't finished the game (But I'm almost there), but thus far I have been thoroughly impressed by the game. Shadowrun is an original setting to begin with, but placing the game in Berling made the game so much more unique (And enjoyable, as someone who used to live close to that city and understood the german names being thrown at me). There is a surprising amount of queer representation right off the bat, and the game treats it like no big deal, so huuuuge props right there.  The gameplay is solid - It can be a little difficult, but luckily there's an option to turn it down (Which I did, because often the RNG will make it feel too punishing). Gun play is fun, as is the Hacking aspect (Though it does get rather repetitive after a while), though my squad's aim seems to sometimes go incredibly low for no adequately explained reason (If it's because of the room being dark or whatever, I wish the game would inform me somehow). It plays like X-Com, but the AI is horrendously bad and will often just straight up run towards you from cover, where you can barrage it with concentrated fire. One complain I have about the combat is that the cover system seems a little arbitrary - If someone is behind cover, and I'm firing at them, I get the same chance to hit as when I'm flanking them from behind and they're still behind cover. You can literally run up to someone and point-blank a shotgun to their back and they'll still get reduced damage. Not cool.  Another complaint I have is that you will never. have. enough. money. ever. The game throws a lot of shiny cool toys at you, but you can only get like... a few medkits, and maybe one new weapon per mission if you're lucky and can stretch out what you have.  The music is mostly forgettable. It's functional, but I can't recall a single track from the game. The tone is often pretty jarring compared to what's happening on screen. The worst offender was a side quest where you are liberating a cult compound and there's... a lot of implied horror as you're fighting, but the music is this cheerful piano music. What the hell?  The main cast is quite likeable and fills out most combat roles so you're free to pick whatever character you please (That being said, a Mage or Combat Decker seems to be the best option imho). Late in the game, you get to complete their story missions, which were nicely done.  There are some bugs here and there, which unfortunately prevent you from finishing objectives or make you stuck. Some achievements are also broken apparently.  Overall, the game has flaws, sure, but hot damn am I glad bought it. I spent many nights staying up late to do just one more mission or go and buy a new gun etc.  EDIT. Well got the the finall mission. ♥♥♥♥ the final mission. The difficulty level is obnoxious",
            "review_score": "1"
        },
        {
            "review_text": "This is a well written RPG with fun tactical combat, a world filled with characters that you care about, and most importantly it has a very good dog.",
            "review_score": "1"
        },
        {
            "review_text": "As of 2016, Shadowrun: Dragonfall is my  favorite  game I own on Steam.  If you like RPGs, I'm fairly sure you will like Shadowrun: Dragonfall.",
            "review_score": "1"
        },
        {
            "review_text": "Clearly one of the best RPGs of the last years, especially story-wise. And I haven't even played the improved Director's Cut.",
            "review_score": "1"
        },
        {
            "review_text": "Straightforward, fun game with good writing and an intuitive combat system. Feels exactly like playing a tabletop Shadowrun module. Don't expect many bells and whistles -- this game doesn't aim to dazzle the player with Hollywood-style cinematics and hours of voice-overs. Not entirely unlike the old 'gold box' D&amp;D games, but far simpler, way pared down.  This game is often on sale at Steam for 5 USD and less. It's easily, easily worth that, and it has a decent degree of replayability. I fell right into it the first time I started it up and have been happily playing it for about a month.  Thumbs up. ",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Game. Captures all the best parts of the Shadowrun universe, with gameplay reminiscent of Fallout 2 and X-com. The backgrounds and character profile pictures are really well done, with everything looking quite painterly. The story is a step up from Shadowrun Returns, with frequent opportunities to make difficult ethical choices. Nothing is black and white in The Sixth World.  Would highly recommend to fans of cyberpunk, lovers of old-school isometric style RPGs, and tactical combat fans.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best game experiences of mine.    PROS ",
            "review_score": "1"
        },
        {
            "review_text": "Just finished this game!  The storyline is quite spectacular and interesting.  The combat mechanics are quite plain, but manage to keep the tension up at the right moments!  Good to play for the story, so I recommend a smoother ride on a medium difficulty :)",
            "review_score": "1"
        },
        {
            "review_text": "If you like a narrative driven game with turn based tactical combat, this one is for you. Be warned that there is a lot of text without any voice-acting, but the story is more than compelling enough to make you read through it all.",
            "review_score": "1"
        },
        {
            "review_text": "Miles head of Shadowrun Returns in both gameplay and writing. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "I started on hard and with a mage so i had a rough start and didn't like the game a lot. After some weeks of not playing it I gave it a second shot. From that point on i loved it and completed it on one weekend. The story and the atmosphere are great. Was my first Shadowrun game. After i complete it I bought another one. So for everyone who likes game round based RPGs i would recommend giving it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Killer game. A bit linear, but each run offers you some choices about how to go about it. The shoot outs are fun and some of the choices presented can make you feel like a champion of justice or a money grubbing ♥♥♥♥♥♥♥. I like that.    If you're a fan of sci-fi full of trolls and street docs, then get this game.",
            "review_score": "1"
        },
        {
            "review_text": "Shadowrun: Dragonfall is the expansion to Shadowrun: Returns. And for the most part they share the same core mechanics, with Dragonfall having a few improvements to UI, party management, and overall level design. So if you didn't like Returns, than you are not going to like Dragonfall either. On the other hand, if you only kind of enjoy Returns, or thought it was below average than you'll enjoy Dragonfall due to its improvements.   Dragonfall has a lot of the same things going for it that Returns had too. The story is a compelling tale of revenge with numerous subplots and character development. All of which is told through a lot of reading. The characters in your group and in the game's world have their own goals, personalities, and abilities. All of which makes them feel more realistic and relatable. Lastly specialization matters in the game since there are numerous options in the game's environment and dialogue that can only be access by a character proficient in a certain skill or talent. And while some might look negatively on this as limiting gameplay, I found it to be a positive since it made character development feel like it matter beyond just picking combat skills.  Dragonfall has a few things going against it, most of which were also in Returns. The game's camera has an isometric view that cannot be rotated, which limits what the user can see and how levels are design. And while this fits into their desire art style, that art style is kind of bad. There isn't a lot of detail being displayed, and most objects/npcs are unremarkable. This also affects the next problem which is the production value for the game. There is a lot of reading, and I mean a lot, like a hundred of pages of text. And for most of the game this is fine, but where I take exception to it is during important scenes like the ending. The lack of voice overs, and cut scenes during these important story segments makes the game feel cheap, and the scenes lack effectiveness. It is the lack of effort on this mechanic that irritates me, I mean Fallout 2 (which came out in 1998) had cut-scenes, which were just a slide show with a voice over. So it wouldn't be difficult for them to do something similar if they wanted to. Lastly, I encounter a rather nasty bug in the game that I feel the need to pointed out, since it is seems to be common, and it is major. Near the end of the game, at numerous occasions, I lost the ability to move or command my characters. And as you can guess, this was game breaking. The only recover I found was to reload a manual save file. I don't think having an issue like this is acceptable, especially in a title that has been out for a while.   Like I said at the top, Dragonfall isn't going to change your opinion on the Shadowrun series if you had a negative view of it before. But if you liked it or had mixed feelings about it than it might. It takes what worked in Returns and does them better.",
            "review_score": "1"
        },
        {
            "review_text": "Great characters, great storyline and a very polished turn based combat, where you can still incorporate tactics and strategy. Very true to the intended atmosphere of Shadowrun.",
            "review_score": "1"
        },
        {
            "review_text": "This review is based mostly on the  GOG.com  (DRM-free) version of Shadowrun: Dragonfall, so my Steam stats don't reflect my experience with the game. Played on Windows 7 and Linux Mint 17.3. Plays great on both OSes.  PROS:  + A much larger world than in Shadowrun Returns. + A more open-ended story than SRR, with many more side missions. + A wider range of character skills to unlock and tinker with than SRR. + Characters have very fleshed out background stories, which are revealed within missions. + A boatload of user-created content floating around. + Modest hardware requirements: played with Nvidia NVS 3100M (business laptop) graphics and runs fine. + Windows, Mac, and Linux (Ubuntu/Mint) versions included. + Damn good for only $15, and often on sale for less.  CONS: - Multiplayer would've been a very cool addition.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing update to an already well polished game, lots more back story, there's more conclusive arc's for each of your team and there's quite a variety of ways to have everything play out. Do yourself a favor and get this game, it's well worth the asking price for the time you'll get out of it.",
            "review_score": "1"
        },
        {
            "review_text": "An AMAZING rpg. Story is so captivating!",
            "review_score": "1"
        },
        {
            "review_text": "Shockingly good.",
            "review_score": "1"
        },
        {
            "review_text": "Shadowrun: Dragonfall is a very well-written, interesting and addictive RPG. What I love about the Shadowrun universe is that it takes the tired old fantasy theme/races and mixes it up with (in my opinion) the much more interesting cyberpunk setting.  As well as the main plot that kept me hooked I also enjoyed exploring the backstories and quests of your Shadow runner team mates, most notably Glory's which was very well done.  The soundtrack is fantastic and really sets the mood for each scene, glad the directors cut comes with a copy of the soundtrack. *Transfers to MP3 player*  The only thing I would improve upon is the customization and progression of your team mates who will only go up six levels at fixed points in the game with only a choice of two skills for each. I did come across a few bugs which made me have to re-try some quests but I know the devs are still actively patching the game so this is forgiveable.  Overall I highly recommend this to anyone who's looking for a good story with interesting characters and likes old school turned based RPG's with an entirely text-based narrative.",
            "review_score": "1"
        },
        {
            "review_text": "So, I've never played the tabletop Shadowun, and bought this on a friend's advice. And it is AMAZING. A perfect blend of high-fantasy and cyberpunk settings, with a lot of variety in weapons, magic, and cybernetics to augment your character. The pacing in both campaigns is a bit odd at times (IMO), and there are some balance issues around some of the magic (adepts are a bit weak without someone to throw haste at them, healing spells are weird), but they're engrossing nonetheless, and the gameplay feels like a tabletop without being clunky.    Overall, it's my top find for 2014, and I HIGHLY encourage anyone reading this to pick it up. If you like turn-based RPGs at all, you'll LOVE Shadowrun. If you don't like the genre: well, there's no accounting for taste.",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST STORY GAME, EVER !!!! 20 Hours games with full of the stories (for Dragonfall),",
            "review_score": "1"
        },
        {
            "review_text": "This game was brilliant. I haven't written many reviews for games on Steam, but this one blew me away enough to take the time.  I was a little apprihensive buying this as I played Shadowrun Returns and did not like it very much. The story was nice (if a little farfetched) but the controls were abysmal. Shadowrun Dragonfall - Directors Cut fixed any of the issues that I had with the previous game.  Story - 10/10 It was literally incredible. It may be text heavy for some, but if you take the time to read all the interactions it is like reading a book. Where as most text interactions just say what the characters are saying, this game includes facial gestures, descriptions of the surroundings including sights, smells and sounds. I would have read a book or watched a movie with the same story and absolutely loved it. A really fantastic selling point that many games don't have these days.  Gameplay - 8/10 (28 hours to complete primary campaign) I am not usually a huge fan of turn based combat (RTS fan), but this system was very smooth and easy to get a handle on. There were a few points left out of the tutorials (It took me about half the game to figure out that you could activate cyberwear) and the initial exploration of your home town was a little stunted by a lack of anything to guide you (It took me three missions to figure out that there was a cyberwear shop in your home town as it was tucked away in the corner).  Graphics, Art and Atmosphere - 9/10 Everything went to setting up an excellent atmosphere for the game. The ambient sounds were fantastic throughout the final game (A little clunky in the finale) and the effort to create weather effects and ambient lighting really helped set the picture of the world.  Final Thoughts I waited for this game to go on sale before I bought it as I was a little apprihensive after Shadowrun Returns. If I knew what I know now, I would have bought this game for full price on it's release date. I also cannot wait to play through some fanmade adventures from the workshop.  TL:DR - If you are a fan of turn based RPG's and don't mind reading text. 10/10 would recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished this game so i thought it is a good idea to write a review. First of all as usual the scenario is well written and interesting, and characters are more developped than they were in shadow returns, you also have more freedom and more things to do (side quests and such) if you like shadowrun returns you will love this game as i found that pretty much all aspects of the game were better, If you did not like the 'rail-rpg' style of shadowrun returns maybe you should give this one a try. All in a all a very good old school rpg, with a very interesting scenario and interesting atmosphere, 8\\10 would definately play again ;). ",
            "review_score": "1"
        },
        {
            "review_text": "★★★★★",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, with some annoying seemingly easy-fix mechanical issues that were not adressed by the dev team. Such as being able to pick up an item, and then hand it to someone else in the room with you, or being able to switch who you're moving around out of combat, or some way to stop the always ambushed bunched up way you have to be at nearly every combat.",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST STORY GAME, EVER !!!! 20 Hours games with full of the stories (for Dragonfall),",
            "review_score": "1"
        },
        {
            "review_text": "If you like tactical turned based RPG's then buy it. Very simple concept.",
            "review_score": "1"
        },
        {
            "review_text": "Unique setting, interesting characters, class diversity in combat, great support tools for modding.... I've played plenty of western and jrpgs this year but Dragonfall is the only one that has been consistent in every way and i'm sure i'll remember it for a long time. I'd be happy to keep buying new installments of this series as long as HS desires to craft them.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is freakin' awesome 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend Shadowrun: Dragonfall to any RPG enthusiast.  It's the sequel to Kickstarter success Shadowrun Returns, and features an entirely new campaign, upgraded tactical combat system, and streamlined combat UI.  The story is engaging and well-written; the quests are generally inventive and non-formulaïc. I spent about 25 hours playing through the main campaign, and I enjoyed every minute. The different options and play styles for different classes add a lot of replayability; I will likely play through again with a different class in the near future.  Go buy Shadowrun: Dragonfall!",
            "review_score": "1"
        },
        {
            "review_text": "cRPG with Orcs, elves, trolls, magic and germany in a cyberpunk setting. What else do you want? Fine you also get X-com like combat, great visuals and a story that is actually good.",
            "review_score": "1"
        },
        {
            "review_text": "You'll never want to stop playing!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best modern CRPG's of all time. Fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game. Never crashed. No bug encountered and I simply played for 50 hours in a row.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far the best Shadowrun game out there. The director's cut changes *really* help. It feels like a true sequel to SRR. If you haven't played a shadowrun game, It might be better to start here rather than with the original that has some nasty difficulty spikes, and a less interesting plot.  This game is in my 'best games of 2014' as well...",
            "review_score": "1"
        },
        {
            "review_text": "Shadowrun: Dragonfall is an amazing game. You come to love each and every character because the amazing storytelling and backstory each one has. Eiger's past explaining her strict regime and her militaristic skill in weaponry. Dietrich and his nephew, or Glory and the Devil-Worshippers. Hare-brained Schemes obviously put tonnes of effort to make their game as marvellous and rich with detail as they possibly could. This game is captivating and will draw you in and have you actually become your character. I felt bad for many of my decisions that I didn't think carefully enough about because of the consequences. Shadowrun: Dragonfall - Director's Cut is worth every cent and I stress to everyone profusely that you will not come across a game as beautiful and detailed as this.",
            "review_score": "1"
        },
        {
            "review_text": "This game has everything!  -Mages -Shaman -Melee -Weapon specialists -Hackers -Dogs -Drones -Humans, elves, orcs, trolls, dwarves... (i maybe missing out on 1 or 2) -Dragons -And many more!  Mechanics is simple enough to get me into the game real fast. But, you can go much more deeper into it at the tougher difficulties.   Interesting story plot. Dragons + cyber + elves/dwarves + futuristic setting (like combining LOTR and Matrix into 1 movie), and they actually managed to pull it off (at least for me).  One downside is that you can't buy equipements for your team. I guess this is how they encourage you to start another game with a totally different class/build (to increase replayability?).  Another downside is that, it has linear storyline. Sure, there are different interaction options, but the general outcome is always the same (kinda like telltale games).  TL;DR? Get it when its on sale.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best modern CRPG's of all time. Fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Never heard of shadrun but its part D&amp;D and cyber punk. You play any style you want. The maps are fun, very challengeing. The story telling is top notice, its funny, macabre and unexpected at times. Update* The bad thing is inventorys of every character cant be accesed during a mission, meaning that you cannot pick up items with your main character and give them to other team mates during mission. The inventory on a mission is slighty small as well  The story draws you in and everything else is pretty good   90/100   Buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "bought on Steam Sale, before it was further discounted. no worries though. so far so good. i think i may prefer it so far over Wasteland 2",
            "review_score": "1"
        },
        {
            "review_text": "I will keep this short and simple. If you like RPG's this is a MUST play game.",
            "review_score": "1"
        },
        {
            "review_text": "Again I usually liked more action oriented versus turn based rpgs before I got into Shadowrun Returns and fell in love with the art style, storylines, great characters and endless choices. This continued over to Shadowrun Dragonfall with even greater sense of atmosphere where one could jump into the story with no knowledge of the world and enjoy it several times over.",
            "review_score": "1"
        },
        {
            "review_text": "I started playing Shadowrun on the SNES over 20 years ago and not only has this game capptured that same spirit, it has surpassed it! This is a game of epic quality! If you like RTS and RPG's you will find a most satisfying experience with this game. Better even than Shadowrun returns this game is amazing, it touches on everything from magic to tech to corps and even a lil religion I love it! Best game I have played in a very long time.",
            "review_score": "1"
        },
        {
            "review_text": "game is lots of fun, I love the changes",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Just as good as Shadowrun returns, which was one of my favorite RPGs!",
            "review_score": "1"
        },
        {
            "review_text": "OK, so I nabbed this game on sale because it looked like a decent XCOM 'clone'. So I boot the game and bam! Grab a gun,follow your friend, rush into the room like a blind idiot and die. Being the massive idiot I was got discouraged and shut my computer off and questioned why I even bought the game into the first place. A few months pass and I`m at an airport, and I`m playing offline because airport WiFi is ♥♥♥♥ right? But anyways, I`m starting to get bored with playing that stripdance mission in Saints Row IV so I boot Dragonfall. And the craziest thing happened I passed the tutorial. If I say so myself Shadowrun:Dragonfall is the Xcom Enemy Unknown of the series your first play through is the most disorganized and it has a steep learning curve but is ultimately rewarding as an experience. In the end, if you like XCOM you'll probably enjoy this one.",
            "review_score": "1"
        },
        {
            "review_text": "The definitive version of Shadowrun Returns. I'm proud to say I contributed to the original KickStarter campaign for this. So in a way, everyone should thank me for enabling this to exist.   You're welcome.  Now go play it.     ",
            "review_score": "1"
        },
        {
            "review_text": "I was able to construct a fully realized playable character and his backstory through dialogue choices with my party members. That is very KOTOR2. Making Dragonfall a RPG worthy of your time.",
            "review_score": "1"
        },
        {
            "review_text": "Just awesome! Never been a magic and fairies fan, but always had a softspot for Shadowrun. The game reminds me of the original Fallout and Jagged Alliance games (as well as the new version). Having come to SR as a complete newb its pretty easy to understand and to pick up. Having played this one I'm going back to try the first one and will definately be supporting the Hong Kong based sequel coming out on Kickstarter.   If you like turn based RPGs then you'll enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "I must say, when I got this game, I did not know what I was getting myself into. I have absolutely fallen in love with this game. I thoroughly enjoyed myself with it and got 40 hours of gameplay from the story. I love the story, the gameplay is satisfying, its my favorite genre (cyberpunk), and it was made by some pretty awesome developers in my book. I highly recommend this game to anyone who enjoys turn based combat rpg's. It's a must have, and I'm glad I got it.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible writing - the entire story is steeped in difficult choices and moral ambiguity.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't really played the other Shadowrun games but I know for a fact that this has got to be the best one because it has the best waifus. My only gripe with it is the simple and straightforward combat system and the fact that I can't decide whether I'd rather have Eiger to step on me or   hand-holding   with Glory.",
            "review_score": "1"
        },
        {
            "review_text": "Shadowrun: Dragonfall is a solid sequel and I recommend it for anyone who enjoyed Dead Man's Switch. The story is better this time, and with far more dialogue immersion. There is a great deal more combat in this game, but you can still avoid most of it with clever decisions. All of the classes are useful, and the NPC team is highly competent.  The director's cut edition fixes many of the problems from SR:R. There are a few times when enemies will take a long time with their turns, but it's rarely more than a few seconds delay if they do get stuck. During two playthroughts, I've only once had to reload a save due to a glitch.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing story, even tops the original",
            "review_score": "1"
        },
        {
            "review_text": "10/10. Its like XCOM with orcs.",
            "review_score": "1"
        },
        {
            "review_text": "The definitive version of what could be the best RPG to be released in 2014 - and it faced some great competition!",
            "review_score": "1"
        },
        {
            "review_text": "An exceptional RPG. One of the best games of 2014. It captures the cyberpunk aesthetic and theme perfectly. A must have for any scifi or fantasy rpg fan.",
            "review_score": "1"
        },
        {
            "review_text": "The campaign is a little on the short side, but the story and the writing is fantastic. I finish the game with a katana-wielding adept. For the love of the Free state of Berlin, release a sequel!!!",
            "review_score": "1"
        },
        {
            "review_text": "Just as much fun as the original Shadow Returns. The new system elements add a nice touch to combat, and the new missions really bring out a lot in the characters.",
            "review_score": "1"
        },
        {
            "review_text": "Great cRPG. I really enjoyed this one. It's quite a bit better than the first game. Combat is similar to X-com. The story was enjoyable. I'd recommend this if you're into classic RPG games. Also there is no voice acting. So only buy it if you don't mind reading. I wish the game was a bit less linear and had more content. Still a great game. I eagerly look forward to the upcoming third Shadowrun game.",
            "review_score": "1"
        },
        {
            "review_text": "I must admit I've never heard of it or played it until I bought it and now I'm hooked. This game , although it's kinda retro is freaking awesome.....what strikes me as odd is back when it came out they had less technology and they did more with it and now they have more technology and developers seem to do less with it. This game will suck you in to the story and you will actually feel like you are a part of it. It's freaky , it's entertaining and the time just goes by quickly. I got all three for 15 bucks and I'm only on this one , very cool game.",
            "review_score": "1"
        },
        {
            "review_text": "Keep in mind that Shadowrun Returns actually almost made me not buy this sequel/expansion pack, because how dull the story and gameplay was. But Dragonfall pretty much fixed most of problems that was riddled with SR:Returns.  Graphically, this game is built from Unity engine. While not graphically/technically impressive for 2014, it has a consistent and appealing aesthetic that suits the theme. And good setting/level design that doesn't skimp on details - lots of interactivity and small encounters that bring the game world to life. NPCs all have personalities without the game trying to spell those personalities out for you too blatantly, they are subtle and/or unfold gradually.  The core of the gameplay and combat are pretty solid to boot. Combat was probably what I'd call the game's 'weak point'. Balance isn't great and combat is arguably too easy overall. Yet it still managed to be engaging and character building options are varied and enjoyable enough to easily forgive the flaws. Non-combat solutions also are handled pretty well, common enough to make most related skills worth it, and not under or overly rewarding. All I can really do as far as criticisms go with this game is nitpick at its combat/character building balance issues which aren't that bad relative to many other RPGs anyway.",
            "review_score": "1"
        },
        {
            "review_text": "Cool as hell. As always, I must say.",
            "review_score": "1"
        },
        {
            "review_text": "I love the Cyber-punk world that is created in Dragonfall. This is my type of game so I will recomend it. Here is what i like about this one :) &gt;  &gt;Story rich gameplay, that is based on different decisions, this is just to put your character in the game. There are different endings but you can get them all by choosing different options during gameplay  &gt;Turn based combat, that is strategic and more slow thant the aRPG games, but i like that.  &gt;You will want to replay it with different characters and making different choices just to see where the story goes :)  &gt; You'll explore interesting cyber punk world and lurk in the shadows just to unplot the interesting events that happen right after you arrive in Berlin. :)   All in all this is easy game that will require good strategy to assemble the team that will do the mission in order to win the battles.",
            "review_score": "1"
        },
        {
            "review_text": "Marvelously fun. Has slight flaws/limitations. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Slightly better than this:         YouTube™ Video:  A Night's Work (Shadowrun promo, 1990)&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "A huge improvement over the first game (which I still enjoyed immensely). The choices have more weight to them and NPCs feel alive with the dialog presented. I loved the story and quests in the base campaign and you always have that feeling of wondering what's going to happen next. Being able to customize your skills how you see fit was wonderful, and allows you to make your own kind of character. The ability to easily create your own campaign with the editor is pretty neat, and adds for more to do once you finish the main game.   The UI for menus can be annoying at times, and it is clear that it was designed for a mobile platform. During battles the UI is never a problem though and was easy to use.   The only things that bothered me was the shoehorning of homosexual relationships  (it was fine for one of the main story lines, but is it really necessary to have multiple characters reveal their sexuality when it has nothing to do with the story?)  and how human 'racists' were horrible and evil    and you couldn't choose to side with them if even if you wanted to    no matter what whilst some metahumans were actively prejudice to the humans and no one batted an eye. The prujudice metahumans were presented much less crazed, of course. I guess it's something to expect from a developer in Seattle, so I can forgive it since the game overall was very good.  Shadowrun: Dragonfall is definitely worth the money and will keep you busy for a decent amount of time if you do all the side missions. Buy it if you like rpgs with good story and dialogue.",
            "review_score": "1"
        },
        {
            "review_text": "Elves, dragons, magic, shotguns, corporations, anarchists, bionic limbs, the matrix, jacking in...  Also, a great story, interesting characters and best of all, good turn-based combat. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "Very great game with a good story Some people say the combat is bad and the companion missions become hard if you're undergeared/leveled I recommend you specialize in something because the companions can also be good at something. I would recommend",
            "review_score": "1"
        },
        {
            "review_text": "So good it kept me from studying for finals. I got into the TTRPG shadowrun a bit before spending the three nights it took me to beat this. Its given me some inspiration for running a SR campaign soon. Probably will be buying the other games soon!",
            "review_score": "1"
        },
        {
            "review_text": "I really want to like this game, but I don't. It has good elements to it: isometric, cyberpunk, and it's AP turnbased. I even kinda like the magic using in a cyberpunk setting. What holds me back from liking this game is the story. I just don't buy it. While I wouldn't call the writing bad by any means there's just something about it I find distasteful. Also I hate the fantasy races. Elves, Dwarves, Trolls, and the social hierarchy of the fantasy races. Something about it really turns me off.  I can't say it's a bad game though. In all regards I -should- like it.",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  ➜ A Quick Look @ 'Shadowrun Dragonfall - Directors Cut'&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Very nice graphics. Great gameplay with an awesome storyline. If you enjoy squad-based RPG with a nice dash of cyber-tech, then you'll love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Better than the original shadowrun. The improvements to the gui alone makes this worth the money. Highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "Don't try to play it unless you want to spent ~30 hours with it! Highly addictive! More runs, weapons, enemies... everything! The story gets less linear, so save your game progress, because you may want to try to do some things in a different way again. Action scenes are more complex. Expect to be more tactical than in the Shadowrun returns predecessor. Expect to use magic, explore matrix and hack machines. Expect to die, accept your own mistakes and try again. The graphics may look like from previous millennium, but you will not even notice it during game play. One small disappointment is the reading experience. All the dialogs are happening in too small text area.",
            "review_score": "1"
        },
        {
            "review_text": "An incredible useage to the original reimagining, both in gameplay, visuals, and writing. Engaging, lovely, and one of the best games of the past year.",
            "review_score": "1"
        },
        {
            "review_text": "Don't try to play it unless you want to spent ~30 hours with it! Highly addictive! More runs, weapons, enemies... everything! The story gets less linear, so save your game progress, because you may want to try to do some things in a different way again. Action scenes are more complex. Expect to be more tactical than in the Shadowrun returns predecessor. Expect to use magic, explore matrix and hack machines. Expect to die, accept your own mistakes and try again. The graphics may look like from previous millennium, but you will not even notice it during game play. One small disappointment is the reading experience. All the dialogs are happening in too small text area.",
            "review_score": "1"
        },
        {
            "review_text": "I had already beaten and loved the first one so when this came out it was a no-brainer.  I finally, after much procrastinating, beat it and must say this game, hands down, is one of the best RPG storylines I've experienced yet. Having played tabletop Shadowrun and being an avid RPG gamer this entire franchise is just getting better with each new addition.",
            "review_score": "1"
        },
        {
            "review_text": "Completely recommended. If you like turn-based and/or tactial RPGs, especially ones that are set in a near-future cyberpunk universe, rich in lore, then you should stop reading this review and buy this game right now. Getting it on sale is also fine too.",
            "review_score": "1"
        },
        {
            "review_text": "Having not played the original Shadowrun Returns, I bought this one because of the reviews saying this one was way better than the original. It is a fun tactical game, but I hope you like reading because it is very dialogue heavy. Also, if you want to be able to make use of any of the special dialogue options, you will most likely have to invest in a lot of the base skills like charisma, decking willpower and strength, otherwise you just have to play with what options are there by default.  The game is definitely the type where you want to choose a specialty and stick with it if you really want to be good at anything. I tried to make a street samurai/decker combination and i ended up with a mediocre mix, with Blitz being a superior decker and my combat being on par with Eiger.   Some of the combat can be tricky at times, but with the trauma kits the odds of dying are very slim.  Without giving away anything, i think the best ending was essentially the bad ending. Most of the other endings were kind of tame and brief.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Very in depth RPG story. Love the attention to the little details of the game.",
            "review_score": "1"
        },
        {
            "review_text": "All I can say is that this takes me back to the good ole days. Shadowrun the RPG brought to the PC. And well. I cannot recommend this game highly enough. It will bring out the nerd in you, ever if you think you dont have any nerd in you.  ",
            "review_score": "1"
        },
        {
            "review_text": "Let me get one thing clear first apart from some interface issues i loved Shadowrun Returns. Imagine my surprise when Dragonfall turned out to be not only longer, but also removed the linearity, polished up interface and made the game pretty much better in every way. The are two issues i have with Dragonfall compared to original and that inordinate amount of crashing on linux, and some bugs, like cyberware installation and Simmy's dialog looping to the original greeting just before the last run.  However Shafowrun Dragonfall is still the best rpg i have played in a long while and is one of the rpg greats rubbing its shoulders with such giants as Fallout, Baldurs Gate, and Planescape.",
            "review_score": "1"
        },
        {
            "review_text": "Shadowrun is a pleasant surprise for me. I bought this game not knowing what a cyberpunk rpg is like or played anything close to it. It was just on a steep discount on steam that made me decide to try it out.   Before I know it, I found myself very much engaged in the storyline and all its dialogues. Having played a fair number of rpg games myself, I found myself enjoying the writing and storyline of this game very much. Reading every line with intrigue.   The game is also very well balanced and offers players with multiple options in terms of builds etc. I've only finished the game once on a conjuring shaman but I can see that almost any build would work in this game.   Although the skill tree is really fun to play around with, I didn't particularly enjoy the combat sequences of the game. It can be sometimes slow and draggy. And too many encounters that doesn't reward the player for putting up a fight. At every instance, I found myself wanting to talk my way out instead. That, in my opinion, is perhaps the biggest downside of the game.  By and large, I would still strongly recommend ppl to give it a chance and try it.   ",
            "review_score": "1"
        },
        {
            "review_text": "Very good. Supasses Shadowrun Returns with its expanded setting and options. Feels more involved with the Kreuzbasar Hub.",
            "review_score": "1"
        },
        {
            "review_text": "First game in this franchise I've played, and I'm quite impressed. Happily donated to the kickstarter for Hong Kong. If you're a fan of tactical rpgs then I'd highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Magic, Metal and Guns. Oh my.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't finished the game yet, but so far I love it.  + Some of the best writing I've encountered in game so far, both story- and characterwise + Cyberpunk Berlin is a fresh and fascinating setting, and as a german I am thoroughly charmed by how well done the 'german stuff' in this game is. + Great soundtrack + Seems very balanced so far. I play on normal, and while combat is sometimes challenging it never felt unfair. + Quests (or 'runs') can usually be completed in more than one way, and often without violence. + Plenty of ways to customize your character build. + You get a lot of great content for your money + Haven't encountered any bugs so far  I could write more, but really all of these points have been mentioned by others, also I'm really tired so if you like rpgs with great stories this one is an easy recommendation. ",
            "review_score": "1"
        },
        {
            "review_text": "It's like Shadowrun Returns with some extra additions. I liked the original campaign a little more than the previous game. It gave me a feeling of Fallout 1 or 2. I also loved the variety of weapons and especially those miniguns. Awesome power and gore resulting effects. The game also continues having the usual long text descriptions and dialogs, which is cool from one perspective, as you feel like playing a PnP RPG, with a very descriptive DM, but on the other hand you get a little bit tired of reading. Anyway, this game is recommended, like the previous one.",
            "review_score": "1"
        },
        {
            "review_text": "While many people were upset by the first releases campaign (Dead Man's Switch), for the lack of open-ended gameplay, and lack of memorable party members, the Dragonfall expansion fixed all those complaints. In fact, Dragonfall probably should have been the game they made from the get-go. Now that they've made the Director's Cut a standalone, you don't even have to buy the first campaign to play the much more fleshed out second campaign. Definitley pick up this game if you are a fan of shadowrun, cyber-punk Deus-Ex-ish games, or RPGs in general.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting story. I like the fact that it's mostly linear, since then you can fit a very compelling story into a fairly short game (10-16 hours about). A lot of the story and decisions that you get to make are very satisfying!",
            "review_score": "1"
        },
        {
            "review_text": "A really great game with some interesting choices.",
            "review_score": "1"
        },
        {
            "review_text": "A very good story so far..  But...  The combat feels like discount Xcom. I can't rotate the camera, which is a sorely needed function for games like this.",
            "review_score": "1"
        },
        {
            "review_text": "Not normally my kinda game but it's amazing.. That's all!",
            "review_score": "1"
        },
        {
            "review_text": "I had typed up a lengthy review but accidently hit the back button so ill just do a bullet list.   Good: -Excellent story -Great companions that interest me -Great combat -Atmosphere is very nice, music is perfect for it -Good writing -Pacing is spot on, keeps me wanting to play -Speaking as someone with little interest in cyberpunk, this game still holds up  Bad: -Graphics. While not horrible are not good either -Character progression: this is a matter of personal taste in my opinion so its not a huge negative to me but i prefer more traditional level/stat based systems -Interface: Can be fairly awkward and unintuitive at times.  Bottom line, I highly recommend this game to any fan of RPG's, cyberpunk, old Shadowrun games, or good games in general! ",
            "review_score": "1"
        },
        {
            "review_text": "8/10  PROS: Fun tactical turn-based combat, similar to new X-COM (action points and cover system).  Lots of customization paths (Melee, Magic, Guns, Hacking, Summoning). Cyberpunk story is interesting, yet not too complicated. Multiple endings.  CONS: Later on, there aren't any new skills if you decide to specialize. Limited customization for appearances. Limited selection of companions.",
            "review_score": "1"
        },
        {
            "review_text": "Dragonfall isn't the perfect turn-based RPG by any means, however the pros of this game greatly outweigh the cons. Dragonfall uses the shadowrun mechanics and setting to tell a stunning sci-fi tale. You take the role as the leader of a group of shadowrunners and go on missions that allow you to play as whatever type of person you want. Want to murder everyone? Go Ahead. Want to make deals and be sly? You can do that too. The way you play is very customizable from how you fight and what you know, down to the actions you take.  Pros: -Solid RPG with choices throughout that affect mission endings and story. -Good plotline and story -Lots of replayability story wise and battle wise -Very customizable characters -Has some well made mods for even more play time and new experiences  Cons: -The game still has freezing problems -A Decker is almost entirely necessary all the time -Battles are frustratingly slow at times",
            "review_score": "1"
        },
        {
            "review_text": "Another stella title in the Shadowrun series. I'll keep playing these so long as they keep making them.",
            "review_score": "1"
        },
        {
            "review_text": "Great replay",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't beat the first encounter",
            "review_score": "1"
        },
        {
            "review_text": "If you like the idea of magic, but can't deal with fantasy, the Shadowrun universe is for you! This cyberpunk dream couldn't be better, and I look forward to more from these gents in the future!",
            "review_score": "1"
        },
        {
            "review_text": "this game is great  i'm going to miss those ♥♥♥♥♥♥♥s",
            "review_score": "1"
        },
        {
            "review_text": "this game is pretty awesome and ive only been playing it for an hour meow.",
            "review_score": "1"
        },
        {
            "review_text": "Cutting to the chase-- this is an excellent turn based game. The world is interesting, characters interesting, and if take the time and effort to dig around and explore locations and characters, there's lots of neat stuff to find. I was thoroughly impressed with everything.  Only thing that may have made it better was a sort of codex to give more background on the world.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic story. It's the awesome story Dead Man's Switch should've been. The same great mechanics, tweaked somewhat, with well written plot and charaxcters this time. My only complaint is that it didn't last long enough, because a story this great can't.",
            "review_score": "1"
        },
        {
            "review_text": "Vastly improves upon the formula given to us by Shadowrun Returns. The UI is better, the story is awesome, and IT GETS RID OF THE 'WEAK SHOT' BS.",
            "review_score": "1"
        },
        {
            "review_text": "If you like cyberpunk, you'll probably like this.   If you like games with lots of dialogue, you'll probably like this.  If you like isometric CRPGs, you'll probably like this.  If you heard meh things about Shadowrun Returns, unhear them. This is the real deal.",
            "review_score": "1"
        },
        {
            "review_text": "Another fantastic game. Looking forward to the next one.",
            "review_score": "1"
        },
        {
            "review_text": "[+8] Cyberpunk flavour. Shadowrun is such a deep universe that it's easy to see why Harebrained Schemes set this one before the current-edition canon time. However, they're still accurate to the flavour and tone of Shadowrun, making for a great texture to the game. [+8] Individuality. HBS certainly know how to craft stories. Damn. While the overall atmosphere has been noted, each mission has its own little story, with quirky, flawed, and very human characters that enhance this well-crafted world-building. [+4] SOUNDTRACK IS TOO GOOD ERMAGERD [+2] Fitting combat. The combat is still a little simplistic, but compared to the original SR:R, it's much better. Considered by itself, it actually does a good job of selling the idea that you're playing a team of badass mercs. OVERALL SCORE: +22",
            "review_score": "1"
        },
        {
            "review_text": "Another Epic Shadowrun installment from Hairbrained Schemes.  I spend 17 hours and dont think I saw all there is. With a brilliant story and almost perfect turn based action system Shadowrun DragonFall is well worth a try for any Cyberpunk fan.",
            "review_score": "1"
        },
        {
            "review_text": "The game reminds me of Neverwinter Knights, with xcom combat, and with a HEAVY focus on dialog",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, wonderful story, and an incredible world. What else do you need?",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, Having never played The tabletop version Nor the Original shadowrun returns I bought this game because there are not many tactics style games that i remember from my earlier days. Games such as Final fantasy tactics or Disgaea. I bought Xcom for the same reason but i didnt like it very much, I guess I set the bar too high but this game is one of my top tactics games now...well top 5 anyway, I bought this while I was waiting for Massive Chalice to be at a playable level and now I am hooked. I have only played the original story line once (And on Normal Too....) Since then I branched out into the Workshop items, Which i love and they look to be flourishing more now, this game will keep me tided over for a few hundred more hours yet. Great Buy. Great price. Look forward to hong kong....Or Shadowrun online..",
            "review_score": "1"
        },
        {
            "review_text": "Completely recommended. If you like turn-based and/or tactial RPGs, especially ones that are set in a near-future cyberpunk universe, rich in lore, then you should stop reading this review and buy this game right now. Getting it on sale is also fine too.",
            "review_score": "1"
        },
        {
            "review_text": "I've heard quite a bit about how Shadowrun: Dragonfall was the proper installment of Shadowrun: Returns, after the first game having felt rather empty, despite the great engine.  Well, it certainly  is  better, in my opinion. But not by a whole lot.  The story seems bigger, with higher stakes, but it suffers from weird pacing. Take something like Dragon Age (the first one): you start small, and you end up saving the world, more or less. SR: Dragonfall is similar, but there's a huge leap between rookie and hero, in the later. In Dragon Age, you had to traverse the whole world, trying to unite the various races to help you. It was a long journey, with tons of sidequests in between.  In SR:D, you start by helping your little town, and suddenly you're saving the world, and fighting some 'bigger than life' enemies. It didn't feel very natural, to me...   Another problem is how there are still some bugs and inconsistencies in the dialogue. The bugs I encountered weren't particularly harmful, only a bit annoying (although I know of one that can go as far to delete your saves -- only in a mission, and it's very clear in the forums. There's a workaround, so it could be worse. ANYWAY...). The inconsistencies, though, didn't feel good at all. Sometimes, the conversations repeat themselves as if nothing had happened (not just a line or two, but the whole conversation, with several choices in between), and there was even an NPC that told me someone had died, and the next time I talked to it, it talked as if that character was still alive. Still, it's not game-breaking or anything. Just something that stops this from going from good to great.  The choices it gave you were pretty surprising, at times. On the other hand, it also seemed to omit some choices that seemed plausible, and would feel much more satisfying.  The last thing is more of a personal gripe with the general feel they were going for, but let's say that I didn't like the    AI going from wonderful sentience to being an arrogant killer in a heartbeat. Come on, not again! A machine isn't a human being, it makes no sense for it to always have the same drives as a human being. It's always a power-hungry supercomputer that wants control... There are so many more interesting roads to take... oh well.    Other than these things, I really liked the game! I prefered some aspects of Blackguards' combat system. Especially 2: movement and attacking was far more... 'modular', let's say. In Blackguards, you could break down 1 Action into a few smaller ones, in order to choose a certain path, and so on. Of course, positioning was more important in that game, but anyway: Shadowrun sometimes felt a bit awkward as a result. For example, you can walk and attack with a single action, but only automatically! The game doesn't let you choose the path, or anything. The more important aspect of this would be where you're attacking, since that's the position you'll stay in when the enemies' attack.  The second is how the percentages in Shadowrun were far lower! It's infuriating! It got better by the end, but for the majority of the game, it seemed like my hit rates were always 40-60%... This results in a lot of misses, which everyone should hate. But at the same time, it provides a certain thrill... it works.  All in all, it's a very solid game! Nothing revolutionary, but it has a great atmosphere, with both awesome visuals and music! The combat isn't very deep, but it certainly provides some nice challenges. The story had its ups and downs, but I liked some aspects of it.   If it seems up your alley, give it go!",
            "review_score": "1"
        },
        {
            "review_text": "This game is badass. Better than Shadowrun returns for sure. The fighting sequence is a lot like X-com.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 For your Cyberpunk Isometric RPG fix.  + Shadow Run Lore + Storyline + Intriguing Squad member stories and quest. + Squad member customization + Steam Workshop - awesome modders, check it out.",
            "review_score": "1"
        },
        {
            "review_text": "Good story (though too much text for my liking), good mix of RPG and turn-based, simple UI.",
            "review_score": "1"
        },
        {
            "review_text": " Man Meets Magic &amp; Machine",
            "review_score": "1"
        },
        {
            "review_text": "Completly addicted! love the genre, Love the game.",
            "review_score": "1"
        },
        {
            "review_text": "They have stuck to their guns. I like how this series doesn't fix anything that isn't broken. This game just continues on with another story, but only adds great new graphics and weapons, yet it sticks to the original archetecture.   I would definitely recommend this game, but only if you are a fan of the series. Shadowrun first was released on the NES, and it was a big hit. I am glad to see these guys are still doing business, they are honest, and they aren't out for your wallet.",
            "review_score": "1"
        },
        {
            "review_text": "Best 8-12 hours you can spend in a game and then some!",
            "review_score": "1"
        },
        {
            "review_text": "Essentially 'Super Shadowrun Returns'. Way more content and way too good than it has any right to be. One of the best WRPGs in a very long time.",
            "review_score": "1"
        },
        {
            "review_text": "Currently 5 hours in; it's a mixture of X:Com, Dragon Age, and Mass Effect.  The writing's fantastic (believe the hype - I was sceptical but it genuinely is that good), the combat's challenging, and the game is flowing at a really good pace.  Not many games actually make me think about my decisions based on personalities and potential outcomes... a game with basic isometric graphics &amp; no voice acting is 7gb in size; the reason is, it's all content. A rare thing nowadays.  Also, troll pole dancers.  I close my eyes and I still see their writhing pale flabby forms on the underside of my eyelids.  Do NOT look at the troll pole dancers.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. I hope it gets a sequel of the same standereds.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant turn based game with a very good story line and well made game mechanics based off tabletop games. Well recomended to fans of shadowrun and other tabletop games. Very fun to play and definatly lasts more than the 12 hours it intially suggests.",
            "review_score": "1"
        },
        {
            "review_text": "+Good story. +Not a too dumbed-down character building system, like I see all too often these days. +Interesting NPC's +Feels true to its cyberpunk setting, a dark mix of magic and sci-fi where magic exist side by side with tech.  +A good modding community, something thats a major plus on the replayability side, Ive had the pleasure to enjoy several campains from the workshop.  + turn based.  -The graphics arent great but thats a very minor concern in a game like this.  This is basically a great 'old-school' rpg, of the kind I feared I'd see no more of. ",
            "review_score": "1"
        },
        {
            "review_text": "For an oldie like me, who played pen n paper waaaay back when, this is a great way of bringing back those memories. The story-line is well thought out and difficulty is just about right. I actually found myself caring about my team and, to me, that is a testament to how well the back-story is written.  Long story short, if you like cyberpunk settings or Shadowrun in particular, get this. It is worth it.  10/10 would deal with a dragon again.",
            "review_score": "1"
        },
        {
            "review_text": "Similar to Shadowrun Returns. Just as great. Maybe better.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know that I can say anything about this which hasn't already been said.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely gorgeous game; the isometric view left a lot of flexibility for the artists to create truly interesting backgrounds.  The story is great, with some interesting moral choices to be found not only in the main storyline but also in the optional objectives.  The writing and exposition could use some work, but given the sheer volume of it I am more than happy to dismiss that.  The combat is very fun and harsh should you make a mistake, but there is an excellent 'rewind' save system so you never lose too much progress. Each class has a plethora of unique abilities and each encounter is very satisfying.  Some dialogue trees feel empty and limited, and occasionally you are forced to make arbitrary decisions or are given choices with regards to certain situations that you are never given again, even in the same situations; for example, I was occasionally given the option to 'look from the astral plane' down onto a keypad to see which keys are contained in a passcode, but sometimes I was not. When and where I could use this ability on a keypad was completely arbitrary. Similar situations to this one are frequent in dialogue and decision trees.  The game has some UI issues resulting from being designed to be played on a tablet, such as occasionally moving your units to an incorrect spot and wasting an action point.   Other than those points, I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Immersive, expertly crafted and a great editor to boot. A must have for any cyberpunk/fantasy rpg lover.",
            "review_score": "1"
        },
        {
            "review_text": "XCOM: Steampunk Berlin - Orcs and Elves - One More Turn Edition.   All you TL:DR folks, beware. No voice acting. Time to knuckledown and learn to read. It's worth it.  Strong concise dramatic writing, lots of depth and lore, turn-based tactical gameplay better than Enemy Unknown's. Spells and sorcery to tempt recovering Dungeon Masters, Deus Ex style cyborg augmentations for all you geeks and big stupid tragic ideas for us nerds.  I sat down to try it out and logged 4.2 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent tactical strategy game. This game introduced me to the whole genre and I haven't been able to stop!",
            "review_score": "1"
        },
        {
            "review_text": "really nice game with a great premise. love the mix of tech and old school fantasy. The look and feel is a bit dated, and there's a lot of reading and no voice acting, however, the game is still very fun. 4 stars in my book.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, great 'old school' story, great 2.5D graphics and mood.  Disliked-it ended  I would highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - Amazing storyline. This is cyberpunk RPGs at its finest. I was completely hooked. - Fun gameplay, which is actually quite challenging at higher difficulty levels (even using optimal builds and such, which is rare). - Lots of side quests and extra to do.  Cons (to some): - No cutscenes or voice-overs. This game has a lot of reading, so it's almost like a novel in that sense. But for those who enjoy reading, it is very rewarding.",
            "review_score": "1"
        },
        {
            "review_text": "Let me state something we already know: 2014 was not a good year for video games. Titanfall died within a month, Destiny was a bloated monstrosity, and the less said about Unity, the better. There were a few good games, but most were lost in the avalanche of crap.   And through it all, this game was criminally undermentioned.   Shadowrun Returns marked the franchise's glorious return to the video game scene. Although it had its problems, it was generally agreed to have been a good first attempt. Harebrained Schemes did it seems like less and less developers do nowadays and *listened* to the complaints of the players.  And here we have Dragonfall. In a lot of ways, it plays a lot like a much linear Fallout 1 &amp; 2. Isometric view, combat dominated by 'action points', and entire sidequests that can be completed earlier or bypassed entirely with the right skill/speech checks.   Your comrades, the other mercanaries that make up your shadowrunner group, are also all very interesting characters with their own demons and reasons for being the way they are. One of the greatest things about the Director's Cut is where in the original Dragonfall they merely hinted at tying up some loose ends, in the DC you actually get to accompany them as they try to bury their past once and for all.   Like Fallout? Get this. Like Cyberpunk? Get this. Fan of the Shadowrun tabletop of old? Oh, you better believe you should get this.",
            "review_score": "1"
        },
        {
            "review_text": "What happens when you combine turn-based combat from x com + rpg elements like mass effect + the sci fi genre + pillars of eternity? You my friend get this game. If you like all of the above get this game now! You will not be dissapointed by this purchase :)",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game. Very advanced game mechanics for what simple text-based rpg and combat elements it involves. If you don't like to read stories, play strategic turn-based combat, or work puzzles to figure out passcodes, go play a call of duty, watch a Let's Play and leave this for the old-school gamers. If you're more of an rpg/dungeon-crawler gamer though, there's a lot of fun to be found with gaming elements that remind me of a mix between the original Fallout series and XCOM and a deep story that somewhat reminds me of a mix between Final Fantasy VII and Legend of the Dragoon but cyberpunk.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the best SR game ever made. The story is fantastic, characters are all great, and the moral choices you have to make are hugely impactful and interesting. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion, this is the best of Harebrained's Shadowrun titles. The story is more interesting than the other two games, and you gain the ability to level up your squad and develop deep relationships with each member. I still fondly recall Eiger and Glory, and their complex backstories and motivations.",
            "review_score": "1"
        },
        {
            "review_text": "I don't review a lot of games but i felt Shadowrun: Dragonfall deserves a review. I recommend you pick up this game. If you liked Shadrowun Returns you will like Dragonfall. If you are debating which one to pick up I would pick up Dragonfall, both are good but Dragonfall had a much more interesting story. Cant wait to play Hong Kong!",
            "review_score": "1"
        },
        {
            "review_text": "This game is similar to X-Com Enemy Unknown and Wasteland 2. It is a decent turn based game and I enjoyed it but it wasn't amazingly awesome. Since I played over 30hrs of course I have to recommend it. however, I am annoyed when I play turned based games and they aren't as good as Jagged Aliance 2 which should have set the standard. (ie. where if you shoot someone with a bullet at point blank range it causes major damage no matter what the gun). That's my main gripe. This game is unrealistic in that sense. The skill tree wasn't the best.   Story line was decent. Lots of twists.",
            "review_score": "1"
        },
        {
            "review_text": "Dragonfall is an excellent follow on to the first Shadowrun game. Whereas the first one was a linear story, Dragonfall has a few 'side quests' so to speak, but for the most part it is a linear story you follow. The story is simply amazing and really sucks you into the Shadowrun world. There is more interaction with your NPC's that made the game much more enjoyable. Each NPC had their own side quest.   My only annoyances would be with the inability to equip/fully train NPC's (exception is the few skills you can assign to NPC during the progress of the game). My main complaint is the incredibly horrible load/save times, inexcusable for a game of this simple graphics. All things consider I highly recommend it, and will be picking up Shadowrun Hong Kong next time it goes on sale.  Pro +Fantastic story that really drives deep into the Shadowrun world +Great turn based combat that puts you in different challenging positions throughout the whole game +NPC story lines +Lots of gray area decision making, where there was not always an obvious choice  Cons -Game load times were incredibly slow for a game of this type, there was no reason for this -Inability to customize your 'party' of NPC's, you cannot assign their points or pick their outfit -Inability to trade items to your NPC's during a mission (such as giving them a med pack)",
            "review_score": "1"
        },
        {
            "review_text": "great game with a great story, even good enough to read it thru since there is no voice acting. One major bug which commonly occurs when u go after the apex computer AI..the secret is not to save game at all in that sequence. Just use autosave if u need to quit game. Other then that it was a blast..have fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "Shadowrun: Dragonfall remains true to the Hairbrained Schemes Shadowrun Trillogy and makes a number of significant improvements to both the story line and gameplay.  As I mentioned in my review of Shadowrun Returns, this trilogy is not an action packed beat-em-up and you need to be in the right frame of mind to read an emerce yourself in long dialog and the plot to get the most ouf ot this game. Dialog skipping will take away most of the enjoyment.  ",
            "review_score": "1"
        },
        {
            "review_text": "If you like D &amp; D and love the Shadowrun Universe then you'll find this game is a slam dunk. With an incredibly engaging story-line, and the challenging turn based tactical combat that you'd find in a Fallout tactics, this game does not disappoint. The story is somewhat linear but there are major choices laced throughout which seemingly change large parts of how the universe reacts to your toon's presence and influence.",
            "review_score": "1"
        },
        {
            "review_text": "wonderful game. The story is one of a kind, and I find myself begging for more.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic story driven RPG with turn based combat... Shadowrun: Dragonfall will suck you in with a story of intrigue and revenge as you build your team of Shadowrunners up from a crew on the brink of collapse to a well oiled machine capable of completing any objective set before them. Don't miss this one if you are a fan of similar games.",
            "review_score": "1"
        },
        {
            "review_text": "Shadowrun: Dragonfall is a cyberpunk top down tactical RPG.   Summery: Shadowrun is an old school style RPG with turn based grid combat and a heavy emphasis on story.     The Story: The story is compelling and well written. The game provides many dialogue trees and allows you to make tons of decisions.  Even without any voice acting the characters and their backstories left an impression and i found myself coming up with voices for them in my head. No bad voice overs or poor performances here folks!  The amazing lore of this game melds sci fi cyberpunk with magical fantasy concepts.  Ever wanted to create a machine gun wielding troll who uses robot drones? What about an elf hacker who can make contact with the spirit world? What about a katana wielding street samurai who can use explosives and spells? Well now you can!    The graphics: The fidielity is nothing to brag about but the artstyle is 100% gorgeous.  I loved exploring this cyberpunk world. The world is run-down and trashy yet beautiful and full of detail.  Everything from dilapidated apartment complexes to corporate laboratories have been masterfully crafted. Its obvious the artists put care into creating these stellar enviroments and character portraits. The game is a beautiful work of art.     The Gameplay: While not as deep or complex as other tactical RPG's the gameplay here provides depth without overwhelming the player with overly complicated concepts.  You level up and buy gear. you create a class and try to capitalize on its abilities.  Your party members can fill in the gaps, and depending on who you take on a mission things can go a variety of ways.  The mission design is nice because almost everything has multiple solutions that are determined by the skillset of your team of shadowrunners.  A hacker can bypass security and jack into the matrix giving you more options. A shaman can interact with the spirit world, talk to ghosts and even summon entities to the battlefield. Some classes specialize in droids and drones that can provide heavy combat support or enter small vents that humanoids have no access to.  The outcome of your mission is not only determined by the classes but also the personality of your character. Many confontations can be avoided simply by saying the right things and convincing people that you aren't a threat.  This doesn't just depend on a stat based speech check like many other RPG's. It also depends on the species and peronality traits of your character.  Some characters are experienced with the streets and have an easier time interacting with gangsters and runners. Other personalities are more corporate or security/law enforcment oriented.  This means your character will be able to say different things based on his/her personality.     The music: Both the ambient and combat music are some of the best i have ever heard. The soundtrack sets the tone perfectly and is honestly a highlight of the game.  Many missions have unique music specifically designed for that location. This means that you won't have to hear the same songs excessively often like in most other games.  You could easily listen to the music outside of the game and still be amazed. This is one of the best game soundtracks on the market!     The verdict: This is a near perfect game and a must-own for any shadowrun fan or cyberpunk junkie. Even though i loved shadowrun: returns i must say that Dragonfall is a vast improvement.  If you dislike tactical turn based RPG's then maybe give this one a pass but you will be missing out on one of the greatest and polished lore universes of all time. I give this one a BIG thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "I absolutly love this one. It has a great story, the people are great and who doesn't love a good plot. Glory, Glory, Glory, did i mention Glory? Glory is the best npc in this entire game.",
            "review_score": "1"
        },
        {
            "review_text": "Dragonfall is really a step up from Shadowrun Returns, and where the game delivers its true promise. The matrix sections are more plentiful and affect missions more than before, and runs are more varied. Several runs allow for multiple paths, allowing you to bypass sections through hacking, bluffing your way past guards with charisma, sabotaging security with drones, or just mowing down everything in your path with bullets and spells.  The branching paths also affect the storyline as well. When you recover choice bits of extra paydata, you can hand it to your employer to make them happier, turn it over to a merchant to see if you can get extra gear or upgrades from it, or sell it online for credits. There are a few factions that will give you missions if you keep them happy, so your choices affect both story and gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't been this madly in love with a game and its universe since bethesda's golden years. The atmosphere, art, soundtrack, and writing are all breathtaking.   Note, this and Hong Kong are WAY better than Returns.",
            "review_score": "1"
        },
        {
            "review_text": "Began as a DLC for Shadowrun: Returns, became a full game. Great story and has some nice improvements compared to Shadowrun: Returns.",
            "review_score": "1"
        },
        {
            "review_text": "It may be a little late to write a review for Dragonfall - especially when you own this game already for quite a while (like me). But I'm playing it again right now, so it may be still a good idea. Well, Dragonfall is not perfect. For instance it is quite difficult (perhaps even impossible?) to give objects from your inventory to one of your party members. Or the story, especially the Dragonfall story, is at times really cheesy when it's adoring and worshipping Monika and the romantic criminal life in anarchist Berlin. Don't get me wrong - Shadowrun IS a scenario which romanticises a criminal Robin Hood life. But neither in Dead Man's Switch nor in Hong Kong is it as obtrusive and embarassing as here. I'm very much with Lucky Strike, a NPC runner which you can hire for missions, who is expressing just these thoughts.   But - doesn't matter at all. Dragonfall has an unbelievable atmosphere, and as soon as you start the game you surrender to it. Having said that it HAS a lot of advantages. The story, though cheesy, is more detailed and more epic than the story of Dead Man's Switch. And even though the story of Hong Kong is probably even better, Dragonfall has by far the superior matrix system. And that, although the matrix of Hong Kong was supposed to be an improvement. Typical case of making things worse by trying to improve them. Worse to an amount that I stopped playing at some point and never bothered to start again. Also Dragonfall has a lot of excellent user campaigns in the Workshop. 'Antumbra' for instance or 'Mercurial' are real classics, and you don't see a difference to a professional campaign designed by the developers. Hong Kong has only one campaign, I believe. Don't know anything about it's quality. But six or seven or even more high class scenarios for Dragonfall compared to just one - that speaks out loud enough, don't you think?   So, without any doubt Dragonfall is the best Shadowrun game for PC up to now. And having said that, I don't believe there are many games to follow. Shadowrun is a game system which definitely hasn't aged well. In a peculiar way it seems to have fallen out of time, and so probably Dragonfall will be it's ultimate legacy. At least as long as we talk about PC games ...",
            "review_score": "1"
        },
        {
            "review_text": "Futuristic turn based RPG with an overall Lo-Fi profile (Crowdfounded). Like the turn based parts that are pretty much reminding of the XCOM series. The options in developing characters make the game deeper than UFO. But: if you don´t like to read tons and tons of (acceptable or even good) storytelling, which is necessary to understand what you play, then you might better stay off this bugfree well crafted product. I personally really dislike reading that much and can´t play longer than 30 minutes at time. But because this works perfectly both on Windows (I play on 10) and Linux (Mint) I really appreciate the efforts. In my mid 30´s the story is acceptable, but at times sounds a like childish sci-fi. But hey I also dislike Star Wars and similar, so this shouldn´t be too important to you.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of reading, great setting, decent gameplay. My only complaint was that sometimes elements/dudes block ground tiles so you can't move your dudes there, or have to spend a few seconds finding the exact pixel that isn't blocked.",
            "review_score": "1"
        },
        {
            "review_text": "This game like most RPGs is a bit slow starting.  But when it ramps up, it's very engrossing and fun.  The storyline is interesting, the characters are interesting and the game play is pretty good.  The only issue I really have with the game though is the game play style for the combat will remind people who play XCOM of that game. It's very XCOM style combat. That's a good thing because XCOM is a damn good turn based strategy game. So why is this an issue? If you're used to XCOM, the combat sections feels like a bad XCOM game. :-/ It's still good, don't get me wrong, but it definitely doesn't match XCOM and you can't help but make the comparison because of how similar it is to XCOM.",
            "review_score": "1"
        },
        {
            "review_text": "Perhaps one of the best stories I've been able to play through on PC, enjoyable, challenging and thoroughly thought provoking.  It's just good.   ♥♥♥♥in buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic turn based rpg, as lots of people have said, very much like the old Fallout 1 &amp; 2 games. Decent amount of customisation, fantastic story telling. A game not for the sleepy...lots of reading involved! Well worth the nuyen whilst it is on sale!",
            "review_score": "1"
        },
        {
            "review_text": "This was my first time playing Shadowrun games. Fortunately it is not a very big handicap if you have no previous knowledge of the game world. There are plenty of references to stuff that happened in previous game but no big deal if you skip those or give a wild guess what happened.  Gameplay is smooth, the cover system is an interesting touch and gives plenty of tactical opportunities instead of running into a fight head on. The only complaint about the combat would be that it is a touch on the easy side.   Really awesome soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Improves significantly upon Dead's Man Switch with the expected hallmarks of writing, strategy and immersion. I defintely liked the upgrades they did to the companion system and fleshing out great personal content for each - a trend I would love other RPGs to follow who either mistake quantity &gt; quality of companions, or treat them little more than NPCs who help to punch enemies for you.  The main plotline is fantastic with interesting twists though the difficulty of the campaign dips towards the endgame - granted, I did complete every possible mission and sidequest so I was as prepared as possible. Speedrunners should find the normal difficulty hard enough.   Also worth noting that even at this stage the game does have number of minor bugs which have not been fully resolved. Nothing game breaking.  Easily recommended - great example of old TB RPG done right.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "It may be a little late to write a review for Dragonfall - especially when you own this game already for quite a while (like me). But I'm playing it again right now, so it may be still a good idea. Well, Dragonfall is not perfect. For instance it is quite difficult (perhaps even impossible?) to give objects from your inventory to one of your party members. Or the story, especially the Dragonfall story, is at times really cheesy when it's adoring and worshipping Monika and the romantic criminal life in anarchist Berlin. Don't get me wrong - Shadowrun IS a scenario which romanticises a criminal Robin Hood life. But neither in Dead Man's Switch nor in Hong Kong is it as obtrusive and embarassing as here. I'm very much with Lucky Strike, a NPC runner which you can hire for missions, who is expressing just these thoughts.   But - doesn't matter at all. Dragonfall has an unbelievable atmosphere, and as soon as you start the game you surrender to it. Having said that it HAS a lot of advantages. The story, though cheesy, is more detailed and more epic than the story of Dead Man's Switch. And even though the story of Hong Kong is probably even better, Dragonfall has by far the superior matrix system. And that, although the matrix of Hong Kong was supposed to be an improvement. Typical case of making things worse by trying to improve them. Worse to an amount that I stopped playing at some point and never bothered to start again. Also Dragonfall has a lot of excellent user campaigns in the Workshop. 'Antumbra' for instance or 'Mercurial' are real classics, and you don't see a difference to a professional campaign designed by the developers. Hong Kong has only one campaign, I believe. Don't know anything about it's quality. But six or seven or even more high class scenarios for Dragonfall compared to just one - that speaks out loud enough, don't you think?   So, without any doubt Dragonfall is the best Shadowrun game for PC up to now. And having said that, I don't believe there are many games to follow. Shadowrun is a game system which definitely hasn't aged well. In a peculiar way it seems to have fallen out of time, and so probably Dragonfall will be it's ultimate legacy. At least as long as we talk about PC games ...",
            "review_score": "1"
        },
        {
            "review_text": "This game is well worth the purchase price. Great value. I got over 40 hours of play time out of it to complete it one time thru on normal difficulty. If you are a fan of table top gaming then this really captures that fealing at a high level. Dialogue is good and response choices are decent. There are multiple endings to the game as I experienced at least two of them.  There are only two minor negatives. 1) The game didn't seem to like tabing out during gameplay. 2) The variety of hand-to-hand weapons was a little skimpy, with no magical weapons at all that I found.  It will run on lower end PCs which I think is a big plus these days because some of the newer games have very high minimum hardware requirements.",
            "review_score": "1"
        },
        {
            "review_text": "This is an absolutely amazing game, I came from old school Shadowrun in the 1980s and its beautiful to have access to adventures that bring back memories again. Well done.",
            "review_score": "1"
        },
        {
            "review_text": "Shadowrun Dragonfall is my favourite Shadowrun game and I really enjoyed playing it. If you are looking for an RPG with a lot of choices a high degree of difficulty and an awesome story, then I can only recommend this game. There are a lot of different RPG Elements and you can find the 'classical' Shadowrun weapons and spells. Strategy and your choice of skills/ fellow shadowrunners matters and you get rewarded for thinking about your team mates and your own skills. Dragonfall has a unique and detailed story with plot twists that you cannot really forsee and the story is quite rewarding for those who pay attention and to those who read every text and immerse themselves in the story.",
            "review_score": "1"
        },
        {
            "review_text": "Fun times indeed.",
            "review_score": "1"
        },
        {
            "review_text": "Superb classic-style RPG.  [10/10]",
            "review_score": "1"
        },
        {
            "review_text": "If you are into Shadowrun, this is worth giving it a try. Nice and interesting story line, with interesting characters and options to evolve the story line in your own way:  + atmospheric level setting + good story line + many ways to evolve yourself and the story line  To consider: There is a lot to read. Not a minus point, as I really like it, but you won't be satisfied by Shadowrun games, if you are not into that.  - UI ist not very comfortable at the beginning - character evolution is very time expensive and doesn't give you an ongoing 'Oh my god, I'm getting stronger and stronger'-feeling   'Not a casual, mainstream, shiny 4k scale graphics game, with player pleasing functions to give you the feeling that you are almost before getting invincible - But I like it for that!'",
            "review_score": "1"
        },
        {
            "review_text": "The new Shadowrun games were the first CRPGs I'd played since Fallout 2, and this game excells in all the things I like about CRPGs: cool characters, a lore-filled world, and strategic fights.",
            "review_score": "1"
        },
        {
            "review_text": "To sum it up, Shadowrun Returns was a great game that rebirthed interest into Shadowrun and its unique world, but Shadowrun: Dragonfall polished and perfected what was missing from its predecessor. Even if you never got into Shadowrun Returns, Dragonfall is a standalone experience that is an incredible journey that I believe must be experienced.  Dragonfall has Amazing side characters with great backstories and personal missions. Its enjoyable to help your squadmates resolve traumatic pasts and save loved ones and relatives. Glory's backstory and side missions are almost more interesting than the entire rest of the game.  Shadowrun really nailed the dialog in this game. It is really immersive to be given multiple ways to say the same thing. It lets you inject your own character into the story even if the words you use to say don't change the outcome. It feels more natural than Pick A or B and the branches are obvious. It sometimes feels like a real conversation where you have to think about what to say.  Combat has been polished thoroughly throughout the game. Each level and combat experience is enjoyable. I honestly wish there was an endless combat arena in the game (but maybe there is with the amazing modding support!). The character building experience is great and dumping points into skills never feels wasted. Shadowrun Returns never gave you enough 'Karma' to fully level up your character but Dragonfall gives you more than enough (even enough to max a category and start dumping into other categories) which in the end of the game gives you a much more rounder and balanced character than the previous game.  Overall the plot is enjoyable. You go from the rookie outsider thrust into the position of leading a group of hardened runners to thier actual respected leader who has been forged with them into an amazing team in the fires of conflict and tragedy. The plot is so good it made me look up several different Shadowrun lore stories and timelines because I just wanted to know so much more about this world.   I highly recommend this game to anyone looking for either a good story / roleplaying experience or an amazing strategy game because Shadowrun Dragonfall has both.",
            "review_score": "1"
        },
        {
            "review_text": "A good story, filled with interesting characters and dialog, along with interesting combat in a great setting. If you're a fan of the setting, this is a must-have. Players into cyberpunk settings or story-driven games will find a lot to like here, but may feel like they are missing some of the flavor if they aren't already familiar with the Shadowrun setting.  This game captured the feel of the Shadowrun pen and paper RPG, which is the highest praise I can think to give it.",
            "review_score": "1"
        },
        {
            "review_text": "This is my second walkthrough of this game. What to say, game's mechanics are just beautiful and good balanced. Really interesting to play second time with completely different character of mage class. If to compare with first walkthrough that I completed with cyber street samurai, I have other dialogue options not available before, specially with teammates. Overall, very exsiting game with deep and interesting plot. I will definitely try community mods after completing it.",
            "review_score": "1"
        },
        {
            "review_text": "Great Shadowrun story",
            "review_score": "1"
        },
        {
            "review_text": "One of the best tactics RPG that I've played. It's almost if Final Fantasy Tactics and Philip K ♥♥♥♥ had a son and it's violent one.   9/10",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game, it is simple and fun while at the same time challenging. It reminds me that you don't need the best graphics and character voice acting to have a great hit, you just have to have an idea of what your doing and who your relating too and I find the devolpers didn't forget that in the slightest. Gamers like immersive stories, check, gamers like customization, check, gamers like big ♥♥♥ guns, cool characters, high tech ♥♥♥♥ and a platform that is nostalgic to use them on, check. All in all I give it 8/10. it's not game changing nor where I thought the franchise could and should be at by now in the industry but is definitely a good game.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing story-driven games for 25 years, going back to the original Deus Ex or further back to Neuromancer on the C64. Add in turn based combat, and I'm usually sold. The problem here, for me, is too much story for not enough combat. And the combat is not challenging.  The combat is improved over SR:Returns, but it's just not at all difficult, even on the highest difficulty.  There's also not enough interaction with the Matrix, especially for this type of game.  Linear, linear, linear. Again improved over SR:R with more optional missions, but still too basic. And the hand-holding is pretty extreme.  Once I started quick-scanning the dialogue, I knew the game had lost me.  If you want a ton of story with a reasonable amount of comat, this is a solid game. Just not for me, and it seems the reviews for Hong Kong also indicate an imbalance of story&lt;&gt;combat. Too bad as I want to love these games.",
            "review_score": "-1"
        },
        {
            "review_text": "- constantly missing 80-90% hits - every combat situation is the same: whole team comes trough narrow hallway, enemies have the first turn for some reason, and then the grenades come down which ALWAYS hit and ALWAYS crit - cannot manually engage combat mode to tackle the beforementioned point  other than that, great game",
            "review_score": "-1"
        },
        {
            "review_text": "It's alright. If you played the first one it's more of the same. I played the first game on my Android phone and this one on PC and it's definately a game made for smaller screens. It's a bit awkward panning around the screen to move your characters. I didn't think the story was anything compelling, unfortunately I read too many good reviews about it and had to try it, but once again like the first one it didn't really engage me as a player. It's one of those you play and forget about the next day, at least for me. Don't think I will be trying the third one.",
            "review_score": "-1"
        },
        {
            "review_text": "Love shadowrun. Loved Dragonfall. Hit bug that made game unplayable that is still not fixed. Another unsatisfactory purchase on steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Dragonfall is a greatly enhanced version of Shadowrun returns whatever aspect you look onto it. A deeper and more engaging story, more stuff to interact to, a whole town as your base, better UI, A TEAM THAT YOU OWN, 30+ hours of gameplay.   Although you have your own team, you still can't fully customize and kit them to your liking, instead you are given a simplified level-up menu on what you can upgrade to them.  Unfortunately, despite all of those, I cannot recommend this because of one single thing.   The Percentage chance feels really off.  It did quite felt off in shadowrun returns, but I didn't mind it because the campaign on it is only 33-40% of relative length compared to dragonfall. But man, you are going to get frustrated and maybe forced to save scum because of the RNG chance.   I'm not talking about the values being low, I'm talking about the expected results reflected on the current chance. I.E: 92% chance to hit, but you miss 4 out of 5 hits, are you kidding me? Also don't tell me that I need to show sample size, statistics proof yada yada, this inconsistent result happens way too often.  Also wtf is up with the loading times? I guess the places are now somewhat bigger, but holy ♥♥♥♥, like 30sec of loading?  Do I recommend this game? No for people who loves turn based strategy games. But if you want a decent RPG with decent storyline and multiple ways to build your character, get this game, but don't expect a fair gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "I have really mixed feelings about this game, and wish Steam had a 'maybe' or 'neutral' option for the recommendation. Without that, I have to err on the side of not recommending it.    The Good The actual combat is fun enough. It's turn-based strategy style. There are a good number of decisions to make without being overwhelming. The biggest of these are which of two guns to use, which special skills to use and in what order, and where to position yourself (mostly about accuracy vs defense). Whether using guns or magic or fighting through a summoned creature or drone, skills include: wide range or spread shot, stun, damage over time, armor breaking, and various buffs. Choosing which to use in which order (they have cool-down times so you can't just spam 'the best skill') is probably the most fun aspect.  The stories are complex and multilayered. The plots are amazing. And the political and philosophical aspects are deep (though easily ignored if you're just into it for the steam-punk-ish fantasy).   The Bad The stories are almost entirely told through walls of text. There's no animation, no voice acting, minimal cut scenes, etc, to tell the story for you. And even when story could be told through gameplay itself, it's done through more pop-ups to read. (For an idea of what I mean, think of games like Dragon Age or Skyrim, where you find books that explore the lore and history of the worlds. In this game, the whole story is kind of presented that way, not just the lore and history).   The cash and shop system is pretty lame. You only purchase things for your main character, so the vast majority of shops and goods just get in the way (eg. if you're a spell-caster you have no interest in the summoning totems, guns, drones, spirit magic, implants, hacking tools, etc). It'd be great if you could purchase gear for your team as well. On top of that, it mostly feels like you're just buying upgrades, rather than choosing different gear for different strategies. There's a little bit of the strategy thing (like stun grenades vs direct damage grenades), but it's really minimal, and the upgrades are too essential to waste what tight money you have on optional things anyway.  The decking/hacking/matrix aspect seems like it should be the most unique aspect to the game... but it's just simplified version of the usual combat. Same effects, same strategies, but only one character, fewer abilities, and simple graphics. It really should be some unique kind of minigame; or at least involve a very different style of combat.  There is little or no point to exploring. All that happens if you explore is: you wait a minute for your character to run to where you want; you see a white magnifying glass icon; you click on it and get a useless amount of money or low level healing pack. That is, you don't uncover interesting enemies, side plots, unique items, secret areas, mini-games, etc.    All in all, I enjoyed the game while I was playing it, but when I wasn't playing it I had no drive to hurry up and start again.            ",
            "review_score": "-1"
        },
        {
            "review_text": "(I have mostly played this game in offline mode, that's why the review only says I've played the game for a minute or something.)  The awesome: -Storyline, lore, and amount of content is well-thought out and I can definitely tell that's where the bulk of the effort was. -Non-fixed class system - build your character however you like. Of course it means that it's easier to make an inviable character, but with great power comes great responsibility. -Your squad has personalities and you can talk to them. If you liked the recruitable teams in Dragon Age or Mass Effect, you will also like your Shadowrun squad.  The good: -Nonlinear - some missions have several paths through them, and there is a central hub where you can take your choice of missions. Your choices have consequences on the storyline, for people who like continuity and immersion. -Techno/cyberpunk soundtrack reminiscent of Deus Ex. -Wide variety of items, some with unique powers and skills.  The bad: -The store page lied about the amount of disk space required - it requires over 6 GB, much more than the listed 2 GB -Shadowrun attempts to be overly dark/gritty/mature when it doesn't need to be. Are the devs going for an ESRB M rating or something? -Shadowrun attempts to be somewhere between a near pen-and-paper RPG and a near tactical/action RPG - in practice ending up at a bad spot in between those and succeeding at neither. Skill and attribute checks are binary - for example 'if you have this conversation skill or at least this number in a skill, go ahead, otherwise find another way around' instead of a d20 system where you have Difficulty Class checks - an unskilled character might luck out on rolling a 20. On the other hand, the turn-based combat doesn't fit tactical action very well - cover is usually unreliable and there aren't enough indicators of where you would be covered from in a given location. Also if you misclick, there's no 'revert move' button - the most you can do is wait 20 seconds to reload your save (see below). -When you get codes for locks, terminals, and doors, the game doesn't automatically display them while you are interacting with the lock/terminal/door. This would be a very helpful feature to have (Deus Ex: Human Revolution has it. The original Deus Ex doesn't, but that's OK because it has a UI that actually responds when you click on it). -Opaque leveling system. There's no visible experience meter, recruitable character level-ups are unpredictable, and skill points are earned from mission objectives instead of from enemies. Deus Ex: Human Revolution had a much better experience point system balancing rewards for defeating enemies (particularly in skillful ways) with rewarding alternative solutions (such as crawling in air vents or stealth)  The intolerable: -The entire game lags badly. My computer isn't a power-gaming machine, but it handles big budget/big publisher premium games like Elder Scrolls V: Skyrim, Mass Effect 2, and Deus Ex: Human Revolution just fine. On the other hand, Shadowrun: Dragonfall lags. Really badly. On par with a bad Ubisoft console port to PC. As in taking 12 seconds just to exit the game normally, 20-24 seconds to load a game (from a solid-state disk). The game sometimes just slows down to 8 fps randomly and frequently. Combat gets boring having to watch characters run to various places and there's no 'skip animations'. -The UI is crap. There's no documentation or list of keyboard shortcuts. Bringing up a menu forces a 2 second wait for the menu to pop out instead of actually just giving me the darn menu when I ask for it. (and yes, the UI lags as badly as the rest of the game) Sometimes in combat, things that you may need to click on randomly become unclickable. I get the impression that Shadowrun: Dragonfall was originally built for tablets and then given a low-quality, no-optimization port to PC. -The game sometimes crashes (and screws up my resolution). There was also one instance where the AI got stuck in an infinite loop while taking its turn and I had to reload my game. -Skills, abilities, and mechanics are generally poorly documented in-game. Special attacks have no indicator of how many action points they consume. When buying abilities and items in a shop, the descriptions often run out of space and there's no way to closely examine an item before buying it. Some items give extra abilities and skills, yet there's no way to tell what you're getting short of actually bringing them into a fight.  Overall: Shadowrun: Dragonfall is a diamond that's so rough that you need to handle it with gloves to avoid getting cut. There's a lot of good in it, but it's held back and ruined by numerous game-breaking problems. It's a shame to have to give a game that could have been excellent a thumbs-down, but there are just too many design problems, technical faults, and other flaws to recommend this. It's also a shame that Steam's review system forces you to give a thumbs-up or thumbs-down with nothing in the middle, because this game deserves a 'Mixed' review more than almost any other game I know of.   Should you get this game? -If you're a big fan of the Shadowrun world, enjoy immersive RPGs where your choices matter, or RNG-heavy RPGs (and also have a high tolerance for technical problems and overly slow games), then I would suggest that you buy it at a deep discount (at least 2/3 off the regular price). Otherwise, it isn't worth your time or your money. -If you're just looking for a cyberpunk-themed game (not specifically Shadowrun), then just get Deus Ex... because Shadowrun is like buying an orange soda and getting seltzer water with a hint of lemon and lime peels instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought the game to play on tablet. Started on hard difficulty. Was intrigued at first, new world and lore for me but battle mechanics are fun at first but then become stale. Never played any Shadowrun games, wanted to be a stealth character. Read the descriptions of all the classes and went with Decker. Picked Assault rifle for my weapon. Invincible in the Decking world once I got the heal+shield+%25 accuracy abilities. Invincible in the meatworld too, assault rifle one shots a majority of enemies. The Shaman NPC character gives you some pretty great buffs for you to cheeze with. Story really wants you to care about some character named Monica.. since I don't know her and only met her for 2 minutes, I do not care about Monica. Walking around in circles gets tiring. I did obtain a cool pistol early on that AoE stuns, maybe there are more rare weapons to be found but I only found one. Decking is a really boring RNG simulator. Can't rotate the camera which really irritated me. Many mis-clicks until I set double click to confirm in the settings.   I didn't want to give this game a total thumbs down but rather a thumb sideways.. or a meh. I did enjoy it for a while. Maybe it was the anticipation of more loots and unlocking abilities that kept me going tho, once I maxed my character I got bored. TLDR: You may like it. Assault rifle is OP, Turn on double click to confirm actions.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't read this and think that this is a terrible game. It's not. It does have a sort of niche appeal, but it's not bad by any means. However, it certainly does NOT deserve the 'overwhelmingly positive' score. It should be very positive at best, mixed at worst.  There are three major problems I have with this game.   1: The frustrating glitches. There is a late section of the game which represents one of the best designed tower defense sections I've ever come across, where you are protecting the AI, APEX. Or at least it would be well designed if it weren't for the fact that it contained no less than two run ending glitches. First, if you try to save during the later stages, it will immediately crash and the save will fail, forcing you to start over. Secondly, when you 'die' in the matrix, you are expelled and take damage to your physical body. However, in this mission, you are accompanied by an AI that has no physical body, so, if they die, the game will get confused and just...stop, so you have to restart from the last save. If you think this isn't too bad, then listen to this: I had to restart this section no less than NINE TIMES because of these bugs.   2: The music. God help me the music. It is undenyably good, but it loops. And it loops. And it loops. When I got through the first few chords of the hub town music, I realised that the sound design was pretty good, but lord above was it going to grate after a few minutes of it endlessly repeating. I have never been so right, and you will end up spending several hours in the hub town, stuck either with this never-ending music loop or cold silence as you mute it.  3: The story should have been good. It really should. The setting is imaginative, and the characters often threaten to become interesting. BUT. It is sooooooo badly told that it doesn't even matter. Everything, from the opening of doors to standard dialogue to the deaths of major characters, is communicated in massive text walls. Of the time I spent playing this, I would guess that at least a third of it was spent reading over-long, irritating blocks of text while the bloody music loops in the background. I don't have a problem with reading. Communicating in nothing but written words is fine. But keep it short and snappy, a sentence or two per text box. Not an entire chapter with every dialogue, though this is rather ironic coming from my mouth, seeing the length this review is turning out to be.  As I said, this is by no means a bad game. It is a game with many brilliant ideas, with a fascinating setting that, despite trying its hardest to make dragons boring, makes me interested in the ploys and backstories of the characters. I like how the choices you make can sometimes make some sections easier later on, or come back to bite you in the backside. One nitpick here is that some missions are locked off if you annoy a certain company, which struck me as rather stupid, but it doesn't really affect the game all that much, so I won't dwell on it. The combat is akin to that of XCOM, and is certainly more expansive than that in XCOM EU, but, for reasons I can't quite put my finger on, it doesn't quite feel as polished. The game also drags on for a little too long in my personal opinion, and combat isn't particularly balanced. Pistols and SMGs are basically just inferior versions of the assault rifle, magic missiles and throwing weapons are just trash, so there is literally no reason to use them. This makes the characters that default to pistols, SMGs or throwing weapons straight up inferior to those who use shotguns or rifles. Also, decking isn't particularly well tutorialised, or tutorialised at all, but I'll let it slide because there is literally only one point in the game when you are forced to use it, as mentioned above.  The game includes some brilliant puzzles and complex moral choices, characters you sympathise with and characters you want to punch in the face, an original (if somewhat predictable) storyline and setting and meaningful RPG elements. If you belong to the niche crowd that thinks this excuses the innumerable flaws with the game, then go ahead and check it out. Just remember to mute the bloody hub town music or it will soon be stuck in your head for the rest of the week, no matter how much you want to pry out the memories of it with a fish slicer, Otherwise, spend your money on more polished games like XCOM or Mass Effect, which both seem to have inspired this game to a certain degree, and accomplish much the same things much better, though with less style and originality.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't listen to the bad reviews of this game, it's simply amazing. I have far more than 8 hours on record, because I play offline frequently. I loved the characters, the story, the combat, and of course the great Shadowrun theme. I don't doubt that some people have game freezes, but I have not, and I'm playing on a laptop with Intel graphics running Windows 7. Have not finished the game yet, but I'm getting close to the end I think. If you want a good Cyberpunk game, and have already played all the good Deus Ex games, it's hard to go wrong here. I always loved the Shadowrun tabletop game, but could never find anyone to play, and this really scratches the itch. 10/10 from me, and I am literally baffled at the 75% 'recent' positive ratings. This game is WAY better than that. If you like Cyberpunk games, and there are not that many good ones, give this a try. Looking forward to playing Hong Kong after this.  Edit - Well, I finally got bit by the combat freeze. Spent three tries and about 2.5 hours trying to beat Apex Rising, and rifht after I finally beat it... Freeze. Eff. That. Crap. I love this game, but that's just too much for me, especially since I've read the save freeze problem happens again after this mission. I'm lowering my rating to 7/10 and not even finishing it since it looks like I may not even be able to. I'll just watch a let's play. It's really sad they didn't fix this since so many reported it already. Can't recommend it now since it seems like so many people have had their time wasted with something the devs should have fixed by now. Not playing Hong Kong, or any other game from these guys now.",
            "review_score": "-1"
        },
        {
            "review_text": "This may be enjoyable if you enjoy playing games where you're just along for the ride, but frustrating because none of your in-game decisions actually matter. 100% of major events play out the same regardless of what decisions you make, and a few lines change in the epilogue. Great world, great characters, but only offers the illusion of choice. Finished the game unsatisfied.",
            "review_score": "-1"
        },
        {
            "review_text": "Story 7/10 Gameplay 2/10   This should just be a book. Horrible gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Way too buggy for how long this has been out.  Cover doesn't apply on the side you have cover, accuracy values mean nothing.  It's a shame, because the writing is fairly good but the actual gameplay is undermined by ♥♥♥♥ mechanics.",
            "review_score": "-1"
        },
        {
            "review_text": "Very disappointed. After DMS, I expected a top-level plot and improved gameplay. Instead, the plot is generic and boring, and while character progression is visibly improved, combat has turned from easy-but-satisfying to still-easy-but-helluva-tedious due to HP sponges. I'm talking very hard difficulty of course. Also, the idea behing hiring runners is kinda completely lost, as you get your team for free.  Just... WTF?",
            "review_score": "-1"
        },
        {
            "review_text": "Weak gameplay/mechanics.",
            "review_score": "-1"
        },
        {
            "review_text": "75% chance to hit = No chance to hit",
            "review_score": "-1"
        },
        {
            "review_text": "Both Shadowrun games suck! The game does not give you enough credits to play. You have to make a chose of either equiping yourself or saving every single cred to hire a team which is outrageously expensive. To top this off, the game likes to give you weak companions (can't deal damage cause they miss and can't take damage cause of low armor and HP) and then swarm you with up to 10 enemies at a time. I deleted the game after two days as being un-winnable",
            "review_score": "-1"
        },
        {
            "review_text": "Urg. This game was not fun. The story was boring, so it didn't even have that going for it. The combat was ♥♥♥♥♥♥♥♥. I ended up cheating (aka killing everything with one word), just to get through it. I honetly haven't even finished it. I literally have just the end run left to do and I have no interest in it. Yuck.",
            "review_score": "-1"
        },
        {
            "review_text": "Didn't like it. For a story-driven game there wasn't enough to make me interested in what was going to happen. I refunded it instead of forcing myself through it. Hadn't played any other Shadowrun games fyi, just wanted to try this due to all the positive reviews it got. I got SR:HK after refunding this though and I am liking the story quite a bit.",
            "review_score": "-1"
        }
    ]
}