{
    "app_id": 301150,
    "name": "The Treasures of Montezuma 4",
    "release_date": "2014-05-16",
    "developer": [
        "Alawar Entertainment"
    ],
    "publisher": [
        "Buka Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Commentary available"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Match 3",
        "Indie"
    ],
    "achievements": 32,
    "positive_ratings": 318,
    "negative_ratings": 58,
    "price": 4.99,
    "description": "Free the gods’ powers and fulfill your destiny in the Treasures of Montezuma 4! This new match-three game is overflowing with mystery and excitement!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/301150/header.jpg?t=1518597843",
    "minimum_requirements": "OS: XP/Vista/7/8 Processor: 2.2 GHz processor Memory: 256 MB RAM Graphics: DirectX compatible 128 MB DirectX: Version 9.0 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The Treasures of Montezuma 4 is a casual Match 3 game from Russian Developer, Alawar. Despite being a match 3 game The Treasures of Montezuma 4 does have a story behind it. You play as Anna, an adventurer who has gone to an ancient Aztec ruin with the aim of uncovering the ancient secret of Emperor Montezuma.  While I'm not usually a fan of this kind of game this is one of the few Match 3 games I have really enjoyed playing.  +Great graphics and loads of nice visual effects +167 levels to play through +Completing each level within certain time limits will earn you a bronze, silver or even gold medal +Some cool bonuses to unlock and upgrade with the coins you earn in-game, the higher your score the more points you earn which change how the game plays +Levels get progressively harder at a good rate +Lots of replay value if you're a perfectionist and want a gold medal on all of the levels +You can level up all the way to level 100 +Three different game modes to enjoy: Story mode, Puzzle mode and Quest mode +Super addictive +Great music +Steam achievements and Steam Trading Cards  +/-Your success in a level often depends on luck of the draw, if you're given a bad board layout to start a level chances are you aren't going to do particularly well, personally I wasn't too keen on this but others may not mind  -Story isn't overly interesting -Not too many graphical options but that's just a minor issue  Verdict: 7.5  A fun casual Match 3 game with nice graphics, loads of levels to play, several bonuses to unlock and good replay value, you should definitely pick this up if you're a fan of Match 3 games or just looking for a casual experience.  ***This review was written using a Key provided by the Publisher for review purposes***  El K.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic match-3 title with as many varieties of mode as anything I've ever seen, the ability to bling out a ziggurat, and ARSELOADS of content and goals to meddle with. When I was gifted this, it was with the phrase 'Better than Bejeweled 3' - guess what, he was right. Also has a Quest mode akin to some of the one-off weirdness in BJ3 so yeah, got everything the 'reigning champion' does and then some.  Not convinced yet? This game features a match-3 endboss battle vs. Hernán Cortés, who escaped into an Aztec portal centuries ago and somehow became a magic-hurling werewolf. You must immolate him before he can return to our world.  I MADE NONE OF THAT UP. I LOVE THIS GAME.",
            "review_score": "1"
        },
        {
            "review_text": "Got this game for 0,62 € on sale and it was worth every cent. First when I started it, I was flashed by the Intro; beautiful story, ok graphics, beautiful music.  Levels are entertaining, some are quite challenging and some additional rewards motivate to keep playing even after finishing the main story. Gameplay is action-packed with cool sounds and flashy visual effects, which makes it pretty fun. I can recommend it and I think it would be also worth its usual price of 6,99 €.",
            "review_score": "1"
        },
        {
            "review_text": "This game teaches you that plain random is stronger than your bestest efforts.  10/10, more important life lessons in casual games.",
            "review_score": "1"
        },
        {
            "review_text": "pretty average match 3 game but makes up for it with variety.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting and nice story. Another mods (quest and puzzle) Collection of objects. Ziggurat - improving. Gorgeous graphics. Entertained for hours. Never end.",
            "review_score": "1"
        },
        {
            "review_text": "totems are red  totems are green  totems are purple   totems are orange   this game is epic 5 star rating",
            "review_score": "1"
        },
        {
            "review_text": "I was a huge fan of the treasures of montezuma 3, and when I saw this game I was excited. Unfortunatley this game does not deliver. It tries to be inovative with new game modes but they are not carried out well and a few of them are too similar to each other. This game is also a terrible pc port there are no graphics or res options and the sound bugs so the same two seconds of the song repeat over and over unless you exit the game entirely.",
            "review_score": "-1"
        },
        {
            "review_text": "can't get the game to pull up in steam to play",
            "review_score": "-1"
        }
    ]
}