{
    "app_id": 301320,
    "name": "NoLimits 2 Roller Coaster Simulation",
    "release_date": "2014-08-21",
    "developer": [
        "Ole Lange"
    ],
    "publisher": [
        "Mad Data GmbH & Co. KG"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "VR Support",
        "Steam Workshop",
        "Partial Controller Support"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Realistic",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 402,
    "negative_ratings": 43,
    "price": 27.99,
    "description": "NoLimits 2 is the ultimate roller coaster simulation that lets you experience authentic roller coaster thrills. Climb into the world's most famous roller coasters and experience the excitement in real time. Or design a new roller coaster that is engineered to your specifications.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/301320/header.jpg?t=1526128910",
    "minimum_requirements": "OS: Windows XP with Service Pack 3 Processor: 2.4 GHz Dual Core Memory: 2 GB RAM Graphics: DirectX 10.0 hardware required (&gt;= Shader Model 3), min 512 MB VRAM, older DX9 cards (ATI x1000 series, GF 7000 series or older) not supported DirectX: Version 9.0c Storage: 2 GB available space Additional Notes: Good graphics card is very important. Some integrated graphics solutions might be too slow. Install and try out the demo from Steam if you are unsure whether your computer meets the requirements. For VR experience: Oculus Rift DK2/CV1 with runtime 1.3 is required. OpenVR support for HTC Vive using SteamVR.",
    "recommended_requirements": "OS: Windows 7 or newer (64 Bit OS strongly recommended) Processor: 3.2 GHz Quad Core Memory: 4 GB RAM Graphics: DirectX 11 hardware or newer (&gt;= Shader Model 5) and with 1 GB or more VRAM DirectX: Version 11 Storage: 2 GB available space Additional Notes: GeForce GTX 550 or AMD Radeon 7750 or better recommended. For VR experience: Oculus Rift DK2/CV1 with runtime 1.3 is required. OpenVR support for HTC Vive using SteamVR..",
    "reviews": [
        {
            "review_text": "EVERY person who even remotely enjoys roller coasters should AT LEAST give the demo a try, and then decide whether buying the full sim is a good idea.  For me personally, as a long-year NoLimits fan, with hundreds of hours spent in the editor, it was a wise decision getting this. I'm happy now. :)  Stop reading this and download the demo, NOW!",
            "review_score": "1"
        },
        {
            "review_text": "No Limits Roller Coaster 2 is the ultimate roller coaster simulator in my own opinion! The editor features a built-in g-force calculator which is useful to shape the track correctly, and the track is easily smooth with the depump vertices tool. The simulator is really well done, the graphics are stunning and the rider view effect is very realistic. The possibilities are basically infinite!  One with skill could with some effort create their own Leviathan with the same high quality as the professionals. It however requires time and patience to create the perfect layout, but the result outcome is worth it. I've rode so many times the first roller coaster I've made because you feel like you are actually riding it! Creating supports is a little time consuming but you can actually save time by creating your own support prefabs.  Obviously, this software is considered as a game only for roller coaster lovers. Otherwise, you better play Roller Coaster Tycoon games if you prefer the money/human management.",
            "review_score": "1"
        },
        {
            "review_text": "I have been using No Limits software for almost 10yrs now, and I would highly recommend this software to anyone who is willing to learn and understands that. A - This is NOT A GAME, its a simulation and software, and B - It has a very steep learning curve. If you've never used this before you will spend hours learning the software.   However, once you learn, this becomes an addiction that is hard to kick. Constantly improving your rides, building new rides, making parks, and sharing your creations with the fantastic community.   So basically Pros: -Incredibly powerful software -Addicting to use -Fantastic community -Incredible graphics engine and physics -Limitless creativity  Cons: -Steep learning curve -Not for everyone -Heavy program to run ",
            "review_score": "1"
        },
        {
            "review_text": "You don't really need a graphics card most of the time, so thats always nice if you're stuck with a PC from Best Buy. (Never Again!!)   Also, the Workshop, there's a few small community Issues..  1. NOBODY ever votes often enough to have a rating show up on an item..  2. Most items that get posted are usually parks with little detailing done to make them more appealing. 3. People downvote WAY, WAY too often, and they don't bother to read descriptions most of the time! GAH!  Other than that, the Community is awesome..  If you like spending lengthy amounts of time playing one game or just playing with a simulator, I recommend.",
            "review_score": "1"
        },
        {
            "review_text": "i ran around 7 roller coasters before i felt like taking a virtual reality hurl if you love roller coaster simulators this in my book is the best of the best its a great show your freinds goto game. dont let the price stop you from getting it. its bit expensive for what it is but hey you cant leave this world with money so take advantage and enjoy this awesome experince 10/10 for roller coaster simulator!",
            "review_score": "1"
        },
        {
            "review_text": "I mean, how do you review this? It is by far the best coaster designer/simulator on the market, and has been for quite some time. So if you want a coaster designer/simulator, there is no other reasonable choice.",
            "review_score": "1"
        },
        {
            "review_text": "Only played this a little bit... I mean it's okay... I guess.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game/sim if you wish to further your architecture skills concerning the roller coaster industry. the controls are a bit hard to get acquainted to, but once you do, it becomes easier.. I recommend this game to all who like the roller coaster tycoon games (RCT3 and below). Ole lange does a good job with the renderings, but they need to give the proper credit to the parks their pre-made coasters are in.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. The potential of this game is unmatched to this day, with it's realism, attention to detail, scripting and modelling abilities and physics blowing any other simulator way out of the pond. You can find yourself deciding to go on here for 30 minutes, and end up being on for 3 hours! Even without any 3D modelling or scripting knowledge, the wealth of in game scripts and items means you can create anything! The coaster styles are so real, and the graphics really blow you away. Maybe you're not into creating, or not that good (Although practise makes perfect) you can go onto the workshop and access all the amazing creations by others! The smoothness of the coasters as well outbeats Planet Coaster by a mile, and is yruly unparalelled. Wether you are a thrill-seeking enthusiast, or you saw this off youtube, it's fun for everyone!",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly fun to B-hop in.",
            "review_score": "1"
        },
        {
            "review_text": "Very good simualtor. Unmatched realism. A must buy. It requires some skill to build a coaster, but simply watching a tutorial or something can help",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to give a positive review on this game, but I am not a fan of it. It depends on your skill, me being me, I just mess around which is actually quite fun. However, when it comes to wanting to make a smooth, exciting realistic rollercoaster, it becomes difficult. Very difficult. This game is very time consuming in the way that it takes a long time to create a rollercoaster. You do get a feeling of accomplishment when you make a perfectly smooth coaster and it is the closest thing to building a rollercoaster virtually. It requires patience and skill to not get bored of this game. I don't have either of these. I'd play it every now and again, but not all day every day. The actual state of the game is brilliant. I haven't come across a single bug, corruption or actually any issues at all other than my stupidity. Very neat and professional, finished and generally a really good game. Just be prepared to get bored of it if you're not the best coaster creator. It is harder than I expected. It is hard to create a smooth track, there's a lot of trial, error, deleting parts and rebuilding. If you REALLY want it, get it. If you don't really mind, don't bother. I would rate it: 9/10 for state and performance, 5/10 for coaster building because of the difficulty and 9/10 for simiulation (when you go on the ride). It's very impressive, just I regret buying it simply because I'm terrible at building on it.",
            "review_score": "1"
        },
        {
            "review_text": "Realistic and graphically beautiful, nothing else comes close!",
            "review_score": "1"
        },
        {
            "review_text": "This is a must own if you have an Oculus Rift DK2 It is the simplest game to launch in the rift as it auto-detects it and does everything for you. It creates a very intense, real sense of presence and feels pretty close to the actual thing, espically with a chair that can move around a lot. It's a lot of fun, and great game to show people who are knew to the rift.  I bought this full price at $40, and I've technically only got 2 hours play tie out of it so far... but it feels very much worth it. There's no microtransactions for tracks or trains or anything, so that up front price is all you ever have to pay. There's a workshop so there should be a steady flow of new coasters to try.   Cons: There's some clipping with the seats but it's avoidable and ignorable. Some of the rides are a little TO intense. I wish there was an 'intensity' scale, like, 1-5 so I could know what I am getting into... But, just have someone who cna handle the intense ones try first. After about the 4th time you ride one you start to get bored of it, and it starts to loss it's 'effect'  I guess your brain starts to predict it? Offset by free workshop so not a big deal.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing experience with Oculus Rift DK2. The VR implementation is perfect. Everything life-size with lag-free head tracking. A variety of roller-coasters with more available free from the steam workshop. Surprised to see FPS theme parks included where you begin on foot and can walk from one ride to another. Some tracks have weather FX as well with rain/snow.  Very good and the world's best coaster sim!  Now with Vive support! Great to see the devs supporting HTC Vive!.",
            "review_score": "1"
        },
        {
            "review_text": "Takes a while to learn but is a stunning game, there really are no limits",
            "review_score": "1"
        },
        {
            "review_text": "Does what it says on the tin.",
            "review_score": "1"
        },
        {
            "review_text": "Oculus Rift or not this game is straight fun... Editor can be a little confusing at first to understand. But once you get into it man cna you do some awesome things. If your are super bored at other games this game is a for sure grab... even if you dont have a VR you can still build some pretty sick coasters.",
            "review_score": "1"
        },
        {
            "review_text": "Aesome simulation, one of the best out there that does'nt crash!!! Coaster building is hard at first but after making a few then I got into scripting and really like what you can do with it. AWESOME GAME",
            "review_score": "1"
        },
        {
            "review_text": "Unfortunately I can only chose between Yes and No. Therefore...  THIS IS &gt;&gt;ONLY&lt;&lt; A REVIEW OF THE VR COMPONENT  On the basis of me buying it solely as a rollercoaster VR experience (for the Rift CV in my case), I can only say No. I am sure it is a great game otherwise, but if what you want out of it is the same as me, then you have to be certain you have a cast iron stomach. If you do - great, go buy it now! There's a lot of VR experiences I can handle, but there are also a lot that make me sick if I'm not careful. If you like me need to be a bit careful and can't just take it all, I would not for a second recommend this game. I tried around half of a simple, straightforward, up and down rollercoaster ride (maybe 30 seconds) before I was sweatting profusely and had to tear the headset off to keep from throwing up. It should be said that I LOVE real world rollercoasters. Up, down, corkscrews, loops, twirls I've done them all and love them in real life... but in VR it would seem I just can't handle it. The high speed turns with no mitigation or control are just too hard. You can see this as a review of VR rollercoasters in general, from the point of someone who has some problems with VR nausea. Not more than most of my friends who has tried my Oculus though. I don't believe this is a particularly poor implementation, which is why I mention it as a general thing.  Reviewing VR is so very difficult, because there is such an intensely physical and individual component to the experience. So all I'm saying is Caveat Emptor: VR Buyer Beware.   TLDR; Purely from VR standpoint probably stay away from rollercoasters in general, unless you have no issues with simulation sickness ever.    PS: I feel super bad giving the devs a 'No' because of something they can't control. But it's still important info for potential buyers. How we discuss and review VR games are some of the issues we'll have to iron out as VR matures.",
            "review_score": "-1"
        },
        {
            "review_text": "Good but way too expensive.",
            "review_score": "1"
        },
        {
            "review_text": "So I have used this for almost one year now. It has worked great up to now, but now as soon as I open the application it has an error message. 'Stack Overflow Detected' I have emailed support multiple times with no response, and I have uninstalled and reinstalled this 3 times trying to fix it.",
            "review_score": "-1"
        },
        {
            "review_text": "Don\\'t buy it. It\\'s not a game.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a fantastic horror game. Gameplay is top notch, very scary, very fun. However, this game lacks from a technical standpoint. FPS dips into the 40s are frequent, and my GTX 970 rarely is utilized above 35% according to MSI Afterburner. Still, this is one of the best horror games I've ever played. I've yet to beat it and I've tried well over 20 times. Well worth $17.99.",
            "review_score": "1"
        }
    ]
}