{
    "app_id": 301360,
    "name": "Kill Fun Yeah",
    "release_date": "2014-05-30",
    "developer": [
        "Arctic Anteater"
    ],
    "publisher": [
        "Arctic Anteater"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 36,
    "positive_ratings": 37,
    "negative_ratings": 53,
    "price": 6.99,
    "description": "Kill Fun Yeah is an online 2D platform shooter. Murder and capture your way to the top, using an ever increasing arsenal of silly weaponry and items, the powers of deflect, attract and freeze, as well as various powerups.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/301360/header.jpg?t=1447361870",
    "minimum_requirements": "OS: Windows Vista or later Memory: 1024 MB RAM Graphics: 512 MB Network: Broadband Internet connection Storage: 100 MB available space Sound Card: OpenAL Compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The game is great! You can build up walls to defend your base, do some nice moves by reflecting projectiles and there are a bunch of hilarious weapons!  But I simply can't recommend it because most servers are empty, and there are barely any players online.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game shooter multiplayer, great music, With friends can be fun, this game sec but not for long :), just a little bad that playing this game 0 player servers. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "How do i activate they key pls help",
            "review_score": "1"
        },
        {
            "review_text": "I bought this thinking there would be a large community all ready playing it. I was so worng. It took forever to even join a game and when I did there were two players for a 10 player map.  The game idea is great but its just not worth it if you expect this to be a large community.  Also after buying the game I only got 1 hour of actually play time before I had to pay agian so because of this its a negative review.   Just don't buy this game. ",
            "review_score": "-1"
        },
        {
            "review_text": "It seems like a really nice game and I would gladly recommend it, but the thing is there is 0 players on the servers. And when I say 0 I mean NOBODY! Really dissapointing, the developers should make it known that no one plays the game and at least make a singleplayer campaign or just remove the game from steam. It has potential but at the moments it's useless. I hope that changes in the near future because it seems like I've spent 8.99€ for a multiplayer game with no players.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Want to play? Too bad you cant even register with gmail since it fails every time.",
            "review_score": "-1"
        },
        {
            "review_text": "Unbalanced cancer",
            "review_score": "-1"
        }
    ]
}