{
    "app_id": 301460,
    "name": "Electronic Super Joy: Groove City",
    "release_date": "2014-06-06",
    "developer": [
        "Michael Todd Games",
        "Yazar Media Group LLC"
    ],
    "publisher": [
        "Yazar Media Group LLC"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Platformer",
        "Action"
    ],
    "achievements": 8,
    "positive_ratings": 459,
    "negative_ratings": 104,
    "price": 2.99,
    "description": "A Giant Robot Stripper called JoJo has smashed Groove City! She's angry because Dr Swinger stole her Laser-Nipples! Help JoJo reclaim her Laser-Nipples &amp; defeat the Evil Plans of Dr.Swinger, with the help of Pope Boris the Super Sexy!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/301460/header.jpg?t=1447361872",
    "minimum_requirements": "Minimale : Système d'exploitation : Windows XP Processeur : Intel Dual Core or Equivalent Mémoire vive : 1 GB de mémoire Graphiques : DirectX 9 compatible video card DirectX : Version 9.0 Espace disque : 150 MB d'espace disque disponible Carte son : On-board sound",
    "recommended_requirements": "Recommandée : Système d'exploitation : Windows XP Processeur : Intel Dual Core or Equivalent Mémoire vive : 3 GB de mémoire Graphiques : DirectX 9 compatible video card DirectX : Version 9.0 Espace disque : 150 MB d'espace disque disponible Carte son : On-board sound",
    "reviews": [
        {
            "review_text": "A friend gifted me this. Played it once, and my father was nearby. He heard everything.      I secretly hate him now.",
            "review_score": "1"
        },
        {
            "review_text": "It says laser-nipples 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A great expansion to the original game, same awesome gameplay, secrets added, robots, lazer nipps, butts. If you liked the original game then you'll love this.",
            "review_score": "1"
        },
        {
            "review_text": "After 10 years since the evil Groove Wizard has stole your butt, you return back to Groove City, where the Groove Wizard had previously ruled with great power and corruption. Groove City has been rebuilt by the Boogie Brothers, and everything was wonderful until Dr. Swinger stole JoJo the Robot Stripper's Laser Nipples. Here, we enbark on a journey with Pope Borris the Super Sexy as we take down Dr. Swinger and retreive the Laser Nipples.  The platforming mechanics are really spot on. If you come here from an intense Electronic Super Joy background (You played the first game), the controls make you feel right at home. Even though it is shorter than the original Electronic Super Joy, I find the difficulty much harder than the original (Ol' Ball and Chain ain't got nothin on this). I find myself missing the 'Slam' ability, because I use it for much more than taking out enemies. I use it as a stablizer when I'm going to fast, or to immediately land on a platform. I miss this mechanic, but the game itself is wonderful.   EnV is back with his amazing soundtrack, and I have to say, I can't stop playing this game to listen to the music. Sometimes I just launch the game, sit on a certain level, and listen to the music and not move. It's that good.  The only complaint I have about this game is that it's too short.   Speaking of soundtrack, the store description describes of including EnV's new EP and the game OST in the game. It was actually a marketing text mistake, for the EP realeases in several days as a separate DLC. Do not let that throw you off, haha. It already thrown a lot of people off.",
            "review_score": "1"
        },
        {
            "review_text": "The sequel to probably one of my favorite games of all time. It has a great soundtrack, is fun to play and worth $5.00. Only about an hour of gameplay, but it's expanded with acheivements + the level editor. It's good for a $5.00 game, without a doubt.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "A very hard platformer but a very fun game. A very good plot while still playing good non-stop action(I got all of the stars achievements, and secrets in one gameplay :D). 10/10",
            "review_score": "1"
        },
        {
            "review_text": "You can't stomp.  0/10",
            "review_score": "1"
        },
        {
            "review_text": "The game is just great, and the songs are awesome. I hope there will be a third part of this game. Thank you, for making such an interesting game.",
            "review_score": "1"
        },
        {
            "review_text": "This game had me at tentacles!...  The humor is FABULOUS and the music is UBER phenomenal! @_@   ",
            "review_score": "1"
        },
        {
            "review_text": "Very hard, very fun! Music is amazing, some camera issues here and there, but overall definitely more than worth the money",
            "review_score": "1"
        },
        {
            "review_text": "A short expansion on the original ESJ. Pumping beats, flashing visuals and hardcore gameplay...it's all there. Just make sure you know this is not a sequel but a short (but focused and well-made) one hour-ish expansion to ESJ.",
            "review_score": "1"
        },
        {
            "review_text": "While not as diverse and and fleshed out as the base game, Groove City is a fantastic mini-sequel that offers a lot of content for such a small package. Unlike the previous entry, the game is very much your basic platformer, and does not have any buttstomping, gravitational changes, or the like. However, this helps refine the game itself, and the challenge is not nearly as daunting yet just as enjoyable.   Of course, Groove City is every bit as challenging, but the challenges are purely of platforming prowess, and there are plenty of secret areas that once completed can unlock further bonus levels with even more kick than the main missions. It's not that hard to miss a lot of them, and at a little less than two hours I have finished all the main levels, found a good few secrets, and only managed to unlock two of what I believe is a possible secret levels. That and the now implemented score system adds a lot of replayability for those who don't find the game hard enough.   On top of all this, Groove City comes packed with a level editor, and if you're the soul who loves ESJ and wants even more, you can make to your heart's content. The level editor is fairly well contructed, and it did not take me too long to construct a few basic levels, so definitely check it out if that's you're thing.  All in all, Groove City retains all the charm of its predecessor and adds a lot in exchange for what was taken away. Definitely pick this up if you're into the immense charm and challenge that this series offers.",
            "review_score": "1"
        },
        {
            "review_text": "I was quite exited to get this game, the sequal to the fantastic Electtronic Super Joy.  Cons first, pros last.   So far, in the 24 minutes of this game, I am very dissapointed. After 13 minutes, the music stopped playing, and then three minutes following, all of the audio stopped. Half of the fun of the first game was the soundtrack, and the sound effects. This game apparently broke that. By no means am I saying this is a bad game, this is probably just a bug.   However, I will say this. They have yet again, come out with a good game with a fanTASTIC sountrack. An all new one, in fact. They have made a good sequal, but I will go ahead and report the bug, so it can be fixed, and then the next few buyers can have a better experience than I have.",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as first one, but still great",
            "review_score": "1"
        },
        {
            "review_text": "an expansion to the original Electronic Super Joy, but only 13 levels. if you enjoy the previous one, should give this game a try.  and music still groovy~~",
            "review_score": "1"
        },
        {
            "review_text": "New soundtrack is awesome game wasn't super easy, but felt like a perfect balance of entertaining and challenging pick it up if you liked ESJ",
            "review_score": "1"
        },
        {
            "review_text": "Hands down support this dev, also lazer nipples",
            "review_score": "1"
        },
        {
            "review_text": "Graphics are nice to look at and, depending on your taste, the soundtrack is good. The gameplay revolves around a very simple jumping mechanic that are generally used to platform and dodge things. You basically do the same in every level, only difference being the amount of things coming at you, and in a few levels you`ll have to hurry up. The game is also super short with only 13 levels. Its in fact so short that when I were done with the thirteen levels, I started looking around for a place to continue the game in a second part. In my first playthrough I finished the game in a good hour/hour and a half.  All in all its a very short game with basic, repetitive gameplay, along with good graphics and music. With such a small price tag I`d say the game is worth the money. If you`d like a cheap platformer to kill some time with, this game is a good bet. Otherwise its a game you won`t mind skipping.  *EDIT: Seems like this game isn`t very playable in 60 fps. Certain parts are nearly impossible unless your refresh rate is 30 fps.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Totally worth every penny. Its not expensive, has a few levels (plus bonus level) and not too many achievements and achievements that everybody can get. Not impossible ones or really annoying. The best part of the game are the ghosts (your friends running through the levels, so you can learn from them) and the level editor to make your own levels. Really nice. The music is awesome. Next stop: the original game, that costs a little more, but has currently also more content (and DLCs).",
            "review_score": "1"
        },
        {
            "review_text": "If u liked the original game you will like this. Hard and funny as f.. play it you s.crub",
            "review_score": "1"
        },
        {
            "review_text": "Hard as hell if you're using just a keyboard. Otherwise, great soundtrack and pretty fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Groove city is awesome like the first game. A little bit harder and new game mechanisms that I love!",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the previous game, you'll like this one too. If there's one downside to it, the game is a bit short. It's got a different style of music than the first one, but it's still quite great :)  I'm 50/50 on recommending it. It's fun, if you're already a fan of the previous game; but, it's a bit short.",
            "review_score": "1"
        },
        {
            "review_text": "At first I was skeptical but now I'm in love.",
            "review_score": "1"
        },
        {
            "review_text": "Pleasingly bonkers.",
            "review_score": "1"
        },
        {
            "review_text": "set the V-sync in options to 60 fps else you may rage quit in 'Getting harder' level :)",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE the original Electronic Super Joy, and this is by no means a bad game. However, the $5 asking point ropes you less than an hour of real gameplay content if you were competent enough to beat the original. The humor and gameplay are great, but wait for this to drop from it's current price (15% off at $4.24 as of writing) to pick this up or you will be left feeling like you didn't get nearly as much as you could have spending $5 elsewhere on Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "It took until about 9/23/15 for me to find out this game existed. With the backlog of games for me to get through i ended up putting off this game until 3/24/16. Completed the game in 45 minutes with 100% of achievements, realised the only incentive to stray off the path was for a few achievements that were so generalised they could be achieved without trying. So if i bothered to stop collecting anything i could have finished this in half the time. There is no replayability unless you want to use the level editor, but this aspect alone doesn't give warrent to how empty it ended up being. Unless you can get this game for less then it's retail price, then don't bother. Otherwise, it would have been a fun game if there was enough content to get me invested.  -- Pros --    more music by EnV!    npc banter and level design   -- Cons --    The game is REALLY short.    Unless going for achievements, collectablesare pointless and only count for a score.    Removed abilities and simplified gameplay to just jumping.    Only boss fight is short and unsatisfying.    Secrets are pointless unless going for score maximisation.  -- Afterthought --  I really wanted to enjoy this game, i have been in the mood for a good platformer for a while now and was just getting into this game by time i beat it. If it had something to work for such as concept art, creater notes, or litterally anything other then the 8 achievements i obtained in a single/my first run would give this game some incentive to keep playing. Even going for a top score is pointless when there is a cap on the points you can get. (Or as of me writing this it appeared to be solely based on the limited stars you can collect.)",
            "review_score": "-1"
        },
        {
            "review_text": "Too short and lacks the features from the original game. Play the original one instead, skip this. It feels like a free update to the main game, but without the features.",
            "review_score": "-1"
        },
        {
            "review_text": "got the game for 0.27$ its mehhhh and the story is down right childish, yet children cant play it. by story im talking about every stupid little thing the guys in the background say",
            "review_score": "-1"
        },
        {
            "review_text": "This was a terrible game by the ESJ standard, but it is an above average game for the genre. I wanted to love this game more than reality, but it fell far short of that. The visuals are improved but tend to be repetitive at times. The soundtrack holds up the standard which is always a good thing. They added secret areas and new enemies. The good stops there. They took away everything that made the original so fun. The smash was removed. This resulted in some of the worst gameflow in a 2D platformer I have ever played when going straight from the original. The worst thing that somehow made it into the game is when you hit your head on a wall, you stick to it for a while. This even more interrupts the gameflow. It is harder, but in very cheap ways. The enemies just go faster and there are more of them. The controls are extremely unresponsive at points. It just felt like it was made cheaply and pushed to meat a deadline. It is short among all things. About 13 levels that only take time because the controls are unresponsive. It has the WORST hit boxes and level designs I have ever seen in a 2D platformer. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Unless you got it for $0.27 like I did it's not great. Less than an hour of time to beat. No slam move like the original which added some timing and depth, nope, this is just jumping and moving. If you've played the original, remember how there were rockets that followed you around? Well that's the gimmick in literally every single level. Jumping around obstacles plus rockets following you. Plus there's a ton of really cringe-worth 'humor'. LASER NIPPLES XFD LOLEO  go play meat boy or something",
            "review_score": "-1"
        },
        {
            "review_text": "This was a terrible game by the ESJ standard, but it is an above average game for the genre. I wanted to love this game more than reality, but it fell far short of that. The visuals are improved but tend to be repetitive at times. The soundtrack holds up the standard which is always a good thing. They added secret areas and new enemies. The good stops there. They took away everything that made the original so fun. The smash was removed. This resulted in some of the worst gameflow in a 2D platformer I have ever played when going straight from the original. The worst thing that somehow made it into the game is when you hit your head on a wall, you stick to it for a while. This even more interrupts the gameflow. It is harder, but in very cheap ways. The enemies just go faster and there are more of them. The controls are extremely unresponsive at points. It just felt like it was made cheaply and pushed to meat a deadline. It is short among all things. About 13 levels that only take time because the controls are unresponsive. It has the WORST hit boxes and level designs I have ever seen in a 2D platformer. 3/10",
            "review_score": "-1"
        }
    ]
}