{
    "app_id": 301640,
    "name": "Zombie Army Trilogy",
    "release_date": "2015-03-06",
    "developer": [
        "Rebellion"
    ],
    "publisher": [
        "Rebellion"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Zombies",
        "Action",
        "Co-op"
    ],
    "achievements": 68,
    "positive_ratings": 8472,
    "negative_ratings": 1330,
    "price": 29.99,
    "description": "The cult horror shooter series comes to an apocalyptic conclusion with an epic new third chapter, a heart-pumping new horde mode, and remastered editions of the best-selling Nazi Zombie Army 1 &amp; 2.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/301640/header.jpg?t=1553091165",
    "minimum_requirements": "最低配置: 操作系统: Microsoft® Windows® Vista (Service Pack 2) or Windows® 7 or Windows® 8. Windows® XP is NOT supported. 处理器: Dual-core CPU with SSE3 (Intel® Pentium® D 3GHz / AMD Athlon™ 64 X2 4200) or better 内存: 2 GB RAM 图形: Microsoft® DirectX® 10.0 compatible graphics card with 512 MB of memory (ATI Radeon™ HD 5870) or better DirectX 版本: 11 存储空间: 需要 15 GB 可用空间 声卡: Microsoft® DirectX® 10.0 compatible sound card or better 附注事项: Windows® XP is NOT supported. Ensure graphics and audio drivers are up to date.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Well optimized 3rd person shooter with oldschool feeling.  +Runs REALLY well +COOP with friends is alot of fun. +Campaign is fairly long and well thought out? +Zombies are rather slow but there's a variety of Zombie types which make the combat interesting. +Combat is really fun thanks to the fluent Engine and the Limbsevering feature which let's you destruct the whole body depending on the weapon :^)  If you're bored and look for a Zombie shooter that is fun to play with friends that's the game for you. Even if you don't have friends , you should be able to finish the story and Horde without any problems.  All in all a good game , but you shouldn't expect something new since the genre is kinda overused.  See it as a fun game that you can play when you're bored from all the other stuff and you should have a blast.",
            "review_score": "1"
        },
        {
            "review_text": "Not bad game. but I highly suggest you play it with friends it gets boring when playing alone.",
            "review_score": "1"
        },
        {
            "review_text": "  The year is 1945  . Amidst the dying flames of World War II, Hitler realises he has lost the war, however in a morbid twist he unleashes one unholy equaliser – a legion of undead supernatural soldiers that threaten to overwhelm the whole of Europe. You and and your fellow survivors must cast aside your former allegiances and fight alongside for survival in this atmospheric horror showdown; where bullets meet undead brains. You will always be under pressure facing off hordes of nazi-undead, occult generals and snipers. So keep your cool, make your stand, set up your traps, steady your aim and   Fire ",
            "review_score": "1"
        },
        {
            "review_text": "crazy nazi zombies, fight or die with friends",
            "review_score": "1"
        },
        {
            "review_text": "Kudos to Rebellion.  They made awesome spin-offs with Nazi Zombie Army 1 and 2 , nonetheless, they raised the level of awesome to astoundingly fun with the Trilogy. 8/10 Would buy a fourth sequel.",
            "review_score": "1"
        },
        {
            "review_text": "For those of you that own NZA 1 &amp; 2, this game is a bit of a let down i'm afraid. I really enjoyed NZA 1 &amp; 2, but this one has fallen short. I'll run through a few things that I don't like with the new game: * They have removed the binoculars,.......making it extremely hard to find bottles of blood. * You can no longer climb up on objects/walls/vehicles etc..... * Skeletons have been made WAY TOO easy to kill. * Regular soldier zombies now require more shots to kill them because the aim is 'off' therefore using more ammo &amp; wasting more time...... * Rifles do less damage &amp; it's alot harder to get the 5-for-1 or 10-for-1 kills we used to get regularly in NZA 1 &amp; 2..... * Pistols do considerably less damage,...even headshots,.....the only pistol worth using is the Webley, but it has a low rate of fire &amp; reload time. Not even the Colt .45 does one-shot-kills, I've found myself firing two or even three shots to the head to kill enemies. * MG turrets are a waste of time &amp; again do alot less damage, which is a pity cause the MG-42 was a feared weapon of WW2, nicknamed 'The Buzzsaw' for a reason!.... * The fire soldiers that the Fire Demon spawns are WAY too easy to kill &amp; have been slowed down so they don't run as fast. * Searching corpses now wastes more time as you have to 'Hold E' instead of 'Pressing E' * The shotgun has had it's damage reduced &amp; is now less effective. * The cross-hairs on the Preacher are now bigger making aiming more difficult &amp; is now less effective &amp; does less damage. * Explosives do less damage. *Hoarde mode has a large annoying scoreboard that blocks a quarter of the screen *New colour palate has reverted to a green-ish colour, instead of the red hell-ish colour in NZA 2. *The 'kick' has been over-buffed so now in parts you just have to stand there &amp; kick enemies &amp; not use any ammo.... *SMG'S do alot less damage, the only one worth using is the Blyscawica, &amp; even then still does less damage than in NZA 1 &amp; 2.  So overall I think Rebellion has dropped the ball on this one guys, so save your money &amp; don't bother wasting it on this game. Even the 'new &amp; improoved' versions of NZA 1 &amp; 2 in this trilogy suck big time!......because of all the alterations. The originals are still the best.  'If it ain't broken,.....don't fix it!'........   Thanks for a steaming pile of crap Rebellion!........game deleted!  Waste of money! :(",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best 4-player coop games around, and very fun to play alone and very beatable on your own. Great soundtrack, some really cool maps, and great bullet-cam kill shots, just like in the regular Sniper Elite games. They took the best parts of Left4Dead, Sniper Elite and CoD zombie mode!  And zombie Hitler. That is all.",
            "review_score": "1"
        },
        {
            "review_text": "Just amazing on every level, and creepy to with a very well done retro sound track. Really hope Rebellion release more of these using there newer game engine! Just go and buy it!😁😎",
            "review_score": "1"
        },
        {
            "review_text": "I like it. It's well optimized. No players tho",
            "review_score": "1"
        },
        {
            "review_text": "I was pretty sure it would hook me when I heard the 80's era synth soundtrack as the game loaded.  And, I wasn't disappointed. If George Romero directed a WWII film, this would be it. The game is an absolute blast to play.",
            "review_score": "1"
        },
        {
            "review_text": "This game includes 3 games, Nazi zombie army, nazi zombie army 2, and of course 3, so u dont have to buy first two versions because this game includes theri campaigns, also there some new things added in this game i LOVE IT",
            "review_score": "1"
        },
        {
            "review_text": "Despite what I think is a fair of amount criticism this trilogy gets, it s bar-none my most favorite time killer. Co-op is fun, solo is fun, games runs smooth and sleek, looks great, and to top it of those x-ray kill cams on zombie Adolf make it all worth the while, and since I had previous titles I only paid 18$, seems reasonable to me. Get it if you are new, get it if you are a veteran of Sniper Elite in general. Absolutely recommended.",
            "review_score": "1"
        },
        {
            "review_text": "What happens when you take a franchise based on stealth and percision elimination and pit players against a large, loud, and dumb cavalcade of zombies? Well 'fun' certainly doesn't happen.  Pros: + Decent variety of WWII weaponry. + Very atmoshperic. + Lots of collectables and 'chieves if you're into those things. AND TRADING CARDS! + The soundtrack that I've heard is well done but often looped. + Customizable difficulty tweaks. Seemed relatively balanced for my gameplay duration. + Playing with L4D characters reminded me that I have better games in my library I could be playing.  Cons:  - Levels feature short ranges, confined buildings, and lots of obscuring fog and smoke. Why the hell are you making sniping the focus when literally EVERY other attack I have works better in most situations? - Enemy variety isn't very inspired. Ranged juggernauts that need an insane amount of headshots to take down, lightning quick kamikaze style enemies, and the boring shambling Nazi zombies that are very rinse/repeat. I understand it's the zombie and sniper maxim to 'aim for the head', but frequently resurrecting non-headshotted enemies gets quite annoying. - Bad checkpoints. Often we'd have to restart a 30 minute segment because the enemies in the last 5 minutes would obliterate us. - Lots of weapons are blatantly better than others. While in the main Sniper Elite games, you might ditch the semi-automatic magezine loaded rifle for something with greater range and stopping power. Most all enemies die in one headshot and are within a joke of a range for a sniper: you have no reason not to take the M1 Garand / Carbine every time. Some secondaries and pistols are near useless as well. - Equipment is based on a stealth element. Tripwire, landmines, and dynamite that needs to be shot to be triggered. Only in the infrequent hold-out events (which give you probably 10-15 seconds to set up) are these defenses remotely useful. They were meant to gate off your sniping position in the main Sniper Elite games, but yield little benefit here. I'd rather just carry double grenades - There's nothing 'cooperative' about co-op. In games like L4D, co-op synergy is TIGHT. You rely on your team mates to heal you, scavange supplies for you, cover you while you accomplish objectives, revive you, kill enemies pinning you, etc. In this game, the only benefit to having a companion along is that they can revive you. I have the same amount of banal 'not fun' playing this alone as I do with friends. - Again. The sniper theme. WHY?! Who in the right mind would prefer a percision weapon when there are literally hundreds of enemies?! Extra mags for secondary SMG/Shotgun and pistol are heavily reduced. Sniper clips/bullets/mags are in sheer abundance. You're supposed to be using (scoped only) rifles.  - Bad net coding. I play L4D, Killing Floor, and now this with a group of Steam friends a few states away. Those former two games are MUCH more responsive when it comes to hit detection and third party animations.  I bought this 66% off for about $15, and even that was way too much for this game. Sniper Elite is ketchup, zombies are ice cream. They're fine on their own but you need to be ♥♥♥♥♥♥♥♥ to attempt to mix them. If you insist on using outdated weaponry against zombies of a politically unfavorable preference, then buy CoD World at War or Black Ops 1. This game has almost nothing going for it.",
            "review_score": "-1"
        },
        {
            "review_text": "good co op game",
            "review_score": "1"
        },
        {
            "review_text": "i like game like this zombie army Trilogy is one of the game i would really play alot unstopped 10/10 it a fun zombie shooter for my first time playing this game i like already i cant wait to kill hilter who with me lol",
            "review_score": "1"
        },
        {
            "review_text": "It is optimized",
            "review_score": "1"
        },
        {
            "review_text": "I have never played the sniper elites but this game is a 10/10 The game is amazing. It makes sniping feel fun, but it doesnt force you to snipe every enemy out. The weapons feel good. The textures and terrain looks great. The community is a bit empty from what I heard, but I seem to be able to find someone.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Got it at 80% sale.  Solo: The zombie sound come from no whare! Man this is so scare to move! Multiplayer: You call this a horror game?",
            "review_score": "1"
        },
        {
            "review_text": "Rating 7/10 - Good  ===   Pros &amp; Cons",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would put hitler in hell again",
            "review_score": "1"
        },
        {
            "review_text": "one of the best zombie shooter ......",
            "review_score": "1"
        },
        {
            "review_text": "Can't remember the last time I had this much of a blast with a co-op shooter.   Take Army of Two and sprinkle in some Left 4 Dead with a dash of Wolfenstein; you get Zombie Army Trilogy.  If you're a fan of the zombie modes from CoD, this is THE horde-style shooter for you.  10/10   ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best zombie games i have tried. The game also features a free update with the characters from left 4 dead which is also a cool thing because left 4 dead is also a pretty good game. The game is a little buggy when it comes to respawns at checkpoints, but If you like zombie games then this is a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "Great graphics, awesome story line and fun co-op.",
            "review_score": "1"
        },
        {
            "review_text": "Played other similar Rebellion games, and I just LOVED this game. Characters available didn't include only Karl, and the new ones even had background stuff. Little details like always add to the game in my opninion.  Oh yeah, the music's ♥♥♥♥ing SICK.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best co op games I've played so far..highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "i love a game but i want speed playing",
            "review_score": "1"
        },
        {
            "review_text": "Haven't had much fun in single player recently but this trilogy game broke that streak. Nazi zombies need a killin boys.",
            "review_score": "1"
        },
        {
            "review_text": "In the span of 12 hours playing through the campaign on easy mode (because we suck) my friends and I experienced the following:  -Sniping explosives to steal points from each other -One person getting a 30 in 1 explosive kill and 100k points (happened 3 times) -Getting pushed out of the world via falling logs -Friend accidentally vaulting over an ammo box and out of the world -Dying out of nowhere and leaving a copy of myself in the future -Found a zombie doing the YMCA -Friend ate a possesed doll -I ate a possesed toy -Chainsaw elite spin to win'd the group -Friend shot the survivors and got us killed by the rest -Take two in survivor bunker, I take a nap and revive Hitler -A lot of fun -A really well done game  This is a good game, recommended to grab some friends and go zombie huntin' together. Some odd design quirks or questionable hordes (we had one seige go on for at least 25 minutes), but overall it's a very solid shooter with a lot of love and attention to detail poured into it.",
            "review_score": "1"
        },
        {
            "review_text": "Fun games to play with friends. story could be longer",
            "review_score": "1"
        },
        {
            "review_text": "Love this game just started playing horde similar to cod zombie.Great fun with friends.",
            "review_score": "1"
        },
        {
            "review_text": "To my way of thinking, you can enjoy the game alone, but it is way more fun when played in co-op but not have stealth kill  Price 6/10 Weapon 6/10 Graphic 7/10 Co-op System 8/10 Achievement Quest 7/10  Good",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game, made to play with friends not solo.",
            "review_score": "1"
        },
        {
            "review_text": "The trilogy has the levels of the 1st and 2nd, and also some new levels haven't seen before. Controls are the same but the UI has improved, and also the game runs much smoother while delivering better graphics as well. Kudos Rebellion.",
            "review_score": "1"
        },
        {
            "review_text": "buy it,play it :D worth it",
            "review_score": "1"
        },
        {
            "review_text": "this is a game that has some incredible potential, the atmosphere is unsettling, just as any zombie story should be, theres an interesting selection of weapons, a plethora of coulourful characters to play as, especially with the left 4 dead update, the zombies are menacing and tough to gun down in large numbers, especially given the accuracy of some of the weapons, plenty of applaudable things, however the game has a few shortcomings that im a little concerned with, for those of you who use Xbox 360 controllers, it may seem you are anuable to do so, however the controller is usable without having to change any options, this was unclear to me so i wasted 20 minutes looking through the options, furthermore once i figures out that the controller was usable from the word go, i couldnt find much in terms of instructions and so was unable to figure out how to use my pistol, pretty important thing to know when you begin to run low on other ammo. i feel a lot of this games potential has been lost due to its raw lack of instructional clarity and i can't speak for anyone else, but even on its lowest quality display settings the game visually lags, heavilly, audio however is clear and refreshingly eerie, if you can figure out a way to smooth that out and are a fan of killing either zombies or nazis with both fitting and out-of-universe recognisable characters then this is the game for you",
            "review_score": "1"
        },
        {
            "review_text": "a fun ww2 zombie a pocolips game funny glitches toXD lets start with what i LOVE  1.ZOOOOOOOOOOMBIES! 2.kinda like cod or LFD1\\2 3.its a TPS i like all shooters ok heres what i dont like :( but first! im going to try to make a skeloten this will not look good XD    ______________ ================= | | | | | | | | | |  nope thats cake XD ok heres what i dont like  1. its really hard if u land a land mine and then are like 12 meters away it will pwn u  10\\10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! Get your friends together and get kicked in the butt by those annoying Sniper and Assault Rifle Zombies xD",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game if you are a big fan of Left4dead. Better maps and better characters, but the old ones is still available. This is much more fun! =)",
            "review_score": "1"
        },
        {
            "review_text": "Sniper Elite + Zombie Hordes = Zombie Army Trilogy  This is easily one of the most enjoyable Zombie games I have played in a long time. In a market that has become increasingly saturated over the years, mostly due to the ongoing popularity of Call of Duty's Zombie modes, it is refreshing to play something that feels so balls out ridiculous and designed purely for enjoyment.   There are no deep metaphors about the state of the human race, no morally ambiguous choices to make, just waves and waves of Zombie scum to obliterate in any means you deem fit. Don't get me wrong, there is definitely a place for a deeper exploration of the Zombie theme in gaming, but it's just so refreshing to see something deviate so whole heartedly from that and pull it off without just seeming like a stupid cash in.   Obviously this is not a game that will suit everyones tastes, but if you have any kind of love for classic B movie zombie fare or just want to spend a few hours watching heads explode with a few mates, I can't recommend this highly enough.  Rating: 4/5 Highly Recommended Purchase.",
            "review_score": "1"
        },
        {
            "review_text": "I think this game is worth $15.00 when it's on sale, I wouldn't spend more then that on it but it is very entertaining game and I enjoy it :) really fun co-op! :)",
            "review_score": "1"
        },
        {
            "review_text": "7/10 Cheesy graphics. Good gameplay. Listening to dramatic opera or Vocaloid Kaito songs make it 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game at first sight would count as 'Another Zombie Game' genre, so, what would make it shine apart from the others?  First, this game is a spin off of the Sniper Elite franchise, where Hitler found a way to control the dead, so your primary weapon would be a Sniper Rifle where in other games will only work if you are veeeeery far from the horde, but here, the rifle has properties that make it the best weapon in  your arsenal and if you need to engage at very close quarters, you have secondary weapons for those situations.  Also, being a familiar of Sniper Elite, you have the X-Ray shots, that are a reward for making an exceptionaly long killing shot, showing where the bullet hit and also what organs you destroyed (nuts included). At the begining that looks very cool, but after, you´ll switch it off because you´ll be full of seeing shattered skulls a lot (if you have good aim for the headshot).  The game as the name sugest, are three games in one, making it a very long road to the end, that in my opinion, is a good thing, comparing it with games that you finish in 5 hours, and also a good cast of characters (including the cast of Left 4 Dead 1 and 2), multiplayer of 4 players and horde mode (also, for 4 players) it´s just the icing in the cake, but after you finish the game, unless you have other 3 friends to play, the game is not going to see much action after that.  This is a good deal either if it has or not has a promotion, so, if you like zombie games, this is a good option.",
            "review_score": "1"
        },
        {
            "review_text": "11/10. I've been watching the YMCA Zombie for hours...",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun co-op game to play! Lots of gore and zombies to kill. I wish there was more Preacher ammo laying around, but its all good :)",
            "review_score": "1"
        },
        {
            "review_text": "8/10 Very fun.  Do you know Call Of Duties Zombie mode, the only reason somebody above the age of 15 buys COD? Well this is just like Zombie Mode for Sniper Elite V2. In which you kill nazis who died once already.  Weapons: The weapons you can choose from at round start are the same as in SN2, except that they replaced the silenced pistol with a shotgun (SMG slot). Though you can find weapons like a rocketlauncher and a double barrel shotgun. Maybe even more, but i haven't played that far yet.  Zombies: This game feels like a zombie apocalypse, if it was real.  The zombies can carry random weapons like metal rods of any variaton and even limbs of others. There are 'special' zombies too. Suicide zombies, big dudes with a machinegun, skeletons...  Maps: ACTUAL GERMAN LOOKING TOWNS unlike other Nazi Zombie games *looks at Call Of Duty* The maps in this game, location and ambience, make this game feel so awesome. Especially when you know that the maps are german towns where it would make sense to have nazi zombies.  Missions: The missions i have played yet are mostly just walking through a map and killing zombies, while every once in a while a mini boss or a boss shows up. So that's a minus point. Maybe it gets more interesting further into the game. I'll update the review once i get further.  Playable characters: You can choose from eight players, 16 if you cound the DLC L4D characters. 8 male and 8 female characters from various countires, including an ex Wehrmacht Fighter. So the game really feels like a bunch of people just got together to fight to survive.  All in all, this is one of my favourite zombie games that exist.  ",
            "review_score": "1"
        },
        {
            "review_text": "Great bundle, one of the best co-op games on steam and for the price it's definitely worth it.  3 Campaigns and 5 Levels for Horde. The gameplay is fluid, controls are responsive and the headshots are glorious.",
            "review_score": "1"
        },
        {
            "review_text": "It's very repetitive and got boring fast. It might be fun with friends, but I don't have any... :'(",
            "review_score": "-1"
        },
        {
            "review_text": "im doing this to get up my steam level",
            "review_score": "1"
        },
        {
            "review_text": "Review from a FPS player.  This is really an enjoyable game(killing the nazi is a dream come through especially for gamers that love killing zombies). While your main weapon was a sniper rifle.(You must have good aim and good graphic card so that the game would not hang and all your shots will miss like crazy)  For what I like about this game, Firstly, I would really recommend the graphic and the x-ray kill shot but it gets annoying especially when you are fighting with hordes of zombie.   Secondly, There are different zombies in this game which make it more interesting(sucider, normal, skeleton, soldier elite/ chainsaw and fully armoured zombie) but this game will get bored after awhile it became repeated.  Thirdly, I would recommend gamers that really like nazi(HITLER FANS) but the finally boss is quite easy in my opinion.  Overall, I would hope that you will enjoy this game as I do. ",
            "review_score": "1"
        },
        {
            "review_text": "If you love zombies and guns, well this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "First off ZAT is not a 3 games pack,it`s the entire Zombie Army Saga(2 episodes from SEZA 1 and 2 and an 3rd chapter) wrapped in an nice pack  Graphics-Personally i really dont really care about the graphics as long as the game is fine,but if you are THAT guy...  Well i`d give it a 9/10  Audio-Both the Music and the Sound of this game are brilliant.I was thrilled by it while i was scoping out dozens of zombies.All 3 of the episodes had intense moments packed with an even more exhilarating music.  This one scores(From me) an 10/10  Gameplay:It`s the Sniper Elite Formula(but with Zombies),so you know its good(9/10)  Multiplayer:Sadly,this is where the game struggles the most.It came as a surprize for me that the game was almost shrouded in shadow(Expecially as the game was made by Rebellion,wich is not a small company),If it wasnt of the random gaming news channels that ussually uploads trailers for upcoming games i would never knew about the game(or at least i would have heard of it a lot later).This is why(especially mid week) the servers are mostly empty However if you have a buddy(or 3...that works too) and even some randoms you will have a lot of fun  If it wasn`t for the lack of players this game would have been better than it is now(and its still good)  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Do you really like shooting Zombies in the Head ? Then you will like this game. Consider this my condensed review...  Still here.. Well then... You shoot, you run, you get trapped by magic fog, but that's OK because you get to shoot Zombies in the head. Would you like to play an open world shooter where decisions matter to the story ? That's not this game, but you do get to shoot Zombies in the head. You can play in co-op mode, Shoot even more Zombies in the head with your friends. Turn on or off Friendly fire, your choice.  The Game is linear, it's 'old school' console man, meaning you can't save your progress, ever! Each time you start a level, you'll play without the resources you worked so hard to collect, no one knows why, best not to think about it too much. You have the Peta factor of playing thru a whole level just to get to the boss battle you quite last time because you were frustrated with being surrounded and thus couldn't shoot Zombies in the head fast enough. Ain't Old school charming, but; you get to shoot Zombies in the head.  There are zombies: Shoot in the head. Elite Zombies that shoot back: Shot in the head; a lot. Zombies with explosives: Shoot anywhere. Sniper Zombies: Ditto. Zombies en fuego: Ditto Zombies summoning other zombies: Shoot in the head. Overall, there is a lot of shooting, you can also kick.   It's an entertaining game, if a bit repetitive, It's not immersive, the story is as shallow as a Presidential candidate, but some battles are creative, you can blow things up, some zombies are on fire, and there is gratuitous Zombie shooting, in the Head.  Is it art ? alas no, but you get to shoot Zombies in the head.",
            "review_score": "1"
        },
        {
            "review_text": "its very funny with playing co op, and also terrify when u play alone, its still good *-*",
            "review_score": "1"
        },
        {
            "review_text": "this game is really good but is hard for new people",
            "review_score": "1"
        },
        {
            "review_text": "This game has promise, but the graphics lack a polish, even in high. I wish the guns were better as well. Overall, not horrible, but a nice storyline would have been nice, for me at least.",
            "review_score": "1"
        },
        {
            "review_text": "Simple and trashy, yet it is fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "It's a bloody good time.",
            "review_score": "1"
        },
        {
            "review_text": "First things first, this is the only version of Sniper Elite: Nazi Zombie Army that should be sold. Having the first two installments as individual packages not only narrows the amount of players in multiplayer, but also divides the market. I had previously purchased Sniper Elite: Nazi Zombie, and I thought this would have all three as separate games. It's actually all three packed into one. The improvements are notable, however, it still seems unfair to those who bought the first games already.  This game is pretty damn fun, and for the amount of enjoyment it has given me alone I'd recommend this. Even if you own the previous two games already, this one is worth picking up for the modifications in the gore system, and all three campaigns in one. There is a Horde mode I haven't played much of, and so far it didn't seem to offer the same excitement that the campaign does, but I suppose I should hold off on judging that aspec of the game.  If you like similar games as Killing Floor, this one would easily be among your favorites. Mindless slaughter, although I will say the hitboxes do matter. So not so mindless as you should choose where you shoot your enemies. Head is most effective but you can dismember basically an entire zombie before you put it down. Chop off its legs, its arms, watch it crawl around for awhile, then pop it in the head.",
            "review_score": "1"
        },
        {
            "review_text": "Zombie Army Trilogy is quite alot of fun! This game is awesome especially when playing with friends. Even the Left 4 Dead characters were added! What are you doing here still reading this?  GO GET IT WHILE ITS ON SALE NOW BEFORE YOUR CHANCE FOR AN AWESOME GAME HAS PASSED ITS 66% OFF! ",
            "review_score": "1"
        },
        {
            "review_text": "'Bring a gun. Preferably, bring at least two guns. Bring all of your friends who have guns. Try to get them to bring any of their friends who have guns.'   ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! I would recommend this to every1 :D",
            "review_score": "1"
        },
        {
            "review_text": "Good game when u cannot fall asleeP (nice time-killer)",
            "review_score": "1"
        },
        {
            "review_text": "Overall great series and ridiculus fun to sink hours into.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those where I wish Steam would give me a third 'recommendation' option - kind of a 'meh' button. Reason is, in solo play, this game becomes tiresome very quickly, mainly because there is no real sense of progress, it's just 'move to this spot &amp; defend against the hoarde' over &amp; over again, only occasionally interrupted by a slightly harder to kill boss.  I know this sounds a little harsh, but at times this just feels like a glorified tower defense game.  On the positive side the bullet mechanics are really good fun, and the weapons have a good sense or realism, unfortunately you soon realise that there are onlyt a couple that stand out and are considerably more effective zombie slayers and this massively contributes to the games overriding sense of 'meh'  HOWEVER................... This game is spectacular fun in co-op multiplayer, which is why I'm going to recommed it - even tho part of me wants to say no To sum up, by all means get this if you love a social slaughter-fest with your chums, but if you are looking for a decent solo shooter, wait until DOOM is on sale &amp; get that instead",
            "review_score": "1"
        },
        {
            "review_text": "very stimulating! Especially when you accomplish a level that you have been working on for a week!",
            "review_score": "1"
        },
        {
            "review_text": "aside from a few probs with finding ppl for coop there are no words in the english language to discribe how awesome this game is so ill use german. Diese Zombie- Krieg ist genial!!",
            "review_score": "1"
        },
        {
            "review_text": "Killing Nazi Zombies is always fun!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best coop games yet. It runs awesome and looks great.",
            "review_score": "1"
        },
        {
            "review_text": "thouhg i only played 30 mins which i suppose shall not allow me to review but  i finished First mission which was awesome nice improvments in this game and much chracters",
            "review_score": "1"
        },
        {
            "review_text": "Pros  - Xray kill cam is cool - Wide selection of snipers, sumbmachine guns and pistols that all have different characteristics - Interestung concept of fighting Zombes in the ruins if Berlin - Is fun with freinds for a brief time - Is good for when you have nothing better to do - Optomisation is decent - Overall textures and graphics are good   Cons - Zombies can be extremely irritating  - Combat is increadibly repetative - Blood textures are quite poor - Main characters have no voice overs  - Poor cut scenes - Feels like this game should have just been a DLC for Sniper Ellite III (and i normally hate those three letters) - If you ae looking for a horror this game has almost zero fear factor - There are better Zombie games such as LFD2 and Black Opps   Overall Judgment 5/10 = do not buy this game unless its on sale i paid £5.89 and it is only nearly worth that much.  ",
            "review_score": "-1"
        },
        {
            "review_text": "bored game.",
            "review_score": "-1"
        },
        {
            "review_text": "Better then I was expecting. Love the soundtrack, seemed inspired by 1982's The Thing and other great 80's horror films. Love these games where it makes me want to keep coming back until I get to the end. Speaking of the end, I shot a Z-man through the head when he was getting up, the bullet went in top of his head, through his entire body and out his ♥♥♥♥♥♥♥. I was like, did I just see that. Kinda like in the original, when I shot two nuts off a poor guy with a single shot.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like zombies????Best choice out there",
            "review_score": "1"
        },
        {
            "review_text": "And again Rebellion did a great job on remastering this game with awesome campaign and horde mode ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, good graphics 10/10 would get killed by an angry nazi with a shovel again.",
            "review_score": "1"
        },
        {
            "review_text": "░░█▀░░░░░░░░░░░▀▀███████░░░░  ░░█▌░░░░░░░░░░░░░░░▀██████░░░  ░█▌░░░░░░░░░░░░░░░░███████▌░░  ░█░░░░░░░░░░░░░░░░░████████░░  ▐▌░░░░░░░░░░░░░░░░░▀██████▌░░  ░▌▄███▌░░░░▀████▄░░░░▀████▌░░  ▐▀▀▄█▄░▌░░░▄██▄▄▄▀░░░░████▄▄░  ▐░▀░░═▐░░░░░░══░░▀░░░░▐▀░▄▀▌▌  ▐░░░░░▌░░░░░░░░░░░░░░░▀░▀░░▌▌  ▐░░░▄▀░░░▀░▌░░░░░░░░░░░░▌█░▌▌  ░▌░░▀▀▄▄▀▀▄▌▌░░░░░░░░░░▐░▀▐▐░  ░▌░░▌░▄▄▄▄░░░▌░░░░░░░░▐░░▀▐░░  ░█░▐▄██████▄░▐░░░░░░░░█▀▄▄▀░░  ░▐░▌▌░░░░░░▀▀▄▐░░░░░░█▌░░░░░░  ░░█░░▄▀▀▀▀▄░▄═╝▄░░░▄▀░▌░░░░░░  ░░░▌▐░░░░░░▌░▀▀░░▄▀░░▐░░░░░░░  ░░░▀▄░░░░░░░░░▄▀▀░░░░█░░░░░░░  ░░░▄█▄▄▄▄▄▄▄▀▀░░░░░░░▌▌░░░░░░  ░░▄▀▌▀▌░░░░░░░░░░░░░▄▀▀▄░░░░░  ▄▀░░▌░▀▄░░░░░░░░░░▄▀░░▌░▀▄░░░  ░░░░▌█▄▄▀▄░░░░░░▄▀░░░░▌░░░▌▄▄  ░░░▄▐██████▄▄░▄▀░░▄▄▄▄▌░░░░▄░  ░░▄▌████████▄▄▄███████▌░░░░░▄  ░▄▀░██████████████████▌▀▄░░░░  ▀░░░█████▀▀░░░▀███████░░░▀▄░░  ░░░░▐█▀░░░▐░░░░░▀████▌░░░░▀▄░  ░░░░░░▌░░░▐░░░░▐░░▀▀█░░░░░░░▀  ░░░░░░▐░░░░▌░░░▐░░░░░▌░░░░░░░  ░╔╗║░╔═╗░═╦═░░░░░╔╗░░╔═╗░╦═╗░  ░║║║░║░║░░║░░░░░░╠╩╗░╠═╣░║░║░  ░║╚╝░╚═╝░░║░░░░░░╚═╝░║░║░╩═╝░ ",
            "review_score": "1"
        },
        {
            "review_text": "Great game. plays bery much like left 4 dead.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, great multiplayer, excellent bullet time cams... just got to love SNIPER ELITE V2 add killing nazi zombies to the formula, just that.",
            "review_score": "1"
        },
        {
            "review_text": "Zombie Army Trilogy is a Very Good Game it's just like the other 2 Games except stuff like a new Activity called Horde i like that activity. I would Recommend this game in so many ways",
            "review_score": "1"
        },
        {
            "review_text": "Fun.  Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "A very good game. I've beaten the first two campaigns of the trilogy before, And they look better with the remastered version. Have yet to play the third, but the other two call out to me.",
            "review_score": "1"
        },
        {
            "review_text": "Always crash when i shoot zombie in the head!  and always show me stopped working please fix this i just paid this game!  if this dont fix in the next update i need REFUND!!!",
            "review_score": "-1"
        },
        {
            "review_text": "This is a Awesome game where u shoot and kill notzie Zombies and i really hate the notzes so I love it",
            "review_score": "1"
        },
        {
            "review_text": "Mindless fun !  Best played in Coop  MP is pretty much dead",
            "review_score": "1"
        },
        {
            "review_text": "if YOU have a friend to play it with its well worth the money and i mean come on who dont wanna kill nazi zombies to pass their time and you get to kill the evil ♥♥♥♥♥♥♥ Adolf himself! :) i had a blast playing through the story with a friend and i probly guess with 4 people its even more fun.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. However, it's a shame that the community's small.",
            "review_score": "1"
        },
        {
            "review_text": " 'You probably heard we ain't in the prisoner-takin' business;  We in the killin' Nazi business. And cousin, business is a-boomin'.'   I'll keep it short and sweet:   Highly memorable, awesome music!   Ultra fun cooperative online play!   Immersive creepy feels!   Nazi Zombies!  TLDR; I haven't had this much fun in a while.",
            "review_score": "1"
        },
        {
            "review_text": "It is a good game if you have a friend with you who also playz.....",
            "review_score": "1"
        },
        {
            "review_text": "I love Coop games........;)",
            "review_score": "1"
        },
        {
            "review_text": "I did not expect thi sgame to be this good.  It really is this good. 10/10 would blow myself up with a fire exstinguisher again.",
            "review_score": "1"
        },
        {
            "review_text": "9",
            "review_score": "1"
        },
        {
            "review_text": "Dull boring repetitive gameplay...storyline sucks...forced myself to stay on it and keep going and try to see goodness in this game...wasted $9.55... =/ I hope steam is gonna respond to my refund request... half of my gameplay was in the options menu trying to bind the keys and make my graphics correct...",
            "review_score": "-1"
        },
        {
            "review_text": "this is bad game  really i waste my money for nothing  ",
            "review_score": "-1"
        },
        {
            "review_text": "I expected a shooter and got a tunnel-vision walking simulator with illogical placement of physical barriers (oh no I cannot get over that 1 foot high piece of wood; oh the game made that bit of air impassable;...), repetitive wave-spawning zombies and about as much immersion as trying to bath in a bottlecap.  Maybe it just wasn't my kind of game, but it seemed like it did everything wrong that modern games tend to do right, no matter if they are AAA or cheaply produced. Lots of the old 'vices' of game design make a grand come-back in this title and I have to say I did hope they had died for good.  Well, I guess those are the undead that have risen that this game is truly all about...",
            "review_score": "-1"
        },
        {
            "review_text": "3rd most bought game, no matches found online.  Dead game, and basically just an arena of spray.",
            "review_score": "-1"
        },
        {
            "review_text": "On the fence about whether or not to reccommend this game. It really seems like fun, but one of the things that sucks about PC gaming is never knowing how well the game is going to place on your PC. You read the reccommended specs and more than meet them, watch gameplay footage and compare the the resolution of the graphics and mechanics vs another game on your PC and try to make a reasonable judgement and fall completely on your face. There's nothing terribly complex or high end in this game, watching videos I thought, oh about resident evil 4 level game mechanics and graphics, I should be able to at the very least play the game smoothly on the lowest settings, but alas no. So much stutter and lag. I really want to enjoy the game and it seems like fun, but most people probably won't have a high end enough PC to be able to enjoy it so I can't reccommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Shooting anything but a sniper rifle sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "a coop-oriented fps/tps. apparently similar to sniper elite...but totally different gameplay, a kind of left4dead or killing floor...with hordes of zombies to slay in close/melee combat.  not a bad game, but definitely not my sniping challenge.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome Graphics.  Would be great if the game didn't crash every 20 min.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game for cod normies.",
            "review_score": "-1"
        },
        {
            "review_text": "Spookey Scarey Skeletons..... Watch out for the skeletons.",
            "review_score": "1"
        },
        {
            "review_text": "This game ♥♥♥♥ing sucks unless you play it with friends and even then make sure you all get it on sale. Still though, you get to ♥♥♥♥ING KILL ZOMBIE HITLER",
            "review_score": "-1"
        },
        {
            "review_text": "i would say i love the game but i cant for the shear fact that i cant play it without it freezeing up on me and i have the reset my computer. so i cant really say i would recomend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable for an hour or so but it quickly turns into a mindless, tiring slog.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible game... Super laggy at registering shots. Avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "why i cant text on the game ?????",
            "review_score": "-1"
        },
        {
            "review_text": "its ♥♥♥♥ing horrendous",
            "review_score": "-1"
        },
        {
            "review_text": "Recommend yes and no, yes if you want one more chapter of the same game, No if you expected anything more.   ATTENTION:  'Perfect your play style with CUSTOMISABLE weapons'  There are NO customizable weapons in the game! This is straight up false advertising, and I bought the third chapter for this sole reason, only to find that this is not true. The third chapter brings improvements but in tiny steps.   Edit: The line about customizable weapons has been removed from the store page",
            "review_score": "-1"
        },
        {
            "review_text": "Great game! Havent played much - already love it ! :D",
            "review_score": "1"
        },
        {
            "review_text": "I hate over the top video games. I hate amazing deals. I hate being set in World War 2 fighting zombies with some great guns.",
            "review_score": "1"
        },
        {
            "review_text": "nice soundtrack nice gameplay make me scared every time",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS NOT L4D3! This is like Dark Souls, with no armor, no health recovery mechanic (that I have found yet), no dodge and really crappy guns. You have a half-♥♥♥♥♥ melee kick you can attempt, but it only reaches about 75% as far as zombies, so if you are in range to use it it's likely 3-5 are in range to hit you. I can't even figure out why the L4D chars were attached to this mess. Excessively linear 'story' mode. I've never played a game on such rigid rails. I think multiplayer could be fun if you know people, but don't expect to get in a PUG game. Everything I've read actually says the multiplayer servers are empty when there isn't a sale filling them with new suckers. Movement controls feel like your character is neck deep in quick sand, aiming is laborious and spastic at the best of times and god help you if anything gets inside of 10 meters because the close range weapons are garbage.  The environments are immersive and kinda pretty really, but the game mechanics shove it all out the window. This is a $5 game from that bargain rack by the checkout at your bookstore. Pay no more than that, ever. The only reason I'm not filling out a refund form right now is my very slim hope that maybe some day, years from now, some great modder will make a L4D total conversion lol. I genuinely want to play through these interesting places, just not like this. Not like this at ALL.",
            "review_score": "-1"
        },
        {
            "review_text": "Due to it's multi million dollar quality graphics, you wouldn't think it would be as stupid as it is. Zombies are great, but, there are special types which are stupid. Snipers: Not TOO weird, but they can jump across rooftops and can aim amazingly. Skeletons: Need i say more? It is far too difficult for one player, so it's impossible unless you want to play with trolling dumbasses. If you set the difficulty to Cadet, and zombie spawns for 1 player, you will be bombarded with tons of zombies. Enough that it's hard even for 4 people. Spring for Dying Light or Dead Island. They are (Un-Bias) THE best zombie games in existance.",
            "review_score": "-1"
        },
        {
            "review_text": "This has to be the worst game ive played for a few years... Horrible control... Just a loooong stream of endless ♥♥♥♥ boring headshots of slowmovers. YAAAAAAAAAAAWN..... So bad ppl, so f..... bad.... How this has gotten so good reviews, puzzles the mind...",
            "review_score": "-1"
        },
        {
            "review_text": "This just loads a wite backround screen and spooky music, (maybe there should be written options e.g start game). Cant play.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a complete copy of left for dead 2, except: Nazis, and the aiming mechanics are completely screwed up. At least in the multiplayer portion it seemed like some kind of weird lag when I would shoot it seemed like the bullets were far behind where the guys were when I fired, timewise. I never had any of this trouble in left four dead 2 at all. They put in this idiotic mechanic that makes the bullets veer off with wind or whatever. How stupid! Wind doesn't make a bullet veer off in 35 feet unless it's almost a hurricane! They think you're back in the Revolutionary war firing muskets. Yeah, muskets veer off at that sort of range, but world war 2 weapons were made pretty well. They were accurate at short-medium range with light winds. Also the rifles completely lose reticles for about one second after firing. If you've ever been to a firing range and fired rifles, any good rifleman can fire off one shot after another in rapid succession into a smaller size target at 50 feet without missing. I know I can!  Conclusion: the game's not worth playing if your bullets are veering off at close too medium range. The aiming and firing mechanics are unrealistic and lame!  These firing mechanics would be fine if it was a pre-Civil War musket game.",
            "review_score": "-1"
        },
        {
            "review_text": "Borring game if you play in single. May be interesting for 4-5 hours with friend but there are better muliplayer games.",
            "review_score": "-1"
        },
        {
            "review_text": "Could have been done better, they could have the boss monsters take damage from explosives and designed the maps better for movement and flow instead of being pushed to the wall and suffocating from the literally endless horde of zombies. (Not sure if that was a glitch or intended for the bosses that don't die) Anyway, the game should be tweaked a bit more, or not, I don't really care and neither do Rebellion, they already have my money.",
            "review_score": "-1"
        },
        {
            "review_text": "I cannot play with friends that only have 1, or 2. So I can only play solo play to friends to dont feel like dishing out the extra bucks. Not going to get much out of this game I suppose",
            "review_score": "-1"
        },
        {
            "review_text": "This is the greatest Zombie game i have ever played! Because I like both WWII and Zombie games!",
            "review_score": "1"
        },
        {
            "review_text": "Imma thumbs up so far. Horde mode is cool. pretty great content for the price. Wish there was more weapon choices or boxes of randoms like CoD, but I get it too. Its fun and takes skill.",
            "review_score": "1"
        },
        {
            "review_text": "On the positive side I can say that the game combines all NZA-Games into one, is overhauled in both graphics and performance, contains both new playable characters and new (tougher) enemies and is (for now*) uncensored.  On the negative side the weapons are a tad underpowered. Even over short distances the bullets drop massively and the combo system makes SMG's redundant as even one missed bullet resets the counter to zero. Guns sometimes fire off-center of the crosshair.  The game utilises an SEv2 style killcam rather than SE3's with in my opinion is a step back and it has it's issues with steam-overlay.",
            "review_score": "1"
        },
        {
            "review_text": "A great coop expirience, with a great plot and even better satanic props to LoL about, not legendary, tho it earned its place as one of my favorites.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "TIme to finish Hitler and his so called 'Undead army'  ",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING, much better than the last two! GRAPHICS ARE INSANE! and the new horde mode is really fun!",
            "review_score": "1"
        },
        {
            "review_text": "Just LOVE this game! Bringing in the bullet time damage dynamics make for fine screen shots.....(hehehe) If you loved playing COD world at war zombie mode. Then this is your game! To get the most out of this game though your system needs to be in SlI/x-fire mode or at least a GTX980 overclocked and cooled. A heavy strain will be put on your rig.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;LET THE BODIES PILE UP!!, LET THE BODIES PILE UP!!!&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Series, for $15 cant go wrong, pick it up!",
            "review_score": "1"
        },
        {
            "review_text": "Shamless orgy of xray cam sniping or just mow all the undead down, it's jolly good fun either way.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and great graphics. Co-op works great. It puts CoD zombies to shame",
            "review_score": "1"
        },
        {
            "review_text": "Great game, very unique, also hoping for more game modes and dlc",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game while it was on sale, and i would highly recommend buying this.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like to shoot nazis? What about zombies? How about nazi zombies? I never played sniper elite so I don't know how this compares to that but a sneaky sniper campy game this is not, you will not do a lot of sneaking or hiding in a camp spot. Think a 3rd person left 4 dead with WWII firearms. Setting traps is fun, the kill shot cam is amusing and I enjoy playing this game alone just as much as with people. Go shoot some nazi zombies.",
            "review_score": "1"
        },
        {
            "review_text": "Dead game, boring, buggy, glitchy. Bad.",
            "review_score": "-1"
        },
        {
            "review_text": "I originally posted a negitive review for this game. I found many of the mechanics of the other games (NZ1, which I also own) were made slightly different, and not in a good way. Determined to get my mony's worth, I still carried on, after wrting the review. What I will say is this= once you get used to the differences, its actually an insanely good game.   So, 2 bits of advice  1) If you hate it like i did because they screwed with the mechanics, keep at it. It is a REALLY good game.  2) The other bit of advice is play it wearing head phone. The game becomes quite immersive, many times I'd go to play it for 15 mintues that i had to spare, only to find an hour and sometimes 2 had passed, (as you can imagine, i have a lot of free time)  Also, I love the addition of teh L4D characters.",
            "review_score": "1"
        },
        {
            "review_text": "It was good but not enough zombies.",
            "review_score": "1"
        },
        {
            "review_text": "Looking for that awesome Coop game to play with your friends? Look no further, this is hands down the best zombie coop game i've played. All three episodes are about 5 hours each (Not counting the collectibles) giving you and your buddies 15 hours of pure joy. Had the first two before i got this and had no problem at all replaying the first two.  This felt like and end to the series but i really hope the developer continue making zombie coop games.  ",
            "review_score": "1"
        },
        {
            "review_text": "All three of the zombie army games are outrageous. Tons of fun and never gets old.",
            "review_score": "1"
        },
        {
            "review_text": "Overall this is a nice upgrade to the previous 2. My issue is the changing around of buttons for no reason. You have your mindset to a certain game you start...it is all different. It detracted from my initial enjoyment.",
            "review_score": "1"
        },
        {
            "review_text": "Killing Nazi Zombies, What else is there to say. 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Get this game if you want to snipe at Nazi zombies. There's not much story here but the game is fun. I recommend to wait for it to go on sale, as it often does.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Wish there was more diversity in the rifles, they all seem the same to me. I just pick the one with the most bullets. I also, seems to miss a lot with the shotgun when the zombie is point blank.",
            "review_score": "1"
        },
        {
            "review_text": "By far one of the best zombie FPS's I've played through.",
            "review_score": "1"
        },
        {
            "review_text": "Great Gameplay. Great Graphics. Wish you could get more info/stats on the weapons but thats really nit-picking there.",
            "review_score": "1"
        },
        {
            "review_text": "Cant play this game, the camera keeps spinning to the left and slightly upwards...",
            "review_score": "-1"
        },
        {
            "review_text": "Just great !! :)",
            "review_score": "1"
        },
        {
            "review_text": "Zombir Army Trilogy (2hrs on record when posted)  Theres just something about this game that I like alot, like it keeps pulling me in everytime. The story is not so good but the gameplay is just so amazing, like the controlls is really great!  Theres nothing that feels more satisfying than shooting a zombie in the head and it never get old. 'I havent fully played the game yet' but I can say that this game is amazing!!! I might change my opinion later on but yeah its an amazing game no doubt. and you can tell its amazing because I keep saying its 'great and amazing'. Zombie Army Trilogy 4/5 (might change later on)  P.S. buy the 4 pack and play it with friends. this game is kinda boring but still very playable alone.",
            "review_score": "1"
        },
        {
            "review_text": "Really challenging co-op on 2-player mode.  Hordes of zombies, limited ammo, unlimited boots to rotting faces.  Lots of fun and frustration when you can't pass a stage.",
            "review_score": "1"
        },
        {
            "review_text": "Berlin is burning and Adolf Hitler has risen from his grave to gather an army of Undead Super Soldiers who are poised to spill blood and guts across Europe. Only one thing stands in their way – you, and the fleshy sacks bristling with guns and explosives you call your best friends.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS... good... I... I... like this game. Zombies are getting old... but Nazi zombies are something completely new.",
            "review_score": "1"
        },
        {
            "review_text": "I love shooting multiple zombies in the head. ",
            "review_score": "1"
        },
        {
            "review_text": "I always like to play as the sexy characters in these games. I'm so glad they added coach.",
            "review_score": "1"
        },
        {
            "review_text": "If you woud like to kill millions of nazi zombies inklusiv hitler with a trickshot this is the best game for you.",
            "review_score": "1"
        },
        {
            "review_text": "With slow-motion executions, a surprisingly lengthy and well thought-out campaign, imaginative maps and enemies and a catchy soundtrack, Zombie Army is a silly, violent homage to every over-the-top action flick and zombie culture lover in existence.",
            "review_score": "1"
        },
        {
            "review_text": "At first, I didn't like hugging...  After this game...  I am terrified of hugging...  #pleasedonthugmesuicidezombies   #huggingsimulator2015",
            "review_score": "1"
        },
        {
            "review_text": "Public community in Australia seems pretty dead.  Find friends to play this with before purchasing.",
            "review_score": "-1"
        },
        {
            "review_text": "Not refined enough. Gets boring too quickly even with multiplayer.",
            "review_score": "-1"
        },
        {
            "review_text": "Way better than cod zombies buy this now so fare 15 minutes and its really fun whell edit if when i play more",
            "review_score": "1"
        },
        {
            "review_text": "best game to play when in berserk mode ;]  good sfx.",
            "review_score": "1"
        },
        {
            "review_text": "It's ok for a bit of fun with friends. It's hard to not enjoy killing zombies. It does get old pretty quick though. If you can get this one cheap give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "Is it worth 40 bucks? No, is it worth going to ♥♥♥♥♥♥/♥♥♥ and finding it for about 20? Yes. This game is extremely fun with not so much content, and you'll need to add a decent amount of people to play a co-op game. Otherwise you'll be alone, which there's nothing too bad about that. I'd fully reccomend this for about 20 bucks or so.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 would have liked more diverse zombies but i guess hitler wasnt inventive",
            "review_score": "1"
        },
        {
            "review_text": "Ain't nobody playing this ♥♥♥♥in game. 'Searching for 3 players..2...1..couldn't find any suitable game but your lobby will still be visible' Like come on man I want more players on this this game. It's NOT worth 42€ I bought it when it was on price off and I'd recommend you the same. It's basically a mix of L4D2 and any random sniper game. Nothing new and innovaite so buy this game when it's on price off so I can finally find some people in the ♥♥♥♥in lobby, L4D2 is so ♥♥♥♥ing old and I always find people to play with but here?? It's hard...please buy this game when it's on sale, it's pretty fun. Not as good as L4d2 but a worthy copy of the game with snipes.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great for seeing the epic slow-motion bullets scattering the bodys of zombies",
            "review_score": "1"
        },
        {
            "review_text": "Beautyfull, perfect :D",
            "review_score": "1"
        },
        {
            "review_text": "Zombie Army Trilogy is a wonderful game concept and sort of a revolutionary idea in the whole zombies aspect. It actually puts you to the test with it's limits. For instance, it forces you to conserve ammunition as much as possible but also it makes you use a variety of World War Two sniper rifles and each one has its own cons and pros. The most wonderful thing about it is that it puts you back into World War Two which we have not seen many people do anymore due to the whole idea of 'Nazi Zombies' being a sort of lost and dead item. It provides unique weaprony from World War Two and the maps are well thought out, long someitmes, and well detailed. The downside is that it uses the 'Mainstream' weapons of the Second World War, like the MP40, PPSh41, Thompson M1, etc.. instead of the common weapons like the MP38, BAR, Type 99, and other popular not well known weapons. It doesn't really give a decent variety on pistols and SMG varriants. Which yeah it is meant to be mainly a sniper game but at least let those who prefer an SMG to be able to get one and use it. Now the concept it wants to show is a wonderful idea. However, they could do more work to the game like adding a story, more dialogue with the characters and other things that really would make a difference. The Four characters go ALL THREE GAMES without speaking. A little strange isn't it?",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. So much better than the Call of Duty zombie expansions. Really teaches you the values of coordination and tactics with other people in multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "At last--closure to what became of Hitler after the horde broke in his bunker door. I already owned 1&amp;2 and had to have 3. If it's possible to fall in love with a game, then this is one of them. The X-ray kill cam is so frickin' cool. Even better in SniperElite 2&amp;3 (more colorful). Recommend this game-?? Oh hell yeah.. Already told everyone I know that games. Very cool game...",
            "review_score": "1"
        },
        {
            "review_text": "Nazis? Zombies? Nazi Zombies? Sounds like a bad Robert Englund film, but honest its a great game with the same style and feel of Left4Dead. Play the Horde mode online or solo--or hit the campaign up with friends, or go your own way. Enjoyed the little time I've put into the Campaign so far. Looking forward to playing even more.   Also, game does go on sale a good bit----wait for the Trilogy to be markdown. It's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome , I enjoy it more then LFD series,",
            "review_score": "1"
        },
        {
            "review_text": "Try it... it's AWESOME!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is Fun! If you like Left4Dead and shooting up Nazis you will love this. It can be very hard at times and when a horde is running at you its hard to hold it together. Lots of zombie types and head shots count! All my friends should get this while its on sell. Its a good time!",
            "review_score": "1"
        },
        {
            "review_text": "I almost feel I cannot call myself a PC gamer... I have played thousands among thousands of games. And Co-Op games (LAN/Internet) have always been my favorite. Then you throw in Zombies, which are also my favorite genre/theme of game. But then I've never played this game, nor really heard of it. I've played a few 'Sniper' games in my past and they've always felt more like a Metal Gear 'Sneaky Sneaky' mixed with a rail shooter, which are not my types of games. I prefer Left 4 Dead, H1Z1, etc. or pretty much anything that's more 'Free-Roaming' so naturally I passed over this game multiple times. But! Then I saw it had the Left 4 Dead players which immediately perked my interest, so I watched some videos and was immediately awestruck and ashamed I did not own this sooner. So through that confession I must say this game is a MUST OWN, especially if you like Co-Op shooters similarly to Left 4 Dead, it's 3rd person which I kind of like more in the end, and the graphics are well done, the gameplay is fluid and responsive. I cannot suggest this game enough, I've only played it 30 minutes and I know without a doubt this will consume years of time. Well done to the creators, I am sorry I judged before I played.",
            "review_score": "1"
        },
        {
            "review_text": "Kicks buttocks!! If you like FPS, zombies, and a sense of dread as you are feeling quite overwhelmed, then this is the game for you. Excellent creepiness factor with very dark and demented imagery and music. A must have for the gaming/zombie afficionado.",
            "review_score": "1"
        },
        {
            "review_text": "Just like Snipoer Elite 3 and I love it. The kill cams are gory and exactly what I am looking for in a zombie shooter.",
            "review_score": "1"
        },
        {
            "review_text": "its a pretty odd turn to the nazi zombies thing since l4d2. I didn't even know it was suppose to be a trilogy",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun playing with friends.",
            "review_score": "1"
        },
        {
            "review_text": "The game seemed interesting, but as I played it I found it was equivalent to Left for Dead and Killing Floor. It is not bad per say however there are just too many games at this time that do the same thing.",
            "review_score": "-1"
        },
        {
            "review_text": "Playing this with my buddy and two girls friends. - AHHHHHHHHHH!!! - OOOOOOH!!!!! - SH**********T!!!!  Best coop experience since Left for dead.  A must buy.",
            "review_score": "1"
        },
        {
            "review_text": "Purchaed this with 66% off so got it for a tenner. Already had NZ and NZ2 but for this price NZT was too good a bargain to pass up.   Upon playiung it the graphics have been seriously beefed up and the extra players are always fun (now up to 8 instead of just the 4)  Everything else is pretty much the same, but to the same standard of excellence as before just a little more so.  More types of enemies and superb backdrops and map layouts.  A must for any FPS fan and especially those who enjoy the gore.",
            "review_score": "1"
        },
        {
            "review_text": "Anyone wanna join me for a coop game? If so then add me up :)",
            "review_score": "1"
        },
        {
            "review_text": "Alternate ww2 universe? ☑  Zombies? ☑  Lots of zombies? ☑  Tons of zombies? ☑  Tons of blood, gore, and violence? ☑  ♥♥♥♥♥♥♥ off your co-op friend by picking off zombies rapidly with a semi-automatic Gewehr 43 sniper rifle while he struggles to keep pace with a slow bolt action rifle? ☑  This a pretty standard linear 3rd person shooter game, whose format may seem aniquated considering the proliferation of massive openworld games. Despite the linear game mechanics, it is a blast to play co-op with your friends. I'm not exactly sure that I would have paid the full price, but I got a copy of this game for me and a friend when it was on sale for $15. For that price, I give this game a 7/10 and would say that the game is worth every penny. The missions are quite lengthy and challenging at many times, with hundreds of zombies swarming you, while you desperately try to fend them off using ww2 weapons. The maps are very interesting too. As you progress, the maps go from 'regular blown up germany' to hellish, distorted, and infernal landscapes that remind me of Doom. ",
            "review_score": "1"
        },
        {
            "review_text": "BOOM! Headshot!",
            "review_score": "1"
        },
        {
            "review_text": "Meh. I was a fan of the original 1 &amp; 2. With NAT, I've noticed the effectiveness of the weapons have been reduced while the toughness of the elites have increased. It's a lot more difficult to make head shots with the handguns than in Z 1&amp;2. After a so-so game-play experience with SE3, this sin't surprising. To me, this reduces the overall satisfaction. It would have also been nice to have voice with the L4D characters. There's a reason I only buy games after they've been out a while and then only on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "All the fun of SEV2 but blasting zombies in bullet cam slow mo. Enough varity of enimies to keep to you on your toes. Can become a bit of a blastathon, generally run backwards and whack head shots from range, sounds boring? Not when they are litterally swarms of the sods slowly getting closer and CLOSER! I bought this because it had the 3rd installment, I had previsously bought Zombie army 1 &amp; 2. This has 3 and an updated 1 &amp; 2, which to my reconning is a little easier than the origionals. Especially Skeletons that used to terrify me, now they're ♥♥♥♥♥♥♥ and dead easy to kill.  The 3rd installment is good, a zombie Hitler was where these games were always heading, I really enjoyed the final battle against the crazy ♥♥♥♥♥♥♥! All in all a good zombie arcade blast. Also the game has good regular checkpoint saves meaning you can dip in and out if you have to do other stuff, like make dinner and collect the kids.  Graphics are good. Game play is fun, about 20 hours here with all three games  Score out of 10. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "hail the zombie fuhrer",
            "review_score": "1"
        },
        {
            "review_text": "better than call of duty zombies.  can kill zombie hitler and other ♥♥♥♥.  basically the best zombie game ever.   rip black ops 3",
            "review_score": "1"
        },
        {
            "review_text": "11/10 A really good game! Hordes, Co-op and the Führer!",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Sniper Elite with undead yodalling.  SO MUCH SCREAMING.  IT NEEDS MORE GUNS. WHAT DO YOU MEAN SNIPERS IN CLOSE QUARTERS IS A LEGIT STRATEGY?!",
            "review_score": "1"
        },
        {
            "review_text": "An wesome zombie game in third person, headshots or die trying.",
            "review_score": "1"
        },
        {
            "review_text": "On",
            "review_score": "1"
        },
        {
            "review_text": "probably just wait till left for dead 3 comes out instead of buying this",
            "review_score": "1"
        },
        {
            "review_text": "The story is kind of a no brainer with zombie hitler,but who cares it offers very fun and intense zombie combat with cool weapons,great co-op ,and amazing gore effects .i really liked that its in the third person view i personally liked it alot more than nazi zombies from call of duty it felt alot more open and i liked the occult vibe.I must say the gore effects are awesome using grenade on a horde of zombies is extremely satisying 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. You get to kill Nazi Zombies. What's not to love about that? It is good if you play it solo but like any good co-op game, it's always more fun with a group of people.  The game itself comes with 15 campaign maps to play through and 5 maps in the superb horde mode. How long will you last against the oncoming waves of zombie hordes. And like any Sniper Elite game the good old x-ray camera returns. Watch as your bullet pierces through flesh, bone and brain as you kill zombies with headshot after headshot.  I'd be more than happy with this game if it just gave me zombies to kill, but there is also different types of zombies to contend with. You have the Suicidal Zombies which pretty much sound just like what they are. The Zombie Snipers which I love. And the Super Elite Zombie who scared the hell out of me the 1st time I saw it. And even Skeletons which I just love kicking apart.  There is a good selections of weapons to choose from to do your killing with. Rifles, Shotguns, SMGs, Pistols and a few explosives to boot as well. Enough to keep anyone who loves to kill zombies happy.  I'll be honest and say I do feel the market for games involving zombies feels oversaturated, but this to me is one of the few games that does it right.",
            "review_score": "1"
        },
        {
            "review_text": "epic game that provides a lasting immersive challenge",
            "review_score": "1"
        },
        {
            "review_text": "This game is Wolfenstein meets The Evil Dead and its the best  I recommend playing this game with friends or online, the singleplayer is great. But i got tired of killing zombies by myself  Here are some of the things the game has to offer:   You get to choose a variety of characters (Male or Female) plus the L4D gang !  A large amount of weapons, I recommend picking up the 'Preacher' shotgun whenever possible It made me feel like Ash Williams Endless hordes of ♥♥♥♥ing nazi zombies and demons.   The game is just zombie killing fun and i recommend it absolutely.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, it has a few glitches and Multi-player is broken. But is still the best zombie game I ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Enjoyed it more as singleplayer. Not a fan of the multiplayer, because players often just rush instead of soaking up the atmosphere and looking around. There were some cool things to find and some great scenery. Game gets repetitive, but a nice escape.  Worth a buy on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, the 80% discount was totally worth it. Love the slow mo cam XD!",
            "review_score": "1"
        },
        {
            "review_text": "I already own NZA 1 and 2 and picked this up on sle and it was definately worth it. NZA trilogy is a coop shooter with Zombies, it includes NZA 1, 2 and of course part 3 all in one.   I did have a lot of fun playing this game to the end in solo play and even went back and cleaned up some of the achievements. After awhile it does feel repetitive head shotting zombies over and over again but I did enjoy the levels and the side quests althought they were limited,   After about 35 hours of play I had my fill of killing zombies, I didnt get to play any co-op as I couldnt find a game so I cant speak much about the onlike community and ease of finding a game.   Nazy Zombie Trilogy does offer contorller if thats your thing, just seems like blasphemy to use one playing a pc game but hey thats me.  Anyway I would definitely recommend it while it was on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I have barely played this game at all, but from my experience, this game is amazing Got it on sale, I dont know if it's worth full price, wait for a sale, but really, this game is fun I definitely recommend this game for anyone who likes zombie shooters and third person games.",
            "review_score": "1"
        },
        {
            "review_text": "Haha time to kill nazi zombies. With the way the difficulty settings work (one setting controls aiming and general difficulty while another controls number of enemies) you can have fun on your own or with friends without compromising on gameplay either way.  Maps are pretty linear though; definitely not a lot of exploring to do outside of trying to find the hidden items in each level, and your character can't jump unless there's a small wall to vault over.",
            "review_score": "1"
        },
        {
            "review_text": "I got it on sale and so decided I would try it out. I have a laptop with poor graphics and CPU and so game plays but suffers. I would like to try it on a better PC before I give it final review.",
            "review_score": "1"
        },
        {
            "review_text": "Im looking for friends to play with on this game lets wreck ♥♥♥♥ up",
            "review_score": "1"
        },
        {
            "review_text": "great soundtrack, great gameplay and a hole lot of demonic zombies",
            "review_score": "1"
        },
        {
            "review_text": "The best Nazi zombie kicking simulator on the market. Pretty fun game aswell. ",
            "review_score": "1"
        },
        {
            "review_text": "Zombie's from hell... It takes you waay back when things were old and spooky, even you can get to kill hitler again. Wouldn't that be nice?",
            "review_score": "1"
        },
        {
            "review_text": "Fourty four ninty nine",
            "review_score": "1"
        },
        {
            "review_text": "IT IS NOT WORTH IT'S ORIGINAL PRICE (In my opinion). By this on sale with friends, if you're thinking of buying this to place solo... I wouldn't recommend that, I get really bored playing this game alone.",
            "review_score": "1"
        },
        {
            "review_text": "It's great game, great fun in multiplay, even if I'm not huge fan of WW2 zombie thing. This game have some really nice atmosphere, great sounds and also very nice graphics!. Game is something between Left4Dead, Call Of Duty II and Doom, I really like this one! If you were enjoying Left4Dead, you gonna love this one. Atmosphere is something like old Doom, at least for me. You have campaign mode and horde mode which is actual survival mode. Take sniper and go make some headshots!  *edit Bad thing is that day by day there are less and less people in multiplay...",
            "review_score": "1"
        },
        {
            "review_text": "i never got round to playing this game before and saw it on the steam summer sale so why not, game is brilliant runs on best settings on my alienware alpha no problems at all. its better to play with your mates cause this game can be quite difficult at certain points at least thats what i thought. its a must buy for sniper elite fans and for zombie fans :) buy it you wont regret it",
            "review_score": "1"
        },
        {
            "review_text": "This is a brilliant game that is only £5.99 on the steam summer sale, i found it very fun but really hard I played it on Marksman difficulty (Medium) and found myself getting murdered be sniper elites 24/7 It is still a really good game, including every mission from the originals.  I need to play the horde mode though and i think i will enjoy it. over all i give it a 8/10 headshots out of 10 i would reccomend this game to anyone intrested in a zombie sniper, people who like zombie games and people who like sniper games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just tops!! xd 11/10 wuld reckomendo!!!!! idk if it wurth teh 44 bux but toatalie wurth on $4l3!!! :))) &lt;333",
            "review_score": "1"
        },
        {
            "review_text": "This game is very awesome, for these money it gives me the full experiance!",
            "review_score": "1"
        },
        {
            "review_text": "  PLZ stop in the last leavlehow if you shot the brids they come to you and explod",
            "review_score": "1"
        },
        {
            "review_text": "This game is super fun and addicting. good way to spend several hours!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic! I've only played the first three levels of Chapter 1 but so far amazing! -The mood is great.  -I really enjoy the long levels, each one takes me about an hour and gets a bit longer with each level after.  -Combat and shooting is awesome with a great variety of weapons from WWII.  -Story is a bit entertaining. -The levels are really cool and well made. -I got scarred a couple times when the zombies horde up right in front of me and i'm low on ammo... -or when they jump out in front of you. -I feel like I'm playing through a really intense book or movie. The action shots are a very nice touch. ",
            "review_score": "1"
        },
        {
            "review_text": "waves of zombies coming at the screen plays a lot like left 4 dead but with a more focus on sniping  (going from safe house to safe house)  is awesome fun though",
            "review_score": "1"
        },
        {
            "review_text": "love it, got it when it was 80% off it is very worth it, at first when i read the description i thought i had to own part 1 and 2 but it turned out it came with them both remastered, with the first two games and 'third chapter' i say it's money well spent even at it's original price, I highly recommend getting it asap.",
            "review_score": "1"
        },
        {
            "review_text": "good game need freinds to play it with tho",
            "review_score": "1"
        },
        {
            "review_text": "  Best zombie game that you can find :3",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome.I recommend it!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun. The multiplayer is good too.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, love the easter eggs, and really chilling levels as you fight for survival.",
            "review_score": "1"
        },
        {
            "review_text": "Your boots have hit harder than your rifle.10/10",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Looks great visually &gt;Optimised &gt;Really fun gameplay &gt;Atmospheric, and pretty creepy &gt;A real blast in co-op  That's IF you can find people who still play the game that is. Single player is decent but really the game shines in co-op. It's really a shame that not many people play this game anymore, it's sometimes a miracle to find a session.  But in terms of quality, it is definitely a recommend even though the fun factor is stifled with an almost dead community.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS BY FAR THE BEST ZOMBIE GAME EVER! Too damn difficult to play alone. Get more people to play this online! It's scary AF I promise. You will ♥♥♥♥ yourself, or your money back! Hahahaha :D",
            "review_score": "1"
        },
        {
            "review_text": "This is tha 3th shooter with zombies and the zombies are nazies. The story could be better and more deeper. The story line is blank but the game play is so good that you will forget about the story. Some time there were so many zombies in the map that the game was lagging.",
            "review_score": "1"
        },
        {
            "review_text": "Good Gameplay Smooth graphic   10 / 10",
            "review_score": "1"
        },
        {
            "review_text": "Now I no longer have to suffer playing the short co-op camp. in Sniper Elire III with just one of my friends! This is the next best thing to a zombie horde game to be completely honest! I've only put in 4 hours, but plan to get in several more with other pals of mine on this. The combination of WW2, zombies, sniping, and co-op is beyond awesome, and it's 100 times better playing with your friends. Not sure about the price of it though, I feel 45 bucks is a little steep for the game for all that it offers you. I'd call it more of a $30 at most. But if you find it on sale for 9 bucks, it's a total steal!  10/10 would ♥♥♥♥ zombies again!",
            "review_score": "1"
        },
        {
            "review_text": "Now I no longer have to suffer playing the short co-op camp. in Sniper Elire III with just one of my friends! This is the next best thing to a zombie horde game to be completely honest! I've only put in 4 hours, but plan to get in several more with other pals of mine on this. The combination of WW2, zombies, sniping, and co-op is beyond awesome, and it's 100 times better playing with your friends. Not sure about the price of it though, I feel 45 bucks is a little steep for the game for all that it offers you. I'd call it more of a $30 at most. But if you find it on sale for 9 bucks, it's a total steal!  10/10 would ♥♥♥♥ zombies again!",
            "review_score": "1"
        },
        {
            "review_text": "These games serve a specific purpose and that is the joy of watching Nazi zombie heads pop off. You won't find the story very deep or thought provoking, but that's not what it's about. I'm loving the gore and the graphics. Headshots are what count in this game, so you have to be very accurate with your shooting. The combat is good overall and the environments are outstanding. I don't know if I'd spend $45 on it, but it's a bargain at it's current sale price. Go for it!",
            "review_score": "1"
        },
        {
            "review_text": "Hitler's powerful zombie army getting screwed up by a 4 man crew with nothing but some explosives and some guns.",
            "review_score": "1"
        }
    ]
}