{
    "app_id": 301690,
    "name": "Cobi Treasure Deluxe",
    "release_date": "2014-05-23",
    "developer": [
        "Cobra Mobile"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Match 3",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 174,
    "negative_ratings": 162,
    "price": 1.99,
    "description": "Help Sally the seahorse collect and match ocean treasures before they fall to the seabed. Match the falling ocean gems and play through three exciting and absorbing game modes in the perfect blend of relaxation and Match 3 fun!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/301690/header.jpg?t=1447361892",
    "minimum_requirements": "OS: Windows XP/Vista/7/8 Processor: 1.0 GHz or Better Memory: 256 MB RAM DirectX: Version 9.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Painfully simple match three game. The nautical theme feels more like a level on a deeper game but it never changes. There are three game modes each of which start out simple and slow and progressivly get faster while also introducing items that make it more difficult to make matches.",
            "review_score": "-1"
        },
        {
            "review_text": "  The game is simple but the controls are very senseable. Game starts off in a slow pace and starts to speed up. It is fun but it will get boring quick. game needs achievements and some kind of versus's mode. That would be pretty cool to have",
            "review_score": "1"
        },
        {
            "review_text": "Get this on sale and it's not bad. But not a new shiny super cool type bubble pop game. Not dynamic what so ever.  For cheep as in half a buck, it's fun.",
            "review_score": "1"
        },
        {
            "review_text": "YAM3 (Yet Another Match 3)  Pro: Good looking Some variations Simple concept F12 works Inexpensive or in bundles  Con: It's a match 3 game Basically a facebook game No cards / achievement  Overall: 5/10 (-1 gets boring really fast since it's a match 3 game) = 4/10 If you like match 3 games get it, if you get it in a bundle try it out. Otherwise pass. Voted up as it's a good match 3 game (which isn't saying much) ",
            "review_score": "1"
        },
        {
            "review_text": "simple game, just a friendly version of tetris.  0/10: 5",
            "review_score": "1"
        },
        {
            "review_text": "Please describe what you liked or disliked about this game and whether you recommend it to others.",
            "review_score": "1"
        },
        {
            "review_text": "30 min of pain, WORST TETRIS COPY EVER !!!!!! I recommend this game only if u have kids (probebly not)  Have good design and good music but on resolution 800*600 (don't know why)  Seriously don't buy it.  ▂▃▅▇█  final judgement : 45/100  █▇▅▃▂",
            "review_score": "-1"
        },
        {
            "review_text": "★ ★ ☆ ☆ ☆",
            "review_score": "1"
        },
        {
            "review_text": "the shttiest game of all tie everybody :)",
            "review_score": "-1"
        },
        {
            "review_text": "THE GAME DONT WORK FOR ME",
            "review_score": "-1"
        },
        {
            "review_text": "If you are a buying this for a younger kid then it might be entertaining for them. For people who are in their teens, 20s and 30s, or 40s...play Dr. Mario instead.",
            "review_score": "-1"
        },
        {
            "review_text": "a ♥♥♥♥ing virus rly?! steam orly?! choke on money pls",
            "review_score": "-1"
        }
    ]
}