{
    "app_id": 301610,
    "name": "openCanvas 6",
    "release_date": "2014-09-01",
    "developer": [
        "PGN Inc"
    ],
    "publisher": [
        "PGN Inc"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Design & Illustration",
        "Photo Editing"
    ],
    "tags": [
        "Design & Illustration",
        "Photo Editing",
        "Software"
    ],
    "achievements": 0,
    "positive_ratings": 399,
    "negative_ratings": 60,
    "price": 29.99,
    "description": "openCanvas is a painting software dedicated to Windows Operating System, that is suitable to beginners to advanced users. Equipped with analog-like brush strokes and functional yet user-friendly interface, openCanvas has the higher basic performance and the unique &quot;Event&quot; function that enables to record and replay the drawing...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/301610/header.jpg?t=1497937241",
    "minimum_requirements": "OS: Windows Vista Later Processor: x86 compatible processor supporting SSE2 Memory: 40 MB RAM Graphics: 1024x768 / True Color Network: Broadband Internet connection Storage: 50 MB available space Additional Notes: Supporting the pen pressure with Wacom tablet / Supporting the pen pressure with Tablet PC compatible to TabletPC API",
    "recommended_requirements": "OS: Windows Vista / 7 / 8 / 8.1 / 10 Processor: x86 compatible processor supporting SSE2 Memory: 8 GB RAM Graphics: 1280x768 or higher (recommended) / True Color Network: Broadband Internet connection Storage: 1 GB available space Additional Notes: Supporting the pen pressure with Wacom tablet / Supporting the pen pressure with Tablet PC compatible to TabletPC API",
    "reviews": [
        {
            "review_text": "Warning! This is a Review of a hobby artist. I have no clue about professional programs. The programs I used before are: GIMP, Photoshop CS6, Photoshop Elements, Paint Tool SAI  After playing around with the program for a couple of hours I have to say... It's simple. But really, the best program, I have ever used to draw. It helps a lot, if you want to draw outlines. Especially with a graphics tablet. With the built in function to smoothen the lines, you will draw perfect lines around the second or the first time trying. In Photoshop, you have to make first a reaaally big picture and draw like this, so you can make it smaller afterwards to hide eventual wobbly lines. Or in SAI, you may be confronted with vector based lines, which are perfect, if you want perfect quality outlines. In openCanvas however, all you need is a stroke with your pen or mouse, and it already looks great.  All the brushes are perfectly adjustable and easy to work with. I was really impressed by the kalligraphy pen, where it took less than a minute to adjust it to my needs, while in Photoshop, it took quite a while and didn't look good after all. Or maybe it was just my imagination. In fact, I was really impressed, how easy this little program works.  I wasn't very sure, what to expect with the filters, when I saw them advertised on the shop page. But they have some really nice little filters, which can twirl the image, make waves, pixelize(mosaic), diffuse in a very smooth way etc. etc.  The user interface is adjustable to the maximum. While it has similarities to how GIMP handles the many windows, it feels a lot more stable in handling and using.  Now one thing, I wasn't really sure if needed. But it came in handy when using. Perspectives. You can practically adjust for very impressive static structures and visual effects. It is for sure damn good to use when you are a beginner and don't draw in perfect perspectives from the beginning of your picture. But I could imagine it to be also really handy for professional artists too. (I think, I will have much fun with it!)  Rotating the picture as you need while drawing makes hard to draw lines easier and you don't have to turn your tablet upside down. Really nice to have this implemented. It is a far nicer rotation tool than GIMP, Photoshop or SAI. Also it is more handy.  The last two things (And I am sorry to put the least good things in the end) You can add text. Well, every other tool I know has this feature. I don't know, why it is worth mentioning. But okay. And.. this is ACTUALLY really neat, if you think about it. The program itself takes up only 18MB. It makes it the smallest, but best program to draw, I own.  Sure, I feel really hyped about this and I will update the review in a few weeks with a speed art and a much more settled opinion. But I hope you liked this review and it helped you considering to buy it. It is worth every dollar/euro/septim/gold coin or whatever you like to buy stuff with.  Here are the prices of the porgrams compared: GIMP - free Photoshop CS6 Standard - 699$ Photoshop CS6 Extended - 999$ Paint Tool SAI - 5400 Yen (Around 50$ And no, it is NOT freeware) openCanvas - 49,99$  If you have questions or want to correct me, just comment and I will try to answer it, correct it or add it to the review if important.  Edit #1: As I am not sure, why my 'play time' is so low, I was quite busy with it. There are actually some bugs, you should be aware of.  - Your stylus may not be recognized after using the arrows to scroll on your drawing. This isn't really a big problem, but can be really annoying after a few hours. You can also solve it by either Alt+Tab out and in again, or by drawing a line with your normal mouse.  - Sometimes, you are not able to load up a .psd file. If you want to keep working on a picture, you have to copy every layer, save it as a separate picture and import it to OpenCanvas. This happened to me only once after switching very often between Photoshop and O.C. Rather use .oci  If you find yourself having the same issues, consider reporting the bug. End of Edit #1",
            "review_score": "1"
        },
        {
            "review_text": "I'm such an amateur with painting tools. I don't have talent and I'm dumb. But this software is so amazing. It's easy for people like me to use this. More tutorials and I'm the happiest person in the world.  I would recommend again.",
            "review_score": "1"
        },
        {
            "review_text": "Don't tell my mom I draw porn with it.",
            "review_score": "1"
        },
        {
            "review_text": "This program is worth it. I have used Gimp and  Paint.Net  since 2007, and acquiring a Wacom Intous5 Drawing Tablet, this program will be a compliment to me. OpenCanvas 6 in many ways works the way you would expect it to. The interface is easy, user friendly and intuitive. You have almost all the options normally availible in Gimp.   This program has a natural feel, and it feels like less work. Using this is less work than Gimp, and a lot more options and freedom than  paint.net  offers. That is the main reason I am happy with this purchase.  This is the first non-game Software I purchased on Steam, and I am deeply satisfied.",
            "review_score": "1"
        },
        {
            "review_text": "I liked the software overall a great deal, but I'm really hoping for some kind of manual or tips for hotkeys and just a general friendly-user how-to guide of sorts. Besides that, after a bit of using it, it can be used effortlessly by its users. I'd definitely recommend this to others. =)",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy the Steam version!  I reccommend getting the version on the program's website (  portalgraphics.net/en/oc  )   ",
            "review_score": "1"
        },
        {
            "review_text": "These are my midnights now. I draw every night with this! Such a good program and I'm already very comfortable with using it! ^^ Also from my experience and in my opinion , it is waaay better than PaintToolSAI, and if you love drawing I'd definitely reccomend you this. It's a little pricy, but worth every euro.      (4am right now and still drawing.. *ω*)",
            "review_score": "1"
        },
        {
            "review_text": "This Software is the bomb diggity",
            "review_score": "1"
        },
        {
            "review_text": "For the nice price of 50 dollars I was reminded how much I can't draw!",
            "review_score": "1"
        },
        {
            "review_text": "I use Wacom Cintiq as my second screen, on this screen, I can not drawing with Wacom pen, but I can draw with mouse. It seems the openCanvas 6's bug, please fix it as soon as possible!",
            "review_score": "1"
        },
        {
            "review_text": "Was going to buy something more proffesional than this, but I bought it to test it out and I haven't bought any other drawing-programs since then! OpenCanvas 6 is really simple, got everything you need, and you can use it even if you're a beginner or someone who's been into digital art for a while! Been using so much time on this program that it's crazy, I really love it! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "OpenCanvas is a wonderful piece of software, it really is. The development staff was helpful when I requested help, also. It is good software. A new gif export was added, which works in most browsers.  As of the end of July this year, the most unique feature of OpenCanvas, the education gained from playing event files within OpenCanvas that were were found in the PG community is now gone. The Community has been taken down, so if you know where some files are, don't delete them.  Say hello to Muro on DeviantArt...and rest in peace PG.",
            "review_score": "1"
        }
    ]
}