{
    "app_id": 301650,
    "name": "Battlezone 98 Redux",
    "release_date": "2016-04-18",
    "developer": [
        "Big Boat Interactive"
    ],
    "publisher": [
        "Rebellion"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "First-Person"
    ],
    "achievements": 50,
    "positive_ratings": 515,
    "negative_ratings": 54,
    "price": 14.99,
    "description": "One of the greatest sci-fi strategy games of all time returns with remastered visuals, online multiplayer and near unlimited mod content from Steam Workshop. Experience thrilling first person action and acclaimed RTS in this explosive alternate vision of the 1960s space race.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/301650/header.jpg?t=1499374534",
    "minimum_requirements": "OS: Windows Vista, Windows 7, Windows 8 or Windows 10 Processor: Dual-core CPU with SSE3 (Intel® Pentium® D 3GHz / AMD Athlon™ 64 X2 4200) or better Memory: 2 GB RAM Graphics: Microsoft® DirectX® 10.0 compatible graphics card with 256 MB of memory (ATI Radeon™ HD 2600 Pro or NVIDIA® equivalent) Network: Broadband Internet connection Storage: 3 GB available space Sound Card: Microsoft® DirectX® 10.0 compatible sound card or better",
    "recommended_requirements": "OS: Windows 7, Windows 8 or Windows 10 Processor: Intel® Core™ i5 / AMD FX series or better Memory: 4 GB RAM Graphics: Microsoft® DirectX® 11.0 compatible graphics card with 1GB of memory (NVIDIA® GeForce® 400 series / ATI Radeon™ HD 7750) or better Network: Broadband Internet connection Storage: 3 GB available space Sound Card: Microsoft® DirectX® 10.0 compatible sound card or better",
    "reviews": [
        {
            "review_text": "So far so good! Plays like I remember, looks fantastic at 4K (well as fantastic as it can look). Still some bugs floating around but I'm sure they'll fix them. All in all, I am please and hope we get the expansions and BZ2!  Follow up: Feels like an old friend has come home. Just as much fun as I remember. No issues so far.",
            "review_score": "1"
        },
        {
            "review_text": "Very happy to see this game finally released on Steam. Finally got to experience the full BZ1 game!  Hoping for a Battlezone 2 redux soon!",
            "review_score": "1"
        },
        {
            "review_text": "I’ve always been a big fan of this game and now it’s on steam with a new remastered visuals and mods… just another great reason to play it again.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the greatest games of all time. There is no disputing that statement. I have never played a game that blended the brainpower of complex strategy with the fast-paced nature of an FPS so well. The cold-war sci-fi theme is unique and certainly not seen as often today. The mutliplayer always took my breathe away.   Shout-out to the community that worked so hard to keep this game alive until we get this HD remake. Everything works as well as we could have hoped. For those who have played the game before; gameplay and missions appear untouched; everything just looks so much better.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever! 5/5  Favourite childhood game, re-mastered perfectly by Rebellion. Jump on in for quick single player RTS campaigns, multiplayer tank vs tank deathmatch showdowns, or multiplayer RTS battles!  WIth added workshop support there is no end to the maps and missions that you can conquer!",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game and been a part of the 1.5 patch/Online forum community since 2011. I modded heavily, made dozens of maps, participated in strat tournaments, and was a very loyal BZ player for years (alias: Ian S.) Unfortunately, I got away from BZ in school when life happened, but now over the summer I've come to try the Redux.  This is a bit of an emotional game for me. My brother and I played it when I was 4, on an old Windows 95 machine. I found the game again when I was 14 and lonely, and absolutley immersed myself in modding and making maps, learning about every trick in the book to script missions. When LUA coding came out, my entire modding world was opened.  As far as the game goes, as advertised it's an awesome blend of the FPS/RTS genre. I've always appreciated how you can control and mobilize an entire army of vehicles but still zoom around in a tank blowing up crap. The campaigns are epic in this game, especially the NSDF one. There are some elements from BZ 1.5 (before the Redux came out) that I like better, but overall the Redux is much higher quality and transitions the game into the 21st century. Online multiplayer is also very fun, there is nothing quite like winning a strategy match after an adrenaline-pumping half an hour of back and forth combat.  I can't put as much effort into this game as I wish I could anymore, but I do highly recommend it to anyone who hasn't tried it before. It's classic but now new, with a small but very solid community supporting it, so you can't go wrong!",
            "review_score": "1"
        },
        {
            "review_text": "This game didn't just start the first person strategy genre, it's never been rivalled since. A perfect game. Good to finally see it on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "I'd never played BZ '98 before I bought this game, but I -had- played a TON of BZII back when I still ran WinXP, so when this popped up in my Discovery Queue, I almost fainted, and bought it near instantly. Do not regret.  It's quite a change from BZII in some ways, but it's enough the same that adapting to these differences was easy enough, and boy was it worth it. The gameplay is so nostalgic it almost hurts (I shamelessly admit I did cry a little when I first started playing), and it helped patch holes in the story for me, having only played BZII prior.  It's a fun challenge, and, as far as I'm aware, a rather unique style of gameplay that I've never really seen replicated outside of BZII (the combination of the RTS base-building, unit-commanding with the FPS player-controlled unit is an element I just love to bits, yet I can't think of any other games that utilize it).  Would I recommend the game? Most definitely, even if just to try it out! Sure, nothing is for everyone, but as they say, 'Nothing ventured, nothing gained'!",
            "review_score": "1"
        },
        {
            "review_text": "Magcannons and thumpers are bs 10/10",
            "review_score": "1"
        },
        {
            "review_text": "How can i put this Masterpiece, This Treasure,Into words?  When someone asks me what my favorite game is. or what the best game i ever played was,  It is this game and only this game I talk about,   I was first introduced to battlezone at the age of 7 In 1999, My dad had found this gem in a clearance bin at Big Lots, and had bought it with the intention of playing online over our dial up connection with his Installer Buddies from work.  At the time Joysticks as they were called were the best way to experience any simulator and fortune would have it dad had a Thrustmaster Fox 2 Pro at the time one of the best joysticks available(Having 3 Axis Or a Throttle at all Was a feat to be recoginized for controllers at this time).This Controller and Battlezone would come to be my church as I took my first steps as a gamer, And what a leap it was.The strategy,The vehicles,The ACTION! To this day I can remember it all.  Some of my best memories are of playing this with my dad and his friends and the journey it took me on as i developed my skills and mindset towards becoming Better and better, Every match utilized a different strategy there were so many different vehicles and weapons loadouts you could use that it provided endless challenge and excitement Even though I lost almost every match,  Just as the year ended I donned a New mantle that would come to be my gamertag(ReaperX2000).   Moments before the new millennium I defeated My father and his friends in a brutal day wrecker victory I built and ammased an army of scouts and an armory quickly hunting down my opponents by carefully placing my troops i ejected so i could overlook the enemy base, launching 2 day wreckers onto seperate targets so the blasts would overlap and cause the most widespread havoc,   I waited with my sniper prone trained on whatever red dot i could find as the bombs reached the peak of thier arc i waited anxiously counting down the moments before they would be in range, as they approached just above his base i took the shot sniping one of his scavengers to draw his attention.Perfect, Just as he had time to turn around the bombs dropped destroy his entire offensive wing most of his scavengers and almost all of the buildings lay in critical condition.  'Time to send in the dogs.' I ordered my wing of scouts to attack his recycler, it was a crushing blow, as the scouts many miniguns quickly lay waste to what was left of Dads installer buddy. I quickly ordered my scavengers and a couple defense turrets into the area to collect the salvage, It was time to take on the real threat, Dad himself.  My attack had been successful but in order to accomplish this task i had left myself open to attack at my original base, Fortunately i had already tucked my recyler away in a different geyser, calling it and the constructor it had built i quickly began raiseng defences for my new base, i built several powerplants and guntowers surrounding and plugging the perrimiter turrets,   I had recyled most of my scouts and sent a few to scout for the enemy repurposing all the metal i could find into tanks and walkers, and of course switching to my own walker with my favorite choice of weapons,(Flash &amp; Mag &lt;3) Dad had already utilized the time to construct his own army of tanks but he lacked defensive structures, With my earlier attack run i had gained advantage by collectiong far more scrap far quicker, He put up a good fight, Our tanks clashed in a battle of explosions for what seemed like an hour. But in the end my resources allowed me the victory, Sending in wave after wave of tanks as i established defenses on his doorstep to reclaim my lost scrap, Eventually he lost out and I claimed Sweet Sweet Victory.  This victory would be the driving force to push me to succeed in any and every video game,Memories of the different odds i have overcome would give me the confidence to take on any new challenge,And the theme of this game would place space simulators action and strategy games in a special place in my heart.My 7 Year old Mind would grow to use battlezone as the basis to judge every game upon, And to this day, No game i have ever played,(And I have played ALOT) compares to matches in this game,   This to me, is simply the best game that was ever made, and seeing it here in steam(WITH MODS!!), remastered beautifully, Leaving the real joy to this game completely untouched, Because it was just so masterfully done the first time. is a dream come true,  I would reccomend this as a 10 Out of 10 But this game is so wonderful it would simply take its score Divide by zero and multiply by infinity, Not only do I reccoment this game, this is THE game I reccomend For gamers at any point in thier lives  Thank you for reading.  TL;DR: Buy this game, It could change your life. P.S. If you have the means, USE A CONTROLLER/JOYSTICK, its where the magic of this game really is,",
            "review_score": "1"
        },
        {
            "review_text": "Classic goodness.",
            "review_score": "1"
        },
        {
            "review_text": "A childhood favorite for me. Been playing since 1998. Definately worth playing. I still have my original copy, but decided I wanted to support the re-release. I'm hoping they will eventually make a battlezone 3 if enough people buy it. It really is a unique and addicting game. There isn't another quite like it.",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game, back in the day. So much potential. Very happy that its been redone, and it looks good. Honestly, i haven't played the redux enough yet to give this the review it deserves. Graphics are pretty good on 4k display, xbox 360 controller works, voice acting and physics/gameplay are working good. Thanks Rebellion!",
            "review_score": "1"
        },
        {
            "review_text": "can you paly RTS, buil your base, control your squad, during you are in tank and on the frontline of battlefild? alone game in the world where you can do it - here! BATTLEZONE now on steam!",
            "review_score": "1"
        },
        {
            "review_text": "Mostly nostalgia for me.  Few little bugs here and there but the Dev team are fully aware of them and are working hard to rectify them. Expect a patch soon. If you have read the negative reviews, many refer to language selection issues, fear not, the next patch which is expected in the next few days will allow you to select language before launching.  In all honesty, the game may not be worth $20 but it is pretty close. It will definately be worth the money if they bring out The Red Od / Rise of Blackdogs expansions in an update but I don't expect anybody to work for free so I hope the modders get permission to bring it forward :D",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful blend of FPS and RTS.",
            "review_score": "1"
        },
        {
            "review_text": "Well I've played this alot since 98, and enjoyed Ken Miller's patch 1.5 remains a classic story. Have to admit the Redux is a bit of a cheapo change Not much has gone into it bar a few small graphic changes Not being funny, but I think a kid of 12 yrs old could have done the Redux update on a weekend ! Still I love the game , so I'm biased ",
            "review_score": "1"
        },
        {
            "review_text": "Great to have Battlezone back after all these years. The BZ 98 Redux team did a fantastic job! Looks great, 8). Death match is fun. Strategy is even funner!",
            "review_score": "1"
        },
        {
            "review_text": "Thank you for bringing this game out for a remix.",
            "review_score": "1"
        },
        {
            "review_text": "The game keeps crashing whenever I try to load from a save file, both workshop instant missions and the main campain.",
            "review_score": "1"
        },
        {
            "review_text": "very lilke this game",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. But where is Battlezone 2? I want to grab it too!",
            "review_score": "1"
        },
        {
            "review_text": "I desperately wanted to love this game as I played over 1000 hours on the sister game of the original, BZFlag.   The problem is the learning curve on controls and shooting at targets was just too difficult. It took me several tries just to get through the driving tutorial.   The tank is essentially a hover craft. Trying to line up targets is next to impossible as the momentum on even the slightest turn is ridiculous. It is next to impossible to line up a target without swinging past it.  Now, I am using a joystick, my controller of choice. Maybe the game is designed for a game controller.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Laughing at all the negative reviews, disregard them all :P Only thing I noticed when I played this masterpiece is the music was a little garbled but that's probably something on my end if anything. Plays exactly like it used to and better and all I did was run the basic movement tutorial xD This game is amazing and if you're a fan of FPSs and RTSs, this will blow your mind",
            "review_score": "1"
        },
        {
            "review_text": "Even on its lowest settings, the nostalgia is real.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a joy to come back to after so many years simply because SOVIET SPACE TANKS! I sunk too many hours into this game and its sequel to remember. Base building and space tanks for days! It was a nice mish-mash of vehicular FPS and RTS that worked so well that I can't think of a game since that has come close to this 98 hybrid. Think small-scale T.A. meets X3.  This remake, although I've played that first mission, is just like the 98 model but with shiny graphics. The gameplay is exactly the same, that is to say super-smooth. I love the interface design; You are able to easily manage units and buildings on the fly even whilst in combat. Also, native 3440x1440 support has one-up on many AAA games today.  Even if you've never played this game, it's worth the money. You will not be upset with your purchase. Dooo iiit!",
            "review_score": "1"
        },
        {
            "review_text": "Such a great game. I'm so glad to see it revitalized. I know I'll be playing it with my kids. I hope more people of this newer generation get to appreciate it.  The biggest critisism over the genre as to why it didn't take off in 98 can be summed up in this quote:  'FPS players don't like to think. RTS players don't like to die.'  This puts Battlezone into a niche for refined gamers.",
            "review_score": "1"
        },
        {
            "review_text": "Terrific example of what a remaster should be, a good facelift that leaves all of the original gameplay intact. 98 Redux is a must have for any fan of the original, or anybody else looking for something different.",
            "review_score": "1"
        },
        {
            "review_text": "yeah, its a good game, kinda wish they did battlezone 2 though, much game better imo",
            "review_score": "1"
        },
        {
            "review_text": "This is a classic. My first clan games were on the original. Good times",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game! Absolutely loved it, glad to see it getting new life! Lovely graphics enhancements while maintaining the original feel. Great work, hope to see a sequel! ",
            "review_score": "1"
        },
        {
            "review_text": "Plz buy so they can make Battlezone 3!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a joy to come back to after so many years simply because SOVIET SPACE TANKS! I sunk too many hours into this game and its sequel to remember. Base building and space tanks for days! It was a nice mish-mash of vehicular FPS and RTS that worked so well that I can't think of a game since that has come close to this 98 hybrid. Think small-scale T.A. meets X3.  This remake, although I've played that first mission, is just like the 98 model but with shiny graphics. The gameplay is exactly the same, that is to say super-smooth. I love the interface design; You are able to easily manage units and buildings on the fly even whilst in combat. Also, native 3440x1440 support has one-up on many AAA games today.  Even if you've never played this game, it's worth the money. You will not be upset with your purchase. Dooo iiit!",
            "review_score": "1"
        },
        {
            "review_text": "A classic oddity that no other game has bested. Just have to get over some archaic design.  Pros: Great hybrid of FPS/Vehicular combat, paired with RTS and base building elements. A short and sweet plot with decent voice acting. Cool vehicle designs, and runs like a dream.  Cons: AI can be infuriatingly stupid, and your tank has precious little ammo so having to go back to reload (or have it sent to you) is annoyingly common.",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS- combines first person shooter, piloting mechanics, as well as RTS elements into one seamless game. Played for nostalgia soon realized I haven't played a game like it since. Missed this one, glad to find it remade and on steam.",
            "review_score": "1"
        }
    ]
}