{
    "app_id": 301760,
    "name": "Disney•Pixar Cars 2: The Video Game",
    "release_date": "2014-10-06",
    "developer": [
        "Avalanche Software"
    ],
    "publisher": [
        "Disney Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Multi-Player",
        "Shared/Split Screen",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Racing"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Racing"
    ],
    "achievements": 0,
    "positive_ratings": 48,
    "negative_ratings": 49,
    "price": 15.49,
    "description": "Inspired by the Disney•Pixar animated film, Cars 2: The Video Game lets players jump into the Cars 2 universe with some of their favorite Cars personalities in exotic locations around the globe.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/301760/header.jpg?t=1542759432",
    "minimum_requirements": "OS: Microsoft Windows XP SP3/ Windows 7 Processor: Intel Pentium 4 3.0 GHz, AMD Athlon 64 3500+ or equivalent processor Memory: 2 GB RAM Graphics: 256 MB DirectX 9.0c-compatible, NVIDIA GeForce 6600 or better, ATI Radeon X800 or better dedicated video card supporting Shaders Model 3 Storage: 3 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "My son loves it so worth getting if you got kids that are into Pixar Cars",
            "review_score": "1"
        },
        {
            "review_text": "For love of Chrysler, what the Ford is this? Oh, this is something.   First the images shown are not from the game. They must be doctored 360/ps3 images. This game looks no where near as good. Infact this looks far worse than Cars 2006. No lighting effect, or god rays. No complex texturing or detail on the cars. This is seriously a combo of early Dreamcast and PS1. Though you can run it at 1080 with 60fps. Still the 360 version is many times better visually even running at 720 and 30 fps. Let me put this another way. Sweet Fx couldn't help this train reck. No reflection built in to the car bodies, no ambiet occlusion, no shadows(NONE), very low shading, and the headlights look painted on. This is the worst looking game I have played in well over a decade. Such a shame.   So how is the game? Great! Well not as good as the 360/ps3... The lack of visuals is so forboding. The real problem here is NO DLC! The ammount of cars in the 360 version is staggering. Chick Hicks, DJ, Snot Rod, ect. All voiced. Here there is nothing. I'm sure there is more missing as well. The gameplay feels looser as well. So overall this is the worst version of a great game.   Do buy this one. It is aweful, and easily replaces Arkam Knight in my worst port ever, since even at launch it was much better than this. Plus they have fixed that. This however is terrible. Go buy Mater Nationals instead, it is by far the best PC Cars game. Grab the Hi Octane mod and goto town. Just stay away from this game. What were they thinking?",
            "review_score": "-1"
        }
    ]
}