{
    "app_id": 301830,
    "name": "Disney•Pixar Brave: The Video Game",
    "release_date": "2014-10-06",
    "developer": [
        "Behaviour Interactive Inc."
    ],
    "publisher": [
        "Disney Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Family Friendly",
        "Adventure",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 55,
    "negative_ratings": 6,
    "price": 15.49,
    "description": "Brave: The Video Game invites players to run, jump and battle their way through the rugged landscape of mythical and mysterious Scotland. By using their wits and bravery, gamers will also be able to wield a sword and bow and arrow to defeat fierce enemies, break a magical curse and save a kingdom.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/301830/header.jpg?t=1542759492",
    "minimum_requirements": "OS: Windowx XP/7 Processor: 3.0GHz Intel Pentium 4 Class or AMD Athlon 64 3500+ Processor Memory: 2 GB RAM Graphics: 256MB 3D Video Card Supporting Shaders 3.0 (NVIDIA Geforce 8400 or Higher, ATI Radeon 2900 or Higher) Storage: 4 GB available space Sound Card: 16-bit DirectX 9.0c-Compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game.. oh this game.  Gameplay is at 60 FPS, maybe locked to it, but cutscenes are 30fps. The gameplay is just swinging swords and shooting arrows at weird 'animals' and it's basically 'these 10 doors are locked. finish one, and another unlocks until you clear the blight of some sort, and your mum is fine'  No graphics options except for resolutions. It runs fine, but there's a reason. It's looks god awful. No AA, textures are a nightmare, and is generally crap.  Don't buy, please, don't buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Game doesn't have overly graphic violence but it could easily earn E10+ Rating unlike every other game in the Disney Princesses and Fairies Pack which minus Tangled would probably only qualify for E. And what do you know, a game in that pack actually has a HEALTH meter, that does something for a change. These qualties make it a kinda odd fit for the pack which is targetted at young girls. Still the game is of good enough quality to the point that even someone of adult age-group (other than myself - I'm a bit of an oddball) could actually find it enjoyable. Throwing this game into the pack seems like their trying to toss a bone to the older princesses, some of whom may be a bit tomboyish.  As an individual game the design is not overly unique, plays similiar to Trine or Zelda-style games. The controls take a little practice to get used to because the tutorials don't show key 'letters' but rather 'colors' that correspond to the keymap on the game's controls menu. Camera is automatic but it seems to keep a good prespective so far. Weapon choice makes a large difference in how quickly mobs go down, and charms further agument that process. In addition to Action/Adventure/RPG it has some puzzle elements, which if I do say so myself are kinda interesting; Still the game would be better if it allowed for Character Swap on-the-fly instead of only in certain scenes. Personally I hold no feelings of disinterest in the game hence a 'good' review, but it doesn't stand out as something overly special either.",
            "review_score": "1"
        },
        {
            "review_text": "Well, the film wasn't entirely what I'd hoped for (maybe in a sequel someday, it'll get the Mulan-like war tale it deserves!), but me being into Scottish culture (plus the Scots got the best accents in the world bar none), I loved all the Scottish elements and loved Merida as a strong, independent female, so overall, really liked the film to pick this game up on Xmas sale!  The game takes some liberties from the film for gameplay purpose, so we get to explore a lil' more of (a stylized) Scottish/Gaelic nature, outside the films (like the Causeways I guess reminisce Fingal's Cave).  Gameplay:  Knowing that this game was made for kids... I jumped into playing this game on the most difficult 'Brave' setting (enemies have way more health and you die in 2-3 hits), so my review is in this context. Even then, it is pretty easy... particularly since you may find one of your arrow attacks extremely overpowered for practically all enemy types (despite them having elemental weaknesses to certain elemental arrows). On this difficulty, some of the bosses do prove a genuinely difficult challenge though, as you die in 2 hits, and fight a giant creature on a crowded stage. You might die a lot in Dark Souls kinda way then. (I wanna add, to avoid any disappointment like I felt - no, you won't really get to fight Mor'du =( )  Level designs are linear, but are never really boring either... they're just the right length, I'd say.   You do have to suspend your disbelief a bit in some of Merida's skills... they gave her a double jump (*groan* at this trope, but it's useful given the wonky camera angles) and ninja/parkour wall jumps. And as skilled an archer as she is, she doesn't nock her arrows, just fires them quickly like a gun (holding the fire button, charges your arrows for elemental multi-shots).   I like that you can upgrade your skills though, it has a slight, light-RPG feel to it... you won't get everything by the end of the game either. There is a Co-Op feature where a second player can play as a wisp. I didn't play with a friend, but experimented with it via keyboard a bit, and it reminds me a little bit of Tails in the classic Sonic games (game stays fixed on Merida; Wisp doesn't die, and can teleport back to Merida if lost).  There are small sequences you play as Merida's bear mum, where you just rampage and slaughter as many enemies as possible. It's not that fun, and controls are clunky too, but they're fortunately super short and easy. There are also short puzzles where you play as Merida's triplet brothers on each level. They are also super easy (designed for kids, after all). Fortunately, you can skip them when you revisit a stage too.   Controls:  Definitely recommended to play with a controller - controls are fairly solid! An enemy-lock on feature could've been nice, maybe, but you are quite busy running and dodging a variety of enemies. Could've been nice for bosses though. One of the control features I REALLY like that is kinda unique, is that you can fire at any direction you point via Right Analog Stick.  Camera isn't bad... but there are times when it could be much better, especially when platform jumping (you'll need to use your shadow for context on where to properly land; there is no falling to your death, you simply quickly 'teleport' back up with a little loss of health... so not a big deal), or hunting for secrets beyond the scope of the camera angles. It's also sorta problematic in boss fights when you move Merida 'up' the stage, and your boss stays to the foreground, you can lose sight of your target entirely and could easily be killed for not seeing an incoming attack. That said, the fixed cameras otherwise do offer some nice cinematic feeling to the landscapes.   Art Direction (Graphics/Sound):  Scenery is pretty, very lush and green (even if not super detailed) and loosely represent Scottish/Gaelic landscapes (though linear designs means none of the open Highlands). Character models, however, are not so great. Merida looks a bit unfinished, with these unintentional tired, baggy eyes. Bears look like plastic toys (not furry). I enjoy some of the cinematic hand-drawings (though they are limitly animated).  No real complaints on sound design, I enjoy the cinematic orchestral Celtic music, which are soaring and adventurous. Kelly Macdonald reprises her role, which is wonderful (because I love her and her voice!).   Overall: It's a fun, fairly solid kid's adventure/platformer game, even despite some shortcomings, and I recommend it too if you liked the movie... if you're an avid gamer, play it on 'Brave' difficulty. Again, not hard, but the bosses pose a genuine challenge.",
            "review_score": "1"
        },
        {
            "review_text": "You have to be brave to play this game.",
            "review_score": "-1"
        }
    ]
}