{
    "app_id": 301860,
    "name": "Submerged",
    "release_date": "2015-08-03",
    "developer": [
        "Uppercut Games Pty Ltd"
    ],
    "publisher": [
        "Uppercut Games Pty Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Exploration",
        "Female Protagonist",
        "Adventure"
    ],
    "achievements": 10,
    "positive_ratings": 2223,
    "negative_ratings": 776,
    "price": 14.99,
    "description": "Submerged is a third-person combat-free game in which you explore a mysterious flooded city and discover the beauty of desolation in vast outdoor environments. You take on the role of Miku, a young girl who has brought her wounded brother to the city in their small fishing boat.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/301860/header.jpg?t=1447361904",
    "minimum_requirements": "Минимальные: Требуются 64-разрядные процессор и операционная система ОС: Windows 7 64Bit Процессор: Dual Core 2.0+ GHz Оперативная память: 4 GB ОЗУ Видеокарта: GeForce 9800GTX or ATI Radeon HD 4770 DirectX: Версии 10 Место на диске: 3 GB",
    "recommended_requirements": "Рекомендованные: Требуются 64-разрядные процессор и операционная система ОС: Windows 7 64bit Процессор: Intel i5 2.5 GHz Оперативная память: 8 GB ОЗУ Видеокарта: GeForce GTX 760 or Equivalent card DirectX: Версии 11 Место на диске: 3 GB",
    "reviews": [
        {
            "review_text": "Submerged is a relaxing exploration game set in a flooded city full of life. You play as Miku, a young girl who has arrived in the flooded city with her wounded brother, Taku, in search of supplies to help nurse him back to full health. You must explore the city, by day and night, in order to find eight supply boxes, the contents of which have the potential to save Taku’s life.  The story of the game took me 3.4 hours to complete, the rest of my game time comes from just exploring the city.  Submerged’s gameplay consists of exploring the flooded city using the boat you arrived in and then using your telescope to find items of interest within the world. Once you’ve located items of interest you can travel to the buildings they are on and climb up them in order to collect the items whether they’re the supplies for the story or the other collectibles found in the game.  +It’s a good looking game, the textures and overall appearance of the game may not be cutting edge but not only do the graphics get the job done, they look nice and suit the game while doing it +The backstory of Miku and Taku is delivered to the player through amazing drawings which are unlocked four at a time whenever you find a new supply box +The story of the game itself is good though it’s very basic due to there being no dialogue in the game, the ending is also good and, in my opinion, somewhat unexpected +Submerged has a full day and night cycle which not only brings some life to the game, it also allows for some great screenshots to be taken, particularly around sunset +Submerged also has dynamic weather events such as thunder storms +The game has 86 collectibles (not including the story items) so there’s plenty to do even after you’ve finished the story, 60 of these collectibles are pieces of the city’s story so unlocking them all will help you understand how the city has come to be the way it is +The flooded city is home to a few different types of wildlife, such as dolphins and whales, which again helps to bring life to the game  +The game’s soundtrack is fantastic, the music is relaxing but at the same time it gives a real feeling of isolation to the game +The controls, particularly for climbing, are very simple making the game easy to play (I used a 360 Gamepad to play)  +/-The game has a ‘Make a Postcard’ mode which is basically a way to set up screenshots, I like the idea of it a lot as someone who loves screenshots but using it forces the game’s logo on to your screenshot which I’m not a fan of, I imagine most people won’t care hence it’s in the +/- section  -Submerged is blantantly overpriced, for a game which can be completeted in around 2 hours a regular price of £14.99 is too much  -Some of the game’s animations, in particular how Miku walks, look clunky and unrealistic -There isn’t enough music! Like I said early the soundtrack is fantastic but it just isn’t played regularly enough in the game -The game looks awful if the graphics settings are lower than medium and when I tried the game out on low I really didn’t enjoy it as much so if you don’t think you can run it on medium or higher then you may wish to think twice about buying the game  Verdict: Worth Purchasing on Sale (6.5/10)  Submerged is an excellent exploration game that is relaxing to play, has good graphics and is set in a very interesting world. I wanted to give Submerged a much higher score than I did but with its current price I simply can't recommend it, wait for this one to go on sale.   Review Copy Provided.    No drama,  Just Reviews.    El K.",
            "review_score": "1"
        },
        {
            "review_text": "Good:  Wonderful, subtle story told through environment and collectables. Nice, low- to no-stress game. Can explore the world once you complete the game to finish getting your collectables.  Bad:  Almost too low-stress. No way to fail. Creature collectables don't always unlock. Spent a good five minutes with the large whale on the outskirts of the city both with and without telescope, but didn't get the unlock. Aside from speeding you up a bit, boat boosts have no real purpose. Ending was too happy. Would have liked a more bittersweet ending given some of the revelations that occur during the story.  I'd like to see a NG+ mode and perhaps a time challenge mode patched in to give the game some challenge, but I got my money's worth for the story alone.",
            "review_score": "1"
        },
        {
            "review_text": "I thought it was a good game for what it is. It took the post-apocalyptic genre and turned it around. the storyline was something i personally enjoyed most it having the waterworld theme. With the discount i was happy to pay it.  All round good game for a bit of fun.",
            "review_score": "1"
        },
        {
            "review_text": "'Submerged' is immersive, soothing, and just a little bit mysterious. I find this a great game to relax with after a busy day; steering your boat through the sunken ruins, following whales, climbing along the trees, at times you can almost feel the bright sun, the breeze and the rain. There are no difficult puzzles, and no conflict or violence at all; this will certainly not be a game for everyone. But I find it far from boring and enjoy the slow pace, and the way the simple but moving story gradually reveals itself. The graphics are beautiful, if not the best out there, but especially the transitions of day and night and the changes in the weather make for a wonderful sense of atmosphere. I'm really glad I bought this game, and I'm sure I'll keep returning to the submerged city for more quiet, sun-swept reflections.",
            "review_score": "1"
        },
        {
            "review_text": " tldr:  3rd person explorer ONLY game, no combat. Worth ~$10, goes on sale for $5, and you'll get 8-12 hours out of it depending on how astute you are at uncovering the map and using your telescope. Fairly simple 100% achi, though it'll take a few hours.  8.5/10 for its genre, and I would buy again.     ~~~~~~~~~~ this is a page-break! xD ~~~~~~~~~~       Pros:   -game IS exactly what it's billed as, and the trailers give a good idea of what you will find -simple controls (I used kb+m; controller is also supported) -straightforward mission/directives -acceptable progress measure (map icons dull/pale after pickup of objectives) - gorgeous  graphics on ultra settings, but there isn't too much 'fluff' to obscure points of interest -easy (automatic!) return to home base upon objective collection (see CON related to this point) -mysterious aspect to certain ingame plot devices (cutscenes tell a story of their own) -inspired blend of endearing &amp; exciting, without being too cutesy or nagging -aspect of how exploration games used to be, long ago, before items were marked or outlined, or glowing, or... obvious; once you're on top of them (or use spyglass to find them) they're easy to see, but until then, you are in fact  searching  -cards, for those who like them - essentially  no bugs. I got stuck on a tree twice, but when I quit out and then continued the same game, it sent me back to the area where I first entered that level of the building (assume under 60 seconds lost time in all cases). Other than that, it's smooth and pretty. -forgiving environment; if you're a parent or busy with something else, you can walk away at any time without concern of losing progress or items or time.     Cons:   - NO RUN/SPRINT.  Worthy of metion because exploring buildings that have only a single, small, or partly obscured path to an objective sometimes must be traveresed more than once. The scenery is beautiful, but after a while the slow-run can become tedious. -No hint button. You're very strictly on your own, which isn't a problem per se, but a few of the buildings have convoluted routes. Again, enjoy the scenery. -Regarding auto-return to base upon picking up a crate: you do NOT have a choice. In other words, if you don't have all the objectives in a building when you take the crate, you'll be retruning to the building to find parts of the story. Not horrible, but worth mentioning. -$20 price tag. Too much for this game, despite how much I liked it on every level. I'd pay $10 or $12 for sure, and when it goes on sale for $5 it's a fantastic bargain. As a rule, I do not agree with a game that does not have a dollar-per-hour return on the price. As stated, you'll get about 8-12 hours out of this game, thus, this observation. (Of my ~19 hours played, about 5-6 of that was idle time).   All in all, at the $5 price I paid, I'm very satisfied, and I'll be looking for more from Uppercut Games in the future - great job guys!",
            "review_score": "1"
        },
        {
            "review_text": "A simpler version of the flag collecting and climbing from Assassin's Creed, set in an atmospheric framework that makes me think of Shadow of the Colossus. It's a bit short, and could have done with some kind of upgrade system, but you still won't be able to stop playing until you're done.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely beautiful game. This came me in mind first when I played the first 15 minutes. And I didn't change my mind.  This game is about a girl and her brother. They came to the flooded city by boat, but the brother is ill. The girl must help her brother by exploring the city, collection usable items to save her brothers life. She explores the city by boat, whenever she finds a building with a point of interest (air-drop with supplies) she climbs up the building.  Climbing and finding the main story items is very easy, that's what makes the main story very short. But you can extend the gameplay a bit, when you try to collect all the optional items during your playthrough instead of collecting them afterwards.  Good thing about the game is: you can't die. The bad thing: You can't die. Explantion for that is simple. The buildings with main story item always contains a few optional collectibles on different routes. When you grab the main story item you get instantly teleported via cutscene to your home location. If you climb up the building again you must decend yourself back to the boat. Too bad you can't do a leap of faith into the water ;)  Overall a really nice game with awesome graphics and a nice gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed Submerged, in a quiet, peaceful way. No death, no punishment, just time spent exploring and gathering. It has boating, building climbing (like a simple Assassin's Creed), and gathering of story fragments. Quite a peaceful 2-4 hour experience.",
            "review_score": "1"
        },
        {
            "review_text": "Nice and relaxing game. Finally found everything. I recommend this if you like to explore.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting sytle, and interesting gameplay, however it does get a bit repetitive, so I was finding it a little boring towards the end. Enjoyable and relaxing to play, but there is no variation in the gameplay or story at all, you're just essentially doing the same thing over and over again. Took me less than 3 hours to finish. I can't recommend it at the current price, but if you can get it for under a fiver it's probably worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "First of all, Submerged is a beautiful game. The scenery is amazing and it has a day/night cycle and different types of weather which made it all the more enjoyable for me. Though it is quite a repetative game and not as challenging as I would have liked it was still nice. It's a game to relax with.  That said, if you want a relaxing, beautiful, but not difficult or challenging game with a cute and simple story this game might just be for you. If you're looking for an exploration game like Tomb Raider or Uncharted, this game will probably not be for you.  I say get it while it's on sale if you're curious. (Y)",
            "review_score": "1"
        },
        {
            "review_text": "Deep story, beautiful artwork and setting, smooth game play. Had a great experience playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "+relaxing game +collecting for the journal +nice atmosphere +while travelling you meet any sea animals +easy to earn achievements -dry story -a bit boring sometimes -afer collecting all upgrade for boat, the boat doesn't change design In game what I missed is jumping from building to the water/diving under water to find any secret/swiming.",
            "review_score": "1"
        },
        {
            "review_text": "It's a bit of walking simulator i guess, except you know, on a boat. The gameplay loop consists of a bunch of repetitive fetch quests but it's short and pretty sweet. I felt I wanted to know more about the lore and city's back story, outwith what is drip fed to you by finding the secret locations, which you stumble across in your quest to fetch important plot devices.  The whole things feels almost like a proof of concept or a prologue to something bigger, which could be great if they mixed the gameplay up a bit, not neccesarily combat (there isn't any) but maybe some more climbing mechanics or something? More interaction with the world around you too, as opposed to simply existing in this world I would like it to have reacted to me more.  If you see it ina bundle or on sale it's worth a few hours of your time. The developers have built an interesting sandbox, I just wish there was I could do in it.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game and wholeheartedly recommend it. You play as a teenage girl in a small boat, exploring a mysterious, half-submerged city, searching for supplies to help your sick and injured younger brother. This game is all about exploration, and it really rewards you for doing just that. I was able, with a little effort (no guides or walkthroughs), to find all of the secrets in the game before finishing up the campaign. I'll definitely go back to find the last few remaining boat upgrades and get 100% completion on the achievements. After that, though, I admit that the game won't have much replay value. But, you know what? Sometimes, that's OK.  I think what I like about the game is that it has elements of other games I have played that come together in a very pleasant way. Let me unpack that. There is a female protagonist who does a lot of wall climbing and narrow ledge shimmying, like in Tomb Raider games. You pilot your boat around to explore the world map, exposing new locations to go to, kind of like with The Legend of Zelda: The Wind Waker, except instead of islands, you are exploring buildings that are half submerged. And then the overall theme of a protagonist who speaks with an other-worldly tongue and who is on a quest to save a family member in a beautifully-rendered environment makes me think very much of Brothers:A Tale of Two Sons.  The story of what happened is told via cryptic pictographs and so isn't completely clear, but that adds to the air of mystery surrounding everything. The ending also feels a little abrupt, but is satisfying enough. Overall, this is a nice, relaxing game to play if you like exploration. You can't die in the game; nothing attacks you, and you don't kill anything. There is occasionally some slight creepiness but mostly there is an air of loneliness to the whole thing.  If you are in doubt, get this on sale (which I did), but I felt like the game was worth the time and money I spent on it.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, i think im half through this game and i can say my honest opinion. It is good exploring game, with nice soundtrack, soothing athmosphere and a nice simple story. Gameplay is well done, you shouldnt have any problems with controls or climbing and stuff. Animations are a bit slidy (its 2015, cant you make characters walk instead of skating...?), but overall graphics are beautiful. So its an ok game, but the price...17,99 euros, really?! Im all in supporting game companies and so on, but seriously? Way overpriced if you begin to compare other developers (not the big companies no no) and the quality and amount of gameplay you get as hours.  I recommend if its on sale, but buy something else for this price.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this, as a casual game, for players who're getting tired of those intense action, shooting or adventure games. No fighting, no bleeding, no death, and still story-rich and beautifully drawn. All you need to do is to collect stuffs to promote the story process, which also reveal some 'secrets'.   A young girl run away from her home with her little brother (who is injured and feeble). They settled, temporarily, in a flooded city (actually tha whole world was flooded and invaded by strange green plants) to get the boy recovered. As you proceed in the game, you'll discover more and more secrets of the city, the planet and the girl's family. You may also notice that the girl is changing- she is being...somehow...possessed by plants?! Whatever, you'll find it yourself.   Casual, calming music though it is a little monotonous. The models of characters are not perfect to the details but scenery is still wonderful. It may be a good adventure game if some battling is added, but I like it this way. 8 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "I was expecting a little more out of this but it was still nice and relaxing. You're basically boating from building to building looking for items to bring back to the 'home' area. If you're not sure if that's what you want then you probably shouldn't buy it. I think it's worth getting on sale.",
            "review_score": "1"
        },
        {
            "review_text": "+ beautiful world with breathtaking sunsets and popping colours both day and night + that feeling when you pass by a whale shark + reminds me of Oddysey: Journey to the West +calming soundtrack  -Story is nothing new -collecting all the secrets is a chore that doesn't really pay off (since The City's Story is pretty obvious) -ending is a letdown/ it takes away all the emotional stakes ",
            "review_score": "1"
        },
        {
            "review_text": "*nods head* *smiles* I rather liked this for its mindless zen the collectables are tedious at best but the boat was very calming to explore in and i found the story very enjoyable and im suprised at how it acually ended. It was a sweet little game with great music.",
            "review_score": "1"
        },
        {
            "review_text": "Nice Idea! I had fun on my playtrough. (3-4h)  Though there are some rough edges. Especially audio-wise: The Main Character is barely understandable. Almost all sounds are missing some sort of 'positioning in-space'. They are bone dry on my headphones and really detracted from the experience.  The Ending was hilariousely unstatisfactory though...  ",
            "review_score": "1"
        },
        {
            "review_text": "Beautifully indie puzzle platformer. Lots of overlap/inspiration from Ico and Shadow Of The Colossus but without the combat elements. The game defeats a lot of the frustration from traditional platforming by not allowing the player to fail. If there is a drop you cant make - rather than the fall killing you - the game simply doesn't allow you to perform the action. This rewards curiosity and walking off of the main path rather than punishing the player for exploring.  The only real negative is that a few animations are a little off. Not game breaking or anything but mildly less immersive/polished as it could be. Its also around 2 hours long - which I guess is somewhat to be expected. Soundtrack is phenomenal.",
            "review_score": "1"
        },
        {
            "review_text": "Very enjoyable. A gentle game to pass the time Wonderfull",
            "review_score": "1"
        },
        {
            "review_text": "Very atmospheric. This is basically a puzzle game. Beautiful graphics and music. If you tend to have gamer A.D.D. then this is NOT for you. This game is about patience and an enjoyable time. Not constant action. It is a small game. You are not saving the world. I enjoyed it quite a bit.",
            "review_score": "1"
        },
        {
            "review_text": "Not for a gamer looking for a challenging platformer, but worth a look for anyone else.   A really polished indie exploration game. I'm rarely one for this sort but it's so polished, looks beautiful and runs superb thanks to UE4 and talented devs. Interesting story, well designed climing. Really impressed by the level of polish. Nothing is broken, everything feels and looks good. Been following the dev diaries for this for some time and really pleased with the results.",
            "review_score": "1"
        },
        {
            "review_text": "So I recieved a key for this game a few days ago and played through it, it's a really short game which is great because it matches my attention span. Don't let that drive you away from this game though, just sit back and let me spin you a review.  Submerged was developed and published by Uppercut Games and it revolves around a young girl Miku and her near death Brother Taku in a world that seems to have been drastically changed by the effects of global warming. We play as Miku throughout our adventure and we have to explore a large flooded city desperately looking for suppiess to help our Brother. Our goal is to find these supplies by climbing our way up tall skyscrapers in an assassins creed style way of parkour and getting to them by using our squrrelly as ♥♥♥♥ boat.  Heres a question, where did she get these crazy climbing skills? She lives in a flooded world with basically no way of climbing anything and she's a pro at this stuff, I still have trouble rock climbing with a pully system and yes, I lift.  Anyway, in order to find these supply crates we have to use our telescope to keep a look out for flags on certain buildings, and after every crate we get treated to a four slides revealing a bit more of our characters story.  But Justin? What else is there to duu? That's the main story, Ten crates, 40 slides (I can maff) and about an hour and a half of in game time. There are a few side quests you can do such as finding a bunch of journal entries that give us the story of what happened to the city, finding all of landmarks across the ocean or finding the 8 different types of animals hanging about. Just 8, the rest are dead, Just like my dreams. I'm sure if you did everything there is to do in this game you'd top out at maybe 4 hours for a slow run or 2 and a half to 3 for a more focused run.  Over all this game is beautiful, the ambient sounds are great and the controls are responsive and easy, easy enough to let my four year old take a crack at the game, and while the story is neat it's not worth what the publisher is asking, I really did enjoy the game, but there isn't enough content here for a $19.99 price tag. Rocket league is $19.99... Take the $20 you were going to spend on this and grab something with a bit more depth, but pick this game up when its 90% off on the next steam sale because it's a good way for us to actually finish a game for once and make us think we're making progress on our steam libraries.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Such a simple and awesome game. No violence, no ♥♥♥♥♥♥♥t, just an amazing place to explore and admire while learning what happened to the world and to the main characters. Absolutely recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, simplistic and relaxing. Just what I needed. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Not much more than a Shadow of the Colossus clone. This is present in both the incredibly overused climbing and telescope mechanic. Even the SotC's storyline of bringing a loved one back to life while oneself is 'turned' is present here. I really hope the developer didn't spend too much time on the beautiful visuals, which are in fact only enjoyable for the first hour or so because the level design, texture, and architectural diversity is so incredibly monotonous. This game could have been a treat of urban exploration if these elements had been crafted rather than so cookie-cuttered. There's something to be said for the foolishness of much effort without sufficient reflection. This game is a clear example of an indie title without indie creativity. It is true that this game does offer a non-violent alternative to Shadow of the Colossus, but did it have to be so obviously unoriginal in these gameplay and story components?",
            "review_score": "-1"
        },
        {
            "review_text": "Submerged is a nice and straightforward exploring game. It has no difficulty level since there aren't any puzzles (except for the achievements) and you can't die. The scenery is really pretty and the story is very open to interpretation, which I personally enjoyed a lot. I finished the game in 6 hours, taking my time to accomplish everything, but it was very soothing and relaxing. It felt a bit like Shadow of the Colossus, but very easy. I can really recommend Submerged if you want a nice and easygoing game.  Plus: - Nice camerawork - Open, wordless storytelling - Easy controls, no game over - Great soundtrack  Min: - A bit short maybe - The achievements can be glitchy - No indepth story or quests, repetitive gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Just finished. Nice scenery and music, it's a relaxing game. Sadly it's quite short and repetitive, but it was kind of addicting trying to find all the secrets. A warning, I couldn't get my logitech controller to work (and the sailing controls are terrible on the keyboard)...I have heard that wired xbox 360 controllers work, but I haven't been able to test this myself.",
            "review_score": "1"
        },
        {
            "review_text": "This is a simple(ish) puzzle/exploration game, where the player is required to hunt for items to unlock the story as to why the characters are in the predicament they are in.  The puzzles are not overly difficult, but are complex enough to class the game as mildly challenging. There are additional items to discover along the way, thogh only those located at the tops of buildings are required to complete the game. I managed to get 100% in all collectibles in about 3.5 hours, though I wasn't rushing.  Graphically, the game is beautiful to look at, and the music is hauntingly beautiful. The game is a refreshing change from frustratingly difficult games I've played in the past, and the lack of combat is also refreshing. The plot is very good, and along with the atmosphere I was pleasantly surprised to be quite moved by the story as events unfolded. There was also a mild level of suspense as the story went on.  In all, I would recommend this game, since it's different, beautifully designed and written, and moves at the pace you want it to. Definitely worth the price, and if you can get it in a sale, then you'd be crazy not to.",
            "review_score": "1"
        },
        {
            "review_text": "Great if you are looking for some relaxing exploration game. Nice story, very short though, I finish it in about 4 hours and that's becasue I searched for every item and got all the achivements. Buy it when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": " 'Find your inner peace in Submerged.'",
            "review_score": "1"
        },
        {
            "review_text": "short, easy, but enjoyable",
            "review_score": "1"
        },
        {
            "review_text": "I wish there were a sideways thumb, for 'meh.' This is not a game. There is no skill, you can't die or even make mistakes , really. There is only one path no matter what path you take, the story goes the same way. So this does not make it a game, but an interactive story. It's not even all that interesting of a story. I finished the main thread and did a little exploring, collecting secrets and other trophies, but by this time I was too bored to go much further. The world is enchanting but small, sort of a one note thing. So, meh. But it was pleasant and if it's on sale, probably worthwhile. Thumbs up it is then .",
            "review_score": "1"
        },
        {
            "review_text": "Submerged was interesting enough, however wait til a steam sale. It has assassin creed style climbing. Easy, peaceful, and I never had to worrry about falling off a giant building 7/10",
            "review_score": "1"
        }
    ]
}