{
    "app_id": 301970,
    "name": "Screencheat",
    "release_date": "2014-10-21",
    "developer": [
        "Samurai Punk"
    ],
    "publisher": [
        "Fellow Traveller",
        "Samurai Punk"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Split Screen",
        "Indie"
    ],
    "achievements": 34,
    "positive_ratings": 1157,
    "negative_ratings": 99,
    "price": 11.39,
    "description": "Screencheat is a ridiculous competitive split-screen first-person shooter where everyone is invisible, so players are forced to look at each other’s screens in order to win. Supporting both local and online multiplayer, combat in Screencheat is fast and furious with a wide variety of one-hit kill weapons.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/301970/header.jpg?t=1556233847",
    "minimum_requirements": "OS: Microsoft® Windows® XP or newer Processor: 1.4GHz or faster Memory: 3 GB RAM Graphics: Any from the last 4 years DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "An enjoyable game for those who think CoD matches are too slow.  Screencheat requires you to be on the move constantly whereas games like CoD, BF, and the likes all have their campers. In this game, other players can see exactly where you are(at least from your/their point of view) so camping is useless since they can see what you are seeing and kill you from behind. Because of that, you have to be moving non-stop while also glancing at the other three screens to see where the opponents are. It's a lot harder than it sounds because glancing at the other screens is a near requirement to survive however the intensity of the game makes it hard for one to glance away from your little quadrant on the screen. The maps are quite small so there is little to no moments for reprieve during a match lest you be blown away by a well aimed grenade. Certain map functions like air vents increase your mobility and allows you to do sneak attacks but be prepared to be shot out of the air due to the predictability of the air vents.   There are only two gamemodes at this time: A free for all Deathmatch and a King of the Hill match. A King of the Hill match is basically camping(if you can even call it that) at a specific location to gather points while waiting for the inevitable death to claim you in the form of a blunderbuss or a grenade. Deathmatch currently only supporst to 10 points per game so a player has to get to 10 kills max.   Currently, there are two maps available. The first is a Museum map with a huge fossil in the middle. There is a ramp that leads to the top, an elevator that leads you to the top floor, and an air vent that drags you to the floor below it. It's quite easy to score points on this map (IMO) because the ramp makes enemy movements extremely predictable. The second map is a garden with air vents on the bottom of the floor that can boost you to around the middle of the map or even farther. The map is slightly symmetrical in it's shape and is a lot harder to get kills on(for me at least). One positive note about this map is that in a 4 player server or 2 player server, the map's color changes so you can easily locate the enemy. In a two player server, one half of the map is blue while the other is red. In a 4 player server, the map is split into quadrants with a different color in each. Despite this, I still failed at this map compared to the Museum :p  A small thing to note is the kill feed which is EXTREMELY satisfying. More often than not, it gives a small line at the top of the screen that says '_____ creamed ____' or something that basically says that you got owned. A few times, the entire screen would be filled with the text in CAPS basically rubbing it into your face that you were killed or that you killed someone. It's hilarious but causes you to screw up because you can't see where you're going and you cam be killed by another player in the few short seconds the message stays on the screen. But it is satisfying XD",
            "review_score": "1"
        },
        {
            "review_text": "Everything I hate about split-screen in one game I absolutely love.",
            "review_score": "1"
        },
        {
            "review_text": "i looked on my friends screen, he got mad at me.",
            "review_score": "1"
        },
        {
            "review_text": "    Introduction     Screencheat is competitive split-screen first-person shooter where everyone is invincible, so players are forced to look at each other’s screens and kill their enemies mysteriously with one-hit kill weapons in order to win.        Gameplay       Pros       Now you are allowed to do what you’ve been secretly doing in your whole life.     Bring back to my childhood memories where I and my brother or our friends played split-screen shooters game. We liked to glancing over at each other’s screen, so we could find and annihilate them. And we would be like “Get off of my screen area you ♥♥♥♥♥♥ cheater! Freaking eagle eye!” and we would start to fight. LOL. (During our childhood we were playing on Playstation one and two only apparently).     The person who did not really enjoy shooting game or even did not like shooting game at all before might falling in love with this type of shooting gameplay.      The platforms are built colorful in purpose I think. It's actually to give a clue to other players to give more accuracy and confidence to know where your enemies are. (Striking map design).     Really fun to play with friends.      Silly weapons     The game is so original. Never found any games that resemble to this kind of gameplay before.      Cons       Minimal contents (come on; need more weapons, maps, game modes, and other new improvements whatever it is just add more fun stuffs).    Not much people know this game yet.       Control     Fine control just like other shooter game.        Replayability     Of course will be back again to kick some asses fun with your friends.        Verdict     7.2/10",
            "review_score": "1"
        },
        {
            "review_text": "Okay, if you look in the dictionary for the word 'awesome', you'll see a screenshot of this game. I recorded this for Youtube and I played it with my girlfriend and I swear, I had a smile on my face the entire time. The idea of this game is everyone is invisible and you must screen cheat to know the location of where they are.  The first thing I noticed when I opened up the game was the music. The music is fan-♥♥♥♥ing-tastic and it fits well with the atomsphere and most importantly the gameplay as well. The level desgin, I can't imagine how it could be better. The different colors for different locations makes it easier to know where your opponent is, not to mention the landmarks that serve the same purpose. There are shortcuts in the maps you can take to quickly get to another location quickly while throwing your opponent off aswell. Theres a small, but fun arsonal of weapons to choose from. Things from a candle stick to a big ♥♥♥ revolver for 360 no scoping n00bs. Also, funny player models to choose aswell. I was surprised to find Slender Man to be one ofthe selections, although all of the characters are one solid color, ranging from red to purple, but none-the-less keeps the atmosphere fun and entertaining to the eye.  If you were a person who played 007: Golden Eye as a kid and hated your neighbor friend for screen cheating every damn time with that small midget character, you will have a straight up nolstalgia attack. I more than reccomend you buy this game because they executed this game beautifully, gracefully, and hilariously.  13/10 Piggy Points  ",
            "review_score": "1"
        },
        {
            "review_text": "Screencheat puts a fun and intense spin on typical Competitive-Multiplayer FPS games by taking away a main element of typical FPS games and intensifying the use of another people rarely use efficiently. In this game, everyone is invisible, and it is really difficult to find them other than what the game title suggests you to do: Screen cheat, that being, looking at other players screens to determine where they are. Now by the sound of this it seems very difficult, but the intensely colorful environments and uinique areas of the maps make this far easy than as if this mechanic was in another game.  On top of this unique mechanic the developers make the game revolve around, the variety of gamemodes and customization are what make this game so much fun. From the classic deathmatch to capturing and running around with a pinata, playing this game with others is a true party (especially with 8 people at once!). Also, the customization, mutators, and silly announcers are sure to get a laugh out of you.  When I statrted out playing this game I had a hard time trying to kill ONE guy, let alone the other 3 at once (I started playing this right as soon as the game got out of Beta). Despite me failing hard at this game it was difficult to stay mad because the style of this game is just too damn funny. Instead of throwing my controller across the room I was too busy rolling around on the floor laughing. Of course eventually I got way too good at it and now people avoid me when I try to play, but that's another story.   So to sum it up: Screencheat is a funny spin on typical FPS multiplayer games that is sure to give you a good time with friends and just about anyone online. ",
            "review_score": "1"
        },
        {
            "review_text": "I mean its fun with freinds.  Not fun to cheat people you can't then laugh at.",
            "review_score": "1"
        },
        {
            "review_text": "A very interesting game that puts a new twist on FPSs. A must have for any group of friends that are looking to practice their cheating abilities. Too bad it's overpriced :/",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those Why hasnt this been done before? games. Everyone who has ever played a multiscreened first person shooter with their friends knows about screen cheating. We've all blamed our friends for doing it, while simultaneously snuck a quick peek at their screens to gain an advantage. It's part of the experience. The guys at Samurai Punk have taken that simple Idea, and ♥♥♥♥ing ran with it. In this game one is forced to screen cheat. All the characters are invisible, so the only way to findout where someone is, is to look at their screen. and It's hard work. There is a lot of information you have to keep track of in a match. But, there are so much going on to help you. First off the level design is brilliant. Each of the levels, for now there are only three, and laid out and colored to let you know roughly where someone is just by quickly glancing at their screen. A quick peripheral look will tell you everything you need to know. Each shot you make also reveals your location with various particle effects. If someone tries to shoot at you, you will know where the shot came from. It's simple and intuitive. you are outfitted with a number of various weapons to actually do the killing, and these weapons are all ♥♥♥♥ing fantastic. There is a simple shotgun, but incredible effective. There are weirder things with the Giant bouncy ball launcher, and the 'Chargey Horse.' and some more standard stuff like a melee weapon (although this happens to be a giant candle stick), a rifle, and a grenade launcher. They are all Beautifuly designed and no one weapon feels more useful than the others. they each have their pros and cons and all have their idle situations. The trick is that you only get one per life, so choose wisely. There are a few bugs that need fixing, while we were playing there was an awful lot of simultaneous kills, and a few other random glitches. Nothing game breaking though. You guys, this game is incredibly fun. It reminds me of my time playing old fps games like Golden Eye, or Perfect Dark with a group of friends. but with such a new and refreshing take on the genre. Plus, It's an absolute delight to look at.   If you are interested in checking it out, you should watch our video of Screencheat          YouTube™ Video:  Let's Play: Screen Cheat! 【Fight like a Scrub Club!】&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "The only splitscreen game you are aloud to 'screencheat'.",
            "review_score": "1"
        },
        {
            "review_text": "It is an utter shame to see a rather fun game have next to no player base. I would really recommend it though it's probably better to play with a freind rather than rely on public games",
            "review_score": "1"
        },
        {
            "review_text": "Guys this game is AMAZING!!! Hard, but not too difficult to make you rage quit. A very fun FPS game, definately try this out!",
            "review_score": "1"
        },
        {
            "review_text": "It's like reliving the old halo ce glory years and not feeling guilty about it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very good. And dont need too much pc strenght. and it is more fun when you play it in local. and you could play online even with the local players. it is simple and hard. and the servers are very good the ping is always good and fast. if you like party games.This one is good for you.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful fun! Well put together game (with its share of bugs, try flying around with flappy jump on multi-layered maps and you'll see what I mean) and an aweseome concept. Great fun for local multiplayer or online with friends. Online is nice &amp; stable too.",
            "review_score": "1"
        },
        {
            "review_text": "Earlier today I posted a negative review about this game. After realizing my issue, I've come to fix my review. For some reason when I start Screen Cheat, it tries to open in fullscreen (the way I've set it to open by default) but can't properly display the window. (or lack thereof) I've remedied this issue by pressing Alt+Enter after launching. I'm not sure if there's another fix for this, but that's what works well enough for me at least for now.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful game, you won't be dissapointed. Execpet maybe by the lack of players at times.",
            "review_score": "1"
        },
        {
            "review_text": "I can bomb my friends with teddy bears.  10/10 would teddy bomb again",
            "review_score": "1"
        },
        {
            "review_text": "Simple but fun as ♥♥♥♥. Amazing idea for a game, 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game takes 360 noscoping to a whole new level.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this because we have 4 Xbox 360 controllers connected to my PC in the living room but no decent FPS to play using them. There was also a little nostalgia for games such as Goldeneye 64 and Perfect Dark - where screen-watching was an enevitable but somewhat humourous 'cheat'.   This game has far exceeded my expectations - it's a great party game to crack out and even less experienced FPS players have a chance in the wide variety of matches that can be played.  Highly recommended for living room gaming - lots of tension but also lots of fun!",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun little game, it's an interesting and succefully fun concept but it feels like just that a concept. With visual polish this game could be really engaging but as is it's a few minutes of fun with friends. I mostly recomend it just because there are so few games that really support couch competitive.",
            "review_score": "1"
        },
        {
            "review_text": "Looks like awesome fun, but why is there no one online? I spent a few minutes playing the practise mode of this game which after running around for 10 minutes couldn't figure out how to complete the objective  Edit: 8/8/15 (changed to thumbs up) Found a couple of games online and it's really fun! Will recommend to a bunch of mates next time it's on sale for some right old times",
            "review_score": "1"
        },
        {
            "review_text": "-Awesome concept -Incredibly fun to play, especially when using mic chat -Soundtrack not only fits the mood. but is really good -Style of design is suited to the type of game Screencheat is -Weapons allow each player to know their strengths and weaknesses  Only downsides are the amount of weapons (not very many!) and how unpopular this game is, thus resulting in no lobbies to join.   Overall, a fantastic game that is guaranteed to ruin your friendships! ;) ",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game while my friends were over and we played for the next 4 hours, this a great couch game (or in my case 4 chairs surrounding a tiny monitor) for groups of people",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games to play when you have some friends over. I really recommend it! :)",
            "review_score": "1"
        },
        {
            "review_text": "It is absolutely hilarious, fun and addicting, while extremely gratifing. I would recommend it to anyone who is looking for a noteworthy party game.",
            "review_score": "1"
        },
        {
            "review_text": "I Loved The Game I Just Dont Know what controller you need for it. I USed A Xbox Controller And I Dint Work,Any Help? ",
            "review_score": "1"
        },
        {
            "review_text": "why wouldn't you want to play this game. Relive your screencheating glories of being a kid. We all did it  The only problem with this game is no one is playing online",
            "review_score": "1"
        },
        {
            "review_text": "fun game, but it's literally based around a gimmick. not the time i would put too much time into, but good for casual fun.",
            "review_score": "1"
        },
        {
            "review_text": "a great co op game for friends, but the community is a bit dead. The concept is fairly unique and the weapons are pretty fun to use. I wish it had more stages and more modes, but if you treat it as a couch co op game, it's great.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good, need to play it more though!",
            "review_score": "1"
        },
        {
            "review_text": "High octane levels of shinanigans. Good times will be had by you and your friends.",
            "review_score": "1"
        },
        {
            "review_text": "Great game and very competitive. If u have friends at your house alot, this would be a great game to play instead of splitscreeen FPS's",
            "review_score": "1"
        },
        {
            "review_text": "shoot invisible people, is it really that hard of a concept to grasp?",
            "review_score": "1"
        },
        {
            "review_text": "Love it! This game is just so fun to play, w/ friends or online. The only downside is the lack of community, so get out your wallets and buy this game, and recommend it to all your friends and help the community grow! +1",
            "review_score": "1"
        },
        {
            "review_text": "This is a 'laugh so hard to almost ♥♥♥♥ your pants' fun kind of game. It's best played with friends and enjoyed for the silly FPS that it is.",
            "review_score": "1"
        },
        {
            "review_text": "Screencheat. The multiplayer topic not many of us have said about since N64 day's of GoldenEye. But now, Aussie (yes!) studio's; Samurai Punk and Surprise Attack! Games have made a game where the only way to win, is to screencheat, and this game is called... Screencheat (not a very original name, I know). In this multiplayer only shooter that can be played locally or online (or a bit of both) has you and up to three friends battle it out in the five arena's that have been made, where you must only do one thing, KILL EVERYONE! But it's not that simple because, everyone is invisible so you must screencheat to know where they are. Obsiously, many of you will go; 'But wouldn't you only see your screen on an online match?' Well the answer that wheather you are playing online or not, you will see everyone's screen's. I really enjoyed this game, I played mostly with my brother and... it ruin's your LIFE! (ish). It's just so fun, knowing that your enemy is somehwere, but you don't really know where he/she is. My only real problem is that there isn't exactly enough content here, as I said, there are currently only 5 maps, FIVE. And while the six or so game modes including 'Murder Mystery', which is basically Cluedo: The Videogame. Maybe having Workshop support would fix this problem. I also found a few bugs here and there, but I'm sure they will be patched out. Overall, I really enjoyed this game and hope it is constanly updated. Not many maps and qutie a few bugs do ruin it a little bit, but the funny things that pop up after killing someone are just funny. For a game that recently came out, I enjoyed it, just make sure you have lots of friends. I'm giving it 8/10 Times I slamed my hand on the table because I got killed. (GO AUSTRALIA!!!)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Probably one of the best games to play at LAN parties!!! Very simple to learn and play with a cool verity of weapons to keep things interesting. I can't wait to see more maps created but all the different game modes are keeping me busy for now!",
            "review_score": "1"
        },
        {
            "review_text": "Don't worry, I wouldn't kill you, *shoots*. Oh baby a triple!  11/10 would get triple again.",
            "review_score": "1"
        },
        {
            "review_text": "Funnest game I've played for a long while. I hope the game community never dies and last for a long long while. I'm glad to be playing the game near the day of it's birth.",
            "review_score": "1"
        },
        {
            "review_text": "Just played this for the first time! Had A lot of fun doing a 3 player match with frineds! Highly Recommended Video to come!",
            "review_score": "1"
        },
        {
            "review_text": "I made a video preview to show off some of the features and gameplay of this game!         YouTube™ Video:  IndieView - Screencheat + Giveaway!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "COME ABOARD THE BLUNDERBUS MY FRIENDS, WE SHALL BEAR BOMB TO A PINYATAFUL VICTORY.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very very very good. I like the unique weapons, the unique idea, and the unique maps. The newest update (wall_hacker, Temple, Loop, Mutators, Team Games) is really good.  You should definetly play this with friends",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! So fun to just pop in a few rounds now and then. All I wish is for more people online :'(  Come play!  Also, I wish there was a way to use the mouse raw input instead of setting a look sensitivity in game. That way I can use the exact same sens throughout multiple games. Other than that and the amount of players online, this game is fantastic! Buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "Fun ♥♥♥ game but no one is online, anyone wants to play?",
            "review_score": "1"
        },
        {
            "review_text": "awesome game, bet the dev at Pax East 2014 so i got some copies for free :D. Just a shame no one plays it :/",
            "review_score": "1"
        },
        {
            "review_text": "I killed someone with a horse and a toy pony. 8/8",
            "review_score": "1"
        },
        {
            "review_text": "Stupid ♥♥♥♥♥♥ keep looking at my screen like what the ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Just yes.",
            "review_score": "1"
        },
        {
            "review_text": "Screencheat takes a negative aspect of gaming, screencheating, and turns it into a neat concept and an incredibly fun game just by making every player invisible. Feel free to check out the review video below or read the text-version instead. Your choice!         YouTube™ Video:  Swash! ❧ Screencheat Peek (Beta Review)&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "By far one of the most entertaining games I have played this year. With friends you can screw around for hours and trust me we did.         YouTube™ Video:  Let's Play: Screen Cheat! 【Round One FIght!】&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Brings back memories of playing Syphon Filter on PS2 and screen watching constantly. Shiiet I even got Tony Abbotted. 10/10 would Abbot again.",
            "review_score": "1"
        },
        {
            "review_text": "So simple, yet so funny. I've noticed it's really a hate-it-or-love-it game between my friends, so I suggest you to try it from some friends or watch some gameplay videos online to find out if that's the game for you, but I definitely love it. Online is great also, as long as you play with friends and with a voice chat. Trash talks are part of the fun.",
            "review_score": "1"
        },
        {
            "review_text": "Cool cool cool",
            "review_score": "1"
        },
        {
            "review_text": "Screencheat is an amazing game. It is, um, fantastic. You can watch screens, and cheat, and be a pinata.",
            "review_score": "1"
        },
        {
            "review_text": "Is the reason you stopped playing competitive FPS games is that irritating-as-sh*t-kid that screen'hopped' (as we call it in Denver) and beat you every time? Or are/were you that kid that owned everyone in Goldeneye and Halo because you cheated?  Then this is the game for you.  Pros: -Well designed Local Multiplayer -Fantastic with three-four friends -Easy to use controls -Colorful maps that make the game easier to pick up -No learning curve if played FPS games -Great play modes, including a mode where all players only get one shot, then wait until everyone else has taken one until they shoot again (or the timer runs out) -All around hilarity and fun -Available on the HumbleBundle Store, so you can feel good about buying the game  Cons: -Boring with only two people -Playing online is a nice feature, but isn't nearly as much fun when not with friends -In-game voice chat ay help if added, but steam chat works if playing with friends -Not too much variety in maps, so they can get old quickly. But still fun for a couple hours every other week  In the end, this game is well worth owning. It won't be your most played, but it is a great party game like Starwhal or Mount Your Friends. If nothing else, support the game for being clever and the first (and probably last) of it's kind.",
            "review_score": "1"
        },
        {
            "review_text": "Screencheat is full of what I love in a video game; fun, action, and changing experiences. Every time you scream and realize that you just got hobby horsed frrom behind, or realize that you shot your only bullet at nobody, this game becomes so entertaining to me. Each weapon provides a new thrilling approach, and the concept of having to keep track of so much at the same time thrills me constantly. Finally, the game never feels stale because it is always different. Never do you 'figure it out' and master the game and just spam something- the screen cheat element makes nothing quite that simple.  All in all, I love the concept, the graphics are good enough for my tastes, though they could be better, and the weapons are nice. Though I think balance might need a little work- sometimes I wonder about the hobby horse.  My only complaint is about the maps. Sure, they're nice, they let you easily screencheat, yes, the colors are nice. But the actual level design itself leaves a little to be desired. Maybe it's that I feel that all of the maps were too similar, or that there weren't enough, but I think that they are the game's greatest flaw. A level designer tool or a mpa pack being released would probably fix that problem, but at the moment, it feels slightly limited.  But if you have 4 people who like to play, this is still a blast.",
            "review_score": "1"
        },
        {
            "review_text": "Taking the undoubtedly most complained about aspect of any game with a split-screen deathmatch mode from the 90s to early 00s, and turning it into a central part of gameplay. This is pure genious and a great throwback, as well as a forward thinking game, that shouldn't go unnoticed to any fan of multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. loads of fun!",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game, even though the online community has dwindled it just gives the game a closer community.  There should really be an achievement or unlock for reaching level 100 though...",
            "review_score": "1"
        },
        {
            "review_text": "One of the wierdest yet most fun multiplayer experiance, the best I've had since TF2 ",
            "review_score": "1"
        },
        {
            "review_text": "I keep asking nicely for people to only look at their screen, so i don't know how they keep finding me...  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game gets crazy since you can only find people through looking at there screens",
            "review_score": "1"
        },
        {
            "review_text": "Have not played yet, no servers! If it wasn't for Jerma985 and Star_ (youtubers), I would give it a bad rating. (REALLY WISH I COULD PLAY!!!)",
            "review_score": "1"
        },
        {
            "review_text": "Le nostalgia don't look at my screen shooty game :,)",
            "review_score": "1"
        },
        {
            "review_text": "I love this games its so much fun with friends but my problem is that it wont start for my computer so that disapoints me but still a great game to play",
            "review_score": "1"
        },
        {
            "review_text": "I ran an organization for my college. At one point, I ran a tournament called the Indie Rush Tournament. In this tournament, each round would feature a different indie game where everyone earned points. After 5 rounds, the top 4 players went on to a final round. I made this game one of the rounds and it was so much fun! I normally don't like FPS that are only multiplayer but this game though, this game is an exception because of how it is played. Everyone is invisible! They only way you can find someone to shoot them is but SCREEN CHEATING! Hints the name. I also have to give the dev props for constantly updating this game and keeping it fresh. Fun! Get it! GET IT NOW!!!",
            "review_score": "1"
        },
        {
            "review_text": "I usually don't suggest games to people unless I absolutely think they are great. I'd suggest this to people, so this is a great game.  Although there's a small selection of maps and games, I have no doubt that more things will be coming in the future. I think this is the best investment I've made in quite some time.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really awesome and I love the concept, but when I played there were 3 servers total and only 1 was public. If you get this game with a bunch of friends, sure, but don't expect much/any online play at all.  It's not that I wouldn't recommend this game, it's just that you really need to know exactly who you're playing with. For couch co-op it's basically unparalleled. But you won't be playing randoms online.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, gimmicky shooter to play with friends--however, it quickly runs out of content, as the lack of variety in guns, maps, and game modes causes the game to become quickly repetitive. It's just not worth the current asking price of $10. Pick it up when it goes on an extreme sale. I feel bad putting a negative review here even though I enjoyed the game, but this game is desperately needing an active community to provide custom maps, etc.",
            "review_score": "-1"
        },
        {
            "review_text": "Soo this is how hacker does it XD  This game is very glitchy and alot off bugs but is still fun with friends :3 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like it. FPS games are fun, and so are local mp games. But Screencheat is a one trick pony due to its obscure game mechanic of invisible players. Aiming is incredibly difficult even if you know almost exactly where your opponent is, and after a while the difficulty in aiming becomes unfun. The alternate game modes and mutators add nothing to the experience due to poor design. Screencheat alters the core game mechanics of FPS games too much, and is therefore not comparable to games such as Perfect Dark or 007 or Halo. Splitscreen is a wonderful thing, and screen looking is a fun part of split-screen games, but invisible players just don't work.  Buy Towerfall instead.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ game. Don't get fooled. Gets real boring real fast. Doing the same ♥♥♥♥ over and over again.",
            "review_score": "-1"
        },
        {
            "review_text": "9/26/2014  0 players online and no single player with bots................would have had a better time buying a bottle of liquor and lighting the rest of the money i had left on fire then purchasing this game as in the current state it is a wasted space with no players online    9/30/2014  I wanted to add I did get to play one game and it is an incredibly fun game , but like i said in my original posting there are no playes online 99% of the time until the player issue is fixed i would not purchase it     10/23/2014  We have found life on mars!!!!!!!!, there seems to be an increase of players online usally 2-7 players",
            "review_score": "-1"
        }
    ]
}