{
    "app_id": 302080,
    "name": "Bus Driver",
    "release_date": "2014-06-03",
    "developer": [
        "SCS Software"
    ],
    "publisher": [
        "SCS Software"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Indie",
        "Driving"
    ],
    "achievements": 0,
    "positive_ratings": 923,
    "negative_ratings": 339,
    "price": 5.59,
    "description": "In Bus Driver, your job is to transport passengers around an attractive and realistic city. You must drive to a timetable on a planned route, whilst obeying traffic rules, and taking care not to upset or injure your passengers.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/302080/header.jpg?t=1447361929",
    "minimum_requirements": "OS: Windows 98/ME/2000/XP/Vista/7/8 Processor: 1GHz Pentium III or equivalent Memory: 256 MB RAM Graphics: OpenGL 1.3 compatible 64MB AGP with hardware T&amp;L DirectX: Version 9.0 Storage: 300 MB available space",
    "recommended_requirements": "OS: Windows XP/Vista/7/8 Processor: 1.5GHz Pentium IV or equivalent Memory: 512 MB RAM Graphics: OpenGL 1.5 compatible 128MB PCI Express with hardware T&amp;L Storage: 300 MB available space Sound Card: DirectX compatible soundcard Additional Notes: DirectX compatible gamepad or steering wheel",
    "reviews": [
        {
            "review_text": "A lot of people don't recommend because they come to this game thinking that they would shoot cops and kill people. What the heck were you thinking? This game is what it sounds. You drive. You drive. And you do missions. No free-roaming(which kinda sucks) but missions. If you want to drive a bus and pick up people, buy it. If you want to shoot people and drive cars, get GTA4 or Saints Row 4.",
            "review_score": "1"
        },
        {
            "review_text": "I bought the Euro Truck Simulator 2 pack for $19.99 when it was on sale, and I found this added to my library a few days after I got the pack. This game is very good to pass the time, and has decent graphics. However, it is not so much of a simluator as a game and there is no free-roam capability (but you can still drive anywhere while playing a mission). This is simular to Euro Truck Simulator 2 in the way that it is very picky; you get points docked for not turning on your blinkers while switching lanes, and the controls can sometimes be a challenge around corners. I recommend you should go through the controls before playing your first mission, because they don't tell you on their own. Another thing: You can't manipulate the camera. Most of the time, the camera is fine, but when driving in the neighboorhoods where there are a lot of trees, they get in the way of your view. The camera sometimes tries to move to help but usually doesn't make things better. The traffic lights also seem to be rigged; they don't stay green if you're approaching them. This annoys me a lot when I'm driving in the city, where there are 5-lane roads that are completely empty, and I am speeding down one towards a green light, which suddenly turns yellow (for what seems like a fraction of a second) and then red. 200 points lost for a traffic light offense. The AI of the other cars on the road isn't the greatest it could have been, too, and they don't seem to do anything when you honk at them. Despite its few disappointments, I still think this is an excellent title by SCS Software, and I think you should buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Simulaion fans should be having a good time in this. A flawed but fun ride with detailed penalties and that penalties makes you nervous all the time while driving. It enables you to focus and concentrate for not doing mistakes so your hands will be locked to the game while riding the bus. And in that focus moment, when I hear passengers screaming, It scares me to death and I jump on my chair. Not the best simulation but you can get it on sale or in ETS pack.    Pros:",
            "review_score": "1"
        },
        {
            "review_text": "Not sure how, but I managed to masturbate to this. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Not sure how I feel about this game, it is fun when it works....but it isn't when I get penalised for 'overbreaking' which is nonsence as any amount of breaking seems to be too much. Maybe my set up is wrong or something but its only thing stopping me from coming back to it, otherwise it is the sort of thing I'd spend some time on. They just don't want you to stop the bus!  I reccomend it if you can play it well.",
            "review_score": "1"
        },
        {
            "review_text": "The game looks old lets start with that right away. Not saying it looks terrible but does look old. However the resolution does support 1680*1050 so thats a plus. So it looks good on a modern system as in you dont see any black bars on the side. The game is very arcade like. The bus does feel heavy and does take some time to stop and you get penalized for not using blinkers and braking to hard and so forth. You get bonus points for not running red lights and using your blinkers.  The people act like cardboard cutouts. They do not move they just disappear into the bus and out of the bus. The city is big and somewhat ok looking. The fast food places where you drop people off have animated signs and their is weather effects in the game like snow. The camera view is not great. You have 2 views one in the very front and the chase one. The chase camera is a little on the lazy side and doesnt always give you a good view. I went with the front of the bus view for better control of the bus.  The music is terrible and not good. Sound effects are good. My Xbox360 gamepad I did finally get it to work however I could not get the braking right so I used Joy to key. Its free and works well. You can look this up online to download and use. They do have different buses you can drive so thats a plus. Overall I would recommend this if you can get it on sale. The original asking price of $10 dollars is a lot on the steep side. I bought it online for $4 dollars with 7 other games. The sale is still going on for another 12 days. Bundle Stars online. Also the other nice plus is the missions dont last all that long. Its very arcade like game.  So I finished the game. Took 7 hours. I had fun playing it. Some of the faults of the game that stand out lane changes penalties sometimes are random. Bus can go out of control very quickly. A very much arcade like experience.",
            "review_score": "1"
        },
        {
            "review_text": "Driving in this game is pretty clunky by today's standards and I swear it's not even analog? Or very bad attempt at it. But it's really fun to be driving around in cities picking up passengers and trying not to make them barf from all that unexpected hard braking. Prison levels are fun since you can drive with no restrictions so it's a long race to the prison haha. My only annoyance is that AI cars stop too fast. They brake from fast speed to stop almost instantly which is very annoying in traffic jams.",
            "review_score": "1"
        },
        {
            "review_text": "Driving a bus is alot harder then I thought it was. Also, this is a game I am more likely to play like once and then never again, I bought it in a bundle with Euro Truck Simulator and so I was like 'Since I bought it, why not play it?' then I began to play it, but I would recomend buying this game on sale, or if you're really into busses. Fun game, glad I now know what it's sorta like to be a bus driver,   7/10  Seven outta ten because it's not one of thos games you'll play alot, maybe a few times and then never again... But it is a fun game, and interesting.",
            "review_score": "1"
        },
        {
            "review_text": "This is a surprisingly fun little gem. Graphics are dated but entirely pleasant for this game. It is a great game if you only have a few moments and want to run one route. Scores are calculated for each route so there is replayability in trying to best your previous score. I picked this up on sale for about $2.50 and couldn't be more pleased.",
            "review_score": "1"
        },
        {
            "review_text": "This game is 7-8 years old, i loved playing as a kid and i just bought it again on steam and i still love it. This was made by SCS the makers of Euro Truck Simulator but don't get your hopes up, its not as awesome, its an old game but it still can be a little fun if you like older games. I recommend this game though even though it's not really worth the 8 Euros, get it off of some bundle or on sale or something",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game when I was a teenager and I remember it sooooo well, but it's a shame it's not free roam, well unless y'all choose 2 :P. The passengers and braking is a bit annoying, but I think the bus games after this have gotten better, but at the same time... slightly worse. Confusing?",
            "review_score": "1"
        },
        {
            "review_text": "Tried slowing down at red light, scared the living shit♥♥♥♥s out of the passengers, went past red light. lost 300 points :( 10/10 Would Slow Down Again",
            "review_score": "1"
        },
        {
            "review_text": "Very Challenging and Fun would reccomend if its on sale",
            "review_score": "1"
        },
        {
            "review_text": "My most played game.  Also. . . . Better than Air Control.",
            "review_score": "1"
        },
        {
            "review_text": "Remember the old cruisin' USA style games for N64? That's what this is like, except buses. However, unlike just flat out racing, you have to pay attention to your braking, traffic lights, turn signals, proper door operation, etc. Very arcade style - and not so simulator like - but fun to play. Get it when it's on sale.  One of the cons - I'm using a Logitech F310 gamepad, and the steering is so finicky. I've tried adjusting the steering deadzone and non-linearity but I can't get the steering to turn quckly when I want it to turn. Might just be the game controller, as I remember playing this with a wheel when it first came out and it was fine.",
            "review_score": "1"
        },
        {
            "review_text": "More game than simulation -- New York Bus Simulator 2010 has better models and more precise controls -- Bus Driver replays a simple premise over and over again. The world is large and offers a variety of drives, though lacks realism and good traffic AI. Nevertheless the game is fun and addictive. For me, the average of ten minutes per mission is enough to get a bit of reward (versus committing an hour or more to NYBS2010).",
            "review_score": "1"
        },
        {
            "review_text": "A highly recommended game for those who like vehicle simulator games. -But the only thing i dislike is the brake gauge meter is overly too sensitive as it would hit up the red zone far too quickly.    Overall-3/5",
            "review_score": "1"
        },
        {
            "review_text": "Best part was when I broke everybodys necks",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game! I got it in a bundle with ETS2 and some other driving games, and I recommend this game, the controlls are smooth ,gameplay is atractive even if the graphics are a little bit outdated",
            "review_score": "1"
        },
        {
            "review_text": "I have played lot of games, but nothing is as good as this game.  It is a open world game where the graphic and story is mutch deeper than in witcher sage (Wichter 3 looks lame if you have played this game) It is a hell of a ride from one busstation to another. Can you get the people into the bus? Can you bring them to the next staion? Have they paid the ticked? Oh my good is this a game great. I played this games 1000 of houres, I had the cd version befor. I bought this game again, because the developers deserve the money!!!!!! If you like driving a bus this is the game you need. Drive from A to B, from B to C, form C to D and now it comes, and only here you can do it, drive, wait it is coming soon, yes FROM D TO A or B. What decision will you make! And yes it matters.   Use one key to roll forward, one to roll back, one for left and one for right. You think this is everything -No. Use Enter to open and close the doors. You do not need a Controller, because it is not working!!!!! It is a real pc game - and only for Pc, not like the bad Dark Souls series!!!   You can hear the passengers screaming!!!!!!  What a game, what are you waiting for buy it!!! Just do it!!! Just do it now ;)",
            "review_score": "1"
        },
        {
            "review_text": "Decent game, and not a horrible simulation games like most others.",
            "review_score": "1"
        },
        {
            "review_text": "This is obviously a niche game, so unless you know what you're buying, be prepared for disappointment. The game is great for what it is, but it is what it is: a slow paced game meant to simulate real life scenarios. If you enjoy speeding down the street in your fast car while playing GTA or NFS, this game might not be for you. Also, SCS' trucking games are different too, because between cities, they don't have that many rules to keep you tied. Bus Simulator feels more restricted, because you play in an urban area. You have to mind the street lights, the cops, watch your speed, be considerate of your passengers, etc... This all means the game is not bad, but it ain't for everybody either.",
            "review_score": "1"
        },
        {
            "review_text": "When I first saw this game on steam I didn't think it was a serious game. Probably because I was in a not so serious mood. Reading the reviews at that time I still could not believe it was a serious game. I was under the impression it would just be a game where you could screw over passengers and what not. Hours later I was not busy trying to cause accidents but I was busy trying to be a responsible bus driver. This game became very serious.   I really enjoy this game. Driving on the highway has never been this calming. You just have to put on some background music and off you go! This game even got me to use blinkers! I have never bothered in any game with blinkers but in this game I really do try my best to keep to the rules of the road.   Ofcourse no game is without a flaw or two and the same goes for bus driver. My biggest annoyance with this game is the timer. I understand that, as a bus driver, you need to be on time at the next stop. However, especially in later levels, this is almost impossible to do. Even if you were to drive through red lights (point deduction of 200) you will not make it. I suppose thats realistic as most of the time bus drivers are not in time but seeing as how it does count up at the end of the level I feel that that could have been made a little better. Not to mention that no matter which bus I drive there is an automatic speed limit on it. There are other busses in the same level that are going faster then I am.   All in all it's a nice game to play. If you have some money to spare and you would like a nice calming game and ignore the flaws that I mentioned then get this game. :)",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I don't know where to begin. Once I had a dream about the greatest heroes of all time: the modern day bus driver. He is mostly calm, drives at his best all day. This is what you have to become once playing this game for even a bit. Your job isn't just transporting needy passengers from A to B, but more of a task calling for a hero. You are that hero. You are a bus driver!!",
            "review_score": "1"
        },
        {
            "review_text": "the passengers didn't like fast",
            "review_score": "-1"
        },
        {
            "review_text": "This was a great game...a few years ago. When it was made, everything was very well made. Now, though, the graphics seem very low quality and the view is enlarged on newer monitors, making evrything look stretched. Although this used to be a game I played all the time, it simply isn't the same as it used to be,",
            "review_score": "-1"
        },
        {
            "review_text": "Not for me.  Dated looking, even for the release date.   Compared to other driving sims out there I think it could be better. Interface is clunky, driving feels unrealistic and simply not enjoyable for me.   Thought I would like this as a casual play but I was disappointed.  Would not recommend/10",
            "review_score": "-1"
        },
        {
            "review_text": "Rubbish, you get penalised for braking too hard, the time targets are simpy impossible to meet without driving like a maniac and losing all your points, and you spend more time at traffic lights than driving.  Sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "The controls are -terrible-, trying to go around a corner is an absolute nightmare. All I can say is, I'm glad I didn't pay anything for this one. I will not be playing it again.",
            "review_score": "-1"
        },
        {
            "review_text": "This games gives the feeling of an unfinishged, rough-edged game. Doesn't worth playing even for free.",
            "review_score": "-1"
        },
        {
            "review_text": "I really didnt like this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I rammed a bus into a pole. Accident? No, I played GTA before hand.",
            "review_score": "-1"
        },
        {
            "review_text": "need four speed",
            "review_score": "-1"
        },
        {
            "review_text": "I don't even know how to describe it, it's just bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Created on a lazy Saturday afternoon. Aweful to play. Driving is fine, but...  * Traffic is ridiculously bad:  - Everyone is driving at the same speed. No chance of switching lanes in a decent way.  - When there are multiple lanes, no one is using the right lane ???  - Traffic doesn't ever switch lanes. 4 Lanes and a traffic light? No one but you is going left or right.  * Timetables are impossible to keep:  - Even on full throttle (finger on forward ALL THE TIME), it is hard to impossible to stay on schedule.  * It's just driving around:  - There is no other purpose. No achievements, no missions, no nothing.  * Bonus and penalty system is super bad!  - Do something right 100/100 and get maybe 10/100 bonusses. Do the same thing WRONG?? Penalty 100/100.  - Transporting prisoners requires to follow a helicopter. Even on full throttle, you get a penalty for 'not following helicopter'??  I bought this 'game' (?) in a bundle. Do seriously not buy this! PLEASE!!! :)",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth anything in my opinion",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a Bus Driving Simulator. The Bus Drives. Find something better to do with your time.          YouTube™ Video:  Bus Driver - SIT DOWN!&nbsp;",
            "review_score": "-1"
        }
    ]
}