{
    "app_id": 302190,
    "name": "Amerzone: The Explorer’s Legacy",
    "release_date": "2014-08-22",
    "developer": [
        "Microids"
    ],
    "publisher": [
        "Microids"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 93,
    "negative_ratings": 50,
    "price": 3.99,
    "description": "The first adventure from the author of Syberia and Syberia 2, Benoît Sokal. In Amerzone you'll travel through enchanting landscapes, from Brittany to tropical forest.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/302190/header.jpg?t=1478596774",
    "minimum_requirements": "Минимальные: ОС: Windows XP, Vista, 7, 8 Процессор: 233 MHz Оперативная память: 64 MB ОЗУ Видеокарта: DirectX compatible Video Card Место на диске: 100 MB Звуковая карта: DirectX compatible Sound Card Дополнительно: Mouse, Keyboard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Played 15 years ago, it was a game with a graphic never seen before, even today it looks amazing, they should do a remake with full-HD videos and images!",
            "review_score": "1"
        },
        {
            "review_text": "This game certainly hasn't aged well, HOWEVER it had a nice charm and i'm not one to judge graphics too harshly, i go based on story.  The story was interesting, and while the game was short (4-5hours)  I loved how it really tied in interesting topics such as dictators, the importance of cultural traditions, and letting nature be. I found it all engaging and fun.  Love Benoit Sokal's work :) Playing this early game was a treat.",
            "review_score": "1"
        },
        {
            "review_text": "So i`ll start this with some bad news. I personally had some problems with the game. Sometimes the screen would stay small and windowed, other times the game would freze up and the worst thing that happend was a gamebreaking glitch that made me start from the beginning of the game. The game got stuck in such a way that I could not give items away, no mtter how far I got back in my safe files.   The reason I am telling this now, is becouse this may not be a problem for your game, and therefore it should not be part of my review of the game. Overall I enjoyed the game and it`s story and if your game dose not break like mine, it would make a better experriance for you. Now on to the accual review.  Preentation: From the beginning of this game, it is clear it is an older one. The graphics are really low qulaty and the animation can be a bit wonky, but you quicly get use to the older graphics and apriciate what is going on with the story.   The game begins with you as a journalist on his way to speak to a profesor, when you enter his lighthouse he tells you that he is dying, and that you must bring back an egg to the Amazone. You then find the egg and the profesores plane and you are on your way. The presentation and premess is really simple, and that really helps the game, since it is very basic in itself. You can read more story if you want too, but it is not necesary in order to enjoy the game.  Gameplay: The game is a point and click game, and you have to progress to the next area via the professores plane. The plane is the hightlight of this game, it can transform into many diffrent kind of vericels such as a helicopter and a sub-marine, it also has a grabeling hook whitch helps throughot the game.  The gameplay is really simple, but the exploration in this game is really well done, since you see many interesting locations, and you can roam more or less free and find out how to progress. It is hard to explain more about the diffrent areas whitout spoling the game, since it is very short, but you get to go to the amazone, underwater, an uncerground hangar and other cool locations.   Charecters: All the charecters are really flat and uninteresting, but really this game is more about exploring and discover the truth about the egg you are carrying. You don`t really know much about your own charecter and as said any other charecter is not really interesting to talk about.   Visuels: Eventhough the game looks old, the visuels are the stroingest part of this game. All the diffrent locations are buetifully crafted and looks very good. There is also a great veriaty in locations, that helps the game very well.   Music/Voice acting The main theme of this game, is pretty good, and it is clear that the creator liked it, since it seems to be some of the only music in the game.  The voice acting is pretty decent on some parts, but not that great on othersm it is pretty mixed here.  Story: So the story is simple; get the egg to the Amazone. There is not a huge plot anywhere to be found here , but really this game did not need it, it survievs on simple exploration, whitch I really enjoyed doing.  Conclution: The game is a fun point and click game, that is well made and very funny. It can be a bit hard to know what to do at times, but overall it is pretty simple and good. If you game for a story rich gaem, you would have to look elsewhere, but if you want a simple and fun exploration game, you would properly like this.",
            "review_score": "1"
        },
        {
            "review_text": "A fairly boring title. The graphics have aged well, all things considered, but the gameplay basically consists of 'hover over everything on the screen just in case it's useful, and wander around until you happen across something that moves the game forward'. A fairly useless model of gameplay, and, in light of other titles available to play, this is one point-and-click adventure to pass on.",
            "review_score": "-1"
        },
        {
            "review_text": "I guess if you like a resolution of 640 x 480 it would be ok. However, I DON'T, and find this program crappy. I sure am glad that I barely paid much for it. I will be deleting it. Its not even worth the storage space on my drives even though I have 8 TB's. I defintely would NOT recommend this game unless you are playing it on a computer that is about 20 years old.",
            "review_score": "-1"
        },
        {
            "review_text": "Holds up remarkably well. I like Sokal's games, even when they're mechanically uninteresting. The atmosphere in he art direction and the fantastic scripts more than make up for it. Amerzone is a particularly mature title, exploring themes of life and death in a refreshing way, and this thing came out in 1999. If you want a good example of making the best with what you got, this game definitely fits. It's five bucks and worth every penny.",
            "review_score": "1"
        }
    ]
}