{
    "app_id": 302240,
    "name": "Chernobyl Commando",
    "release_date": "2014-06-06",
    "developer": [
        "Silden"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "Shooter"
    ],
    "achievements": 0,
    "positive_ratings": 95,
    "negative_ratings": 352,
    "price": 6.99,
    "description": "26 years after a fatal accident in Chernobyl Nuclear Power Plant that covered half of the Europe in clouds of radioactive smoke, a large group of terrorists took over the area, trying to steal all the remaining radioactive waste - and use it.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/302240/header.jpg?t=1447361943",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: Pentium Dual Code processor or similar Memory: 1 GB RAM Graphics: Video Adapter compatible with DirectX 9.0c (Pixel Shader 3) with 512 MB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "After the iconic STALKER series from GSC Game World, not many shooters have gone to the Chernobyl area wholeheartedly.Chernobyl Commando dedicates its whole story to the infamous area in Ukraine and, like its name suggests, organizes a pretty intense encounter throughout the ruins of the location.The game tasks players with stopping a group of terrorists from making off with radioactive material from the irradiated plant.hile the game does surge forward with the plot, it's a paper-thin one as basically the player needs to follow the terrorist convoy with the stolen radioactive materials throughout that area of Ukraine and in other locations.In terms of actual gameplay, Chernobyl Commando wants to deliver an old-school shooter experience in which players run around mercilessly killing anyone who stands in their way. In practice, however, it's like an odd mix between actual old-school shooters, like the iconic Painkiller, and a realistic military experience, like Battlefield or Call of Duty.The result is a game with a wobbly first-person camera, realistic guns that have a hilariously bad accuracy, and enemies that are more or less bullet sponges.The actual shooting is also disappointing, as it seems that the only accurate weapon is the sniper one. Enemy AI is also erratic, as sometimes foes will just run in the middle of the battlefield, while other times they'll just shoot at you from huge distances.The actual levels are relatively well designed but, while they suggest the idea of an open environment, they're mostly filled with invisible walls.In terms of graphics, Chernobyl Commando is adequately bleak for the desolate environment, but its colors are a bit too washed out for its own sake. The soundtrack is utterly disappointing, not just because it's generic but because it consists of around 30-second clips that loop around in a disjointed manner. The voice acting is mediocre and relies a lot on military slang that doesn’t impress anyone.What's more, the game lacks any sort of multiplayer.Chernobyl Commando is an utter letdown. From the shooting to the movement, the actual content, or the visuals, the game disappoints in all sorts of ways. Overall 4/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Heh... Lets be honest then, There was only 3 good things in this game, no long cutscenes, animated menu with perfect looking (in game is much much uglier) and game idea / plan, and of course Chernobyl and Pripyat. Well... first thing i noticed, Lada Samaras and 1960s Dodge Chargers rusting on Red zone? Never seen or heard before (They said 'perfectly and carefully remapped Red Zone' ?). Bad and stupid Al, lot of bugs and lag. Map barely looks like Chernobyl and Pripyat... and textures etc are low quality. Also killing enemy is even hard with turrets, but they can kill you with few shots. Also, you wear all weapons with you all the time. (4 heavy sniper rifles, AK47 and SMG, and 9mm silenced handgun). So... really... yeah... If you want 2004 looking game and like lag, then enjoy. Worth trying if free, just dont buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "I have a halfway decent computer and (Like i can run FarCry 4) and this game when i open it the menu is animated and its cool but when i get in the game i cant even move its so laggy. I legit have reloaded the game multiple times and it just wont work and its getting annoying and buying this was a waste of money in my opinion. 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "Well lets start this shall we ?  First of all this game has one of the worst optimizations I have EVER seen, this game runs like sh*t and the graphics aren't all that preatty. My bf3 runs better?  Second of all the 'map' dosen't even reminds of Chernobyl. They just made endless field with trees and buildings that don't even look like they been damaged by a nuclear explosion, so then I wend to so called 'reactor' that was a small building that was about a size of a fairly small shack..... Third of all why is there a bunch of farmers with guns running around trying to kill you? At least thats what they look like. I mean what I bearly played of so far is just attack, defend, attack and defend. There is much throught put into the game, and really you carry like 50 guns with you?! Overall you cannot improve this game in one area and make it good, you would have to re-make the whole game.  If you want bad optimization and bunch of farmers trying to kill you, then your welcome to buy this so called 'game'.",
            "review_score": "-1"
        },
        {
            "review_text": "couldn't dismount from turret so i just uninstalled",
            "review_score": "-1"
        },
        {
            "review_text": "dont buy this game its really bad bad bad on anything just if you want hurt any one you hate him buy it to him as gift",
            "review_score": "-1"
        },
        {
            "review_text": "What the fk is this......... I dont even know where to start. I got it on ♥♥♥ in a bundle (The only one I ever bought) and apart from this I got some okay games (Postal and some others). But this....... this 'game' is by far the WORST FPS, dare I say anygame I have ever had the unfortune of playing. This game makes Ride To Hell Retribution look like... a good game??   But, I must rate it possitive.  Its easy to uninstall, thanks to Steam's easy usage.  Edit, no its not even worth that.",
            "review_score": "-1"
        },
        {
            "review_text": "The Game is awesome. it barely needs any resources and i don't even need a screen to play, as the game window does not pop up at all. Unfortunately its no fun. I can get a click the taskbar game for much less. (just to clarify the game doesn't start up at all)",
            "review_score": "-1"
        },
        {
            "review_text": "I've never be able to get it to actually run. First game I've ever gotten from Steam that didn't work at all.",
            "review_score": "-1"
        },
        {
            "review_text": "gamme made by right sektor jew banderite and kill the russia 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "  That interesting game, mabe cause remember me to stalker cop so i thing thats a god game",
            "review_score": "1"
        },
        {
            "review_text": "This is why you shouldn't let your kids publish sh*tty games on Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "its good enough. small optimizion, and its going to be realy good. however, this is not meant to pepole whice cant survive a small lag everytime there is a save game. also, i dont remeber there is a desert in eurpe, but OK. 6/10.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game...Enjoyed it and liked it more than the ''better'' shooter games like Cod , and other ♥♥♥♥...At least on this game there are no 12 year old ♥♥♥♥♥♥♥ , who sit around all day and die in cod multiplayer haha",
            "review_score": "1"
        },
        {
            "review_text": "36%",
            "review_score": "-1"
        },
        {
            "review_text": "pls get this cansur off my steam library plss i got breast cancer off this gaem 0/7 where am i",
            "review_score": "-1"
        }
    ]
}