{
    "app_id": 302210,
    "name": "Curse: The Eye of Isis",
    "release_date": "2014-08-22",
    "developer": [
        "Asylum entertainment"
    ],
    "publisher": [
        "Microids"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Survival Horror",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 64,
    "negative_ratings": 21,
    "price": 1.99,
    "description": "Strange things are happening at Great Britain’s museum of natural history in 1890. A gang of ruthless thugs has broken into the establishment, the Eye of Isis Egyptian statue has been stolen, and a mysterious fog has overtaken a number of areas of the museum killing and transforming all it comes into contact with.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/302210/header.jpg?t=1478597263",
    "minimum_requirements": "OS: Windows® XP/Vista/7/8 Processor: Pentium® III 600 MHz Memory: 128 MB RAM Graphics: GeForce III or ATI Radeon 9000 Storage: 700 MB available space Sound Card: DirectX compatible Sound Card Additional Notes: Mouse, Keyboard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "For whatever reason my entire review got deleted when I went to post! Ugh! Long story short, this is a fun survival horror game that was unfairly maligned when released. Solid game play with an adventure feel like mixing Resident Evil 1-3, the Silent Hill series, Eternal Darkness and the Indiana Jones movies. Definitely give it a check.   Pros:  -Old school survival horror gameplay -Decent graphics with fun monsters to fight, excellent locations to explore and entertaining bosses -Excellent, creepy sound design -Engaging story with 2 characters to switch between -Travelling inventory save/storage character is well-implemented -Satisfying campaign length (took me about 10 hours, some of my gameplay time was spent paused) -Solid selection of weapons -Cool mix between puzzles, exploration and combat  Cons:  -Clunky controls and unable to remap movement keys (you get used to it) -Story conclusion is somewhat half baked -Character models could use some work -2 different characters but no different abilities -More melee weapons would be fun -Body part targeting mechanic is under-utilized (necessary in boss fights but really nowhere else)  Rating: 7.8/10  Fans of overlooked, underrated horror games like Cold Fear, Cursed Mountain, etc., should have a blast with this!",
            "review_score": "1"
        },
        {
            "review_text": "Has a good 'older game' feel to it. Runs smooth too.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game,  The cutscenes are still pretty nice, even for a game made in 2003. Uses suspense to drag you in and scare you. These can usually subtle things like someone walking past a door or a door mysteriously opening or closing. The one problem was the controls, they are extremely weird. But, there is a pretty good guide on the community page, helped me alot.",
            "review_score": "1"
        },
        {
            "review_text": "The controls for this game are terrible.",
            "review_score": "-1"
        }
    ]
}