{
    "app_id": 302330,
    "name": "Tex Murphy: Mean Streets",
    "release_date": "2014-06-12",
    "developer": [
        "Access Software"
    ],
    "publisher": [
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Detective"
    ],
    "achievements": 0,
    "positive_ratings": 34,
    "negative_ratings": 15,
    "price": 4.79,
    "description": "The year is 2033. Your name is Tex Murphy, Private Investigator in San Francisco. You've been hired by the beautiful daughter of a university professor to uncover the facts about his death. As you begin your investigation you uncover the deaths of several prominent members of the scientific community.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/302330/header.jpg?t=1466791216",
    "minimum_requirements": "OS: Windows XP / Vista / 7 Processor: 1.0 GHz Processor Memory: 512 MB RAM Graphics: 100% DirectX compatible graphics Storage: 100 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "recommended_requirements": "OS: Windows 7 Processor: 1.5 GHz Processor Memory: 1 GB RAM Graphics: 100% DirectX compatible graphics Storage: 100 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "This is a fun title for those who don't mind whipping out the old pen and paper to play an old school adventure. Buy a reporters note pad to give yourself a PI immersion vibe! You spend alot of time in the cockpit of a speeder but I enjoyed putting the old speeder in auto pilot and grabbing some coffee. I really enjoyed the post appocaliptic setting. The game difficulty isn't too hard but there may be a time or two you might have to visit google especially if you don't take good notes(a must). Whenever I use my old notepad and I see my mean streets notes I can't help but smile and remember this fun little adventure that staarted a great series of games.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the other Tex Murphy games then you need to play this, you will see where it all started. It has great story and intresting playstyle, you need to write everything down just like you would do in real life investigation work. Reading manual is necessary, it contains details of the story, also if you don't read it you won't get past the the beginning of the game.   The games only bad part is flying with the speeder, but you really don't need to do that you can set it to autopilot. There are some nice oldschool sidescroll shooting scenes, they don't last long but they are challenging as you die from few shots. It does not include build-in hint system, but luckily you don't really need any, as I find that in the other Tex games the 3d + bad movement makes it sometimes hard to find some items, but with this game you don't need to do any pixelhunting on bad textures. After getting used to the gaming mechanics, you will enjoy this game and can't wait to make progress in you're investigation.   This first Tex game isn't actually a true FMV game like the sequel's, they do use real people on the character textures but thats all. It's more like the old Sierra or Lucas adventure games. Actually in the beginning of development they planed this game to be just a flightsimulator, but then they decided that it would be cool if you also could enter to the areas and move around, and so was the great Tex Murphy saga started.  There is some great satisfaction with this game that you can't find in newer games, you really need to pay attention and use you're head to finish this game. In my mind this one has the best story of all the Tex games, even that 'The Overseer' retells the story this game is still worth playing.  If you are not afraid of older games and enjoy great scifi film-noir then GET THIS GAME!  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Very little directions and bad graphics doom this game. Need to remain in the in the late 80's, early 90's where it started. Can see where it could have been fun then , but not now.",
            "review_score": "-1"
        }
    ]
}