{
    "app_id": 302370,
    "name": "Tex Murphy: Overseer",
    "release_date": "2014-06-12",
    "developer": [
        "Access Software"
    ],
    "publisher": [
        "Nightdive Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "FMV",
        "Detective"
    ],
    "achievements": 0,
    "positive_ratings": 10,
    "negative_ratings": 15,
    "price": 6.99,
    "description": "The client is drop-dead gorgeous. Her father is just plain dead—of an apparent suicide. She's certain he was murdered and is willing to do anything to prove it.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/302370/header.jpg?t=1466791219",
    "minimum_requirements": "OS: Windows XP / Vista / 7 Processor: 1.0 GHz Processor Memory: 256 MB RAM Graphics: 100% DirectX compatible graphics DirectX: Version 8.1 Storage: 4 GB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "recommended_requirements": "OS: Windows 7 Processor: 1.5 GHz Processor Memory: 512 MB RAM DirectX: Version 9.0c Storage: 4 GB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "I initially gave this game a poor review due to technical bugs. I encountered an error that asked me to insert a disk in order to play, obviously this wasn't possible.  This was caused by installing the game on a computer that did not have an optical drive. With the help of Night Dive, I installed a virtual drive and the game ran fine.   I haven't encountered any of the other problems people have mentioned, so I can only assume that they have been fixed, or are simply isolated issues, or I just lucked out.  With all of that said, Tex Murphy is an acquired taste. Humorous, post-apocalyptic, detective, noir, FMV, et cetera. If you are thinking of buying this, you are probably already familiar with the series. If you are not familiar with the series, you might want to start with some of the earlier entries (but you should probably avoid the first game).",
            "review_score": "1"
        },
        {
            "review_text": "Sound does not work on Windows 7 64 Bit. A 'fix' on the discussion boards loads adware 'vopackage.exe'. Beware!  Later addition: Now the sound works, i followed a thread in the discussion board and installed some codecs. But this installed adware on my system, ... I hope, that the publisher will fix this problem. Until then 'not recommended'.",
            "review_score": "-1"
        }
    ]
}