{
    "app_id": 302350,
    "name": "Tex Murphy: Under a Killing Moon",
    "release_date": "2014-06-12",
    "developer": [
        "Access Software"
    ],
    "publisher": [
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "FMV",
        "Noir"
    ],
    "achievements": 0,
    "positive_ratings": 51,
    "negative_ratings": 2,
    "price": 6.99,
    "description": "Enter the virtual world of Under A Killing Moon, where it is December 2042, and you, as Tex Murphy, must stop the forces of evil before they destroy mankind and rob you of your next unemployment check. This thrilling and hilarious adventure is unlike anything you've seen before.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/302350/header.jpg?t=1466791225",
    "minimum_requirements": "OS: Windows XP / Vista / 7 Processor: 1.0 GHz Processor Memory: 512 MB RAM Graphics: 100% DirectX compatible graphics Storage: 2 GB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "recommended_requirements": "OS: Windows 7 Processor: 1.5 GHz Processor Memory: 1 GB RAM Graphics: 100% DirectX compatible graphics Storage: 3 GB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": " Introduction",
            "review_score": "1"
        },
        {
            "review_text": "One of the best FMV games out there.",
            "review_score": "1"
        },
        {
            "review_text": "WTF? this game is cracked - in a quirky twisted is this how it was done back in the day way.",
            "review_score": "1"
        },
        {
            "review_text": "THIS is the Tex Murphy series I've heard so much hype about? They got James Earl Jones to work on THIS?  I played the first few minutes of the game and quit because I just couldn't stand it. If it had just been the horrible controls and amateurish video editing then I'd have put my head down and pressed on, but that's the least of the problems with this 'game.'  To put it bluntly, this game is basically what you'd get if you hired Friedberg and Seltzer to make a parody of the detective noir genre and cast a second-rate Jim Varney impersonator in the lead. The acting, editing, script, and direction aren't just bad enough to break immersion; they're so bad that you're never immersed in the first place.",
            "review_score": "-1"
        }
    ]
}