{
    "app_id": 302610,
    "name": "Boson X",
    "release_date": "2014-09-15",
    "developer": [
        "Ian MacLarty",
        "Jon Kerney"
    ],
    "publisher": [
        "Ian MacLarty"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Runner"
    ],
    "achievements": 18,
    "positive_ratings": 1288,
    "negative_ratings": 105,
    "price": 1.99,
    "description": "Boson X is a fast-paced rotational runner set in a particle accelerator.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/302610/header.jpg?t=1447361966",
    "minimum_requirements": "OS: Windows 7 Processor: 2GHz Memory: 512 MB RAM Graphics: OpenGL 1.5 Storage: 20 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Length of Time Played: ~7.5 Hours Distance Played: Beaten The Game And Unlocked All Achievements Personal Grade: B  Opinion of Each Aspect  Grading System - Based on a 5 point rating system. (5 = Outstanding, 4 = Good, 3 = Average, 2 = Poor, 1 = Awful)  Gameplay: 4/5 Stability: 5/5 Story: N/A Controls: 3/5 Graphics: 3/5 Music: 4/5 Sounds: 3/5 Difficulty: 3/5  Notes: + (Positives), = (Small Gripes), - (Negatives)  + Catchy soundtrack + Addicting gameplay + Achievements are reasonable + Simple enough premise  = Difficulty can go all over the place = Jumping forward can be a little odd on a controller  - The black and white wire-frame level will make you scream - The depth perception really messes with your brain on where to jump",
            "review_score": "1"
        },
        {
            "review_text": "This game starts off fun, then addiction hits, then you force yourself to hit high scores, then you feel like the game has given you a tab of acid, then you die, then you either ALT + F4, or try again.  Rinse &amp; Repeat.",
            "review_score": "1"
        },
        {
            "review_text": "Boson X is an extremly fun game. It is the perfect mixture of challenging levels and simplistic gameplay that will leave you playing for hours on end.  The soundtrack and sound effects are top quality, and the graphics are excellent (if simplistic) for an indie game.   Thank You for making such a great game for people to play! :D",
            "review_score": "1"
        },
        {
            "review_text": "I'm not usually a fan of this genre, but Boson X is very different. It starts out simple enough. The controls are pretty basic, the flow is very fluid and the game works perfectly. It's beautiful, the sound and music fit it flawlessly, and the gameplay is so damned addicting. Every time you think you hit a level you'll never beat after a lot of practice you end up thinking, 'How could I have found that challenging?' And then the next level hits you with something new and the cycle begins again. If you like the run and jump or platformer genres this is defintely worth hours of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible. It's the right blend of logic and spaitial excercise and has a cool sciency feel. Boson X is a steal at $3 bucks. I liked it so much I bought it three times and gifted the other two.",
            "review_score": "1"
        },
        {
            "review_text": "Good idea, poor execution. By all means get it if you like running/reaction games, but wait for a sale.  I know this game is supposed to be difficult but a lot of the deaths feel like complete and total bull, and I wonder if the developers took the combination of various factors into account. Flashing platforms, being unable to see the edges of platforms, having difficulty seeing what's ahead of you and gradually escalating speed - any one of these on their own would be fine but combined together they result in a messy, irritating experience.",
            "review_score": "-1"
        },
        {
            "review_text": "My wrist hurts.    On a more serious note, this game is not as easy as Barry made it look on an episode of Steam Train. It's a lot of memory, to be honest, because on some levels, depending on where you jump, there may not be a landing, so you better remember what works and what doesn't. The music is good, but I noticed that I was less rageful when I was listening to my own music, so I have a rap playlist on Spotify that I listen to while playing it just to keep my cool. It's worth it, whether you get it in a bundle, through a trade, or if you purchase it at full price or on sale. It's addictive if you hunt achievements. If you don't like rage games like The Impossible Game, you might want to pass on this. If you do like games like that, then you probably want to add this to your library.",
            "review_score": "1"
        },
        {
            "review_text": "So that's how scientists do their work...  9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game should be called Boson X Prepare to Die Edition  This title is a great way to boost your reflexes, and mental acuity.  also compressed steam download is only 12Mb.  My only complaint is the music is absolutely repetitive, but with only a 12Mb download it is way better than I expected. &lt; Thankfully you can mute the music &gt;",
            "review_score": "1"
        },
        {
            "review_text": "I can't stop playing this game even after finishing all the stages. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding game, A must-have for any lover of the infinite runner genre, A nice astetic with easy to lear, hard to master mechanics, and (quite seriously) mind blowing level design.  I do, however feel that the anti-graviton level kind of betrays the mechanics a little bit. (you can see it compared to all the others as the 5th picture on the reel at the time of this review) Although, i can kind of forgive it since well... It's  anti-graviton.",
            "review_score": "1"
        },
        {
            "review_text": "While the gameplay is simple, it is quite challenging.  The graphics may not reflect top-notch realism, but it runs well on machines with low resources.  The concept is fun.  It is fast to pick up and nice for the moments when I don't have a lot of time to play.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me swear. A lot. And I'm a Christian.   This game makes me need Jesus more.   11/10",
            "review_score": "1"
        },
        {
            "review_text": "Probably best game for steam.",
            "review_score": "1"
        },
        {
            "review_text": "  So this is what physicists do in their spare time!",
            "review_score": "1"
        },
        {
            "review_text": "*edit* I changed this review to a thumbs up because it's so addictive, I can't stop playing. While there are definitely still annoyances which sometimes screws up your game (like getting to 98% on a really hard level only to have the game screw you over by giving you not possible place to land *shakes fist*) it is still really fun, and aren't games supposed to be fun? Plus I believe it has taught me anger management skills. You can't play a frustratingly difficult game if you've put your foot through your monitor.*  This review is not negative by any means, it's more neutral than anything. Why? It's a good game with fun concepts, and while it's supposed to be difficult, the way in which they implemented this difficulty was pretty poor.      You need to make decisions, often at the last minute as the track is being built right before your eyes. This can be tedious because, well, most people don't have the ability to see into the future?...    The point of each level is to go faster, which means landing on the bright blue track pieces. This would be fine if it weren't for the fact you are often punished for going too fast: You land on a blue track, go fast, try and jump onto the next bit and find you went too fast and just jumped into the abyss.    The track building is generally REALLY slow if you're going fast. HOW AM I SUPPOSED TO KNOW WHERE TO GO IF I CAN'T SEE ANYTHING???...??/&gt;/?,SLKNFGKLM   The music kind of sucks. This is just my taste though.  It's definitely not a bad game, it could just do with some tweaking. I love playing frustratingly difficult games, but usually in ones that are done  right  I die because I did something stupid, not because the game can't keep up with its own mechanics.  Overall score: 5/10 - fun but annoying.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty deec",
            "review_score": "1"
        },
        {
            "review_text": "So good it gave me a hadron. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, SkyRoads returns in a tube, very simple but very hard. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "game is this year's super hexagon  ♥♥♥♥in fantastic imo, and ♥♥♥♥ it was only 29 cents",
            "review_score": "1"
        },
        {
            "review_text": "Running for Science!",
            "review_score": "1"
        },
        {
            "review_text": "Exelent game, especialy if you on high!",
            "review_score": "1"
        },
        {
            "review_text": "1st time hitting 100% charge  Hey I did i- holy ♥♥♥♥! *mashes A and D keys* AHHHHHHHHHHHHHHHHHH!!!",
            "review_score": "1"
        },
        {
            "review_text": "this game is a damn nightmare if you planed on beating it be prepared to playing it for a good long time i got lucky and beat the game in 12 hours. but jesus christ  good luck if you plan on getting 100% with this game",
            "review_score": "1"
        },
        {
            "review_text": "i've played way more Boson X than steam would like to admit (older version), and i have to say if you haven't bought this game right now you NEED to. it's only 3 dollars, it's got endless amounts of fun, it'll make you want to tear your hair out, it's got a bumpin' soundtrack, what more do you want?",
            "review_score": "1"
        },
        {
            "review_text": "You can run through collider. 10 black holes out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Hey and this is my review about the game.  You might will remember one of those games in the past. back into the 1990's. You keep moving forward automatically and u have to jump on the right moment, left right or big hop straight forward.  You can play this with xbox controller or keyboard.  you have to run through blue platforms to get energy and the more you will get, the faster the game will be. once you have collected 100% the level end.  The game is very simple to understand, graphics are even simpler. MUSIC EVEN MORE SIMPLER  Graphics are like, i dunno.. odd? cheap? njot sure what to say about it music is basically worse -- it is only some simple few notes.. and that loops over... and over..  Game is okay i suppose but they could give the music and graphics a bit more attention.  The game itself loops over too!  sorry.. but if you are gonna make a game.. just give it more attention then those cheap things.  I give this a 3/10 because it feels like they didnt care that much at all to this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a super adicting. As far as 'Endless Running Games' go, this one is by far the best I've come across. It provides quite a good amount of challenge, but still very entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "A game purely based on precision timing and in my case luck. I really enjoyed the feeling of beating each level, just not any build up to that. Super simplistic flash game that doesn't deserve money is the gist of it. The repetitive and somewhat surprisingly difficult task of rotating and jumping can cause rage and lead to boredom. There are no more then 18 levels in the game that can get grossly hard without practice.",
            "review_score": "-1"
        },
        {
            "review_text": "I normally try to complete a game before rating it but this game is just so freaking boring. You end up jumping from platform to platform, dying, jumping, dying, jumping, dying. It never ends. I sat there motionless for 4 hours trying to finish it but I had no motivation. No story and no variation.",
            "review_score": "-1"
        },
        {
            "review_text": "I did it 100% ! You can do it too ! Nice soundtrack  Bad reviews are from noobs",
            "review_score": "1"
        },
        {
            "review_text": "Very unique way to produce a endless runner game. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Main theme: mer.   I mean, the game is alright- grab it on sale (no offense devs). The graphics are subpar, by which I mean, I'm playing Final Fantasy VII right now (1997- as WHEN the remake comes out, this comment won't make much sense :) ) and it has better graphics. It's not that I think that all games should use the CRyTeK Enginge, but just know what you're getting is all I'm saying.   There is little to no story, so best played between bits of your favorite TV show. The whole premise is just parkour running style platforming, trying to build up enough energy to charge a particle reactor.",
            "review_score": "1"
        },
        {
            "review_text": "love this game best game of life",
            "review_score": "1"
        },
        {
            "review_text": "I dont understand this kind of game. I am loosing balance almost immediately. Perhaps, my brain is so limited, that i can't play it alright. In my opinion, you need only luck and a bit finger skills, which required for pressing 3 buttons...",
            "review_score": "-1"
        },
        {
            "review_text": "All the reviews I can find on Steam seem positive for this game, which is clearly marketing bias. I'm an avid gamer and I like difficult games, and indie games, and this type of design. But this game is atrocious. I can't be the only one who thinks so?   This game is a hipster-hype nightmare. The gameplay the boring 'test your reaction time' type, OK, fine. I'm already not that enticed but whatever. I gave it a good few plays, on multiple occasions, and I wanted to love it. Then I just wanted to LIKE it. But it's one of those games that has some tricky mechanic which seems unfair - in Boson X's case, you jump platforms - but the thing is, after a level or two platforms start randomly dropping off. But there isn't any indication of when this happens, at least that I could tell, and it is just too hard to determine your vertical position - there isn't any ground or reference area to be able to tell if the platform is dropping - it starts to drop, you jump, but you're too low to make the next platform, and the game says Ooopsoe! Try again! But.... it doesn't feel like my fault, like I could even do anything about those deaths.  So the end effect is that I start the game, play an easy level, think 'ooo, I may like this'. Next level, I'll jump to a platform and be too low to land it.... but.... what? I didn't even know I was dropping. So I try the tutorial, which is of the modern, very hipster, minimalist school of tutorials where it has to be self-righteous about its hyper simple core gameplay, emphasising how 'clean' and 'simple' the gameplay is. But it doesn't even mention these dropping platforms! How do I deal with them? They seem unpredictable and random, and every time you die from being too low it seems really cheap to me.  I search online, and of course, you just hear people bragging about how amazing they are and how easy the game is etc..... I dunno. For my money (and I did pay money for this game!), it's an overhyped game which treats its players with disrespect. I love a game which punishes - but it has to feel fair. This game feels like it throws me under a bus, and I didn't even know the bus was coming, and I didn't even see the bus until my face was plated firmly in the bumper. I wish I could at least find info on how those falling platforms work, but all you can find is over-hype and people bragging about how awesome they are, or how amazing the game is, etc. Honestly - overhyped, boring gameplay, and the design is too noisy and trendy/indie/bleh. And this is coming from an indie games NERD.",
            "review_score": "-1"
        },
        {
            "review_text": "i liked the fact that the idea of the game is simple but the game in itself is literally TOO simply  its too easy",
            "review_score": "-1"
        },
        {
            "review_text": "I've never played a game like Boson X that is just a perfect mixture of simplicity and utter complication. They should change the name of the game to, 'I got it this next try.'  Easily addicting. After each try I find myself dropping a fresh batch of, 'You gotta be F***ing kidding me!'  All in all a challenging and unforgiving endless runner game with a scientific twist. Surely worth the value, the difficulty will keep you coming back, bound and determined that, 'This next time' YOU GOT THIS.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun sorta time waster that you can waste 15 minutes or 2 hours on and the arwork is amazing and the soundtrack is quite good 9/10",
            "review_score": "1"
        },
        {
            "review_text": "No driving simulator will ever teach you to keep your eyes on the road quite like this. An extremely difficult and frustrating game but the sort where failures are always your fault and never the game just being cheap, more the sort to hunch over the keyboard, learn every possible combination of sections and mash the arrow keys until your eyes start bleeding.   The music can get repetitive, despite its quality, as you will be attempting certain levels several times, not helped by the fact that there are seemingly only six tracks between eighteen levels. Perhaps two possible songs per level that are randomised could help with the minor monotony of it all.  It's not the sort of game to be played for hours at a time. It's the thing you play for maybe twenty minutes until your brain can't handle it any more and it's certainly worth the asking price.",
            "review_score": "1"
        },
        {
            "review_text": "All particles collected :)",
            "review_score": "1"
        },
        {
            "review_text": "Boson X. The infinite runner that will leave you wanting to keep going. The earlier levels are more than enough to get you completely hooked into the game. A very pretty 3D art style, great soundtrack and a variety of how the levels are presented means that no two levels are anywhere near the same. Progressing in difficulty and speed, Boson X will make you want to keep going back until you perfect it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the hardest games I've ever played... I love it.",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant little platformer. Very disorienting but ultimately enjoyable. You can play the demo here -   Boson X Demo   [www.boson-x.com] ",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this... If you like something that feasts on your soul and feeds off of you like some symbiotic fiend.  10/10  NOTE: The real challenge of the game is to pry yourself away from it.",
            "review_score": "1"
        },
        {
            "review_text": "If you have ever played Octogon, you know this game's gameplay is very similar, but Boson X does it better. The major difference between them is that Boson X doesn't involve straight memorization of the level, although you do memorize patterns. The best part about this game is that even though the gameplay doesn't change (you still hop side to side) the levels change drastically from one to the other in a way that keeps the game fresh. All in all its worth the $3 and definitely the $0.29 that its going for for this week.",
            "review_score": "1"
        },
        {
            "review_text": "Honest, I love this game! It's a simple concept unlimited runner that is fun to play!",
            "review_score": "1"
        },
        {
            "review_text": "Great Game if you like too rage.",
            "review_score": "1"
        },
        {
            "review_text": "I love it! Like Octagon but more challenging. And I love challenges!",
            "review_score": "1"
        },
        {
            "review_text": "I am a Veteran Boson X Mobile player on Android. It seems that Steam Version has more features than the Mobile version.  Good Game and a small time-waster for me.  Hope that there would be more updates...if ever. Keep it up!",
            "review_score": "1"
        },
        {
            "review_text": "This is a very lighthearted free-running type of game very similar to something like Subway Surfers. There are 18 levels here of varying difficulty; from Normal Geon to Anti-Boson X. I have spent 4 hours collecting achievements (beating the game) and the rest of my time shooting for top 1000 (then 500) scores on each level.  I played the free version before this, but the Dark and Anti versions of each particle were a pleasant new feature. They are NOT retools or reskins of one another. Each stage usually retains the same core structure (gravitron likes moving/falling platforms, Y boson is a big fan of electric beams, etc.) but otherwise each level is fresh and unique.  Players with slow reaction times WILL have trouble with the later levels. This game gets pretty darn rediculous, especially once you take on the Anti particles. Anti Gravitron had me stuck for a good 30 minutes (1/8 of the time I was playing).  This is a very good game in my opinion. While it may not be a genre-definer like Super Meat Boy or a masterfully crafted experience like Limbo, it's nice for good quick fun, a coffee break or a reflex test.",
            "review_score": "1"
        },
        {
            "review_text": "A game more difficult than understanding physics itself  4/5",
            "review_score": "1"
        },
        {
            "review_text": "This game realy helps me out!  You see, I am having trouble with learning to drive. The main problem is that my concetration is mostly focused on one subject. I realy have to learn how to get my concetration to an more open view.   This game is perfect for that, it learns me to keep track on the planes i run on but also to keep an eye on whats happening in the background to know whats comming next. :)  And of course the game is a lot of fun and addicting.   I love it and its totaly worth my money  Thank You! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "An excellent runner with a pretty damn cool premise. Looks great, is addicting, and is good, simple, and slightly frustrating fun. Had a blast with it.",
            "review_score": "1"
        },
        {
            "review_text": "NSFK  That means Not Safe for Keyboards, if you hate yourself, Buy This Game  All Jokes aside, this game is really good and a pretty hard challenge, i havent completed it but im very close to, when i do i expect to have total control over the Whole Universe",
            "review_score": "1"
        },
        {
            "review_text": "This game will haunt your dreams like a hardcore tetris addiction. Live by the blue platforms, die by the blue platforms. It's simple, fair, hypnotic, and at times soul-crushingly difficult.",
            "review_score": "1"
        },
        {
            "review_text": "Really a Good game",
            "review_score": "1"
        },
        {
            "review_text": "Nice and funny games :)",
            "review_score": "1"
        },
        {
            "review_text": "Well, its very fun and make me little bit confuse but overall is good.",
            "review_score": "1"
        },
        {
            "review_text": "A short fun game with lots of levels. The down side is that every level is almost the same.",
            "review_score": "1"
        },
        {
            "review_text": "Its kind of a one trick pony. Think if it like a 3d version of super hexagon. If you want a skill based game I would suggest going for super hexagon instead. This game has one big problem that SH doesnt have which is how responsive the controlls are.",
            "review_score": "-1"
        },
        {
            "review_text": "It's like Super Hexagon on steroids.",
            "review_score": "1"
        },
        {
            "review_text": "After finishing Super Hexagon, I needed something to pass the time. This does it for me.",
            "review_score": "1"
        },
        {
            "review_text": "This game is unbelievably addictive. Really fun and a great deal. I can't stop playing it. You just keep saying 'Just one more try!'",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS GAME!  #BOSON2?!",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game a lot. It's good. Very good.",
            "review_score": "1"
        },
        {
            "review_text": "Running inside of endless particle accelerator suspended in infinity, gaining speed until you make a new discovery... I'm not a physicist but I'm pretty sure that's how science is made.  It's a fast-paced runner game with simplistic yet appealing graphics, procedurally generated level design with unique feel and gimmicks in every level, and electronic soundtrack that fits in the game very well (though I'm not sure if it's good enough for listening by itself, but that's just not my kind of music in general)  It's really fun and challenging. It only has 18 levels, but the difficulty rises really fast. It gets really cheap on sales, so give it a try, especially if you're into this kind of games.",
            "review_score": "1"
        },
        {
            "review_text": "If this was a LSD simulator, it's a good LSD simulator  Would break keyboard again",
            "review_score": "1"
        },
        {
            "review_text": "a neat endless runner with multiple levels. Its got a nice set of music tracks to help keep you in the zone as well",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. It gives you a challenge aswel as music. i bought it today as it is on sale for 49p. that is an amazing price for a game like this. also Jacksepticeye played it so it must be good! :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is extremely difficult and can be extremely addictive. Always when you want to give up and ragequit you manage to set a highscore that is higherthan previous one... with difference of 0,1%.  The game reminds me of ye olde Skyroads, but this one is better. Fun colourful graphics and repetitive music combined with extreme pace makes you feel as if you were tripping except it's for science. Great stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Dem wire frame levels be trippy as hell",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive and difficult gameplay. Provided hours of entertainment and is very satisfying to beat. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "The more you think about what you are doing, the worse the run becomes.  Just don't think about it. Become a mindless zombie jumping from platform to platform.  It works.",
            "review_score": "1"
        },
        {
            "review_text": "A great, little and challenging game. I found that unlocking acheivements is extremely easy once you get the hang of the game. However once you start getting near the end of the game, the levels get way too hard.",
            "review_score": "1"
        },
        {
            "review_text": "2 fast, 2 furious, gettin a lil delirious. gud game. needs more fame. not very tame. but not at all lame. get it dude? this game is more necessary than food. this game will get you into a good mood. this game is really cool. buy it, dont be a fool. this game will work your mind like a tool. it wont fungus you up like a toadstool.",
            "review_score": "1"
        },
        {
            "review_text": "simple and challenging",
            "review_score": "1"
        },
        {
            "review_text": "One I started on this game I wouldn't stop, I had the free demo and im so glad I have it now",
            "review_score": "1"
        },
        {
            "review_text": "Boson X Sanic Constant Past Participle Particle Accelerating Amphetamine Ampule onto your hungry eye tongues.  +1 if u cry evertime",
            "review_score": "1"
        },
        {
            "review_text": "Here's a fun little game where you run inside an infinite particle collider thingy. It's a good time waster game, as you can see by all the time I've wasted playing it. If you like speedy mcspeedster running type games where you run until you hit a wall at 500 miles per hour, then you might enjoy wasting your time with this game. Enjoy discovering new particles of sci-fi space dust at super fast speeds while wasting time. Fun. Could definitely use modding support, Steam Workshop support, and the ability to create and submit levels. That would definitely increase the replayability of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and fast pace",
            "review_score": "1"
        },
        {
            "review_text": "Strangley addicitng. I couldnt stop playing after the first level and ended up spending over 40 minutes playing it. Good game to play when your bored.",
            "review_score": "1"
        },
        {
            "review_text": "Hard, but interested game",
            "review_score": "1"
        },
        {
            "review_text": "Pretty challenging. fun to play if you have 30 minutes to waste",
            "review_score": "1"
        }
    ]
}