{
    "app_id": 302790,
    "name": "Momodora III",
    "release_date": "2014-07-01",
    "developer": [
        "rdein"
    ],
    "publisher": [
        "rdein"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 8,
    "positive_ratings": 752,
    "negative_ratings": 60,
    "price": 1.59,
    "description": "Momodora III is a classic action platform game with a variety of items and secrets. It's the third installment of the Momodora series, although playing the previous titles is not necessary to enjoy the game!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/302790/header.jpg?t=1447361971",
    "minimum_requirements": "OS: Windows 2000, Windows XP, Windows Vista, Windows 7 Processor: Pentium or equivalent processor Memory: 128 MB RAM Graphics: DirectX 8 compatible graphics card with at least 32MB of video memory DirectX: Version 8.0 Storage: 50 MB available space Sound Card: DirectX 8 compatible sound card Additional Notes: 800ˣ600 or greater screen resolution with 16-bit or 32-bit colors",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  The key for this game was indirectly given to me by the developer for review purposes but it will not change the tone of my review    Momodora III is a 2D action platformer inspired by Cave Story and developed by rdein. As the name says this is the third Momodora game but the only one to be released on Steam while the previous two installments can be downloaded and played for free. In this game you play as Momo or Dora, two priestesses sent to investigate events surrounding the village of KoHo.  To start of, this is one of those games that can’t be judged by cost. Most people might think of this game as a below-average indie platformer but they are in for a surprise. Momodora III is one of the best hidden gem platformers I have played in recent years along with Cave Story.  One of biggest attractions of Momodora III is the simple pixelated graphics which I am biased towards so my opinion of the graphics will differ from the you, the reader. The environments of each stage are polished to the brim and each stage has its own unique atmosphere conveyed to you by its appearance and enemies. The character sprites look top notch for a 2D game and each enemy is graphically different from the other. Though there isn’t much dialogue in the game, the designs of the characters give them some life, especially their different attires.  Another important aspect of platforming games is the soundtrack, which Momodora III excels at. There aren’t words to describe the music other than it is simply beautiful. Each stage has its own music to go with it and all of them are jaw dropping to listen to. The music just gets you immersed into the game and flows well with the atmosphere it's trying to convey, further enveloping the player. Soundtrack isn’t something that I pay much attention to but this game does it so well that I just had to include it in the review.   The gameplay is quite basic for playformers of this day and age. You have to traverse through areas as your specific character, jumping and moving on platforms to make it to the end of the stage while avoiding obstacles. Each stage has its own specific set of enemies and their abilities as well as appearance correlate with set stage. In order to counter these enemies you have 2 types of attacks, normal and ranged making for a simple yet enjoyable combat system.  You also have item slots which you can customize depending on the stage or your play-style. Items can be bought or found in different stages. Like most platformers, after you reach the end of a stage you face a boss. The bosses have their own attack pattern and by memorizing these patterns they can easily be beaten. The bosses are very memorable because of their uniqueness.  This game also has three difficulty settings Casual, Easy and Hard so you can choose the one that you most prefer. On the easier difficulties you start with more hearts and items, on Hard it is vice-versa.  The only bad thing about this game is that it is really short and I am giving special emphasis on its length as it is possible to beat the entire game in 30 minute! However, with its cute graphics, fun gameplay and cost of $4 Momodora III deserves a recommendation from me.",
            "review_score": "1"
        },
        {
            "review_text": "It's a very cute game with a wounderful pixel design that's similar to that of Cave Story's, but all though it's not as long as it. It's a enjoyable game for when you don't want to play something that's to difficlut and with a little replay value.   My rating: 9/10 I would love it if it was longer but this is just as good ^u^",
            "review_score": "1"
        },
        {
            "review_text": "I love the entire Momodora series, the developer makes an excellent game without unnecessary dialogue. Even if you don't know what's happening exactly, the game is very much enjoyable. With every new game in the series, the mechanics get more advanced, but only just. It makes the game simple to understand and friendly to just about anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Super cute game with an amazing soundtrack! Sometimes I idle around in the game just to listen to the music lol.   The story is interesting but probably would mean more to people who've played prior Momodora games. I feel like this game is what would happen if old-school Mario and Castlevania had a baby. If you like Retro style games, great music, and tense combat though... look no further! Momodora 3 is easily worth the pocket change it costs. :D   I also recommend a controller to play this, but apparently Keyboard works just fine too.",
            "review_score": "1"
        },
        {
            "review_text": "Like the two freeware gems that came before it, it's a little game with big personality, and a few rough edges that are more endearing than detrimental (think of a cute little terrier with a flopped ear). Despite its simplicity and brevity,  Momodora III  positively throngs with variety; the painterly vistas, fine chiptune soundtrack, and whimsical enemy roster are constantly shifting, and there are even a couple side-missions wedged in there -- one of which is a hidden boss, no less! The story of this and the other games interlock, but the narrative is still fairytale-vague; there's enough detail for atmosphere and series branding, with the rest left up to your imagination. That's fine with me, though. I've always loved the 'rustically cosmic' viewpoint of fairytale and myth, and if it's good enough for me, it's good enough for you!  The physics were okay in the previous games, but one thing I really love about  Momodora III  is that Dora and Momo have a real sense of weight to go with their speed this time around. They don't hop in unswerving Castlevanian trajectories or anything, but there's a fine heft to their little pixel bodies. You feel like you are actually steering kawaii lumps of tireless, monster-bashing meat, not flicking around passionless digital ghosts that would feel perfectly satisfied in either state of inertia. This game has nailed it where too many indie platformers falter!   Momodora III  is the very model of a low-cost neoretro platformer. Though it can be completed in under 25 minutes if you rush, you shouldn't let that concern you, as the game's potential brevity completely belies the amount of fun that can be had from it.   MOMODORA FOREVER!",
            "review_score": "1"
        },
        {
            "review_text": "A small (~2 hours for the first completion), pleasant, polished game. Played through it offline. Graphics and audio are consistent and cute, contributing to how the game 'feels'. Level design is good. There's also a number of secret areas containing items\\treasures. Difficulty is on point (at least in my point of view). Not too easy or too hard; picking the right items can help with bosses. Can be replayed for completionism, achievements, or as 'new game+' (makes the game a bit harder). Very worth it's price, I would say.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a tiny Cave Story that you can sit back and complete in a single go every once in a while.  ",
            "review_score": "1"
        },
        {
            "review_text": "Momodora III is a classic action platform game with a variety of items and secrets. It's the third installment of the Momodora series.  You can choose between two characters and three levels of difficulty  The graphics are 8-bit style and full of colours and animations are normal for a game of these characteristics. The two girls are lovely :)  You can change the keyboard settings to control them through all levels of the game. The response are good, i use arrows to move and jump.  There are checkpoints so you will not loose your patience and some bosses to show you dexterity  It has achivements and trading cards.  If you like arcade games is your game if you prefer rpg or point&amp;click games don't play it.  PD: Thanks to Shade00",
            "review_score": "1"
        },
        {
            "review_text": "A very good, quick game. Beat it on hard in about an hour.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful small game with a bit of a challenge. Graphics and soundtrack are equally mesmerizing and an easy way to entertain yourself for an hour or two.",
            "review_score": "1"
        },
        {
            "review_text": "Frustrating design decisions bring down a game with a wonder atmosphere ,adorable art and animation, and a wonderfull sound track that builds and atmosphere that is nothing short of enchanting. I don't want to not recomend Momodora, just keep in mind its rough around the edges. Its very cute",
            "review_score": "1"
        },
        {
            "review_text": "Worth it for sure!",
            "review_score": "1"
        },
        {
            "review_text": "Graphics are nice, music is decent, controls are responsive, but a lot of the challenge consists mostly of cheap tricks that are tough to see coming without dying the first time around.  I wanted to like this came but can't really recommend it unless you like platformers where you have to die once or twice to understand how to beat the level. Even then there are some parts where the platforming has to be so precise it's more frustrating than anything else (e.g. thin platforms with spike pits on either side, so if you don't land perfectly, you die instantly).  The few bosses I faced were surprisingly easy. All the challenge of the game consists of surprise attacks and/or falls that kill you instantly (despite you having a health bar). Some people may like stuff like that... I find it questionable at best.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice but short game, still worth it.",
            "review_score": "1"
        },
        {
            "review_text": "A classic jump'n run most reminiscent of Cave Story and older Amiga games. It plays really smooth, is decently challenging and everything in it is super adorable.  You even get a ghost friend. She is also super adorable.",
            "review_score": "1"
        },
        {
            "review_text": "It's worth the price and not a penny more.  Which would be fine but... you have better games that you got on better sales. A perfectly average, perfectly serviceable, perfectly forgettable, perfectly inoffensive game like this is just not worth your time.  Which is cruel to Momodora as it's not bad, but there's just nothing here that's all that interesting.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to give this game a chance, no really I wanted to, but it goes from ♥♥♥♥ easy bosses to broken mess. I'm especially talking of the two witch sisters, once one is dead, if she was casting an attack that attack will still happen and that's bs since the other one will enter rage mode instantly and start spamming her own attacks as well.  In that scenario the white witch's ball of light is total insanity because even if she dies, her attack will linger in the room and the sister will attack immediately after and if you're really unlucky you might get trapped and killed either by the explosion or the purple flames/pillars of fire and there's NO WAY of avoiding both at the same time.  Not to mention that I beat the boss but the purple witch's flames where still in the room, so the door was slowly appearing and while I was trying to dodge that attack, I made a run for the door but the stupid spring-slime sent me back up directly on one of the flames and I died. That is totally unfair.  P.S: I then beat the boss by changing the order I used to kill them but I still call bs anyway. No game I played previously keeps boss attacks on the screen once the fight is done and I stand by the conviction that no game should do that. It's not fun, it's not rewarding, it's just dumb.",
            "review_score": "-1"
        },
        {
            "review_text": "A short little action platformer that is trying very hard to be Cave Story, but doesn't quite hit the mark. It has solid gameplay, cute pixel graphics, and a pretty wide variety of sub-items for various playstyles, though that's about it. The game is extremely linear, level-based instead of open-world, with a pretty mild difficulty other than a few bosses, and can be completed in only 2-3 hours. There's a few secrets that add a little replay value to the game, but there's not much that might compel a player to come back to this game afterwards.  Overall it's enjoyable for what it is, but there's not much there. If you haven't played Cave Story, go play that instead. If you have played Cave Story, just play it again.",
            "review_score": "-1"
        },
        {
            "review_text": "' Momodora 3 ',........ 3 stands for the third worst edition of the game?",
            "review_score": "-1"
        },
        {
            "review_text": "Simple gameplay, and didnt take too long to finish the game, still worth to replayed it again,",
            "review_score": "1"
        },
        {
            "review_text": "i just love this fun little platformer, great art, great music, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Wow, blew away my expectations. Quality oldschool platforming.",
            "review_score": "1"
        },
        {
            "review_text": "Dark souls meets Cave Story. With a setup like that, I only wish the game was longer.",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice little game, good to just chill out and play.",
            "review_score": "1"
        },
        {
            "review_text": "A short and fun platformer with simple mechanics. Well designed, and has a neat art style.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun little game! Definitely worth picking up if you like colorful, pixel art platformers.",
            "review_score": "1"
        },
        {
            "review_text": "I fell in love with this game . . . . . .   Still love it!",
            "review_score": "1"
        },
        {
            "review_text": "This s a very nice game I love this kind of stuff  +Challenging +Retro Concept +Has some replayability  +Doesn't always hold your hand (also casual mode for those who like speedrunning)  The only minus for me is that sometimes the controls can be quirky for keyboard. But if you have a pad you'll be fine",
            "review_score": "1"
        },
        {
            "review_text": "I originally bought this as a direct download, but decided to install the steam key so I could write a brief review for it- it's great. Really good replay value, spectacular music, decent gameplay and fairly short length, but worth money. Unfortunately it has nothing in the way of a plot, and the characters hanging around don't seem to have any reason to be there asides from something inane. Basically if you liked knytt stories, Cave story or Iji, you'll probably enjoy this. If you're not into retro-platformers, particularly of the cutesy variety, you're gonna hate this.  There's still one area that bothers me... a long row of spikes that you look like you should be able to get over... somehow... hm.  There are some serious issues - there are some bombs which insta-kill you if you land just outside them, but not if you land in their center (???!WTFAAAA???) and the difficulty levels are sadly lacking a 'normal' setting - only casual, easy and hard. And hard is more like stupid-hard, extreme-style.  I guess it supports speedruns, which is important for some people, but they have no souls. And the game-teaching can be a little obtuse at times - I got about halfway through before I realised you could equip items, or rather, how you did that.  Overall, 6/10, 1 point more if you enjoy this specific genre.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty short, yet I never find myself bored everytime I play it. Its very nice. The backgrounds, the characters, the music, its all very pleasent.",
            "review_score": "1"
        },
        {
            "review_text": "Quite a fun game. It's 4 bucks, If you're looking for a fun indie game to play I strongly reccommend that you give this game a go.",
            "review_score": "1"
        },
        {
            "review_text": "Bathed in a hot spring under the attentive gaze of the All-Seeing Eye. The Illuminati have never looked this cute before.   5 out of 5 ominous triangles, would play again.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Such a cute game. Short, not a lot of plot. It's still worth the purchase if you enjoy platformers alot though.",
            "review_score": "1"
        },
        {
            "review_text": "Welp, beat it just under 4 hrs, altough I played it on normal, just a heads up that this game is short. The biggest plus for this game is the diverse kind of boss. It's not like super hard or something, you'll know the pattern from the first battle, just switching things up after a tough stage. If it's on sale definite buy, if not... even a short game, not that expensive, buy. Edit: First time playing, I thought the controller input is delayed probably because I played it from PC connected to TV. Turns out I'm an imbecile, the game is fine. Played with xbox360 controller.",
            "review_score": "1"
        },
        {
            "review_text": "A short, but fun adventure with great music, atmosphere, and a good helping of pixelated charm! The controls and platforming are solid and the replay value is high, just because of how well-designed this little gem is. If you like games like Cave Story, this one should be right up your alley!",
            "review_score": "1"
        },
        {
            "review_text": "Short game but cute.",
            "review_score": "1"
        },
        {
            "review_text": "A short and cute little platformer that's well worth your time. (Hard mode is fairly hard; took me almost two hours to beat.)",
            "review_score": "1"
        },
        {
            "review_text": "Tight action, very pretty and well polished. Super charming game, I would reccomend it to any fans of action platformers.",
            "review_score": "1"
        },
        {
            "review_text": "beautiful game, beautifully done tight combat, beautifully done platforming and the story while i felt there was none gradually evolved. loved it, instant fan and classic of mine",
            "review_score": "1"
        },
        {
            "review_text": "Good music, and great background.   Is it hard?  I've play quite many 2D platforming game and this game is far from 'hard' But it's find if you don't agree with me.  Too bad it's too short, best to buy when on sales.",
            "review_score": "1"
        }
    ]
}