{
    "app_id": 303310,
    "name": "The House in Fata Morgana",
    "release_date": "2016-05-13",
    "developer": [
        "Novectacle"
    ],
    "publisher": [
        "MangaGamer"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Visual Novel",
        "Great Soundtrack",
        "Story Rich"
    ],
    "achievements": 16,
    "positive_ratings": 659,
    "negative_ratings": 17,
    "price": 18.99,
    "description": "A gothic suspense tale set in a cursed mansion. &quot;The House in Fata Morgana&quot; is a full-length visual novel spanning nearly a millennium that deals in tragedy, human nature, and insanity.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/303310/header.jpg?t=1534246677",
    "minimum_requirements": "OS: 2000 and newer Processor: Pentium Memory: 128 MB RAM Graphics: 800×600 DirectX: Version 9.0 Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a game, a story, about love.   It's also about time, tragedy, about hope, hate, despair and everything that falls in between. It revolves around a cursed mansion and its inhabitants in different time periods and explores and questions themes like identity, trust, desire, violence, society, redemption, reincarnation,  reconstruction ; a mind bending reexamination of lives lived.   It's about the big things in life but it's also about the little things. The things that constantly shapes us when we're not really looking, that gives our day-to-day its meaning and substance.   But more than anything, it's about the complexities of love. Love as a motivator, a discomfort, a longing, a heartache, a blessing, a curse, but most of all, as a relationship: the uneasy steps out of individual comfort zones and the creation of something new together. Love as a path to growth.  It's almost perplexing how they manage to make it all work, it's structurally among the most ambitious tales I've ever witnessed in video games, but they do, it does work, the missteps are few, the memories of it all absolutely enchanting.  It wouldn't have worked without the astonishing soundtrack. It handles everything with surprising ease, frames every scene with emotion and wonder.   It wouldn't have worked without the art, the beautiful depictions of scenery and life, the characters and their subtle expressions.  It wouldn't have worked without the interaction, the implications of the choices feels real.  It wouldn't have worked without the prose, but it wouldn't have worked as  just  prose.   Which is why it's a video game.  And it's the greatest love story on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Astonishing game. Give it patience, and you'll find an emotional masterpiece with almost unmatched power. Get past the PAINFULLY slow chapter one... once you're past the first hour or two, WHOOOO BOY brace yourself. The writing, while sometimes needlessly over-the-top verbose, is so good in total it's 're-examine your own life' epic. The HARD LEFT TURN the story makes after the fourth chapter: genius. In fact all the reveals are inspired. Music: quite simply the finest soundtrack (outside of chapter one, which was absolutely obnoxious) I've ever heard in a game. The music by itself will bring the tears in chapter four and the final 10%, it's that powerful. You just gotta get past chapter one. I promise you, your patience will be well rewarded.... has the most satisfying true ending I've ever come across.",
            "review_score": "1"
        },
        {
            "review_text": " Humans have a far greater capability to hurt, betray, and forsake others than they do to love, trust, and protect them. And that's precisely what the majority of people do.  At first glance,  The House in Fata Morgana  tells tales of not romance, friendship and innocence: it mainly tells tragedies of breakdowns, betrayals and scheming. It ruthlessly delves into the bottom of despair, but it is only to better bring us back up to the realms of hope.   As an anti-hero would take the place of a hero,  The House in Fata Morgana  skillfully casts an anti-romantic story over a ramification of several stories, and it is absolutely worth it.    You can  try  to remember the past, but it's an absolute, utter waste of time. Erase everything - all your sorrows. Wipe them away for a fistful of happiness. Allow me to show you... that you have no need of the past.     The House in Fata Morgana  has several settings and tells stories of multiple settings. The adolescence of a young brother and her sister, and the blooms of love and their consequences. A journey through the highway to insanity and hopes of salvation. An ever daunting gap between husband and wife and their own attempts, struggles and misadventures. Unfortunate circumstances clash with a life of isolation.   As vague as I'm trying to make them, these tales, in truly stylish gothic aesthetics, are spread across centuries of each other. It does a good job of keeping things moving and ensures variety of events.    That was your first time witnessing those tragedies. [...] You were able to bear 'em because they weren't  your  tragedies.  The tragedies bear great impact in their appeal to us to empathize and pity the protagonists. They make us despair for them because they make us hope that all will end well. In that, the writing is successfully fulfilling and greatly delivering the feelings behind the stories. The way it builds up to the second half of the VN is absolutely enthralling and really engaging.   The House in Fata Morgana , as a visual novel, is quite unconventional. It really is, in the best ways. I must also commend all the work that went into the localization, because practically nothing read or felt as something that came specifically from Japan (well, except for that one guy, but even then he just felt exotic), or Japanese tropes. It's absolutely refreshing, in a medium where so many devices, settings and tropes get used and reused so ubiquitously.   At times, I would find the art odd looking, but it's overshadowed by how beautiful, stylish and gorgeous some of the CGs look. Frankly enough, the main reason why some people (myself included) weren't immediately seduced by the art style is because they are not used at all to this style. Overall though, it's great for the eyes, especially to wash away the excess of moe blobs.   The OST is unusual and unlike many things in this world. But again, this VN detaches itself well from many things in this world. It can be enchanting, sorrowful or downright bewitching. I'm personally way more used to instrumentals in VNs, so having most of them vocalized is a different experience. There is no voice acting though, but adding on the previous point, I think vocalized OST wouldn't clash well with voice acting.   The characters are flawed, but that is the main drive of the novel. How they are flawed though feels deeply human, especially when there's always reasons or motives to how they are acting like they are. Well,  almost  human anyway. At times, they might feel repetitive, but they are mostly coherent and worthy of the stories they took part in.   My greatest complain about  The House in Fata Morgana  will be in its technical implementation. While it is usable, and at times, really well exploited, it feels older than it is, and not in a gothic way. In contrast to everything else about it, the interface doesn't try to do much things differently than in other VNs; in fact, I'd say it does less than average when it comes to immersion (other than by the story itself). Perhaps it is a good thing, as the UI keeps out of the way of the story, leaving us devoted only to it, but I would have liked to have seen more effects for immersion. Perhaps a bit of screen shaking, more animations, subtle SFX... There's definitely room for improvement.   Still, all in all,  The House in Fata Morgana  belongs to the realm of top-tier stories, and I would love to see more visual novels in this style. Or just ones that delves that well into uncommon topics and unexploited settings.",
            "review_score": "1"
        },
        {
            "review_text": "The House in Fata Morgana is a glorious Japanese Visual Novel set in a western setting that takes about 30 to 40ish hours to complete. The game features a few choices, most of them in the later part of the game; it’s a pretty linear narrative with different dead ends. The gothic mystery induced narrative revolves around a cursed mansion set in different time periods, as it explores themes of, for instance, human nature, insanity, love and hatred. It manages skillfully, overall, to go between bright, life-giving sequences on the one hand and dark desolate ones on the other.   The soundscape supports the narrative in a most beautiful way and some of the tracks have vocals in different languages like Portuguese and Latin, that provide a most wondrous ambience to different scenes.  The Writing/translation seems to be good overall, though it’ll use “hehe” to express laughter, while rarely it’ll describe it instead as is leaps and bounds more appropriate, just to mock me no doubt. For the love of humanity who do I have to tickle to death? Seriously. Stop making my eyes bleed.  Once you finished the game properly you’ll get access to a quite humorous and fourth wall breaking tour in the extra menu.  ",
            "review_score": "1"
        },
        {
            "review_text": "The House in Fata Morgana is hands down the best visual novel I've ever read. My initial impression was 'Shakespearean tragedy meets Edgar Allan Poe' and that assessment has held up through the course of the story. The first half of the game covers a series of distinct but interconnected stories, each more tragic than the last, spanning several centuries but taking place in the same cursed mansion. The second half throws back the curtain and makes you rethink everything you’ve thought up to that point, and makes all of the stories even more tragic than they seemed at first. The story is absolutely  harrowing  and made me break down in tears many times.  Structurally, the VN is mostly kinetic (read-only). There are a handful of choices, though most of them act as short branches off the main story that quickly end in an alternate ending or dead end (sometimes literally). You don't have to worry about keeping track of story flags or replaying different ways to get all the endings.  The music is some of the best I’ve heard in a VN, with over half of them including vocals (in various languages). The music is always appropriate for what’s happening onscreen and does its part to make the story even more impactful.  If you enjoy VN’s that are on the darker or more serious side like  Cinders ,  Analogue: A Hate Story , or  We Know The Devil , you owe it to yourself to at least  try out the demo  [www.mangagamer.org]  (scroll to the bottom of the page for the link) which includes the first two chapters (the first several hours of the game). I honestly can’t praise this game enough – there’s a very good reason it has (as of August 2016) a perfect 100% recommended rating on Steam. It really is  that good .",
            "review_score": "1"
        },
        {
            "review_text": "There are books, games, and VNs you remember 10, 20 years after. Fata Morgana no Yakata is one of them. (if youre wondering, I played this VN somewhere else, then purchased again in Steam, it deserves it).",
            "review_score": "1"
        },
        {
            "review_text": "The Feels in Fata Morgana... What can I say about this game? It's everything I hoped it would be and so much more. If you're looking for a Gothic-style Visual Novel with a unique twist on art style, music and writing, then look no further than The House In Fata Morgana.  In all seriousness, though, whether you're a fan of visual novels, a novice or not sure about them at all, it doesn't matter. It'd honestly recommend this to anyone.  I could go on but I'd rather let the game speak for itself.  Get it, play it, don't do anything to spoil it for yourself and so long as you're not immesurably jaded, you won't be dissapointed!",
            "review_score": "1"
        },
        {
            "review_text": "Truly an epic. One of the best pieces of literature I have ever read.   A visual novel that manages to pack in tragedy, drama, romance and comedy but not feel overloaded. You will love the characters. You will sympathize with them. And you will weep for them.  Except Aimee  . Combine the characters with a beautiful soundtrack and gorgeous art and you have a game you will be hard pressed to forget.",
            "review_score": "1"
        },
        {
            "review_text": "Please, please give this game a chance. I was turned off by it at first because the PV didn't catch my attention and I was unsure about the art. Play the demo on MangaGamer's website if the price seems high. I'm very sure it will change your mind if you have any doubts. Heed the content warnings on MG's website if there is any subject matter that bothers you, because this game does deal with a lot of heavy topics, but I was very pleasantly surprised that it was all handled with maturity and tastefulness. I wish I could say more, but talking about why this game is good in terms of plot points delves into things that are best left to reading the visual novel yourself and not reading spoilers.   This game is an absolute masterpiece and I'm only sorry that I didn't pick it up sooner. I've bought it twice for myself, once on steam and once through MG's website, and a few times for others. I very rarely do that with games that I like, but I think this game is worth every cent I have paid. It took me about 30 hours to get through the game the first time, and I'm going to play it again soon once I've reflected on it a little more. This is a game you will definitely want to play more than once, and for the price you get a whole lot of text, drama, suspense, mystery... and triumph. Not to mention an incredible soundtrack (I suggest buying the deluxe edition if you can). This is definitely the best VN I have ever played and I recommend it even to people who don't like VNs - I made one of my friends who hates them play it and now he's asking me if there are any other VNs like this. I had to tell him that sadly, there aren't.",
            "review_score": "1"
        },
        {
            "review_text": "I decided to buy this game, with no prior knowledge of it, just found it on Steam and thought the trailer was intriguing and left it on my wishlist until I could actually buy it. I think it's a a great game after finishing, there are so many good reviews on it all ready, so I'll add my own 2 cents.   The story really resonates, and the music makes it feel nostalgic. There was clearly a lot of thought put into the art, the writing, and the music, because they all fit to make this game whole. Honestly, when I first started playing, I would consider the art to be decent. Wasn't the best, but wasn't the worst. Some awkward perspective or proportions on body parts issues here and there, but for the most part, its good. The artist knew how to create mood-fitting pieces that fit with the story. I've grown to enjoy the artwork.   The music is perhaps the game company's selling point -- I'll be honest that the music isn't grade A, the vocalist sometimes sounded off-key or it just felt like her accent wasn't quite right. I thought the music was sung in latin this whole time, but it's apparently in Portuguese (most of it is)? Which is interesting because the backdrop is in a different European area... But aside from minor details like that, by the time I finished the game, I really started to love some of the tracks. And I would probably buy the OST even if the singing isn't perfect -- it now is associated with a great story.  The decisions you make are very easy to do -- most of the game, you are the observer until the half-point, in which you are given some more choices. There's a few endings to achieve for your steam achievements, but in all honesty, I think the game-makers only wanted the player to enjoy a good story and make it to the end of it. So if you do buy, make sure you save often near the end.  I would buy this game if you enjoy suspense, mystery, gothic-esque themes, makes you cry..., because this isn't really about playing a game, more like experiencing a story. There were also some very adult themes about building character though, some very strong messages about 'being able to be who you are,' which I thought was rather well put together.  Overall, there's a lot of good things going on with this game, and I hope to buy more games from Novectacle if they continue to make VNs of the same or better quality.",
            "review_score": "1"
        },
        {
            "review_text": "This became my favorite VN of all time. Great characters, great story, great art, and great soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "After starting this VN a few days ago I have had trouble being able to put it down. The art style is amazing, and I love the music. Music really helps set the mood since the lack of voices. I really just can't describe how I feel after this. It's been amazing. The story tends to drag slightly and the flashback get slightly annoying but I can look past those flaws. Every single hour I put into reading this has been enjoyable. I highly reccomend giving this title a shot if you're into reading something serious. Thank you to the team who was able to make this title a reality in English! &lt;3",
            "review_score": "1"
        }
    ]
}