{
    "app_id": 303340,
    "name": "Concursion",
    "release_date": "2014-06-06",
    "developer": [
        "Puuba"
    ],
    "publisher": [
        "Puuba"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Platformer"
    ],
    "achievements": 24,
    "positive_ratings": 42,
    "negative_ratings": 28,
    "price": 3.99,
    "description": "Concursion is a multi-genre game played on the boundaries between worlds. Steer your hero through a dangerous interdimensional universe, switching between different genres on the fly, pulling off feats of tight aerial acrobatics otherwise unattainable in one genre alone.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/303340/header.jpg?t=1482342494",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8, 8.1 Processor: Intel Core i3 or equivalent Memory: 2 GB RAM Graphics: 1GB, OpenGL 1.5+ Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I literally allowed this game to ruin my life, and I liked it.  The first things that attracted me to the game were its artwork and the fact that it's a platformer. I LOVE platformers. If I could gather up every platformer there was and play them all, I would. And the artwork is the kind that I like, smooth, high quality, but simple.  I picked up the demo during the speed run competition and got like 17th or something (I didn't really try for very long), so I decided to buy the game instead, and let me tell you, it is the most worthwhile £7 I have ever spent. For a game with as much replay value as this, I would pay closer to £50.  I then played the game and enjoyed the fact that it did have a difficulty curve, but I never felt like it was too difficult. Then the music. Where do I begin with the music? This game has one of the best Soundtracks ever, it's better than games by massive developers who spend 5 years developing one level of a game.  All in all, this game is probably my favorite to be released this year, and I look forward to more games from Puuba.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Concursion suprised me how fun it is. The story is nothing special. The gameplay is very interesting because it could dhange 5 times in one level so you are never to sure whats gonna happen. The controls are good. As you progress with the game the levels become more interesting with them changing *universes* and there is a big variety of enemies. The story has quite a lot of levels to play trough and you will get frustrated and also enjoy them. There are 5 characters and it's more like 5 games in 1 then 5 different characters. Also the replayability of the game is really good if you want to get the gold time, get the best time on the leaderboards, collect all the gems. Graphics ain't the best but they aren't that bad. I would recommend the game but I think it would be better to buy it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with a cool concept. It was a good, unique experience. Levels can be frustratingly hard though.",
            "review_score": "1"
        },
        {
            "review_text": "Great concept, bad implementation. The different genres are there, but I don't like them all, and the transition isn't exactly smooth. I didn't like the auto-scrolling space battles in Rayman and I don't like them here. Borrows heavily from Mario in story and tries to do the HAHA IS PARODY thing which I think is a bad substitute for an actual story. Presentation is fair but I hoped that the main char's sprite could show more than the default expression. Also, gender option for main char at start would've been nice. Unskippable intro, which is annoying when the game glitched and didn't allow to control my char at the start.",
            "review_score": "-1"
        },
        {
            "review_text": "not worth my €7.99. but at least got it from humble bundle.  there is no reason for you to fight, or collect fragments. controls arent really good, just average. dont really like the grafics either. and the end of every level ends with one ♥♥♥♥♥♥♥ ANNOYING DANCE.",
            "review_score": "-1"
        }
    ]
}