{
    "app_id": 303590,
    "name": "Hidden in Plain Sight",
    "release_date": "2014-07-16",
    "developer": [
        "Adam Spragg"
    ],
    "publisher": [
        "Adam Spragg"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Local Multi-Player",
        "Local Co-op",
        "Shared/Split Screen",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Casual"
    ],
    "tags": [
        "Local Multiplayer",
        "Casual",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 300,
    "negative_ratings": 4,
    "price": 4.79,
    "description": "Hidden in Plain Sight is a local-multiplayer stealth party game. Blend into the crowd of AI characters and eliminate the other players before they eliminate you!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/303590/header.jpg?t=1531233715",
    "minimum_requirements": "OS: Windows XP or later Processor: 1.2GHz processor Memory: 512 MB RAM Graphics: Graphics Card that supports Pixel Shader 2.0 and Vertex Shader 2.0 DirectX: Version 9.0c Storage: 200 MB available space Additional Notes: This game requires Xbox compatible (or emulated) controllers!  Minimum resolution 1280x720!",
    "recommended_requirements": "OS: Windows XP or later Processor: 1.4GHz processor Memory: 1 GB RAM Graphics: Graphics Card that supports Pixel Shader 2.0 and Vertex Shader 2.0 DirectX: Version 9.0c Storage: 200 MB available space Additional Notes: This game requires Xbox compatible (or emulated) controllers!  Minimum resolution 1280x720!",
    "reviews": [
        {
            "review_text": "Such a simplistic game, but absolutely a riot. First, figure out which of the 'NPCs' on the board is actually you. Next, make sure nobody else does. And finally, meet a goal. Could be killing the other players, touching a series of statues, or running a race while the others have exactly one shot to shoot who they think is you. Can only be played locally, 2 players, but it's tons of fun. Highly recommend. Just a matter of time before you see people making clones of this. Such a simple premise, but such good gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best local (only, no online!) multiplayer experiences i've had with friends. its hard to explain how fun this can be if you like playing games of feint and deceipt!",
            "review_score": "1"
        },
        {
            "review_text": "Hidden in Plain Sight is an incredibly simple and amazingly fun party game. I can't recommend it enough.   !!! HOWEVER !!!  Make sure you have enough Xbox 360 controllers for everyone, since you can't use a keyboard/mouse nor most off-brand controllers (my old Logitech Rumblepad2 was useless). Other folks have had luck using third-party controller emulator software, but not me.",
            "review_score": "1"
        },
        {
            "review_text": "This game is currently $1.24  It's 4 players, LOCAL Co-op. Meaning, you play on your couch, with your REAL LIFE FRIENDS/FAMILY  It supports 4 XBOX360 controllers effortlessly. Just turn them on, and your set  It's a seriese of short games (I won't dare call them Mini-Games), that challenge you to compete against your friends, as a Knight, Monster, Sniper, Theif, etc.   It's a ton of fun.  It's $1.24.  So much WIN. Hard to explain. If you have gamers in your house, this is a must have",
            "review_score": "1"
        },
        {
            "review_text": "Unplayable without XBOX official controller.  Incredible game. You should pay up to $100 for this game.",
            "review_score": "1"
        },
        {
            "review_text": "Seems like a great game although I haven't got to play it yet because there is no LAN multiplayer.  I just spent money for my friend and I to play this game, but we can't because:  IT doesn't support two people on the keyboard  IT doesn't support LAN multiplayer  IT doesn't support single player  Hopefully in time they will add this otherwise we can't do it.  ",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic game. The PC platform often gets flak for less support for couch-coop or party games, but this game breaks the mold completely. Several fun game modes, a totally unique way of having a competitive game without the problem of screen sharing. Prepare for a lot of tense moments between friends, full of swearing, punching, and disowning family members.",
            "review_score": "1"
        },
        {
            "review_text": "At least it isn't Decorated Sight",
            "review_score": "1"
        },
        {
            "review_text": "A perfect mind game: act like a bot, spot the others, bluff, strike... Is it ugly: yes ! And you shouldn't care. This is one of the funniest couch gaming experience I've ever had. All game modes are fun (the Race is probably my favorite though). I discovered this gem at a friend's, and bought it right away.  As mentioned in the store page, it does require controllers.",
            "review_score": "1"
        },
        {
            "review_text": "Got a free copy from dev.  I really like this game. Designed for local multiplayer, requires people to pay attention and is quite challenging to not make mistakes. Integrates sound and vibration into gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Play it with friends!",
            "review_score": "1"
        },
        {
            "review_text": "A fun game to play with friends for about 30 min - 1 hr intervals. A first choice for small parties.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to play this game YOU NEED A CONTROLLER, I ADVISE MORE THAN TWO.   The game is a really fun party type of game. It's rare to have a local co-op game nowadays,especially one this fun. Get some controllers and some friends and sit down and play the five or so different modes. Tweak the settings for even more fun.",
            "review_score": "1"
        },
        {
            "review_text": "As long as you have 3 friends to play with (and a comfortable couch :D), this game is a must!!",
            "review_score": "1"
        }
    ]
}