{
    "app_id": 303510,
    "name": "Dungeons: The Eye of Draconus",
    "release_date": "2014-08-11",
    "developer": [
        "SuckerFree Games"
    ],
    "publisher": [
        "SuckerFree Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 17,
    "positive_ratings": 81,
    "negative_ratings": 91,
    "price": 2.09,
    "description": "Dungeons the Eye of Draconus is a early 90’s arcade style, one to three player, comedy, retro brawler, with both local and online multiplayer support, complete with mounts; multiple attacks, and varied gameplay, all reminiscent of Battle Toads, Golden Axe and TMNT Arcade.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/303510/header.jpg?t=1447361992",
    "minimum_requirements": "OS: Windows XP and up Processor: AMD Dual Core 2.4 GHz Memory: 2 GB RAM Graphics: DirectX 10 compatible GPU (ATI Mobility Radeon HD 4250 or higher) DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Quad Core Memory: 4 GB RAM Graphics: GeForce GT 840M DirectX: Version 10 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "This game has everything you could want from a brawler. It has quirky humor mixed with blood and guts. At times the difficulty is near Battletoads, which I feel is a great thing. Challenge accepted for accepting my money Sucker Free Games. The best thing about Dungeons is that it's 3 player. So once I make 2 friends all of us can enjoy this epic adventure. I'm a pretty lonely guy and most of the time I don't post reviews because I'm also very shy but I was compelled to post a review of this game. Dungeons: The Eye of Draconus brought back childhood memories of visiting my cousins and playing Double Dragon with them. It was one of the only times I got to play videos games with other people. Sure I play games online with people but it's easy for people to accept you if they don't have to see you. Rose is cool but my favorite is Gleobryn and his awesome super wicked cool chicken.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe it's just where I am in my own life, but I felt embarassed when I was playing this. Everything about the game is overly stereotyped and over sexualized like some pre-pubescent fantasy of some sort. Honestly, I couldnt stick with the game past the initial part I played through. It was just to difficult to accept this as the way any game is presented these days. It wasnt funny or cute or anything else that might redeem it. It was just flat out crass, pure and simple.  While I dont think less of others for enjoying this game, I couldnt justify continuing when I have so many better beat em ups in my game library, that I dont feel demean me when I'm playing them. 'nuff said.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is terrible but it's at least short and easy to make fun of so there's joy in that, The achievements are also very easy.",
            "review_score": "1"
        },
        {
            "review_text": "I just finished playing through the first Episode of Dungeons. Maybe I just didn't read up enough about this game before buying it but I didn't know it was only the first in a series until I reached the end of the game. It's a very quick game, with limited replay value. I'm not sure about serializing a hack n'slash - the gameplay seems like it would be too repetitive and, if this game was an indication, VERY short. I was expecting something a little more like Golden Axe in terms of length and also to only have to buy the one game to finish the story.",
            "review_score": "-1"
        },
        {
            "review_text": "I quite liked playing through Dungeons, but was very disappointed when I came to the end. It just sort of stopped with no warning and a spiel for the sequel, which I'm guessing is not very likely to be released.  As others have said, it's a side-scrolling beat-em-up with adolescent humour and terrible voice overs. But I enjoyed it. It was fun and most of the humour was recognisable from popular (and no-so-popular) culture.  I haven't played multiplayer, but I can see that it would be more fun that way. It's just a shame about the non-ending. ",
            "review_score": "-1"
        },
        {
            "review_text": "I've played a lot of beat-em-ups, with some of the most lax being made for OpenBOR.  Sadly, this game ranks with the worst of OpenBOR in terms of combat. Hit detection is absolute crap, and the controls take some time to figure out. And while they aren't that complicated, they also don't feel like there is a attack-type-to-strategy ratio. They either all work, or all don't work.  You'll be spammed constantly at the very beginning of the game by enemies you can't dodge, can't block, and can't defeat all at once. Health pickups are plentiful, with an odd choice of an alternate button for pickup (why can't it be the attack button, like every other beat-em-up ever made in the 1990s?) but never seem to appear when you need them most.  What is redeemable about the game? Graphics are pretty good, and voice acting is moderately acceptable.  What is unforgivable about the game? Cut scenes have great art but are cursed with some of the worst writing I've seen in ages. Game tries hard to look like Golden Axe, but one can't honestly compare the gameplay. The gameplay in this title barely functions.  Oh yeah, and the kitchen boss died in such a way that the game couldn't continue (boss died offscreen). And you CAN'T quit to the menu when this happens and start over--you have to close the whole window or use Task Manager.  By the way, the game didn't recognize my controller. All Steam games recognize my controller, but not this one, apparently.",
            "review_score": "-1"
        },
        {
            "review_text": "Picked it up on sale for cheap. Feels like I overpaid. Controls are clunky, voiceovers seem not well done, ending cuts off abruptly leading into a sequel. Only redeeming factor was some of the comedy in it but didn't make up enough for the rest in my opinion.",
            "review_score": "-1"
        },
        {
            "review_text": "Feeling like a 90's game? Check. Comedy? Check. This ONE annoying level that you always will have trouble beating? Check. Everything looks fine BUT... this is a short game. Sure, these Battletoads, Golden Axes etc. weren't exactly a games for weeks to play in one playthrough but had a great replayability. Dungeons: The Eye of Draconus is not same. There is a kinda sad thing you get at the end screen - to be continued. Sure, this is nothing strange about developers wanting to make sequel game. BUT, game like that is missing one important part - end boss fight. When I reached end I was sure that this thing   dragon   will be last and hardest opponent. Instead, the credits were my enemy. After reaching it to the end players would like to have some epic fight. Especially in beat 'em up / brawler games.",
            "review_score": "-1"
        },
        {
            "review_text": "yaaaa.. playable la.. quite funny but boring if play alone..",
            "review_score": "1"
        },
        {
            "review_text": "I am sorry to have bought this for people I know as friends... GABE please remove this from my library and hold me till the crying stops!",
            "review_score": "-1"
        }
    ]
}