{
    "app_id": 303690,
    "name": "FATE: The Cursed King",
    "release_date": "2014-11-19",
    "developer": [
        "WildTangent"
    ],
    "publisher": [
        "WildTangent"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Action"
    ],
    "achievements": 10,
    "positive_ratings": 134,
    "negative_ratings": 35,
    "price": 5.59,
    "description": "Are you ready for the FATE-IEST of the FATE games? Welcome to the final chapter in the classic, action RPG series! FATE: The Cursed King has new weapons, spells, armor and AI-controlled allies! Wait, what?! Allies?? That’s right. This FATE game IS A PARTY. Woo! Party system!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/303690/header.jpg?t=1447362005",
    "minimum_requirements": "OS: Windows 8, Windows 7, Vista and XP Processor: Pentium 3 - 800MHz or better Memory: 340 MB MB RAM Graphics: 32MB, 3D hardware acceleration required",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "HOW TO FIX THE 'APPLICATION ERROR' BUG!  Method #1  1. Open the game directory and set the Compatibilty Mode to Windows XP (Service Pack 3) 2. Locate the .dat file named 'default_config.dat' and open it with Notepad 3. Change the setting 'FULLSCREEN' from '1' to '0' and save it 4. Launch Fate: The Cursed King and it should work fine now  The only downside is that selecting the Fullscreen option crashes the game UPDATE - Do NOT select the 'Fullscreen' option from the settings. It will make the game crash and retrying this method wont make it work anymore.  METHOD #2 - Results in a perfect fix but requires downloading some files.  1. Head onto reshade.me and download the problem and save it to your desktop 2. Extract it onto your desktop (or directory of your choosing)  3. Open the extracted folder and double click on the Mediator.exe file 4. On the left hand side, there will be a bar with the world 'Add' next to it, click on 'Add' 5. You will need to navigate to your Fate.exe which is in C: &gt; Program Files (x86) &gt; Steam &gt; steamapps &gt; Common &gt; Fate the Cursed King. Click on Fate.exe to add it to ReShade 6. Make sure the mode below the bar is set to Direct3D 8 7. Hit 'Apply' at the top of the window and close everything out 8. Try playing Fate and it should work perfectly fine without and Fullscreen or windowed bugs.  Enjoy (Do not credit me for this fix, I just reposted this so more people will see)",
            "review_score": "1"
        },
        {
            "review_text": "Fishing simulator here. Seriously, the best way to get gear and gold at the start is to fish. Also use the better fish for pet food and bam! your pet is a killing machine.  The graphics may be old, but it is offline and my cable carrier is being a douch lately. For an offline game, it is worth the sale price",
            "review_score": "1"
        },
        {
            "review_text": "Used to play the original game when i was younger so when i found out there were 3 more I instantly bought this one, its fun, addictive and a great way to throw away hours of your life.",
            "review_score": "1"
        },
        {
            "review_text": "Worked for me!, Thanks  HOW TO FIX THE 'APPLICATION ERROR' BUG!  Method #1  1. Open the game directory and set the Compatibilty Mode to Windows XP (Service Pack 3) 2. Locate the .dat file named 'default_config.dat' and open it with Notepad 3. Change the setting 'FULLSCREEN' from '1' to '0' and save it 4. Launch Fate: The Cursed King and it should work fine now  The only downside is that selecting the Fullscreen option crashes the game UPDATE - Do NOT select the 'Fullscreen' option from the settings. It will make the game crash and retrying this method wont make it work anymore.  METHOD #2 - Results in a perfect fix but requires downloading some files.  1. Head onto reshade.me and download the problem and save it to your desktop 2. Extract it onto your desktop (or directory of your choosing)  3. Open the extracted folder and double click on the Mediator.exe file 4. On the left hand side, there will be a bar with the world 'Add' next to it, click on 'Add' 5. You will need to navigate to your Fate.exe which is in C: &gt; Program Files (x86) &gt; Steam &gt; steamapps &gt; Common &gt; Fate the Cursed King. Click on Fate.exe to add it to ReShade 6. Make sure the mode below the bar is set to Direct3D 8 7. Hit 'Apply' at the top of the window and close everything out 8. Try playing Fate and it should work perfectly fine without and Fullscreen or windowed bugs.  Enjoy (Do not credit me for this fix, I just reposted this so more people will see)",
            "review_score": "1"
        },
        {
            "review_text": "I have always liked this game and always will, you probably will too.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: (Honestly, I cannot think of any)  Cons:  - Twitchy selection mechanics in battle, Even if you click on another named enemy, if they are close to the enemy you are currently attacking, you will not change the target of your attack. - Items do not stack, this includes potions, town scrolls, identification scrolls etc. With such a limited inventory and the fact that the FATE series is a hack and slash type game series one would think they would've figured out that that simply does not work all that well for that particular game type. In time you will learn town portal and identifaction spells, sure, but that does not make the lack of item stacking any more forgivable.  - There is a limited number of quick use potion slots, they too will not stack your potions. - Stamina declines rapidly when running/walking at first. You will not regain it unless you make your character stop dead and then start walking again. - Audio in general is off-putting and the BMG is really just very dull.  - Item selection is made awkward by the fact that you at no point is told what the different colour codes stand for. Meaning you're left to assume which colour code is superior using the generic system of white being the worst then increasing to green, then blue, purple and so on upwards. This is not viable considering this game series appears to be targeted at newer players considering the very simple mechanics of the game. - Poor graphics. I am willing to grant that there is a certain charm in using classical graphical design styles, but the problems with them remain the same as they always were: it is difficult to really notice what is going on. Shading is poor, graphics overlap when there are enemies storming at you and all attacking you at once. I agree that graphics does not make a game, and a game is not made bad from having bad graphics, but when so many other things are lacking in this game I am left wondering where exactly they put their effors, because it certainly was not put into improving graphics since the last FATE game. -Minimap in town is close to useless as you are expected to navigate your way thrugh the town by looking at a completely white minimap with colour coded NPCs. Yet again the colour code is not revealed to the player, so you'll have to work that out yourself as well. In dungeons you get a set of three different sizes of the minimap. One of which is far too small to navigate by, one of which is too large to navigate by, and one which you can navigate by, but you can barely see your character (a single dot on the minimap). - Although there are many items with specifically generated names making the item unique there appear so far to be very few different looks to the different items, meaning the items are not really special in any way, the developers were just kind enough to add an item name generator into the game. - Interacting with NPCs is a pain. It is slow, cumbersome and overall just insanely annoying. So is selling pet items. - You can only have four available quests at a time despite the fact that there are only four dungeouns and they could just as well be giving you all the quests for one dungeons in one go no matter what floor the quest is on. (there are several floors to each dungeon, and as far as i got it appeared there would be two-three quests per floor of a dungeon. Which is semi-practical i suppose because by then you will have fought through a hoarde of 100 monsters or so by standing still and holding the left mouse button down casting the occasional spell and picked up whatever loot is there to be had and.. your inventory should be brimming with industrial grade crap to sell to the vendor in town.   It is strange to me how many people have given this game positive reviews. I can understand the nostalgic thrill of reliving youth by playing games similar to those mixed with the thrill of something new, but let's be perfectly honest, there is nothing new about this. You really don't need to compare this game to the Torchlight or Diablo franchise to realize it's a bad game all in all. That is not necessarily saying the entire franchise of FATE is, but this particular game is just.. no. Not worth it. Game mechanics are poor, so much twitching mixed with the lack of the most basic things that hack and slash games need. Bad audio and graphics mixed with predicatably generated maps and the lack of excitement in the gameplay I would expect from this kind of game. With other games with similar styles of gameplay when i had a hardcore character i sat with my heart in my throat, with this game i was almost begging common mobs to kill my character so I could stop playing as I'd decided so long as that character was alive I was going to progress in an attempt to give this game a chance. Even boss fights are uninteresting and downright dull.",
            "review_score": "-1"
        },
        {
            "review_text": "I never imagined I'd be posting such a mixed review for any the FATE-series of games. I wish I could give another rating than just thumbs-up or down here.   Not only was FATE a blast to play in its day. But it should also be of special interest to anybody who happens to be a fan of both Diablo II and Torchlight. It's like the missing link that came between those two games. Much like Torchlight, FATE's toony style and dry humour also make it a fun way to introduce younger players to diablo-clones. Plus you don't have to get all of the FATE series, because they're basically all the same game. Most of the sequels just add some additional content to the game, and still include all of the previous content.   So my thumbs-down here is only to help purchasers beware that, for a lot of users, it's become complicated or impossible to play any of the FATE games anymore under Windows 10. It still works OK for some users. And if it fails to run, there are a number of different work-around solutions you can try. But I'd beware those solutions don't always work for everybody. Your luck with that can really vary. In my case, I was only able to get it to work with those work-arounds in the end on a different installation of Windows 10 on another PC. I'm also giving all of the FATE games the same review here, because the whole series seems to use the same engine, and to share the same compatibility-issues.  That being said, I'd still recommend playing any of the FATE games if you can. If you can manage to run any of them, then you can probably run them all OK.",
            "review_score": "-1"
        },
        {
            "review_text": "fishing simulator  10/10 would spend 6 hours fishing",
            "review_score": "1"
        },
        {
            "review_text": "I got to re-experience my childhood favorite game and quit because the ♥♥♥♥ing mushroom hates me",
            "review_score": "1"
        },
        {
            "review_text": "This game is what I would call a ARPG for kids. It's very simple, arcade like, and really easy to play. Also, it's a good time waster. (I played this game 5 years ago when it came out)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, luv the dungeon designs, and fishing",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the better fishing games on the current market. Not only does it have fishing, but it also has a dungeon-crawler minigame inside of it! Although it may be fun, the main game takes the cake.   You see, you start off with about 250 Gold, which is enough to buy a fishing rod to start the game. You can gain more in the minigame, but it's up to you as the use is mostly for the minigame, rather than the main game and cosmetics like earrings and clothes. You can also get more by selling your fish, but it isn't all that worth it due to soon to be explained reasons.  Anyway, you start off with enough to buy a pole and with two fishing spots, although they are fairly similar. You also start off with a magic pet (of your choice), which is where most of the fish will be going. I say this because you can either feed him the fish or send him off with the fish to a nearby store to sell them. This is better than you doing it because due to the pet's magic, he can carry a large amount more than you and if you feed him the fish he can temporarily become something different than what you started off with. For example, if you give your pet a Bass then it becomes a Unicorn. Why? Why not! And because the joke feels like it's gone on for much too long, I'm going to end the review here and recommend this game to those die-hard dungeon crawling and fishing fans!   Tl;Dr I make up a bunch of stuff about the fishing in the game being the main game and pass off the great dungeon crawling aspects for a minigame. Because I felt like it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game series, so much to do, already 50 hours into it and im not even half way throught the game.  A MUST BUY FOR OLD FASHION RPG PEOPLE OR DIABLO LOVERS!",
            "review_score": "1"
        }
    ]
}