{
    "app_id": 303680,
    "name": "FATE: The Traitor Soul",
    "release_date": "2014-08-27",
    "developer": [
        "WildTangent"
    ],
    "publisher": [
        "WildTangent"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "Adventure"
    ],
    "achievements": 10,
    "positive_ratings": 134,
    "negative_ratings": 20,
    "price": 5.59,
    "description": "IT’S HERE, FATE FANS! FATE - The Traitor Soul has arrived on Steam! This third game has more loot, more spells, more heroes and, most importantly, more pets. Hit “add to cart” already! Or read on for more details on this classic game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/303680/header.jpg?t=1447362005",
    "minimum_requirements": "OS: Windows 8, Windows 7, Vista and XP Processor: Pentium - 800Mhz or better Memory: 349 MB RAM Graphics: 32MB, 3D hardware acceleration required DirectX: Version 8.1 Storage: 400 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Great dungeon crawler with tons of customization.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥in sickk, loved this game as a kid and still love it now 11/10  As of October 2016 I haven't experienced any problems with launching this game in windows 10, so I think the previous issues have been fixed now.   Also would like to reiterate as everyone else has stated here, BUY THIS GAME ONLY as it is a combination of all the Fate games.   When you first start a new game make sure to spend your first gold coins on a fishing rod. This game is basically a fishing simulator disguised as a dungeon crawler. :P",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I've played all the FATE games years ago, I lost them, thought, then I got this from my brother as a gift, and it is by far my favorite FATE game. I love it. If you like Diablo-like games, it is definetly a game you should check out. You get to choose and design your characer, then you get to choose a pet who will be a giant help on your adventure. Once you start the game and got the basics, you can go to different towns, talk to a lot of people, accept quests, buy new weapons and more. There is a lot to fate, and there are new monsters in each level of the dungeons. Check it out. If you're unsure if you want it or not, check out a gameplay of it, judge for yourself :D",
            "review_score": "1"
        },
        {
            "review_text": "Great game for a low price. It's an ARPG, so it plays like Torchlight or Diablo etc. If you like those kinds of games and are looking for something else, it's worth trying this out.",
            "review_score": "1"
        },
        {
            "review_text": "Childhood game... Brings back many memories",
            "review_score": "1"
        },
        {
            "review_text": "Great dungeon crawler.",
            "review_score": "1"
        },
        {
            "review_text": "Used to be a great game, very similar to Diablo II and Torchlight. Most people may find this game childish and/or repetitive though so are torchlight and Diablo. Anyways unfortunately due to windows 10 update the game no longer works for windows 10 users as well as any other FATE Games no longer work because of windows 10, compatibility does not work for this either hopefully it will be fixed at some point! Really enjoy the game!",
            "review_score": "-1"
        }
    ]
}