{
    "app_id": 303790,
    "name": "Faery - Legends of Avalon",
    "release_date": "2014-06-16",
    "developer": [
        "Spiders Studio"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Fantasy",
        "Turn-Based"
    ],
    "achievements": 12,
    "positive_ratings": 369,
    "negative_ratings": 141,
    "price": 6.99,
    "description": "Faery: Legends of Avalon is a big role playing game packed with a very distinctive ambience and graphic style. Create your character, embark in a great adventure and discover the fantastic world of Avalon!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/303790/header.jpg?t=1505148005",
    "minimum_requirements": "OS: Windows Xp Sp3/Windows Vista Sp1/Windows 7 Processor: Amd/Intel Dual-Core 2 Ghz Memory: 2048 MB RAM Graphics: 256 Mb 100% Directx 9 And Shaders 3.0 Compatible, Ati Radeon Hd 3850/Nvidia Geforce 8800 Or Higher Storage: 1 GB available space Sound Card: DIRECTX 9 COMPATIBLE",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I always wanted to pick this up back in the day but never did. Was suprised to see it released today and for that price said what the hell. Upon starting it I saw the spiders (the developer's logo) and instantly knew it was the right decision. After playing Mars War Logs last year, Bound by Flame, and then Of Orcs and Men (Co-developed by them I belive) I have come to the realization that they are probably my favourite RPG developer of the last couple of years.  So this game has a great atmosphere, and art style. The music hasn't blown me away, whereas some of there other games have some great, sometimes, stuff. No voice acting at all in this game FYI though that's ok. The writing is not quite as smooth as some of their latest effforts but still humourous and charming. All the NPCs have been entertaining so far, and the turn based combat is enjoyable.  Two of its strong points are the flying as a fairy which is a blast ziping across the map, hovering etc, all done very effortlessly by a couple of different ways either with the keys or mouse. Also the character customization is unique and meaningful which really I believe is where Spiders are at the top of their game in all these RPGs. The skill points you allocate are slotted at different body parts which both affect the way your fairy looks, male or female, and different skills like fire spells or lighting etc. these then will branch and allow for other exclusive powers and then you can increase the level of each of these.  So yeah great spiders RPG character customization, engaging turn based combat, full flying exploration of the different levels, and a charming story about faerys and the dying of magic which lots of recognizable lore like Pan, mermaids, and the tree of the world.",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game back when it was released in the PS3 and love it still to this day. You have no idea how excited I was when I saw this on the store that I almost lost breath. I see this as a second chance to try and get the 2nd episode made with enough people buying it from here.  Truly a great RPG with fun lore, great characters, and beautiful worlds to explore. I implore ANY fan of RPGs, Mythical fantasy lore, and hidden gems/underrated games to give this game a purchase and try it as I guarantee you'll like it or even love it.  I truly hope this will help the developers make the sequel as I really want the second part so badly, ever since it first came out.",
            "review_score": "1"
        },
        {
            "review_text": "Game doesn't work for one bit for me. So obviously I can't recommend it.  It just crashes to desktop instantly and apparently there's no way to fix it. Been like this for a long while now.",
            "review_score": "-1"
        },
        {
            "review_text": "I would recommend this game. The controls are what I liked and noticed first. They are very similar to Star Wars KOTOR, which I also enjoyed very much. With the option to use only the mouse to move, interact, and fly, it keeps this casual RPG just that, casual. The flying feels 'natural', uncomplicated, and fun. The leveling is simple and logical, while still having options to enhance healing, elemental, practical, or a combinations of magic. The fighting is old school RPG turn-style based where your team is on the right and the enemies are on the left with animated fighting when each person/creature strikes or gets hit. The story is interesting as are the characters you meet. If you are looking for a simple RPG/Adventure without overcomplication of puzzles, controls, crafting, or leveling, then you will want to try this game.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little RPG, with just enough background, interesting landscapes, and battle mechanics to keep it from being hated. Why the hate, you ask? It seems pretty obvious once you start playing, that they had intended for a sequel to come out later, but because of poor sales, will never happen. The game DOES end with a cliffhanger, where the sequel would would taken off from.  If this is something that you can overlook, then you will find 7-8 hours of good gameplay for a decent price (especially if its on sale).",
            "review_score": "1"
        },
        {
            "review_text": "This game was short but a very fun game to play as it had a refreshing gameplay style that most common games don't use. While a bit casual especially in the battle spectrum (unlimited magic usage that can be restricted to a max of 2 turns with more powerful spells) this game was relatively fun for such a short game. There are some negatives I have of the game, including the lack of ability to walk, and the story filling about 11-12 hours on a blind playthrough, but overall I really enjoyed the game, especially because it's one of the few i've been able to finish recently. If you want a story that is interesting and something that is just overall fun as a side thing to kill time, I reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Faery- Legends of Avalon Is a really fun (RPG) packed with a very distinctive ambience and graphic style. Create your character, embark in a great adventure and discover the fantastic world of Avalon! I must say the engine this game runs off of is really great. I was able to play this game perfectly/ smoothly on a windows 7 Porfessional 32-bit laptop and probably lower. same with the graphics, makes the enviorment look almost real. The gamplay is very similar to the Pokey' mon games where you find enemy hidden in the game world, Then during the battle you take your first attack then you haft to wait for the enemy to attack you and hope your character doesn't take a lot of damage and die, repeat that combat system over and over untill you win then continue your quest for adventure through the world of Avalon. You usualy deal with this in most (RPG)'s, but this one is in 3D and it's cooler than most (RPG)'s i'v ever played yet. Also the game play mechanics is 10 times better than most (RPG)'s as well. The only repededive thing to is the soundtrack, the music is well done and fits within both the story and game's enviorment. However the music that plays during a different fight is the same thing that plays over and over that it makes you not to look forward towards the next fight. Other than that the character customization is great even tho you half to grind down through the world of Avalon for new clothing, armor, and weapons and magicial abilities. Also the ability to have my character fly at high speeds by holding that shift key, makes traveling in the magical world of Avalon a lot of fun. I give this game a 7/10 ★.",
            "review_score": "1"
        },
        {
            "review_text": "Visually... questionable, feels low budget (not just indie low budget, but actually 'we had no money to do it right'). Has a lot of interesting non-linear quests and 'plot' twists, many different an wierd worlds, and it rewards exploration too — secrets to be found around every corner. Combat is rather repetitive (jRPG syle) but challenging enough to enjoy it some times.  So if you give this game a chance it may actually surprise you, or not.",
            "review_score": "1"
        },
        {
            "review_text": "I quite enjoyed the game. The fighting style is a bit different to what I'm normally used to , but.. it worked out in the end.  The only gripes I have is-  A few typos , and the acheivements. I finished the game in roughly 16 hours , yet the acheivements didn't unlock though they should have ? Also - I find the game too short.  Would I recommend this game ? Yes I would. The storyline is good and enough to keep one interested , and the gameplay is easy enough to figure out .. The characters are awesome , the fantasy realms are awesome and the bosses are magnificient!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game! Its a great role playing game! The things you say tottaly change how others react to u, and what choices u can make! And there are usually more than one way to go about doing somthing! U can really give your character a personality based on what they say! And the custimization for your Faery is pretty awsome! You can also choose what type of elements they use in their magic and equipment. The art designs of the world and characters are incredible and gorgeous to look at! And they have (for the most part) pretty acurate faery lore! Sadly, the ending dose leave on a cliff hanger, that was meant to continue in an as yet unmade sequal. But it was still very fun, and I feel it was worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is boring and the gameplay is odd. The music is ♥♥♥♥ and there is no voice acting.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is great but has become a failed opportunity. I had hoped for relationships with my companions regardless of sexes. Farewell Avalon farewell Selim you sexy beast",
            "review_score": "1"
        },
        {
            "review_text": "Delightful and enchanting. While parts of the game (and its combat system) are a little quaint, it still retains a lot of charm. The ability to fly is easy to use and master - and means that your travels around the different worlds are a joy to behold. The characters and monsters are also exquisitely crafted - all providing a deep and evocative story.",
            "review_score": "1"
        },
        {
            "review_text": "An initially interesting premise Faery theme in a full 3D environment with a workable (if stock) overarching plot is badly let down by the repetative fetch quests, dialogue and combat. Companions are lifeless once recruited. Really if it wasn't for the levelling I would not have even bothered to get as far as i did. Uninstalled. Avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game wish they would make the sequel :(",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you like Character building, RPGS. You can choose to fight your way through or solve the game with puzzeling challanges. So fun and highly addicting to play.",
            "review_score": "1"
        },
        {
            "review_text": "A bit buggy to start, and it does seem to crash on my laptop but it's still worth it. Get it on sale. Loads of easy going fun -- a bit mindless around the final level. would i do it again? yes! Oh, and only took about 8 hours to get all acheivements.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game with lots of detail to its world and an unexpected use of the Z-axis/ the ability to fly freely around. Quests get a bit tedious and repetitive, and despite obvious strategy branches, combat is never truly difficult. The character development system makes up for the repetition by keeping everything fresh as your character evolves, and equipment isn't given the standard RPG treatment; instead, you can equip items which directly boost your powers (for more of a boost in 'sets'). Want to be a good healer? Equip the wand and robe of healing! Overall, pretty light RPG fare which I found to be thoroughly enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Faery has a special place in my heart. It isn't your run of the mill rpg.   The setting and characters are unique and very well executed. The story is interesting and new. The different worlds are each crafted with my love and detail.  The vertical exploration via flying is very well handled. Maybe games with flying have terrible controls, but this is not one of them.  The combat could have used some work to make it more exciting, but it's good enough.  Character customization and progression are both pretty good. I would have liked some more, interesting looking gear for the individual characters though.  The real bummer is, that it's the first part in a series, which never went further than this, so the ending feels very open. I would have loved to play more of this series.",
            "review_score": "1"
        },
        {
            "review_text": "liked it, but wished it was longer/had more worlds to explore",
            "review_score": "1"
        },
        {
            "review_text": "alot of this review sounds negetive but since this game is fun and cheap it makes up for its negatives in way i think most people who would consider buying this game would appreciate. for example, the game is quite short so you'd be glad to be finished it before most things would annoy you, but then i can say for sure how patient you are. this game is suprisingly fun, though like i said it did seem kind of short, especially when i didn't even know i'd completed the game until the credits started. i liked the graphics and the story was quite good too, though there could have been more to it.  simple and easy to understand turn-based game, if you've played any other turn-based game at all you'll understand this no problem. the only problem with this is that it remains rather simple for the entire game, even though you gain levels and get new skills it just doesnt feel as though damage increases that much throughout the game. basic attack damage is pretty much always double digits for the entire game and because of this there isnt a strategic reason to use buffs or status effects that aren't attached to regular attacks. the advantage in damage gained by increasing your attack doesnt make up for the damage lost by using it since even most enemies (including bosses) are pretty quick to die.  its very much just identify your strongest attack against the enemy you're fighting and then spam that attack (healing in many cases isn't even needed). thats the same for everything including boss fights, which i would have liked to be a bit more than just basic enemy fights but with more health and strength, all that means is that you have to heal 1 or 2 times in the fight. they lacked diversity so no need to strategise. that could get boring after a while but like i said previously, the game probably isnt long enough for that to happen.",
            "review_score": "1"
        },
        {
            "review_text": "Faery - Legends of Avalon is an old school turn based role paying game. It is good fun and has a very creative storyline. The characters and environments are also well creatively designed. The animations and graphics nicely done and helps you to be immersed in the game. Sound effects are created well and compliments the environments you are in.  The game however is a little short and not as challenging as I was expecting. The game play is fun and there is a lot of customization available as you character levels up. Controls work well whether you are using mouse and keyboard or joy pad.  The side quests can get a little annoying when you get about have way through the game. There is no voice acting within this game, so this may get a little annoying after a couple of quests. I do recommend reading through the game as the storyline is quite good.  Overall, I do recommend this game for its well creative worlds and nice fantasy storyline. The draw back is that it is a bit short. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is cute. You probably won't die a thousand times during the fights (they get repetitive pretty soon) and in most quests you can find an another way to fulfill your goals (mostly running around and collecting things and using them up). The quests are easy enough and when you level up, you choose your abilities and bonuses, so your character gains new tattoos, limbs etc.   What annoyed me sometimes: the flying. Especially when you are forced to do it in a dark and narrow cave or when you are playing an elevator bc you are searching for an NPC or a place and the maps are useless. 3D exploration is fun and being a fairy is fun too, but also irritating! :)  The biggest problem is that this game is supposed to have a sequel, I guess? I actually thought that there will be a big boss fight or something, but I only got the ending scene and a 'To be continued' line.  7/10  (Not sure about this score. Probs not going to replay this game.)",
            "review_score": "1"
        },
        {
            "review_text": "My kids love this game , if you are 8 too 56 this is a good game",
            "review_score": "1"
        },
        {
            "review_text": "Has a good story, good movement, and good characthers,   Uses same models for NPC's - little variety.  Sucks that the story ended like it did since it was prepared to be a trilogy.  ",
            "review_score": "1"
        },
        {
            "review_text": "Very casual, but polished and fun to play.",
            "review_score": "1"
        }
    ]
}