{
    "app_id": 303870,
    "name": "Blinding Dark",
    "release_date": "2014-08-12",
    "developer": [
        "Games Hut"
    ],
    "publisher": [
        "BulkyPix"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Horror"
    ],
    "achievements": 18,
    "positive_ratings": 20,
    "negative_ratings": 35,
    "price": 7.99,
    "description": "Blinding Dark is a First Person Adventure horror game. Complete puzzles, collect items and power-ups, fight enemies and do your best to manage the very thin resources you have at your disposal to uncover terrible secrets.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/303870/header.jpg?t=1447362018",
    "minimum_requirements": "OS: Windows XP Processor: Dual core from Intel or AMD at 2.8 GHz Memory: 3000 MB RAM Graphics: nVidia GeForce 8600/9600GT, ATI/AMD Radeaon HD2600/3600 DirectX: Version 9.0c Storage: 1100 MB available space Sound Card: DirectX compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Blinding Dark game is one of few horrors where you are constantly horrified to make another step forward. Its music and timing of beings you encounter will never get you relaxed and enjoy the view, because you will continue being scared until you finish the game. It’s quite realistic in terms of staying alive, where with just few hits you will find yourself near the death state. And after being killed you will respawn at a certain place with penalty of losing some part from your total mana points. The story keeps you involved even if its look like there is not much of it, you are provided with a voiced journal of the man you are playing with as he travels along, which are rich in information of what’s really going on around you. Gameplay usually consist of a certain area where you need to solve puzzles in order to open a path ahead. There is a rich variation of weapons u can use, where each weapon are designed to defeat a certain enemy, so you have to be prepared. Know the enemy weakness and select the weapon accordingly. I really enjoyed this horror game. If you really want to remind yourself of being afraid then this is a game you need to play.",
            "review_score": "1"
        },
        {
            "review_text": "Well.. started playing it today.. it has a creepy feeling to it and i got a bit scared( so seems to be worth my money..I will come back later. So far it seems very good :D",
            "review_score": "1"
        }
    ]
}