{
    "app_id": 303840,
    "name": "Point Perfect",
    "release_date": "2014-07-17",
    "developer": [
        "Highcastle Studios"
    ],
    "publisher": [
        "Plug In Digital"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Action",
        "Indie"
    ],
    "achievements": 10,
    "positive_ratings": 125,
    "negative_ratings": 52,
    "price": 4.49,
    "description": "Dodge, dip, duck, click and point your way in this retro-arcade death trap! The invaders are approaching, the Mothership needs your help to defend the home systems. Climb aboard, ready your Navigator 3.1X fighter craft and select some targets for the big guy to blow back to hell.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/303840/header.jpg?t=1447362016",
    "minimum_requirements": "最低配置: 操作系统: Windows xp/ Vista/ 7 处理器: 1.4 ghz or faster 内存: 1 GB RAM 图形: Direct X 8 compatible graphics card DirectX 版本: 9.0c 附注事项: Two button mouse required. With scroll wheel.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Playing this game is like training yourself to become the most powerful mouse user in the world. As the title have stated 'Point Perfect', you need to use your mouse pointer perfectly. One mistake in the game and you're done for (-1 life point).   ",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game because of the positive comments, ended in tears of frustration ... I'm really not the kind of gamer that love to lose again and again and again and win absolutely nothing when I succeed. The trolls we get when we lose might be fun sometimes but it's such a bad spirit ...  Even though I improved over the little time I played, I just find it boring (not interested in scoring in any way). I gained my three steam cards and now I probably won't touch this game ever. I must have played like five games in my life that let me so sad and so insecure about my player skills (that I already know are really bad).  In conclusion, if you are the kind of person that only play games to relax and to immerse themselves in another world far from reality, don't torture yourself playing this mean game. I don't want you to feel sad and frustrated at the end :(.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow, I really hate this game. I'm absolutely terrible at it, and die stupidly fast, and I can't stop myself from trying again...   (I don't actually hate it)  Mechanically its simple:  - Don't let the cursor touch anything  - Make boxes around things to destroy them.  - Play various mini games  - Kill bosses  I strongly recommend you play it.  For something so simple its surprisingly addictive.   My only complaint is some of the 'game snark' when you lose gets annoying after seeing it so often, but that can easily fixed by not being terrible like me!",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty annoying, but at the same time can't stop playing it. I still can't do any of the bosses, waaaayy too hard in my opinion.  The game has pretty nice sound effects...  Overall,  Alright for a few minutes... before you break something.",
            "review_score": "1"
        },
        {
            "review_text": "Cheeky ♥♥♥♥ gave me lip so I kept trying to play so it could stop bullying me. I continued and continued and continued, but my efforts were futile because this game is hard... I'm going to go commit sepukku now...",
            "review_score": "1"
        },
        {
            "review_text": "The f*ck is this game, wew. Good thing I was able to finish this.",
            "review_score": "-1"
        },
        {
            "review_text": "I have mixed feelings about ths. It's a good game, but it seems to be designed to frustrate you. This is not something I like. 70% of the time that you die, it's from walking straight into an obsticle because it did something stupid, that you should have survived anyway except your damage hitbox is MASSIVE. Also did I mention the game mocks you if you die too much?  It's okay... not for 5 dollars. Wait for a sale IF you are resistand to mockery and IF you are really good at games and IF you have money to waste. 3-6/10, depends on circumstances.",
            "review_score": "-1"
        },
        {
            "review_text": "SPACE IS EXACTLY HOW BOWIE SAID IT WOULD BE. WE'RE DOOMED",
            "review_score": "1"
        }
    ]
}