{
    "app_id": 303830,
    "name": "Motorcycle Club",
    "release_date": "2014-11-28",
    "developer": [
        "Kylotonn Entertainment"
    ],
    "publisher": [
        "Bigben Interactive",
        "Plug In Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Racing"
    ],
    "achievements": 50,
    "positive_ratings": 16,
    "negative_ratings": 52,
    "price": 6.99,
    "description": "Ride 22 motorcycles with the official BMW, Honda, Kawasaki, KTM, Suzuki and Yamaha licences. Play solo or online at the handlebars of Superbike, Roadster and Custom models, and create, customize and develop your club.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/303830/header.jpg?t=1481277357",
    "minimum_requirements": "Минимальные: ОС: Windows® Vista updated with the latest Service Pack Процессор: Intel® Core™2 Quad Q6600 or AMD Phenom II X4™ 805 Оперативная память: 4 GB ОЗУ Видеокарта: NVIDIA® GeForce® 8800 series or ATI™ Radeon™ 4870 DirectX: Версии 9.0c Место на диске: 5 GB Дополнительно: Online multiplayer modes require an Internet connection",
    "recommended_requirements": "Рекомендованные: ОС: Windows® 7 or 8 updated with the latest Service Pack Процессор: Intel® Core i5 2500 or AMD Phenom X4™ 965 Оперативная память: 4 GB ОЗУ Видеокарта: NVIDIA® GeForce® 560 series or AMD Radeon™ HD 6850 DirectX: Версии 9.0c Сеть: Широкополосное подключение к интернету Место на диске: 5 GB Дополнительно: Online multiplayer modes require an Internet connection",
    "reviews": [
        {
            "review_text": "I ride motorcyles and got it from a friend for a couple dollars despite the low reviews. With that said, I would be embarrassed if I paid over $10. I did check metacritic, which said it wasn't great and can't disagree.  +Graphics +Runs well on average pc's +/-Arcade not sim (if that is desired) -Way over-priced at $40 -Seems more like a novice indie game than a PS4 release! -Mediocre controls and bland gameplay  Its a bit bland and controls are not the best. Its arcade style and is fairly low quality except for decent graphics. and runs well on decent pc's. I woulds say steer clear unless if you get a big sale, even then may not even be worth your time with so many good games these days.  I'm sure they worked hard on the game, but am surprised this was $40 and ps4, when its ps2 quality imo. With some more work, it could be passable for a indie game for $15. Sorry, I can't recommend it unless its on a big sale. Its okay at best, but if you have a PC that can handle Ride or MotoGP15 those are much better, but mostly sim where this is a rare arcade motocycle game. So if you want a arcade motorcycle game, you may want to get this on sale 5/10.",
            "review_score": "-1"
        }
    ]
}