{
    "app_id": 303860,
    "name": "Machines At War 3",
    "release_date": "2014-07-23",
    "developer": [
        "Isotope 244 LLC"
    ],
    "publisher": [
        "Isotope 244 LLC"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Stats"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "Indie"
    ],
    "achievements": 54,
    "positive_ratings": 38,
    "negative_ratings": 12,
    "price": 12.99,
    "description": "Real time strategy game featuring over 130 different types of units and technologies, 21 campaign missions with characters and an intriguing story, unlimited random map skirmishes with many customizable settings, network multiplayer to challenge your friends, and so much more in this RTS!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/303860/header.jpg?t=1508766496",
    "minimum_requirements": "OS: Windows XP Processor: Any Memory: 256 MB RAM Graphics: Any Storage: 300 MB available space Sound Card: Any",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I've been playing this series since the 2nd game release, before this one even came to Steam. I reccommend it. If you're interested enough to read this review, I can safely say that you'll have fun with it. It's basically an indie Supreme Commander with a few of its own twists, and it's well made.  Note: I'm running it great on my Surface Pro 3, Windows 8.1 with just a touch screen and it is working like a charm so far (not that you have to on any of those counts).",
            "review_score": "1"
        },
        {
            "review_text": "Excellent 90s style RTS - if you were a fan of Command &amp; Conquer and Total Annihilation you will enjoy this as it is heavily influenced by both of those classics. Solid single player missions and superb skirmish mode. Tons of units including nukes/anti-nukes, shields, base walls and plenty of mega units.  Graphics are quite retro looking but the minimal system reqirements mean you can play it on nearly any hardware (on my laptop the fan stays off, on a 3D game it's usually like a jet engine) and also available on iPad/iPhone (plays really well considering it's a full RTS). Highly recommended... my fave RTS right now.",
            "review_score": "1"
        },
        {
            "review_text": "I good RTS game. The mouse controls are alright and I haven't seen all the features. Seems good so far. On a larger scale than some rts games, but not huge (Unlike SupCom or Planetary annihilation) which means you won't have much trouble managing your troops. Good selection of units that aren't boring. The graphics and animations aren't great, but i don't give a crap about that and considering the large amount of content having low graphics barely makes a difference. Worth the $15 and definetly buy it if it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "The game is good. But not $15 good",
            "review_score": "-1"
        }
    ]
}