{
    "app_id": 304170,
    "name": "Kick-Ass 2",
    "release_date": "2014-08-15",
    "developer": [
        "Freedom Factory"
    ],
    "publisher": [
        "United Independent Entertainment GmbH"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Superhero",
        "Comedy"
    ],
    "achievements": 21,
    "positive_ratings": 34,
    "negative_ratings": 154,
    "price": 14.99,
    "description": "Dive into an exciting, action-packed adventure and relive the incredible scenes from the Hollywood blockbuster “Kick-Ass 2”. Fight countless hordes of enemies! Put on your mask, hone your weapons, and get ready to kick ass!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/304170/header.jpg?t=1447362040",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: Intel® Core™ i3 / AMD® Athlon™ 64 x2 or higher Memory: 2 GB RAM Graphics: Nvidia® GeForce™ 8800 GTS / AMD® Radeon™ HD 3850 or better DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "One of the worst games I have ever played here on Steam.    This game is insanely  BUGGY , like:  Going through walls.    Getting stuck in place for a while.    FLYING.    Sinking through the floor.      Combat   The combat is very dull, slow-paced, and simple.    The enemies are faster in combat.      Other Issue    You cannot tab out of the game.   DO NOT BUY THIS GAME. 0/10!",
            "review_score": "-1"
        },
        {
            "review_text": "So I just finished playing through Suck-♥♥♥ 2 (lol I'm so clever).  Where do I even begin with this mess?   I suppose I should start with the positive qualities. The translation is an absolute riot. The jokes have no sense of timing or humor, and the pop-culture references cost me 10 years of my precious life. Since the movie bombed harder than a bob-omb, none of the actors bothered to do voice-work for the low-budget pile of trash game nearly a year later. Instead the developer grabbed random men and women off of the street and shoved a microphone in their face. The results are about what you'd expect.  The other positive to Kick-♥♥♥ 2 is that almost all of the fights, are completely optional! Stupid me, I actually fought quite a few of the bad-guys, thinking that there were locked doors or invisible walls that prevented me from leaving. As it turns out, I can run past everyone and complete each stage, focusing only on the tremendous voice-work and my alcoholism. It's not like there's an experience-system, unlockable moves, or even a freaking score to provide any incentive to fight. I guess the developers figured that nobody would find any fun in playing this game, so they provided a hidden technique for skipping fights. It's a shame I didn't discover it earlier.  The negatives....Wow. The things that are wrong with this game could fill the Library of Congress. First off, the only playable character is Kick-♥♥♥ himself, possibly the least likable hero in history. Hit-Girl should have been a given, but I would've settled for anyone that isn't Kick-♥♥♥, like uh...Doctor Gravity. Playing as Donald Faison(Scrubs! Clueless!) dressed as a Superhero? This game could be even worse and I'd recommend it. Hell if they brought Nic Cage's character back and made him playable, I'd consider Kick-♥♥♥ 2 the best game of 2014. Instead, we're stuck with the one guy nobody likes.  The combat rips off the Arkham series. There are a handful of basic combos, finishing moves, and counters. Also KA can shock everything around him, or even himself. Apparently these abilities damage on-screen enemies or cause KA to do more damage. I honestly can't tell the difference. They say imitation is the sincerest form of flattery, so Kick-♥♥♥ 2 is Betty White wearing the same dress that Jennifer Lopez wore at the 42nd Grammy Awards. Actually I take that back, I don't want to offend Betty by comparing her to this miserable game.  In-between each chapter are some terribly drawn still images. I have two questions: Who did they hire? &amp; Doesn't Spain have child labor laws to prevent this from happening? It's just...really shocking. I've played Xbox Live Indie Games with better artwork. At least it's a break from playing the game, maybe I should consider this a positive...hmm..  The boss-fights are mostly just regular guys with different moves. Sometimes they forget what they're doing and just walk around so Kick-♥♥♥ can hit them. However, they can also be really cheap. Almost all of my deaths were due to boss-fights, and their hammer-toting friends that kill in 3 hits. The only other notable aspect of these fights is that they can't be skipped. Not only can you run past most of the fights in this game, but even if you die and restart the checkpoint, everyone that you killed stays dead. I'm not sure how that works but uh...hmm. Y'know this could be considered a positive as well. It means less time spent playing the game.  After reaching a combo of 5 or more hits, Kick-♥♥♥ gets the ability to knock a weapon out of an enemy's hands. Once that thug drops his bat, sword, or gun, you never have to worry about it again. No really, it's impossible for any of the other nearby criminals to pick up that weapon and use it. Also, since the hero doesn't seem averse to snapping necks and generally killing everyone he meets, it seems strange that he doesn't have the ability to pick up any guns or swords. It would make the fights go by faster and...oh right. I forgot we're just supposed to run past everything. That's how the game is meant to be played.   Aside from running down hall-ways and listening to ridiculous, badly-translated conversations, there isn't anything else to this game. Actually I take that back, there are subway cars you have to dodge, and sometimes you even cross the street. If you play Kick-♥♥♥ 2 for three hours straight you are guaranteed to get a headache. This is most likely anecdotal evidence, and could apply to every other game made, but dammit! I'm hurting here.   You probably just got this game via an indie bundle. Hopefully you haven't played it yet. Me? I bought that bundle solely for this game and Dear Lord I am paying for it. I am paying for it so goshdang hard.  BTW: Thanks Steam censors for thinking of the children. I'd hate to imagine all of the ruined childhoods due to seeing the word ♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "stupid game... don't buy it",
            "review_score": "-1"
        },
        {
            "review_text": "It's a terrible port with lots of bugs and sluggish combat, but it has terrible yet funny voice-acting and it's alright once you get past all of the negatives.",
            "review_score": "-1"
        },
        {
            "review_text": "Must be the worst game I´ve ever played... Glumsy and unresponsive controls, annoying camera, invisible walls, unimaginitive level design, poor voice acting, same props and components over used in all the levels... So, basically list of negative stuff just keeps going, so I'll tell you what is done well in this game: ABSOLUTELY NOTHING!  Keep on rockin' peeps!",
            "review_score": "-1"
        },
        {
            "review_text": "Pros:  - It's not as bad as Bad Rats  Cons:  - Visuals may be stylized but they're of sub-par, blurry quality  - Whenever a move connects, there's even more blur added  - Very slow, unresponsive gameplay  - Cheesy voice-acting  - Kick-♥♥♥ 2 wasn't as good as the first movie  - This entire thing sucks  - I feel bad for everyone who paid ~25$ for this game  - It's a licensed game, you shouldn't expect much anyway",
            "review_score": "-1"
        },
        {
            "review_text": "Besides bein a trash game like everybody says, is not supported for win10. btw win10 is trash also, down it for dx12 :p",
            "review_score": "-1"
        },
        {
            "review_text": "now finished the game, i take back my review from the beginning. I mean at first it is kinda fun and interesting, but it is so repetative and it gets old. still would recommend",
            "review_score": "1"
        },
        {
            "review_text": "It kicked my ♥♥♥.",
            "review_score": "-1"
        }
    ]
}