{
    "app_id": 304430,
    "name": "INSIDE",
    "release_date": "2016-07-07",
    "developer": [
        "Playdead"
    ],
    "publisher": [
        "Playdead"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Atmospheric",
        "Dark",
        "Indie"
    ],
    "achievements": 14,
    "positive_ratings": 19660,
    "negative_ratings": 934,
    "price": 14.99,
    "description": "Hunted and alone, a boy finds himself drawn into the center of a dark project.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/304430/header.jpg?t=1494338023",
    "minimum_requirements": "OS: Windows 7/8/10 (64-bit OS required) Processor: Intel Core 2 Quad Q6600 @ 2.4 GHz, AMD FX 8120 @ 3.1 GHz Memory: 4 GB RAM Graphics: NVIDIA GT 630 / 650m, AMD Radeon HD6570 or equivalent DirectX: Version 9.0c Storage: 3 GB available space Sound Card: 100% DirectX 9.0c compatible sound card",
    "recommended_requirements": "OS: Windows 8/10 (64-bit OS required) Processor: Intel i7 920 @ 2.7 GHz, AMD Phenom II 945 @ 3.0 GHz Memory: 8 GB RAM Graphics: NVIDIA GTX 660, Radeon R9-270 DirectX: Version 11 Storage: 3 GB available space Sound Card: 100% DirectX 9.0c compatible sound card",
    "reviews": [
        {
            "review_text": "I see people complaining how short this game is. Personally, I'd rather play 3-5 hours of perfection than 50+ of repetitive, unoriginal crap.   The atmosphere and design are like nothing I've ever seen in a platform styled game. To be honest, you're doing INSIDE a disservice by considering it a platformer. The puzzles are challenging, yet not frustrating, and the ending leaves you with chills. TIP: (minor spoiler)   Make sure you collect all of the orbs for the secret ending.    This game is a genuine masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "INSIDE was a bit more atmospheric, interesting and deeper than LIMBO. but alot shorter. The puzzles were easier.. I loved everything about it, besides it being so short for 20 dollars. It was very fun and I highly recommend it. I have a feeling anything Playdead comes out with will be enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": " Run, kid, run.   And stumble, fall, get back on your feet and run some more. Then, jump, swim, crawl.  Hide.  They're after you, all of them.  They won't let you go.  I can hear you breathe, your heart is pounding.  Scared and brave, you keep going, keep running. Where are you taking me, kid? Where am I taking you?  Oh, how many dark places, such dangers we have encountered. Yet you keep running, they won't stop you, I promise. I will help you.  Because that's what you want me to do, right?    °°° Sometimes the word 'game' doesn't fit well. If something wraps you in its world, atmosphere and doesn't let you go, not even when the whole thing is done, if you feel you're not the same anymore once it's finished, 'game' can't be the right word. Yet, INSIDE couldn't be more classic in its gameplay: a 2D side-scrolling platformer without levels, with puzzles to be solved in order to progress, jumps to take, dangers to avoid etc. Yet again, it's immersive in such a powerful way that it makes you forget that those are mere gameplay mechanisms: you are in the story, so each action you perform is part of that.  The music, or better, the  lack of  it most of the time, just the ambient sounds from a deserted landscape, the kid's hearbeat sometimes, so that when music suddenly starts, it leaves you speechless (there's a specific moment when this happens underwater, whose beauty and feeling of agoraphobia I won't easily forget). And the dim light most of the time. So that each time you run into sunshine, you want the kid to bask in it... and stop for a little, because you have no idea when - and if - he'll feel that sunshine again.  Overall, its bleak atmosphere engulfs you in ways that I'm finding hard to explain. As I previously said, INSIDE stays with you long after everything is done, leaving you with countless questions and a mix of inexplicable feelings.",
            "review_score": "1"
        },
        {
            "review_text": "This game has amazing ideas with puzzles. I hope to win best game this year 2016. Recommended to anyone like challenge",
            "review_score": "1"
        },
        {
            "review_text": "When's the last time a game actually made you stop and say wow? We play so many we become numb to them. People complain this game is too short, but I'd rather have 4 hours of this than 50 hours of meh. Great puzzles and interaction, amazing art direction / sound design and also shows what the Unity engine can do in the right hands. Just buy it!",
            "review_score": "1"
        },
        {
            "review_text": "No game is perfect, neither in general amongst video games nor within its own genre. Of all the games I've ever played, INSIDE may very well be the closest thing to perfect - in all aspects - in both regards. It warrants every single word of praise that exists for it. I cannot recommend it highly enough.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone is losing their minds about pokemon go and i am here playing this insanely good game called INSIDE...",
            "review_score": "1"
        },
        {
            "review_text": "A dark, gloomy and artistic game with great art direction and craftsmanship. I saw and played things I had never seen or experienced before in a game. I highly recomend it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most beautiful and meaningful experience I've ever played. The soundtrack and sound design is up there with the best. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Cannot recommend enough. Simple gameplay with some tricky puzzles but its all about the story. Still don't know exactly which I think is the point. Brill!",
            "review_score": "1"
        },
        {
            "review_text": " Detailed review   by Ashes    Introduction",
            "review_score": "1"
        },
        {
            "review_text": "There are few games that uses so little to create a beautiful world and a excellent story. It is short but I think this is one of the best games I have ever played 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Like LIMBO but creepier",
            "review_score": "1"
        },
        {
            "review_text": "Holy Cow! What a game! It took me completely by surprise. I knew it was from the creators of Limbo but since I wasn't that big of a fan of Limbo to begin with, I didn't go into INSIDE with the highest of expectations, but boy oh boy was I wrong. There are no negatives, so I'm just gonna list the positives, and trust me, there are many:  - I'm not a 'puzzle guy' but these puzzles were incredible: They were surprisingly fun, challenging. inventive and varied. - The 'graphics' and atmosphere in this game are some of the best I've ever seen in an indie game. The game has a distinct 'cell shaded' look to it and it almost plays exactly like a top notch animation. It's all extremely fluid, which brings me to my next point... - The physics in this game are absolutely incredible... Towards the end (NO SPOILERS), my jaw dropped to the floor when certain things started happening. It's just stunning stuff. - The sound design and the Soundtrack were also beautifully done and they fit the game perfectly. - The 'plot', if you could call it that, is something Sci-Fi fans will love, especially if you're into movies like Akira, Blade Runner, John Carpenter's The Thing and David Lynch's Eraserhead. - Finally, I'd like to mention the controls and how fluid and responsive they are. It feels like the game's playing itself. And it works perfectly with my Dualshock 4 (Plug and Play basically).  This is game is perfect. No two ways around it. It looks and sounds great, it plays even better and it has some of the best atmosphere you'll ever find in a game, indie or otherwise. This game is a MUST play, in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "I really liked Limbo. I loved the visual style and atmosphere of the game, I loved the soundtrack, and I loved the way that there wasn't any concession made to conventional cinematographic storytelling techniques in the game - because those things weren't relevant to the experience of playing the game. And yes, there were a number of points in the game where you would be 'ambushed' - but for enough of the game, it was possible to try and guess what would happen next and do something to try and avoid that particular grisly death.  Inside is basically Limbo again, but unbalanced. The gameplay and presentation technique will be very familiar if you've played Limbo. The visual style is striking - lots of shadow and muted palates infrequently broken up by short sharp shocks of bright colour and light. Although I have to say that, for me, the decision to render the environments in 3D despite the game being a resolutely 2D platformer didn't make sense - especially not with a lot of the level design, which features numerous instances of puzzles which are only puzzles because you can't get the protagonist to move 2 steps into the background or foreground to grab an object there or use an alternative route there.  As with Limbo, the soundtrack and overall use of sound is once again great. It's haunting, atmospheric and evocative, doing a lot of work to sell the environment of the game.  But the gameplay...well, the gameplay is the same as it was in Limbo, but with more game stretched out over fewer puzzles or ideas, and less of them particularly inventive - more often than not the puzzles aren't clever, or particularly difficult to work out, they just involve finicky timing. Without enough interesting variation to hold your attention.  I really want to like Inside. But it's a game with magnificent sound and a fascinatingly weird world that I want to explore, in which movement is limited to fixed paths, narrative is non-existent and gameplay is pedestrian.   If you liked Limbo and want a similar experience, you'll find something like that here. But I would wait until it was on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "INSIDE is a game that you have never experienced before and will never experience again. It is a story. It is a beauty and a confusion. And there is no other way to describe it. Follow your faceles little boy in a world that you will never truly comprehend and never truly believe. Evade dogs and masked people and creatures living deep in the water. Scurry around trying to solve puzzles and feeling stupid when you figure it out.  The price may seem too much, but if you just stop and listen and watch what happens in the tiniest of moments. Listen to sounds of the faceless boy, watch his movements. This game is beautifully polished. From the background to the smallest interactions of characters. So if you feel like taking on an interesting adventure for a few interesting hours, I highly recommend this game.  Good luck.",
            "review_score": "1"
        },
        {
            "review_text": "Creepy, weird, fun, brain puzzles, short. Overall a great game, would definitely recommend it. Try to go in as spoiler free as possible or at least don't spoil the ending for yourself.    Have fun!   Also, if you liked LIMBO.. you will love this game. ;)",
            "review_score": "1"
        },
        {
            "review_text": "Finished it in around 3 hours. Easily worth the price of admission, i enjoyed it more than any recent theater movie which comes in at the same price tag. As expected, there is nothing to the end here, though i didnt expect to be surprised, but was, at least twice, during it. ;)  Its a visual (joy)ride. A brilliant one.  About Meat.",
            "review_score": "1"
        },
        {
            "review_text": "Inside is a beautiful, thought provoking puzzle based platform game. But it's actually much more than that. If you've ever played Another World, Brothers: a tale of two sons or Limbo - this game shares the same interesting, engaging story-driven gameplay that compells you to empathise with its characters. I wanted to play it because I desperately wanted to succeed, not for myself, but for the main character. I wanted answers, I wanted justice, I wanted freedom.   Inside will be etched into my mind for years to come. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "the game is really great what are you waiting for ... get it now",
            "review_score": "1"
        },
        {
            "review_text": "More neutral than anything, it's not a bad game, but it seems like a lesser Limbo. It looks pretty sure, but that's one of the very few pros for this game compared to Limbo.  Personally, I think it's overpriced for what it delivers, definitely pick it up in the sale since it has a really interesting twist at the end and it gives you enough bait to piece together a story that you think would make sense, but at the same time has some 'plot holes'. Also some of the puzzles are fairly repetitive/'Eh', which is a shame.  If it was around the same price as Limbo, deffo worth a buy, but at £14.99, 3 hours doesn't exactly cut it for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics are just nice. And the background music too.",
            "review_score": "1"
        },
        {
            "review_text": "I ordered me some wings to enjoy while I play this and when I finished the game , at the very end I realized...I forgot to eat the wings. MASTERPIECE!!! playdead delivers once again!",
            "review_score": "1"
        },
        {
            "review_text": "INSIDE is another game, made by Playdead, well known for LIMBO.  If you've played LIMBO, I can certainly say that this game will not disappoint. In case you're unfortunate enough to not have played it, let me sum up what you can expect out of INSIDE.  INSIDE is a 2D-like platformer, with 3D to support it, and you play as a young boy, risking life and limb, traversing this well crafted world. You'll be solving several platforming puzzles, as you travel through the game, and have to make sure any hazards won't kill you. Compared to LIMBO, there's not too many hazards to deal with, but it makes the game feel more exploration based, and you'll certainly feel dread as you explore the game. The deaths are just as nasty as in LIMBO, but describing them, would spoil the surprise. ;)  Like LIMBO, the game has hidden collectibles, is rather linear, rather simplestic (which is a good thing), and has an amazing ambient soundtrack to set the mood (it was composed with a skull!), as you explore and complete puzzles. There's nothing better than having the game reward your smarts, for finding a solution to a hazardous puzzle, than ambient music that's screaming 'well done, you didn't die!'.  Long story short: INSIDE is a highly recommendable puzzle platformer that is so aesthetically pleasing, yet still highly enjoyable game.",
            "review_score": "1"
        },
        {
            "review_text": "Dunno what the hell happened, but enjoyed every second of it :D",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic puzzle and level design, which is difficult but not frustrating. Incredible tonal shifts and musical cues when you reach critical points in the story. Definitely worth the $20.",
            "review_score": "1"
        },
        {
            "review_text": "You like LIMBO? This is 10000% for you  Things i don't like DOGS Echo-sound-bullet that you cannot see. WATER-TYPE GHOST from Amnesia, this time you can see it x_x  9/10, best game ever No need to be on sale, the price itself is worth it",
            "review_score": "1"
        },
        {
            "review_text": "It was way darker than it seemed at my first glance.   The atmosphere of this game is incredible. It's because of the visuals, the sounds and the soundtrack - and how they are incorporated into eachother and work together.  The story of the game is a mystery, but it is clear that there is a red herring throughout the game. There is a hidden message. Figuring it out is not easy. You wouldn't believe some of the theories and discussions floating online.   I think Inside is perfect, and wouldn't change a single thing about it. I played the game slowly, walking instead of running. I think that is the best way of experiencing it, both when it comes to the atmosphere, and noticing the surroundings and its hidden secrets and clues to what the game really is about.",
            "review_score": "1"
        },
        {
            "review_text": "Just incredible. I just finished it and I much say I am speechless. Just speechless.   Worth the money just to experience the journey it puts you on. The amount of WTF moments put you on the edge of your seat and just when you thought it could not get any crazier it does just that.   all i can really say is Holy S*%t......",
            "review_score": "1"
        },
        {
            "review_text": "LIMBO 1.25. INSIDE for me is LIMBO, slightly upgraded in certain areas and downgraded in others.   What's good: + gorgeous 2,5d graphics (3d backgrounds, 2d 'main' plane that you use to move) + fantastic particle effects and physics effects + dark atmosphere enhanced by intense color palette + few interesting puzzles and 'plot twists'  What's bad: - imo puzzles are less interesting than LIMBO ones and there's much less of them overall - a lot of running around (LIMBO had this too, but it was less frustrating) - annoying underwater puzzles - 3 hours of gameplay for 20$/€  So yea, it's like slightly more frustrating (to navigate) LIMBO with different (arguably better) graphics and less puzzles. Not bad overall.",
            "review_score": "1"
        },
        {
            "review_text": "Don't even want to come close to spoiling anything so I'll just say the art direction, sound, and pacing in this game are sublime. Spend an evening to play straight through and you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "very chalanging, despite its short gameplay. but the story is much deeper, the atmosphere is very intense.",
            "review_score": "1"
        },
        {
            "review_text": "Great extension of everything that made Limbo an awesome game. Creepy and ambient and fun as hell. 10/10 would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "This game is gorgeous. Right from the start, even with the relatively slow pace of the game, it grabs you and refuses to let go. Impressively, with no language either written or spoken, they manage to wrest your empathy and attention throughout and build an incredibly engaging story and world. The backgrounds and animation are superb, and the atmosphere soul achingly engaging. The puzzles start light and gradually start to surprise you with their complexity and originality. The characters and creatures you encounter in the game are ruthless and brutal and all work together to create an oppressed and disparaging world that you never want to leave.  A puzzle platformer at the height of it's game. Must have.",
            "review_score": "1"
        },
        {
            "review_text": "inside uses a very simple format to create some tense, atmospheric, dreadful, and cool moments.  I really recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "That certainly was... insane.",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING GAME!!! some of the most intense stuff I've played in a long time. Game is short but its never a bore 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't really that scary, it's more atmospheric and creepy. I can't imagine why you wouldn't like it. Perfect length and very conceptual. Will definitely be playing again.",
            "review_score": "1"
        },
        {
            "review_text": "Holllllllllllllllly ♥♥♥♥! WOW! This game just KICKED UP THE WTF factor to 1000% WOW WOW WOW!!!! I was so WOWed I had to write a review just to say WOW! WOW!",
            "review_score": "1"
        },
        {
            "review_text": "start game: wtf? how do you play?  Mid game: wtf is this?!  end game: wtf was this?!  &lt;insert sad face with tear here&gt; It's the end?!?!? Y U make no sense?! wtf! this was beautiful!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I was uncomfortable from start to finish. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "When Inside was first introduced I couldn't wait for it to come out. After playing Limbo, I thought Inside was going to be awesome. Well for me, when Inside first started, it was awesome. But as I started getting through the game I became disappointed. The challenges did not seem as difficult as Limbo as the storyline just didn't seem right. To me it seemed to extream/odd of a storyline.  The Positive of the game, I really like the graphics/art of the game. I can give the artists a 2 thumbs up for the art work.",
            "review_score": "-1"
        },
        {
            "review_text": "★ ★ ★ ★ ★",
            "review_score": "1"
        },
        {
            "review_text": "If you loved limbo then this is just as amazing. Short, sweet and simplistic. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the greatest games I have ever played. Its only flaw is I wish it were longer. Thats what she said. However it certainly satisfies in other ways. The graphics are both simple yet gorgeous. The attention to detail in regard to the level design and the way the NPC's react to you is a masters class in how do design a game. The deaths can be brutal and horrifying. The puzzles are clever but not maddening. Why are you not playing this game?",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, fun, and pricy for it's length.",
            "review_score": "1"
        },
        {
            "review_text": "It's so wrong to call this a game.  It's an experience. And it's just mind-blowing.  Play it. Just play it. Now.",
            "review_score": "1"
        },
        {
            "review_text": "There actually aren't words for the stylised perfection that this game is. 10/10 am playing again.  If you're looking for a sign, this is it. Good luck",
            "review_score": "1"
        },
        {
            "review_text": "Holy....  It's a fascinating game. Worth the money. I recommend to everyone!",
            "review_score": "1"
        },
        {
            "review_text": "Really atmospheric and really fun and creative puzzles. The deaths are surprising in a good way and add to the experience. Really recommend it especially now that they've fixed a bug that had problems with light and made some puzzles difficult",
            "review_score": "1"
        },
        {
            "review_text": "Simply the best game I've played in this genre.",
            "review_score": "1"
        },
        {
            "review_text": "After playing LIMBO, I was really upset that it had to end and that I finished it, wishing there was a lot more to it. It was my favorite Indie game EVER, until I played INSIDE. INSIDE is seriously a phenomenal step from LIMBO, and now holds the title has my most loved indie game. I also looked at a few things involving the soundtrack (I'm a musician myself) because I really enjoy working with audio software and keyboard/ambient pads. These guys took an ACTUAL HUMAN SKULL, attached a microphone and placed it inside of the skull, played a pre made keyboard track, and the reverberations inside of the skull from the pads make this soundtrack THE COOLEST soundtrack to a game I have ever heard. When I found that out, I imediately had mad respect for Playdead. LIMBO was fantastic, INSIDE was ASTOUNDING, and I simply can't even wait to see what Playdead brings to the table next.",
            "review_score": "1"
        },
        {
            "review_text": "The perfect sequal to LIMBO. 10/10 for me.",
            "review_score": "1"
        },
        {
            "review_text": "Very intriguing and atmospheric game",
            "review_score": "1"
        },
        {
            "review_text": "  Absolutely flawless. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "it is a wonderful game ,and the sight is cool but less difficult,sometimes the music can scare my ♥♥♥♥ out ,lol",
            "review_score": "1"
        },
        {
            "review_text": "Postive: - The dark atmospher is some of the best you will find in a video game - You want to play to the end of the game to see what this weird story is all about - Controls are very responsive  - The game is well optimized and can run on low end systems with ease  Negative: - The game is VERY short. It's a 3-4 hours game. - Not much replay value. But that depends on the player of course  Verdict:  INSIDE is not a bad game. It's very good at what it aims to do and that it's to create a dark atmospher for the gameplay. I had fun playing the game to the end and I am gald I did . But for me, 20 euros is just a to high for a game with so little replay value and puzzles that are VERY easy to solve.  Get the game on sale and play it in a DARK room and enjoy it for what it is :)",
            "review_score": "1"
        },
        {
            "review_text": "Splendid game - had a blast playing it. A bit short but the atmosphere makes up for it. Some nice visual surprises and a superb soundtrack. Could be cheaper.  8.5 Freshies out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Its got beauty, its got brains, its got fun. Buy it, dont be dumb. A lot of people are complaining it costs too much at the moment - I disagree. If youre low on funds you probably shouldnt be looking at buying games right now. Common sense nonwithstanding the game, i think, is priced well inview of the amount of polish and fun the game provides. INSIDE is spooky, scary in places, and fun. People also seem to whinge about the story, certain events, locations, and unexplained items. Why? Do you need your hand held? Picture this: this is a game which is trying to achieve a sense of suspension of reality. We play games for this. Perhaps youre NOT an omniscient protagonist and you dont have all the answers. Pretty scary to find yourself seemingly breaking out of a vast, strange facility and on the run from people who seem to want you dead for a reason you have no idea of.  Personally I love games that dont hold your hand. Youre totally in the dark. And its atmospheric. Perfectly done.",
            "review_score": "1"
        },
        {
            "review_text": "'Limbo, but better'  The game looks amazing.  The puzzles are challenging enough to be rewarding but achievable to keep the flow of the game.   The core of the game is in essence a simple platformer, but it is the attention to detail that take a simple game and creates a true gem.  While £15 for a game you can complete in 2 - 3 hours is expensive, in my opinion it is worth the money for the exceptional atmosphere that Playdead have created, ",
            "review_score": "1"
        },
        {
            "review_text": "An intriguing mellow 2D platformer. Great retro/futuristic, 50's sci-Fi feel and a very clean graphical styling to this game. Highly Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Inside is one of the best video game experiences I have ever had. As far as I am concerned, it is absolutely flawless.  I enjoyed Play Dead's previous title Limbo, however in my mind it wasn't as perfected. It was incredibly atmospheric and beautiful, but I felt the pacing was a bit too long as well as repetetive in parts. Don't get me wrong, I absolutely adore Limbo and it really kickstarted the 'indie' gaming movement and is a classic. Anyways, back to Inside. Actually, before I say anything about Inside I need to talk about another short 20ish dollar title which many people really enjoyed.   Firewatch. So I was MASSIVELY disappointed with that game. I am all for games that rely on imagination and the preconceptions of the player, HOWEVER the FW ending to me felt unbelievably forced leaving virtually no room for interpretation at the end. See, Inside doesn't have a perfect ending with a bow wrapped around it. It leaves the story and the impact it has on the player, well, up to the player! This is why I absolutely adored it. There are already a RIDICULOUS amount of interpretations from the game that have popped up online. As others have suggested I HIGHLY recommend every player finds the alternate ending as well, it adds some very interesting elements.   Aesthetically the game is stunning, with this bleak artstyle that is hauntingly beautiful. The animation is some of the smoothest I have ever seen and the particle effects are outstanding. The visuals always conjure up feelings of unease and can at times be quite disturbing. I am at a time in my life where I work and go to college and don't have alot of time (or frankly the will power) to get immersed in a massive game. That being said, I completed this game twice in one sitting. I fell in love.   The gameplay I feel is where this game ticked all the right boxes for me. This is very much a visual narrative, similar to Limbo. However, the puzzles are much easier and don't require a whole lot of trial and error. I believe this was very much intentional because of the length of Limbo. I was also amazed at the pacing of the title. It clocks in at around 3 hours but it felt like 30 minutes. Along the way there are certain simple mechanics that are introduced. If this were any other game made by another studio the developers would have abused said mechanic to 'pad' the game. Each new 'shtick' is introduced once and used, only once. This was utterly refreshing to me.  What will make or break this game for you is what you desire out of a title. Do you want a solid story with a satisfying conclusion? If so, I suggest you wait for a sale as you will be disappointed. However, if you want something truly unique and thought provoking I highly recommend you give Inside a shot. Whatever you do, DO NOT watch any videos or read anything about it. The story goes some truly fantastic ways that I do not believe should be spoiled for anyone.",
            "review_score": "1"
        },
        {
            "review_text": "What seems to at first to be nothing more than a fanservice filled loveletter to LIMBO, INSIDE quickly diverges from its campy Iron Giant-eque beginning into an eerie Orwellian world filled with plenty of scares and tense moments. Gameplay wise, I feel the puzzles are lacking compared to Limbo overall, such as some puzzles being a touchy pain to deal with (ie. hiding underneath a pipe to avoid a hostile light fixture). However, most of the puzzles were enjoyable, just a tad on the easy side along with the occassional irritating task. The game did nail the atmosphere down with the gloomy subdued color pallete and the lonely urban backgrounds. Overall I believe this game does warrant a purchase, although if you don't care for backgrounds and tone I'd suggest waiting for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "The big thing that people keep bringing up is that it takes about 3 hours to complete. While this is true, and as the game stands at $19.99, Those 3 hours were the most mind boggling and intense 3 hours I've ever experienced. Most $60 triple A titles that say it takes 8 hours or more to complete their game usually mean about 3 hours of actual gameplay and 5 hours of cutscenes and/or aimless wandering. I would argue that the money you spend on this game is money well spent, its very reasonably priced for what it delivers. I've recently completed the game and it left me speechless, and i want to go back and find everything I missed, this means another 3+ hours more of gameplay (sure its the same story over again, but the point is I was left wanting to experience it again.) If you're on a low game budget, I would argue that this is the game you would want to spend your money on. The odd sense of urgency throughout the entire game kept me playing all the way to the end. Even though not a single word was uttered throughout the entire game, the game had more story than most movies these days and it still leaves me pondering what actually happened.",
            "review_score": "1"
        },
        {
            "review_text": "Inside is a gem of a game. An unexpected pleasure to play. While I loved Limbo from the same developer, Playdead, it felt a little lacking in content and the journey finished sooner than anticipated. Inside isn't that much longer either but for the few hours it lasts, it's a worthwhile trip down mystery lane. The simple clean visuals complement the detailed atmosphere, the rich sound effects and the intense situations. The only reason I'm giving this a 9/10 is the lack of more things to do and more mechanics. You see, the more you play this game, the less you want it to end and the more mechanics you wish for - slow progression, basic weapons or clever tricks to defend your frail self etc. But as it stands, this game is worth EVERY rupee spent, And it is best played in bursts, to stretch the experience out. DON'T RUSH IT. TAKE IT SLOW. ABSORB IT ALL. This isn't meant to be just entertainment. This is meant to be an EXPERIENCE. Few games remain as memorable to me but this one will go down on my all time favorites list. Great Job Playdead!!. Eager to see what you Indie guys can create as your next game - maybe even a full budget big game eh?? :P  Can't wait for this to come to PS Vita as well. Eventually :)",
            "review_score": "1"
        },
        {
            "review_text": "Once in a while a game comes along which strips free from the commonplace, carving its own style, substance and ideas. It is art in its purest form. No tropes, guidelines, or recycled content just a game that can stand on it's own and hold up it's hand shouting 'Look at me!' Inside is one of these rare games.  The game feels like a vignette or collage of ideologies, stories and themes. There is no dialogue, no menus, or on screen prompts, just a pure unadulterated experience from start to finish. Like all great pieces it surpasses genre. Horror, sci-fi, drama. And most of all it carries some very potent themes of existentialism, with a very orwellian style of atmosphere.  It is so meticulously crafted that you start to think the developers scrutinizingly made it pixel by pixel. Animation is fluid and creative, and sound design among the best I've heard in decades. Framing and compositional techniques are brought to the forefront. The way the camera moves in 2.5d space is very satisfying and the developers clearly guide your eye to where you want to be looking, be it through use of color or pulling in the camera. The palette of colors changes throughout the game seemingly to reflect certain feeling or moods, beginning with a very monochromatic look and towards the end breathing some life into the frame with splashes of orange and blue.  This is quite frankly a masterclass in developing games and for me is the best game I've played this decade. If you're on the fence, just do yourself a favor and buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Very well done. Just holy crap that ending. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "First of all, sorry about my English. It isn't my native language, but I tried my best to wrote a good and understandable review.   Intro:   PlayDead's Limbo is one of the best videogames I've ever played (I completed nearly 600 games to this day). It was the game that showed to me (and to lot of others aswell) how good an independent and smaller game can be. Limbo had an amazing atmoshpere with an intelligent, layered, visual story-telling with a bit of symbolism, and had awesome puzzle and platforming sections... and a touching, cathartic ending.  6 years after the release of the mentoined cult classic, PlayDead's new game finally arrived. Inside builds upon the foundation that made Limbo great, so there's a lot of similarities between the two games, but at the same time, they are completely different from each other.   Story:   While Limbo was a much more personal experience, Inside's story is more about the possible future's society, the importance of our consciousness, and it's a critics about today's brainwashed people too in a very interesting way - at least in my interpretation. If you seen The Matrix, Dark City, Abre los Ojos, Equilibrium, or any similar movies, you must be understand a little bit more what I'm talking about. This is one of the many aspects that make this game great: there's a lot of room for different interpretations about it's story.   Art Design / Visual Style:   The other important difference between the two games is the visual style. While both games have a very distinct art design, Inside has much more details, and a little bit more colors too compared to Limbo's black and white dominated landscape. But maybe the most important change in terms of the visuals is the 2,5D nature of Inside. This thing alone makes the game's world much more alive - at least for me. There's a lot more things happening in the background, and it usually affects the gameplay too in an interesting way.   Gameplay:   Well, if I mentoined gameplay, I want to talk about that too. It's very fun and addictive, but it's definitely more straightforward this time, at least I didn't really stuck anywhere in the game. The puzzles - most of the time - were pretty easy to solve. On the other hand, it was a lot longer than Limbo, it took me 4 hours to finish it. (By the way, it hasn't got any achievements -maybe because the developers wanted you to play the game for the game, so you don't need to play attention to these distractions... they can break the immersion and the general focus sometimes.) My bad, it actually has achievements.   Atmoshpere:   The atmoshpere is top-notch, and not just because the excellent visual design. Very few artists can use silence in an effective way (few honorable mentions: Stanley Kubrick: various movies, Christopher Nolan: Interstellar - sorry, I'm a movie-freak too), but PlayDead can - they already proved it with Limbo, and they proved it again with Inside. There are very few sounds, or music through the game. But when they are playing, they are very, very effective.   Verdict:   If it wasn't obvious enough, it's a masterpiece. If you admit that gaming is an art form, and if you aren't a guy with an IQ of 70 or less, who socialized on commercial trash, like CTRL+C/CTRL+V repetitive open-world games, borefest grind-shooters, dumb Hollywood movies (made by the lowest common denominator kept in mind), or 'music' loved by the mass - so in other words, if you are an intelligent human being, you are going to love this.   A final advice:   I think in order to really appreciate Inside, after you completed it, days need to past, and you need to think about it, what was this amazing journey is all about. Don't worry, this game makes you think anyway. Day by day, slowly you can realize the meaning of the story, and at the same time you can slowly understand the important messages and symbolism too.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down my GOTY so far for 2016!  This was one of THE MOST incredible experiences I've ever had from a video game. I was left utterly speechless when the game finished.  Everything is so polished and well done, kudos to the devs for another (major step up from even the well received, Limbo) fantastic title. The visuals are beautiful and dark, the atmosphere is just incredible, the small details, the audio, the fluidity of the controls. Everything about this game had me completely engrossed.  Recommend trying to finish it in one playthrough, but you'll be so hooked that you wouldn't think of doing otherwise. It's short, but I think it's the perfect length for this kind of narrative.  Thank you, Playdead. I'm actually overwhelmed at how amazing that experience was.",
            "review_score": "1"
        },
        {
            "review_text": "Play INSIDE. It's a beautiful and satisfying platformer.",
            "review_score": "1"
        },
        {
            "review_text": "Was a very imersive game. I had no idea that the environment would seem that massive. It's an awesome experience.",
            "review_score": "1"
        },
        {
            "review_text": "If you think a 2 hour game justifies the 15 pound price point then sure its the best game ever. It improves upon almost every aspect besides the short length and puzzles when compared to Limbo. Atmosphere alone warrants a playthrough.   I'd say its great, if you can grab it at half its price during sale.",
            "review_score": "1"
        },
        {
            "review_text": "That was... Strange, fascinatingly strange.  Playdead nailed the atmospheric puzzle-platformer again. Yeah, this game feels like it hits the beats a little too similarly to LIMBO at times, but all-around feels more refined and a bit more coherent to the story it's telling. The mechanics and gimmicks are different from LIMBO too, I think it's just a matter that Playdead's filling a niche that they're good at and there's nothing wrong with that if they do it well, and damn do they ever! One thing I love is that while LIMBO felt like it really frontloaded its best parts, INSIDE cushions the big moments throughout, so I never felt too dragged through an excess of puzzle sections. Not much really outstays its welcome to any unreasonable extent.  If you're a fan of Interplay's old classics, stuff like Heart of Darkness or like the Oddworld games, or if you just played LIMBO and liked it well enough, you may want to check this out. Only detractions I've heard about or experienced are length and price. Yes, it's under 3 hours according to my Steam time for a solid playthrough, but really it didn't feel like that to me, I got lost in its world and lost track of time, and a good game will do that to you, I kept wondering how many hours passed, I was seriously surprised when I saw my time played.  Will I be playing it again? Maybe not soon, but LIMBO brought me back in with its alternatingly sinister and tranquil world, as well as memorable moments, and I think INSIDE will do the same. If anything, wait for a sale, but I really do think it's worth playing,",
            "review_score": "1"
        },
        {
            "review_text": "Excellent both in act, sound and scene. I strongly recommend.",
            "review_score": "1"
        },
        {
            "review_text": " Dark, haunting and in a very similar fashion to limbo",
            "review_score": "1"
        },
        {
            "review_text": "Great simple puzzle game that has both satisfying gameplay and an intriguing story!",
            "review_score": "1"
        },
        {
            "review_text": "I'm torn about this game. At the end of the day I recommend it, but I have huge issues with a few things. First off, everyone talks about how there's an amazing story, but honestly there's no story whatsoever. There is nothing but a setting. The setting is incredible; to be sure, and it is revealed beautifully and in a way that makes it feel like a story, but there is absolutely no plot. I felt no motivation to play other than wondering what the end was. The only story to be gleaned is what people theorize after watching the vague ending play out. If you are coming for the story, you will be intrigued the whole time, but leave feeling dissatisfied and sold short.  There are also many sequences with very large distances to cover, frustratingly so given your character's movement speed. This is especially frustrating during one of my favorite parts in the game, the 20 man puzzle, as it's plagued with backtracking vast distances. The artwork isn't good enough to fill the time gap these massive distances create.  The underwater section grew very monotonous and tedious very quickly as well, to the point where I was dreading anytime my feet got a little wet. Luckily it stopped after a while but I was very frustrated with that whole segment and almost stopped playing at it.  That all being said, the universe this takes place in is just fascinating and worth the money just to have it revealed to you. the clever puzzles are an added bonus, and the last-second escape sequences throughout the game are breathtaking and always have you on edge. You always feel both in danger and in awe at the same time. The art is fantastic, and the animations are quite possibly the best I've seen in any game, and perfectly complement the nice and tight controls.  The experience is great and worth your money; only the level design hurts the otherwise outstanding gameplay, and the lack of a plot removes a lot of potential humanity and motivation I desparately wanted to feel for our protagonist. I guess given some of the theories about the game that might be intentional, but during the first playthrough it really just made me less excited for what should be an easy 10/10 game. But again, absolutely worth the money. You should definitely play it.",
            "review_score": "1"
        },
        {
            "review_text": "An atmospheric, breath-taking journey through a world that just isn't quite right. If you want a leveling system or complex, convulted mechanics, go play another f***ing game you cynics. While Inside does have various platforming elements and puzzle-solving sections, this game earns it's masterful rating through the experience. I strongly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Limbo was brilliant. This game is utterly fantastic. It takes everything Limbo did well and does it better, while also providing a genuinely unsettling and unique atmosphere with puzzles just tricky enough to make you feel smart for getting past them, but not hard enough to drive you up the wall figuring them out. This game is utterly worth it in every way and I invite all of you to enjoy being as harrowingly unsettled as I was.",
            "review_score": "1"
        },
        {
            "review_text": "**** Updated below primary review *****  Pure atmospheric puzzle solving. Not a word shall be spoken of the events. Nothing can be said to do it justice.   Games should aspire to this simplistic granduer. Better than Limbo. Not Limbo.   Just play it. And pay attention.  play  **update  completed first run. wow. freakin wow. more stunned by the fact that I still have so much more to go back and explore. The game presses you and pressures you at points, but there are so many areas that are just phenomenally vast that exploration is a must. Of course, the urgent need to find out where it is going and what is happening compels you to abandon sightseeing in favor of advancing your position. Incredibly well paced and smartly designed well worth every penny",
            "review_score": "1"
        },
        {
            "review_text": "Okay, let's start with what you may have seen in other reviews.  This game is absolutely incredible. For a game of this type, sometimes pacing can make you walk away and forget the game is in your library. In INSIDE, the pace is utterly perfect. The intensity builds from the beginning and the ambiance is truly inspiring. There are no words, but so much story oozes through its morbid tone. I had more and more burning question as the game went on. It all built to the ending where you arrive and the center of it all - where all of your questions will be answered one by one, silently through observation and interaction with the environment.  BUT THAT DOESN'T HAPPEN!  You reach the end - the game slows to a halt and ♥♥♥♥♥ the bed. It answers absolutely none of your questions and does not even provide clues or things you can interpret how you wish.  I am colossally disappointed in the ending of this game - so much so that if the rest of the game was not LITERALLY perfect, I'd consider this a trainwreck of a game.  Nevertheless, if you are looking for an extremely creative 3 hour ride through a surreal, grim world...check it out.",
            "review_score": "1"
        },
        {
            "review_text": "This is a must play game. This is kinda game you spend 5 hours in the weekend to stuck yourself in this immersive atmospheric experience. Thought provoking and emotion journey start from beginning till end.   ",
            "review_score": "1"
        },
        {
            "review_text": "Short, smart, not too easy, not too hard Doesn't overstay its welcome Quite an experience, especially the ending",
            "review_score": "1"
        },
        {
            "review_text": "This game has an great atmosphere. Everything works well, soundtrack, graphics, detail and gameplay. While playing you can really feel the love that Playdead invested in creating this amazing game. I surely recommend this game. If you like puzzles, a story with space for your own interpretations and beautiful created games, then INSIDE is a must have/played for you!",
            "review_score": "1"
        },
        {
            "review_text": "It's up there with Limbo, Journey and Brothers. Excellent musical score, great atmosphere, it really immerses you in the story. By the end things get pretty messed up, but it's well worth the couple hours of play. I definitely recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Honestly this is one of the most.... stresful, hardcore experience in gaming I ever had while still not being able to put it down. It is so ♥♥♥♥♥♥♥ 'heavy'! It grips for the whole game duration ~(3-4h)  + artstyle and animations - this isnt fotorealistic, but the way materials/light/animations blend together = masterpiece + story or the lack of it (it kinda unfolds, lots of room for interpretation) + it doesn't have a 'dull' moments at all, you are always on the edge of the seat + great audio and the use of music in certain scenes + if you liked LIMBO - just buy this already. + Not spoiling anything but after 5 minutes i felt like in a universe similar to the HL2, you feel hunted, alone and 'urge to never stop running'  - it could be longer, no doubt...  Numeric rating? I'd give it a 9/10 for sure",
            "review_score": "1"
        },
        {
            "review_text": "Pros +  +++++Graphics &amp; Animations ++++Level Design ++++Sound Effects  Worth 19,99  Cons -   ---Short --Story",
            "review_score": "1"
        },
        {
            "review_text": "I havent played a game in a long time that left me sitting gobsmacked like this one just did. I have literally said wow out loud several times since it ended. Already reading up ending theories...  I really loved Limbo and this was somehow even better!  ...wow...  (Please make a milion games forever Playdead!)",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS A MASTERPIECE. INSIDE is the creepiest and one of the eeriest games I have ever played, bar none. On a scale of 1-10 for creepiness, I give it a 11! I can almost guarantee you that you won't see the plot twist(s) and ending coming - and the game does it with absolutely zero dialogue. Hours after completing the game, I am still dumbfounded by the ending and the thinking about what it means. It sounds like an impossible balancing act, but the game concludes in a way that doesn't leave you hanging....and it doesn't answer all of your questions either.  It would be a sin to not talk about how good this game looks. Every frame in this game is a painting! Screenshots from this game could go in a museum. While most games tend to exhibit the limitations of its graphics with stuff like jagged lines or overdone lighting, the graphics in INSIDE are....perfect! Everything is just so polished, one has to nitpick to notice something out of place. The game is also very careful with its colour palette. It purposefully maintains only cool colours throughout, and reserves warm colours for only things that are supposed to draw the player's attention to it.  This game also sounds as eerie as it plays. There were times I almost felt claustrophobic because the character's heavy breathing in enclosed spaces sounded so believable. There is no actual soundtrack, only sounds, and you are reminded of everything through sound. From the echo of flipping a metal switch in an empty room to running out of breath underwater, the immersive sonic experience makes you fully believe that you are in the game.  This game has been in development for six years (!) and it shows. It draws you in, keeps you curious, and then it shocks you. And my favourite part is how it pulls it off without going out of its way to make the point. By not using dialogue to tell the story, and restricting the colour palette of the graphics, and not having a soundtrack, this game is a pure masterclass in self-restraint and subtlety.  *tip: don't play this game at night  *tip 2: don't play this with earpieces if you have claustrophobia",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite side scrolling games of all time. I am truly blown away by how beautifully crafted this game is. I was on the edge of my seat from start to finish. The replay value is great too, you will notice things you didn't before. Every aspect of the art and gameplay is beautifully exocuted. It is a MUST BUY!!  Without spoiling, I do have to say the ending was very confusing and a bit dissappointing. I really loved every moment of the game up until then. It felt like the game abruptly ended without answering all the questions the story visually layed out.   ",
            "review_score": "1"
        },
        {
            "review_text": "great game, but wait till it gets cheaper to buy it",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game is like stepping into a contemporary art museum. Everything is so weird and you don't understand a single thing, but they are all masterpieces, beautifully crafted and made to mess with your head. And you wouldn't mind visiting again.",
            "review_score": "1"
        },
        {
            "review_text": "Mostly there are like two groups of people who are reading all this reviews:  1. People who completed this game and looking for some warm read from people who also lived this story  2. People who are considering to buy it or not  Ok second group, the answer to your question is short - buy it. Like literally, click the buy button and stop wasting your time.  Alright the game is short. Yep, I had no vibration on Xbox One controller under windows 10. Does it still worth the price? Jeez, of course it does! Look at this video or the screens, you can see this? This perspective, this tone...its just stunning. You will have the journey that will remain with you to the last of your days, why bothering with 12-20$?   P.S. Smartass people who are proud of themselves about refunding this game - I can totaly understand you. Its very hard to complete this beauty and forget that you are an as**ole.",
            "review_score": "1"
        },
        {
            "review_text": "It's awesome game, suka ♥♥♥♥♥. Communist in me delighted by the atmosphere. This is one of the best games to play drunk.",
            "review_score": "1"
        },
        {
            "review_text": "World Design: 10/10 - Gorgeous, truly epic. Massive. Level Design: 8/10 - Some of the puzzles  Soundtrack: 10/10 - Gorgeous, truly epic. Diagetic Audio: 8/10 - Dogs were annoying as all hell. Graphics: 9/10 - really well executed art style Gameplay: 10/10 - Hella intuitive Story: 4/10 - big buildup with a lot of questions, nothing solidly answered; left feeling dis-satisfied even with the secret ending.   Length vs Enjoyability: 5/10 - 3 hours for first playthrough, but an extremely enjoyable 3 hours. I wanted a lot more. I went through again and took the time to find the secret ending (with a little help from a walkthrough online to get me set in the right direction. I didn't know there'd be a secret ending. I needed to see it for myself).  Overall, about a 8/10.   I recommend it. ",
            "review_score": "1"
        },
        {
            "review_text": "This is by far one of the best games I have ever played. The atmosphere is incredible and story is really something to think about.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Smooth Gameplay. Intense Gameplay Moments. Short but unique story. Unforgettable moments. Creepy,Scary.  Must Buy.  ",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the weirdest games I've played in a while. The art is gorgeous, the music is fitting, and the evoloving story is discovered comletely through gameplay, with no narration or explanation. It's really something that has to be experienced to truly understand.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an immerse experience. the gameplay is flawless, the whole mix of graphics,music,atmosphere, puzzles, storyline is so good - even the saves are done so good that you dont get frustrated in event your char dies.. For utilizing just 5 keyboard keys, this is a freaking masterpiece. i can only recommend to all - buy and play, this game does deliver.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed Limbo this is on a whole other level. the puzzles aren't tough but the journey wrapped around the puzzles makes it worth it.  Games roughly 3 hours long.  Play it !!!",
            "review_score": "1"
        },
        {
            "review_text": "The game has an amazing atmosphere. There are few games that really really master it. It feels like a cross between Halflife 2, with it's dystopian-completely-hopeless feel, and Out of This World with it's gameplay. The play is fluid, the character &amp; backgrounds are nuanced and subtle. I haven't finished it yet, but it's sometimes a little humorous, sometimes scary as heck, always moody and gorgeous. It's not particularly difficult, a few sections I've had to replay a number of times to solve the puzzle, but haven't been stuck yet. Although there were a couple that took me a little bit to work out the controls (e.g. press and hold down to turn the crank).  The music &amp; sound is fantastic and fitting. The story is slowly revealed and interesting. The controls are pretty perfect, fluid. The only very very minor thing with controls: I modified before even playing was remapped 'grab' and 'jump' to something a little more normal.  There are some action sequences, where stuff is happening and you need to react reasonably quickly, but those are well separated by running through a whole host of interesting locations, or more leisurely puzzles.  It can be a bit graphic at times, I was pretty surprised the first few times I perished (I've been strangled, drowned, shot, exploded, crushed, mauled to death by animals...).  I can't give this enough thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "In one word: MASTERPIECE! Absolutely brilliant, i feel sorry that there are very few game on the market with this quality and atmosphere. A piece of ART!",
            "review_score": "1"
        },
        {
            "review_text": "If you like Out of this world, Limbo, and those types of games, you'll like Inside as well. I'd give it an 8/10, there is a crazy twist for the last 10-15% of the game which is cool, but the game ended a little two abruptly for my tastes, considering I didn't even hit 3 hours played and I was already done. Great 2-3 hours, but wish it was closer to 5-6 hours etc.  $20 is a little steep for &lt; 3 hours gametime, but if you can get it for &lt; $15, I'd recommend it, or if you are a fan of the above type games and have the cash, just get it and enjoy the 3 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Whoever was in charge of art direction for this game please go see a ♥♥♥♥ing therapist.  10/10 will proabbly have vivid nightmares for the night.",
            "review_score": "1"
        },
        {
            "review_text": "Like Limbo before it, Inside is a dark and immensely well-done puzzle platformer. Every aspect of this game is superb, from the sound, lighting, animation, to the subtle way the camera shifts perspective so this sidescroller really feels set in a 3D world. I took more screenshots in this game than any other in recent memory. Every single shot looks like a well framed photograph; this is how excellent the art direction was.   Inside is a deeply disturbing but astounding and immersive. It will make you hold your breath in moments of tension and shout in moments of panic, all the while glued to your screen. Every time you think it can't get any more creepy or bizarre, it outdoes itself.   Yes, it is a short game. A full play-through is about 3-4 hours. However, finding the secrets, collecting achivements, and exploring things missed in the first run through should add a number of extra hours if you explore organically rather than using guides.  As far as gameplay, the puzzles are clever but never difficult or frustrating, and the challenge is in finding the solution, not having the coordination or finger dexterity to execute it. Plays very well on a controller.  There is really nothing I can say about the actual story/content of the game that wouldn't somehow dampen the experience of a first time player, so I'm going to say nothing but: BUY THIS. PLAY THIS. Definitely my favourite game this year and probably in my top ten list of all time. Opinions on the ending has been very polarised, but personally I liked it.  I seldom buy full priced games nowadays but this is one that is completely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "As someone who felt that Playdead's  Limbo  was overrated, I have to admit that their follow-up  INSIDE  was a bit of a surprise. Whereas the former felt like a floaty, style-over-substance Flash platformer, the latter feels far more mature and refined in its execution.  The puzzle design is at times quite clever and always intuitive. The game never bombards the player with too many moving parts—and there's very little bactracking involved, meaning that moving forward is usually the right solution.  One major criticism to note: often the environments over-indulge in wide, empty areas, which at times feels like deliberate padding in a rather short game.  The demo gives an excellent overview of the final product—if you're not sure if this game is for you, you'll know by the end of the demo.  ",
            "review_score": "1"
        },
        {
            "review_text": "+awesome atmosphere +nice looking graphics/backgrounds +wtf moments +fitting sound/music +similar to limbo but much better because of more diverse backgrounds/sound/story  -too short for that amount of money (4-5 hrs)",
            "review_score": "1"
        },
        {
            "review_text": "Incredible art, style and atmosphere (with some surprising elements, so don't watch the playthrough beforehand!). Just a really great game and probably my favorite of 2016 so far!  The puzzles are rather easy but they fit into world of the game and never feel repetitive or too simple.   ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing art style and animations. This game is pure art",
            "review_score": "1"
        },
        {
            "review_text": "Still hesitating to buy this game? This game is one of the most 3~5 crafted/polished hours you will ever experienced in your life. Do not be fooled by the 'short duration' of this game. Give it a try, it will reevaluate your'quality over quantity' concept.",
            "review_score": "1"
        },
        {
            "review_text": "after limbo, i was looking forward to this and it didnt disappoint me at all! fun game and the dark vibe was so good.",
            "review_score": "1"
        },
        {
            "review_text": "Great looks, great sound, great story, even if I have no idea what happened.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked LIMBO, or you like dead pigs, I would say check this game out.",
            "review_score": "1"
        },
        {
            "review_text": "Great looks, great sound, great story, even if I have no idea what happened.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing masterpiece. One of the best games I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. I'm just over four hours into it, and I feel bad every time the boy dies. And, you will die a lot. It will be brutal. The brutality of this game amazes me.  The general atmosphere of the game reminds me of Half Life 2. This is what the world would look like after Gordon Freeman has rid us of the Combine, yet the broken down technology remains and there are bad people that want to use what is left. There is also a sense of Portal, with the large corporate environments devoid of life. There are zombies, too. Not the type that eat brains; they are your allies/helpers this time around.  I played a bit of Limbo, but it didn't grab me like INSIDE. I can play for 20 - 30 minutes, then I have to stop. The puzzles are challenging, but not overwhelming. I don't even like to call them puzzles, just a clever way for the boy to move forward.   Out of all the dark and moody games I have played, this one has gotten to me the most - it seems devoid of hope. I hope the boy wins in the end.  The environments are large and dark, I wish there was an option to look around to see all the detail. It is a side scroller, so the options for progression are straightforward. The soundtrack is fantastic, and the sound effects just add to the overall dismal personality of the game.  The long haired mermaid will give me nightmares.  EDIT: Took me 9 hours to finish it. Creepy game all around. Weird things happen, then they just become more weird.",
            "review_score": "1"
        },
        {
            "review_text": "Worth the 4 hours of gameplay I spent on it! I love the atmosphere! I'll leave the story for you to find out. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "A work of art",
            "review_score": "1"
        },
        {
            "review_text": "This game is not long but has an extremely complicated storyline with tons of puzzles to solve. The graphics is also one of the bust out of all the game I have ever played. For people who love puzzle games I would definitely recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Worth every penny, a surreal nightmaring experience that will grip you, and not let go until it's over.  I wish I knew how they did the things they did with the Unity engine because damn, new high water mark in stylized graphics right here.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. Great little relaxing puzzle game, The graphical style looks amazing as you run through the levels and the music fits perfectly with each scene. I couldnt tell you what the heck its about though as it gets weirder and weirder.",
            "review_score": "1"
        },
        {
            "review_text": "  I loved this game, i've been waiting for it since limbo! can be pricey for the time it takes to complete however i enjoyed it. If you like limbo you'll deffo like this!",
            "review_score": "1"
        },
        {
            "review_text": "Wow. My jaw hit the floor over and over in this game, I'm going to need stitches from all the jaw-drop-floor hitting action. Its a short game, Easily completed in 3-4 hours, plus some extra time to reach the alternate ending. Don't let that sway you from a very unique and ineresting game.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and twisted at the same time...",
            "review_score": "1"
        },
        {
            "review_text": "Two concerns I had before buying and what I think about them after completing the game:   Too short?   A first play through without the optional puzzles (for the achievements) takes around 6h, so yes, it's a bit short for $20. BUT: considering the insane level of polish and attention to detail (graphics, animations!!, sound, overall atmosphere) and that there is absolutely none of your typical 'filler content' to stretch play time, it is well worth it, even at full price.   Too easy?   Yes, the puzzles are rather easy, but not because they are obvious, bland or trivial (actually, some of them are quite involved), but because there is always only a single mandatory puzzle at any given time and there are no red herrings (objects that look as if they were important but actually they are just a distraction). So, you always know the obstacle at hand and what tools you have to overcome it, which makes it less likely to get stuck. If this is a pro or con depends on preference, but I enjoyed this a lot, because it allows to solve the puzzles by logical thinking rather than frustrating trial and error or looking up solutions on the web. I had some nice eureka moments. Also, this game is a lot about atmosphere, and getting stuck on a puzzle for hours would compromise that.  Overall fantastic game and a must-buy for people who like atmospheric games.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Play it now. Don't look att trailer or reviews. They will only spoil the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesom !just go play it!",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly beautiful, smart, fun, freaky, scary and much more. Highly recommended!!",
            "review_score": "1"
        },
        {
            "review_text": "See this review? good. Play the game. don't read anything under this as anything could spoil your experience.  ",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Limbo, you will love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Fully realised vision. Smart puzzles. Gripping storytelling without uttering a word. Atmospheric. Gorgeous. Thought provoking. Could not be improved upon. Though I do enjoy other games more (hotline miami 2, mortal kombat 1, etc.) this game is flawless. Thus ... 10 / 10",
            "review_score": "1"
        },
        {
            "review_text": "Worth. Glad I bought it. So much better than Limbo. You can really see the direction from the interaction and the puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Love the game design!!!",
            "review_score": "1"
        },
        {
            "review_text": "A copy of Limbo that has a very short playtime with many puzzles that are less fun and dynamic than it's predecessor. I played the game till the submarine part, got a refund and then watched the walkthrough on youtube. Overall the environments are unremarkable, the puzzles are easy and tedious, and the story is non-existent. Some postive aspects of Inside are that the animations are fantastic, the attention to details is impressive, and the character controls are good.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a decent game. I'm guessing 90% of the people that are interested in this played LIMBO so you know what to expect gameplay wise. The main problem I have is with the 'story'. It's just a bunch of random ♥♥♥♥ thrown together. The ending was pretty cool at least.",
            "review_score": "1"
        },
        {
            "review_text": "Great little game well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "INSIDE is a scrolling 2D puzzle platformer made by the same people who made Limbo.  This is a neat, quirky and often beautiful and fascinating game.  Puzzle solving can also be tedious. Solving the various puzzles often involves repetition and backtracking.  If, like me, you really do find puzzle solving tedious and generally don't care for puzzle games, I suggest either avoiding it or getting it for really cheap.  If, like me, you can get throught the tedium of puzzle solving, there is something interesting here.",
            "review_score": "1"
        },
        {
            "review_text": "There are no words...  Only this Wonderful game and its Magnificent last level.  It's Limbo + Journey + ICO + A Perfect World + I Have No Mouth and I Must Scream.  ...  Just BUY it NOW.  This is Game of the Year material.  And I will never forget this experience -- it does what good Art is SUPPOSED to do.  M A S T E R P I E C E  --fin--",
            "review_score": "1"
        },
        {
            "review_text": "I think this is my first review of a game. I remember paying LIMBO on another account and got so invested in the story, I shed a tear when it ended. This game is no different and in face an even better sequel than I could have hoped for. You need to play this. It's terrifying, beautiful, and clever all at the same time. I recommend this game to anyone. I mean anyone. I don't care if this is your first puzzle/platform experience. This game is truly a work of art.",
            "review_score": "1"
        },
        {
            "review_text": "  After playing Limbo and how good that was I never thought INSIDE would top it, boy was I wrong and this might one of my favorite games this year. I'll try to keep this as spoiler free as possible and I'll split this review up into three parts (Presentation, Gameplay, and Verdict)    Presentation  Right from the start this game pulls you in with it's dark and capitivating setting, I love this world and helping that is the excellent sound design and graphics. This game looks stunning especially with all the smoke, rain, fire, and dirt effects that's present in almost every section of the game. The same goes for the sound with the music and sound effects adding to the game as you go seemlessly from one part to another.    Gameplay  At first INSIDE looks like a simple 2D puzzle platformer with a dark setting but it's more than that, each puzzle is wonderfully design and at times they can be a little confusing but thankfully they're not too difficult and don't increase in difficulty as the game goes on which is nice. Both keyboard and gamepad controls are great and not too complicated though for a puzzle platformer that's not too surprising. You will probably die a few times however, and usually it's your own fault which is good.   Verdict  I think this is an absolutely stellar game and in my opinion it's better than Limbo, now for $20 you're probably gonna complete this game in around 3-4 hours which is a little short but thankfully there's some collectibles if you missed them. Sadly that's about it when it comes to replayabilty and if that's not enough you might wanna wait for a price drop. That said if you can get past that then this is easily worth the $20 just for the experience alone and this is definitely a contender for one of my favorite games this year. So what are you waiting for, Stop playing outside and go play INSIDE.",
            "review_score": "1"
        },
        {
            "review_text": "Inside is better Limbo in everyway, Inside Amazing.",
            "review_score": "1"
        },
        {
            "review_text": "2-3 hours of gameplay. Creepy, fun, interesting, suspenseful. Didn't disappoint.  No real ending from what i could discern, unless alternate endings are available, but decent.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun game with some terrific atmosphere and challenging puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "I will edit this review one day when I have time to write out exactly how much this game bummed me out. I seem to be the only one who was completely dissapointed by it though so spending an hour on a rant seems a little silly. It's a shame, I really liked LIMBO.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros - Neat Puzzles - Great Atmosphere - Kooky Story  - Original  Cons - Shortest Game Ive Ever Played - Dumb Ending - Overpriced - Weird Glitch Where I Cant Use The Steam Overlay While Playing  I Really Dont Know Why This Got So Much Praise Its So Short And Doesnt Even Have A Satisfying Ending I Hope I Can Get A Refund Get This One On Sale Or Not At All",
            "review_score": "-1"
        },
        {
            "review_text": "After my my first rage implied review bacause of the feeling I wasted a not quite small amount of money for this game I'm now going give this a second fair review after looking through calm eyes and watching a Let's Play of it until the part to where I have played to myself. Unfortunately that just opened my eyes to even more bad things and I still didn't find anything good.   Most of the time in this game I was totally bored. The puzzle parts that don't directly kill you every time you make something wrong are too easy, there is no real mind challenge. The calmness and the abscence of actual music (only like sounscapes) is causing me like a soporific feeling in these none action areas. The only game that made me more sleepy was Coma: Mortuary, but luckily that came with a price that would be a fair one for Inside too. The only moments that pulled me out of that boredom, unfortunately just with annoyance, were the situations were the game chased me into certain death to tell me that I should have doing something different here just that it is already to late now to change anything about that. Something like that is just a clear indictment for bad gamedesign, as in a platformer you should have at least the theoretical chance to react in time so that can be called 'difficulty level'. And that brings me to my next point, the dying or rather killing animations. They are too realistic, too brutal, too detailed and too lenghty for a platformer, I simply don't want to have to see that again an again. From normally in platformer games I would expect to be able to step back into gamplay asap after a really brief animation and not having to ♥♥♥♥ myself up about having to see that gruesome ♥♥♥♥ again. But no, Playdead has to torture their customers.  Sidenote: These last two were the the only critic points in my first review, even though not so thoroughly formulated.  Everybody talks about impressive graphics and a great story, well the monotonous graphics (yet compared to Limbo or Monochroma) did just add for me to the soporific feeling and I don't see a story at all in this game. Yes  it somewhat reflects our real world/the system we live in/a likely future  , but I don't need a game for telling me about these problems and I certainly don't find that creative.  I got it for 13,49€ and I regretted to have paid that much money in a way I never did before if it comes to video games. And I even regret even more having made the decision (thinking about it for eleven days), after playing it for 1.6 hours and absolutely not liking it, to give Inside another chance instead of asking for a refund because so many people claim to so absolutely love everthing about this game. My impression of it is just like, 'Lets take everything that was bad about Limbo and multiply it for our new game'.",
            "review_score": "-1"
        },
        {
            "review_text": "It's Limbo 2.0, basically. More polished, shinier, darker, yet samey and more pretentious than a french art movie. As far as I can tell, it's a story about classism this time, and not about dead boys in purgatory. The style is neat, but the puzzles are barely an obstacle, in this neverending journey to the right, which takes about 3-4 hours to complete. It didn't feel rewarding to complete, and the 'intentionally obscure' angle felt like a cop out in order to make a dark game without explaining anything. Buy it on sale or something.",
            "review_score": "-1"
        },
        {
            "review_text": "Enjoyed every single moment of it. Wish I could play it blind again.",
            "review_score": "1"
        },
        {
            "review_text": "The perfect game.",
            "review_score": "1"
        },
        {
            "review_text": "The last chapter is worth your money alone.",
            "review_score": "1"
        },
        {
            "review_text": "Read nothing. Learn nothing. Buy this game, play it. It is nearly perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Post Hillary Clinton simulator 2016  10/10  Would control mindless albinos and pull worms out of pig asses again",
            "review_score": "1"
        },
        {
            "review_text": "realised this is a game that is in fact about sneaking onto the universal studios backlot.  10/10 Would sneak into universal studios again.",
            "review_score": "1"
        },
        {
            "review_text": "Game plays great and is one of the most beautiful games I have ever seen, but there is no story to this game what so ever ;-; and the ending just feels anticlamatic. But the variation of death animations is a huge *thumbs up* :D",
            "review_score": "1"
        },
        {
            "review_text": "Good atmospheric platformer but the super short gameplay and vague story is not worth the money at all.",
            "review_score": "-1"
        },
        {
            "review_text": "10\\10 would become meat sack again",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "I've just finished the game and boy am I disappointed. I've paid 22$ for this game, and I've finished it in 4 hours. The gameplay is good and the atmosphere is amazing, but I've got one problem with it.The puzzles are fun (not all of them to be honest, some are tedious just because of the character's walking speed) and the environment is breathtaking. It's a well designed game. Throughout the game, not much is explained and the story is left to your imagination.    My problem with it is the ending. I expected some kind of revelation, or some kind of moment of clarity, but my questions about the story are still unanswered. There's something about becoming a big ball of humans that really got on my nerves. I don't know anything about his past, or why exactly he was in that situation. Why were the people in the 'à la Fallout' underground vault experimenting with human genetics or whatever it was they were experimenting with? Were they humans? Why was there upside-down water? When exactly does this take place? Yes it had good gamefeel, good atmosphere, good everything, really, but I still feel disappointed with this. There's something missing, I feel.   Who knows, there might be DLC or something soon. It's a good game, yes, but I don't think it was worth 22$. I was expecting a bigger game for that kind of money, but whatever. Maybe that's just my inside jew kicking in.",
            "review_score": "1"
        },
        {
            "review_text": "Short, moody and wonderful.   This is one of those games, that asks of you to soak in the atmosphere and follow along. Gameplaywise it is fairly simple, with just a few puzzles leaving me scratching my head, before figuring them out fairly fast.   It doesn't work all the way, with a few sections overstaying their welcome, and the ending is... well.. lets just say, you might feel a bit suprised when the credits starts rolling.  But its still a wonderful ride, and I recommend you try it.",
            "review_score": "1"
        },
        {
            "review_text": "This was a great game! A cool art style, creepy setting, beautiful (and eerie) 3D environments, and surprisingly satisfying and intuitive interactions between your character and the environments.   10/10, in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "  This game is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Creepy, Intriguing, and overall Beautiful. Inside is a great successor to Limbo. Loved it. I wanted it to be longer but when a game is good it's rarely long enough. Very worth the $20.",
            "review_score": "1"
        },
        {
            "review_text": "Im unsure what I just played, but I loved every second of it.   The game is failry short, but that is not necessarily a bad thing. It flows very nicely, there is no boring second, and it is the perfect length to play through in one sitting, which you should.  Artistically and technologically the game is extremely impressive. The way the animations are done, especially at the end, is just amazing. The quality here is higher than that of a lot of AAA-games. I don't think all the animations are pre done, it looks like procedural generation in the end, which is super impressive.",
            "review_score": "1"
        },
        {
            "review_text": "Huge limb ball trying to escape a brainwashed facility. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "costs too much, everything is else about this game is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "The game is a masterpiece, it's dark, it's beautiful and also it is fun to play :-)",
            "review_score": "1"
        },
        {
            "review_text": "my brain hurts...",
            "review_score": "1"
        },
        {
            "review_text": "  Mind blowing!!!",
            "review_score": "1"
        },
        {
            "review_text": "Sick Game after Portal Series. Must Play Game",
            "review_score": "1"
        },
        {
            "review_text": "this is the best indie game ever",
            "review_score": "1"
        },
        {
            "review_text": "5/5",
            "review_score": "1"
        },
        {
            "review_text": "What an incredible experience. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Tough but fun",
            "review_score": "1"
        },
        {
            "review_text": "great game, indie game of the year and as good as limbo",
            "review_score": "1"
        },
        {
            "review_text": "Amazing atmosphere and experience. Puzzles are logical and not frustrating - i.e. they make sense. Visually stunning game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10, at the top 5 games 2016 list",
            "review_score": "1"
        },
        {
            "review_text": "Inside is for fans of having no idea what's going on, discovering the game's intent on the internet, then maybe replaying it and going 'oh yeah I can kinda see that'.   Puzzles were nads as well, unless you like trial and error.",
            "review_score": "-1"
        },
        {
            "review_text": "Same dudes from Limbo? 5 stars before installing.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible",
            "review_score": "1"
        },
        {
            "review_text": "This is a very good game.",
            "review_score": "1"
        },
        {
            "review_text": "Have you played Limbo? If not, shame on you, go buy it now and play it. Come back thinking, how can it can any better than that? Play Inside :)  Seriously, this game is spectacular. The atmosphere, sound design, soundtrack, attention to detail. Everything is just on point. I can't wait to see what the rest of the game has in store for me. It's creepy as hell and I love it. Can see myself playing this multiple times.  I see most people complain that it's too short for the price. For the effort that went into this game from what I call tell, it's worth the money and the developers deserve it.  EDIT: I finished it and, wow, that's all I can say. Wow.",
            "review_score": "1"
        },
        {
            "review_text": "'Transformation is a process, and as life happens there are tons of ups and downs. It's a journey of discovery - there are moments on mountaintops and moments in deep valleys of despair.'",
            "review_score": "1"
        },
        {
            "review_text": "Much like LIMBO, the opening is what people point to, but as soon as you reach the city section of the game INSIDE takes a nosedive devolves into Portal 2 with little context or reason.   The game's 'arc' goes like this:   opening = fantastic middle = tedious end = unsatisfying  After watching the trailer I was really hyped for Playdead's This War of Mine, which is what the opening is, but then the game starts spinning you around in circles until you reach the end and nothing makes sense. But it's deep because it's open ended. Jog on.  At first I was angry, but then I remembered Playdead has difficulty spreading quality throughout their previous entry. So now I'm just dissapointed that they didn't amend that.  Overall rating:   opening: 5/5 middle: 2/5 end:2/5",
            "review_score": "-1"
        },
        {
            "review_text": "I get the appeal and understand why this game is so unique. Its getting rave reviews everywhere and definitely will go down as a very memorable game. So lets talk pros and cons:  PROS:  1) Great art style and unique animation/graphics 2) Eerie and mind twisting plot/atmosphere 3)... thats it  CONS: 1) The puzzles get old really quick, Most of these puzzles seem so thought out to be randomly laid out in terms of their solution. Eventually, the puzzles get old and I just want to move forward with the story, 2) The story is too open to interpretation and the whole way you are wondering who the boy is, who the bad guys are, why are they hunting you, at some point I just got tired of wondering why things are they way they are and getting NO explanation. Onve you finish it, you're gonna Google the ending explanations and digest whats there. Not gonna spoil it, but it still left me disapoointed.... 3) There is absolutely no closure on the story in any way. And I mean NONE. I know they devs intended this but it just didnt set well with me. And this is coming from someone who WORSHIPPED Journey, which I think has the same thought provoking moments that this game strives to have.  All in all, its a decent game, but no where near the perfection Im reading from all these reviews. It might sit well with you and knowing the type of games I like, I thought it was right up my alley too. But the more I played it, the more I just wanted it to end...  So I'll be the contrarian and say this game is unique and has its moments, but overall isnt a gem.",
            "review_score": "-1"
        },
        {
            "review_text": " Impressive but very very short",
            "review_score": "-1"
        },
        {
            "review_text": "holy sh*t",
            "review_score": "1"
        },
        {
            "review_text": "👌👀👌👀👌👀👌👀👌👀 good ♥♥♥♥ go౦ԁ ♥♥♥♥👌 thats ✔ some good👌👌♥♥♥♥ right👌👌there👌👌👌 right✔there ✔✔if i do ƽaү so my self 💯 i say so 💯 thats what im talking about right there right there (chorus: ʳᶦᵍʰᵗ ᵗʰᵉʳᵉ) mMMMMᎷМ💯 👌👌 👌НO0ОଠOOOOOОଠଠOoooᵒᵒᵒᵒᵒᵒᵒᵒᵒ👌 👌👌 👌 💯 👌 👀 👀 👀 👌👌Good ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "It's good.",
            "review_score": "1"
        },
        {
            "review_text": "Well... This is one of the best games from 2016, until now. I know you cant please everybody... But it is strange see some people writing extensive negative analysis about Inside. Their lifes must be so awesome that this experience shouldnt affect them. Therefore, they shouldn't have time to talk about the things they 'think' that is bad for this game so why bother? I am confused. Must be a boring existence.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing amazing. Cant wait for the next. this was absolutely insanely crazy good. scary, inspiring, weird, unexplainable, adrenalinfueling, gorgeous fun. ",
            "review_score": "1"
        },
        {
            "review_text": "Great game but a little to easy and short. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Shallow, a nice presentation, classical 2D puzzle gameplay but very little substance. Limbo was much more poetic and enigmatic, Inside is a progression on tech and a set back in feelings.",
            "review_score": "-1"
        },
        {
            "review_text": "Alright. Did I enjoy this game? Yes. I enjoyed playing it very much. It was beautiful and suspensful without being outright scary, but it didn't deliever.  And when I say it didn't deliever, I mean I didn't even know when the game was over. There was no indication (aside from the fact that I couldn't move anymore) that I'd reached the end. I only kept playing it because I was expecting something to tie everything together, but it never happened. I was wondering about the world while I played, but nothing was ever answered-- and not in the 'oh, how cool and interpretive!' sort of way, more in the 'the ♥♥♥♥' sort of way. I think the reason everyone is raving about it so much is because of the way it can be interpreted (I had to read three articles to glean a semblance of what was going on, and even then most of it hinged on the secret ending). 'So deep,' the reveiwers said, 'we're the monster all along!!!' &lt;&lt; Kidding.   The plot (???) aside, the game was beautiful. I saw people appluading the games soundtrack, which I'm going to argue with; it was very minimal. Was the sound design absolute excellent? Yes. The soundtrack? I can't remember a single memorable tune-- did the game have any music?   Some of the puzzles stumped me, but I enjoyed solving them.   Aboslutely NOT worth $20. Absolutely OVERHYPED. Absolutely UNDERDEVELOPED. Unsatisfying.   If you're looking for a seriously suspensful experience with fantastic atmosphere and a VERY open-ended narrative, this is for you.  When it's on sale, anyway.   I wish I could return it.   And I know people might think I didn't 'get' the ending, but I'm not dumb. I understood the ending, but I feel like it killed the narrative cold.    ",
            "review_score": "-1"
        },
        {
            "review_text": "Trailer made it look like a stealth platformer, rather than a puzzle platformer. While it looks good, gameplay, replay value, plot, and difficulty do not justify the price tag. The ending didn't help much, either.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a very terrifying experience.",
            "review_score": "1"
        },
        {
            "review_text": "While it looks amazing and is plenty of fun, I cannot recommend it at full price. Wait until it goes on sale for less than $10.",
            "review_score": "-1"
        },
        {
            "review_text": "the puzzles where too easy and felt like the only challenge was holding down D do not buy unless on sale for 5$.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Excellent aesthetic and atmospheric feel with a great deal of polish...  ...but all in all, not an exceedingly satisfying game to play.",
            "review_score": "-1"
        },
        {
            "review_text": "+ core gameplay (controls, puzzles) + arts (visual and sound)  - virtually no story - no logical connection between events (things happen seemingly without any cause or reason) - short (4hrs)",
            "review_score": "-1"
        },
        {
            "review_text": "Not really worth the price even if its on sale. If you like walking left and right with minimal amount of puzzles this game might be for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Too pretentions for its own good. I had to push myself in order to finish it without falling asleep.  That ending doesn't make any sense. Looks like i fell for the ''Inside is a good game'' meme. Limbo was good game, this is not!",
            "review_score": "-1"
        },
        {
            "review_text": "20 bucks is a bit steep for a slightly better limbo",
            "review_score": "-1"
        },
        {
            "review_text": "Some unique ideas for the puzzles, great visuals and sounds, a creepy atmosphere with some truly disturbing scenarios, kind of an 'adult' version of LIMBO. However, it's really short - 4 hours with a bit of trial and error to make it last longer - and imho, not enough challenge. I did kinda like that it left a lot untold, but at times it felt like they had just thrown random, ill-fitting ideas together. After LIMBO I expected more. Nice game, but I'd say wait for the price to go *a lot* lower.",
            "review_score": "-1"
        },
        {
            "review_text": "The games puzzels are really simple. I often felt like I was speed running the game because I never had to stop and think. The story isn't really explained. I was hoping by the end that the reason why so many were enslaved would be clear, but it never was. The ending is just frustrating. This doesn't even come close to how great Limbo was in my opinion. I cleared the game in 2.5 hours.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting setting but boring as hell. Most of the time you just run right, jump sometimes and need some timing. But tahts not enough for a nice game.",
            "review_score": "-1"
        },
        {
            "review_text": "game might be fantastic for the first 10 mins, but gets old really fast, Also, some of the puzzle really breaks the immersion level, for e.g. the part where you had to jump back and forth two side of a fence, getting chased by dog while you are trying to break a fence. It make no sense to have player repeat that action 3 times.  if Inside cost 5 to 10 dollar, I would still recommend it, but not at it's current price.",
            "review_score": "-1"
        },
        {
            "review_text": "Crap ending, nothing is explained at all, looks nice, Wait for sale",
            "review_score": "-1"
        },
        {
            "review_text": "What.",
            "review_score": "1"
        },
        {
            "review_text": "  Even though I recieved this for free, I will not be soft on it. This game is no where near being worth the $19.99 price point. It takes about 6 hours to 100% this game. I think I have said enough.",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth 20 euro's imo. The game is fun, but the puzzles are too easy and too few. The atmosphere is too empty. I miss some good music in this game. Get it on sale, don't pay the full price for this running to the right simulator.",
            "review_score": "-1"
        },
        {
            "review_text": "?",
            "review_score": "-1"
        },
        {
            "review_text": "This game, is like a picture.   It's worth a thousand words.  Depending on how fast you get by, it can be a short experience.  One you can keep to look at later.   It's a very beautiful experience, with a beautiful sense of Atmosphere and Animation,   It's rather interesting!  But it's missing something.   It's missing something that would make it worth 19.99 for everybody.  And that is length, replayability!   There just isn't enough.  If it were long enough, It'd be worth 29.99!    Alas, it's not.  Sorry.   I'll see about changing my recommendation once the price drops!",
            "review_score": "-1"
        },
        {
            "review_text": "A game about killing kids? No thanks. I'll stick with Rocket League.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so beautiful that I immediately played all the way through it again just to slow down and look at everything. Seriously, this game is worth every penny. The artwork is haunting and beautiful, the story clever, and it puts me in a zombie trance when I play it.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the best games I played in the recent years.  Everything is so beautiful and so intelligent... I'm glad some developers still try to amaze us.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible game, very fascinating and obsolete story. No issues as far as anything. 11/10 you will question everything.",
            "review_score": "1"
        },
        {
            "review_text": "Limbo was one of my favorite games ever. Had high hopes for this and it easily exceeded it.",
            "review_score": "1"
        },
        {
            "review_text": "The basic ending gave me nightmares! A definate game changer, if you have the money I would recomend it. However this game is about a one or two time play not really a game you play everyday. For 20 dollars I would suggest you save up and get something that you could play more often. But if money isn't a problem you should 100% try this game out.",
            "review_score": "1"
        },
        {
            "review_text": "Wow! Long forgotten LIMBO-feeling returns! But better style and much more immersive sound. If you liked LIMBO, you will like this one.",
            "review_score": "1"
        },
        {
            "review_text": "short but very high quality, if you liked their other game you will love this!",
            "review_score": "1"
        },
        {
            "review_text": "I LIKE THIS GAME SOOOO MUCH!!! IT IS EVEN BETTER THAN LIMBO! The atmosphere is built with mystery and loneliness. Everyone around was designed to be your enemy. You are going to be the only brightness in this game (as other things and people are in black and white but your character is in red). The story is fully designed and it is very interesting and it also gives you the opportunity to think about the ending... The thing is this game is easier than LIMBO...at least dat's what I think Oh I got it when it was on sale for halloween and it was so cheap! A GOOD GAME AND...PLAYDEAD...GOOD JOB",
            "review_score": "1"
        },
        {
            "review_text": "Up until now, Limbo has been my favourite game. This changes that. Every single element I loved about Limbo is better in this. The story, though it's barely tangible as with Limbo, is considerably quicker developing. The game play is very similar. You solve puzzles to go right. Here, the Puzzles are often on a much larger scale than Limbo.  If anything, I found that this game was easier than Limbo. I think this could just be because I had already played Limbo. Though I think that the puzzles were as difficult, I don't feel as if I died as much. This is largely down to the game rather than my skill. Rather than dying every time you get something wrong, the puzzles here are much more complex.  I absolutely loved this game. It was everything I wanted it to be!",
            "review_score": "1"
        },
        {
            "review_text": "Short version: INSIDE is like LIMBO, but a bit more complex.  Long version: Inside is a clever short puzzle platformer about a boy in a city and places where science happens.  In all honest: I haven't got the faintest clue what the heck the story was supposed to be about, so I feel I can't give the game a score in the story category, but all other aspects were damn near spot on.  The visuals, while fairly flat and simplistic, are well stylized and serve their purpose well. The 2D/3D gameplay does cause the occasional issue where I failed to judge jumps properly, but this is a very short-term nuisance, since death is not really penalized in this game.   Sound-wise the game is, again, simple but effective. There is no dialogue, the music is minimalist, ambient sounds are very much the same, but in all that simplicity I felt that the sound did it's job very well.  The puzzles, which are the main meat of INSIDE, do pretty much everything they can to get the most out of the simplistic 'stick and two buttons' control scheme. You jump, push, pull, run swim and jump your way through a myriad interesting locations as the game's curious, if somewhat unfathomable, story unravels on the background.  All in all, I felt INDISE was a pleasant experience and I recommend it.   Playtime: 4+ hours (Single playthrough)  Ratings (1-10) Visual: 9 Audio: 8 Story: N/A Gameplay: 9 Overall: 9",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games to come out this year, If you're into what basically is limbo 2.0. But I was very much ready for something along those lines and it it delivered! To say much about it would work toward ruining its charm, so all I can say is that if you like two dimensional platforming in a beautifully rendered three dimensional world, with an enveloping story told through pure wordless world building, buy this game. It’s worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "While short, as I completed the game in a 6 hour playthrough, this game is truly an experience. The visual story telling is extremely well done. The graphics, while simple, are amazing. The controls feel so fluid to the point you absolutely forget you're playing a game. The only drawback is its short, but is still extremely worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a settle but deep story, a chilling soundtrack, and eerie visuals. It's a game worth checking it out, but you might feel a little gloomy when you're finished with it.",
            "review_score": "1"
        },
        {
            "review_text": "I quickly grew attached to this little guy... Well play it and see",
            "review_score": "1"
        },
        {
            "review_text": "Just play it.",
            "review_score": "1"
        },
        {
            "review_text": "INSIDE is a queer, immersive, and beatiful game. It puts you in control of a young boy on the run, evading guards and getting around obstacles - but why? The game doesn't tell you anything about its grim world in text or dialogue, and it's up to the player to make their own interpretation based on what they see. Along the boy's journey you pass through various areas of this strange world - all of them gorgeous. The game is full of suprises up until the very end, and you never feel like it overstays its welcome.  The gameplay itself may not be terribly challenging or, on a base level, new. You run to the right, hide from guards, and solve some puzzles that shouldn't take more than about a minute to figure out. Yet it still sets itself apart with how well done these simple mechanics are done. The animations of the main character feel very organic, and the way the game is set up you never feel like you're doing something you've already done before, nor do the puzzles ever feel out of place.   The game takes around 3-4 hours to complete on your first run through, and aside from some hidden secrets there's no major incentive to replay it. However, the brief time it takes to play it is something you'd be hard pressed to find in any other games out there. If you're looking for a challenging platformer, this isn't the game you want. If you on the other hand want to immerse yourself in a unique experience, I couldn't recommend it enough.",
            "review_score": "1"
        },
        {
            "review_text": "Beautifully eerie and perfectly paced.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome gameplay, awesome graphics and f*cking awesome atmosphere. MASTERPIECE!!!",
            "review_score": "1"
        },
        {
            "review_text": "What is love? Baby, don't hurt me Don't hurt me no more",
            "review_score": "1"
        },
        {
            "review_text": "There's been several theories about what this game (and it's particularly intriguing ending) mean. One of the few games where you're constantly thinking about what's going on, working it all out as you encounter puzzles and characters.  WHAT DOES IT ALL MEAN?!  Also now I'm scared of pigs.",
            "review_score": "1"
        },
        {
            "review_text": "By the time I reached the climax (phrasing), I was left speechless.",
            "review_score": "1"
        },
        {
            "review_text": "Beautifufly simplistic gameplay mix with a dark and mysterious world to create one of the best games of 2016",
            "review_score": "1"
        },
        {
            "review_text": "Inside is brilliant and a worthy sucessor to LIMBO. Every element of it has been polished to perfection, and it is truly a delight to be surprised in such a way.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked LIMBO, you'll like INSIDE. There's also a plot this time.",
            "review_score": "1"
        },
        {
            "review_text": "What the hell did I just play. Play it if you liked LIMBO, INSIDE is like its older brother.",
            "review_score": "1"
        },
        {
            "review_text": "If you don't like atmospheric games, you'll think it's boring. But if you do, you'll get a nice cinematic platformer with light puzzles that don't take too long to solve. You won't get any story fed to you, it's all in the environment.",
            "review_score": "1"
        },
        {
            "review_text": "This game is sooooo good. Don´t go along rants... it´s really worth all the money just for seeing it.  Beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "The one and only game where one win equals to two losses.  I rate 120/100",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic follow up to limbo, great one off exprience.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible.  The atmosphere, and storytelling blew me away.  I loved everything about it and after I beat it I just started from the beginning and played all the way through it again.",
            "review_score": "1"
        },
        {
            "review_text": "Unlike Limbo, this game is interesting and the puzzles are fun. It's pretty short so I'd wait until it's on sale, but I will probably play through it once or twice more. The ending is really cool.",
            "review_score": "1"
        },
        {
            "review_text": "This game is wonderfully strange.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "So I played as a kid who dies alot....fun stuff.",
            "review_score": "1"
        },
        {
            "review_text": "While there weren't many difficult puzzles, I thoroughly enjoyed this game almost purely because of its art direction. The designers behind this game clearly knew what they were doing with their art and sound design, and the work they put into the game is clear. I'm not sure I can say I've played anything like it. Ultimately one of the most memorable games I've played this year.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 - Would be confused by the ending again.",
            "review_score": "1"
        },
        {
            "review_text": "Come for the puzzles and creepy atmosphere. Stay because you can't turn your computer off once this game has melted your mind.",
            "review_score": "1"
        },
        {
            "review_text": "Another puzzle gem from PlayDead. Atmosphere really goes along way in this game. Very impressed with final product. Purchase with confidence!",
            "review_score": "1"
        },
        {
            "review_text": "This was stunningly beautiful. I never played Limbo but I can get a sort of Limbo vibe.  What I thought was interesting was that after the intro screen is shown, you just begin playing. No instructions, no goal, nothing. Just moving right and trying not to die.  I would definitely play this again, maybe for the achievements. But again, this is very beautiful.  Highly recommend to people who like platformer (not necessarily a platformer, but eh), dark games. Idk if this would be considered a storyline based game, because there are two endings, and the story isn't revealed much anyway.  But still get if you're into dark, atmospheric games. 20 dollars isn't that bad.",
            "review_score": "1"
        },
        {
            "review_text": "Breathtaking!",
            "review_score": "1"
        },
        {
            "review_text": "  :)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've played in a while. 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "A great but simple game, great puzzles. Much wow, would buy again",
            "review_score": "1"
        },
        {
            "review_text": "Saw some talk about this game on  neogaf.com . Didn't read much into it. Decided to pick it up as I loved Limbo. Pretty amazing game. Has a great atmosphere, art style, and sound design. Very interesting twists. Fairly short game but I recommend the experience. Go in blind, try and play it in one or two sessions, enjoy the ride.",
            "review_score": "1"
        },
        {
            "review_text": "Solid game, great aesthetic",
            "review_score": "1"
        },
        {
            "review_text": "10/10 gameplay, although too short leaves you wanting more.",
            "review_score": "1"
        },
        {
            "review_text": "Ever finished a game and thought to yourself what the actual ♥♥♥♥ just happened, but still liked that feeling. Then this is the game for you I've had acid trips less freaky than this",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. Just as good, if not better than Limbo. The atmosphere is perfect and adrenaline rushes are everywhere.",
            "review_score": "1"
        },
        {
            "review_text": "Puzzles are pretty varied, art style is so good. The gonad is my favorite part. I'd say more but you already looked at the trailer. You liked it, didn't you? Buy it; I'd like the creators to have more money to make more great games like this.   Downside: done in 5 hours. I wish there was more of it.",
            "review_score": "1"
        },
        {
            "review_text": "A frequently stunning showcase for Playdead's twisted imaginations - by turns upsetting, funny, and surreal. The platforming is slightly tightened up from Limbo, although it's never that taxing - and I would've liked to have seen more imagination in the physics-based puzzling - but the late-game payoff (impossible to describe without spoilers) renders any complaints about the preceding few hours pretty much moot.",
            "review_score": "1"
        },
        {
            "review_text": "+++ dark theme &amp; mood +++ visuals +++ sound design +++ detailed, perfectly handcrafted levels ++ simplicity and minimalism  -- easy - short - price (for some, personally I don't mind)  9.5/10 must-play masterpiece =;]",
            "review_score": "1"
        },
        {
            "review_text": "If you start playing this, you might not be able to control yourself until you've finished it.",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous game! Playdead does atmosphere better than any other gaming company out there. The gameplay was interesting and kept you immersed in the world until the end. Not a long game, but totally worth it, I've replayed LIMBO many times and I expect the same for this!",
            "review_score": "1"
        },
        {
            "review_text": "Was pretty amazing.. story alright and the way it's made, but it just kept crashing for me :|  besides that, was alright",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly good game, although a little short. Nice story and great puzzles",
            "review_score": "1"
        },
        {
            "review_text": "It's impossible to not care about this strong willed little boy who's all alone in thi dark world filled with mysteries. That's what will keep you playing the game too the mysteries. The puzzles are fun and nice and the physics in this game are great. I love this experience &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Its like a short film that sweeps the sundance, bloody awsome",
            "review_score": "1"
        },
        {
            "review_text": "If you liked LIMBO, youll LOVE this game. In fact, i would dare to say its even better than LIMBO, which i never thought could be possible. Ive been waiting for this game ever since i beat limbo when it first came out. It surpassed all of my expectations. Do yourself a favor and buy this game",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful game. The animation is on point, the story is the right kind of ambiguous, and the gameplay is simple enough to leave you questioning your own reasoning abilities. Satisfying puzzles, an enveloping world, and it begs for a second playthrough as soon as you finish.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome and disturbing.....how can a side scrolly game hold so much atmosphere excellent animation lighting and sound kept me hooked start to finish, i find that a very rare quality in a game these days ( probably my age ;) ) but the story....left me feeling a strange, well you`ll find out if you take the plunge well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Crap ending. Felt like it was a cop out like they couldn't think of anything better. But the gameplay itself was interesting enough to say I don't regret buying it",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, stunning graphics, finally someone is thinking outside the box..I will buy every game made by Playdead. Please make more!",
            "review_score": "1"
        },
        {
            "review_text": "Better than Limbo, so much puzzle, action and unexpected scenes ! Get your self a drink, put your headphones on and enjoy playing this incredible game :D",
            "review_score": "1"
        },
        {
            "review_text": "Realy realy good! keep it up guys!!",
            "review_score": "1"
        },
        {
            "review_text": "First of all, this was a truly successor of the indie game 'limbo'. The game has beautiful landscape/background, and the ambience on the shockwave part was pretty cool. When I got to the end, the game turned from bad to worse in a good way. The ending made me have lots of questions about its main plot. The story doesn't tell you that much, but it's up to you to make theories. Highly recommend it, support the developers, and I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome atmosphere, setting, graphics, gameplay, characters. Some of the puzzles are a bit contrived and I would argue unnecessary (game would have been improved if it focused on the story and setting and not so much on the puzzles where they detract from the former).",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. I hate the story of this game. Everything else is literally Awesome.",
            "review_score": "1"
        },
        {
            "review_text": "This has to be one of the best releases of the year in my opinion. They did an amazing job with the atmosphere and the feeling of fear and dread. A+, 10/10, have and will play again and again!",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game !! End of the game was a bit weird, but it suprised me.",
            "review_score": "1"
        },
        {
            "review_text": "Truly a piece of art. This is one of the most captivating experiences I've had in any form of media.  Everything from design, to the natural animation, the lighting...it just all comes together seamlessly. Beautiful and sublime.",
            "review_score": "1"
        },
        {
            "review_text": "This unbelievably beautiful game is a piece of pure genius.  Incredibly simple to play and rewarding every step you take.   It's like the Iron Giant and Stranger Things mixed together with no dialogue - with a scintilating soundtrack that compliments moments of game play just like a movie.   This is a must buy - within the first 2 minutes you will not be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful audiovisual experience and sequences, definitely on par with an cannes-esque film  10/10 will become meatball again, MAKE US WHOLE",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! I completed the game in just about 3 hours.  But those 3 hours were filled with pure joy and exitement.  Starting from the the first to the last second this game has stunning visuals, smooth contols and most importantly for me: an absolutely gripping atmosphere.  Yes, it's 'only' a puzzle-plattformer but it could also be an animated short movie. A real masterpiece! The ending is awe-inspiring!  I love this game!     ",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful journey and experience of gaming ! I loved it so much ! We need to see more game like this one that can push gaming to another level ! MUST HAVE, MUST PLAY !",
            "review_score": "1"
        },
        {
            "review_text": "Talk about a mind♥♥♥♥. Who controls who?",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible. It was absolutely worth the money and my time. I just played through it all, and it was such an amazing adventure. It was programmed very well. The game looks fantastic and it never once dropped below 144 FPS. The movement and animation is also so very fluid. I couldn't get enough of the atmosphere in this game. It was so fascinating. I only wish that it was a bit longer. I can't wait to play through this again though. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "With great visuals and heart-pounding moments as well as well paced puzzles, Inside is a capturing game that will make you think about nothing else. The journey is one of the best, if not the best, I undertook in a video game. The end sadly is a big let down.",
            "review_score": "1"
        },
        {
            "review_text": "Inside is the follow-up to Limbo, coming from the same company. 2.5D Platformer with heavy puzzle elements.  It's a really great game with a beautiful art style and feel to it. It's just a tad short, and exactly like Limbo, makes little to no sense in the long run. All in all, I think I'd say to wait for a sale, or if you just REALLY have nothing else to spend your $20 on, go ahead and pick this up.",
            "review_score": "1"
        },
        {
            "review_text": "I loved Limbo so I had to buy INSIDE as well. 10/10 worth every moneys, could have been longer though.  My wallet is ready for their next game!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, will defenitely recomend to all of my friends. Takes about 3 hours to complete if you're not going for achievements.",
            "review_score": "1"
        },
        {
            "review_text": "Good scenes, ilumination. Pretty attractive graphics. Amazing &amp; astonishing story/plot. Both curious and strange game which every videogame buff is sure to love",
            "review_score": "1"
        },
        {
            "review_text": "Believe The Hype. This game was great. Great new art style, great platforming elements, great puzzle elements and a great story to top it off. Its one of those 'I dont really know the whole story in the game i just played but it was incredible.' things. Also dont get discouraged by the length of the game some of the best games ever werent very long. Definately recommended if i HAD to give a score sigh i would give it 9.2-9.3/10",
            "review_score": "1"
        },
        {
            "review_text": "Masterpiece, its worth every minute",
            "review_score": "1"
        },
        {
            "review_text": "don't watch any reviews, don't let anyone spoil anything for you, just buy it. If you liked Limbo you will love this even more. Stunningly perferct.",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually pretty fun, too bad it lasts short if you play seriously. I didn't quite get the story but I would play again 10/10. BIG BOB WOULD PLAY AGAIN",
            "review_score": "1"
        },
        {
            "review_text": "very very short but nice , better to buy on sale",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! Doesn't take long to beat, just about 3-4 hours, but i still like supporting this small game studio that produces great stuff!  If you enjoyed 'LIMBO' then you will also enjoy 'INSIDE'. If you have the cash, try the game out, or wait for a sale, either way you will enjoy it!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game and immersive world  ",
            "review_score": "1"
        },
        {
            "review_text": "Atmospheric and engaging, inside tells a story without words and is full of creative and challenging puzzles. I loved limbo but I thought inside was even better 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Background is beautiful... Because I am only able to see this game as a background process!",
            "review_score": "1"
        },
        {
            "review_text": "Legitimately not a single thing I didn't like about this game! It's immersive, fun, very well structured (and paced), smooth, interesting - GAAAHH SO GOOD!!! I can't credit the Playdead team enogh. I'm not very good when it comes to reviews, so heres a list of things I enjoyed about the game. -The animations -The sound design -The overall visuals -Ambiance (very well done) -Atmosphere -Story  -Game mechanics -The puzzles -The lighting   ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,, =+ SPOILER ALERT +=  -The section with the body amalgamation monster thing- the controlls were very nice ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,   -The platforming (felt very nice to move and jump around)  Totally worth every penny, support these amazing people, I could not recomend this game more!  10/10 (honestly)",
            "review_score": "1"
        },
        {
            "review_text": "Its exactly what you expect from LIMBO devepolers. Amazing.",
            "review_score": "1"
        },
        {
            "review_text": "This game does not need a big long review from me...it's...interesting. It is definitely a unique experience and I would recomend it to anyone that is interested. But. If you are looking for an obvious story, then you're in the wrong place. The game is set out in a way that allows you to make sense of your surroundings your own way. It does not offer any explanation and will leave you going:  What the actual ♥♥♥♥? Why? Oh ok that makes perfect sense. and: OMG WTF WHY IS THERE A DEMONIC MERMAID WITH LONG HAIR THAT IS TRYING TO KILL ME, IN THE WATER WITH ME??!!  All in all I really will sincerely reccomend this game, just know it is a TAD weird 100% of the time...",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply the best.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! The graphics are extremely compelling, and it gets extremely chilling to the bone when you encounter many entities. I recently finished the game and unlocked all of the achievements, and found out so many theories about the ending and the alternative one. Overall, a great game and should definitely be payed for!",
            "review_score": "1"
        },
        {
            "review_text": "So attractively sinister!",
            "review_score": "1"
        },
        {
            "review_text": "Very dark and very atmosferic game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a simple, intuitive puzzle game at face value. But what Playdead have done here is simply astonishing. Every element, from the gameplay, to the level design, to the character design, to the soundtrack has been so beautifully crafted that it reaches far beyond that description. Not all games are art, but this one certainly is.  It's not fair to compare it with the more complex, flexible and far reaching games out there. But for me it feels like an instant classic.  Between this and Limbo, I simply can't wait to see what Playdead do next!",
            "review_score": "1"
        },
        {
            "review_text": "One-ups Limbo in every way.",
            "review_score": "1"
        },
        {
            "review_text": "INSIDE is very similar in terms of gameplay to Limbo. It provides a dark atmosphere and sense of dread through the whole game, without relying on jump scares. The puzzles throughout are never too difficult and keep the momentum going all the way to a fantastic finish. INSIDE is only about 4 hours long, but well worth the $10.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game  Got strange near the end. Shame it wasn't very long either but worth the money",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games I've ever played.  Seriously, go buy it now. Play it through without stopping. Sit in awe for a few minutes when you're done. I don't want to spoil anything because this game is best when you go in blind but the story is thought-provoking and ambigous and the atmospere and world is as fleshed out as any I've ever seen. Every step you take gives you the sensation of being somewhere you shouldn't and of drawing closer to an unimaginable terror.  Never has a game filled me as much dread as it has wonder.",
            "review_score": "1"
        },
        {
            "review_text": "get ready to be mind ♥♥♥♥ed.... and see other people mind ♥♥♥♥ed",
            "review_score": "1"
        },
        {
            "review_text": "One of the best indie games I have played in a long time.",
            "review_score": "1"
        },
        {
            "review_text": "WHAT DID I JUST PLAY?!?   WHY DID THEY MAKE THIS??!?   WHAT THE ♥♥♥♥ IS GOING ON!?!   WHAT THE ♥♥♥♥ HAPPENED TO PLAYDEAD!?!?    *SPOILERS*  WHY WERE THEY PEOPLE BEING MID CONTROLLED?!? WHY WERE THEY GROWING PEOPLE IN ANTI-GRAVITY WATER!?! WHY IS THIS KID BREAKING INTO THIS FACILITY!?!?  AND WHAT THE HOLY ♥♥♥♥ IS THIS GIANT BALL OF LIMBS AND FLESH THAT YOU BECOME AT THE END!?!?!??!?  11/10",
            "review_score": "1"
        },
        {
            "review_text": "There are alot of video games out there, that's for sure. However, there are very few games that can draw you in and make you feel so many emotions and leave you with an unforgettable experience. Playdead has created a masterpiece not seen since Journey. Haunting is one word used to describe this game. Do yourself a favor and play this NOW",
            "review_score": "1"
        },
        {
            "review_text": "That is why I bought my PC....",
            "review_score": "1"
        },
        {
            "review_text": "Very good. Only flaw is it may be a tad short for some for its price. For me the experience was worth it. Go in blind and open to ideas.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, great even, but incredibly over-hyped. People have been saying it's a 10/10 game of the year contender, and while I'd say it was a good game, it's also given me no reason to return and replay it again. Without spoiling anything I felt like the story became a bit predictable towards the last half of the game and while there were some cool reveals nothing seemed to have the same impact on me that so many reviewers had. Solid 7/10 and I'd recommend you play it if you liked Limbo, or other puzzle platformers in general.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "great stuff - creepy and mysterious atmosphere and very thoughtful sound design 8/10",
            "review_score": "1"
        },
        {
            "review_text": "LIke everyone is saying its an amzing game, stunning visuals and presentation. I do have a couple of issues with it though, one is the length of the game, its pretty short, i finished it off the first launch, had expected to come across plenty of hard puzzles to keep me stumped but I just found it to be way too easy, most of the deaths i had were just cause i wanted to see what would happen. BUT! despite those things it was still well worth the play through.",
            "review_score": "1"
        },
        {
            "review_text": "Neat game. For fans of Limbo. Definitely worth it if you can get it on sale. Dewpending on how quick you can solve the puzzles this game will take you between 3 and 5 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Well that was an adventure",
            "review_score": "1"
        },
        {
            "review_text": "A simple puzzle game which wears it's likeness to Limbo on it's sleave. An all round great game, the only downside is arguably the length. It's not a long game but I feel if it was any longer it would outstay it's welcome.",
            "review_score": "1"
        },
        {
            "review_text": "Deeply satisfying in every way. I loved and love Limbo. I didn't expect the successor to be nearly as good. But! It's like the bigger, creepier, more original brother of Limbo. Like Limbo was a nice little demo-gem and this is the climax of all ideas found in it. From the first moment you are fully drawn into the game. Just play and enjoy! Every word more just would spoiler something; one thing I'm sure of, no matter how high your expectations, you can't be disappointed, that is impossible!",
            "review_score": "1"
        },
        {
            "review_text": "it was a pretty fun few hours",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely the weirdest game I've ever played in my life. It started off a bit tense and scary, then progressed to creepy, then full on heeby-jeebies. Then 'metamorphosed' into something I've honestly never seen before, and can't imagine ever seeing again. Then roll credits. It has a creepy X-Files feel; you are always trying to figure out what's going on. The puzzles are super clever and fun. You will be stressed out to perform them before your doom. It's like doing Sudoku while being attacked by bees. Good luck!  If you are out for a tense story with a twist you've NEVER seen before, this is the game for you! I really enjoyed it. Now I'm going to throw up and go to bed.   Enjoy!   (Seriously.,, Loved the game. Big time creeped out. Wish they had more titles.)",
            "review_score": "1"
        },
        {
            "review_text": "looks/sounds amazing and is dark and creepy as hell. worth a play 5/5",
            "review_score": "1"
        },
        {
            "review_text": "If you don't like this.....you have bad taste.",
            "review_score": "1"
        },
        {
            "review_text": "all im going to say is that this game is spectacular.",
            "review_score": "1"
        },
        {
            "review_text": "proper cool proper short",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. I wish more game developers took this approach.   Its a bit too expensive for the duration IMO. BUT I would recommentd it to any fan of a Indie Puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "My only complaint is that I would have liked to see some harder puzzles, otherwise everything about this game is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "PLAY IT. No amount of describing can justify a game such as INSIDE. Playdead really out did themselves here and somehow made a much darker, much more opressive, and at times horrifying game than Limbo. The game's overall gameplay is much like LIMBO's. However, the puzzles feel more intuitive and interesting then they were in Limbo. The graphics are great. They match that dark tone the game is aiming for. These graphics are backed with even better sound design. From the boy's breathing, the music ques, and the sounds in the world, Playdead REALLY paid close attention to making this game sound as forboding as it plays and looks. I am still trying to make heads or tails of the game's ending, but I liked it for what it is. It leaves you something to think about for a while and try to make sense of it which isnt a bad thing for a game like this. I will say that if you did not like LIMBO, you are not going to like INSIDE. However, if you did enjoy LIMBO, you are going to absolutely love this game from beginning to end; I know I did.   FINAL VERDICT: 10/10  BEST ASPECT: THE GRAPHICS/SOUND DESIGN  WORST ASPECT: UHHHHHHHHH...",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet. Definitely worth the buy!",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it!   This graphics and sounds OMG!!!!!!!  I LOVE THIS SO MUCH!  THANK YOU!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games you want everyone to see. Short, admittedly but beautiful.  Don't regret not waiting for the sale.",
            "review_score": "1"
        },
        {
            "review_text": "It took me 4 hours to beat it with all the secrets, was great but far too short. Best bought on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, what a great follow up playdead. Dont wanna spoil this, u just have to go through this beauty alone. Loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Men in jason mask tried to kill me.Then a dog tried to eat me. I just jumped a submarine over a hatch.Now im taking a break and taking some xanax cause that ♥♥♥♥ gave me a straight up anxiety attack. 1.4 hrs in and I already feel i got my monies worth.",
            "review_score": "1"
        },
        {
            "review_text": "  No review in the entire lifespan of mankind will ever do justice to this game. I used to believe that LIMBO was as near to perfect as it was possible for an indie game to be; a captivating narrative, challenging gameplay, absorbing visuals and audio, and the ever-present feeling that there is a great intangible meaning behind every action you take. INSIDE is everything you didn't realise was missing from LIMBO.",
            "review_score": "1"
        },
        {
            "review_text": "Alma from F.E.A.R is in the water",
            "review_score": "1"
        },
        {
            "review_text": "Loving this game!",
            "review_score": "1"
        },
        {
            "review_text": "There are not many games that leave you speechless.  this is one!",
            "review_score": "1"
        },
        {
            "review_text": "another masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "I LOVED IT! I have played LIMBO for soooo loong and now finally the new game INSIDE!  the story was interesting all way through and there where many sides to the story and possible background stories to the game that the game doesnt really tell you. I will play this game again and again until i get all the achievments! WELL DONE!",
            "review_score": "1"
        },
        {
            "review_text": "Probabably one of the coolest game experiences with a video game I have ever had.  ",
            "review_score": "1"
        },
        {
            "review_text": "A subtle and eerily effective color palette applied to a mysterious and insidious backdrop where every sound is as nuanced as the current puzzle you're attempting to solve.  Hard to believe they crammed so much anxiety and unease into a two-button control scheme.  Yes, it's easy to simply call this the spiritual successor to Limbo, but it is so much more than that.",
            "review_score": "1"
        },
        {
            "review_text": "Just bought it ! An awesome game and the vibe is fantastic !! But its way too short i beat it under 3 hours ... Puzzle were great but not enough hard at some time i think i only got stuck 5-10 min at 1 puzzle  8/10",
            "review_score": "1"
        },
        {
            "review_text": "What a fantastic game. I am still playing it so im keeping clear of any spoilers.  Great looks, Great sounds, Good puzzles,  Lots of tension (for me), Story wise, not a clue.. Just keep running from the dogs !!!!",
            "review_score": "1"
        },
        {
            "review_text": "Nothing can prepare you for what this game is about to throw at you. Inside is a good game. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "A short (three or so hours) puzzle game oozing with atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "It's 2.5 hours. But what a fantastic 2.5 hours. Buy this for the experience, the artstyle and the impressive physics and lighting.  I'm going to replay it a few times.",
            "review_score": "1"
        },
        {
            "review_text": "Beatifull game, a must if you like puzzle games!",
            "review_score": "1"
        },
        {
            "review_text": "Just finished the game about ten minutes ago. Boy oh boy was that game something. The puzzles were great and interesting, and the atmosphere was on point. If you loved Limbo like I did, then INSIDE is the game for you. It's even better than its predecessor. Cheers!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game to bits but i did not get the ending. and also when i startet the game at around 9 it was like *pufff* midnight, the danes are up to some witchcraft im sure! -_-* jk",
            "review_score": "1"
        },
        {
            "review_text": "With LIMBO and now this, I am left wondering whether or not the folks over at Playdead had seen some messed up stuff in their childhoods.  Absolutely fantastic experience, I was enthralled the whole way through.",
            "review_score": "1"
        },
        {
            "review_text": "There is a bug that when i am avoiding the moving lights by standing in the shadow of something there is no shadow. I dont know where to stand and move as the light passes by. Does anyone know how to fix this?",
            "review_score": "1"
        },
        {
            "review_text": "inside is similiar to limbo in its puzzle platforming style. the story is alot darker however in my opinion and that is something that kept me alot more intersted than limbo. The game took 3 hours for me to beat getting half of the secrets I would reccomend to wait for it to go on sale for a little more becuase for me 21.99CAD is a little much for 3 hours. Overall though a fantastic platformer, great music and atmosphere.  8/10 2 points missing due to the length",
            "review_score": "1"
        },
        {
            "review_text": "Okay so I am a huge fan of puzzle games and Limbo simply took my breath away when I first played it. Now PlayDead has truly once again created a master piece. The game's sounds are so realistic they literally speak of the developers' hard work and efforts. The graphics, the outstanding animation and physics all help to make the overall gaming experience worth remembering.",
            "review_score": "1"
        },
        {
            "review_text": "2,5h of gameplay later and the game is completed. fun game but 0 replay value. A bit expensive considering the play time. Great feel and ambiance.",
            "review_score": "1"
        },
        {
            "review_text": "From the creators of Limbo, comes even more of a mind ♥♥♥♥ than before. I didn't even need to take it out to dinner first. Love the game, absolutely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "It's hard to say much about this game since the mystery and the atmosphere require you to go in with as few expectations as possible. I was gripped from start to finish, an absolute masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "Wow Playdead, just wow. I should fly to Denmark and treat y'all to dinner. Similar to Limbo it's dark, erie, and suspensful. The puzzle aspect is on point. Some will give you a little chuckle, have you thinking, oh that was it......others will have your heart racing.  + Atmosphere + Clever Puzzles + No Crashes  [no negatives]  = could be a little longer but its replayability seems high  Overall this is a great game, you shoulf give it atry even if you dont play puzzle games 10/10",
            "review_score": "1"
        },
        {
            "review_text": "  Like peaches !!",
            "review_score": "1"
        },
        {
            "review_text": "Playdead's debut game, Limbo, sent shockwaves through the indie scene, showing the true might of people who are dedicated to creating video games. With the expectations high like a breakout musician releasing their sophomore album, Inside more than exceeded what anyone could have predicted. Buttery smooth gameplay, satisfying puzzles, and gorgeous sounds are rich within this game, coalescing into an experience that is matched by few. Playing Inside feels like reading a literary classic, something to behold, something you have to put a little more effort into, and something you might have to go through a few times at the least to really suck every last ounce of marrow out of, which to me is yet another reason that makes it great. This is a game that has rejuvinated my love for games, and is not only one of the best games to come out this year, but has made my list for top five games of all time.  Please play this game, it is quite a journey.",
            "review_score": "1"
        },
        {
            "review_text": "Pros  Outstanding atmosphere, music, visuals, gameplay, puzzles, animation, basically everything. This game is incredible and you should get it right now  Cons  ~3hr long, loud sound effects have heaps of unnecessary distortion/ are clipped to ♥♥♥♥ by the audio engine, I'm a sound designer/music producer so this made me cringe every time it happened   the blast tunnel section and crashing through the walls near the end were the worst bits    Review  Don't think I've ever played a game that has inspired such awe, confusion and panic in equal measure within a couple of minuites, probably one of the best games of 2016 by a significant margin",
            "review_score": "1"
        },
        {
            "review_text": "20$? For this amazing, perfect 3 hours of game?  Just buy it. If you liked Limbo, have ever heard of Limbo, have ever enjoyed a good story, have ever played a video game, it's worth 20$.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics, music, sound, gameplay are all mindblowing. The ending left me asking too many questions though, but perhaps I missed some things.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely worth playing through just for the last section of the game which was so much fun. Fantastic visual representations and animations, plus a tremendous use of lighting to enhance the experience. 4 hours to beat, but I definitely was not in a rush to finish. (aka I tried to see how many ways I could die). If you are on the fence I would definitely give this game a try.",
            "review_score": "1"
        },
        {
            "review_text": "Shorter and less challenging then Limbo. Takes about 3 hours to beat. Hidden items are much easier to find (some) Never the less, game is gorgeous and a wonderful experience.  if it was 15 bucks instead of 20, it would be more fitting.",
            "review_score": "1"
        },
        {
            "review_text": "Original. Challenging. Brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "Immaculately crafted until it's not - with some puzzles being too 'puzzely' - it breaks down the natural design and flow of the world. Other than that it's on par (if not better) than Limbo.",
            "review_score": "1"
        },
        {
            "review_text": "INSIDE (much like the game LIMBO) is a dark and sinister platformer that utilizes physics-based puzzles and tells its abstract story through the environment. The basic controls, carefully hand-crafted levels and stylized art style are living proof that a simple game can still be easily as enjoyable as any big-budget title.  You start the game as a young boy that appears to be on the run from militants, who won’t hesitate to ruthlessly end your life if they catch you. The game contains an overall theme of oppression, seemingly inflicted by hidden corporate agenda. Your goal is to somehow find the purpose that drives the sinister machine that holds the lower-class population captive.  The animation of the various characters and how they interact with each other and the world around them is almost flawless. The sound design is even better! It’s startling how effectively the sense of fear and desperation is portrayed from the player character’s body language alone.  During my first play through of INSIDE, I was truly shocked to see some of the many gruesome ways that you could be undone. Some of the puzzles have pretty clear answers, others took a moment of observation in order to identify the intended solution. More than once, I was stumped and unsure of how to overcome certain challenges on the main story path. I expect smarter players would have less difficulty.  Much like LIMBO, there are secrets lightly scattered throughout the game in the form of breakable “lamps”, which offers a small degree of replayability. The achievements associated with them all contain clues in their descriptions to how to find them, and are listed in chronological order of appearance within the game. It’s not too hard to find the general area where they’re located, but actually reaching the lamps requires some careful searching. There is also a hidden “ending”, which is only accessible after unlocking all the achievements, but finding it without a guide is only a couple of notches shy of Hideo Kojima levels of challenging: You don’t have to think like an “Augmented Reality” gamer to find it, but knowing where to go and remaining tirelessly observant is half the battle.  If you liked LIMBO, you’ll like INSIDE. Its brilliant simplicity belies a level of depth that many developers still fail to deliver. You’ll be daunted, surprised and on the edge of your seat from beginning to end, and left with as many questions as you found answers, any of which could further colour the interpretation of the game’s message. It’s an abstract masterpiece and I highly recommend it to all mature audiences (so long as they don’t have a morbid fear of attack dogs).  For Twitch streamers and YouTube gamers, this title is one that absolutely must be played without a walkthrough. For everyone else, buy it and play it for yourselves first! It’s worth the price of admission for an unspoiled, immersive experience. ",
            "review_score": "1"
        },
        {
            "review_text": "It's wonderful.",
            "review_score": "1"
        },
        {
            "review_text": "Short, but amazing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is high art.",
            "review_score": "1"
        },
        {
            "review_text": "It's about the journey, not the destination. This game feels like playing a Stephen King novel. If you're a fan of his writing, you understand reading his work is more about the journey than the destination. Like a typical King story, this game keeps you asking questions, but never really answers any of them. Gameplay-wise, I'd give this game a 9/10. It's fun and the puzzles are challenging while not being so difficult they suck the fun out of it. Load times are minimal and checkpoints are sensible. Even though you have very little idea what's going on, why everything is trying to kill you or who you even are, the game design does a great job of making it pretty obvious where to go next. The puzzle objectives are always clear but the game keeps you thinking in different ways. It uses several completely different mechanics that you don't really see coming, but still seem to fit well with the 'theme' of this game, whatever that is.  Story-wise, this game has no real beginning, coherent narrative or cathartic ending. I won't spoil it but I will tell you it just kind of ends. There's no epic boss battle, no race against the clock final dash, no great antagonist reveal. It just kind of ends. There is no intro, and the credits roll on the last scene. There are no cutscenes, nothing to read or listen to (dialog or writing). The 'enemy' NPCs don't seem to have much to do with each other. One really creepy and strange enemy stalks you at several points in the game, then helps you inexplicably. Maybe there is a coherent narrative going on here but I failed to pick up on it. It is interesting and thought-provoking, but no so much that you even really know what questions to ask. So, if you're looking for a game with a clear plot and epic ending, this game is not for you.  If you're into atmosphere and creepy, weird and mysterious games. It's a 2.5D survival horror platformer.  Also worth noting is there are no collectibles, except a few items you may hold temporarily to solve a puzzle. In fact the only thing that you can even check off, other than checkpoints (which you can load to at any time, which is nice if you want to go back) are achievements, of which there are only 14, all of which consist of finding hidden-- devices you deactivate, for unknown reasons. If you get them all, a final one is available and an alternate, equally inexplicable ending can be found. I won't spoil it either but it answers nothing and just restarts the game when you get it.  I do highly recommend this game, even if I am highly critical of it's narrative. Even though the plot isn't coherent, it's still interesting to experience, just don't get your hopes up for an explanation. Just enjoy the journey :D  Also worth noting is the price. I paid $19.99 and the game feels really short. I would expect the price to be lower or the game to be about twice as long.",
            "review_score": "1"
        },
        {
            "review_text": "It's good  You should get it.  The best part are all the wicked puns.  10/10 would play inside again.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, complex, intriguing, and overall entertaining. A game that will bring lots and lots of theories. A game that is 100% worth your time.  (For better enjoyment, play in the dark.)",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Limbo, this is better in my opinion, although puzzles were a bit simpler overall. Very strange world and lots of surprised.",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING!   Made me realise why I like certain types of music, art, literature, movies and games.   I like creative things that couldn't have been achieved in any other medium.",
            "review_score": "1"
        },
        {
            "review_text": "I thought the game was really good, i did watch Jim F$£ing Sterling Son's sneak peak at the game before considering buying it and then looked at the reviews that had been written on steam before commiting myself.  Despite some of the negative reviews about how it ended overall i was glad i bought it, ok £15 may seem like alot to most people for a game that will probably give you 3 to 4 hours of gameplay at a push !!! but i wasn't counting the minutes I just enjoyed the time i had whilst playing.     ",
            "review_score": "1"
        },
        {
            "review_text": "I decided to buy this game after I watched the demo and trailer. I like the the dark, mysterious and exciting atmosphere, and the game meets my expectation. It makes me think of a famous post-apocalyptic sci-fi short story called 'I Have No Mouth, and I Must Scream'. It would be much better if it has more elements of horror. 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "great game. even though it has a 'short play through time' i did it in 4 hours or so. I still enjoyed it and was money well spent. No need to worry if its worth the purchase because it is.",
            "review_score": "1"
        },
        {
            "review_text": "Another linear game with often dull and often frustrating game mechanics, with few exceptions, and yet I decently enjoyed it because it was visually beautiful and had an entertaining plot.",
            "review_score": "1"
        },
        {
            "review_text": "I definitely recommend this game. I won't spoil anything, because this game needs to be played without any knowledge about what is going on in the story. All I'll say is that   INSIDE   is a perfect example of video games as a narrative medium. The game tells its story through interactions, visuals, and sounds in a way that many other games do not.  The game will last you around three hours, but please understand that this is a game that is about delivering an experience through interaction. There are a lot of reviews on here that the game is 'too easy' or that it's 'too short,' but you have to understand that the developer is not trying to create a lengthy puzzle platformer game with a series of challenges like   Portal   or something. Nor is this a game where 'story' comes first, and gameplay is left at the wayside. Instead, gameplay and story and meshed together in a way that benefits both aspects. Before you buy the game, make sure that you're okay spending $20 on that experience. The developers clearly worked hard on this game, and I believe they deserve that money, but there are plenty of people complaining that they didn't get their money's worth or something to that point. It's a $20, three hour long narrative experience that is worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool game! Set in a weird world with outstanding graphics and animation! The puzzles are a little easy, with only a few which have to be timed just right. The game reminded me a lot of Deadlight, which is fine because I like that one very much as well.",
            "review_score": "1"
        },
        {
            "review_text": "Thankyou Playdead for another masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "Very atmospheric. Puzzles were interesting but I never got hung up on any of them",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, riveting game. Very depressing and slightly challenging but not enough to discourage you. Definately would reccomend, I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic. Often you get games parised by the media and you play it only to go MEH.  Not this time, very good. Very strange",
            "review_score": "1"
        },
        {
            "review_text": "Best $20 I have spent on a game, I almost didnt buy Inside because of how short the game is, yet I dont think I would have spent 4 hours playing anything else. The game left me wanting more, I fell in love with Inside. I would say it is an experience that I will never forget.",
            "review_score": "1"
        },
        {
            "review_text": "The best game I've ever played. The puzzles were challenging but intuitive and the narrative kept you wanting to find out where the hell you are. The artwork is the greatest thing in any game I've ever witnessed. You could take a screenshot at any point and save it as your desktop background - it was that good! I clocked it in roughly 6.5 hours. At one point I thought the game was over and then all of sudden I could control the character again - that was the best. The second half of the game is ridiculously awesome. Loved every minute of it.   ",
            "review_score": "1"
        },
        {
            "review_text": "Wow.. this game has such an awesome atmosphere..",
            "review_score": "1"
        },
        {
            "review_text": "  DISCLAIMER: This is a full review, and NOT a first impressions review like all my other reviews, if you want a better full review, then please read better reviews then mine",
            "review_score": "1"
        },
        {
            "review_text": "There are things you have to do in INSIDE that are disturbing and clever at the same time. So many disturbing things that you want to share with others. Which is a weird feeling. Once again after LIMBO, this is a game that will haunt my dreams.",
            "review_score": "1"
        },
        {
            "review_text": "Review Withstanding... only kidding it's bloody awesome and weird and scary but mostly weird. Loved every second of it.",
            "review_score": "1"
        },
        {
            "review_text": "Put it this way... you will know why it is called INSIDE by the end of the game. Good enough... NOW BUY!",
            "review_score": "1"
        },
        {
            "review_text": "THIS. GAME. There's so much stuff that I want to say about it that I don't know where to start. Beautifully crafted and cinematic. Subtle details in the foreground and background create an environment that draws you in from the start and wouldn't let go for the entire 2-3 hour experience.  Gameplay wise it is very similar to LIMBO, environmental platforming and puzzles, it may take several tries to figure out the 'trick' of a particular segment.  The story (if you can call it that) is really the big selling point of this game. You will be flooded with questions about the world and your place in it. I must have went through a dozen different possible explainations and scenarios before the game decided to throw the most bizarre twist. All I can say is, what you're expecting is not going to be what you get.  So if you like analysing and dissecting ambiguous and very thoughtful plots, you'll definitely enjoy this experience.   Overall, a very atmospheric, intense, thought-provoking experience, that will follow you long after the game is done.",
            "review_score": "1"
        },
        {
            "review_text": "Entertaining and haunting at the same time.   If you liked Limbo this is a must play!  I would have liked it to be longer, but isn't it always like that with games like these!? :P",
            "review_score": "1"
        },
        {
            "review_text": "I've never been blown away by a games ending before. Until now.  Even if you're on the fence about this, just trust me when I say this game is VERY MUCH your 20$. This was like a movie. But 5 hours.",
            "review_score": "1"
        },
        {
            "review_text": "9.9/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing fun throughout the whole playthrough! Though the game is shorter than I would of liked (approximately 3 and half hours in one playthough), it was definitely worth the money. It's a creepy and mysterious experience, the puzzles are challenging enough to keep the flow evenly paced. It's a beautiful game with clever design and use of atmosphere which deserves your attention. It's a highly polished product which kept me wanted more but priced fairly for its content.  9/10 - I want more, give me more!",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game, haven't had so much fun with a platformer recently. It might be a little weird for some people but for me it was strange, refreshing and capturing. I had a ton of fun playing it and I couldn't get enought of it.",
            "review_score": "1"
        },
        {
            "review_text": "Visually and aurally stunning. A dense experience well worth the $20 to support these amazingly creative developers.",
            "review_score": "1"
        },
        {
            "review_text": "Eerily beautiful, seamless, and atmospheric. I was hooked from the very start.",
            "review_score": "1"
        },
        {
            "review_text": "Just like Playdead's previous game Limbo, this game excels in atmosphere and sound design. The platforming elements, simple as they are, are very well executed and the puzzles are just challenging enough to keep you interested and avoid frustrating you.   And again just like Limbo, I cannot recommend this enough. This is one of those games that even if you don't like it very much, you have to experience it.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome adventure game disguised as a physics platformer. I never liked Limbo that much (need to replay it, mayhaps?), but this game is pretty much flawless. It's about 3 hours long and costs twenty Euros, so there is that, but it's three really enjoyable hours.  One thought that stuck with me, especially during the final hour, was: 'This is only possible in video games.' Video games are often clumsy at narrative, but the way Inside realises its story through audio, visuals and interaction, especially in that last third, kind of blew me away. It also feels like the developers spent a whole lot of time building the insane mirror-world presented in Inside, and then chose to cut like 97% of that world and that storytelling from the actual game. No exposition, no explanation, no dialogue - now if you want to tell a mysterious story, that's exactly the right way to do it. There is nothing quite like it, so go buy it.",
            "review_score": "1"
        },
        {
            "review_text": " Inside  is the next game from the studio that made 2010's  Limbo , and you can definitely tell. The team built off  Limbo  in a few ways: the game again stars a kid in a scary, atmospheric world, and the platforming and puzzle mechanics are similar. Inside is twice as long as is predecessor, and has a little more of a tangible narrative. While the story is not concrete or straightforward, there's more to chew on, with recurring themes and concepts appearing throughout. It's also worth noting that weird games are often rough around the edges, but  Inside  is one of the more polished and smooth-running games I've played this year.  As with  Limbo , I don't think  Inside  is revolutionary, but its style and execution are excellent. Check it out if a strange atmospheric puzzle-platformer sounds like fun.",
            "review_score": "1"
        },
        {
            "review_text": "I AM LEIGON. WE ARE MANY.   Good game tho, Has its ups and downs but the ending is worth it.  Don't spoil yourself whatever you do.",
            "review_score": "1"
        },
        {
            "review_text": "A very compelling game. 'Inside' leaves you feeling as if you've just woken up from a dream while, at the same time, still feeling concrete and real. The art style is unique and stylistic and sets it aside from other games right off the bat. If you're a fan of games full of speculation and conjecture, I would definetly give 'Inside' a go. Similar to the 'Dark Souls' series and others, like 'Life Is Strange' and 'Bloodborne', 'Inside' lets you decide what you make of the story. One of the best games I've played all year.",
            "review_score": "1"
        },
        {
            "review_text": "So when i saw this game, i was like 'why not, its just 20 dollars' If i knew what i was going to play i would probably give 50 for a game like this!  -Everything is awesome.  -Didnt find anything that i dont like -awesome atmosphere -awesome puzzles, they actually help u into the game but in a smart way. I was like, wtf this is easy, but it was getting harder and harder. -the physics of the game. i was never expecting to see a 2d game with this kind of physics!  Beware of Samara in the water. I thought she was dead....Well, she is not!",
            "review_score": "1"
        },
        {
            "review_text": "[Re-review] In hindsight, I realize that I probably shouldn't review things while I'm irritated. That last review was a bit more scathing (and wordy) than I meant it to be. So now, having calmed down a bit and sorted through my thoughts effectively, I'm-a going to try giving this review a second shot.  Inside is a surreal adventure through beautifully rendered and haunting environments. Gameplay is fairly minimal; consisting mostly of running to the right, solve a few puzzles, then keep running to the right. The game's minimalism works both for and against the game. The lack of general clutter and contact with other people lends well to an eerie and unsettling atmosphere. Unfortunately, due to the size of the maps, this means there are long stretches of nothing but your character running against a grey background. Most of the game is tedious like that. The endings can best be described as 'out of left field' for the normal ending and 'pointless waste of time' for the 'secret' ending.  I'll still recommend it, but I'm going to also recommend you wait for a sale. There's just not enough game here to validate a $20 price tag.",
            "review_score": "1"
        },
        {
            "review_text": "Things Playdead has sucessfully made me afraid of -   Dogs (man's best friend)  Water (the stuff you drink)  Wearing a red shirt  Hippies",
            "review_score": "1"
        },
        {
            "review_text": "Worth the money. Fun puzzles. Very nice art style.",
            "review_score": "1"
        },
        {
            "review_text": "A perfect follow up to LIMBO, the creepy and downright crazy atmosphere will blow you away. The 20€ price might be a bit steep for a 4 hours experience if you're on a budget, but if you're not, just play it.  + Nice and short, never feels tiring + Fantastic style and atmosphere + Best animations i've ever seen + Simple but exquisite gameplay  - The lack of narrative and open ending leave me wanting to know more - Some collectibles are pretty much impossible to find  4/5",
            "review_score": "1"
        },
        {
            "review_text": "This game proves what most of us have feared; that Pokemon Go will lure the zombie masses throughout the world to concentration camps forever. Only the smart non-Pokemon Go masses will be left to fight globalist machine robots. Get ready for one action-packed game! ",
            "review_score": "1"
        },
        {
            "review_text": "Why did the mermaid decide not to kill me only after the 20938209320 times i died  still 10/10 game tho",
            "review_score": "1"
        },
        {
            "review_text": "An improvement over Limbo in every way that unfortunately ends too soon.",
            "review_score": "1"
        },
        {
            "review_text": "if you played limbo and loved it youll love this game",
            "review_score": "1"
        },
        {
            "review_text": "Masterpiece. Best game I played in years.",
            "review_score": "1"
        },
        {
            "review_text": "Never change, Playdead.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the weirdest games I've ever played. Very immersive and thought provoking even though there is absolutely no dialogue in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Short and sweet.  I finished it in around 3 hours, but loved the journey.  Great atmosphere.  At first some of the context auto behaviour of the 'hero' annoyed me, but this was soon forgotten.  Puzzles we ok, nothing really challenging though. I haven't found all the collectbiles though so will prob go for that (without using a guide I hope!)",
            "review_score": "1"
        },
        {
            "review_text": "The game itself if fantastic but it is way too short to justify the price, hopefully the release more to the story.",
            "review_score": "1"
        },
        {
            "review_text": "Really atmospheric, mysterious and super fun. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "The game Flows along well and is pretty to look at. The story is dark and makes me wonder what is hoing on. The puzzles are simpler than in Limbo but they are satisfying to complete. The game didn't outstay it's welcome and thankfully didn't waste my time with repetition just to fulfill an imaginary price/playtime ratio requirement.",
            "review_score": "1"
        },
        {
            "review_text": "- Amazing visuals - Clever puzzles - Riveting story - Brilliant sound design",
            "review_score": "1"
        },
        {
            "review_text": " First of all,   Inside  has fantastic atmosphere, stellar pacing, a well developed and original (if somewhat hard to decipher) story, and (I'll grudgingly admit) some cooool artsy-fartsy graphics. And on a very simple level, the game is fun. Its fun to look at, satisfying to control, and even pounds your heart in some places. It is  very  similar to  Limbo , to the point where many are calling it a sequel. And  Inside  even uses its puzzle elements in very close, fluid conjunction to the plot, whereas Limbo just tossed in puzzles inbetween (which is one of the things that impressed me most about  Inside ). It definetly counts as a 'good game', and if you are the kind of gamer looking for a good narrative and some cinematic shots, this game is  absolutely  worth the $20. It even has a healthy amount of secret items and slightly different animations/interactions you can get each time you play an area, plus a very satisfying and cool secret ending.  That being said, the gameplay is a bit lacking. Just like  Limbo , it frequently makes use of the same 'trial and death' mechanics, where once you die you automatically realize how to survive the immediate puzzle. But in Limbo, you had to die over and over until you were a master of flipping gravity and avoiding spikes, and sometimes you had to stop and think about the best way to go about a situation. To afford all of the awesome story elements, Inside gave up on any puzzle or gameplay that costs more than half a head scratch. There's never a puzzle that requires shifting your thinking, or asking a friend, and if you get stuck on a puzzle, it's because there was a box you didn't realize you could push, or a something that nobody told you you could fit though. Even one of the only complicated puzzles in the game requires you to break a previous mechanic by hitting it with a platform, in a way that you couldn't have known, and after that it was smooth sailing.  Which is an absolute shame because some of the mechanics in  Inside  are really compelling and original. The type of puzzle I like to call 'pikmin puzzles' is actually really cool, especially the interesting twist on it that the developers pull on a level with a minecart (not to spoil too much). But then you never see it again except in a secret area once. You never see any puzzle elements come back or combine in any meaningful way. And when you go back to play it a second time (because you definetly will want to) you will remember all these puzzles you bumped into before and think, 'that was cool, why didn't that ever come back?'   All in all ,  Inside  is a really great game if you like original, artsy, and meaningful gameplay-driven games; an above average game if you like pretty and satisfying platforming; and a maybe okay game if you are looking for interesting puzzles. Consider before you purchase at full price, but  definetly  worth it at any discount.",
            "review_score": "1"
        },
        {
            "review_text": "i ship the boy and the    mermaid kid    ",
            "review_score": "1"
        },
        {
            "review_text": "'Wow, just wow... Beautiful and amazing. I'm hungry for more but what Playdead gave me is all I really need, I just need to digest the story better. The night you finish the game for the first time, go to bed with your thoughts lingering about what your brain just consumed, and think about how you can understand it. Mine tanker i stykker!' 10/10 - Zuceleus (Also have my initial thoughts of the game on my YouTube channel)",
            "review_score": "1"
        },
        {
            "review_text": "Atmosphere, narrative, visuals, sound, all brilliant. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "INSIDE is better than LIMBO in every way (no spoilers)  The puzzles are better - there's far more variety in puzzle mechanics, which is impressive considering the game is a bit longer, and much less dependence on trial-n-error in order to be difficult. Sure you'll still die a lot but, off the top of my head, I can only think of one puzzle in INSIDE that you'll throw a lot of lives at in order to figure out the proper timing of.   And even when INSIDE does revisit mechanics it'll do so with a new twist that completely changes the mechanic (as opposed to stuff like the brain-slugs which function exactly the same each time the appear in LIMBO)  Overall the game might be a little easier than LIMBO but it's hard for me to judge that because of how much I played LIMBO. Being very familiar with how this dev likes to construct puzzles gave me a leg up I think.   The atmosphere and narrative presentation are better - You know how LIMBO starts out strong with the spider and the guys setting traps but then shifts focus about halfway through to pure puzzles? It's like along the way the game loses something that drew the player in at the start. INSIDE manages to stay strong in that regard not only throughout the entire game but also ramp things up at the end so you know you're in the climax. Much improved over the way LIMBO just sort of suddenly ends.  Even the hidden secrets are better - LIMBO had hidden eggs that, for the most part, were pretty impossible to find and weren't very satisfying to collect. INSIDE gives players a visual clue (once they know what to look for) that a secret area is nearby and once they get in there are often presented with unique puzzles that aren't found in the main game. Collecting the secrets also leads up to an alternate ending that provides a bit of context for those trying to unravel the surreal story. It's actually pretty fun finding everything and makes it worth replaying the game in order to get 100%.  Overall I can't say you'll like INSIDE if you didn't enjoy LIMBO but it does improve on the formula in every way, so fans of the first game should play this follow-up sooner rather than later. It's an amazing experience and I can't wait to see what the studio does next. ",
            "review_score": "1"
        },
        {
            "review_text": "This is a weird game with a mix of adventure, emotion, mystery. I really recommend it, though I did not really understood the story, a rich story hidden somewhere in the game, but you'll spend a good time, it will also give some creeps some times.",
            "review_score": "1"
        },
        {
            "review_text": "OUTSIDE ...the box, i absaloutly love this game, a beautifully disturbing experience.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game. Every detail has been meticulously perfected. The physics and animation are second to none. Will play through again. Story will continue to haunt and puzzle me.   Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "As a big fan of LIMBO I was excited to hear that Playdead was finally releasing another project. Upon seeing the trailer for INSIDE I was on board and quickly purchased the game. Now I must say, LIMBO is one of my favorite games of all time and quite excellently does what so many minimalist indie art games try to do. Frankly, I was concerned that INSIDE would be more or less aping off the success LIMBO had and would be a rather lazy formulaic 'sequel'. But it isn't. This game takes the style pioneered in LIMBO and delves deep into improving it. From the obviously massive amounts of care and effort put into the graphics and animations to finding new ways to explore the sidescrolling gameplay, this game borders on perfect.   If you are on the fence about buying this game at all I strongly recommend buying it, the experience is worth your money and Playdead has certainly earned it. If dollars seems high for this sort of thing (which is understandable) keep and eye for it to be on sale and get it as soon as you can. You will not regret it.",
            "review_score": "1"
        },
        {
            "review_text": "All of it--the setting, the sound, the beautiful art--builds to the discovery of the secret",
            "review_score": "1"
        },
        {
            "review_text": "LIMBO and INSIDE are absolutely awesome, addicting and weird games and I love them. The puzzles are challenging, the dark and creepy enviorment and music really sets the mood and the game is very well made. Keep them coming guys, ill be waiting for the next one.",
            "review_score": "1"
        },
        {
            "review_text": "The best game I have ever played in my life. Intricate puzzles, amazing soundtrack, and stunning visuals. I can't put how much I enjoyed playing this into words.",
            "review_score": "1"
        },
        {
            "review_text": "I spent about 70% of my time with this game wondering what in God's name everyone else was gushing about. Yes, right from the opening it's clear that INSIDE has excellent art design and incredible animation. Visually the game is a work of art. The sound design is understated, and effectively supports the games thick atmosphere. The gameplay however, left me confused as to why this was made as a game, and not an animated film. The needlessly basic platforming and overly simplistic puzzle design often felt like padding. These elements were ultimately detracting from, rather than enhancing my experience. Playing this game wasn't enjoyable, satisfying, or challenging.   Then came the closing stretch which turned everything around. This gave me something I had never experienced from this medium and will likely sit comfortably among my favourite moments in gaming. To elaborate any further would only spoil things, so I'll just say this final chapter made any boredom leading up to it completely worth it.  INSIDE is worth experiencing. While I found that for the majority of its very brief runtime the gameplay was banal and completely unsatisfying, the atmosphere, animations, visuals, and sound design are top notch throughout. And wow, what a climax...",
            "review_score": "1"
        },
        {
            "review_text": "No other game has ever made me say 'what the f$!@ is going on?' more times than Playdead's Inside. The evocative visuals and sound design are constantly forcing you to question what the bigger picture of this creepy world is. Though the game is incredibly short - I was able to finish it in just over 3 hours - it's definitely a case of quality being worth more than quantity.",
            "review_score": "1"
        },
        {
            "review_text": "If you don't like horror scifi, then this game is not for you. But if you do, and if you liked the game called Limbo, ...ok; let's say you liked Limbo and you're like, may be i give Inside a try.... Know that you are in for a whoooole another level of 'Wowness'.",
            "review_score": "1"
        },
        {
            "review_text": "Very intense and thrilling game. Maybe a bit short but the message that it delivers is very interesting. The controls are very easy and puzzles are not too hard.  Real piece of art!  9/10",
            "review_score": "1"
        },
        {
            "review_text": "if you like/love limbo you will like this game, same feeling you will have: Dark, strange, great effect and graphic, quite and finally a lot of questions you will have in the end (the normal or alternative ending).  I believe these kinds of games made for fun and make you question the ending and 'maybe' come up with theories by yourself.  recommended for a short/quick play that takes you about 3.5 to 5hrs to finish it 2 times (if the 2nd play is just for 'finding' the things for the alternative ending)  I rate it 8/10",
            "review_score": "1"
        },
        {
            "review_text": "While this game had great gameplay and art style, it's got one of those endings where you say to yourself, 'Well I just wasted my time with this for this payoff.'  Still worth a play for the great animation and presentation.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible game",
            "review_score": "1"
        },
        {
            "review_text": "This game will stick in your mind for a long, long time....",
            "review_score": "1"
        },
        {
            "review_text": "You don't see games like these so often these days. This little game is a masterpiece. If you've played Limbo before, then the concept will be very familiar. You start your journey as a little boy in an unknown place. Except it is SO much better than Limbo. It takes what was good from that game and makes it better. It succeeds in making you feel hopeful yet hopeless. It slowly creeps you out more and more, all the way to the end, when it becomes one of the creepiest things I've played. And you somehow feel pitty during certain bits but at the same time are scared of that which causes you that pitty. It's strange, but it's fantastic. The ambience created is amazing.   I was left when playing Limbo with a feeling of not understanding at all what was going on or the world I was in. I didn't like that about Limbo. Inside gives you more clues as to where you are, but lets you use your imagination.  Can I also point out the attention to detail. Every move you make, every jump, every step is smoothe and visually charming. I also love the fact that you can hear the protagonist breathing, which draws you into the story even more.  Just a little warning: if you can't wait to buy this game because you adore puzzles such as the ones in Limbo, don't get your hopes up. Limbo was challenging. This game is less so. I'm not a smart person and found the puzzles to be very simple, I didn't have to think too much. At the same time, though, that's what makes the game flow. I myself don't like getting stuck. But don't mind me, maybe I'm just having a good day. I should point out though, as much as I found the puzzles to be simple, I also found them to be extremely creative.   It's worth every cent, even if it is a short game.  Trust me. Just buy it. Do it. Right now.",
            "review_score": "1"
        },
        {
            "review_text": "10/10  One of the most unique games ever made. The best puzzle based game of 2016 but so much more. It is best to go into this one not knowing anything about the game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome from start to finish... and the end of the game is so ridiculouly fun and cool. Very satisfying atmosphere, puzzles, and the last three or four segments are worth every cent.",
            "review_score": "1"
        },
        {
            "review_text": "At first I was sceptical if a 20euro game with 4hours gameplay would be worth it, yes and no. This is as much a game as a work of art, it is as awesome as it is ♥♥♥♥ed up. This game just pulls you in, the atmosphere is mysterious and creepy, and the puzzles not too complicated so it's for beginners and experts. But still it's 20euros for 4hours of gameplay I would buy it in sale and if you can't wait (just like me) just think there are al lot of less fun things that cost more than 5euros/hour",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, only ~3 hours or so for a full playthrough. The ONLY complaint I have about the game is that there are so many questions that go unanswered. I really wish they would have fleshed out the entire scenario a bit better to give you a better idea of what's going on. Regardless, I definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Short yet deep &amp; satisfying.. definitely a much improved limbo-style game..!!",
            "review_score": "1"
        },
        {
            "review_text": "Even though I don't like the story being mystified on purpose. Puzzles are amazing. Art is second to none. Good enough as a puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Spooky, beautiful, unsettling, amazing, incredible, and fun. What an amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most beutiful and ♥♥♥♥ed up games I've ever played. A worthy sequel to LIMBO",
            "review_score": "1"
        },
        {
            "review_text": "It was weird.",
            "review_score": "1"
        },
        {
            "review_text": "An excellently odd game which takes you down an unexpected narrative and challenges your assumptions.  The art style is beautiful and the animation simply breathtaking in it's fluidity (especially later on).  If I had any criticism it would be that the game is a little short (though the journey is enjoyable) and the puzzles could be a little more challenging. Only once or twice did I have a brief headscratcher of what I needed to do (though to be fair at least that means you're unlikely to get stuck and thus enjoy the narrative without getting needlessly frustrated).  A worthy successor to Limbo and a definitely recommended addition to your library.",
            "review_score": "1"
        },
        {
            "review_text": "First of all ... this game is a diamond. I also liked Limbo a lot, but  INSIDE  changed the game...   Introduction",
            "review_score": "1"
        },
        {
            "review_text": "This is seriously one of my favorite games at least this year, if not more. Everything is just right. The social commentary is real, the 'what if' scenarios are real, and it shows that one single person can change a society. If it intrigues you at all, buy it and you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "It was weird.",
            "review_score": "1"
        },
        {
            "review_text": "I have no words for this game, but personally it was mind opening and amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Playdead used experience they got from making LIMBO - and took it to the next level. Dark, amospheric game with amazing sound. Goosebumps. Strongly recommended !! Mad thick..",
            "review_score": "1"
        },
        {
            "review_text": "I have no words for this game, but personally it was mind opening and amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Nominated for the 'I Thought This Game Was Cool Before It Won An Award' Award.  It only takes three hours (well, It took me four in my first playthrough; I guess I'm clumsy) to complete is the worst that can be said about This Absolute Masterpiece (TAM; the use of caps is not coincidental). It only takes three (four) hours to complete but if you play It three times in a row, as I did, you get some ten hours of awe. If you consider that you will play TAM every few years (when you have been able to forget some of the unforgettable moments It delivers), the playthrough time is irrelevant (but then again, if, after that, It takes you to play Limbo yet once again -as It did with me-, you get three or four more hours).  I bought what I thought to be A Game (but happened to be A Journey), of which I knew nothing except it was made by the same guys from Limbo, out of impulse. I had been patiently waiting for months to get Wolfenstein The Old Blood for 10 bucks and then I go and pay double for a game I don't know nothing about. I don't regret it: The Journey is worth every penny (/cent or whatever your currency is). I just love the minimalistic approach to the puzzles: less is more. Challenging yet not frustrating as someone else already pointed out. Plus you get to play, in one of the weirdest worlds you can imagine, the weirdest character you'll EVER play, period.   Just go get it.  5th playthrough edit:    When the kid is in the elevator in the platform puzzle, one of the clones / shadows / walkers gently touches the kid's head.     6th playthrough edit:    Best death so far: instead of letting the kid fall in the water to avoid the capsules, jump at the end of the ledge.   ",
            "review_score": "1"
        },
        {
            "review_text": "INSIDE surpasses LIMBO in almost every way. It's a lot grittier and darker in tone, and I have nothing negative to say about it. I found the puzzles to be easier, but I'm unsure if this is the game's fault or if my ability to problem solve has improved since my initial playthrough of LIMBO back in 2010/2011.  Also, there is a sequence in this game that caught me completely off-guard and I'd say that it's one of the most disturbing moments I've experienced in a game. I found that the experience of playing the game was oddly carthartic, too.  Overall, I'd say that this is currently my favourite game to come out in 2016.",
            "review_score": "1"
        },
        {
            "review_text": "Best beginning to end game expierience of 2016 for me. Amazing visuals and animation, fun puzzles that blended seamlessly into the environtment and incredible sound design.   I found myself audibly reacting to many parts in this game as well as grinning quite a bit while playing. I wish I could erase my memory of this game and experience it again and again.",
            "review_score": "1"
        },
        {
            "review_text": "Puzzles feel semi-challenging, but very rewarding. Stick with this game even though it slogs through some parts, the ending is totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "funny game? horror game? yes, both",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. Limbo is one of my favorites, and this is right up there. Not that one is better than the other--they're both a joy to play multiple times through.",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet! An excellent game with beautiful visuals and a soundtrack that's very immersive. I would highly recommend this game who are looking for a unique experience!",
            "review_score": "1"
        },
        {
            "review_text": "Every once in awhile comes a new work that defines its own medium. This time it is Inside.  Pros:  Playdead treated their games with care, to a certain point where some would say they are overly meticulous. Yes there are moments where those care take time, like the 6 years development of both Limbo and Inside, I argue that everything was worth it. From the moment the boy in red sweater slid down the boulders as we start the game, every movement of that character was calculated and prepared to make it seems natural. Every step I take took weight. Every jump is a gasp for air, a tiny leap of faith, and every landing is heavier, rough and tough. The way the boy moves through the woods, the concrete, the stones, or stumbling and gaining back posture through puddles makes me experience the texture and the density of the atmosphere rarely felt through any other games or film or novels. Once a restricted medium, games elevates itself through titles like Inside to let the us touch and feel its story and its grimness and its heavy toll it takes each time our character dies meaninglessly and brutally. I am the aesthetic type, and I look mainly for such in games I play. How the wind makes the trees and the leaves rumble, how air feels heavy when we have to enter water again knowing what’s waiting below, how our character stops and exhaust after escaping the flooded elevator. And in this category, Inside deserves it. Everything was done well, and everything was done beyond expected.   Story wise, I would say that Limbo had a clearer answer to all of its mysteries. Inside has too many questions need answering, a bit too many to the point that some claims it is meaningless, lazy or just trying to be cool or ambitious. I like going straight to fandom sites and forum reading discussions between players expecting to know more, or sitting through a bus ride wondering meanings and ideas suggested by the game. In this sense, I enjoyed the jam-packed ideas and subplots Inside poses.   Cons:  Puzzles mechanics are less challenging than those from Limbo, and unlike Limbo where puzzles were ways to introduce you to the mechanic of the game universe itself, Inside’s puzzle are a bit similar to each other at one point or another. This bring up the game pace quite a bit and certainly helps new gamers, especially ones that I introduced this game to.  For movie-like experience or an art-house short game, Inside is quite terrific and beautiful. It is haunting, daring, and while a bit slippery some parts, held up solid and well-presented as one of the most stunning game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game during the steam autumn sale (currently still going on) for $14.99. Overall it was an interesting game, kept my attention, never got boring, and had a few good puzzles.   However it is a little short, I bought it and beat it (the ending without all of the collectibles) in the same day. I may go back and find the others collectibles, but I'm not sure. I did think it was better than Limbo, but I never finished Limbo so maybe that's why.   Get this game if it's on sale, it's good, but I wouldn't pay more than $20 for it.",
            "review_score": "1"
        },
        {
            "review_text": "Best 'what just happened?' experience of 2016.",
            "review_score": "1"
        },
        {
            "review_text": "I was 'mirin' the aesthetics for real doe.  I nominated for the 'Best use of a farm animal award'",
            "review_score": "1"
        },
        {
            "review_text": "This game is crazy, As in genuinely insane.  It is a great short (~5 hour) story, absolutely worth playing.  It has great puzzle components that combine elements within the story and excellent use of  conventional sidescrolling and 'block pushing' puzzles to always keep you on your toes.  And the pressure can really be on for some puzzles under duress while enemies lurk in murky waters in the thick of the game.  Envirnments are also super varied, every background as beautiful to look at as the world setting's dystopia is abysmal and dark in tone.  'This is what the edge of your seat was made for.'",
            "review_score": "1"
        },
        {
            "review_text": "Holy crap. This game really is a masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game I have ever played. It´s scary, exciting, difficult enough and the scenery is just beautyful! PLAY THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the mysterious feeling of trying to figure out what was going on the whole time. Loved the environments and art style.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished INSIDE. What a game, once again. Such attention to detail. And the atmosphere. That game is just unbelievably cool. Would recommend to anyone who likes puzzle jump and run and a awesome experience. Just WOW! :D",
            "review_score": "1"
        },
        {
            "review_text": "Probably the most amazing single player game I've ever experienced. It's not long enough, because I didn't want it to end. I pray this team develops more brilliant games.",
            "review_score": "1"
        },
        {
            "review_text": "Inside is my choice for the 'Best Use of A Farm Animal' Award for The Steam Awards. No pig has ever been used half as well as in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game overall.  You play as a boy who is trying to avoid enemies (faceless adults) and make it through a the tricky but usually interesting puzzle screens.   A few areas are frustrating (death mermaid of whatever she's called) - little tricky to get through.   The ending levels are weird but still fun.   The graphics are very nice and promote a creepy atmosphere.   Overall, I recommend it. The game cost $21 Canadian and only lasts 3-4 hours. There is a little bit of replay value since there are orb things you can disarm and you have to search for them. If you get them all, you can get a different ending. I still say it's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Stunning visuals with really great gameplay and storytelling. Also final chapter of the game is simply mindblowing!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzles, art style, tight controls and amazing atmosphere. Apart from Limbo I haven't enjoyed a platformer this much since Another World or Flashback in the 90's",
            "review_score": "1"
        },
        {
            "review_text": "I waited a few years to play this and was hyped since its announcment. If you enjoyed 'Limbo' then this is a must buy. Proper atmosphere, sound and visual design. Puzzles are difficult enough to where you're not going to throw your controller at the screen. You're going to get 5-6 hours of gameplay in your first run. 10/10 will be playing again....and again.",
            "review_score": "1"
        },
        {
            "review_text": "A Truly beautiful and imersive puzzle/horror game that had me on the end of my seat until the very end",
            "review_score": "1"
        },
        {
            "review_text": "I waited a few years to play this and was hyped since its announcment. If you enjoyed 'Limbo' then this is a must buy. Proper atmosphere, sound and visual design. Puzzles are difficult enough to where you're not going to throw your controller at the screen. You're going to get 5-6 hours of gameplay in your first run. 10/10 will be playing again....and again.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and short. Probably the right length. Good art, great style. Great physics. Satisfying but WTF ending. Recomended!",
            "review_score": "1"
        },
        {
            "review_text": "Great art style, some of the best lighting and underwater effects I've seen in a game, excellent puzzle design, and great controls make this one solid gameplay experience, albeit a really messed up one. Limbo was enjoyable but this takes it to a new level. Playdead did an incredible job.",
            "review_score": "1"
        },
        {
            "review_text": "In some way oddly eerie, and intriguing. A piece of art; a game that remains with you once it’s all over. Whether it be the original ending or the alternate, INSIDE creates a strange atmosphere that keeps enticing you to replay and ultimately figure out WHAT THE F*** you’ve just played. Yet, in those few moments during your second or third go – is where you’ll discover INSIDE’s true nature and your interpretation of its beautiful story.  A Highly Recommended game.",
            "review_score": "1"
        },
        {
            "review_text": "Great art style, some of the best lighting and underwater effects I've seen in a game, excellent puzzle design, and great controls make this one solid gameplay experience, albeit a really messed up one. Limbo was enjoyable but this takes it to a new level. Playdead did an incredible job.",
            "review_score": "1"
        },
        {
            "review_text": "Hearing a game through the skull of a real dead person is a first for me; mindblowing when played through a premium audio system. Perfectly paced little gem of a game. Highly recomended.",
            "review_score": "1"
        },
        {
            "review_text": "INSIDE is a hauntingly beautiful and intelligent puzzle platformer.  The story is super satisfying and my only criticism is that there isn't more!  I can see myself revisiting INSIDE over and over.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a huge fan of stories that lack a conclusion (as of now) or make it seem like there is no correct interpretation.  That being said, the atmosphere and themes of this game are so extremely impressive, that it is still under my top 10 best games ever.",
            "review_score": "1"
        },
        {
            "review_text": "Having played this one through with friends watching, it was a fantastic couch controller game. The environment and art style was truely capitavating.",
            "review_score": "1"
        },
        {
            "review_text": "In this game you play as a young boy lost in a dystopian facility. The game is marked by an eerie atmosphere and tense moments. The controls are easy to use and intuitive, allowing you to guide the boy through puzzles and obstacles. Without a single spoken or written word, the story progesses as you make your way through the facility. The true nature of the facility is slowly revealed as you progress, keeping the player in suspense and adding to the mystique before ending in a way that you will never see coming. I highly recommend this game.  Pros: + Fantastic atmosphere + Dystopian setting + Great visuals + Intuitive controls + Puzzles + Tense moments + Music + Checkpoint system + Hidden areas  Cons: - None really ",
            "review_score": "1"
        },
        {
            "review_text": "Cant believe the amazing flow of the game that make us interpret the story by ourself. You guys did very well.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing platform game , worth the money totally.",
            "review_score": "1"
        },
        {
            "review_text": "As many other reviewers have said, it's a pretty short experience, but one that is a great improvement from LIMBO (which I enjoyed as well). The atmosphere is well-drawn, and the plot is fairly engaging though the lack of dialogue and narration leaves much to your imagination. The control scheme was nice. The only negative I can really think of is that there wasn't as much of an emphasis on puzzles this time around. LIMBO had a few that took me at least half an hour to work out. Part of the reason INSIDE seems so short in comparison is that you move forward at a pretty brisk pace. The ending sequence is quite memorable. Not sure I'd recommend at full price, but at any discount it's a good deal.",
            "review_score": "1"
        },
        {
            "review_text": "The creators at playdead must have a sense of what they want in a game, and what they want is for you to figure out the story yourself. Inside is the follow up success of Limbo, both games are fairly similar, however they're locations are wildly different. You play as an unnamed boy (limbo), who's trying to survive the harsh environments (limbo), where you will die in multiple cringeworthy ways (limbo), and will end in such a way that it will have you question your very existence in the shower. I will say the puzzles in this game are a delight and not a test on ones nerves, and the last 20 minutes of this game are incredible. Well done Playdead, well done.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting puzzle game with nice artwork and a strange storyline. It's easy but enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "INSIDE takes what made LIMBO so good and ramps up nearly every aspect of it. The world strikes a perfect balance between being ambiguous enough to leave you to interpret the game as you wish, but concrete enough to get across the point that the developers wanted to. Its extremely dark and atmospheric, but more importantly the world is just fascinating. Every shocking or jaw dropping moment gives you a reason to continue on through the game to find more about the world.  In terms of gameplay, the game is very tightly scripted, meaning there's pretty much only one way to do anything, one way to solve any puzzle or get from point A to point B. This made the puzzles a bit easy, in my opinion. If you were capable of interacting with an object in the world you immediately knew that object would be used in your current puzzle. I didn't really get stumped a whole bunch, as the scale of the puzzles seemed a bit small (most only have 2-3 things you can interact with at a time), and as a result there wasn't as strong of a feeling of accomplishment when solving most of the puzzles.   However, the heavily-scripted aspect of the gameplay allowed the developers to have a tighter control of the player, and seemlessly integrate the gameplay with the world to immerse the player. You don't really have to worry about making a wrong move and ruining the immersion as the game waits for you to correct yourself. This allows many great moments where you are essentially acting out a climactic moment most games would have to deliver in a cutscene. In INSIDE, you are in control during these moments and feel much more tension during these moments then you would in a simple cutscene.  All in all, INSIDE is another game in a string of 'games as art'. It's biggest accomplishments and innovations come through its experience, atmosphere, and artistic direction, as opposed to gameplay (which is solid but nothing to write home about). If you're looking for the atmosphere and experience, INSIDE will blow you away, but if you're looking for a really brilliant puzzle game there are better options on Steam. Personally I really enjoyed my time with INSIDE.  8.6/10",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this more than any other game in 2016. It is a fantastic sureal adventure of an isolated child in a brutally, hostile world. Excellent story-telling and beautifully presented. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely brilliant game. I would highly recommend it to anyone interested in a graphically stunning, side-scrolling, visual story-telling experience.  I was completely engrossed in the story as it unfolded without a line of dialogue, leaving me with many questions and many juicy hints to go back to in the game to form my own theory as to the setting.  The graphics are gorgeous. A darker, moody palette as you can see in the screenshots, with beautiful animations and setpieces. It does a good job of giving you a sense of scale.  The sound design contributes a lot to the atmosphere of the game, and it is top notch.  I still think about this game even though I beat it a few weeks ago. It's no spoiler to say things get quite weird -- and I love it.  This is one of my favorite games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely perfect, as was Limbo. But the polish and stylized detail is on a whole new level!!",
            "review_score": "1"
        },
        {
            "review_text": "ending is still simple than maths  10/10 will play inside, inside again.",
            "review_score": "1"
        },
        {
            "review_text": "This game was able to take the essence of Limbo to an unique level!",
            "review_score": "1"
        },
        {
            "review_text": "Please do yourself and the artistic masterminds behind this game a favor by buying this game. Before I even start this review I need to say after just finishing it (it is short yes) this is one of the best gaming experiences I have ever had. A simply perfect game.   That being said it may not be for everyone.  If you are someone that does not like story based or atmospheric games, and prefer just fps's and story shallow games, you might not like this. If you want to try something new though, this is the game I would tell you to play.  This game suprised me in so many ways, and after playing Limbo 4 or 5 times when it was released, I was convinced Playdead could not outdo themselves when they announced a new project. 6 years (and a few months tardy) later and we have Inside, a masterpiece in so many ways. This game will surprise and disgust and shock you, and you'll love it and hate it for it (not to mention one of the coolest easter eggs ever).  Seriously. Stop reading this and buy the game.              (At least try the demo man, then you'll know why you need to buy it.)",
            "review_score": "1"
        },
        {
            "review_text": "This game, like it's predecessor Limbo, is an experience worth having.",
            "review_score": "1"
        },
        {
            "review_text": "Not worth $20, but I love the game.",
            "review_score": "1"
        },
        {
            "review_text": "A work of art, must play for any Limbo fan.",
            "review_score": "1"
        },
        {
            "review_text": "This game, like it's predecessor Limbo, is an experience worth having.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked LIMBO you're going to like this too, unique graphic style and responsive controls.",
            "review_score": "1"
        },
        {
            "review_text": "I finished the game literally 2 minutes ago. What an incredible experience. Playdead has managed to create a sense of wonder and WTF that i rarely experience in a videogame. Nothing must be spoiled or explained, this MUST be experienced, and it is hands down one of the best gaming experiences i have ever had.  I played it in 4k, highly recommended, looked awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Great game. The developers did everything right from and atmosphere, gameplay, and graphics perspective. I suggest doing a full playthrough in one setting. It should take you about 3 hours",
            "review_score": "1"
        },
        {
            "review_text": "They said it's a masterpiece. They weren't lying. Incredible.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, surreal, and profoundly disturbing.",
            "review_score": "1"
        },
        {
            "review_text": "Great game....... PERFECT",
            "review_score": "1"
        },
        {
            "review_text": "An unbelievably dark and gripping tale. So many small phenomena in the game entranced me as I played. Don't read too much into the game as you need to experience it for yourself. The puzzles were quite challenging, but certainly solvable. I highly recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "The puzzles were very challenging despite having very simple solutions. You will always be able to figure them out on your own with time. The atmopshere this game creates is incredible. Beautiful visuals and sounds. Best played in a dark room with earbuds in.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game as I did with LIMBO. The whole atmosphere, little puzzles to solve is very relaxing. The game ran flawlessly, no bugs, no lag, it just worked like it should. My single complaint is the ending, I thought it was anti-climatic and was totally surprised to see the credits roll at that point.",
            "review_score": "1"
        },
        {
            "review_text": "You really should experience this game just to see how incredibly well a story and its characters could be delivered entirely through the interaction and striking presentation.",
            "review_score": "1"
        }
    ]
}