{
    "app_id": 304410,
    "name": "Hexcells Infinite",
    "release_date": "2014-09-01",
    "developer": [
        "Matthew Brown"
    ],
    "publisher": [
        "Matthew Brown"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Puzzle",
        "Indie",
        "Casual"
    ],
    "achievements": 7,
    "positive_ratings": 1947,
    "negative_ratings": 68,
    "price": 3.99,
    "description": "Hexcells Infinite is the third game in the series of ambient logic puzzle games.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/304410/header.jpg?t=1473001560",
    "minimum_requirements": "OS: Windows XP or later Processor: 2.0Ghz+ Memory: 2 GB RAM Graphics: Shader Model 2.0+ Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This thing is intense and a marked improvement over its predecesor. The packaged puzzles are mind-bendingly difficult. I've played for six hours and I'm only 50% of the way through the game.  However, there's also an 'infinate' mode -- where you can use a random number generator (or today's date) to create a puzzle that is less imposing but still a lot of fun. This adds the replayability that was missing from the first title.  All told: I found it very enjoyable and recommended for anyone who likes Minesweeper, crosswords, and other such puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Hexcells Infinite is a bit like Minesweeper but 100x better.",
            "review_score": "1"
        },
        {
            "review_text": "After 20 hours of gameplay, I have completed the game, made more than 5 levels in the level editor, and won +100 randomly generated levels, and perfected every single level (the other hours are there because someone else is playing on slot 2), all I can say: this game is one of the best puzzle games i've played.  Remember when you thought that Hexcells Plus was hard? Ha, Hexcells Infinite just laughs at that. The puzzles are so well made and most of the time you'll stare at your screen for a good 10 minutes until you see what you have to do for the next step, and often it turns out to be the most simple thing, the game hides its clues very well in the least obvious way possible, so I really recommend playing the first two games before this one to get you ready, but before you do that, i'll let you know, that no matter what, there is no need to guess in all of the Hexcells games at all, so try to think twice before you make your next move!  And now, the new stuff! Randomly generated levels, I find them pretty enjoyable, they are all possible without guessing, which is impressing! The only problem I have with them is that they are kind of 'too easy' compare to Hexcells Infinite levels, but I don't blame the creator for that, they are still very enjoyable to solve.   And the last thing left, the level editor, yes you heard me, a LEVEL EDITOR, everyone likes level editors (Ri.. right??), however, the level editor does not come with the game and needs to be downloaded from the Steam Community, but I didn't really mind that, the level editor also has an auto-solver that tries to solve your puzzles to make sure they are 100% possible without guessing, and I find that neat, the editor is fun to mess around with, and will sure give you a few hours of enjoyment.   And now for my final opinion: Hexcells Infinite is a MUST for any puzzle fan, it's great, fun, and cheap, and has a great replay value because of the randomly generated levels, and the level editor.",
            "review_score": "1"
        },
        {
            "review_text": "A fun and challenging logical puzzle game similar to MineSweeper. Using the numbers to work out which tiles to mark.  The big difference between Hexcells and Minesweeper is that you never need to guess at any point, there's always a way to work out where to click. Also, numbers can be shown on the outside of the grid and show a different symbol with the number to tell you how the tiles you need to mark are laid out.  Unlike Hexcells and Hexcells Plus, Hexcells Infinite has a random level generator in which will allow you to play new puzzles all the time. It's also possible to make your own and share them with others or try theirs out.  If you wish to save a bit of money then I suggest only buying HexCells Infinite due to the fact you can play an 'infinite' amount of levels giving you many more hours of playtime.",
            "review_score": "1"
        },
        {
            "review_text": "  Mine Sweeper x Picross = Hexcells?",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzle game for those who love minesweeper. Infinite mode has enough puzzle to last quite a while, though I wish you could manually choose a puzzle number as opposed to copy-paste.  I'd recommend checking out the other games on this series first though.",
            "review_score": "1"
        },
        {
            "review_text": "This is far and away the best Hexcells. It's like Super Hexagon, in that both have hexagons; whereas Super Hexagon is as fast and twitchy as they come, this is in the same degree slow and deliberate. This is the yang to the yin in that regard, but with hexagons instead of circles.",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Simply the best puzzle game series you're going to find. Hexcells Infinite is the best of the three, but working your way from the first game to the third (with its prize of an unending number of puzzles) brings as much satisfaction as the puzzles themselves. Instead of being repetitive and mind-numbing, the Hexcells games are ones you can relax into and play for hours without tiring of them. Unlike most logic puzzles they maintain difficulty levels and continually present challenges without ever relying on guesswork.  This entire series is a must-have for anyone who enjoys logic puzzles.",
            "review_score": "1"
        },
        {
            "review_text": " Quick Breakdown:  A puzzle game in the vein of Minesweeper, but more complicated. It’s the best of the Hexcells games, and the random level generator on top of the main game’s levels gives it more gameplay.  Length:  4-8 hours (Main game)  Score:  7/10   Full Review:  For those not familiar with the Hexcells series, the gameplay is similar to Minesweeper in that you must determine which cells on the board contain blue hexes, and which are vacant. There are various ways the game indicates which cells contain hexes, and which are vacant.  Vacant cells will often contain a number indicating how many adjacent cells contain hexes (though sometimes they merely contain a question mark). Simply left click to mark a cell as containing a blue hex, and right click to mark it vacant (the game will indicate if you’ve made a mistake).  As you progress through the game more ways to determine which cells contain hexes are introduced. Columns (even diagonals) will contain a number indicating how many blue hexes are in that column. Numbers (for both in vacant cells and columns) will sometimes be encased in curly brackets indicating that the hexes are all connected in a line. Numbers may also be surrounded by a hyphen, indicating that not all the blue hexes are in a line (so there’s at least one break).  Blue hexes may even contain a number, indicating how man blue hexes are in a 2 cell radius.  The main new feature to this game compared to past games in the series is its random level generator. So after you’ve completed the 36 levels in the main game, you have the option to keep playing as many randomly generated levels as you please, giving the game more longevity than past iterations.  The difficulty of Infinite is greater than the first game in the series, but notably less than the second. The difficulty curve is much more natural, and lends itself well to players who are new to the series. Depending on if you’ve played the past games or not, Infinite will probably take you about 4-8 hours to complete the main game.  Hexcells Infinite manages to fix one of my main criticisms towards its predecessors, namely that you may now exit a stage mid-way through and save your progress, allowing you to resume playing later.  Unfortunately, the game doesn’t manage to the other main criticism I’ve leveled at the series. That being to introduce something akin to Picross’ overlay feature, allowing you to map out a potential solution before applying it to the board. This would be especially useful in more difficult stages when you must look at how many different cells and numbers interact together to determine which cells contain hexes, and which cells are vacant.  If you’ve never played Hexcells before, this game is a good one to get. The series pack often goes on sale for under $3 if you want to get all the games. If you only want one game in the series, then it’s best to just get Infinite. It has all the features of the prior games, a reasonable difficulty curve, and the level generator should help keep you busy if you want more stages to complete. If you’ve played the first two games then the decision really comes down to if you want more levels or not. However you choose to go, it’s worth giving Hexcells a chance.",
            "review_score": "1"
        },
        {
            "review_text": "I'm half way through the first part and am realy enjoying the pure logic of it. I get that little blurb of elation whenever I get through one. Nice relaxing distraction from the world kind of game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome logical puzzle game that is similar to sudoku or minesweeper.",
            "review_score": "1"
        }
    ]
}