{
    "app_id": 304460,
    "name": "Qora",
    "release_date": "2014-10-02",
    "developer": [
        "Holden Boyles",
        "Ciprian Stanciu"
    ],
    "publisher": [
        "Curve Digital"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Pixel Graphics"
    ],
    "achievements": 40,
    "positive_ratings": 250,
    "negative_ratings": 113,
    "price": 7.99,
    "description": "A mysterious trip to gorgeous and surreal lands, players explore the unknown and harness mystical powers which have been hidden in the valley for centuries.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/304460/header.jpg?t=1447362058",
    "minimum_requirements": "OS: Windows XP or above Processor: 2.4ghz dual core CPU Memory: 1 GB RAM Graphics: 512 MB, OpenGL 3.2 compatible GPU Storage: 60 MB available space Sound Card: Open AL compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I was a little dubious on whether or not this game was going to be good because of how slow your character moves. But boy did this game deliver. The best I can describe this game as is a interactive movie. Basically you travel into this absolutely stunning journey, and go forth to learn about the secrets the world in this game is hiding from you. What this game makes up for in slow movement is: Eargasmic Music, Gorgeous Pixel Graphics, and a Storyline that makes you want to keep playing. Although some people might dislike the slow movement, whilst your character is ever so carefully travelling throught the level, you cant help yourself but to start admiring the beautiful things happening around you. I strongly advise anyone to buy this game who likes adventure, a story told on it own, and a 'whole new woooorrrllldd'.",
            "review_score": "1"
        },
        {
            "review_text": "Qora is a psychadelic zen pilgrimage, through a far away land. That being said, this game isn't for everyone LOL   ",
            "review_score": "1"
        },
        {
            "review_text": "Qora starts a bit odd, you can't quite catch the purpose of the game.. what you're supposed to do and what's important or just random. You feel the urge to push the story but after 20 to 30 minutes you get going. After that bumpy start it's a lot of nostalgia that sucks you right in.  QORA (formely known as SPIRIT) is a combination of interactive storytelling and a reminiscence to old Atari or C64 gameplay. If you like games like Emily's Away or Gone Home this is another one for you. QORA catches the spirit of LOOM or Another World without giving you the riddles and jump 'n run. It's odd at times and doesn't always take itself serious but then again rocks (in a way like watching the first Ghostbusters movie). It's a bit overpriced for 2,5 hours of gameplay but if you don't mind a walking simulator and enjoy a good story with an abundance of retro nostalgia let the game and it's great soundtrack suck you right into it's magic.",
            "review_score": "1"
        },
        {
            "review_text": "What a neat little game. I played this is one sitting, just now realizing it saves on each screen. In any case, This game has beautiful artwork and an excellent little soundtrack. My only complaint would be the font type, but it doesn't hinder my experience in any way.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing graphics and sounds, story is cryptic but engaging.  There are some repetitive and annoying parts such as cutting the grass and climbing the slopes but overall its a great game. Get it now for 20% off and its more than worth the £6.          YouTube™ Video:  Qora - first 15 minutes&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game, too bad the story line is a bit funky.",
            "review_score": "1"
        },
        {
            "review_text": "A unique, mysterious and intriging experience.         YouTube™ Video:  ➜ A Quick Look @ 'Qora'&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "If you're hoping for an action packed platformer or thought that Gone Home was just a walking simulator then Qora is probably not for you. However, approached with an open mind and a couple of hours spare Qora can be a rewarding and entertaining journey through some of the most interesting and beautiful pixel-art locations in indie gaming at the moment.",
            "review_score": "1"
        },
        {
            "review_text": "As long as you understand that this isn't going to be about action or puzzles, or even the challenge, but about enjoying yourself and exploring the game world with its breathtakingly pretty graphics in a cool style, fitting and atmospheric music, cute story and subtle humour, you'll love this little gem!",
            "review_score": "1"
        },
        {
            "review_text": "It looks great, sounds great, the dialog is funny in an odd way. I don't know if you could actually call it a game, more like a demonstration of how to combine beautiful pixels and good music to make something akin to interactive retro digital performance art. As long as you go in understanding it's not really a game, it's a fun way to spend an hour or two.",
            "review_score": "1"
        },
        {
            "review_text": "Overall this was a good game. It was a nice little adventure and was very entertaining, but it was very tedious and there wasnt any action. If you are looking for a fun fighting game then go look at some other game.",
            "review_score": "1"
        },
        {
            "review_text": "While this game may be a little slow at times, it makes up for it with its beautiful landscapes and story.",
            "review_score": "1"
        },
        {
            "review_text": "DISCLAIMER: This is the opinion of someone who recieved the game for free. This is a very cautious recommendation and I would definitely not recommend this at full price.   Qora is not a fun game to play but rather in my humble opinion presents a compelling enough world to keep exploring.  Qora is very much just a 2d walking sim in terms of gameplay (much of the game is just pushing 'space', 'up', and 'right'). Do not get this game if you are out for a game with any deep mechanics. Then what about the audience that enjoys games like the Stanley Parable and The Beginner's Guide? As someone who can accept a sacrifice in mechanical complexity for a casual but engaging world and story, to me Qora was an enjoyable experience. The aesthetic and chiptune music fit my tastes but if they don't fit yours then this game is probably not the game for you.   Qora started off actually pretty boring until about 5-10 minutes in (this is a short game, max 1-2 hours for 1 playthrough) when the happenings within the game actually started to become interesting. The bulk of the game has you exploring extremely varied and nicely put together locations as you try to piece together the past of the land. Depending on your actions there are actually multiple endings for some replaybility.  Overall I can safely say that I did infact enjoy my time with Qora but for the usual asking price of 10 USD I cannot recommend it. On sale however, if you are the person who doesn't mind casual failure state free experiences which are essentially more movie than game, then yes this game is worth checking out.  Lastly it has cards and very easy to obtain achievements :P",
            "review_score": "1"
        },
        {
            "review_text": "  Qora is a beautiful, beautiful game. Its in a retro pixel graphics style, but it really is beautifully detailed, with amazing music to match. Sadly, the actual gameplay will be lackluster to most, as its primarily just walking from one side of the screen to the other. The thing about Qora, is that I think its less about action, and more about the journey. Regardless, I had a blast just taking in the beautiful scenery, music, and detail.  Pro's: Beautiful graphics, for what it is 'Little things' going on in the background, such as a deer running away when you get close, or birds moving Humorous Great soundtrack A great game to take a break from more 'ACTION! ALL THE TIME!' oriented titles  Con's: Both endings were let downs for me Walking simulator Some of the humor seems forced, or takes away from the tone of the game Story leaves almost every question unanswered Sometimes your character blends in to the background",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game, around 2 hours to beat, and has that old vibe to it, definently recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Man I wanted to love this game. The art and the sounds are obvious labors of love. The writing is gentle, whimsical and poignant. If this were an indepedent, fantasy movie, I'd watch it. That said, to echo other commenters, it's so barely interactive that it really didn't feel like a game. I had to stop as I just didn't feel like I had any agency. I also got the strongest impression that what mechanics exist (i.e. machete a few bits of brush / rock out of the way) were there to deliberatly slow play down and force the player to drink in each scene. Though I understand the appeal of really slowing down and acting mindfully when presented with this kind of experience, the pacing felt labored in the extreme. I guess I just don't want to stroll slowly through an oil painting, no matter how beautiful (and Qora is deeply beautiful on multiple levels).",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely slow... art gallery.",
            "review_score": "-1"
        },
        {
            "review_text": "This isn't a game. It's just a long, pretentious, overpixelated walk with a ton of obvious intentional busywork thrown in.  AND WHY DOES THE WHOLE THING HAVE TO STOP EVERY TIME A BIRD FLIES BY?!",
            "review_score": "-1"
        },
        {
            "review_text": "This game cost me two pounds due to a steam coupon, and yet I still feel ripped off. The gameplay is practically nonexistant, with the pace of the game being so slow that to cross a single screen can literally drain you of the will to live. There are no puzzles, no story to speak of, and whilst the art is nice, there are basically 4 zones, each filled with the same uninteresting repeated assets.   Unless you enjoy having gameplay frozen every other scene to watch some seagulls fly overhead s-l-o-w-l-y, I would not recommend this game...",
            "review_score": "-1"
        },
        {
            "review_text": "Boring, longwinded pseudo-interactive pixel-art movie with a shallow story without original ideas and using tiring humour when stuck in a dead-end street with their own narrative. On the upside it has a very mediocre artstyle.",
            "review_score": "-1"
        },
        {
            "review_text": "So many bugs in achievements, can't sprint, and if you miss a single shrine to light on your second run, you are screwed.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was cute but ultimately entirely too tedious to warrant anything more than a single playthrough.   You move extremely slow and the game sometimes forces you to backtrack between large landscapes. Not to mention it's very easy to miss crutial requirements to some achievements... which forces you to replay the entire game at that snail pace.",
            "review_score": "-1"
        }
    ]
}