{
    "app_id": 304580,
    "name": "CITYCONOMY: Service for your City",
    "release_date": "2015-12-02",
    "developer": [
        "Nano Games sp. z o.o."
    ],
    "publisher": [
        "astragon Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Casual",
        "Management"
    ],
    "achievements": 25,
    "positive_ratings": 119,
    "negative_ratings": 170,
    "price": 17.99,
    "description": "Time to clean up! Assume the many jobs of a service company and take care of a vibrant metropolis in the open-world city economy simulation CITYCONOMY.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/304580/header.jpg?t=1540300987",
    "minimum_requirements": "OS: Windows 7, 8, 10, 64-Bit Processor: Dual-core Intel Core 2 Duo or Athlon 64 X2 processor with at least 2.4 GHz Memory: 4 GB RAM Graphics: DirectX 11-compatible graphics card (NVIDIA GeForce 4xx or AMD Radeon HD 57xx and better) with at least 1 GB VRAM DirectX: Version 11 Network: Broadband Internet connection Storage: 3,5 GB available space Additional Notes: 32-bit operating systems are not supported",
    "recommended_requirements": "OS: Windows 7, 8, 10, 64-Bit Processor: Quad-core Intel Core i7 processor with 3.6 GHz or better Memory: 6 GB RAM Graphics: DirectX 11-compatible graphics card (NVIDIA GeForce GTX 780 or better) DirectX: Version 11 Network: Broadband Internet connection Storage: 3,5 GB available space Additional Notes: 32-bit operating systems are not supported",
    "reviews": [
        {
            "review_text": "One of the few things I did enjoy was the details of the trucks you play, but otherwise this game feels like an unpolished version of itself. It can see alot of improvements in graphics, modeling, multiplayer section, jobs and last, but not least, physics.   On the pro side",
            "review_score": "-1"
        },
        {
            "review_text": "never get this game. It is laggy and always crashes ",
            "review_score": "-1"
        },
        {
            "review_text": "game keeps freezing and controls suck",
            "review_score": "-1"
        },
        {
            "review_text": "its a bad game because you spend $24 on it and it says The GPU doesnt meet the minimum requiments",
            "review_score": "-1"
        },
        {
            "review_text": "i like the game very much it like 5 sim in 1 games",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Dont know why more people are not jumping on a game like this. Wish there was even more to do for the town. But with low sales. Just glad the game works. Keep it up.",
            "review_score": "1"
        }
    ]
}