{
    "app_id": 304650,
    "name": "SUNLESS SEA",
    "release_date": "2015-02-06",
    "developer": [
        "Failbetter Games"
    ],
    "publisher": [
        "Failbetter Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Exploration",
        "Survival",
        "Lovecraftian"
    ],
    "achievements": 54,
    "positive_ratings": 5331,
    "negative_ratings": 1103,
    "price": 13.99,
    "description": "LOSE YOUR MIND. EAT YOUR CREW. DIE. Take the helm of your steamship and set sail for the unknown! Sunless Sea is a game of discovery, loneliness and frequent death, set in the award-winning Victorian Gothic universe of Fallen London.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/304650/header.jpg?t=1555517572",
    "minimum_requirements": "OS: Windows XP or later Processor: 2Ghz or better Memory: 1 GB RAM Graphics: 1280x768 minimum resolution, DirectX 9.0c compatible graphics card DirectX: Version 9.0c Storage: 700 MB available space Sound Card: DirectX 9.0c compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The Pirates laughed. They laughed as they sunk my ship. None but I were alive on that ship. I sunk into the depths for the second time. That is when I swore that I would have my vengeance. I was no longer Promthelius - a dapper chap of Fallen London. I was Ahab - and this game; my great white whale.  I started from scrap. I had nothing but a ship and a gun. I started trading Sphinxstones. I brought them to London for a nominal fee. It was not living, but surviving. Pirates swarmed my trade-route. I tried to avoid them for a time, but my ship would not take me further with the holes in it's hull. It slowed to a crawl, and five Pirate-ships sank me with an impressive display of teamwork for a bunch of thieves. I heard the laughter as I sank into those obsidian depths below. Was this how it ended? Was this how Ahab would be remembered?  No.  I would not succumb there. I was Ahab. I was the reckoning of Promthelius. I was two generations of seething disdain for this world, and all that inhabited it.  I started again. I threw caution to the wind, and traded wildly. With naught but two hundered echoes and two barrels of fuel, I found the Salt Lions. I once more started trading in sphinxstones. Pirates swarmed, but I mostly avoided them. They laughted, jeering and taunting me. Was I a Coward? Perhaps.  I traded sphinxstones until the Salt Lions ran out. And thus began one year of sunshine. I traded empty boxes of mirrors in the city of Khan's Shadow, and captured the sunshine from the Neath in droves as I emerged there from the Cumaean canal. Three boxes turned into six. Six turned into sixteen. I bought a new ship - a trading vessel with one hundered and twenty units of cargo-space. My Empire of sunshine on that opaque expanse.  My plan was not without fault. Pirates tried and failed to sink me. I faced much danger upon those waters. Men and women so uncouth and guileful that they should like to rob me were swarming those waters. But with purpose, I sank or avoided all that followed.  In the end, ninety boxes of sunshine at each time was delivered to the Isle of Cats. I netted tidy sums of money. The Isle of Cats was a sun upon my obsidian empire. But the age of sun could not last. My last run ended in roaring success. Sixty thousand echoes filled my vault.  Once back in London, I had only one purpose. With my money, I bought an Eschatologue-class Dreadnaught, and all the battle-gear that Fallen London had to offer. It was expensive, but vengeance is a dish best served with overwhelming firepower.  And through my cannons, upon the deck of that Dreadnaught, my justice had finally come. I ended the reign of Pirates in a single day. Unfinished revolutionaries, Pirate Steamers, Republic Dreadnaughts and Glorious Dreadnaughts. It made no difference. All were sunk. All plunged to the depths under the sound of my cannons. Some say that they can still hear me laughing. There are no Pirates upon these waters, Friends. Only death.  I am Ahab. And I have taken my great white whale. My vengeance is complete.",
            "review_score": "1"
        },
        {
            "review_text": "This game has amazing mood. It's got great writing. The idea of trawling a black, underground ocean is compelling and fascinating. But I can't recommend it. Why?  The actual gameplay is boring, repetitive, and simple. You will be doing the same routes repeatedly for tiny profit margins for hours until you can afford the most minor of upgrades. I have to impress the hours part. Unless you look at the wiki for money exploits, you will spend literally hours trawling back and forth in a very slow ship. You won't be in a ton of danger unless you didn't buy enough food or fuel.  In short, if you've been tempted in by comparisons to FTL, turn around now. This game is not a fast paced roguelike ship sim like FTL. If I had to compare it to any game, I'd probably pick Ambrosia's Escape Velocity (1996), which had a similar slow burn price for entry.  Anyway, if you heard all that and you still want in: welcome to the club, it's moody and interesting. I just feel like players entering this game are being done a disservice by comparisons to other roguelikes, like FTL, when it is nothing of the sort.",
            "review_score": "-1"
        },
        {
            "review_text": "I know exactly why I love this game, and it mostly just boils down to stoking imagination. If I had to take a step back and think about the bigger picture, I would attribute that success to these qualities:  Text placed along single pictures that barely represent a person or place, letting our minds fill in the rest Areas with names but no descriptions (essentially places with no point but infinite possibility) Choose your own adventure style questions with no backsies, many posed through actual dialogue No main story, everything is tertiary and yet also essential An in-game presence so that each journey still feels substantial, weighted appropriately by time and risk  I have never been so smitten with a game, and if the above traits are not enough to make that point, consider that it also manages to blend meaningfully rich text with brilliantly haunting music in a setting that oozes inspiration. Give the game time to sink into your bones. It's worth it! ",
            "review_score": "1"
        },
        {
            "review_text": "Sunless sea is a gorgeous and story rich game, but unfortunately that is all it has going for it. Combat is very basic and rare in the game. The game relies more around discovery and resource management, which is initially fun, but then you die. Once you die only a bit of progress from your previous game carries over. This results in a repetitive feel after your first life at zee. The zee is truely gorgeous, but loses its excitement after rediscovering the same islands and ports every playthrough. It all turns in to a big grind after a while. If you want a better ship expect to wait hours sometimes days. This aspect of the game then conflicts with the lore. It takes me several generations to afford anything cool, and by that point I have read the same stories several times and am just mindlessly clicking most of the time.",
            "review_score": "-1"
        },
        {
            "review_text": "- Oh look a shiny crab. How cute is that! *dies*  - What are those, bats?  *dies*  - Accepted a poor traveler. Day 1: cool, he´s really hard working. Day 2: I guess, for the sake of religious diversity, I should let him keep that salt shrine. Day 3: a zailor suicides. Day 4: Mutiny.  *dies*  - Runs out of fuel after crossing entire zee right before being able to reach London´s dock. Also no echo to pay for someone to haul me in. *dies*  - Agrees to take a dozen of tomb-colonist too early on in the game. Those bummers steal all the food.  *dies*  - Mother of crabs! Humongous mother of crabs! Better turn off the lights and stay out of her way. Why is she following me?  *dies*  - Used up all the mob´s money for something really cool. Unfortunately, mob doesn't agree  *dies*  - Let my office train my zee captain. Gets hurt. Something I cant recall happens. Gets hurt again.  *dies*  (update 01/08/2016 - new ways to die)  - The bottom of the sea just blinked at me. Zailors go crazy. *dies*  - Packed up two dozens of candles to explore ruins. Apparentely number of candles is not enough.  *dies*  - Sun smuggling business is awesome. And beautiful. So pretty.  *dies*  - A small island hunted the battered ship down. Fortunately, we´re quicker. Unfortunately, it has ranged attack. *dies*  I started to name captains with numbers to help me keep track of my unwilling serial killing of them visible in the upper right corner of the screen.  20/10 would serial kill them again.",
            "review_score": "1"
        },
        {
            "review_text": "I found the overall visual design effective at evoking an eerie mood. The choice of muted greens and grays works to make the rays of lights (whether cast by your ship or emitted from various lighthouses) pop. Cruising in the dark of the Sunless Sea builds a sense of dread and mystery which is appropriate to the theme of the game.  Furthermore, the music, while infrequent, punctuates the mood and builds tension. The spare sound effects, the lapping of the water and the distant ringing of buoys create a soundscape on which your journey unfolds.  Much of the game takes place in a text window that is inexplicably tiny and stuck to the bottom of the screen. The prose comes in relatively short and disgestible tid-bits, so while much of the game is reading the stories you come across in your voyage, I didn't feel overwhelmed with a wall (or in this case a yard sign) of text at any point.  The stories themselves are full of mishmashed details and themes, making them far more colorful and dynamic than the graphics of the Sea itself. To me, the highpoint of the game was in unravelling these stories, bringing in various objects discovered along the way to open up new options. Leaving port and returning after a brief delay will advance the stories, so in this way, one can plan a route to satisfy different story requirements and continue to push back the fog of unexplored areas.  The game describes itself as a Rogue-like, which is partly true, in that some of the islands appear in different locations on each playthrough and there are some that may not be present at all. However, the area around London (the starting port) is always the same and this expanse of sameness can make the Rogue-like description seem like a fib. Death is easy when first learning the game, as it is in many Rogue-likes, so sailing through the same staring area again and again becomes tedious.  This leads to the first of my two major objections to the game, each shortcoming reinforcing the other.  1) Travel is at a decidedly deliberate pace. While this initially worked to make me savor exploration, as well as building a sense of anticipation or dread as I advanced through a game, the thought of sailing past the same islands that I'd already been to several times in hopes of discovering something new seemed more like a chore and less like fun.  Before I stopped playing the game altogether, I'd plan out a route and make a loop, visiting some familiar places for resources or to advance a story and (hopefully) uncovering something new on the map. When I'd first began playing, I'd make three or four of these voyages before logging off (Assuming I didn't die). But the thought of just sitting for several minutes at a time, waiting for something to happen made me think I'd be better served quitting and loading up something faster paced after a few play sessions like this.  Until you've figured out combat (my second objection), it is very easy to wind up dead and have to restart and travel laboriously through regions that are largely unchanged from one game to the next. This makes for far too much travel time for my taste.  2) Combat is horrible.  Okay, I'll write a little more on this.  The various monsters and pirate ships are imaginatively and effectively rendered in the game. Many of them, however, have a ridiculous number of hit points compared to the damage of any weapon that you will acquire before half the map is explored. That's a lot of traveling and, hence, a lot of game time.  To make things worse, the sound effects of the cannons are repetitious and obnoxious. When you're fighting a Lifeberg (an enemy that is easily encountered on your first voyage) that has 400 hit points and you're doing 15-20 every shot... not only does the same cannon fire sound grate on the ears, but the combat itself becomes a grind.  While there are a very few enemies that seem to be balanced around your starting equipment, it is easy to run into foes that are far stronger. When you add in the very slow rate of resource accrual, it's not hard to wind up behind the firepower curve. When first playing, this can result in many deaths, which equal restarts, which means more tediously slow sailing through regions you know by heart.  Of course, you can avoid most of the fights, but giving foes wide, languid births results in, wait-for-it, even more monotonous, paint-drying travel.  The foes do, however, break into two types, ones that fires cannon blasts and the other being monsters that simply charge at you. Both of these types can be easily defeated by simply getting right behind them and staying there, shooting and shooting and shooting and... well, you get the point.  Some may describe this sticking to the rear of foes as strategy, but this works with just about everything, is boring and feels like an exploit. However, when stuck with limited resources (food and fuel) and poor weapons, this may be the only choice available.  I really wanted to like Sunless Sea. I hung in because I liked the imaginatively written stories, the murky graphics and the moody sounds, but the molasses slow travel and the totally broken combat forced me to abandon ship. Maybe if this game had spent a little more time in drydock, having it's combat system scrapped altogether or entirely rebuilt and travel sped up above senior citizen meandering, then I'd probably be playing the thing rather than writing this disappointed review.",
            "review_score": "-1"
        },
        {
            "review_text": "H.P. Lovecraft's wet dream, in video game format.",
            "review_score": "1"
        },
        {
            "review_text": "It's quite difficult at the beginning to plundge into this game. You will probably find yourself revolving around, trying to figure out wth are you suppose to do, scrounging for fuel and supplies. However, once you've reached a certain point in game, when you actually know what to do, the real game starts. I honestly can't remember when was the last time I've spent 5 hours in a single game session. I even started making my own notes about where I can buy specific wares, at which port. I do realise tho, that there are easier ways to do this, but where's the fun in that?  Nevertheless, its a cruel world out there. The game expects you to die. I mean literally, it wants you dead, and you know its true when you realise that most of the achievements refers to dying. There are various ways to die in this game, it can be an awfull contingency that can jeopardize the whole game, or some creature that will one-shot you from a distance. If you thought dying in dark souls is the worst thing that can happen, you are clearly a landlubber. In here, you can easily lose hours of gameplay in a single slip up, which forces you to stay sharp the whole time. Of course there are ways to ease your death with heritage system and stuff like that, but you will always suffer some loss.  Overall, I highly recommend this game for everyone who digs that kind of climate, or just seek for a well-written rpg.",
            "review_score": "1"
        },
        {
            "review_text": "An intriguing game that ultimately disappoints.  Let's get this out of the way: Failbetter do great writing. The setting is a lot of fun and well presented; the flavour text is witty; the dialogue is pithy. This will be enough to carry many folks through the entire game. Sadly, it was not enough for me.  Because everything else is massively tedious. The combat is really weak, a matter of gaming the terrible AI (enemy ships can't fire behind them, and they don't know how to go into reverse...just get behind them and blast away) and not much else. If you want to get anything done the game expects you to grind like crazy, because every quest seems to use large amounts of rare items.  And finally, although the writing IS excellent, it suffers from a bizarre flaw: let's say you built up your relationship with a certain officer enough to steal the secrets of the Masters of the Bazaar themselves, and you used this forbidden knowledge to build an arcane engine. Later you retire. The next captain will be offered the opportunity to do the exact same things! Almost all interactions reset from captain to captain, so you'll meet the same characters, do the same (grindy) quests for them, go the same islands to fight the same wars...  There's good prose here, if you can get to it. But seventeen hours in, I can't face any more of the repetitive grind.",
            "review_score": "-1"
        },
        {
            "review_text": "I really like the grim worldbuilding in this. It extends the fun and memorable world of Failbetter Games' browser game Fallen London, and that's what brought me here in the first place.  That said, I really wish this was turn-based. This game's setting is lethal no matter what, but it's a lot more lethal if realtime combat isn't your thing. And with that lethality in mind, I think the game's opening would benefit from some streamlining so that you can set sail again more quickly after a captain dies. As is, there's a lot of fixed, routine stuff to click on before you get going again, and that loses its novelty after your second run. A one-click randomized character generator would help, but even after character creation, there are a few repetitive tasks to complete before departing.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent story telling, and you begin utterly rubbish at staying alive but soon learn how to keep yourself and your crew from going utterly mad and eating one another. It is always a tight thing to survive and earn enough by gathering intelligence, and it is so atmospheric travelling around sunken london. The sound track is also brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "This is easily the best Lovecraftian 3rd person steamboat-'em-up in history. If you brought Edgar Allen Poe forward in time, cheered him up a bit, and taught him how to make videogames, and he had somehow become British and acquired a deadpan sense of humor, you'd get this game. I've been part of the backer beta, and I've loved it. Just be aware of what you're getting into:    A living novel.  This is not a magazine or Twitter, something you read for 15 minutes and toss aside. You create your hero and then send him/her/it through a novel. And then you send that protagonist's heir, and the heir's heir. The locations, dangers, and other characters stay the same (though shifting in place &amp; time), but the story adapts to your hero's decisions and skills. Even if you played a 'perfect' game, you would see only a fraction of the 250,000 words.    A survival adventure , not a trading simulator or combat game. You're going to spend your first captains' lives figuring out how to deal with the uncertainties of the sea in a fragile ship with limited space for fuel, food, and cargo. Don't waste your time trying to trade your way to wealth or attacking even medium-level enemies. Sneak your way from port to port, expand your map, accept some quests, and bring back reports and intelligence to the powers in Fallen London.    An (a)morality simulator.  Once you've acquired a better gun, engine, and ship, and you've hired a slate of officers, you can stop worrying about moment-to-moment survival. That's when your stated goal, to secure your own posterity (through wealth or adventure or finding your father), starts competing with your hero's moral sense. There is an island with bees that make the most delicious honey from the minds of innocent victims. You can make so much money if you just kidnap a random stranger, and perhaps sacrifice a couple of crew ... and moreover, if you don't, you cut yourself off from quite a bit of content. Maybe your street urchin heroine will sail away at the first hint of human cost ... and maybe her son, the fallen priest, will give into his curiosity. There are dozens of decisions, large and small, and so many stories that emerge from them; and your character can gradually influence the fates of factions and nations.    A community.  I submitted a lot of bugs to Sunless Sea during the beta, some of them more opinion than bug, and every one of them was addressed. In the course of Early Access, the makers completely redesigned a near-complete feature of the game (the combat) from scratch, because their players told them it had to change. They've added sooo much content, especially over the past few weeks, and there is still major content coming. The forums are very active, and the main dev often responds directly to questions and suggestions. The game is also a companion piece to their free browser game, Fallen London: same lore and voice, very different narrative and mechanics. There's just so much depth here.  To sum up, be ready for a very different game. Look beyond min/maxing and super-strategizing to win. Don't beat the game -- play your captain, and read the novel, and you should have a wonderful time.  ",
            "review_score": "1"
        },
        {
            "review_text": "Do your first playthrough without Googling things. You may not live long, but it will be one hell of an experience.",
            "review_score": "1"
        },
        {
            "review_text": "Don't trust preview videos. Most of your time you will reading instead of battling and sailing. It's more like 'choose your own adventure' book. That's why the font should be bigger. Don't even try to play it on small sized notebook. The game is awesome, and I really want to play it, but it's impossible to read tremendous amount of very peculiar text written with somewhat dark gray on light brown, if I may say so. I lost my mind already without eating my crew. My eyes are burning. Must stop playing it. Moreover Sunless Sea consumes CPU power like top AAA game even if it waits for just mouse click in story mode. And I thought that they generate new map every time. I was so wrong. It's always the same. At last but not least: they say if I am true gamer then I should play it in permadeath mode. I'm I true gamer? I prefer to think so. But it means NO to Sunless Sea.",
            "review_score": "-1"
        },
        {
            "review_text": "Listen: the water slaps against the ship. Look: the lights of home fade into the darkness.  The darkness encloses you in infinite possibilities. Some slumber beneath the water. Some, more worryingly, wake. But the ship sails on.  Sunless Sea isn't quite about exploration, nor is it entirely about combat. It seems to be about a certain mood--something wistful, melancholy, and beautiful all at once. There are wonders out here, yes, but the warmth of home is far away. It's one of the most atmospheric games I've ever played, and can in the space of a few hours be horrifying, beautiful, heartbreaking, and surprisingly funny.  It's also immensely difficult. You will die. A lot. And though you can carry over certain things between characters with a Legacies (you get at least one, and can earn more), it's still possible to LOSE a legacy. But these deaths give the game a lot more weight. You find yourself connecting with your characters and your randomized world more, and you can pick different choices in a second--or third--or fourth--playthrough.  While the game is a lot more balanced in favor of the player than it was a few months ago (thank God), be aware that it'll still probably be tweaked a bit more over the course of 2015.  TL;DR: get the thing. Also, stock up on food and fuel. Being alone at sea in a ship that can't move, with a crew that can't eat...well, goodness. You would be in quite the pickle, wouldn't you? Or perhaps you'd just be pickled...",
            "review_score": "1"
        },
        {
            "review_text": "If only there were a 'So-so' button for recomendations.  Game's decent, it's not about combat or exploration but about resource managment, don't make the mistake of thinking otherwise. It's long, tedious, and drawn out, maddeningly so. In fact, I'll say it now, be prepared to spend hours doing little more than watching your ship crawl, painfully so, across the map to get from point a to b, with no distractions in between. I actually pulled out my gamboy and started playing paperboy while sailing around. That being said tho, I do consider it a decent game, just be prepared to waste a good 20-40 hours of your life learning how to play it properly.  The object of the game is basicly to live out a life and achieve the personal objectives of your character then die, and repeat. Every time you do so maps are randomized leaving to explore and find the same old ♥♥♥♥ all over again, and possibly, most likely, die in the process. Either due a lack of resources while out at sea, or random occurances which affect your recources and cripple you, and while there is combat, it's nearly impossible to kill anything without upgrading your ship drastically. The big issue with it is, sadly, a lack of resources.  Did I mention this is a resource managment game? So much so that earning money is an extremely difficult and tedious process. Any money which is earned is then spent on fuel and supplies. There are upgrades, better ships, weapons, and other crap of which I shall label 'gear', but generally speaking these things are so expensive, and so much of your money is, spent isn't the word I want to use here, exhausted, a very accurate word in this case, on supplies, that it's nearly impossible to scrounge up enough for a better ship. In fact, after doing some digging in this game's steam forums I've found out that the developers have taken it upon themselves to nerf any and all forms of semi-lucrative actions to the ground. That being said, the game does seem to be designed to be beaten in the starter ship, with starter gear. So, there's that I suppose.  I will say the game has a decent story, what little I've seen of it, and an interesting, immersive, and rather charming world. That being said tho, it's eaten over 30 hours of my life, and I've gotten no where with it. So, it was fun while it lasted but, I can tell you that charm can only go so far, and I rather regret the time, energy, and money I put into this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great game, but you're gonna have to do a lot of reading",
            "review_score": "1"
        },
        {
            "review_text": "Ran out of food. Was devoured by crew. 10/10..   A clever, witty roguelike, set in Victorian era London, if London had sunk to the bottom of the zee. Somewhere between HP Lovecraft, Charles Dickins and Herman Melville, Sunless Sea tells, or rather lets you tell a compelling story of terror, sea faring, intrigue and humour.   Death is a constant companion, watching as you fumble around in the dark waters, waiting for you to run out of food or fuell. or perhaps to get eaten by one of the giant creature roaming the stygian wastes.   While the game can be punishing, the rewards are worth the risk. The longer you spend in this game, the more you get out.. Further, the story can and does change on each successive playthrough.   I honestly dont have enough good things to say about Sunless Sea.",
            "review_score": "1"
        },
        {
            "review_text": "A dark, sunless exploration of a wacky world of exploration Victorian gothic horror. I like it. It suffers from pacing issues. I.e., much of the game you are traveling from point A to B to C without much happening in between. However, the random events and resource management necessary to survive generally lend a welcome tension.  I play because I want to reach an ending. This is good. I hope my ending doesn't involve my captain's demise... but it likely will. Alas.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and as relaxing or as intense as you make it. 8&gt; Wonderful stories and writing, very cool maps and creatures. Sentient mobile aggressive mountains.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a ton of reading. In fact, that's the huge draw here. The lore is great. Simply fantastic.  At first it seems a bit silly. But then you read, and visit other places, talk to people... and it all kinda adds up to an interesting and perhaps dark (but humorous) world that draws you in making you want to find out more. I've spent most of my time reading in ports/towns seeing what each is about through my actions like making a port report which upon handing in gets you (usually) a fuel and some echos (money), or engaging in some of whatever the town is known for. I feel bad I can't adequately describe the tone of the game, so I'll have to say I enjoy the writing. It's very well written, it's orignal, and uses words I really must look up.  The rest of my time is spent sailing from one place to another, exploring to find new places, and usually trying to avoid battles. Repairing your ship is expensive, so you'll usually want to avoid taking on most other ships or monsters you come across. Battles are definitely not the focus of this game and the progession, or lack thereof, of your ship and its parts (engines, weapons, different ships) is the weakest part of the game.  There are other ships to buy, but they all seem worse than your starting ship and/or are vastly too expensive to buy. Weapons have 3 places you can equip them, Deck, Forward, and Aft, but the starting ship may only equip a Deck weapon of which there are only a few and they aren't really that big of an upgrade for their high price. Engines as well are expensive, and some do have a big upgrade to speed, but it again seems disproportionate to the price.  Most of my echos (money) go toward 'supplies' (a specific item used as food mainly, but you may also use them to repair your ship a handfull of points out of town if you have above 50% hull left) and 'fuel' to keep going. Perhaps it's just that I don't know how to abuse the game yet. Buying the 'Elegant Townhouse' for 1,000 echos allows you to make a will for 200 echos passing along your house and later, I'm told, some other usefull items I haven't gained.  Upon retiring (you can do this after buying the house if you want) or dying I've been choosing the carry-over option of passing my captains chart to the next one so I know where everything is still and so the map doesn't semi-randomize. Other options include passing an officer, a weapon, half your echos, and another one I forget at the moment. You always choose between one of those five things to pass along to the next captain even if you don't have the house or will. (I'm pretty sure this is true since one of my captains didn't have a will yet and died but I still got to choose)  I also have some gripes with the journal being difficult to find what you're supposed to do for a quest if it even has anything in there about what you're supposed to do. I'm either going to have to grab a pencil and paper and write stuff down or just deal with being confused and not finishing quests and missing opportunities to gather what I need when I'm someplace that has it.  I've written more about the negatives than the positive, and I have a few other small gripes not written, but I definitely do recommend this game based on its great strength in story and the feeling of apprehension when you leave a port and start travelling, wondering what you'll discover next and if you'll have enough fuel and supplies to make it back to Fallen London. If you enjoy reading and becoming drawn into a world, this game will have you for hours through different captains wanting to see the various choices/events to do further.  I bought this for just under $13 (a -33% off sale) and I feel that's exactly the right price for me.",
            "review_score": "1"
        },
        {
            "review_text": "Take heed: if you prefer your nights peaceful, you might want to think twice about purchasing this game. THE ZEE WILL HAUNT YOU. You might lose sleep from the vivid images of terror the stories of the zee will bring--of walls of knives and ungodly feasts and the vicarious fear of both the total absence and a too-easy excess of light--but what will stick with you most as you try to fall asleep is the question: have I done the right thing?   This is a game of immersion and perspective. You will know what it means to feel helpless in your power over another's fate. You will question your loyalties. You will sell your soul--or somebody else's--for a faster engine. You will have to find... something to eat... after your rations run out and you're nowhere near any port that sells food. You will consider genocide. You will witness terrible rituals of death and find yourself saying, 'That kind of makes sense.'   And then after you close the game, after the pretty art and music and the even prettier words are gone, you will ask yourself: how much of the Captain was really me? And you will lay the Unterzee right next to the real world, look at them both and wonder: how much different, really, are their moral shades of grey from each other?   Some more practical things to think about before playing this game: the stories are great, but you will have to do a ton of reading, and if that isn't your thing, you will get very bored. There are no real tutorials, and you will have a hard time understanding how to go about in the beginning. The choices can also get confusing as some are permanent, while others may be revisited. A tip: if the Gazeteer tabs are greyed out while you are being presented with choices, then the 'Go' button will require you to make a more or less permanent decision.   While this is not exactly an action game, you will need to be very careful as you steer your ship, and it will require 100% of your attention and quick reflexes. It's a good counterbalance to what some might consider the 'walls of text' aspect of the game.   The music is beautiful and really drives up the tension: hearty and upbeat, sinister and eerie, exotic or trippy. It complements the Lovecraftian artstyle perfectly, and both create an atmosphere that will keep you in the Unterzee for hours (that's another thing: this is a game where you will have to invest long stretches of time at a time to be enjoyable).   One thing that I feel might be lacking is a way to keep notes in-game. There are a lot of stories to keep track of at any given time, and the Journal is a lot of times not sufficient in helping you remember story and area details.   So... will you wither from the weight of your questions or, like one from Whither, delight in them?",
            "review_score": "1"
        },
        {
            "review_text": "It was really intriguing to follow the development of this game and after the last updates it has become a superb game. The annoying things have disappeared. The soundtrack is awesome and the art fully adds to the atmosphere and pleasantly oppressing gameplay tension.   Just remember that Sunless Sea is all about textual deliciousness, so it's not for those who prefer pure roguelikes",
            "review_score": "1"
        },
        {
            "review_text": "Sunless Sea is a gorgeous and enthralling 'choose your own adventure' game, where you can actually live the life you want to lead. The game doesn't try to box you into any paths; you're not confined to some morality system. A variety of companions wait to be discovered, befriended, and even romanced. The expansive map is rife with adventures and mysteries just begging to be uncovered. There is always something new to discover on your voyage across the unforgiving zee.  The only people I would advise to move past this title are those that struggle with large amounts of text. Otherwise, I implore you to give this gem a shot.",
            "review_score": "1"
        },
        {
            "review_text": "3 decades ago, London was stolen by bats and dragged into the Neath, an immense cavern beneath the surface of the world. Death is strange and living is stranger. Devils, soul-hungry monkeys, a city of the half-dead, an island where everything lives; all these things are possible in the world of Fallen London. You are part of this world, as an aspiring captain on the Unterzee, the treacherous, ever-dark sea of the Neath. Your aim in life is yours to decide. The potential for adventure, wth over 200,000 words of sinister, fascinating Gothic, Victorian, Steampunk and Lovecraftian elements, is practically limitless. This is one of the most phenomenal games i have ever had the joy of playing.  A multitude of lands to explore. Limitless storytelling potential. An absolutely beautiful soundtrack. Head out to zee. Fight the horrors that lie below the waveless ocean. Sell your soul. Drink wailing ale from sobbing cups. Lose your mind. Eat your crew. Die.  Broke the rating scale/10",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Great writing. Fantastic art and music. Roguelike character creation. Create your own adventure questing which doesn't feel like a rat maze breadcrumb questing system that plagues most rpgs. Download more content from their website for free! Combat system is intuitive and the monsters are scary. The game is hard but if you feel like whining about it maybe read a guide.  Cons: Some of the story choices have bad consequences that you only find out after you've chosen, which hurts on Unforgiving Mode (only autosaves). Lost a 40 hour save file (almost 2 years in game) and felt like quitting after that. But, I did choose to play on Unforgiving so.... Other cons are the music DOES NOT LOOP. It's unnerving to sit and read so much text in quasi-silence, especially when the soundtrack is top tier.",
            "review_score": "1"
        },
        {
            "review_text": "Be warned, this game will recieve bad reviews because it slow and punishing. The story is non-linear and the combat is not exceptional.   However, if you enjoy reading, you will find that this may well be the single most immersive and fascinating game you will ever play and that you cannot put it down after 36 hours of playing and that you may have nightmares about the zee-gods and that the Alarming Scholar seriously creeps you out and that the Likely Lass really didn't deserve you cheating on her with the Devil Lady and that maybe you shouldn't have helped the rats and that you will never forget what you found in frost found and that Sunless Sea's title is the only place that 'sea' will ever be spelled correctly and that you like it better that way and that this may well be the single most immersive and fascinating game you will ever play.   (just don't expect to get most of your fun from the combat)  and by the way, this game isn't the least bit grindy. If anyone says its grindy, it's because they are afraid to explore the darkest corners of the Unterzee, and that grinding on the smaller islands near home is the only way for them to persist.   These people are wusses. Explore. Take Risks. Eat Your Crew. Go Insane. Survive. Don't listen to the wusses.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun to play for long hours in the dark of your room with no other sounds except your boat sailing along the long and lonely sea.",
            "review_score": "1"
        },
        {
            "review_text": "This game is hard, and you will die. But that's part of the fun! Seriously.   The writing is fantastic, the atmosphere is haunting and grim, the artwork is sublime.   I highly recommend Sunless Sea, and if you like Lovecraftian themes and/or Victorian era, then this is a game for you",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazingly beautiful. Not only in the way it works with words, nor the landscapes of impossible corals, but in the feeling it envokes. The calm of zailing through the Bonny Reefs-- the desperation as you realise you don't have the fuel to get home-- the terror as the Tree of Ages appears in front of you, out from the dark-- the severe lonelyness as you zail slowly through endless black.  The story of this game is rich, combining unique aspects of a culture crafted around this Victorian-era, dangerous, subterranean world. Countless possibilities can be unlocked. You can explore dangerous islands using only candles. You can burn down an entire island, you can drive yourself insane by seeing too much sunlight. You even sell your soul to a monkey. I did, once, because I needed some more fuel and I didn't have the money.  Not only this, but you can play the game the way you want. Some people might want to go and shoot as many things as possible, while others would rather try and find love back in London. The one thing you must know about this game is that you WILL die. And the death is permanent. Whether it be to mutiny, zee-beasts such as angler-crabs and bound-sharks, or just repeatedly crashing your ship into various coastlines, you will die. A lot. But the game doesn't restart completely when you die. Time progresses, and you create a lineage of captains. Choices you make in one life affect later generations, but that doesn't mean you shouldn't care about dying.  Overall, this game is darkly intriguing, beautiful, and full of things to discover. It may not be for everyone, but I highly recommend this game to fans of roguelikes as well as other dark and immersive games.",
            "review_score": "1"
        },
        {
            "review_text": "A good title. Bit of a learning curve as the game is relatively unique but once you understand the mechanics and lingo you have hours of well crafted, well written enjoyment ahead of you.   If you don like reading in games this wont be for you but otherwise i recommend the game to everyone.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game, Having been along side it since the start, through all it's development, changes and story progression this game is worth buying! It is fun, enchanting, the atmosphere and world just draw you in!  Try it today you will not be disapointed",
            "review_score": "1"
        },
        {
            "review_text": "i understand its a sailing expedition story, so its meant to be a bit aimless but i feel if goes a tad too far, dont need a hand holder, but some vague directives would help  also you better have your p&amp;p handy, and fully read everything, cause there are no reminders in game if you forget what or where you needed to do/be your outa luck  even though its clearly a reader oriented game, normally you wouldnt expect it to be 'read every word or you wont have any clue about anything, ever'  actually you might want to add into your notes aswell (fuel cost to port, heck draw the map really)  if your up for a tedious, slow grinder, and like reading (as in actual books not just lore pages as found in some games) then yes, this game is nicely written, drawn, and the controls are relatively smooth (spinning about for combat sux)  im all for investing many hours into a game (like final fantasy style titles) but expect this one to be very slow paced (artificialy) and be comprised mostly of desperatly hoping port to port for fuel and supplies  theres more than enough content (and reading) to be had to rack up the hours there is no reason to falsely slow the game down with fuel consumption, speed restrictions and over priced upgrades (and some invincible monsters but that might be a bug)  if your expecting a CYOA story about sailing, then you should look elsewhere  my reasons for quitting are lack of direction,  artificially made extra slow and grindy via high upgrade price to earnings ratio nesesscity of note taking (quest log is barely existant and has no relevent details)  no freedom of exploration, you MUST hop port to port or youll run outa fuel, and if your going to do that you might as well try to do the quests you pickup, which usually are half the map away which is why you better take notes, cause by the time you get to a destination you wont know why or what your even there for  great game imo, but poorly thought out execution (some direct target audience probably opted out or gave up)  not recomended cause its a small niche of gamers who will be able to fully and whole heartedly enjoy what otherwise would be nearly a masterpiece",
            "review_score": "-1"
        },
        {
            "review_text": "Entire boat can take damage from cave bats. I ran out of fuel in the middle of the Zee, but I had the option of sactificing some crew members for fuel which was nice.  Game is text-heavy, which isn't actually a bad thing in this case, but it can be a bit daunting for those unacquainted with Failbetter Games' other work, Fallen London. It works well, though, and stays true to the style of Fallen London. If you're looking for a strange new experience, or if you're a fan of Fallen London, play this game.",
            "review_score": "1"
        },
        {
            "review_text": "The developers are monsters. They keep making games - Fallen London and now Sunless Sea - that entice me into taking an option, whilst simultaneously warning me against said option. I always fall to temptation and I never listen to their advice.  This is an unforgiving game, but the delicious story and lush world is worth the effort.",
            "review_score": "1"
        },
        {
            "review_text": "Sunless Sea is a facinating game that combines wonderful story telling and rouge style adventure all in one neat package.   You begin your adventure picking various pasts, names, and other formalities that can decide later event in the game. Then...well nothing really. There is no main story line to follow other than various quest and story chains that can aim you in the right direction. Since the map is generally random (ports and islands are set to certain areas, yet can move around upon each new game) you are advised just to sail out there and find a brand new world of lovecraftian horror and steampunk goofyness. Each port has a story, decisions, and characters that can either offer you immense riches or terrible ends, depending on what you choose.   Be advised, if you don't like dying in games this game isn't for you. Life is unfair in the sea. Anything from enemy attacks, starvation, to just bad luck can end a game as quickly as it starts. However, with each death you can bring items back, maps preserved, or other vital elements can be saved for you next in line. The game is fairly replayable, with multiple pasts providing a world of difference.   All in all the game is suprisingly well thought out and the stories will leave you captivated for hours. A must buy for Role Play fans.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game with exquisite artwork and music, really good for exploring and discovering all the details and side stories spread all over the under zee. The game has a superb story and is challenging, sometimes even frustraiting, something that has been forgoten in games. what i liked the most is the way the world of the game absorbs you and lets you enjoy the adventure, if you haven't played this game you missing on something really good and diferent.",
            "review_score": "1"
        },
        {
            "review_text": "I just played this game for about 2 hours on what felt 15 minutes. One of those few rogue-like-likes in which you actually can build a connection with your charecter (And crew). And the art style is a thing of awe, on level with the writing, based on Fallen london, which is a thing you can so easily get into, as it is already incredibily flesh out.  If i were to complain ill do so of the battle mechanics, but I really end up enjoying them after a while (I'm a cowar who never fights)  Get it.",
            "review_score": "1"
        },
        {
            "review_text": "Sunless Sea is a pretty interesting exploration sandbox set in what I assume is basically Hell but with ships and water and what not. Seriously, souls are literally a tradeable commodity. But anyways, London fell down into this cavern called the 'Neath' some time ago, and you happen to be the captain of a ship in the zee. You'll die a lot and sail a lot in the hopes that one day, one of your captains will make it.  The game's mechanics are pretty simple if not repetitive. You explore in your ship and complete missions, going back and forth between the vast zee and Fallen London peddling goods and services for money. There are three key elements to your survival: fuel, food and terror, which is essentially just sanity. You must also manage your crew, as there are penalties for letting them fall below half your ship's maximum capacity; conversely, having too many crew members can also drain your food very quickly. Combat can be avoided easily, as you are much faster than most enemies and the enemies seem to have a very small aggro range. You can complete the game by finishing one of three goals you establish at the beginning of the game or by a hidden fourth, and you can pass on your wealth to future generations with a will. Events on islands are text-based and make use of probability, so if that isn't your cup of tea, look elsewhere.  Your main goal in this game is money. There are two highly lucrative trade routes in Sunless Sea: coffee and sunlight, both of which will end entirely after you have made a certain amount of runs. This is one of two big issues I have with the game: once these trade routes are gone, it is virtually impossible to establish a consistent source of income through trade. You have to scrape by with whatever you made during those runs because you won't be getting much money that you don't have to spend on supplies or fuel just to survive. I never felt like I was succeeding in the game after reaching this point.  The second issue I take with the game is the story, which has a lot of problematic similarities to a game like Dark Souls II. They give you just enough lore and background to make the world seem interesting and grand, but inevitably, it's disappointing and relies too much on its predecessor. In this case, Sunless Sea is the child of an interactive text adventure named Fallen London, and unfortunately, the developers seemed a bit too proud of Fallen London to let it go. Much of the story in Sunless Sea is reliant on concepts developed in Fallen London, so the game's own story is underdeveloped and very unwelcoming to newcomers. The world established is interesting but vague at best, and Sunless Sea cannot stand on its own, which is unfortunate because it is a good game.  Overall? Sunless Sea is a good game. The story is underdeveloped, and the game itself has moments where it is very poorly balanced. Still, it's quirky and fun and good for sinking (ha!) a few hours in the immersive world. I would buy it on sale if it appeals to you because I personally think it's a fun game to play with a lot of good ideas and heart and soul.",
            "review_score": "1"
        },
        {
            "review_text": "A flawed but still one of the best written games I've had the pleasure to dive into. I would've played it more but my backlog is ever growing. I used to play a good lot of Fallen London, so I'm well acquainted with the setting of the Neath a web-based text game that is more or less a less cruddy Facebook game, but it was a fun timekiller and interesting story, albeit with a macabre sense of humor. Sunless Sea is much the same way, dark at its darkest, and macabre and goofy elsewhere.  Pick it up on a sale, still good to see the devs have not abandoned it.",
            "review_score": "1"
        },
        {
            "review_text": "If you love story and reading, this game wonderfully blends those with simple gameplay elements.",
            "review_score": "1"
        },
        {
            "review_text": "THE SUN. THE SUN. THE SUN.  10/10  No, really. It's really good.",
            "review_score": "1"
        },
        {
            "review_text": "I was skeptical at first, but this is a solid game. You'll die a lot as you learn how the game works, but that's just part of the fun. This is an exploration game with roguelike elements. I have heard people compare this to FTL, but I don't think that's a realistic comparison. The game is less linear, and the combat is more action than strategy. The gameplay isn't nearly as deep as FTL. In spite of that, it is a fun and challenging way to spend some time. Most of the game revolves around story, which you advance each time you explore a little farther without dying.   You are a captain of a ship in a semi-randomly generated map. You pick a goal each game and have to meet that goal before you win the game and retire. In the meantime, you must keep your ship fueled and your superstitious crew calm and fed to prevent mutiny. The islands appear in generally the same section of the map, but in a different place in that section each time. Since so much of the gameplay is in the story, the drawback is once you've played through a few times, you already know what happens in each event. This detracts from the atmosphere of the game somewhat. Still, there is a lot to explore and, much like a book, you can pick it up and read it again from time to time. The writing itself is like something out of a twentieth century American pulp magazine.  Risk madness exploring far off islands with terrifying locales deep within the hollow earth. Hire a crew with strange and enigmatic officers and learn their stories. Build your reputation with the soldiers, scholars and criminals of Fallen London and nations far from home shores and become wealthy from trade. Spy on ports and sell your information to the highest bidder. Meet nomads, smugglers, exiles and villains in lawless ports like Gaider's Mourn and Khans Shadow and earn coin ferrying them from port to port. Romance men and women and have a child, or choose to adopt one together. Tattoo the memories of distant shores on your own sweet skin. Earn the favor of the gods of the zee or scorn them and risk their terrible wrath. Smuggle illegal goods. Hunt pirates and sea monsters. Earn stories from your adventures or trade the other captains of the zee for them with recent news from home. Become a wealthy and famous captain of the unterzee.",
            "review_score": "1"
        },
        {
            "review_text": "Sunless Sea is a roguelike exploration game that does not hold your hand too much. After the initial tutorial, you are expected to add to what you have been taught and be ready for even more as the game goes on. With an incredible aesthetic that includes a wonderful soundtrack, a fantastically grim art style, and plenty of character in the story, fans of Lovecraft and dark humor may find it compelling. The gameplay has deeper complexities, but on the surface functions simply enough to be understood at a glance. Hotkeys are available and controls are configurable, though the range of actual keys needed is simple enough and will not leave casual players swamped in things to remember. Experienced explorers are rewarded with a map that never stays the same unless you pass your chart down to a successor upon either death or retirement. Retiring offers unique benefits to the next character in which they start with elevated stats, extra money, or extra equipment, potentially a combination of the options if you followed a certain storyline to completion. Making money is not too easy, though with how the economy in the game works, the early gameplay can be tedious, as travel time eats up more time than time spent in ports. However, as you begin to comprehend the mechanics and amass wealth, upgrades don’t make the game very easy, but instead make it possible to survive and go further in the game itself.  Ultimately, I recommend the game if for nothing than the story and music alone. The gameplay is solid, if a bit slow paced, and as you grow the understand the mechanics behind the game itself, it opens up further and further for you to enjoy. It has a learning curve that can be brutal on the impatient but given enough time and patience, the game can immerse you in a world of intrigue and curiosity. As this is the sister game to Fallen London, I recommend checking out Fallen London for those curious about the stories in London that don’t make it into Sunless Sea. For those that also enjoy Fallen London, Sunless Sea is a natural extension of the game. Both games unlock content for one another after a certain point and enables interactions between your Sunless Sea and Fallen London character.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very interesting game with a very profound and well-written (Gothic/Elder Gods/Horror) story. There is incredible potential in both the game itself and the game universe.  There is one, major, glaring flaw, however:  THE GRIND  From very early on in the game, you discover that you need fuel and supplies to continue playing. How do you get fuel and supplies? By Grindng. How often do you Grind? You always Grind. Why? Because if you don't Grind, you don't live.   Imagine WoW if your level 90 Paladin could potentially starve to death every few minutes, and needed a constant stream of Lesser Wolf Meat in order to keep playing. Want to go on a raid? Uh, sorry, I can't ....I have to go grind for 30 minutes so my dude doesn't starve to death. That is, in a nutshell, the gameplay of Sunless Sea.  It's understandable why they did this. The game requies some kind of economy to keep things interesting and to keep you questing. There is a threshold, however, beyond which the GRIND stops being fun and starts to be a chore. Exploring a vast underground gothic hell-planet is fun. Making constant supply runs from port to port just so you can, maybe, one day, buy a level 3 spotlight so that you can possibly, somehow, defeat the Death Crab (or whatever) in between supply runs is.....  Well, it feels more like *work* than an actual game. It feels like real life. Keep working so that you can live.  But I don't play games to feel like I'm at work. Therein lies the problem.  Devs: please fix your crazy GrindFest so I can give you a good rating. Sunless Sea has limitless potential, but playing currently feels more like a job than my actual job.",
            "review_score": "-1"
        },
        {
            "review_text": "A little FTL a-la steampunk. A dash of generation building. A procedurally generated world to explore. Trade, hunt monsters, pirate, smuggle, build a family, this game has a dash of everything in a tidy sub 300mb masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "Truly a unique gem, Sunless Sea is a game like no other.  Its setting is deceptively calm and serene, hiding a truly brutal and fantastic universe of stories that will have you coming back to discover all there is to know in the Neath. Even if it means dying a few times.  While the naval combat is basic and quite easily exploited, the game really isn't about that. It's about exploring a well-developed, living world that will be shaped by your decisions. Rob Pigmote of its scintilliack? You're locked out for good. Side with the Anarchists? The Admiral goes into hiding. These are fairly tame compared to what awaits you further East.  The mechanics support this main theme. You level your stats with Secrets which are made by accumulating Fragments, which you gain every time you discover a new island or landmark. Various interactions also provide Secrets, but nothing replaces the rewards reaped from fully exploring the Sunless Sea.  While it does have a slow start, this is deliberate and creates an impressively immersive experience. The soundtrack is great, and the art captures the mystery and dread the devs want you to feel. Some reviews point to how it eventually becomes a grind, but that has far more to do with the player than the game. In near 50 hours of gameplay and with all legacy items unlocked, I have yet to run a single grind.  Regular updates mean I've returned multiple times and enjoyed the game once again. The recent Christmastide storyline was a lot of fun. And with the Zubmariner expansion around the bend, they're will be a lot more to explore (AN ENTIRE OTHER SEA!)  RECAP The writing, art, music, and general atmosphere are great. The game rewards you for exploring and seeking out opportunities. While it has a fairly slow start, it is nonetheless very enjoyable as each island presents something distinct and new.",
            "review_score": "1"
        },
        {
            "review_text": "A game which achieves everything it's trying to with finesse. The game doesn't feel that large, but I still feel like I've gone nowhere with it after seven hours—which is undoubtedly a good thing. The game has a lot to offer through its sombre and surreal graphics, its haunting music and its joyfully eccentric prose, and it delivers on every count. A little gem of perfection in its own right, defying comparison.",
            "review_score": "1"
        },
        {
            "review_text": "Oddly relaxing for how hard this game can be, alot more playtime in it than i first would have thought to be behind it. fantastic game, though i will say sometimes it gets a little quiet as the music isnt always playing but thats no reason to not like the game. fun little achievment grinder too even though its only 30 achievments",
            "review_score": "1"
        },
        {
            "review_text": "This game is more of a novel than a game. And it's a damn good novel. Because it does something that novels tend to be unable to do due to the very detached nature of reading. Rather than have you sympathize with a protagonist, you are the protagonist. That's part of why so many people play games; it's simply more interactive and immersive. What Sunless Sea does somehow goes further than even that level of immersion. It doesn't just show you a world you can play through, it gives you a world to live in. I feel uneasy and lonely and even sick at the things that happen, especially the things I do. This is simply the best storytelling experience I have ever had. No other game even comes close.",
            "review_score": "1"
        },
        {
            "review_text": "It is difficut to describe this game.   One: I agree with the previous poster. Grinding is absolutely the worst way to play this game. It is the opposite and perfect antidote for games where you need to optimize your numbers to succeed. There is something for you no matter what your stats are. That said, the game doesn't really start until you've managed to buy a townhouse and make a will. That will cost you around 1200 coins, and is the only way to gain any permanence. However, grinding is STILL not the best way to make those 1200 coins. The best way is to take missions, and let your curiosity guide you. After that you want to make it a priority to get another 200 coins each generation to make another will.  Two: It's lovely. It's hypnotic. It invaded my dreams. I've been trying it over the free weekend. I played it for about ten hours, and I feel like I haven't even scratched the surface. I am definitely buying it.  Three: Parts of it can get a little repetitive, due to the fact that all the islands reset when you die and a start a new captain. Do I really need to go through the whole guinea pig vs. rat war again? Why can't it restart at the point where the last captain left it? Despite that, the previous poster is also correct when he says that if you go back to the same island, there can be different options which can lead to very interesting story indeed.  Four: There are a few bugs. For example: I lost one captain because he had to pick up a delivery for a criminal. When he got to the place where the delivery was supposed to be, it wasn't there. So when he finally returned to New London, they knifed him.   8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun AFTER you learn the basic mechanics and controls of it. It is not the kind of game you can just hop in and know everything, it takes time. However you will find that once you get a grip on the basics this game is very rewarding. The graphics are beautiful and combat is polished  I can say that I will be playing this game for a long time now. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "going mad was never so... interesting...",
            "review_score": "1"
        },
        {
            "review_text": "A slow burn... with benefits.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, massive timesink though not in a bad way.  Beautifully designed, immaculately written. If you're one for stories, and rogue-likes this is a game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, amazing atmosphere. Simple controls yet takes dedication to 'learn' the game.",
            "review_score": "1"
        },
        {
            "review_text": "A story-rich game, or rather experience, that doesn't hold your hand... is unmerciful... and yet oh so eloquent. Sunless Sea borrows a lot of the core mechanics from Fallen London, a long-running browser game, and adds travel, exploration and combat.  If you've played Fallen London, then you'll know exactly what to expect.  Lots of storylets and trinkets and strange people to encounter that affect your character and his or her progress, sometimes in subtle ways.  There is no right way to play Sunless Sea. There is only the path that lays before you and the consequences of choices and actions. Left foot, right foot... deeper and deeper... ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would eat crew again",
            "review_score": "1"
        },
        {
            "review_text": "It was on a free weekend so I thought : Why not?    I died in 25minutes!    I haven't played much as this turned out to be not quite my game type. It seems quite intriguing and mystical and it's what I liked about it at first. I'd say this game requires a lot of dedication that I am not willing to give. If you, however, are, make sure to check it out. Fantastic music and interesting gameplay, choosing your own background was always a lovely trait in a game.",
            "review_score": "1"
        },
        {
            "review_text": "Relatable, evocative, beautiful, buy it imo. They keep calling Storm 'he' which is ♥♥♥♥ed up but the game is still really good + important.",
            "review_score": "1"
        },
        {
            "review_text": "not my cup of 'tea'.",
            "review_score": "1"
        },
        {
            "review_text": "This is my new FAVORITE game!  I can't believe I played my first session for over 11 hours! I didn't realize until I saw the sun come up. Serious time warped.   I was so drawn into the story and the genre.   BTW- Is it me or does The Alarming Scholar remind anyone else of Lady Gaga?",
            "review_score": "1"
        },
        {
            "review_text": "Sunless Sea is probably the most immersive game I've ever played. It sucks you in with its rich, dark lore and unsettling tone, and doesn't let go until you pry yourself away because you've been here for god knows how long and oh ♥♥♥♥ you haven't fed your dog since like three days ago oh god oh god what have you done",
            "review_score": "1"
        },
        {
            "review_text": "&gt;so I'm doing some hellish fetch quest for Mr. Sacks, a.k.a. Dark Santa Claus &gt;that's not a metaphor just so you're aware &gt;Santa Claus has effectively hijacked my ship &gt;threatening me and extorting me out of my money and skill levels because I'm not delivering his gifts fast enough &gt;we finally reach the North Pole &gt;Sacks builds a snowman &gt;asks for some of my blood &gt;why the hell not &gt;blood + snow = living snow child &gt;I name him Loki and take him aboard my ship as my own son &gt;get back to London &gt;kid starts melting &gt;really should have predicted this &gt;to save him I have to take him to some colony in the east full of devils that I hadn't found yet &gt;fill up on fuel and supplies and high-tail it over to the eastern border &gt;start searching all over the place for this colony &gt;start running low on supplies &gt;kid continues melting &gt;finally get within shouting range of my destination &gt;I can hear the devil theme music and everything &gt;run out of fuel and supplies entirely &gt;start sacrificing my crew members to the gods of the sea &gt;I will save this snow child if I have to kill everyone else in the process &gt;finally get fuel on the fourth attempt &gt;this also kills off the last of my crew &gt;can't sail without crew &gt;I die alone, yards from victory &gt;I've betrayed my crew and failed my adopted snow golem child and have nothing to show for it  12/10 would lose everything to poor planning and the cruel hand of fate again",
            "review_score": "1"
        },
        {
            "review_text": "This game is gloriously frustrating. You will die, again and again. And you'll keep coming back to it. You'll keep pushing your captains harder and harder, memorizing quest routes as you go on in hopes of one day finally finishing a quest line. It's like eating the best pineapple of your life with a cancre sore: Each bite is glorious agony.  Fans of steampunk and neo-gothic themes and aesthetics will greatly appreciate the art and story.",
            "review_score": "1"
        },
        {
            "review_text": "Hours and hours of sailing about and reading texts shouldn't be this good",
            "review_score": "1"
        },
        {
            "review_text": " Three decades ago, in the reign of Victoria, London was stolen by bats. Now it lies a mile below the surface.   Does that make any sense? Anyway, that is how the story of your adventures as an Unterzee captain begins in Sunless Sea. In the game you explore the Unterzee, a vast underground black ocean, in order to achieve your main goal. That goal is chosen at the beginning of the game, but the path to success is it not very straightforward. You need to keep sufficient amount of fuel and supplies to survive the journeys, you need to keep your crew’s terror level down to keep the madness away (the Unterzee is a very scary place filled with monsters and unseen horrors), and you will die anyway. That is not a problem, you will always have a successor that can inherit something from you to make the life somewhat easier.  The world is based on that of a browser adventure game called Fallen London. It is a little bit of steam-punk and and a little bit of Lovecraft, and it is a very fascinating place. The world and the story are truly the main reasons to play this game. The game is nice to look at, and the music is atmospheric and fitting to the theme. The pace is extremely slow, and at times it is very tricky to balance the economy so that there can be any progress at all in the story. There is a lot of text to read and there are many choices to make through the game, and most of these choices do matter in one way or another.  I like Sunless Sea. The clunky user interface that shows the game’s roots as a browser game and the somwhat repetitive gameplay do not stop me from that. The reason I play is to sink deeper into the Unterzee and in a leisurely manner deal with the myriads of subplots on its islands, and to explore the boundaries of the known darkness.",
            "review_score": "1"
        },
        {
            "review_text": "When I first looked at this game I could only think ...this is it... a pure exploration game with a taste of rpg what else could I ask for?  When I finally bought the game and I got to play it, I definitely had no regrets not even a bit. The game is straight forward exploration and nothing else, you just have to let yourself be guided by the deep terror of the unterzee and you will experience true discovery.  Well in terms of gameplay, the game just plays out really smoothly and the only thing that really bugs me out is the time it takes to go from one place to another, aside from that it is just minor things and preferences and I just really enjoy the game. Most of your time will be spent trying to figure out a way to not die at zee, but that will come with experience and some money too because all zee captains tend to start really poor... yet, don't be discouraged because the zee holds many treasures and rich stories which may guide you to a imense amount of sailing in to the unknown but thats obviously the point of this game.  Totally recomendable to someone who wants to waste away his/hers weekend sailling in the deep waters of the zee.  Or anyone who just really enjoys adventure and exploring.",
            "review_score": "1"
        },
        {
            "review_text": "Sunless Sea is a very peculiar title in the modern game scene. In a land where survival games flourish, low-budget games pass Greenlight by a landslide and succeed by thousands of sales, and where a 2D game about humans and monsters can touch the hearts of hundreds, a slow-paced walking simulator-esque game about chugging along in an underground ocean doesn't seem like the kind of game that fits the modern market.  In its gameplay, Sunless Sea lacks true substance. It's very simple, with most of the time investment coming from laborious grinding. You play as the captain of a steamboat on the subterranean Unterzee, which is where London now resides after it lost a war to Hell in years past. I'm confused, too, don't worry. You can cruise around and do anything you'd like - run trade routes, kill monsters for loot, or just explore.  Sunless Sea's design, however, really prevents you from doing much of this. For one, your starting boat is slow, weak, inefficient, and weaker than paper mache against any zee-monster worth its weight. Running trade routes is hard because your hold can't really do its job because your engines are inefficient and need a lot of fuel. Killing monsters is completely out of the question because you'll get ground to a pulp beneath the weakest auroral megalops, and exploration is difficult for both of these reasons, plus a mechanic called Terror that causes you to go slowly insane away from land and in the dark.  'A grindy game with slow pace where it takes a long time to get anything done,' I can hear you saying. 'Why would anyone want to play this?' The real meat and gristle of the game comes in the form of its writing. I can already see you rolling your eyes, but hear me out. The writing in Sunless Sea is phenomenal. It's not just the story and themes - which, as a fan of the eldritch, I adore - but also the writing itself. Take the following passage that you read when visiting Mount Palmerston, an underground volcano that serves as the entrance to Hell:  'Sullen lights glow green at the jetty's edge. Behind the port buildings, the island is is knee-deep in ash. There are ruins here and there, of houses destroyed by fire. Far above, the mountain's top flickers red: just for an instant.'  There are few games with writing as well as this one, and it lays out its mysteries and stories in a way that tantalizes you and dispels the chore of grinding. At one island, after becoming trusted with the locals, I searched around one of the offices and found a door. After I went through, a cavernous, spiraling staircase descended into darkness. I could either attempt a skill challenge (which I had very little chance of succeeding in), use some candles and flares to descend further (which I didn't have), or come back later. I chose to return all the way to Fallen London halfway across the map, buy the supplies, and go all the way back to explore what was down there.  And that was made possible because of how Sunless Sea lays out its stories. It leaves a breadcrumb trail for you to follow, and you'll quickly find that you're desperately getting to each subsequent crumb as fast as you can for just a tiny little bit more development and information. And the game rewards you for this. See, in the Unterzee, secrets work strangely; once you tell them, you lose them, and secrets deep enough can shape reality itself. By completing a long storyline, you might get a searing enigma, the most powerful form of secret and priceless among the high and mighty.  But I'm rambling, so I'll wrap this up. Sunless Sea is a game about stories. The gameplay it lacks is repaid by the interesting locations, strange people, and darkly beautiful Unterzee that it presents to you. If you're the kind of person who loves story and can accept lacking gameplay, definitely pick this up.",
            "review_score": "1"
        },
        {
            "review_text": "Part RPG adventure, part sandbox, and part survival game, Sunless Sea is both challenging to get into and fun to play.    What I like  :  * The ability to create my own character. I consider this a must for any game wishing to be taken seriously as an RPG.   * There is plenty of excellent ambiance created by a combination of wonderful music, appropriately dark visuals, and intelligent writing.  * The game does not pull its punches. If I don't manage your resources with a mind toward how I will make it back home, I usually won't make it back home. Not without a lot of luck, anyway.  * The game makes me think. It asks me to make some fairly uncomfortable choices, and it makes me care about those choices.  * There is definitely quite a bit of replayability here. Which is good, because if you play anything like the way I do, you'll be dying a lot in the beginning while you figure things out.     What I don't like  :  * I was disappointed with the grind involved in leaving any meaningful legacy to my next of kin.  * Said grinding encourages the use of metagaming via abuse of certain of the game's mechanisms. I don't have to do this, but the conventional wisdom out on the 'net certainly recommends it. Seems to me this would be a game design flaw.  * There are so many things in the game which are so poorly explained that consulting the wiki at times is almost a necessity for those of us wish to complete the game. Many journal entries could and should be improved to provide clearer and more consistent information. I love a good mystery as much as anyone else, but being obtuse simply for the sake of being obtuse is not clever. It's annoying.  * Combat is sometimes also annoying. I have despised cooldowns on every RPG I've seen using them so far. This one is no exception.  I recommend buying the game if you enjoy exploring, experimenting, reading, and discovering things at your own pace. If you want a game that is combat/action oriented, you're likely to be disappointed with this one and should consider buying it only on sale.  Whatever you decide, I wish you happy gaming!",
            "review_score": "1"
        },
        {
            "review_text": "Sunless Sea is less of a game and more of an interactive story, what with the writing that can be described as some of the best I've read and a world that is interesting, deep and ever changing, which makes me come back to it over and over and over.  The gameplay is a bit... lacking, but the world more than makes up for it with a large amount of quests to do and goals to complete and a world filled with islands to explore.  While I do recommened this game, it does come with a bit of a problem, as some might find the lacking of gameplay and an over-abundance of story and reading a turn off of the game, but that hasn't stopped me from playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Sunless Sea is less of a game and more of an interactive story, what with the writing that can be described as some of the best I've read and a world that is interesting, deep and ever changing, which makes me come back to it over and over and over.  The gameplay is a bit... lacking, but the world more than makes up for it with a large amount of quests to do and goals to complete and a world filled with islands to explore.  While I do recommened this game, it does come with a bit of a problem, as some might find the lacking of gameplay and an over-abundance of story and reading a turn off of the game, but that hasn't stopped me from playing it.",
            "review_score": "1"
        },
        {
            "review_text": "I love this. It's great if you enjoy gambles and payoffs, and most of all if you enjoy weird Victorian/Edwardian horror and dark humour. It's not so good if you're into pure gameplay skills, or even if you like text-based games that put you in the shoes of a Sherlock-esque detective. Sunless Sea is not out to reward you for either of those abilities. It wants you to sneak past pirate ships and sea monsters with your lights off for as long as your crew's nerves can take it. It wants to look at the proposition from the stranger, see the hints of danger, and say 'yes' anyway (and if you say 'no', you'll probably miss something great and/or beneficial).  It's a slow-paced game, the crawl of which matches the creeping dread of the setting. It's cruel at first, but the more places you see and the more secrets you learn, the more power you'll have.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;&gt; The game is far too slow paced, taking forever to make any progress. &gt;&gt; The roguelike aspect conflicts with the lengh of every run, damaging it replayability.",
            "review_score": "-1"
        },
        {
            "review_text": "Sunless Sea will gently wrap you in a warm blanket of beautiful writing. She'll sing you her sea-shanty lullabies and tell you stories of dark depths and faraway lands. And just as you begin to dream... she'll kill your crew and set your ship on fire.",
            "review_score": "1"
        },
        {
            "review_text": "Sunless Sea's wonderful storytelling, music and style keep me sailing through the dark seas (zees) of madness.  It's got:    an FTLish, rogue-like universe to explore and be horribly dismembered in.    a learning curve that will punish your initial failures with chaos and death.    a wild and dreamlike tale that will keep you coming back to see how it ends...if you can survive...   Sunless Sea shows what a small team can do with a good idea and clever writing. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "I died a lot. Wondered if I should stop playing. But a week later I figured maybe I'd learned enough to stay alive for a while. It's actually not that hard. This game is really fun if you:  * Run away (use the extra fuel to the boiler) * Buy extra fuel (see point 1) * Explore everywhere * Click cautiously, if there's a red 'no way' you probably don't want that option unless you want to die. * But DO click. If there's nothing warning you away, click it. See what happens. A lot of the random encounters are directly positive or unlock ways to get more cash, fuel &amp; supplies. * Play slowly and pay attention. I recommend getting a cup of tea before playing.",
            "review_score": "1"
        },
        {
            "review_text": "I played as a magical wizard who had the power of reloading his previous saves.",
            "review_score": "1"
        },
        {
            "review_text": "great style and immersive story and graphics, unforgiving on hardcore, only true captain's need apply. After all not everyone can look eldrich horrors in eye, maintain their sanity, make a profit, and leave a legacy for all in their wake to chase after.",
            "review_score": "1"
        },
        {
            "review_text": "I played as a magical wizard who had the power of reloading his previous saves.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much a slower FTL, with more RPG elements to it and better graphics/more artsy. By slower, I meant that I was doing other things while playing this game. Good game though 7.5-8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much a slower FTL, with more RPG elements to it and better graphics/more artsy. By slower, I meant that I was doing other things while playing this game. Good game though 7.5-8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Holy f**k, this game's narrative is really good! If you like the whole H.P. Lovecraft, Terry Pratchett and Neil Gaiman style of writing, you WILL LOVE this game.  It's a mix of Lovecraft with Pratchett and some steampunk visuals with the feel of Gaiman's Neverwhere London. Like there's a whole civilization on a dimension just below our own.  I cannot recommend this game enough, if you like this kind of lore.",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually REALLY good. It's like...a weird lovechild of Don't Starve and the Cuthulu (sorry, can't figure out for to spell it) mythos by H.P Lovecraft. It's spooky and the controls are easy enough, but it's interesting. And it's got a really neat soundtrack (that I would totally recommend be avalible to buy on its own).",
            "review_score": "1"
        },
        {
            "review_text": "I can't sleep anymore, and now seek what little peace I can in laudanum dreams… every time I close my eyes, I’m haunted by the sight of a cyclopean eye gazing from beneath blackened waves. I sought to escape that horrible image by sailing to far forgotten shores, an island where intelligent guinea pigs made war on rat engineers, the colonies of the long since dead, a fungal mountain inhabited by mushroom that speak… what they speak of, I cannot say… I remember their words, the nightmares, the silent secrets.. I cannot bring myself to tell more. This will be my last accounting of what I saw upon the Unterzee, for those secrets I unearthed have at long last come to consume me. THE EYES! THE EYES!  And so that’s essentially the game… Quirky, well written, horrifyingly dark, and a great time all around.",
            "review_score": "1"
        },
        {
            "review_text": "Game is freaking awesome. Recommended for anyone to like games with heavy story telling",
            "review_score": "1"
        },
        {
            "review_text": "Good atmosphere, reasonable game-play, but the trade system is so poor that the game is largely unworkable.",
            "review_score": "-1"
        },
        {
            "review_text": "As punishing as it is boring.  The start of the game is just ♥♥♥♥ing brutal. Your first task is to figure out a postive income stream because your ship is utterly beholden to everything with a bouyant profile. So you find some ♥♥♥♥ing mind numbing task which brings in cash and of course after 4 or 5 trips the game decides yeah, ♥♥♥♥ this guy, let's change up the once reliable narrative and complicate his pitiful exsistance even more. No more cash flow. And all the while you're parading back and forth, at the rate of a dog which has had it's legs cut off, you're getting ♥♥♥♥ed, front to back, with very little romance by the various 'food fuel and terror' mechanics with which you have to make a Faustian bargain just to last another 5 god awful ♥♥♥♥ing minutes in this relentless and somehow boring hellscape. You wanna run without your ship lights to save fuel? ♥♥♥♥ you, terror is off the charts and now you're having a mental breakdown everytime you close your eyes. Enjoy paying off the interest on that decision, you ♥♥♥♥.  If you wanna play this game, have at it, I definitely reccomend shoving shards of glass down your urethera in order to relax in between sessions.",
            "review_score": "-1"
        },
        {
            "review_text": "I found the game to be initially intriguing but was quickly disappointed when I realized how static and (non)random the entire game was. If the map never changes, why do you care if I keep my explored version? Its very slow and tedious as well.",
            "review_score": "-1"
        },
        {
            "review_text": "This game appears to be a roguelike, until after the first couple restarts.   When I began playing, I was excited to explore the world, taking risks, exploring the seas, stretching my resources thin in hopes of finding some hidden treasure trove, or unknown shore, or new quest. Naturally, I soon died, and you know what? I was OK with that; it's to be expected in what I believed to be a roguelike, and so I happily restarted, hoping to have a luckier run next time around.  Rinse and repeat a couple times, and I came to the realization that this game isn't so much a roguelike, as it is an absurd combination of a roguelike and an RPG, combining the aspects of both which are least able to function together.  Where a roguelike may be impossible to predict, with vastly different loot distributions, enemy difficulty, and level layout per restart, Sunless Sea offers a disappointingly static world, with no geographical changes I can perceive between games other than the slight reshuffling of islands. How is it in any way fulfilling to perform the same quests, trade the same goods, and and re-discover the same islands over and over again, with no variation but the reshuffling of otherwise unchanging locations? Admittedly, most minor story events occur randomly, and some quests may vary depending on decisions made in the playthrough, but these variables are few and far between, and do little to alleivate the woeful repetition that begins to set in after the 3rd or 4th death.  Ultimately, there's no sense of adventure, no hope of some amazing discovery, no possibility of finding anything 'new'. The game becomes an excercise in tedium, an endless repetition of a couple tactics, at which one must become as efficient as possible in order to beat the punishing gameplay, which would have been an enjoyable challenge in a truly random environment, but which is reduced to a chore when implemented in a world with no meaningful variation whatsoever.  The woefully static nature of the game is best summed up by the gameplay guide to be found on the Sunless Sea subreddit: In later sections, the author describes what are essentially the few narrow ways of power-gaming the economy, by means of tediously ferrying a few different types of goods between specific islands.  In short? I can not recommend this game as either a roguelike or an RPG; as the former, it lacks any meaningful randomization of its environment, and as the latter, it absurdly supposes that repetition of the same tasks over and over again for sparse reward is in any way fulfilling. Certainly, playing on merciful is an option, but in so doing the game becomes simply a punishing and relatively short RPG.",
            "review_score": "-1"
        },
        {
            "review_text": "Sunless Sea is a very addictive game. I had no clue how much I'd like it so after trying it out for a day I opened up Steam and bought the bundle immediately. And although I missed the sale by a few days which is irritating, I don't feel like I spent too much. There is a TON of content in this game. Just be prepared though, you are going to sink a ton of hours into this game if you get into it and like it.  Pros- Very addicting. Very immersive. Tons of lore. Very well thought out game mechanics and story. Very Challenging.  Cons- Sort of a slower game.  Boat speed is slow.  No voice acting, you have to read everything. You will die often when you first start, and rebuilding is slow. ",
            "review_score": "1"
        },
        {
            "review_text": "I loved sunless sea when i first got it. it had a challenge and i respected that. it had expensive ships and upgrades to look foward to getting. that being said, it didnt take long for me to realize that i was never going to afford the big fancy ships or the retirement mansion. nope. this game is hard, and unfortunately, i found myself making the same routes, in the same slow ship, just to make ends meet. nothing was getting done. i started disregarding all the special sidequests and witty dialogue eventually because 'no, does it look like i have that special item on hand? i sold it already. just give me the port report and give me some goods to sell at london so i can afford some damn fuel'. eventually, i came across the sunlight smuggling method and became invested on a whole new level. Oh Em Gee, im getting crazy money from this! i can finally afford a big fancy boat and the mansion, and with all the money problems out of the way, i can just focus on how great this game is and do all the sidequests! nope, i was wrong, because the devs nerfed it and i literally DIED from having sunlight on my ship. now, im upset, like CLEARLY upset. i thought there might have been an easy route, you know? wrong. i dont need this in my life. i just want to be happy, and this game doesnt make me happy. thanks anyway, though.",
            "review_score": "-1"
        },
        {
            "review_text": "Way too much time in this game is spent watching a tiny white snail move slower than slow across a dirty green wall. Some of the reviews warned about this glacial movement speed but I wasn't expecting anything this extreme.   Glaciers are actually melting pretty fast these days. This game... not so much.   I want to get to the storylines that people say are so well written but I keep nodding off. If the devs really wanted to create more time-consuming travel, it's a real shame that they didn't make the game world bigger instead of making the ships move at a snail's pace.  One thing I DO like: new stories emerge over time when you re-visit locations. Some of these stories are intriguing so far and play out in unexpected ways. This is quite rare in video game land and a valid reason why the sunless sea would be loved by many.  But as it stands, playing this game makes me feel like a miniature sloth in a hamster wheel most of the time.",
            "review_score": "-1"
        },
        {
            "review_text": "An awesome game, with great writing, music and a huge weird world to explore. Although, sometimes it feels like it's messing with my mind. the chain will end the time will suffer the sun THE SUN T͈̖̘̞Ḫ͖͉̪͟͞E̝̤͉̺̼̹͡ ̵̠̙̱̱͙͇ͅS͏̤̺̩Ų̲̗͟͢N҉̛̪̲͓̗̠ .",
            "review_score": "1"
        },
        {
            "review_text": "SUNLESS SEA is a pretty unique game, I find it hard to describe, it feels one part exploration, one part text adventure, and one part rouge like. In the default difficulty, when you die, thats it, you restart with a few bonuses, or many depending on the circumstances of your death. In Sunless Sea you are captain of a vessel sailing some kind of strange ocean. I have not played much but from what I have read and seen in game I believe it to be some sort of underground ocean of some sort, and the humans here some sort of semi undead. I often encounter what comes down to as living mummys, people who just have aged so much they start to fall apart and thus have to move to a 'tomb colony'.   Sunless Sea is very much about exploration and lore. There is so much to read and so many strange things to encounter. The lore itself and the story feel like a really amazing setting even though the gamelplay itself lacks in many areas. The main focus of the game is exploration, yet the resource system for supply's while out at see its very restricting.   Sunless Sea is a good game, I have no doubts about that, but I feel it takes a certain type of person to enjoy it at its fullest. Someone ok with strategy (or tedium), someone who is perfectly willing to start over, again, and again. And while I myself did not get much time with it this free weekend, I played long enough to say it was something I enjoyed!",
            "review_score": "1"
        },
        {
            "review_text": "Great music and mood, good writing, interesting stories. Unfortunately I found the gameplay repetitive and slow. The profit margins are tiny and upgrades costly. Became a chore by captain number 3.",
            "review_score": "-1"
        },
        {
            "review_text": "fun and boring at the same time",
            "review_score": "1"
        },
        {
            "review_text": "Ultimately not worth it for me, mainly because some islands stories left me cold, like guinea pigs fighting rats or something. Not much point in the combat in the game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not in the least bit forgiving. Just the way I like it.  To get the better ships, you're going to need to really grind in some hours. Great fun though. Brilliant writing.",
            "review_score": "1"
        },
        {
            "review_text": "So let me say first that: This game is awesome. The story is captivating, the atmosphere is brilliant and the challenge is fun. But the level of pure ♥♥♥♥♥♥♥t in this game is incredible. It can really kill the game for you, Watch some lets plays of this game. You'll see people fall in love and build into the game, and then be cheap killed and quit the game for good. You've got a hugely steep learning curve, the profit options are pathetic and as soon as you figure out a way to make money, the devs nerf it. DEVS! Listen to your players, we're here for you and you're supposed to be here for us! So take some time to diversify and make the game a little more reasonable.",
            "review_score": "-1"
        },
        {
            "review_text": "This is my favorite roguelike-ish game, barely stepping above FTL and Dungeon of the Endless. This might just be from the theme itself appealing so much to me, what with the Lovecraft influence. It could be the goal-oriented storyline that is the most extreme opposite of railroading. Maybe it's just how many times this game has killed me at the height of my success. Please drive me insane, starve me, and blow me up some more. This is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, any game which has the word 'iatrotheological' in it automatically receives top marks from me from now on.  C'mon, Mr. Mieville, we KNOW you wrote the stories here, right? RIGHT?  10/10. Just wow.",
            "review_score": "1"
        },
        {
            "review_text": "Underrated game IMO.",
            "review_score": "1"
        },
        {
            "review_text": "I really tried to like the game, but ultimately it was a big let down.  You start to explore the world, read the stories, get killed by running out of fuel or food or sanity. No problem your heir will be better off.  You collect things, complete quests, visit every isle, complete the quests of your officers. At this point you will start using the sunless sea wiki more and more and start to see the bad side of the game.  Will you ever have the money to upgrade your ship ? I didnt, after 24 hours I was still using the beginner boat and was struggling with obscure quest items taking away precious cargo space because they are a rare trade good too (hours of assembly to now sell the item for a couple 100 gold wth, nope keep it for that quest later, even if you can take less and less food and coal with you).  I liked the interactive book elements on the various islands, sadly many of them are streched out and gated up by very tedious item collection runs, you better write down what you need where or you constantly use the wiki.  After doing my fair share of quests and loooong boring voyages collecting port reports over and over, using cheese tactics to kill some heavier enemies and finding that they are not worth the struggle and risk at all.  Then cruising around for hours to collect tokens from 5 different locations to complete a quest and get a one shot ammunition for a weapon that requires another long assembly run and would only take space away too, it was time to call it quits. All motivation died.",
            "review_score": "-1"
        },
        {
            "review_text": "great atmosphere, aesthetic &amp; story. lots of replayability, which is great because you will die a lot. if you're doing it right.",
            "review_score": "1"
        },
        {
            "review_text": "Very slow game, but the player is rewarded with very well written, atmospheric dialog, place descriptions, and events. Exploring the Unterzee is a great early motivator: one is compelled to push back the fog of war to find all the ports. Combat isn't all that engaging, and is mostly to be avoided.  Upgrades are very expensive, and while money can be consistently made, it's slow going. Death is permanent, and there are many dangers, so caution and flight are the bywords of play until larger ships and more knowledge are acquired.   Much of the game is a collection of fetch/deliver quests, but the top-knotch writing and mysterious world really make the game.  Don't play if you're not a reader.",
            "review_score": "1"
        },
        {
            "review_text": "Richer lore than Star Wars best universe Ive seen pretty damn good rather difficult you should buy.",
            "review_score": "1"
        },
        {
            "review_text": "⁨",
            "review_score": "1"
        },
        {
            "review_text": "Some of the best horror this side of Amnesia. Incredible writing and the best handling of gender and sexuality I've seen in any game.",
            "review_score": "1"
        },
        {
            "review_text": "Should be called funless sea instead, looks cool tho.",
            "review_score": "1"
        },
        {
            "review_text": "The game is largely a collection of short stories for each island in a fairly standard ship combat game. When you have progressed enough you can potentially see another story however the pacing is slow and the game will kill you fairly easily. While not a bad game as such and the stories are interesting it takes an extremely long time to unlock everything. When you have figured out how to make a good profit and purchased enough secrets in order to get good stats it degrades down into supply running for the next story. Combat while it works isn't very interesting as you will likely be facing the same enemy in ever increasing numbers in one area. Until people take risks that pay off it is a struggle to get anywhere or do anything.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like to read everything because the devs were too cheap to hire voice acting talent, this is the game for you! I know thats probably not the reason they went with the story the way they did, but this game is hard enough to get in to. Something more engaging like a Darkest Dungeon voice would have gone a long way. The atmosphere of the game is cool, its just not all the way there as far as engaging game play for me.  Restarting over and over while you don't fully know what you are doing is another turn off and you die quite often in this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Look grinding and repeating what you did Isnt all that much fun....  You will die and you will repeat exactly what you did before because its a core game mechanic...  That is a ♥♥♥♥ way to drag out the small amount of actual game content... :/",
            "review_score": "-1"
        },
        {
            "review_text": "Sunless Sea has the potential to be best-in-class. Detailed backstory; creative stories presented as text-adventures; forbidding, dangerous environment; loads of continually-updating content; dark, beautiful atmosphere; original rather than cliched. Unfortunately, gameplay is dominated by moving your boat long distances over empty expanses that take long times to transverse. Due to limited resources, the game forces you to grind (ie doing port reports at the same ports each trip you take, or ferrying items to and fro) as the safest path. Combat is never worth while, but easy to avoid. Why even include it if it's always a bad deal?",
            "review_score": "-1"
        },
        {
            "review_text": "I don't really get the fuss over this game, the writing's perhaps a bit too clever for its own good, and it's incredibly slow.",
            "review_score": "-1"
        },
        {
            "review_text": "Crawl forward, die, rinse repeat.  The game of inches..  It's set in an interesting world, with cooky story elements and some cool indie-graphics.  If you have nothing else to do in your life, you can waste a lot of it here if you wish..  The trouble is..  There's just so much hopelessness imbedded in this game that it overwhelms the player, making me not want to play at all.  Every playthrough feels like a repeat of the last, just marginally better... If youre lucky. if not, it's time wasted.  You spend three hours slogging across the map, dodging monsters and selling goods, using the awkward clue system to gain something from the session.. only to feel your mood drop as you realise that it's going to require yo to grind for hours on end until you can afford even a single meaningful upgrade, unless you look up the most gamey exploits on youtube to actually get anywhere.  'oh but it's not a game for casuals' i hear you cry.. Well, grinding stones to dust using my left pinky isn't either. this game is more fun that that, but not by much.  Sadly, i can not recommend buying it, just watch some letsplays instead, theyre free and you can skip forward to the interesting bits whenever you want.",
            "review_score": "-1"
        },
        {
            "review_text": "never found the giant eye.... but i ate my crew. i think my crew was my favorite food.",
            "review_score": "1"
        },
        {
            "review_text": "Thank you for the free weekend of this game, but I'm sorry, I will pass on the 40% off for now.   I loved the artwork in this game, the exploration was the most rewarding experience for me. After this weekend, I've explored 3/4ths of the map and could have the last part explored in an hour or so. Come to find out there is an expansion on the horizon that adds zubmarines. I would have gladly bought this game this weekend as well as the DLC for the sale price, but with the DLC coming at a full price later down the line, I'll pass on this weekend's sale and grab them both on the next sale.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best roguelike games I've seen in years. The world is unique and interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Repetitive. Repetitive. Repetitive. This game has beautiful writing and nothing else.",
            "review_score": "-1"
        },
        {
            "review_text": "Utterly frustrating, utterly boring, utterly time wasting. Even if you cheat yourself 10,000 coins, max skills and infinite fuel, trying to save yourself six hours of boredom to unveil maybe a third of the map: whoops, one wrong click and you're dead. Start over. Map all fogged up again. Every story starting from scratch. It's like reading Chapter 1 of the same book over and over. Maybe chapter 2 is good. Maybe. I'll never know.",
            "review_score": "-1"
        },
        {
            "review_text": "I am spooked: the game. I got lured in by the gigantic, horrendous monsters. Instead i got slowly chugging along the ocean, sorry Underzee, trying to scrounge together enough cash to afford a faster engine so i can chug along slightly faster to do it all over again. Actually i lied, i encountered some crabs while trying to make my way to the Basalt Statues. I survived the first then clipped the side of an island by half a gnats *ss and died. Which because of the nature of this game means ALL work you have; crew, engine, gun, vessel, traits, and map die and can never be recovered. It does have a rather unique mechanic of choosing your relation to the last captain and scrounging one measly thing from him or her. And i know you can get a will that maybe possibly lets you keep all of it, but it's so prohibitively expensive i never even hoped to have one. I woudl've refunded this mess but i made the mistake of saying 'maybe with my new knowledge i won't get blindsided by ridiculously strong bats and crabs' one too many times and no longer qualify.",
            "review_score": "-1"
        },
        {
            "review_text": "good game. simple as that",
            "review_score": "1"
        },
        {
            "review_text": "Great atmosphere but you pretty much have to edit the game files to cut down on the tedium.",
            "review_score": "1"
        },
        {
            "review_text": "not for me. also too much text without much of a tutorial. no voice overs. rip",
            "review_score": "-1"
        },
        {
            "review_text": "Hours and hours... and I was doing so well... Then the option to kill off my character came up. It happens when you dock in london with no spare barrels of fuel left.   One wrong click later, my best progress and chance for victory is over... no bad roll, no bad situation, uninjured, ready to go, just one wrongly placed click...  So... I reinstalled and tried again... sucks having nothing to do....",
            "review_score": "-1"
        },
        {
            "review_text": "In the world of Sunless Sea, London has been swallowed under the earth about a century ago and now lies at the edge of a vast underground ocean where humans and others eke out an existence in the dark and morbid carverns. Its an odd world that has its roots in weird fiction like H.P.Lovecraft or China Mieville.  You are a boat captain setting sail into the unknown in your trusty vessel. Sunless Sea is an exploration game that shares elements of roguelike games, with its permadeath and a world that is semi randomized each playthrough. You will encounter weird and deadly creatures, odd cultures and cults, dark gods, ancient evils and strange relics. Almost all the main narrative conveyed through very well written passages of text, with the options available decided by the players inventory and previous experiences.   Between these bizarre encounters you will sail the world in real time, having gun battles with foes (And running like hell sometimes) and salvaging whats left. You can buy new ships or upgrade your current one with a variety of weapons and utility items, some vessels are cargo haulers, others are more combat focused. With each death you can carry something of you current captain onto the next, if you progress enough you can even write a will and leave all your progress to a future heir. Progress is slow and iterative, you will die and start over multiple time.  Its all together an unusual mix of gameplay elements that is somehow more than the sum of its parts. If I had to sum up the games greatest strenght, its atmosphere. The game has an amazing sense of place, the overwhelming sense of mystery is what keeps you playing, each captain slowly unfolding another layer of the puzzle.",
            "review_score": "1"
        },
        {
            "review_text": "Convinced a Rat Kingdom to fight for their independence. They all died. Pirates? Fine. Big ♥♥♥ crabs? Fine. Bondage Sharks? Fine. Jellyfish? Got rekt. Had a family in London while I screw around with my crew officers. I died. I died again. Guess what? I died. Again. And again.  10/10 Would play Dickless ♥♥♥♥♥ again",
            "review_score": "1"
        },
        {
            "review_text": "A pretty hard game to get into, but once you are into it i can highly suggest it. Have a beer or smoke a join, lay back and actually read the ♥♥♥♥♥♥♥ text for once, you wont regret it!",
            "review_score": "1"
        },
        {
            "review_text": "Oh. My. GOD. Could this game be any slower.  The writing is world-class. Like, some of the best from any game. Ever.  But the gameplay loop is tedious beyond belief. I wanted to like this so so SO much. It's everything I love about games and monsters and oceans. But I just couldn't stick with it.",
            "review_score": "-1"
        },
        {
            "review_text": "Very Fun: Creative, and will take every ounce of skill and pre-plan you can muster. It WILL be a dark tale of a damed crew..... I love the combat system, and navigation system. I just think the story should be voiced over.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great first run ran out of fuel had no money got towed and lost my ship and recieved a really crappy one I wanted to kill the tow guy so bad great writing and fun gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Its an amazing exploration game. Closest thing to a good star trek game I could find, but on the ocean, undeground.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - You can actually GO NORTH. You can also go East, but NORTH is just better; - Unaccountably Peckish is actually postitve trait; - FL setting! Yay!  Cons: - There is no Seeking (SMEN, if you know what i talking about).  7/7, A RECKONING WILL NOT BE POSTPONED IDEFINITELY.",
            "review_score": "1"
        },
        {
            "review_text": "We're gonna need a bigger boat.",
            "review_score": "1"
        },
        {
            "review_text": "Oh by Salt is this game good.",
            "review_score": "1"
        },
        {
            "review_text": "Love the exploration and figure it out vibe. It works well that the map is relatively stable from play to play.",
            "review_score": "1"
        },
        {
            "review_text": "“The sea always filled her with longing, though for what she was never sure.”",
            "review_score": "1"
        },
        {
            "review_text": "Thumbs Up.",
            "review_score": "1"
        },
        {
            "review_text": "i liked but didnt like its a cool game but flawed. you spend most of your time getting fuel and supply",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a huge sucker for nautical-themed games. Can't get enough.  I'm also a sucker for crisp graphics and an atmospheric soundtrack. So far, so good.  That being said, Sunless Sea is pretty heavily (but not exclusively) text based so keep that in mind when considering whether or not to give it a go. The game is pretty flexible and allows you to pick up quests and explore as you please. I would recommend looking up some beginner tips to get you started and help you figure out how to properly manage your resources. After a few dead captains I am beginning to get the hang of things and realizing how much content there is to discover. As the game says -- your first captain will probably die; later captains may succeed. We'll see how long it takes to find success. In the meantime, I'll enjoy exploring the unterzee. ",
            "review_score": "1"
        },
        {
            "review_text": "I'm a huge sucker for nautical-themed games. Can't get enough.  I'm also a sucker for crisp graphics and an atmospheric soundtrack. So far, so good.  That being said, Sunless Sea is pretty heavily (but not exclusively) text based so keep that in mind when considering whether or not to give it a go. The game is pretty flexible and allows you to pick up quests and explore as you please. I would recommend looking up some beginner tips to get you started and help you figure out how to properly manage your resources. After a few dead captains I am beginning to get the hang of things and realizing how much content there is to discover. As the game says -- your first captain will probably die; later captains may succeed. We'll see how long it takes to find success. In the meantime, I'll enjoy exploring the unterzee. ",
            "review_score": "1"
        },
        {
            "review_text": "Very attmospheric and great writing!",
            "review_score": "1"
        },
        {
            "review_text": "Too much water 10/10  Summary: Cat as a crew member",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game! Its very challenging and beautiful",
            "review_score": "1"
        },
        {
            "review_text": "It's like Rogue Legacy meets FTL meets some measure of Lovecraft meets 1800's London and Steampunk all at once. The backgrounds and soundtrack have lent this game a whole eerie yet grasping curious feel. You'll start off in Lost London with little to nothing to your name and venture out, no idea where you're going or what you're doing. And the then the game twists your arm...slowly.  From watching a mansion burn to eating nothing but salted bat wings and watching glowing crabs pass beneath your hull whilst out of fuel in the middle of nowhere and your crew eating each other as a shark approaches your silent guns...my word.   I am absolutely in love with this game simply for the logbook and text and some of the information tidbits and how easily this game crafts an absolutely alien world in a matter of seconds as you explore unknown territory and your map lights up and you discover yourself and your ship all alone in a foreign area, low on food and fuel and begging the gods to help you.  Do yourself a favor...DO NOT READ THE WIKI for this game. It will ruin the magic for you here. Go out there, play, start your engines, run out of fuel, eat your dead and pray to fickle gods to have mercy upon your souls. Just hope you have enough crew left to pilot your ship once your plea for fuel has been granted...  And as your ship sinks, your crew flounders around you and the fish begin to devour you in the murky depths of an emotionless ocean...carry on your legacy.",
            "review_score": "1"
        },
        {
            "review_text": "Lost all my men. Got crabs. Died. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but the grind will put you off. There are no feeling of progress after a certain time, because it comes down to too much grinding to be able to do anything in the game. It's deadly boring to start over again (because you will die while figuring out how to play the game), because the game isn't rogue-like, so everything is the same. A sequel will probably bring this IP to new heights, but for now, don't buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "The Zee is a darn and unforgiving place, but it is also a damn fun place",
            "review_score": "1"
        },
        {
            "review_text": "I went into the game without knowing what to expect. For the first half hour or so I thought it was a noir remake of Tradewinds. I spent my time trying to find trade routes. This was wrong.   I ran out of supplies real fast and my first captain was left in the middle of the sea stranded without a crew because they cannibalized eachother. Thus ended my first captain.  This is a roguelike exploration and story driven game. The point is to sail from island to island progressing story by carrying certain items in your hold. The island positions change with each captain, so it is unlikely for any two plays to be the same.  The zee calls   ",
            "review_score": "1"
        },
        {
            "review_text": "Maybe I didn't give this game enough of a chance, but honestly I can't stand it. It gives the feeling of being dropped into a pre-established series where the player is expected to be familiar with the game's mechanics and lore. It does deliver a spooky atmosphere but the true horror comes from reading the extremely verbose text, which is hard to do when trying to navigate, steer a ship, keep fed, and attempt to piece together a contrived storyline. Wonderful music, great steampunk design, but overall this game is the edgy kid in your high school gym class who thought he was smartrer than you because he read Lovecraft.",
            "review_score": "-1"
        },
        {
            "review_text": "This is really boring, I dont know what 'pages', 'mirrors' or 'hearts' really do and I'm 7 hours into it (and don't tell me to google it). I died 4 times and was never better off when I spawned a new captain. There are ports to visit but all you do at each port is click through a short story about the weird inhabitants, gain a 'port report' that you can turn in for a little bit of money and move on. The ship combat is uninteresting... kite, wait for a cooldown and shoot another tordedo that has a %100 accuracy if you wait long enough. 'Wait' seems the key term here. Wait for a different game that doesn't suck.",
            "review_score": "-1"
        },
        {
            "review_text": "A resounding 'meh' on all fronts. I was expecting atmospheric Lovecraftian horror instead I received Herman Melville-esque tedium.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh I wanted to love this game but after just 1 hour and 2 deaths I cant bother playing anymore. What's gonna change if I try again? I cant get fuel or supplies, and some crab will kill me eventually. And god my ship is so slow.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, little twisted but no one said that was a bad thing",
            "review_score": "1"
        },
        {
            "review_text": "I had a long multiparagraph review written for this game where I wrote in detail about my frustrations. But then steam crashed and wiped it all out.  In short: The game is a grindy time-locked textbook and gigantic time-waster misadvertised as a roguelite. Go visit your local library or bookshop instead if you like reading. Story-focused games and roguelites don't mix. I can't recommend the game to anyone am done trying to play it. Wake me up when the book his the shelves.",
            "review_score": "-1"
        },
        {
            "review_text": "Either it's minimal and inoffensive, or bland passable stuff like for the triple-A's. Or the real dumb stuff that makes me want to choke. I've played lots of video games, but I definitely have never gone to them for the quality of their prose. This game's is good. It's pulpy, there's the occasionally way overblown bit or a cliche here and there. Mostly it's good, and engaging, and I enjoy it.  It's grindy, tough to make headway. Who cares, only ♥♥♥♥♥♥♥s do.   + 1 000 000 points for the Conrad quote. I made my captain a poet and named him Marlow.",
            "review_score": "1"
        },
        {
            "review_text": "First attempt. Died because the random generated numbers stipulated that a huge megalodon shark appeared right before the initial city.  Second attempt. Died because the random generated numbers stipulated that three cities in succession wouldn't have fuel to sell.  Third attempt. Died because The random generated numbers ordered that even an industrial city found to the south would have no food to sell.  The sea isn't your enemy, the random generated numbers are.",
            "review_score": "-1"
        },
        {
            "review_text": "If you can buy into the premise of this game, you will love it. It is almost entirely text based. Yes there is ship to ship combat and sailing, but that isn't why you will love this game. The writing is excellent, the setting is amazing, and the art fits the rest of the game perfectly. If you are looking for a game with excellent gameplay look elsewhere. If you want a great story and a very well written Lovecraftian world, Sunless Sea is for you.",
            "review_score": "1"
        },
        {
            "review_text": "I cannot begin to praise the simple elegance of this game enough. With the news of a sequel on the horizon, I urge new-comers to the franchise to give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe I was expecting too much at the begining... what a disappointment... the story was poorly written, the UI was awfull, and the combat fell dull 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "4 hours after playing, a spawning glitch has prevented me from progressing any further. The glitch persists even if i redownload the game. I would give this game a great score but i can't even get it to start anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is great, if you are a true love of Lovecraft, this really takes me back to his tales.  The game is not about about grinding, or combat mechanics as they are all complaining, or even resource management. It is about personal terror and horror stories. Is about finding out what happened to this people, what drove then delirious and what goes on under the mists the covers London and its surroundings. It is about a character that tries to keep it sane under all this different kinds of stress.  The negatives reviews all sound like they skip the stories and go for hack and slashing enemies and making money.  The story is very rich but It lacks a decent tutorial. I would pay a hundred bucks to have this game narrated.",
            "review_score": "1"
        },
        {
            "review_text": "Too much water.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I will probably be beaten to a pulp by the positive reviewers,  But what you are looking at here is pretty much Fallen London but with an extra top down 2d map where you pilot a very slow vessel tediously across a map of the Underground Sea.  The world itself is original but the gameplay elements that are the innovation I find tedious, and experience a lack of control for even basic needs like getting enough fuel and food.  For example:  Because of the rogue-like nature of the story, I can't simply just buy items in one port, ship them to another and then sell them.  Instead you get port reports, which you may or may not be able to use to trade for food or fuel (because there is still an element of luck).  Travelling from one location to another can take upto 30 minutes, in that time you have random encounters with sea-creatures and so forth. This would be okay, but I found the combat irritating as you need to stop and start your steamer and then hit them with the gun. The gun seems to be based on a skill roll so sometimes it will miss.  You get stuck in situations where you have 1-2 supplies and no way of getting more, what Captain would knowingly set out with starvation hours away?  Positive: The world The narrative  Negative: Everything that makes it a 'game'",
            "review_score": "-1"
        },
        {
            "review_text": "The game which purpots being explorative got me killed just for reaching the end of the map. Nothing else of fun in this dull piece of schizophrenic flop of a videogame was noted.",
            "review_score": "-1"
        },
        {
            "review_text": "Funny enough, buying this game made me reread Clavell. Worth it for sure. Fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Its good =)",
            "review_score": "1"
        },
        {
            "review_text": "Funless Zee  The definition of: Tedious [ˈtiːdɪəs] ADJECTIVE Too long, slow, or dull; tiresome or monotonous:  'a tedious journey' synonyms: boring · monotonous · dull · deadly dull · uninteresting · unexciting · unvaried · unvarying · lacking variety · mind-numbing · mindless · soul-destroying  I want to like this but it's so damn dull. My large play time is down to how many times I fell asleep at the keyboard.  It's has very nicely written stories, unfortunately due to the way the game is balanced don't expect to see anything but the first few stories over and over and over and over and over again.   A big ZzZzZzZzZzZz on the Zee.",
            "review_score": "-1"
        },
        {
            "review_text": "Free weekend:  I think its a good game but its very difficult english for me (and I played alot of games in english and didn't struggle) You need to have almost native speaker level to understand this properly. Please translate in other languanges (for me its german) and I'm your customer.",
            "review_score": "-1"
        },
        {
            "review_text": "Bats pushed me out of port and sank my ship. 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "It's nice and hard, like dark souls, but in top-down nautical adventure form  However  started playing, died a few times ExpectedThat.jpg Got a bit further, realised all the little extra stuff I earnt was lost when I died OkThatsABitHarsh.gif Finally saved enough currency for a bigger ship WhatCouldGoWrong.doc Crew stages random muttany, kills me, I lose my ship, back to square one #♥♥♥♥ThisShit #RageQuit  Now back to Dark Souls because at least Dark Souls doesnt strip me of all my weapons and Armour when I die",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay itself is fairly barebones from a technical standpoint but this is more than made up for by the suberb writing, the atmosphere and the sense of exploration and survival you get zailing the zee. I normally consider even 'great' video game writing to be comparitively subpar but this game blew me away. Worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Thanks to the positive reviews, I got conned into playing this POS 'game', how anyone can enjoy this boggles the mind, I should of read the negative reviews before buying. 6 hours into the game, and all I've done was run from enemies, discover ports I've discovered in my initial playthrough, and trying to get enough money for one augmentation, yet I guess the only way to do that is to cheat, and memorize where every enemy is, and port, maybe in 500 hours I'll get to that point.",
            "review_score": "-1"
        },
        {
            "review_text": "Not quite what I expected. Atmosphere and story is cool but wasn't a fan of more tedious aspects of the game. I barely left London port it seems and didn't compete much for missions and was running out of fuel too quickly for my enjoyment.",
            "review_score": "-1"
        },
        {
            "review_text": "How do I get a refund? this game was clunky and confusing and the trailer was deceptive. What I thought the game was sposed to be like and how it actually was were totally different.",
            "review_score": "-1"
        },
        {
            "review_text": "its boring imo",
            "review_score": "-1"
        },
        {
            "review_text": "Only english... if your are'nt native english...this game isn't not for you...",
            "review_score": "-1"
        },
        {
            "review_text": "its really hard (HUR DUR THATSWATHESAD) and i cant survive because of starvation! CREWMEMBERS KEEP ♥♥♥♥ING EATING EVERY 2 SECONDS",
            "review_score": "1"
        },
        {
            "review_text": "Amazing atmosphere and story and solid gameplay. A ton to explore and a very interesting world. Would recommend",
            "review_score": "1"
        },
        {
            "review_text": "After 26 hours of play, I've decided to write a review. There are many good reviews already, so I'll try to make it short. Sunless Sea is mostly an exploration game and interactive fiction, with some rogue-like elements, including permadeath with the possibility of passing things to your next character, and semi-procedurally generated environnements. The universe is mysterious, intriguing like Lovecraftian universes should be; you get stories there and there, and you have to put the pieces together. The 2d graphics are gorgeous in my opinion, the art style is great, and the shaders are beautiful. And the writing is great.  The game feels a lot like interactive fiction. There are two main aspects to the gameplay. There's sailing the  zee , where you explore the vast  Unterzee , fight enemies, using your keyboard to move and attack, while keeping an eye on your fuel, supplies, and Terror level. And then there's the reading : when stopping at a port, the game feels more like an interactive fiction. There are many interactions, with different conditions, choices, and sometimes a random element. The two aspects of the game complement each other. There are also random events when you're at sea, text can pop up while you're  zailing , with choices to make most of the time. If you've played Fallen London (the game), you may be familiar with the storylets system used in the game. If not, you may want to check some gameplay videos, just to see if it's your cup of tea.  Sunless Sea is primarly a game of  choices . You'll have to make  lots  of choices. And not only in the 'interactive fiction parts', but also while explorating. If you go that far, will you manage to get back to Fallen London (the main city)? Will you be able to buy enough fuel and supplies if you buy that thing? Can you afford to take a detour to go to this place?  The game can be hard when you start. My first captain died after a few hours, with no heir, and no legacy anyway. My second captain survived 20hrs+, and he's still alive (although it's probably because I can be very cautious). I don't find the game that hard. It's just  really  grindy. Discovering new places feels great, but you won't always discover places, and sometimes you may not have enough fuel/supplies/money (to buy those) to go further into unknown territory. Making money will seem hard at first, but once you understand how the game works, what each places need, and where you can get what you need, making money and progressing the game will be easier. If you're cautious like me, you may survive for way longer than you thought, and even secure things for your next captain! Keep in mind that exploration and reading+interacting are the main focuses of the game. The combat system is not great, you have no way to dodge an attack, and most of the time staying close behind an enemy will grant you a boring and relatively easy victory -- because enemies can't fire backward. So that's one flaw, but not  that  important, because once again that's not the focus of the game.  I'm a little worried about the replay value on the long run, because my second captain is still alive after 20hrs+ and I've discovered a good portion of the map. But with a different ambitions, different choices (and the choices that come after), different focuse (combat, or exploration, etc.), I think I could go with a third captain when my second one dies.   tl;dr  Sunless Sea is a great game, and you should buy it! It's a great mix of exploration, a little survival, and interactive fiction, with lots of stories to read, and choices to make. The universe is intriguing. The lore almost secret. And the writing is good. The game may not be perfect -- I'm looking at you, combat system --, but it's still great!  One advice for future  zailors : when leaving port to sail the  zee , stop at as many ports as you can, even the ones you've already visited, because reporting back when returning to the main city will earn you some money and fuel.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing atmosphere and writing. This is the only game I've played in years where I've actually found myself interested and involved by the quest text. I'm so used to blasting my away through opposition in game after game that it's refreshing to be the one who runs scared, finds the way around, because fighting is dangerous and unprofitable, while still looking forward to getting strong enough to go toe to toe with the enemies that chase me.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. One of the best combinations of writing, sounds and graphics I've ever seen. I can't express how much I liked this game. At first, you'll feel a little lost but after a few 'lives', you'll know what to expect but that's when the magic happens: This game have so much content, you'll find yourself passing ten time a city/place/enemy without knowing 100% of what there is to know.  BUT... You NEED to know how to read. Seriously. There are a lot of elements that you can skip-read but the soul of the game lies in the way every dialog is written. It's an amazing job, an work of art that a lot of games simply won't have in a thousand years. The game express itself through words and unless you read at least part of it, it'll be just a shallow indie-rogue-like game with a nice soundtrack.  Go ahead, explore, have a child, a new boat... It's a huge and dark world out there but you'll love it for sure.",
            "review_score": "1"
        },
        {
            "review_text": "really fun if the travelling between points was not so long and silent...sadly big emthasis on the silence. the story telling is amazing when you do reach to places that is if you survive your way to a port. if you do not mind reading then this is your game as it's quirky hilarious. the best addition for this game would have to be voice acting for the walls of texts especially since the lack of music really makes the journey between ports a rather soul sapping. after watching a totalbiscuit research stream of the game (especially the portion where he decides to narrate/VA) it is even more prevelant that some good voice acting would just make this game shine. it is still a good recommendation if you have time for a high management based game with its own flavoured version of quirkiness and craziness too.",
            "review_score": "1"
        },
        {
            "review_text": "It's hard to think of another game in recent history that has grabbed my interest and sucked me into it's world so thoroughly as Sunless Sea. The storytelling alone is compelling enough for several runs at a time. Also for once is such a thing as a 'Terror' or mental state mechanic properly implemented - and actually terrifying.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliantly atmospheric. Simple gameplay leaves room for great story telling as you creat your own adventure in the terrifying world of fallen London.",
            "review_score": "1"
        },
        {
            "review_text": "Best steam game i have so far, sunless sea is not only relaxing its hard as well, just the way i like it. I have been recomending this game to friends, this game is just beautifully made i hope to see more dlc to come, to the devs of this game, make it multiplayer where you can kill and loot other players to make it much more interesting, let players make their own quests.  Pros Hard, but has a merciful mode for those who want it easy music is just excelent and relaxing Multi Side-quests and extremely fun main quest if you like exploring this is the game for you at 72 hours and going i think i have done most but not all side quest If you die you may gain some bonus stat points from your last captain muliple ending on side quests (get to learn them all :) )  Cons Slow paced Permanent Death Multiple Things can kill you in this game  Fun game recomended to try or play if you like exploring or just plainly want to play a game that is just wonderful",
            "review_score": "1"
        },
        {
            "review_text": "Intense and unusual. This is a game that is hard to describe, as it doesn't fit inside any one box. It can be appraoched from a variety of angles and survival is difficult but rewarding. Choices have extreme consequences, good or bad. Risk taking is a must to aquire the most desirable results.  I like the mix of text/action, and am impressed with the depth of the puzzles and quests. I do experience a degree of frustration at times, and recommend saving your captain if you wish to see them again! ;) I am not a great player, or even a very good one. I am, however, a very satisfied player. I expect to devote a great deal more time to this one.",
            "review_score": "1"
        },
        {
            "review_text": "A very empty and lifeless world. There are very few things to interact with outside of towns and usually its either fight or flight. Combat was nice. Trading offers little money. Best way to make money is to go from port to port collecting reports to cash in at Fallen London.   Didnt capture my interest at the end",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game! It's got such a neat world and lots of things to do and explore",
            "review_score": "1"
        },
        {
            "review_text": "Do you like reading and backtracking? thares your ansure to werther or not to buy this game",
            "review_score": "1"
        },
        {
            "review_text": "If you want an action-packed game of excitement, you're in the wrong place.  If you want an exploration game with a steampunk asthetic that just oozes atmosphere, play this game.  Set in the universe of 'Fallen London', you take the role of a Zeecaptain on a mission. Who you are, and what your mission is, is entirely up to you. The narrative driven story feels like a combination of Terry Pratchet and H.P. Lovecraft.  The game itself is equal parts exploration, trading, and resource management. Run out of fuel? Scuttle the ship and start again. Run out of food? Eat the crew. 'We were merciful, our knives were sharp.'   The best things about this game, are the aforementioned narrative, and the soundtrack. The soundtrack is wonderful, with shanty-like tunes heard in the Fallen London port, to opressingly foreboding ambient sounds of the Frozen Norrth, and Kingeater Castle.  The only downsides to this game are the difficulty, and the learning curve. It's easy to learn what to do, but it will take time to learn what you're doing.",
            "review_score": "1"
        },
        {
            "review_text": "If you like eldritch horror, the British Empire, and a very evolved story, get it. If you want good combat and can't really get into a good tale in an almost 'choose-your-own-adventure' style, don't.  Pros: Really engaging story Great atomosphere Fun art style Decent progression Eldritch horror  Cons: Weak combat: Circle and shoot Can feel like you are just grinding for cash - this really is a game about story",
            "review_score": "1"
        },
        {
            "review_text": "A great and challenging Lovecraftian game of exploration and risk.",
            "review_score": "1"
        },
        {
            "review_text": "A fulfilling 'roguelike' jaunt into the depths of Lovecraftian madness. This game has a way of building suspense and fear that is hard to compare to anything else. I had a lot of fun with it, and would definitely recommend a play to anyone else.  That being said, it does feel very grindy in progression at times, and after a while I felt as though I was playing the mechanics rather than the story.",
            "review_score": "1"
        },
        {
            "review_text": "A lovely game. The focus is on storytelling with exploration and some bits of action. ",
            "review_score": "1"
        },
        {
            "review_text": "You had me at 'eat your crew'. Amazing game with amazing story telling. Highly recomended.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a delightful mix of story-telling, role-play, and survival. Choose your zee-captain's backround, sail them to their destiny. Explore dystopian societies, people driven mad by the fall of mankind into the darkness of the world. Sunlight does not exist here. Try to keep your crew's sanity in check, lest they mutiny against you. Discover the Gods that haunt your every move at sea, battle pirates, or the terrifying creatures that roam the dark waters.  Such a simple game, but so easy to become completely engrossed in the story. My favorite purchase during the Steam Summer Sale. Even the soundtrack is excellent. I highly recommend this game. How long will your captain live?",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed sunless sea. I enjoyed the writing and it hooked me as I sunk 150 hours into this game. The rouge like elements are very... unforgiving, but the inherritance system softens the blow a little bit. The game is very story driven and dripping with atmosphere. Nothing keeps you on the edge of your seat like knowing that the character you sunk 20 hours into might die. Anyways after my time in sunless sea I walked away after getting the easiest ending.",
            "review_score": "1"
        },
        {
            "review_text": "Follow the call of the wretched under sea!",
            "review_score": "1"
        },
        {
            "review_text": "When I first jumped into this game, I expected an easy trip. Man was I wrong...  Sail through a dark sea, in a world filled with devilish nightmares. Discover forgotten cities and explore deep catacombs in this text story driven nightmare. Wanting a sense of adventure? Don't get too excited, you might not last the night in this unforgiving game.  Didn't bring enough food or fuel? That's ok, there's no turning back now... The smell of burnt flesh in the air only makes you stomach growl louder.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ ME IN THE ♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "I was curious about this game for a long time, but I wasnt totally sure I would get it. I WANTED to buy it, but I couldnt quite make out how the game really was by the screenshots. Well, I am EXTREMELY glad I bought this game. I'm very addicted to it, and it is a very unique experience. Great writing and a highly imaginative world, set in the mechanics of a simple sea merchant sim. It's like 10% arcady action 40% merchant sim and 50% story. Such a wonderfull game and even worth the full price.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun. The writing is top-notch and the game's world is fascinating and unique. There is so much to explore and it's an enjoyable exercise trying to uncover all the secrets that are hidden in each of the game's locations.  If you're a fan of rogue-likes such as FTL, or top-down RPGs like the Escape Velocity series, this game is definitely for you.",
            "review_score": "1"
        },
        {
            "review_text": "I tried this during the free weekend, and I must say, I really enjoyed it. It is tough to start, and the balance between fuel needs and exploration can be difficult, I would highly recommend it to anyone with the slightest interest in exploring a cthulu-esque type world. As for myself, I can probably see picking this up fully at some point in the near future. The graphics are excellent for this style. The writing and story are very immersive. I quickly lost 13 hours into it over 3 days. (I actually had real world obligations also)",
            "review_score": "1"
        },
        {
            "review_text": "Very hard and strategy-heavy. But I cannot seem to put it down, Maybe its the great wide Zee... Or its the interesting characters, Or the harshness of the Zee Gods. I recommend playing this, Especially if you are a fan of challenging rogue-likes.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly Difficult, but Incredibly Cool.",
            "review_score": "1"
        },
        {
            "review_text": "I managed to log 18 hours during the Free Weekend, The game has definitely got me hooked, I still feel as though there's lot's more to explore and do so will definitely be picking this one up",
            "review_score": "1"
        },
        {
            "review_text": "Spooky Scary Sea Monsters Anyways, this feels like a mixture of Darkwood and a boat simulator with a pinch of cthulu. If you like cannablism or being stressed, play this game.",
            "review_score": "1"
        },
        {
            "review_text": "If you buy this game then you will become haunted by the inescapable dread of Yog-Sothoth and Cthulhu. You will be driven to madness until the sky collapses into the sea and the Great Elder Gods tear all existence from the planes of reality. 5/5 but what does that mean anymore?",
            "review_score": "1"
        },
        {
            "review_text": "Not the sort of game i'd normally go for, but really surprised me with how enjoyable it was. Great atmosphere and really good writing.  Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend it it is really fun",
            "review_score": "1"
        },
        {
            "review_text": "Buy it if it goes for around $10. I played it for 3 hours straight, and while it was incredibly engrossing, the story is going to become the same thing just in a different order after the first few captain deaths. The atmosphere and music is incredibly well-polished, but it's still basically just a high-budget free flash game. I can't recommend this game for the current price, but I will recommend the game as a whole because it's worth buying on sale. Polished game, plays like your favorite flash game, great music and story, just keep in mind that even with free new content the replayability is still just above what I would consider acceptable for a slow-paced rogue-like.",
            "review_score": "1"
        },
        {
            "review_text": "Just play it",
            "review_score": "1"
        },
        {
            "review_text": "start my fourth captain do really well go far north lose fuel sacrifice my crew, limp back to port buy fuel, can't go full speed. limp back to london, lose fuel again. lose ship, get dingy. 10/10 would fail again",
            "review_score": "1"
        },
        {
            "review_text": "Lots of outcomes from this game. Full of surprises. You need a steep learning curve for this game but once you get used to it. Its a lovely game. Finished the game once and will play again. I just hope the game keeps on expanding with the storylines",
            "review_score": "1"
        },
        {
            "review_text": "It's all about stories like 'We went to the furthermost north, entered the ancient ice tower, it terrified the crew, they mutinied twice, both times we scotched it; after all we were slowly swimming home having 31 of 40 zailors dead'.",
            "review_score": "1"
        },
        {
            "review_text": "I have never seen a crew eat so much. Ate all our supplies. Eat one another. Eat a golden crab. Saw a golden dreadnought. Flare. Die. Bottom of the zee.  11/10 ",
            "review_score": "1"
        },
        {
            "review_text": "My experiences with this dark, memorable game so far. Potential small spoilers, nothing that will ruin your experience but might help you decide if you want this game.  I was exploring the game Sunless Sea, where you adventure across the dark ocean in a dark London.I met a female spy and consequently bedded her, resulting in a child. I at the time was only living in a small room above a pub, I had the money to buy a sizable manor from doing work with the mafia. I ventured out once more on an errand for the Admiralty for the Royal Navy, only to come across a woman up far north in the coldest of places, asking to join my crew. I declined her not realising that she would put forth a dark evil upon me, a curse I didn't think much of it and ventured home. I came home to a dead lover and a dead son. My neglect to buy the manor before I left shore and take in my son had left my him without a good home, leaving him and his mother to die. The curse caught up with me, The Zee had caught up with me, It had taken my family. I asked the harbour master about the happenings around London, he told me the mafia worker wanted to speak with me. An errand He gave to me to venture to the far east to fetch an expensive shipment had gone under my nose and therefore forgotten. He was not happy at all. The local authorities, bribed, had fired upon my small vessel, ripped steel from steel and taken me and my crew.  The Zee had me now.  That's my first three hours of Sunless Sea. ",
            "review_score": "1"
        },
        {
            "review_text": "Perhaps the best worldbuilding in a video game, Sunless Sea will have you leave the safe paths and harbours to chase new stories and discover even stranger places, until one day your luck will run out and you will meet your end.  If you let it. Do not approach this game as something to beat, Sunless Sea is something to experience ",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. The story and writing are superb and the gameplay is fun if a little grindy.",
            "review_score": "1"
        },
        {
            "review_text": "Very difficult trade system. Unforgiving exploration. Elaborate Wyrd-Victorian world that will probably see you die several times over. 13/10 would go mad again and devour my crew.  Update 29 Jan 2016: Slightly more forgiving, distance/time to get from point A to B is less painful.",
            "review_score": "1"
        },
        {
            "review_text": "Made it about an hour north from London. Almost starved before I could buy some food. Sunk by a living ♥♥♥♥♥♥♥ iceberg. I was told upfront that my first captain would likely die, and quickly. Doesn't mean I have to like it. Music, art and writing are excellent from what I've seen, but it could be a lot more forgiving. Even for a roguelike.",
            "review_score": "-1"
        },
        {
            "review_text": "A very different game, but very very slow paced with many short stories spread out across the game.  Its not a big combat or trading game. Its more exploration-based.  Found it entertaining for a while, but it in the end its just kinda meh.",
            "review_score": "-1"
        },
        {
            "review_text": "A light grows in the far south-west. It begins like a distant bonfire, but very rapidly, it becomes brighter, brighter. It looks remarkably like sunrise. Some of your crew fall to their knees;others duck behind cover or shield their eyes. One cries,  'Dawn Machine waking!'",
            "review_score": "1"
        },
        {
            "review_text": "Sunless Sea is more a story rather than a game. The story is incredibly deep and it's not just spelled out for the player but instead told in tidbits whether it's from an entire mission/quest or a journal log or a landmark. The Zee seems like a different planet when really it's just an underground sea. The atmosphere this game gives off is one of a kind. I've never felt more unsettled and awestruck at the same time. The game is beautiful, atmospheric, and unique. Sadly gameplay wise the ship sailing takes much longer than it should, combat is repetitive and dull, and permadeath evokes a constant repitition of finding the same islands you already discovered your last playthrough. The real goal of this game is to explore every island and exhaust all dialogue options available, not upgrading your ship and making a bunch of money. If you enjoy an amazing story told through context, like how a Dark Souls game would do so, and don't mind a little repitition and dull combat then Sunless Sea is the game for you. I don't believe 19 dollars is a reasonable amount considering how small this game is but at about 10 dollars when on sale I would say it's definitely worth it",
            "review_score": "1"
        },
        {
            "review_text": "You go in expecting some 15 min time killer, with tons of text you don't care about and no indication as to what to do, before you know it it's been 4 hours and you have done nothing but travel in random directions, fighting pirates, selling information and loot and wondering how it can be so engaging with actually so little to do",
            "review_score": "1"
        },
        {
            "review_text": "Overall positive although I wish they would have made an option to go automatically from port to port once explored. The navigation and combat isn't well made but the story and atmosphere makes up for it. Just be sure you are patient enough for the slow gameplay that is the navigation between islands.",
            "review_score": "1"
        },
        {
            "review_text": "I liked it on free weekend, but this is a game where I really need to wait for a sale #OnWishlist #Following",
            "review_score": "1"
        },
        {
            "review_text": "Dense writing, enjoyable read. Limited scale and highly repetitive in the initial playing (and dying) of the game over and over.",
            "review_score": "-1"
        },
        {
            "review_text": "Why I would recommend it: + Very good stories, new ones comming constantly + Stories are also interactive + Dying is part of the game and not that uncommon when playing  Why I wouldn't - I spend a lot of time staring at my screen, waiting for my SHIP to arrive at a port (more on that after the spoilers)  What could be better: * Make it clear that Echo's are money and you'll spend it when it says ' requires at least ... x Echo's ' &lt;- be warned     !!!! --- spoiler alert --- !!!!  !!!! --- spoiler alert --- !!!!  - step learning curve * you get a lot of option in the beginning of the game, making it hard to know what is expected of you  - make the mascot do suggestions that you can follow in the first steps of your story  - limit the options: limit the shops by requiring 'trust' or 'rank' before the shops become available * I've spend a lot of time staring at my screen, waiting for my SHIP to hit port. You can buy faster ships later when you have more cash, but....  - limit the distance from ports in the begining of the game.  - give better directions towards the ports regarding distance, (further than port A, just north of port B,...)  ",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Deceptively simple, and yet full of depth; it's challenging, gorgeous and engaging. Huge replay value, tons to do and explore, quite the experience!  This game has earned a permanent spot on my favorite list.  Buy it now!  And make the developers make more games in this world! Please!",
            "review_score": "1"
        },
        {
            "review_text": "It has very proud interactive story content. Liked it very much. Scene illustrations creating mood for the text. Then in the zea, graphics are too very sweet.  Some battles in the zee are at first complicated, but then they become very primitive.",
            "review_score": "1"
        },
        {
            "review_text": "Nearly a masterpiece, it only down is that it's still on development, which is even a good thing. The game is awesome totally recomend it the only game you play is no other than CoD or Minecraft because i'm sure many kids won't like it or appreciete how it is.  -Unique gameplay style, the single game on it's concept 9/10 &lt;---- Becoming 10 with the new expansions",
            "review_score": "1"
        },
        {
            "review_text": "Sunless Sea is an exploration based rogue-lite game, very similar in essence to FTL but with much more depth. The game involves you sailing on a vast subterranean sea with the main aim of exploring as much of it as you can. Its not just about exploring geography though, each island has its own story to unravel, and the world of the Unterzee is full of fascinating lore. Speaking of which, be prepared to read a lot in this game, and I mean alot. Sunless Sea is as much about reading as it is sailing. That said, every story you discover develops based on your decisions and the experiences you have had, and you have an incredible amount of freedom in how you play. Resource management is a huge part of the game too; conserving your fuel and supplies and maintaining your ship and the sanity of your crew is essential if you want to survive. However, being a rogue-lite game you are expected to die a lot, and in fact there is a legacy system where certain thinsg will carry over to your new character after each death. Finally, if you're wondering whether this game will run on your PC then don't, thanks mostly to the artstyle of the game it will run on pretty much any PC perfectly. If you're a fan of rogue-like/rogue-lite games then you will love Sunless Sea.  8.5/10  You will find yourself wondering where the hours have gone.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most gratifying narrtive games I've ever played. Sublime writing across the board, from neat little flavor texts for items to long overarching quests. Sunless Sea is the perfect game for you if you want to completely immerse yourself into a world and its story. Don't expect an easy game, or a quick one. You need to stick with Sunless Sea for the long haul. Be prepared to die and die and die again just to get the hang of it, but once you do, you'll find a gem of a game that's relaxing, mesmerizing, and terrifying, in equal parts.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing and tense game.",
            "review_score": "1"
        },
        {
            "review_text": "Not for non-readers. You will read, a lot. No, seriously. But, if you are literate, it's totally worth it. Lovecraftian without being blatant rip-off about it.",
            "review_score": "1"
        },
        {
            "review_text": "Addicting as ****! played the game over 20 hours the last 2 days... maybe time to get some sleep xD  P.S. this game might give you some office time... with your boss... T.T 10/10 would be yelled at again.",
            "review_score": "1"
        },
        {
            "review_text": "This is the type of game you'll either really love, or really hate. I personally love the lore, writing and choices you can make to impact your crew, your ship, and even your officers. However, it is grindy, as any RPG can be, and starting up is hard. The game even tells you that. But I think the game's biggest appeal lies in the mystery, the challenge of the Zee and how darn hard it can be and how the rewards you get are sometimes only worth it in persective. YOU have goals you need to fulfill that are up to YOU, which can change the game from a grindy mess to a challenge for glory.",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite different from the trailer, but it is still a great experience. The world and lore is phenomenal, but extremely unforgiving. It takes a vast amount of time and restarts to be able to survive long enough to do anything. Stray monsters or ships will destroy you in the blink of an eye by sheer chance but its far more likely youll run out of necessities. The main focus of this game is to keep your ship afloat long enough to explore. you will have to manage money, fuel, and supplies in a world where they are difficult to aquire. you cant just grind for money, you mostly get it by completing the story so you have to take risky judgements and hope there isnt a dreadnought ship on your way to the next dock. 25 hours in and i was far from ending anything by the time i got tired. BE AWARE that the first 20 hours of that was merely figurig out the subtleties on the story so my next captains could survive and do it right, i kept a notebook of what each dock sells at what price. i strongly recommend recording info because you will definately be doing what you just did several more times hours later.",
            "review_score": "1"
        },
        {
            "review_text": "The light swallowed me unto the murky depths of sanity's last breath.",
            "review_score": "1"
        },
        {
            "review_text": "I had bought this when it was released and have absolutely loved it. It's an amazing game based around discovery interesting story and a lovecraftian ambiance and Soundtrack that binds it all together nicely.  The Zubmariner DLC is an amazingly clever DLC it can take quite long an be quite boring to traverse the full length of the Map so adding content would be quite hard, however by simply giving one the ability to dive they have practically doubled the map size without fuel/length problem, lots of new stories, places enemies and of course, a new ending one can achieve. ",
            "review_score": "1"
        },
        {
            "review_text": "I have to use headphones while playing because the music creeps out my flaymates. Great atmosphere, very interesting story, higly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "The creators of this game, Failbetter Games, have run a web browser game for a while slowly building up a world, filling it with endearing characters, bizarre locations and fascinating situations; all in words and pictures. And at the center of it all was you 'the delicious friend' the perilous knife fighter, the inconspicuous 'law abiding' citizen, the... et cetera. However, this was really a game as much as it was a pick your own adventure book with no permanent endings(as far as I know). From this Sunless Sea was conceived.    This game is like reading a book...",
            "review_score": "1"
        },
        {
            "review_text": "One Big Mind F*ck. it's the sh*t.",
            "review_score": "1"
        },
        {
            "review_text": "This game is better than it looks. Meow.",
            "review_score": "1"
        },
        {
            "review_text": "There is grinding. There are maddening, brutal, random events. But the writing is gorgeous and the ideas - the stupifyingly surreal ideas - make you want to read on, to find what the game wants in order to progress. I've stopped playing this game three times and once my tears of frustration dry, I'll pick it up again one day.",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing this game since it came out, and I love it every bit as much as when it came out. The backstory is wonderful, the art is spot on, and the gameplay sucks you in with madness and beauty. The Zubmariner expansion is a great addition to the game, with al lot of new content. It's possible it makes the game a little cluttered, but it's worth it for the new destinations and access to supplies and fuel.",
            "review_score": "1"
        },
        {
            "review_text": "If you like an immersive atmosphere and world with delightfully strange characters and stories, I believe you will be able to see past the steep learning curve, monotonous (yet lethal) naval combat and heart-wrenching decision making process to enjoy this gem. Patience is key to excel in this game since you will die a lot before getting a hang of the mechanics and survive.   Remember folks, money is earned efficiently not by trading, but by exploration and braving those elusive daily events!   This game pretty much brought me to Fallen London browser game!   PROs: -immersive atmosphere -awesome soundtrack that gives you the chills during your voyages -strong character development of the different people that you will inevidently meet -a very interesting alternative Victorian setting that is both amiable and dystopic -lots and lots of stories to discover and places to explore -YOU CAN GET TO TALK TO TIGERS AND BUY SAPPHIRE FROM THEM. WHAT MORE YOU WANT?  CONs -steep learning curve. you will die a lot -unimpressive naval combat mechanics -sometimes you have to choose between the lesser of evils. -DO NOT GO NORTH. TURN BACK.",
            "review_score": "1"
        },
        {
            "review_text": "This game, as suggested by its own introduction, is quite hard: featuring a single save slot, a challenging economy and a strict resource management system, it might be better to keep away from it if you don't enjoy a considerable challenge. The gameplay also consists for the most part of either reading or sailing slowly through the dark waters of the deep zee, something to keep in mind when considering to purchase the game.  If you are sill interested after everything i've said, than buckle up and get ready for what i'm proud to say is the best written, most atmospheric, scarily-witty game i have ever played. Moreover, the world in which the game takes place is without a shadow of doubt one of the most compelling and fascinating i have ever had the pleasure to encounter, to the point where i couldn't help but play fallen london, the text based online game sunless sea is based on.  This game is certainly not for everyone, but for those who ejoy challenges, incredible writing and losing themselves in a fantastic world, it would be a sin for you not to play it. ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, I love the story, the ambient, I get so scared to go far away for dying of hunger again. Every time you play you can get a different route and different crew to discover new stories and explore more. I literally stop playing because i didn't want to die and was scared of what was out there.",
            "review_score": "1"
        },
        {
            "review_text": "Slow moving management game, with a world steeped in interesting lore. The actual combat is minimal, the game focuses on places and how you interact with them.  It can get a bit repetitive if you play enough, but there is a lot to explore, and one of my favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "Having already been a fan of Failbetter Game's Fallen London, I was super excited when this game came out! The atmosphere is spot on and a little eerie with good music to set the mood. While it can be a little monotonous (farming what you need at times) and the combat can be a bit funky, the story is really good and is different with every playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "Right off the bat let it be known I am a MASSIVE fan girl of this game, 10/10 honestly, so I'll just be mentioning all the things I love about it and blindly ignore the flaws (ignorance is bliss).  Story Perfect for your cult-like reader of Lovecraftian tales; eerie and confusing but enticing. If you can deal with incredibly cryptic hints and long blocks of texts then you'll enjoy this. At times wacky but it stills makes sense in the universe, never quite knee-slappingly hilarious but pretty amusing. At first you might be annoyed like a city slicker visiting a small fishing village but soon enough you'll be speaking like one of your fellow zailors and getting immersed into the lore of the zea.  Gameplay Think like a survival/hardcore FTL on an ocean, except way harder. You will NOT win this game on the first playthrough without incredible knowledge of every single island and quest (and insane luck); even on the 8th playthrough you'll be dying in the middle of the ocean having no clue what went wrong but having to start a new life anyway.  Graphics Incredibly simple, nothing breathtaking. That being said if you can get immersed enough you will go slack-jawed at the sight of the ice castles of the north, fear of the creatures of the deep, and pure joy at the lights of Fallen London.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, cant wait for Sunless Skies!",
            "review_score": "1"
        },
        {
            "review_text": "Steampunk lovecraftian horror/adventure with a side of political intrigue and romance? Don't mind if I do.  This game is set in one of the most interesting, fleshed out worlds I've ever seen. The writing is wonderful, and the various adventures you'll find yourself on almost always surprise in some way.  The one downside is the long periods of time between ports; you'll find yourself staring at your ship for minutes at a time sometimes. It's not such a problem at first when you're fairly weak and the risk of death and madness is high and those long voyages make for a tense experience. Once you have achieved a certain ammount of power however, you can travel around the map more or less risk free. There are a couple of speed mods out there that can help with this problem.",
            "review_score": "1"
        },
        {
            "review_text": "You start out on the streets of Fallen London, unsure what exactly to do, and where to go. You will start with a couple simple jobs and suddenly you will realize you are discovering the wondrous world of the unterzee!  This game has mystery, tension, action, and wonderful story sequences. You can go about and discover all the lore and legends of the lands. There is always a sense that there is something right beyond the next island. I have a hard time putting this game down.  Has great replayability, expect to die often initially, but eventually you will get better.",
            "review_score": "1"
        },
        {
            "review_text": "I liked it. Very much.",
            "review_score": "1"
        },
        {
            "review_text": "Overall, Sunless Sea brings a very deep storyline that can change the story of the future quite easily, which gives multiple playthroughs. While fun at first, it is very challenging at the start so death will occur many times before you get into the groove of surviving and making a living in the game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a gem of a game. Story rich and creepy. I have died and died again (after eating some of the crew) in the search of weath and immortality. This is a must have.",
            "review_score": "1"
        },
        {
            "review_text": "This is brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "A great little game. Very story-driven. A lot of text, but it is very well written, and the stories are actually very interesting. The tone of this game is perfectly creepy, and you will quickly find yourself becoming immersed in this world.",
            "review_score": "1"
        },
        {
            "review_text": "Disclosure: This review is from the perspective of a long-time Fallen London player. If you have no knowledge of the Fallen London universe/lore and play-style, you will probably have a somewhat different experience.  Pros:  + Getting to sail to and visit all the places you've learned about in Fallen London + Chance to learn more about Neath/Bazaar/previous cities lore (especially the Khanate! I've always wanted more Khanate content) + Totally has that Failbetter game texty atmosphericness + AWESOME SOUNDTRACK + Snarky item descriptions make me happy inside + One of the best-looking indie games I've encountered  Cons: - Initial learning curve can be steep - Repeated death of captains can be hard on those who identify strongly with their characters - Death (&amp; other menaces) feel awfully permanent and unforgiving (especially compared to Fallen London, where they are mild inconveniences at worst) - Walls of text can be off-putting to those who aren't used to it - Not sure if lore is accessible to non-FL players  My recommendation? Try playing Fallen London a bit first (it's free!) to see if you like the setting and narrative style first.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of  the  most atmospheric games I have played. It's a great mix of Victorian Gothic, Steampunk and Lovecraftian spooks.  It is also really hard until you get the hang of it. But hey, even dying/going insane/dying in a different way/??? is fun, it's part of the experience and adds to the whole aesthetic. Now, this game is slow, but that is  not  a bad thing. There are thousands of words of lovely, crafted text, that tell the story in a unique, entertaining, and occasionally very funny way. Exploration really is fruitful, it may not seem so at first glance, but the fact that it earns you cash really gives a legitimate incentive to act how a sea captain actually should act. The combat is ok, there is definitely a strategy to it, and relies on things such as visibility, line of sight, etc.  Overall this is a great game for those who appreciate beautiful fiction-writing and exploring strange and inventive lands.",
            "review_score": "1"
        },
        {
            "review_text": "It is a fun game with some action but there is a largae amount reading the lore and the backstories of the crew you take on which can intiate quests and the decisions you make can have a lasting effect on the captain you made those decisions with. You will at some point lose but it isn't a major issue just set up and set out again with a variety of backgrounds to pick from. Finally the atmosphere of the entire game is spooky with the harbors being safer than the zee but not fully safe.",
            "review_score": "1"
        },
        {
            "review_text": "I feel really unfuilfilled after playing this game, I tried. I wanted to like it! But its slow, getting anywhere on the map is tedious. The premise seems good, if there was voice acting for the quests I'd have been more engaged. I could not in good concious recomend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Holy ♥♥♥♥. I love this game TO DEATH!!! THIS IS ONE OF MY FAVORITE GAMES OF ALL TIME!!! Why!? SImple!  1:The story.  Ill be honest, i played Fallen London to a pulp. For people who are unfamiliar, its Sunless Sea's Prequel kinda. I played the Browser based version. And if you have an Iphone, get the Echo Bazaar, ive heard good things about it. This game takes place in the Unterzee, and underground Sea. The story of Fallen London is Bats took London away to the Unterzee. (Dont Ask). 2:The Setting  The Gothic and Victorian era world were presented with here is amazing. I have a soft spot for Victorian, Lovecraftian, and Dark worlds. On top of that i also have a soft spot for Maritime worlds. I love the Sea, i love the Water, and i LOOOOVE Dark Water. This setting is perfect for people who like the Old Victorian and Lovecraft world. This game is also good for another reason. 3:The Gameplay  People tend to complain that this game isnt the most gameplay driven game and granted its not, so stop beating on it for it. With other ♥♥♥♥ out there like ♥♥♥♥ing Visual Novels here on Steam i dont wanna hear it if somebody says 'This game doesnt have ANY GAMEPLAY!' This isnt reliant off its gameplay. If you like Reading, THIS IS YOUR GAME!! Definately! If you like say the old Edgar Allen Poe stories this is without a doubt your kinda game! I love reading! I like to relax and Read some Edgar Allen Poe or Henry David Thoreau myself but this game delivers on its little Story department. 4:The Stories!  Phenominal and stellar writing! The best ive seen in a game to date. The stories are all dynamic and random! You will get random stories and different stories based upon what youve done in the game. The first you are greeted with is the Bruiser. He gives you Fuel and Supplies. A necessary thing for you to get around. You can transport Tomb Colonists from Fallen London to Venderbight just north of Fallen London. Follow the Coast and youll get there eventually. One time i was transporting the tomb colonist and he disintigrated! Randomly! Just out of the blue! Another time i was going from Mutton Island to the Uttershroom, and i found a Diamond in my meal. I was once going from Venderbight to go discover more of the world and a rock fell from the Neath. The Neath is the roof of the Undersea cavern your in. This game is really random and i love it! 5:The Exploration  This is a Rougelike Adventure game btw! Surprisingly this game has rougelike elements. Its not gameplay driven by the least as i mentioned but it does rely off your sense of exploration and discovery. I have over 14 hours in the game and i havent even been throughout the entire map. Most of it, but not all. You start off in a little ship. Very tiny but reliable. You can go through most of all the game with just that ship. Or you can save up your Echoes and get an Estologue Class Dreadnought, the mightiest vessel the ever sail the Zee. A massive Cargo bay so you can store Plenty of Fuel and Supplies as well as weapons and ammunition. As the game advertises, Lose your Mind, Eat your crew, Die. As you explore through the game, you have your Prow Light on most of the time, logically. but if you turn it off, your Fear starts to rise. And if it rises too much then your men become scared and their sanity starts to slip. What can happen is if you run out of Supplies, you can have the option to kill a crew member to feed the rest of your crew, but that raises your Fear and Insanity by a TON! Finally this is not an easy game. At all. You will die more times than youll be able to count. Ive died a total of 6 times but only cause i have been cautious. 6:The Combat.  The Worst part of the game. No doubt. If you dont have a strong cannon, your so screwed. All enemies act the same. ALL. They all with Charge you and damage your hull. Yes its really cool to see how they react cause not all of them charge you at first, and to see their design is also pretty fun. This games combat is not at all good. Its not a combat driven game either. Its story and Narrative driven. Its combat is managable, not fun but not god awful. If you have the basic cannon, make sure to not go to far from London. Or youll get wrecked and cast asunder. It works off an Exposure system. You need to use your prow light to focus on Enemies so your gunners can get a better shot on them. Then you fire. Not exhilerating at all. Not boring either. Id say if you buy this game you should buy it for the world and stories. not the combat.  Final Thoughts, What is the best part of this game in my opinion? What could it be? The unbelivably beautiful world? The stories? The Lore? The Ships? The Sea? The Zee? The RPG Elements? The Rougelike Elements? None of that even matches to what i find is the best part of this game. What is it..............THE SOUNDTRACK!!!! Holy jesus christ in a hand basket heading to hell this Soundtrack is sublime absolutely beautiful gorgeous docid so calm and peacefull for such a sinister and deeadly world the Soundtrack.....That is the best part of the game in my opinion. The only thing that comes close to it for me is the Stories and the World. Combat is not worth the money but this game as a whole is 100% Worth every dime! Get this game!! If you love reading and if you love Victorian and Lovecraftian worlds THIS IS THE GAME FOR YOU!",
            "review_score": "1"
        },
        {
            "review_text": "If you love creative and compelling narative and don't mind reading, this is the game for. It has such an amazing atmosphere to it. Even the time where you're plodding along in the dark running from island to island is filled with a low level of suspense. Constantly watching your fuel and food (well, if you don't consider your crew to be food I suppose) and hoping you planned it out well enough to survive.   It's hard to make your fortunes in this game but that's okay, dying can be part of a really interesting story here too.   This is one of the gems in my Steam collection.",
            "review_score": "1"
        },
        {
            "review_text": "Entirely worth it! Made all the better if you're a fan/member of Fallen London.",
            "review_score": "1"
        },
        {
            "review_text": "You see London's lovely lights flicker in the distance, the crew of your ship have been whipped in their faces by the cold lash of the waves for days. You have searched so long for Polythreme and you are on your last source of fuel, just this one delivery and your debt is paid, but of course the port authoroties are there to confiscate your crate of souls, because this game feeds on your tears you see, it needs the tears to create this vast and mysterious ocean. A wave of sadness comes and fills your heart with its cold waters. The developers sit in their offices and masturbate to the thought of how many people play this game and how many people have their dreams and hopes crushed. You meet the blind man and he is not a happy guy, he demands 1500 echoes or your life. He takes the latter...  ",
            "review_score": "1"
        },
        {
            "review_text": "A literary adventure pairing exploration with the harsh realities of seafarering.   Part FTL, part RPG part zen like experience and part nightmare. There's a care and attention to detail here that sucks you in, wants you to play just one more time after your ship and crew are destoryed and makes you contemplate every decision and move you make on your journey.",
            "review_score": "1"
        },
        {
            "review_text": "Once, I was a famous zee captain, but then, I lost my mind and eventually ate few of my crewmembers.  They tasted like pork ribs.",
            "review_score": "1"
        },
        {
            "review_text": "Great game so far. Very addicting.",
            "review_score": "1"
        },
        {
            "review_text": "An incredible nautical adventure through a horrific, lovecraftian hellscape called the 'neath. The writing and atmosphere are unparalleled, and you will constantly find yourself sucked in by new and unexpected intrigues.",
            "review_score": "1"
        },
        {
            "review_text": "not the easyist game to start but once you get of of the coast and dont die the game is amasing ",
            "review_score": "1"
        },
        {
            "review_text": "Unique atmospheric game which really draws you into the world.  Kinda a miashup between a text adventrue, a trading sim, and a resource management game (there is fighting but it's simple like a dumbed down Sid Myer's Pirates). I enjoyed it alot but don't buy it for the action.",
            "review_score": "1"
        },
        {
            "review_text": "I've journeyed to the end of the underzee, forgotten the soft touch of the sun, sent men to there deaths, and lost my mind. Should you follow in my wake, do not say I did not warn you.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a big fan of Fallen London, Failbetter's previous browser-based game - which is still very much alive and you should check it out.  For me it comes down to game mechanics.  Fallen London is a browser game that ekes out it's literary rewards using a scarce resource: 'actions'. The idea is that most players will use up their actions then go and get on with their lives until more have regenerated. Captivated players will pay for 'Nex' to buy a bigger pool of 'actions', and also to play certain special storylines. In this context it makes perfect sense to string the experience out, because they want to hit that balance where they provide just enough entertainment to keep casual players engaged, but with enough held back so that rabid players will be prepared to pay for more.  The regenerating 'action' mechanic allows Failbetter to 'ration' the game.  Now, Sunless sea shares the Fallen London mythology, and also shares the story based gameplay. However, instead of rationing 'actions', now your access to the story elements is rationed by 'distance'. In Fallen London you just click on TRAVEL to move from one area to another. In Sunless Sea you have to move your ship, possibly encountering giant sea creatures or pirate ships, which you then engage in, frankly terrible, combat or ideally avoid.  Whereas Fallen London has downtime where you go and do something else, Sunless Sea has downtime between stories, where you still have to remain engaged with the game. If you enjoy the combat, that's a bonus, but if, like me, you find the combat dull, then you're out of luck because no matter how good the story writing is, getting to it won't be worth it.  I'm not some longtime Fallen London player who is upset about an arcade upstart. I literally only registered for Fallen London because it was going to give me bonus stories in my newly purchased Sunless Sea, which I was really excited to get playing after reading the reviews. A month later I've spent twice what Sunless Sea cost me, in Nex to play Fallen London and I don't regret a penny of it.  Here's the thing, reading the forums it's clear there are fundamentally two kinds of Sunless Sea players who are enjoying the game, with some overlap between them. There are the people who love the mythos and endure the meta game to get at it, and there are those who are maximising the amount of Echoes they earn, and reducing the game to a spreadsheet to get them. I just can't fall into either camp, so I'm calling it a day.  In context, I'm a longtime Nethack, general roguelike and Dwarf Fortress player - the death mechanics don't bother me, the glacial grind at the start of the game does. I appreciate that Sunless Sea isn't a roguelike or even a roguelite, and they shouldn't advertise it as one, but a little diversity in the start wouldn't hurt.  The user interface also has some issues, and the lack of a minimap is baffling, forcing you to constantly switch back and forth from map to play area - highly disengaging.",
            "review_score": "-1"
        },
        {
            "review_text": "Font is too blurry and hard to read, so I can't recommend a purchase. Shame, as the game itself is quite cool. Good writing and atmosphere.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty awesome. Great legacy, good story telling, it's light on combat and more geared toward exploration and trade.",
            "review_score": "1"
        },
        {
            "review_text": "A complex set of stories in a unique, gripping world. Subtle, both in terror and in puzzles. Frustrating to balance the needs of the ship, the crew, the adventures, and yet that much more fulfilling when one accomplishes missions.   It appeals to my story loving instincts with flairs of Neverwhere, Cthulu Mythos, Sid Meier's Pirates, and the top-down arcade games of my childhood.   I love how you can purchase different ships, outfit them with weapons, find special crew members, and so forth.  I'm interested to see further storylines with more factions.",
            "review_score": "1"
        },
        {
            "review_text": "160 hours trying to get Pigmote to declare independance and I still still lose every single roll on that island AND ONLY THAT ISLAND. I'VE GOT THE DREADNAUGHT AND MY OWN NATION, AND THE RATS STILL CAN'T FIGURE OUT HOW TO BUILD A ♥♥♥♥ING WALL. Great game 10/10 would run saphires across the zee again.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and terror... but mostly terror",
            "review_score": "1"
        },
        {
            "review_text": "I was behind this on since it’s days on Steam Greenlight. Sunless Sea is dark, rogue-like exploration RPG from Failbetter Games. Let’s get rocking.  The Good  Sunless Sea features a delightful plethora of Lovecraftian themes. This alone (assuming you’re a fan of Lovecraft) should be enough to make you want to play the game.  The initial combat system left a lot to be desired, but those were the days of the beginning of early access. Since then, the combat has been streamlined into real time and allows for constant movement and maneuvering. Needless to say, it is a vast improvement over the old system.  Exploring the Unterzee in your vessel is always a good time. Whether your dumping a few hours into the game or just looking to kill a few minutes doing something other than beating your head against the wall in boredom. You’ll always find something out around Fallen London to entertain (or frighten) you.  The artwork is outstanding. It was the first thing about the game that really made me fall in love with it. You can see for yourself in the trailer. Everything has had a lot of detail and care put into it and it really shows through in the finished product.  The soundtrack is, likewise, awesome. From sea shanties to pleasant melodies, there is always a tune to accompany you on your voyaging through the Zee.  The developer is one of the best out there in my opinion. They provide regular updates to the game (even now that it has left early access), the listen to their fans, and they are passionate about making their game the best that it can be.  Did I mention that you can cannibalize your crewmen or make your crewman cannibalize their fellows? Yeah, that’s a thing. And it’s brilliant.  The Bad  The old combat system is about the only bad thing I can think of when it comes to Sunless Sea. But, that is long since a thing of the past.  The Meh  Once again, I’ve got nothing to say in this category.  Verdict: Yea  If you haven’t played Sunless Sea, you should very much consider picking it up and sinking some serious hours into it. It’s well worth the price and, in my opinion, can quickly become one of the best games in any collection. I’m pretty sure it is on sale right now for the Steam Halloween Sale too. As always, thanks for reading.",
            "review_score": "1"
        },
        {
            "review_text": "It's a unique game, but some of the more positive reviews have been misleading especially with regards to the depth of the story elements.   PROS:    Interesting and origininal setting, tons of lore.   Exploration is dangerous and unforgiving   Combat is challenging and best avoided    CONS:    Trade has such low margins it's nearly pointless   Quests typically only provide details (like where you'll be going) after you've accepted them   User Interface design needs polish, finding info on quests requires you to press G, then tab to journal and scroll seemingly forever through useless trivia to reach actual quest info. Tradable items are mixed with quest items in the inventory with no distinction between the two. Lots of basic 'reinventing the wheel' design philosophy is present like giving stats names like 'iron' and 'mirrors' instead of 'strength' and 'perception'. It presents unecessary complexity.   For a text driven game there are few interactive story elements. Choices are limited to whether or not to talk to characters and consequences in the rare dialogue branches are determined by stats rather than the choice itself. There is little in the way of player agency within the universe and the few characters in the game are thinly sketched slot machines that drop items, money, and fetch quests.   The core gameplay elements of combat, exploration, and trade are ultimately dull and repetitive. Combat against ships is a turning contest and combat against 'zee' creatures is a battle of attrition; neither reward player skill or strategy. Exploration is a matter of keeping an eye on fuel/supplies and mashing z to see if there are any nearby islands, if there are they probably won't have anything worth trading. Trade itself is pointless and requires far too much spreadsheeting to find any of the several lucrative routes.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I like it no matter how hard I try not to. Its fun too.",
            "review_score": "1"
        },
        {
            "review_text": "I love Fallen London, so it is no surprise, that I find Sunless Sea even more delicious. Your first captain will die, it says in the loading screen. What it forgets to mention is that your second and third captain will die, too. And quite a lot more, in succession.  But each captain evolves from the experience you gain from the game. New map, new challenges. New delicious unterzee mysteries. And delicious friends to meet and dine with.  Look no further. Unterzee awaits your sails and soul. And other body parts.",
            "review_score": "1"
        },
        {
            "review_text": "This is a rare game that manages to be so much more than the sum of its parts.",
            "review_score": "1"
        },
        {
            "review_text": "The setting, the writing and music is top notch. I should point out that the sea exploration aspect is a bit disconnected with the ports (where you experience the stories, quests, etc). However I didn't find this to be an issue and loved the game. Keep getting sidetracked with other activities but the underzee beckons me...",
            "review_score": "1"
        },
        {
            "review_text": "Hard to get into, this game.  To start with, it really feels like an exploration game which punishes you for exploration. After a few hours play, and losing a couple of captains, I was ready to give up for good...  ..or was I? The early gameplay tried to push me away, but everything about the style of it kept me coming back: The music, the graphics, the wonderfully descriptive text. And while you make progress rather slowly, there does seem to be an awful lot of progress to be made.  This kind of sandbox game usually isn't my bag. But apparently if you do it with enough of a Lovecraftian gothic steampunk twist, then I'm in.",
            "review_score": "1"
        },
        {
            "review_text": "Bad: The boat goes really slow. Combat is very one sided.  Good: Everything else.",
            "review_score": "1"
        },
        {
            "review_text": " Sunless Sea",
            "review_score": "-1"
        },
        {
            "review_text": "I do like this game. So much ways to die. About play time. I've used linux testing distro. So it's not logged on steam.",
            "review_score": "1"
        },
        {
            "review_text": "Think of this game as bedtime material. Play your car racing or football game (whatever you are into) and then wind down with this in bed. I dont have the patience for reading a book before bed but I do have the patience for this as you are interacting as well. Very relaxing game and after an hour I was feeling sleepy and fell straight to sleep. That isn't negative on the game. It's a good thing as if I play a fast paced action game I struggle to switch off at bed time. So perhaps this is a weird review but that is my take on this game. I enjoyed it and I have played something like 5 hours and i have barely scratched the surface. There are hundreds of hours of gameplay here. Fantastic value for money.",
            "review_score": "1"
        },
        {
            "review_text": "July 8 2016  'You have advanced the cause of hell today' Words I never thought I'd read.  In all seriousness, this is the most excellent story based game I have ever played. Though it requires time and effort, it provides hours of entertainment, and loads of possible endings. I probably shouldn't write this, but there are exploits that you can use to kickstart second, third, fourth, fith, sixth (etc.) playthroughs.",
            "review_score": "1"
        },
        {
            "review_text": "This game is creepy, mysterious, and amazingly atmospheric. It plays like a Choose Your Own Adventure book, except the book is a ship, and the pages are the sea.",
            "review_score": "1"
        },
        {
            "review_text": "The storytelling and worldbuilding in this game is amazing. I logged over 30 hours into it and have found myself wishing to do a clean playthrough. I can't wait for the expansion so I can dive back in (pun intented).",
            "review_score": "1"
        },
        {
            "review_text": "Dark, witty, and unforgiving, Sunless Sea has one of the most fascinating settings I've seen in a video game.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended game. You will need to persevere, though, as initially the game is not forgiving!  Part of the game which I found most enjoyable was discovering the lore of the world and backstories of the many characters.  The trading aspects are well-handled as is the system of docking at ports. The sea monsters are exciting and the people you will meet are very strange.  Give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "This game is stragely addictive. I really like the fallen london setting and story line. The gameplay reminds me of old 2D space shooters like Escape Velocity except the 2D navigation makes much more sense in a sailing game. It is challenging and engaging. It is deceptively difficult. Anything can happen but mostly horrible things.",
            "review_score": "1"
        },
        {
            "review_text": "Awsomely Fun game!!!!",
            "review_score": "1"
        },
        {
            "review_text": "It is hard to recommend Sunless Sea on the basis of the amount of time it takes to accomplish anything. Personally I don't feel that it's too annoyingly grindy but more so the fact it can take an eternity just to get from port to port. Now this isn't because the port are that widely spread out, (though the further east you go the more distance between stops becomes apparent) it's just the crawl at which you unhappy little steamer goes at. I realize this is most likely the real speed at steamboat would move but it does make for a long uneventful trip.  In the visual department I can't help but feel that the game would have benefited from a much larger budget, but where would one source money for what is essentially a niche title. Double edged sword aside, the art style is functional and still carries the foreboding that the writing lays on thick.  The main event for Sunless Sea is the writing and boy there is a lot of it. Not a complaint by any means just, wow. The head writer certainly missed their calling as a Lonely Planet contributor as many things are described quite intricately. Sights, sounds, touch and sometimes smells are all covered in the expansive reams of text that you are likely to skip through to see the effects bullet points that punctuate the page.   There are many different nagging effects that can be afflicted to you character with the prime one being terror. Terror is a constantly growing annoyance that will result in more catastrophic events the higher it gets and is affected by events at port (e.g. hugging kittens lowers terror while upending its litter tray raises it) but also rises by just boating around, with light less travel being the most effective means of getting the willies.   Surviving in the Zee (not a typo, games name for the underground sea) is more of a task of having enough supplies and fuel to make the trip. Not all ports trade in the goods required to get from a to b with most of them being a pick up or destination for specific types of cargo. So you will spend most time running errands with exploration being a byproduct of these services.  Money is a hard commodity to come by as most tasks don't give a respectable amount of dosh for your efforts. You can partake in trading goods but this is only rewarding if you want to take on shady dealings with some undesirables. This brings me to a story that I had within the game.   I was returning to sunken London with my lucrative first endeavor of smuggling light from the surface when I realized that I hadn't completed the quest for the blind bruiser. Now the blind bruiser is a delightful unforgiving chap who I would buy my shipment of sunlight at a tidy profit but returning to London without completing his errand would only yield his disappointment and a friendly knife to my side.  Realizing this just before making port in London I turn around and head off to pick up whatever he so desperately desired that was willing to dance on my lifeless corpse should I not do it for him. This wasn't that big of an issue I had fuel and supplies to go get it, what I hadn't accounted for was being attacked by a shark.  The sharks in the game aren't that common outside of the area that blind bruiser sent me to. The shark did a fair amount of damage to my hull and devastated my supply of hapless crew. Stupidly I used my supplies to fix my hull to a semi respectable state before taking my journey home and this was the beginning of my downfall. I was double burning my fuel to get home quicker as my limited crew limited my traveling speed, and I needed to get home before my surplices dried up and everyone starved.  As I was heading home my crew had become peckish and started feasting on each other and I was willing to look over this cause the payoff was so close and I could always get more delicious crew back in sunken London. Now my two remaining crew members were satisfied I burned my way home taking the risk to double burn and this is where I came unstuck.   Double burning fuel has the inherent risk of the engines catching alight but I hadn't had seen what it happen before so I was careless and was desperate to get back as the crew was looking to feed their tapeworm. Just inside the bay of sunken London it happened my engines explode and I spend my last 2 crew members putting out the fire effectively ending my tenure as Zee captain. Having no crew is game over and despite having a full listing of officers and 2 mascots it was the end. So if you have the attention span to read through my review and though Sid Meiers Pirates! needed more Cthulhu then Sunless sea might be worth your seafaring misery. Otherwise just have a bath with light outs.",
            "review_score": "-1"
        },
        {
            "review_text": "First captain, on a whim, was named scuttlebuns. I got pretty far with him considering I had no idea what I was doing, but then I sailed into the top right corner of the map and got one-shot by Mount Nomad.   Second captain, scuttlebuns the second, barely got past his first admirality commission when a massive crab surfaced out of nowhere and killed him.  Third captain, scuttlebuns III, got very far indeed. Unfortunately, as any veteran zailor will know, bashing your ship against a rock will result in 1 damage. He, fresh from destroying some pirates, looked away from his screen to change his podcast when he bumped against a rock. And then continued to bump against the rock, with a flurry of crashes reminescent of machine-gun fire. And so, Scuttlebuns III met his end.  11/10 would scuttlebun again - IGN",
            "review_score": "1"
        },
        {
            "review_text": "It's weird, it's spooky, it's fun and it's complicated. Didn't getvery far in it, but it did get me interested it tabletop gaming again.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic atmosphere and even more fantastic writing.  This is a game where you want to avoid combat or you will die quickly. Negative reviews that criticize the combat system have completely missed the point.  Beginner tips:  Make sure to save enough money (called 'Echoes') to refill fuel and supply when you're back in Fallen London. Stay close to lights and shores to avoid the terror that lurks in the dark.",
            "review_score": "1"
        },
        {
            "review_text": " TL;DR Dreadful in a good way, fantastic world building. Nearly killed with grind and repetition.",
            "review_score": "1"
        },
        {
            "review_text": "  This is quite possibly one of the best games I've recieved as a gift. While I do recognize that this particular style of game play is not for everyone, if you want to try a more narative driven choose your own adventure this is definitely the game. The Arkham Horror style undertones make this game particularly interesting for many of the people that play it. I do need to say, realisticly you don't need to read most of the story while you play the game if you're familiar with the genre. I wouldn't call the stories predictable, they're not, but because of the nature of the game you could just read the screens asking you to make decisions and that's the minimum you need to know to make appropriate decisions. The game can also take a while for you to make it further into the game, but don't give up. Just remember, you're meant to die, so your early lives are meant to try and leave the most useful items you can aquire behind for your next life. Just be aware, you're very limited on what you can leave behind, so choose wisely.",
            "review_score": "1"
        },
        {
            "review_text": "11/10. 100/10. Beautifully crafted gameplay, good graphics, important choices, drama, romance and HE SUN THE SUN THE SUN THE SUN T-",
            "review_score": "1"
        },
        {
            "review_text": "If you like great storytelling you will love this game!",
            "review_score": "1"
        },
        {
            "review_text": "The difficulty level can be through the roof, but that (plus the randomization of the map) leads to a lot of replayability. For fans of old style roguelikes and sandbox RPGs, this is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "The world is rich enough to keep you going, in spite of your lineage of embarassing deaths.",
            "review_score": "1"
        },
        {
            "review_text": "Expansive exploration with an intriuging narritive, what more could you want?",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would eat my crew alive again.",
            "review_score": "1"
        },
        {
            "review_text": "There was a moment when I didn't know what was going on, the music just went from creepy to get-your-♥♥♥-out-of-here, I was expecting Cthulhu or something to just pop out of nowhere. Great atmosphere and great soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most exiting products I've seen for the last time! Not much of a gameplay and necessity for a developed imagination, but the union of text and somewhat 30% of interactive makes this game incredibly interesting and inexhaustible (that is also because of so many detailes and variations). I think, Sunless sea and such original games (but this one in a first place) are very good nominants for a Steam reward!",
            "review_score": "1"
        },
        {
            "review_text": "Some of the best world/lore-building I have ever seen. A must play if you enjoy exploring and reading tons of text that lets your imagination take over.",
            "review_score": "1"
        },
        {
            "review_text": "Hope you like dying. If not, there's always hopelessly attempting to grind (followed by dying). If, by chance, you can get yourself out of the cycle of poverty, you have an incredibly unique and interestingly named world to explore.",
            "review_score": "1"
        },
        {
            "review_text": "Three reasons to buy this game. It will make you sail a lot. It will make you read a lot. It will try to kill you a lot. Now just buy it and go drown in the world that is Sunless Sea.",
            "review_score": "1"
        },
        {
            "review_text": "IF YOU LIKE REALLY STRANGE-GOOD LORE AND STORY, THIS IS A GAME FOR YOU!",
            "review_score": "1"
        },
        {
            "review_text": "Love it, spooky and thought provoking. Not for the casual who wants to just take their boat out fishing.",
            "review_score": "1"
        },
        {
            "review_text": "Is it hard? yes Is it boring at some times? yes Do some of the stories get repetative? yes Is it worth it? F**k yes  This game is AMAZING and by all means it should be boring but its great",
            "review_score": "1"
        },
        {
            "review_text": "Nice Victorian horror-esque game with an appropriate level of exploration and fear, and an intriguing backdrop. The story cards are generally very intriguing, but sometimes the level of prose is too much. It's also nice that the developers release new content from time to time.",
            "review_score": "1"
        },
        {
            "review_text": "Creepy, diverse and difficult. A winning combination.",
            "review_score": "1"
        },
        {
            "review_text": "If you like lore, exploring, and games with a continuous storyline, this is the game you want to buy. Good pricing, great game. The online browser experience is cool too.",
            "review_score": "1"
        },
        {
            "review_text": "The game is quite deep in storytelling.  I really like the game, because it is changing with the decisions that you take.   Who likes games that don´t forgive mistakes and likes to discover a strange dark victorian style mystary world this game is for you.   Like a good story it evloves in a slow past. So this game is not for players who want to achive things as fast as possible, but if you have a day free to play a game sunless sea is a very good game.  With the new content the game got even deeper and I can´t wait for sunless sky. ",
            "review_score": "1"
        },
        {
            "review_text": "Slow moving, cerebral, and above all atmospheric. Eldritch horror in a victorian, subterranean nightmare sea, done very well. Absolutely worth playing if it piques your interest at all.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic setting, strangely reminiscent of Neil Gaiman's Neverwhere. However, the gameplay and the pace of storytelling leaves much to be desired. I'd recommend the game if only to experience the atmosphere, but it feels like it was squandered on such bland gameplay. This setting needs a more traditional RPG with a proper story.",
            "review_score": "-1"
        },
        {
            "review_text": "I may or may not have based an entire dungeons and dragons campaign around this game.",
            "review_score": "1"
        },
        {
            "review_text": "A slow, tense game, with a great storyline(s). It's pretty satisfying to come to the end of an arc or a long voyage. The atmosphere is amazing and the music fits pretty well as well.  Definitely not for the impatient since the enjoyment is very much text based. Combat could be better as it's a bit clunky.  Update: Nominated this game for the '5 more minutes award.' As this game has kept me up all night and made me late for work a few too many times.",
            "review_score": "1"
        },
        {
            "review_text": "This game is not for everyone, that does not mean it is not amazing. Some of the best writing in any game is contained at some of the dark places you will visit. You will travel, you will make the wrong choice, you will fail.   Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "This game really is fantastic, i love the themes and the overall atmosphere of it. It's always a game I'll enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "This game is cool.",
            "review_score": "1"
        },
        {
            "review_text": "This has to be one of the best indy games I have ever played. Great music, fully realized world, real survival feel. There's a bit of an ititial learning curve (took me forever to figure out I didn't have to go on slow speed all the time) but once you get it this is a lot of fun. Really looking forward to the space one they have coming.",
            "review_score": "1"
        },
        {
            "review_text": "It's enjoyable and deep, but also quite slow and painful. I enjoy the game but my main problem is that combat sucks. Some ship or creature rocks up and you either try to fight and either die or win a phyrric victory, or try to run and get pummled. I'm sure this would be less problematic once you get some better ships, but you have to range far and wide and repeatedly to earn much coin, a lot of which you have to spend on fuel, supplies, and repairs, and any ship worth spit is expensive. I nearly had enough money once, but then got ambushed by pirates and ran into more pirates while fleeing.  There's very little guidance in the game, which given the odd format will be offputting for a lot of people, although I kinda like cobbling together how the game works on my own. If you like clearly defined goals and a notion of the consequences of the choices presented to you then you'll want to look elsewhere.  It also feels rather unfinished. Choices you're given have details about what you require to be able to select that option. Many, many of these include phrases similar to 'When time passing in X is:'. Is what? Nobody knows, and not in the oooh, it's mysterious way.  I'd love to see some improvements to the information you're provided in-game, better options for evading combat or possibly scaling combat to your progress somewhat. I'd also love to see more trade opportunities, as currently most simple buy and sell trades garner so little profit as to be worthless unless you just so happen to be going in the right direction anyway and happen to have spare cash and cargo space.  It sounds like I'm canning the game, but I stand by recommendation despite the stong caveats presented. It is very deep and engaging and I've been enjoying it depsite suffering some crippling setbacks.",
            "review_score": "1"
        },
        {
            "review_text": "I have only roughly scratched the surface from this game and want to give a little advice that may be similar to many others. Don't give up right away if things seem tough or like you are constantly dieing. The world is a puzzle everytime you live and unfortuantly die you will learn something new and it will help you in your next life. You don't always have to fight but it doesn't hurt to know early on what you are capable of tackling and the rewards for them. Certain pirate ships are twice as valuable as others. Explore!",
            "review_score": "1"
        },
        {
            "review_text": "Although this game is tedious to begin with, the overall experience of the game is fantastic. Sunless Sea builds upon the lore provided in the Failbetter online game, Fallen London, previously known as Echo Bazaar, where London was dragged a mile underneath the surface of the earth by bats and soon taken over by the Masters of the Bazaar. Although it's great to play these two games in tandem, it's not required.   The atmosphere in the game is definitely what makes it stand out from other top-down games I have played. Given the fact that every time you die, the map shifts itself around a little bit, provides the player with a constant question, how much fuel and how many supplies do I need to reach X without dying?   Overall, 8/10 Dying sucks",
            "review_score": "1"
        }
    ]
}