{
    "app_id": 305480,
    "name": "Heileen 2: The Hands Of Fate",
    "release_date": "2014-06-11",
    "developer": [
        "Winter Wolves"
    ],
    "publisher": [
        "Winter Wolves"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 15,
    "positive_ratings": 22,
    "negative_ratings": 16,
    "price": 6.99,
    "description": "Heileen soon discovers a deck of tarot cards representative of the seven deadly sins and the seven heavenly virtues. The cards have the power to change both her dreams and her reality, and will help Heileen discover many hidden things from her past, and ultimately what she wants to be? A saint, or a sinner?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/305480/header.jpg?t=1447362141",
    "minimum_requirements": "OS: Windows XP Processor: 1Ghz Memory: 512 MB RAM Graphics: DirectX or OpenGL compatible card Storage: 40 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I really did enjoy the game. I know this isn't a game for everyone, but if you like a story driven game. It is for the most part a dating sim. I find it a well put together dating sim. However, this doesn't have the typical henti scenes from a dating sim.",
            "review_score": "1"
        },
        {
            "review_text": "Heileen 2 is so bad, it's actually painfully bad and not funny.  The art, voice acting, the sound effects, the writing, the choices given, it's all horrendously low-quality. The voice acting and dialogue often sounds cartoonishly racist, and leaves a bad taste in my mouth.  I enjoy visual novels, dating sims, and anime games. And I own some other Winter Wolves games. This is the absolute worst VN I've tried. Eroge games have better art and writing!   Just click 'Not Interested' and instead check out 'Roommates' or 'Loren The Amazon Princess' by this same developer. They're light years ahead of this thing.  Thankfully I got Heileen 2 in a cheap bundle, but still, my Steam library feels a little icky now.",
            "review_score": "-1"
        },
        {
            "review_text": "All of humanity is lessened by the existence of this game",
            "review_score": "-1"
        }
    ]
}