{
    "app_id": 305740,
    "name": "Pitiri 1977",
    "release_date": "2014-11-07",
    "developer": [
        "ILIKESCIFI Games"
    ],
    "publisher": [
        "ILIKESCIFI Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Includes level editor"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 56,
    "negative_ratings": 42,
    "price": 2.79,
    "description": "Enter a seventies science fiction utopia with hand-drawn levels and characters. A platformer adventure with a soundtrack from the past. Are you ready for 1977?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/305740/header.jpg?t=1540412759",
    "minimum_requirements": "OS: Windows 10, 7 or XP SP3 Processor: 1.5GHz or faster Memory: 512 MB RAM Graphics: OpenGL 2.0 compatible video card with 256 MB shared or dedicated RAM DirectX: Version 9.0c Storage: 180 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I enjoy the world and setting of this game very much. Finding hidden robotlivingrooms in old forgotten pipes and the destiny of a retrofuturistic conclave was very relaxing. The controlls are not really flowy but exploring and having sarcastic dialogues with robots is great!  I don't care about the time because it's enough love :) Thanks for the game",
            "review_score": "1"
        },
        {
            "review_text": "It's not that hard to see the amount of passion that went into the making of this retrofuturistic little platformer. Filled to the brim with references to an era a long time ago, the game encourages you by design to get lost in the beautifully crafted and open levels.  And by the bit too early end of it, when you've probably already been falling for it's charm and atmosphere, just set up a letter paper on your typewriter and send the team behind this some love! Maybe that will get us a sequel eventually :)  *Disclaimer: I followed this game since it first hit IndieDB in 2011, therefore you could say I'm emotionally invested!",
            "review_score": "1"
        },
        {
            "review_text": "pretty nice game",
            "review_score": "1"
        },
        {
            "review_text": "While this isn't a bad game, per se, it feels very unpolished and clunky. You wouldn't miss much by skipping it.",
            "review_score": "-1"
        },
        {
            "review_text": "Platformer with cardboard cutout graphics, didn't enjoy",
            "review_score": "-1"
        }
    ]
}