{
    "app_id": 305880,
    "name": "Leona's Tricky Adventures",
    "release_date": "2014-11-11",
    "developer": [
        "KTX Software"
    ],
    "publisher": [
        "Signo & Arte"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 24,
    "negative_ratings": 3,
    "price": 6.99,
    "description": "Accompany Leona in a clever puzzle adventure to save the inhabitants of a strange but lovely world. Featuring fresh puzzle mechanics, wonderful retro graphics, lots of exploration and an excellent soundtrack by legendary game composer Chris Huelsbeck.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/305880/header.jpg?t=1447362154",
    "minimum_requirements": "OS: Windows XP Processor: 2 GHz Memory: 256 MB RAM DirectX: Version 9.0 Storage: 60 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  A tricky adventure indeed. This game combines RPG aspects with puzzle action.   A very discouraging thing about this game is that appears unfinished. There are places you cannot access on the maps that show up, locations that do not have any way to get to. Apparently the developers were gonna make a second game to go to those area's but i have not seen nor heard anything about a sequel. I will not recommend this little fun game, but i did get it for free, so i won't complain about that. Only buy when on sale..",
            "review_score": "-1"
        },
        {
            "review_text": "A simplistic Puzzle game that is deceptively fun to play.i'm surprised how much i actually enjoy this little game. I give me flash backs to columns on the Sega Genesis just a tad, it is Point and click as a default control scheme though. Kudos to Leona's Tricky adventures-it lives up to it's name",
            "review_score": "1"
        }
    ]
}