{
    "app_id": 305980,
    "name": "Heavy Fire: Afghanistan",
    "release_date": "2014-08-15",
    "developer": [
        "Teyon"
    ],
    "publisher": [
        "Mastiff"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "On-Rails Shooter",
        "First-Person"
    ],
    "achievements": 27,
    "positive_ratings": 154,
    "negative_ratings": 136,
    "price": 1.99,
    "description": "Heavy Fire: Afghanistan is a super fast playing on-rails shooter set in modern-day Afghanistan featuring tanks, assault vehicles and helicopters. The game offers 60 awards, one machine co-op for up to four, Steam Cloud, Leaderboards and Trading Cards.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/305980/header.jpg?t=1479248268",
    "minimum_requirements": "OS: Windows XP Processor: Intel® Pentium® 4 CPU 3.00GHz or similar AMD Athlon 64 Memory: 1500 MB RAM Graphics: Direct3D 10 capable video card (NVIDIA® Geforce 8800 GT or AMD® Radeon™ HD 3870 or above) with at least 512 MB video memory. Some low-end integrated cards may not work. DirectX: Version 9.0c Storage: 3 GB available space Sound Card: DirectX 9 Compatible Audio",
    "recommended_requirements": "OS: Windows 8 Processor: Core 2 Duo or similar AMD Athlon X2 Memory: 4000 MB RAM Graphics: Direct3D 11 capable video card (NVIDIA® Geforce GTS 450 or AMD® Radeon™ HD 5670 or above) with at least 512 MB video memory. Low-end integrated and laptop cards are not recommended. DirectX: Version 9.0c Storage: 3 GB available space Sound Card: DirectX 9 Compatible Audio",
    "reviews": [
        {
            "review_text": "Alright... LISTEN MAGGOTS! Freedom ain't coming to this hellhole in the middle east if we don't deliver it with big buckets of ammo and loads of gallons of napalm... SHOOT AND BURN YOUR WAY INTO THEIR HEATHEN HEARTS and show them the true meaning of MANIFEST DESTINY!  And remember, always just shoot, these poor ♥♥♥♥♥♥♥s don't even speak AMERICAN!",
            "review_score": "1"
        },
        {
            "review_text": "  Heavy Fire: Afghanistan is an enjoyable on the rails shooter",
            "review_score": "1"
        },
        {
            "review_text": "Pretty boring game.....  nothing is wrong but boring :&lt;",
            "review_score": "-1"
        },
        {
            "review_text": "On-rail shooter. Pretty easy and short gameplay but graphics were nice and shooting smooth. Nice game to spend some time now and then.",
            "review_score": "1"
        },
        {
            "review_text": "Another day, another arcade-style game.  This time it's a rail shooter, closest comparison is definitely the Namco series Time Crisis. That's a good model to crib from, as most of the games in that series are great. Unfortunately, Heavy Fire: Afghanistan misses the mark.  This is going to come off as a really unfair comparison review. I don't care for writing these, since all too often they boil down to: 'Why play this? When you can play this instead?' Also, what's the alternative? The PS2 has quite a few of the Time Crisis games, but you need the console, the games, the Guncon controllers, and a suitable TV. There's also the PS3 compilation pack that includes a couple Crisis games, but you still need the system, the games, a couple of Move controllers, etc etc. HF:A is a game you probably already own via a bundle, so let's try and make the most of it.  The biggest issue I have with the game is the length. It's about 2 hours long. Content is king but when it comes to arcade games, brevity is the soul of excellence(???). The 2 hour play-time involves a lot of padding. Each of the 12 stages is more of what you'd expect from a rail shooter. Go to an area, shoot all of the enemy soldiers, move onto the next one. This repeats over and over again with hardly any variation. The bad-guys are in different locations, but little else changes. Arcade rail-shooters generally take around 15-25 minutes to complete, and yet they still do a lot more in that shorter span of time. There are different types of enemies, some are on a variety of vehicles, others attack from all sorts of angles. Boiled down to the basics, rail-shooters hinge on the shooting gallery aspect, where your accuracy and reflexes are what keep you alive. It's how you dress everything up that keeps them interesting. HF:A doesn't do this often enough, despite how long it takes to complete.  That's not to say HF:A is nothing but soldiers firing away. Every now and then there's a guy with a knife, a heavy-gunner on a pick-up, a couple BTRs, and a Hind. Unfortunately the biggest different between the latter three adversaries is the number of bullets they take to destroy. All you have to do is make sure to get behind cover when you hear the machinegun rev up. Part of the problem I suppose is that this game is very loosely based on reality. I can't go into it expecting things like cyborgs, a final boss that's actually a brain in a jar surrounded by laser cannons, a plot to destroy America with a satellite, etc. Still, there seems like there could be a lot more variety. Give some of those soldiers different guns and have them employ different tactics. Most of the time all the enemies do is run to a particular spot and start firing away, only occasionally ducking behind cover. Something as simple as having some enemies running while shooting at you would have added a lot to the game.  Another problem with HF:A is that it isn't quite sure what it wants to be. The guns you unlock come with larger clips and by the end you've got an LMG and going Rambo on the soldiers. Rail-shooters usually fall into two camps by this point. You've got titles like Virtua Cop and Time Crisis where you're given pistols that require constant reloading, and then on the opposite end of the spectrum there are games such as L.A. &amp; N.Y. Machineguns, Space Gun, and Rambo (the somewhat recent Sega arcade release). HF:A tries to do both (sorta like Time Crisis 3 &amp; 4) but it never really works. For most of the game you just end up feeling like you're over-equipped, so there's no strategy. It's unfortunate that making the player-character into a 1-4 man army would have stretched the narrative far too thin. A game where you walk into an enemy base and destroy everything in minutes would have been far more exciting. Soldiers are pouring in so you gotta shoot them all, then the tanks roll in, maybe shoot some jets out of the sky. Basically this game would be turned into a next-gen Operation Wolf.   So this definitely turned out to be a comparison review. It feels like all I did was mention a bunch of games you'd be better off spending your time with. You could probably play through at least four of them in the time it would take to get through Heavy Fire: Afghanistan, and they'd all be more entertaining.  SKIP",
            "review_score": "-1"
        },
        {
            "review_text": "Ok my little review on Heavy Fire: Afghanistan is just this!! Real good throw back to Arcade Rail Shooter's! This game is real good looking and is fun and being a rail shooter the controlls are easy !! The only thing this game is missing is a Light Gun lol Give it a shot if you are into old school arcade rail shooters ;) Man i remember pumping so many quarters in games like this in the local Arcade in the Mall back in the day lol",
            "review_score": "1"
        },
        {
            "review_text": "For 5$ game not bad, its not AAA class. But crashed 2 times in 15 minutes. Needs patch.",
            "review_score": "-1"
        },
        {
            "review_text": " Probably the worst game, with the worst the control EVER",
            "review_score": "-1"
        },
        {
            "review_text": "got this game in a bundle. perhaps my review is biased but i did try to play this game. is 0.6hrs a valiant effort. the kind of game, the look of the game, the pacing of the game didnt appeal to at all but i did try it. i think if i had some sort of light gun peripheral the game would of been played more but idk, im 6 feet tall",
            "review_score": "-1"
        },
        {
            "review_text": "Yes, it's mindless. But wtf ... I enjoy it for what it is. It's better than CoD in my Opinion, because this game here is straightforward dumb and linear. So what? I don't have a problem with that. It's a rail shooter you know ... ;)  The theme somehow reminds me of 'Northern Sea Inferno' / 'Persian Guld Inferno' whereas the gameplay itself reminds me of 'Take'em'out'. In did enjoy those two games back in the day and I'm enjoying this game here and now too.  I think the graphics are ok and well enough done for a game like this. I didn't expect to have free movement because I read the game description before purchasing it. I can't understand how many reviewers here keep moaning about this game being no real fps ... Or as we over here in germany say: 'Wer lesen kann ist klar im Vorteil.' ... :)  The controls are tight and you can choose to play with controller or mouse. Even the rumble feature is supported and configurable in strength. I personally prefer to play such a game with the mouse because it's much faster.  You WILL HAVE TO play it with a controller if you wanna coop - yes this game even has a coop. I haven't tried it but I think it would be great fun for an evening instead of watching a movie.  But even if you're playing alone there are nearly always plenty of other marines with you on the missions so you better watch out to shoot only at the enemies as friendly fire is possible and done easily in the mess of it all. So watch out not to hurt your team mates or your mission may be rated as failure.  The missions in this game vary a lot in what is happening and the overall action never gets boring. Between the missions you can upgrade your marine by investing points in different tech-trees like more ammo, better weapons and the like. And you will have to play through the whole game at least twice to see them all, preferably using the included Veteran Mode to do the second run.  I got this game on a discount and from what I've seen yet it fullfills exactly what it promised, so I do recommend you to get this game too if you want some oldschool railshooter action without having all the hassle of a full fledged fps going on.  @ngel",
            "review_score": "1"
        },
        {
            "review_text": "Got this for free but Is good if you are bored in a sunday raining day   7/10",
            "review_score": "1"
        },
        {
            "review_text": "At least its better and cost less than rambo",
            "review_score": "1"
        },
        {
            "review_text": "Trash!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics doesn't make a good game.  Verdict: 1/10",
            "review_score": "-1"
        },
        {
            "review_text": "This is a rail shooter, precisely what it purports to be. It would have been nice to have a light gun to play with, and the controls take some time to get used to, but the game delivers what it promises. Take the time to get to know the controls and the game becomes fun to play.   I confess that the controls had me confused from time to time, but then you play the section over till you get it done. :)",
            "review_score": "1"
        }
    ]
}