{
    "app_id": 306020,
    "name": "Bloons TD 5",
    "release_date": "2014-11-19",
    "developer": [
        "Ninja Kiwi"
    ],
    "publisher": [
        "Ninja Kiwi"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Online Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "Strategy",
        "Co-op"
    ],
    "achievements": 125,
    "positive_ratings": 3808,
    "negative_ratings": 347,
    "price": 6.99,
    "description": "Five-star tower defense with unrivaled depth and replayability. The Bloons are back in full HD glory and this time they mean business! Build awesome towers, choose your favorite upgrades, hire cool new Special Agents, and pop every last invading Bloon in the best ever version of the most popular tower defense series in history.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/306020/header.jpg?t=1544696857",
    "minimum_requirements": "OS: Windows 7 (32 &amp; 64bit) Processor: 1.5Ghz or better Memory: 512 MB RAM Graphics: OpenGL 2.0 compatible, ATI, Nvidia or Intel HD Storage: 512 MB available space Sound Card: Windows compatible sound card",
    "recommended_requirements": "OS: Windows 10 (32 &amp; 64bit) Processor: 2Ghz or better Memory: 1024 MB RAM Graphics: OpenGL 2.0 compatible, ATI, Nvidia or Intel HD Storage: 512 MB available space Sound Card: Windows compatible sound card",
    "reviews": [
        {
            "review_text": "So, where do I begin? Let's start with the cons as there is very little of them.  Cons: -Save game has a nasty habit of corrupting or completely disappearing. -The same repetitive jingle being playing all the time in game. -The difference in difficultly between easy&gt;medium&gt;hard&gt;impoppible can be rather steep.  Pros: -Addicting to play (lost my game save 3 times but still went back and played it). -Easy enough to pick up and play for 5 minutes (in my case it was a 2 hour lecture in uni). -Can be played with keyboard and/or mouse. -It is a very fun game to do co-op in. -No microtransactions to be found. -Plays great even on battery saving mode with everything turned off or low.  Final rating: I'd give this a 4.5/5 due to me having my save game wiped 3 times...  I'd recommend picking this up on a sale sometime. Although, I'd personally say that it is indeed worth the full price although I picked it up on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "I had a blast, this is fun. Recommended with big R!",
            "review_score": "1"
        },
        {
            "review_text": "I'm sure you played the flash version of this online, I mean who hasn't? If you were thinking this is anything like that then you are wrong. The game has inhanced graphics, better mechanics, (mortar tower isn't annoying to upgrade anymore) new towers, an assortment of new gamemodes, and no premium shop. (kinda) The new towers are fun and easier to figure out and understand (besides the helicopter) for example the bloon chipper, sucks in bloons and cuts layers off. The helicopter though, I don't get it. Maybe it's because I don't use it since I have strategies with the old ones or that it's complicated but I never see it being used. Here's a list of pros and cons though.  Pros - Easy to understand interface and nothing is ever cut off or hidden. - Shortcut keys in this feel super useful versus never needing them on the flash version - Impoppable gamemode is impoppably hard, it's a good thing! - New towers are fun and easy to work into any endgame strategy - Enhanced graphics are beautiful and work with the maps - Charming art style - Lots of replay ability - Premium shop doesn't let you 'pay to win', it should really just be called the shop  Cons - Helicopter tower may be bugged, may be useless, idk - The game gets very monotonous very fast - Daily challenge on impoppable difficulty can be impossible, either towers cost to much and it can't reach an area or  something else along those lines can happen. - You can't cross a Ninja Kiwi account with this one so you must restart - Ranking up is very slow once you hit like 25  Over all it's a pretty good game with a lot of things going for it. 8/10 would recommend to everyone  Also if anyone could tell me how to use the helicopter that would be much appreciated",
            "review_score": "1"
        },
        {
            "review_text": "First off, this game rocks. It's better than the pay to win flash version. However $10 is a RIDICULOUS price to ask for a flash game thats already free. I got this on sale for a bit over 6$ and think thats still a bit much. I would highly recommend this if it wasn't so expensive",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best games I have played since,... forever! Good and family-friendly game, but there is also SOME downsides, so I'll make a list.  Positive: Not to violent Cheap Fun for hours, and even whole days! (as you can see in my hours) Easy to learn, not too comlicated  Negative: It's possible to get so good that the game can't offer you any real challanges I kind of wish they could add challanges in Co-Op mode Don't give you enough info about the different towers, not even in the tower thingy down in the middle of the main place Too few options as to what to do in Co-Op. The only things is quick game, create Co-Op, and join Co-Op.  It's still a very good game though, most of the negative stuff is just things it would have been nice to have in the game, but that I don't need to enjoy the game.  I apologize if my english is terrible, I'm Norwegian, English isn't my native language.",
            "review_score": "1"
        },
        {
            "review_text": "Bloons TD5 is a Tower Defense game that was originally an Adobe Flash that was on a gaming site called Ninja Kiwi back in late 2011. It then got a downloadable version called 'BTD5 Deluxe' with additonal content in mid-late 2012. BTD5 Then came on Steam in late 2014 (if you purchased BTD5D, you'd get an email with a Steam Code for this game)   PROS: Addicting at times   Great soundtrack   Over 20 towers to choose from, where all have their pros and cons   New 'Special Agents' can be bought with 'Monkey Money' (no microtransactions in this version, fortunately)   You get more Monkey Money than the Flash Version   Co-op is fun to play with friends   (Manual) Cloud saves   NEUTRAL:   Game can be challenging at times   You have to pay for this vesion (there is more content than the Flash version, as well as not having to go online)  CONS:   If you're playing on an older PC, you  might  lag during the later waves   Co-op has minimal communication (only communication in the game is requesting and giving money)   Can feel like a port of the Mobile version (actually optimized and no microtransactions)  This is the game that got me to use Steam  8/10  ",
            "review_score": "1"
        },
        {
            "review_text": "I've been a Bloons TD fan for a long time and I bought the Bloons TD5 Deluxe version when it first released a long time ago. Unlike the original release version of Bloons TD5 Deluxe, this new Steam version has absolutely zero lag in the later rounds. They really did improve the late game performance! I am running a four year old rig (Gateway FX with Intel i7 930, AMD HD 5850 1024MB, 9GB DD3 Memory) and I am at round 103 with zero lag.   Pros:  -Runs smoothly at later rounds -Has a lot of maps. A LOT of maps... -Lots of towers with lots of upgrades. Some towers unlock via secret methods. -Many difficulties to challenge even the best players -Updated often with new maps and content  Cons: -Too easy to unlock everything. You can unlock almost everything in one short sitting. -There's not enough audio settings. They're only on/off, instead of sliders to adjust sound levels. -Some maps are nearly impossible on the hardest difficulty unless you have extra money to spend for special towers.  Overall, get this game. It's a great time waster. You'll be coming back to this game when your favorite online games are down for server maintenance. It's also available on almost every device but the Steam version is by far the smoothest running version.",
            "review_score": "1"
        },
        {
            "review_text": "Addicting, Balanced, and Fun. A nice game to sink a couple (hundred) hours into, and only 10 bucks. Definitely get this if you want a 100% improved version of the flash game! I absolutely love this game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why I am enjoying this game so much. But I am enjoying it so much. I put in tunes and mindlessly watch nuclear missiles and plasma shooting baboons pop colorful and child friendly looking balloons. There is a lot of things to do so you feel like you're always accomplishing something. (Upgrades, missions, shiny medals) Only thing to look out for is it can become very repetitive after some hours put in.   Pretty cool game, can easily see anyone getting 5-10+ hours of enjoyment out of it.",
            "review_score": "1"
        },
        {
            "review_text": "I just got this game and i already love it! I would recommend this to lots of people.",
            "review_score": "1"
        },
        {
            "review_text": "Quality port from Mobile Version of the game. 60fps Bloon onslaught, nonstop poppage sure to please all tummies.  Pros -Bloons -Co-op -No Microtransactions (no $5.99 for beat level) -Replayability (grinding for tokens n ♥♥♥♥) -Redone most of the art assets from flash version  Cons -None -Unless you have a latex allergy  get game",
            "review_score": "1"
        },
        {
            "review_text": "monkeys with darts poping bloons....10/10",
            "review_score": "1"
        },
        {
            "review_text": "If youre a fan of tower defense then this is a no brainer. HD remake, updated textures, fullscreen etc. However if you feel that $9.99 is too steep then just play the browser version until this goes on at least 50% off.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 One of the best Bloons games to date!",
            "review_score": "1"
        },
        {
            "review_text": "Endless replayability, upgrades and saving for things doesn't feel like grinding. Conquering hard levels is extremely satisfying! Can't think of a single con, except perhaps a few specific UI features for my laziness. 100% recommend!!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Better than the originals and those were already fun as hell.  Only wish that the options menu was better; you can't change volume levels and the options are bare  SIngle player missions are really challenging and at 250 of them you'll likely never beat all of them. Many other game modes that are also good. Just wish there were co-op missions. Speaking of co-op, it would be awesome if they somehow implemented it with 3/4 players.  overall I'd give this game an 8.5/10. If you enjoyed the original games, you'll like this one even more.",
            "review_score": "1"
        },
        {
            "review_text": "Vastly improved and optimized engine not reliant on Flash, in-game currency replacing the mobile version's microtransactions and lots of new content and refinement make this a very welcome addition to the casual strategy series.",
            "review_score": "1"
        },
        {
            "review_text": "I play this game since Version 4 Mobile came out, some years ago. I enjoy it even more on PC / Steam. It's not as laggy as before and the graphics look really nice. Worth the money!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Arguably one of the best tower defense games when it comes down to diversity and gameplay. NinjaKiwi really separated themselves from the other generic Td games by introducing new maps, an already large roster of towers (And I mean 20+ towers), and multiple extra content that isn't available on the browser version.  Initially, when I first saw BTD5 on Steam and it cost money, I was kind of skeptical because it's free on the browser, so why buy it? But this version compared to the free browser version, you get more towers on the steam version, more modes, a whole new difficulty, and no ads. Honestly, if you like tower defense games, then you should just automatically buy this.  The only downside to the entire game is co-op because there is no way of communicating with your partner except by asking for money or gifting them money. Also, there should a way in co-op to send different amounts of money to your teammates instead of just giving them all of your money if you have less than 500. Instead, there could be options of giving 100, 1000, and other options for better money management between the two players.",
            "review_score": "1"
        },
        {
            "review_text": "Brings me back to the old days",
            "review_score": "1"
        },
        {
            "review_text": "Can get pretty frustrating, but you have no one to blame but yourself. Good to play while watching a movie, honestly.  Really fun, and it looks and runs much better than on Mobile/browser. And that's coming from someone who's played a lot in other modes.",
            "review_score": "1"
        },
        {
            "review_text": "BTD5  This game is very very fun and has amazing replayabillity but i dont like how they ported it form mobile.  Pros:  -Fun -Addicting -Amazing TD -Lots of maps -Lots of towers and upgrades  Cons:  -No windowed mode? -Towers are too big -Hate the mobile graphics -Super buggy multiplayer -Couple of bugs -Pricey  Conclusion:  This game is really fun and is quite fun with multiplayer, but it needs bug fixing, quick. One of the best things about is seeing your towers upgrade and watching everthing thing expand, but there is something so satifying about starting with some money and building your way up to a temple or something like that.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "The only problem i have with this game is co-op mode. Lags and the lack of communication is pretty annoying. But overall it's pretty cool game.",
            "review_score": "1"
        },
        {
            "review_text": "By far my favorite Tower Defense game. Having spend many hours on the browser version I just had to buy it when I saw it was available on Steam. If you're a fan of Tower Defense games I definitly recommend buying this game, even if the price seems a bit high for a game that's available for free on the browser.  Compared to the browser version you can get everything ingame through ingame currency. New maps and towers are available and it's also still being updated regularly.",
            "review_score": "1"
        },
        {
            "review_text": "A fun time waster and tower defence game. Has all the content that you have to pay for in the flash version of this. (hence why its not free on steam)  If you are not sure of this game then go play the free flash version of this, if you like it then buy the steam version.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really awesome! the only thing i would like being added is a chat, But everything else is perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Bloody Amazing. Just get the damn game. Its amazing trust me. It's fun. Believe me. Hit that Add to cart button.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing and I reccommend it to everyone! I've played BTD Battles for a long, long time and since this game was released on Steam, It became a must have for me and is way better than the browser version of Bloons TD 5 in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Totally worth it when playing coop. Note that not all features of the game has coop.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest tower defense game in history has come to steam. Just get this game and have hours of fun. Also if you got deluxe you get this for free So yeah just buy this game its worth the 6.99 if you got it (I got it for free of deluxe)",
            "review_score": "1"
        },
        {
            "review_text": "If anyone remembers the free flash version of this game, this is like that but better and you get to pay for it! No, but seriously it's pretty fun. You won't be blown away by graphics or story (p.s. there isn't one), but there is enough upgrades and new stuff to constantly keep you occupied in the game. So far the only slight negative is that is not enough type of bad guys. There are plently of towers to pick from but there isn't a whole lot of variety of bad guys to fight. Oh well, if you like Tower Defense games pick this one up.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really funny game, and you are going to have lots of fun playing it. you might get a little mad at sometimes.   the grafics is quite nice. 10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "This game got me through my Highschool years, always a blast to play when you're bored. New to TD games? No worries! Just sit down and play, even incudes instructions and guides on what every Monkey does. Upgradable and gains difficulty as proceeding. Not sure on a final wave on any map, but there are a lot to choose from and all have set designed for a particular difficulty.. so choose wisely!   P.s, you can play Co-op with other Steam pals, or go to Ninja Kiwi's site and play with a friend who doesn't have Steam.  And you get your own personal level to show off your dedication to TD5.  Have fun, rage, lose, repeat!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, but....    Pros   - Lots of upgrades - Lots of maps - Gets really easy and gets really hard - Multiplayer - Good animations - Colorful (IDK IF THIS COUNTS BUT WHATEVER) - Good sounds (pop pop pop pop)    Cons   - $10? RLLY M8 Most I'd pay for this is $3. (Got it for $2 on sale) - Banana Farms are too overpowered xD - Has a lot of upgrades but it needs more or either needs to be harder to get those said upgrades. - Sometimes can get a bit repetative.     Other Thoughts   -Maybe add a story mode! - Some more gamemodes to play with friends! - Continue to update maps and add more upgrades and this game will be 7/6   JAKE'S OVERALL RATING  7.6/10",
            "review_score": "1"
        },
        {
            "review_text": "good game but you could just play it online for free lol",
            "review_score": "1"
        },
        {
            "review_text": "pop pop popity pop im popin dollars in my account o no i die rip my dog",
            "review_score": "1"
        },
        {
            "review_text": "Brill game, couldnt think it could be improved except the co op servers and to impliment a chat into co op",
            "review_score": "1"
        },
        {
            "review_text": "&lt;3 this game so much as i've also &lt;3 somebody named William (ToxicViper57)... Thank you so much for giving me this game... Best gift ever! I&lt;3U!^^",
            "review_score": "1"
        },
        {
            "review_text": "good game to play wit gf",
            "review_score": "1"
        },
        {
            "review_text": "do you like an awesome tower defense game? do you miss harambe?   you can get the best of both worlds with this game popping balloons and pretending all your hard fighting monkey are harambe trying to make murica great again and keep out...... bloons (jeesh what were you guys thinking)   10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is really awesome... and worth the buy if it was 80%off. Dont get me wrong but its free in the browser already and 5 bucks in the moble.  But otherwise the game is really fun! There is multiplayer so if you want to play with your friends then go for it :)  Theres to many things to write so ill leave it there (im lazy)",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely worth it. It's not perfection, but worth it. Especially cuz it allows you to get on higher levels without your flash crashing ^^",
            "review_score": "1"
        },
        {
            "review_text": "It's a tower defense. With monkeys. And bloons. Sounds ridiculous, but is a great fun.  What's great about this game? - A lot of very different towers + 8 Upgrades for each - A lot of maps - 250 Random missions (limited sets of towers or special rules) - 4th upgrade of Super Monkeys. Badass :-)  Whats better than in the flash version? - No lags even at level 105 - No micro transactions: get every premium perk for in-game money - All the new and great overpowered towers from mobile (Engineer, Submarine and Dirt Devel)  Worse than the flash version: - No chat at coop",
            "review_score": "1"
        },
        {
            "review_text": "Just a fun, simple Tower Defense game. I enjoy it a lot, if you like Tower Defense then I'm sure you will too. Give it a shot. If you don't like it, refund. Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "its a really good game and i enjoy playing it",
            "review_score": "1"
        },
        {
            "review_text": "-tower defensa-torre defensa!  -MONOS CON ARMAS!! monkeys whit guns! wtf really? this world is going2 end!! -the company kiwi have alot different games! cool as this!  -different kind and colors of bloons!!! there are PINK!! what?!?!?...... -PVP -COOP!! -U CAN PLAY inu cell ipod u computer etc..!! -AND im recommending this game (the man of the man! i only buy the BEST GAMES!)     .... i drop the micro.! im done here...",
            "review_score": "1"
        },
        {
            "review_text": "Really good game. I've been a fan of the series for a while now and it excites me to know they finally added this to steam. Despite this costing £7(which is cheap) and the flash version costing nothing, this is considerably better. Why?  -No crashes -Greater FPS in later waves -New towers -New maps -No microtransactions -More refined  If you have never played this game before, try the flash version, but if you have played it and loved it, this is a must!   Hopefully they will add some new features, although it's already worth it as it is now! :)  ",
            "review_score": "1"
        },
        {
            "review_text": "best Tower Defense i've ever played and yes, it's worth 10€",
            "review_score": "1"
        },
        {
            "review_text": "Basically a mobile port of BTD5. Game remains solid, options availability is limited. A few missed opportunities here and there, I feel. Price is somewhat fair standardly, but definitely much bettter recommended on sale.  In the offchance you don't know how BTD5 works, google the original flash game on Ninja Kiwi, and see if it's right for you. I feel that this version of the game lost its exclusivity once mobile got more and more content stolen from this version and placed into mobile (but not the web version, infuriatingly enough), but a PC port that works well is still welcome to an extent.",
            "review_score": "1"
        },
        {
            "review_text": "Best game i played in years   Pros:  Good quality No lagg Great towers Challenging  Cons:  Expensive Monkey lab  10/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolute fun, yeah there are some bugs here and there, but I love this game. I definetly love this game.",
            "review_score": "1"
        },
        {
            "review_text": "The monkey's chain! The monkey's fist! THE MONKEY.",
            "review_score": "1"
        },
        {
            "review_text": "This is good but broke my computer and now I'm afraid to play it, so if you could find out why this hapened then please fix it. My computer froze completly so I reboot it then this long beep sound comes up and then stops then comes back so it proves BTD 5 broke my computer cause it won't start up.",
            "review_score": "1"
        },
        {
            "review_text": "a very fun and interesting game, you might get addicted till you get to about 50% into the game if you are planning to buy this game, don't expect you can play this game for a long time",
            "review_score": "1"
        },
        {
            "review_text": "Banana based economy!",
            "review_score": "1"
        },
        {
            "review_text": "omg this game is the best but i lost all my stuff it just went away when i loged in if the creator is reading this please put my rank to 37 like it was and i had about 4000 monkey money!!!please do this its a great game but i cant regain all of that please fix my game?",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely the GREATEST TOWER DEFENSE GAME on the PLANET. This game is a legend amongst TD and browser games. I put in hundreds of hours in Bloons TD4, and then when TD5 came out, I played it almost every day online in browsers. Now that it's on Steam, I had to buy it.   Yes, you could play it for free on websites, but this version has:  - More levels - Can run fullscreen/runs smoother at the crazier levels - Has EVERYTHING the game has to offer - STILL gets updates after years of being released  It's unpresidented that a free flash game gets updated for years on end. I just had to support the developers. They deserve the money. This game has more entertainment value than some $60 titles I purchased",
            "review_score": "1"
        },
        {
            "review_text": "I play bloons too much",
            "review_score": "1"
        },
        {
            "review_text": "Was a great game on browser.It's like a cheap DLC that adds multiple things more to do and towers and maps and better co-op maps its just amazing! GET IT!",
            "review_score": "1"
        },
        {
            "review_text": "ninja kiwi is awsome because they made Bloons TD 5,and Bloons TD Battles.there my favorite because Bloons TD 5 is a endless wave/round game and on my mobile device i got to round 103 so i saved the game then the next 1|2|2017 i broke my tablet :( i got my tablet on Xmas eve. RIP tablet.",
            "review_score": "1"
        },
        {
            "review_text": "Game abbandoned and it does not run. No more patches nothing, just died and if you are one of the unlucky people that can't get the game to run despite visiting literally all the web, than sadly they are not fixing it ever. Cashback immediate.",
            "review_score": "-1"
        },
        {
            "review_text": "It's all fun and games until the balloons get past, kill your women and ♥♥♥♥ your kids.",
            "review_score": "1"
        },
        {
            "review_text": "I had 245 hours played and it reset all my progress.",
            "review_score": "-1"
        },
        {
            "review_text": "good game but how is this in top sellers",
            "review_score": "1"
        },
        {
            "review_text": "With the new steam version of BTD5 (Bloons Tower Defense 5) I decided to get it for a relative cheap price, however if you are expecting to play this in long sessions I would discourage it as there are very few combinations of monkeys to winning harder levels. New to this version is Co-op/Multiplayer this felt very half-backed because the Co-op has you controlling 1-side of a map and the other player the other, this felt pointless as I never felt like playing these modes though because there is no real point to it becuase the connection can be bad not saying it is always bad it just is a bad idea that could have improvements and to 'fanboys' out there I don't care if you think having one side while your partner has the other is good, because it is not. finale co-op thoughts, add both players can place buildings anywhere however the maps used for the split co-op are well planned but make me feel like that one side i'm playing is one whole map. And finnaly lets move onto 'is this better then the FREE one on Ninja Kiwi' and to that I say there is no significant difference apart from a few new towers for example: Helicopter, Submarine and Bloon-Chipper (all of which come with their own tower upgrade path) so I would say you don't need to get this at all if you don't mind the small lack of towers, play on Ninja Kiwi and save your money. 4/10  +New upgrades that add small bonuses +Fullscreen (with boarders) feels great   -Very few new towers that are not worth the money -Unoticable/boring Co-op/Multiplayer -No graphic change to web version -Game lacks enough new features to make the cost worth it -the only way to obtain the premium currency (gold coins) is by completing levels and agents should not cost gold coins but instead be given to you when you complete levels",
            "review_score": "-1"
        },
        {
            "review_text": "the only game where you can hire black people with money and destroy things that bring children's joy by any means possible. darts, bombs, woodchippers, fire, boomerangs, missiles, corrosive glue, ice, magic, and even divine intervention.  . . . What? This is a game about MONKEYS destroying BALLOONS with darts, bombs, woodchippers, fire, boomerangs, missiles, corrosive glue, ice, magic, and even divine intervention? Same thing pretty much.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to like this game due to lack of TD games in the market however this game has some very big issues  1- The game does not force you to develop different strategies to beat any level.  2- There are only 3 main groups of balloons Camo, Moab and Iron  3- On any map up to level 40s, three or four towers are generally sufficent. And you just have to wait up to those levels for challenge which is very boring.   4- Very repetative gameplay. Disregarding the map and difficulty level, balloons always spawn in the same order.  5- To get more money and more coin you need to play easy and medium level while you already bet the hard level which I really really hate.  6- Some combos are too powerful such as Shredder + Submarine.  7- Hard mode should not be just sending insanely large amount of balloons in last 2 turns.",
            "review_score": "-1"
        },
        {
            "review_text": "Borning as hell I kept thinking it would get better but I was wrong. So I got a refund",
            "review_score": "-1"
        },
        {
            "review_text": "Pay us money so we can reset ur statis. Make EVERYTHING be paid for with M-Money. Remove save and load, make you pay for EVERYTHING.",
            "review_score": "-1"
        },
        {
            "review_text": "The worst tower defense game I have ever played, and I've played a lot of them.  Nothing inovative at all. Graphics of the enemy are very simplistic of course, mostly just different coloured ballons.  I played a single level, on normal and gave up due to boredom after half an hour, 65 waves that I mostly just fast forwarded through. On the first level tons of new towers and upgrades were introduced, so I saw a lot of the game in just the first level. I certainly saw enough to know I really dislike this game. Not worth it even at 75% off.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought this would be a fun, casual game, but difficulty scales too quickly. It's even hard to run medium on beginner tracks without intense resource management, special boosts, and 'special agents'. It's easy to get stuck in a loop where you lack the money for bonuses, but need the bonuses to win the money to buy the bonuses. Pretty stupid. Not a good game after the few early levels unless you're hardcore.",
            "review_score": "-1"
        },
        {
            "review_text": "This game SUCKS! It is boring just like Bloons TD Battle 3,2,1. I wish I could have my money back....",
            "review_score": "-1"
        },
        {
            "review_text": "Look past the cartoonish graphics ... this tower defense game is fun but also has good depth of gameplay.  I thoroughly recommend the game, when one caveat. There is a SIGNIFICANT BUG with MULTIPLAYER mode:  When I create a private match, the network connection is dropped after a number of levels, more often than not.  Its a very frustrating issue ... there isn't really enough information to debug the issue. Perhaps its because my opponent is running MAC OS X and I am running windows - nonetheless, I hope it is fixed!",
            "review_score": "1"
        },
        {
            "review_text": "Warning: I have played the flash version, and the ios version and the monkey city game. The 0.7 hrs is not accuret to my overall bloons experiance. Now to the review.  Damn bloons, made it to steam. Time to build my monkeys to pop them!   This game provides so much, you got towers, some exclusive to paying for them (flash version doesnt cover, although ios does because u pay for that one), tier 4 buildings, tons of maps, co op (which doesnt work btw but its a temperary issue)  Problems? settings mainly, no graphics sliders nor rebindable keys (although that one is forgiveable) and windowed mode has a couple of issues (one game breaking, but easy to fix) just make sure you dont leave the game windowed, or u will have to troubleshoot (for now)  Its a tower defense game, focused on monkeys, use them to destroy bloons. bloons then give u money, mo money mo towers, mo towers = higher pop power, higher pop power = surviving more = mo money and repeat  Rating: 8.5/10 'One of the best tower defense games, now on steam. Has its fair share or temporary problems, but all in all a must buy for tower defense lovers'",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best Pure Tower Defense game of all time :)",
            "review_score": "1"
        },
        {
            "review_text": "There is a free version to this game, so unless you really enjoy this game and want the extra content do not buy it. However, I really enjoyed this game and I bought it to support the devs, all in all I'd give it 7/10 only because it is pricey, if it was lowered to $5 I would give it 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Crack gaming, co-op edition. Sweet.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely better than any of the free browser versions. More levels, more towers, more challenges. However if you're gonna play no more than 10 hours of this game, it's worth staying with the free browser versions of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Ah a classic game from my earlier years of schooling. Been playing Bloons games for a long time, well before even Bloons TD 5 came out as a really nice flash game. As soon as I found this game on Steam I bought it in a heartbeat and have been satisfied. An even smoother experience as these popping bloons drain away the hours. And there is never anything wrong with hearing plenty of satsifying pops as you play through.",
            "review_score": "1"
        },
        {
            "review_text": "Gotta love tower defense; gotta love Bloons; gotta love this game. NinjaKiwi did it again with this game, but so much better this time. Add a ton of elements like permanent upgrades and split research paths with limits on special tiers of said research, and you've got a little more than most tower defenses. Cute visuals that scale well even to 4K. Can't go wrong with this.",
            "review_score": "1"
        },
        {
            "review_text": "Well, i have some problems to play the Co-op mode, but everything else is awesome!  I loved the new towers and challenges. If you like Tower Defense games you have to try this.  Good job Ninja Kiwi.  edit: I forgot the most important thing that made me love the game... IS NOT PAY2WIN!!!1",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best TD's out there and this is simply if you want some extras and to give the creator some money for making a legit and amazing game. Simple as that :)",
            "review_score": "1"
        },
        {
            "review_text": "Good solid remake of classic webapp do not like the cheat system could probably make a better mod but hell for 10$ cant go wrong",
            "review_score": "1"
        },
        {
            "review_text": "OMFG STILL A BLACK SCREEN",
            "review_score": "-1"
        },
        {
            "review_text": "Temple Sun God = Destroy every tower you ever had = 1000 ZOMG'S = Lag = Lag Lose = Glitch out = Insta win 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, popping balloons might seem pretty stupid at first, but when you  really  think about it; your motive might not be popping balloons just for no reason, but freeing the oxygen inside them and making the world a safer place to breathe in.  Worth 10€",
            "review_score": "1"
        },
        {
            "review_text": "Very Great Tower Defense game. Been playing the online for years and also play the android version. This is the best version to play, period. MUST PLAY! I'm glad there is on in app purchasing in this version.",
            "review_score": "1"
        },
        {
            "review_text": "If Nicolas Cage were a tower defense game, he'd be Bloons TD5. That's how good it is.",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the best tower defense game. Lots of choices and updates to weaponry I really liked it. My one complaint is that the achievements are strange and hard to get (cumulative).",
            "review_score": "1"
        },
        {
            "review_text": "There should be an autorun for normal play like the iOS and Android version. Other than that though it's a very fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Like bad rats with monkeys... Bad Monkeys?  Serious review: Great game for wasting time and/or playing while listening to podcasts. It's a casual game that takes skill and it's developers actually care. My only issue right now is that I can't carry my progress from ninja kiwi to here nor can I play co-op with my friend who plays the browser version. Fix that and this game will be a 10/10 in comparison to all the other games alike.",
            "review_score": "1"
        },
        {
            "review_text": "Great strategy game!",
            "review_score": "1"
        },
        {
            "review_text": "I love the strategy of this game and how challanging it is!",
            "review_score": "1"
        },
        {
            "review_text": "Runs WAY better then the BTD5 on those crappy sites, and it looks better!",
            "review_score": "1"
        },
        {
            "review_text": "Bloons TD 5 is a great tower defense game.  Gameplay- You have towers that you place down that pop bloons for you. There are level difficulties and small modes like sandbox. It's fun to experiment with different towers and sell everything you have to fill the map with 0/0 dart monkeys and watch the bloons destroy your life bar. Rating: 9.5/10  Story- The game has no real story or story mode. Rating: 0/10 no story :P  Graphics- The game looks good and it runs smoothly. What more could you ask for? Rating: 8/10  Price- I bought the game at full price and I would definitely say that it is worth it. The game does go on sale but not so often from what I've seen. Rating: 8/10  Sound-  awhooohoohohohadwnwafnsof The game has an amazing soundtrack and listening to the bloons pop is so satisfying as you listen to the popping noise of the dart piercing the bloons. Rating: 8/10  Co-Op- The game has online co-op where you team with another player to pop the bloons but it has no chat. You won't be able to communicate with the other player. I advise looking for someone to play with. Also it doesn't have BTD Battles :( Rating: 6/10  Overall Rating:8/10 ",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun",
            "review_score": "1"
        },
        {
            "review_text": "POP THE BUBBLE WRAAAAP.",
            "review_score": "1"
        },
        {
            "review_text": "Fun time-waster when you don't feel like playing others. I'm a fan of the flash games and this is just like the best of them with a new coat of paint. Would pop again.",
            "review_score": "1"
        },
        {
            "review_text": "GREAT GAME  I really love the btd series, and the fifth definately doesn't disappoint. All towers are alot of fun, and my favourite thing in the entire game is that most tracks don't require the most overpowered tower, the super monkey, to win on hard, impoppable is a whole matter on its own as i have not even been able to beat monkey lane on impoppable. but I definately think its more fun to at least try to do it without the super monkey, there are plenty of other things that work like the missile tower + ice tower, or monkey engineers. This game is still being updated at the time im writing this so its never getting old. The co-op could be better, as on the online version of this game (i would reccomend playing this instead as in the online version, there are no engineers, submarines, helicopters, and other awesome stuff) has chat features that would be really helpful in quick matches. One thing really great is the playtime, im not joking when i say that it might take months of gameplay to 100 % this game, with all medals, all mastery, all daily challenges, which are infinite, i think, all random challenges, all monkey lab upgrades, all secret agent pros, all things done in co-op, even if co-op kinda sucks. Point is, theres A LOT of stuff to do in this game, and if you had BTD Deluxe from their site before, go look up ninja kiwi in your e-mail, they should have sent you a code to download this game for free, and im glad they did.  Keep up the good work ninja kiwi, loving your games.",
            "review_score": "1"
        },
        {
            "review_text": "It's not bad.",
            "review_score": "1"
        },
        {
            "review_text": "I used to be a normal person... then I took a BTD5 to the knee.  This game is very good in the aspects that it's good for whenever you're bored to death and having nothing else to do, as well as having the login reward for every day you log in. It also has a playability time of around 900,000,000,000 hours for every single map, medal, achievement and upgrade to be unlocked.  10/10 I now take darts to birthday parties... the bloons are watching me...",
            "review_score": "1"
        },
        {
            "review_text": "It is one of the best times I have evr had playing a video game, because I like to multitask, and with this you can, it is just amazing, the graphics and the art are outstanding and stunning, The music is beautiful. the only problems I have had with this game is that there is no way to communicate in co op mode, hopefully they fix that soon, other than that, it's a great game all around.  10/10 Would pop again",
            "review_score": "1"
        },
        {
            "review_text": "its fun and could play it for days :)",
            "review_score": "1"
        },
        {
            "review_text": "Beware Round 42...",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, im very happy that you made it so you can play it on pc :P",
            "review_score": "1"
        },
        {
            "review_text": "highly recommend this game alot of fun",
            "review_score": "1"
        },
        {
            "review_text": "Very great game. Endless fun, and co-op is just timeless",
            "review_score": "1"
        },
        {
            "review_text": "Great game! But please fix the game crashes at the multiplayer mode.  ",
            "review_score": "1"
        },
        {
            "review_text": "If you want to look like a hacker, get double money.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best tower defence games period ! and with the new updates it's alot of fun.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is tons of fun. I bought it out of nostalgia because I used to play it years ago in a web browser. It's satasfying to strategically setup your defenses and mow down balloons faster than human vision. It always starts out slow but give it a few minutes and ballons will get bigger and stronger until you can barely hold them off. BTD is a great casual game to play anytime for when you don't want to commit to anything too time consuming. If you're not sure what to play, open this game up and next thing you know, you're having a great time!",
            "review_score": "1"
        },
        {
            "review_text": "Used to be the only game I played in computer lab back in the day.",
            "review_score": "1"
        },
        {
            "review_text": "get this game and play with me",
            "review_score": "1"
        },
        {
            "review_text": "my family keeps asking why i hate balloons.....",
            "review_score": "1"
        },
        {
            "review_text": "Great Game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Regen farm got me to level 60 and made basically and endless game. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, It feels a little better then the free version. Plus it seems easier then going onto the site to play, and it tracks your hours. I recommend getting it on sale, but it is addicting. Looks nice too. Runs well.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, nearly perfect, but the menus are not designed for PC. This is exceptionally frustrating considering how much time is wasted cumulatively just trying to get through the menus that are clearly designed for mobile platforms. These menus could be easily improved and would reduce the amount of time not playing significantly. The following questions help clarify these menu and GUI issues:  Why do I need to turn pages to see all the towers available? Why do I need to go to settings to turn on auto-play when there is room all over the screen? To include the bars on the left and right making a 4:3 aspect ratio. Why do I need to scroll through all the targeting priorities when you could easily click the one you want (like in the flash version)? Why can't I select the maps or upgrades from an easy list rather than swiping optimized method (I know there is a sorting method but this is insufficient)? Why is it that when I click on a tower next to another one, my selection alternates between the two when I am clearly clicking on only one of them?  Don't get me wrong, I will keep playing the game but the menus are absolutely frustrating. Play the free flash version, the extra towers and maps are not worth the cost (at least at full price), and definitely not worth the cost of time navigating. It is dissapointing, if the menus were actually made for PC this game could be an easy recommendation and very enjoyable.",
            "review_score": "-1"
        },
        {
            "review_text": "i didn't think watching as monkeys pop balloons would be so entertaining!  28/28 ",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome as a relaxing way to end a long day / week at work or school.  It's a classic TD game with a very easy friendly interface and lots of different options.  Like explosions? Use the cannons, want to see lightning? The mage is the way to go.  You'll find yourself learning and combining towers to suit your needs but in the end it all comes down the the temple of the monkey god.  Nothing stands in the way of a pure golden beam.  Played BTD5 on ninjawiki website, have it on my phone bought it on steam for me and a mate.  AWESOME STUFF.",
            "review_score": "1"
        },
        {
            "review_text": "Beats the hell out of the site one for sure.  8.5/10 darts",
            "review_score": "1"
        },
        {
            "review_text": "Bro, it's btd5, enough said.",
            "review_score": "1"
        },
        {
            "review_text": "I bought a free game.  God bless sweet baby gaben",
            "review_score": "1"
        },
        {
            "review_text": "Great tower defence game!",
            "review_score": "1"
        },
        {
            "review_text": " What I liked:      So much variety in towers and balloons ( love the balloon inception)     Upgrades ( 2 paths to take )are game changing and awesome!!     You can set what enemy to hit ( closest, strongest, first)     You have lots of modes ( special condition missions, long odyssey missions, daily challenges)   What You Need to Know:      There is a flash verison ( you don't get some towers, special units, maps and you have microtransactions) but it's free     I played the flash and the dexule versions alot back in the day     You rank up( your profile) to unlock new towers( after 2 games) and abilities ( takes alot longer, but they are worth the wait)     You can upgrades your stats of the whole game ( start with more money, better attack range, speed and more)     You can buy agents that help you and do special tasks ( collect you banannas, do varied attacks for you, )     You can't maze, but you can put towers anywhere they can fit     Lots of maps to offer variety     Don't let the art style and theme turn you off, this game is a superb TD game (my favorite other than Creeper World)    My Score:",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, and fun is good. but seriously, runs perfectly and is awe-inspiring with the amount of content.",
            "review_score": "1"
        },
        {
            "review_text": "best thing about game is popping sound and see the money rise.  Please add chat for multiplayer and add new bloons pris :'(",
            "review_score": "1"
        },
        {
            "review_text": "Note: While I may not have many hours, I played countless hours in browser, on my phone, and on the non-Steam version  Like regular bloons, but with a better engine (can go to high rounds with good fps, runs better, higher resolution, prettier graphics), NO microtransactions (everything is included + earnable), and has steamworks support for co-op that doesn't lag like crazy.  These are all the improvements over the free Flash version. If you don't already know the game, it's a great tower defense game. It doesn't take itself too seriously, and is a lot of fun. You can always try out the free flash games to see if you want this one. It's a got a pretty good price and is easy to sink plenty of hours into.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, colorful TD game that's fast paced and filled with tons of content and variety.   Tons of maps, tons of towers each with 2 unique upgrade paths that can turn them into wildly different towers, cool activated abilities to fire off, and lots of passive upgrades/research for those that like a feeling of progression.  Now, this isn't really a 'puzzle' or 'mazing' TD game but rather one that offers a different experience through it's MANY different game modes and it's massive amount of maps. You have Daily Challenges, Co-op mode, Event maps, Reverse mode... lots of stuff!",
            "review_score": "1"
        },
        {
            "review_text": "I have always loved bloons tower defense games and so excited to see it come to steam. Extremely fun and addicting tower defense game!",
            "review_score": "1"
        },
        {
            "review_text": "I have this game on mobile, but I recommend making the purchase on Steam. Why? The framerate is much more consistent. There are no gameplay differences between the two, but on mobile, the game starts to lag in the later stages and placing towers becomes tedious because it's hard to place them accurately. There is something strangely addicting about popping a sh*tload of balloons with dart wielding monkeys.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty cool game, although you could just play the free browser version which is basically the same, but if you feel like supporting the developers then go ahead and buy this.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like Tower Defense games? Have you played any of the other BTD games?  Do you hate baloons?  If the answer to any of these is yes, then BTD5 is a worthy buy.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun i used to play the flash version but then i stopped because it was slow a laggy but then i saw that it was on steam and i was errmahgurd and bought it im so happy i would definitely recommend it :D",
            "review_score": "1"
        },
        {
            "review_text": "it needs co op chat but its really good overall",
            "review_score": "1"
        },
        {
            "review_text": "this game is a lot of fun and awesome 10$ is a lot for the games yes BUT!!!! if you're going to put a lot of time into the game  its obv. worth it the game is so much fun   11/10 for sure :)",
            "review_score": "1"
        },
        {
            "review_text": "Before I jump into the review I'm going to answer the question almost everyone is wondering, why pay money for a game I can play for free? Let's get right into it 1. Premuim upgrades. All buyable upgrades now have to be earned through honest gameplay 2. Better Co-Op with Steam 3. Offline play, or being able to play without access to internet. 4. Support to Ninja Kiwi. Bloons Tower Defense is an incredibly addicting game which you will easily put an entire afternoon into without skipping a beat, that being said it's nice to support the creators with a measily 10 USD   REVIEW Bloons Tower Defense Knocks it out of the park with some of the best tower defense gameplay available in the market. Besides a standard play that consists of 30+ levels all with unique artwork and level design there's also 4 difficulties, and 4 game modes. On top of that there's special missions, Daily Challenges, Co-Op, And tons more! I would recommend this game to both casual and hardcore gamers alike.",
            "review_score": "1"
        },
        {
            "review_text": "The sound is messed up horrible game :(",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game ... it's very simple or so it seems lol ... the balloons come along a path (or paths) you must select the correct type of monkey to pop them. The balloons start off slow then keep increasing in both level (yes the balloons have levels and some have special abilities and resistances) and frequency so you will need to keep updating your defenses. It also has the puzzle element in you must select the correct 'piece' or you will be overrun with balloons. I don't know what the rating is on this game but I found nothing offensive about it which would keep youngsters from playing it.  Honestly I didn't think I would enjoy this game from the title but I gotta tell ya .... IT ROCKS!!!",
            "review_score": "1"
        },
        {
            "review_text": "The perfect game for wasting time and popping bloons.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with tons of content but once you get the hang of it, it becomes 'spacebar pressing simulator'",
            "review_score": "1"
        },
        {
            "review_text": "Even though I recommend this game, it has a super crappy bug in it. Every once in a while, it resets EVERYTHING. And that is really CRAPPY, so you have been warned.",
            "review_score": "1"
        },
        {
            "review_text": "love this game pros: lots of content try different new things helps with teamwork and instead of buying the pruim in ipad or flash you just get them with monkey money. And i have played this on ipad rank 70 almost at easy map mastery mode. cons!!!: pls add chat in multiplayer!",
            "review_score": "1"
        },
        {
            "review_text": "buy this so you dont have to do microtransactiosn and if you love this type of tower defense",
            "review_score": "1"
        },
        {
            "review_text": "A fun arcade game you can always come back too. Great for completionists as it is riddled with things to do. Devs still update this game regularly and check the forums to help out their customers like a real business.  I recommend buying if you love tower defense and arcade games just to sink your time into",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun, it is just like the original BTD games, just with more fun!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and addicting tower defence game with balanced towers and fun gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "this is my favorite game on steam",
            "review_score": "1"
        },
        {
            "review_text": "So bloons TD5... A great fun flash game for everyone! I'm gonna go into the pros and i'm going to go into the cons!     Pros. Nice music! A variety of maps. Medals that you can earn. Tokens for upgrading your stuff. Variety of monkeys. Special agents. The number 5. 2 Extra towers.    Now the cons. There is a flash version. Zomgs and bfbs and moabs don't pop right away. Lead Bloons float.   Ratings: 9/10 Would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Really a good game, very recommended. already playing since BTD 1",
            "review_score": "1"
        },
        {
            "review_text": "Good game, cannot wait until next bloons game comes out, i here they are adding 3 paths for each tower! ",
            "review_score": "1"
        },
        {
            "review_text": "Great game but a little repetitive, Worth the money",
            "review_score": "1"
        },
        {
            "review_text": "It was fun until my save was randomly wiped.  I've heard this has been a problem for most people, and when Googling it, there seemed to be no way to fix this.  I really wanted to give this game a recommendation, but how can I now if I'm not motivated to play the game? At least it was fun while it lasted.  [UPDATE] I decided to go back to the game, and I've played one map so far. I have to say, I find it less fun, but the reason my data was completely wiped was because the game did not automatically cloud save. Weirdly though, my leaderboard stats are still saved... But either way, if you want to get this game without expeirencing what I and many others had to deal with, make sure to cloud save. I'd probably give this game a reccomendation, but I can't until I really start enjoying it again.",
            "review_score": "-1"
        },
        {
            "review_text": "very entertaining game if you like tower defence games.",
            "review_score": "1"
        },
        {
            "review_text": "  It's a really simple Tower Defense game based on an amazing flash game  It's basically a port of the mobile version so if you have that then there is no reason to pick this up, and even if you don't, I'd still reccomend to wait for a sale since the game may be a little TOO simple, and while there are numerous upgrades to the flash version, it isn't $10 worth of upgrades  To me the best way to enjoy this game is to turn the sound and music off and listen to a livestream or podcast in the background, it's a good timesink and mindlessly simple enough to multitask with",
            "review_score": "1"
        },
        {
            "review_text": "So so so so soooooo much better then the free pc version on there website and also better then the mobile version as well. ",
            "review_score": "1"
        },
        {
            "review_text": "To be honest, this game is extremely overpriced. In my eyes, this game should only be around $2, heck, even free. However that does not take away from its gameplay. This game is really fun and even at times, rage inducing. Why this game may seem like game to play during a road trip or an airplane ride, it's totally not. I rate this game a solid 7.5/10. Definitely would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Really good I just wished you could use your ninja kiwi account",
            "review_score": "1"
        },
        {
            "review_text": "[/h1] Warning. Minor Spoilers. [/h1]  Welcome to BTD 5.  BTD 5 provides a surreal atmosphere throughout the entire game, with powerful and persuasive speech, to it's stunning art. Packed with excitement and action, It's compelling and astonishing gameplay provide gripping and riveting combat with a heartwarming and touching story. Rarely do you see a game as satisfying and pleasurable as this, a must buy for newer or experienced gamers.",
            "review_score": "1"
        },
        {
            "review_text": "first, it is fun nice time waster.  I liked the free flash version 5 years ago, and I like this.  and that is exactly my problem. free, flash version 5 years ago. I just dont think it is worth 10e.  5$ ? yeah ok, that would be fine. but 10?  other cons, I have the about the same 50% cpu usage here as playing far cry4 on ultra (i5@4.4ghz) and user interface have some really stupid and anoying 'glitches' (canceling / non canceling tower placing, troubles with spikes...) .",
            "review_score": "-1"
        },
        {
            "review_text": "can you plz add a system, so we can buy money and gold coins in-game ussing steam money?",
            "review_score": "1"
        },
        {
            "review_text": "good game. fun, hard, and interesting. you'll have fun untill you play with double cash, but still fun ",
            "review_score": "1"
        },
        {
            "review_text": "   what do we have in the paste? nothing? oh.  I got this game after I got btd5d, which is now discontinued. btd5 steam is a great game, but it copies mobile too much. At least the premiums are f2p. My recomendations to add is the new maps in btd5d like the   banana factory. (Towers move on that map!!!)   It could really spice up the game but coop might get tricky to code. Otherwise it's a good game 10/10 best game would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great to play if you need time to go by. It is really fun, there is never a dull moment.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game i played in fifteen years and it's amazing i recommed this game to everyone and the daily rewards ",
            "review_score": "1"
        },
        {
            "review_text": "ANNIE GRAB YOUR GUN!   --  The bloons are back! And this time with fully HD resolution, crisp audio, clean animations, and a killer co-op mode that is sure to have you playing for hours on end (I almost have 100 hours :P).   But seriously, this game is fantastic if you have nothing else to do. If you haven't or even have played the flash version, I can promise you this is 100% better and worth a try. I would grab it on sale personally, but even so I don't miss my $10. I love to play co-op with my friends, and with hundreds of added unlocks, upgrades, dailly missions, new maps, etc, etc, etc. you will never run out of things to do. For real! Give it a **pop**!",
            "review_score": "1"
        },
        {
            "review_text": "9/11",
            "review_score": "1"
        },
        {
            "review_text": "Great game I've plated on mobile and ninja kiwi but have to say the pc version runs best performance wise as it doesn't seem to lag out during later waves",
            "review_score": "1"
        },
        {
            "review_text": "I love tower defense games. This is by far the best of them. I got hooked on the series by BTD3 but this one is the pinnicle of the franchise. If you like the tower defense genre, this is the best game out there by far. I would highly reccommend it to all, as a casual or hardcore game.",
            "review_score": "1"
        },
        {
            "review_text": "Nice, addictive and fun game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "this product requires opengl2.0 or greater",
            "review_score": "1"
        },
        {
            "review_text": "10/10 I didn't think popping balloons with monkeys could be this fun or relaxing.",
            "review_score": "1"
        },
        {
            "review_text": "Skeptical buying at first consedering the flash version is free. But i was WRONG! This game runs extremely faster,smoother,and cleaner then the flash wont get laggy at round 50 i dont reccomend to buy full price as i bought it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Everytime i start up the game i can see the monkey cursor and the screen is blank and can hear music but cant seem to fix the blank screen problem, any help is appreciated",
            "review_score": "1"
        },
        {
            "review_text": "Great game and it is a great app for a game",
            "review_score": "1"
        },
        {
            "review_text": "I good way to loose all your friends.",
            "review_score": "1"
        }
    ]
}