{
    "app_id": 306410,
    "name": "Crystals of Time",
    "release_date": "2014-06-13",
    "developer": [
        "RVL Games",
        "exosyphen studios"
    ],
    "publisher": [
        "exosyphen studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Hidden Object",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 604,
    "negative_ratings": 333,
    "price": 0.79,
    "description": "Help Ashley Ford find her father and solve the mystery of the Three Oak Mansion. A professional thief, Ashley has inherited this hobby from her father, who suddenly disappeared one night while he was trying to sneak into the Three Oak Mansion. You start the game in front of a big, deserted house that hides a lot of secrets.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/306410/header.jpg?t=1447362207",
    "minimum_requirements": "Минимальные: ОС: XP,Vista,7,8 Процессор: 1.5 Ghz Оперативная память: 2 GB ОЗУ Видеокарта: 1 Gb DirectX: Версии 9.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I like puzzlers although they are not my gaming focus. I picked this up in a bundle (at  BundleStars  [www.bundlestars.com] ) and I am finding it quite entertaining. I would rate it 7/10.  There are some negative reviews, which are fine since no game will appeal to everyone but I think mrozru's and AMX's comments are incorrect and unfair.  Granted there are better puzzlers but if you follow the clues, pay attention to the environments (which have good graphics), and have half a brain (you only need half as there are hints available at every scene) you will have little difficulty. Any easier and what would be the point?  Pick it up on sale or as part of a bundle.",
            "review_score": "1"
        },
        {
            "review_text": "    Crystals of Waste of Time",
            "review_score": "-1"
        },
        {
            "review_text": "Unless you find this for $.99 and have NOTHING else to do, don't buy this game.  Each hidden object scene contains the item you need on the list, so once you find it finishing the rest of the hidden object scene seems pointless. Most of the game is going back and forth through old scenes looking for a hidden object scene to pop up so that you can find the next item you need.   The base storyline to the game lacks any depth and even after all that bore I was shocked at how quickly the game ended after I finished. Usually there is some 'finishing story', but this basically was '...and that is all!'   Free or less than a dollar, anything other than that and you are wasting time AND money!",
            "review_score": "-1"
        },
        {
            "review_text": "Crystals of Time, for me, felt like a very nostalgic game. It's a simple point-n-click, hidden object, game. The graphics are beautifully rendered and painted. It's definitely a very casual game that you can always go back to whenever you want. The story is pretty basic and straight forward.  Some people might find it an annoyance to have to wander around to get clues and objects.  But really, all you need to do is access your map to get closer to the rooms you need to be in. This isn't an mmorpg, don't think that you'll be able to click on everything and expect to find secret spots.  Crystals of Time has very simple game mechanics, you only click what's necessary.  So if you're a fan of simple, no frills, games and want a relaxed playing experience?  Then yes, you'll probably enjoy Crystals of Time.  But if you want to be able to poke around more and get more in depth?  This may not be the game for you.   For what it is, I find it to be a well made game. The developers knew exactly what they wanted and stuck with it.  Even technically, there was nothing inherently wrong with the gameplay.  It just all boils down to personal preference.    ",
            "review_score": "1"
        },
        {
            "review_text": " Game is pain to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Crystals of Time is a hidden object game, or HOG for short.  It is a casual type of game and sadly, this one isn't very special. The ending is very disappointing, and an insult for all those tasks you undertook.   For fans of this genre it still has some good sights to behold, but in gameplay itself it is neither a surprise nor is it even one of the better ones of the genre.  This said, I really can't recomend the game - not only based on the disappointment on the end, but also because of other things that make this game a bit too - uncomfortable.  If you are new to the genre of hidden object games, don't buy this - the disappointment that will stay with this game, will break your ... curiosity.",
            "review_score": "-1"
        },
        {
            "review_text": "  This is an OK game but not for the full asking price, maybe worth $1 at most.  It is a very basic hidden object game you can play to pass the time, but don't expect any major challenge. On the positive side, you also won't find yourself stuck and ripping your hair out either. The game has a hint crystal which you can use to guide you along to the next part of the mission.  The mini-challenges (logic puzzles) are mildly challenging, nothing that gives your brain a major workout, good for a casual game such as this.  As is common with many hidden object games, I frequently hunted for the final hidden object in a scene and when I finally had to resort to the hint I was often left frustrated because the object looked nothing like it does in real life. Other times I clicked on an object 12 times but it didn't pick up... after using the hint it would turn out I was clicking the right object, just not the right pixel.  Another time I needed to find the object 'nuts' and there were at least 5 of them visible in the scene, yet none would register. Had to wait on the hint multiple times as a result of the lack of Quality Control in the game.  Sometimes there is 'mystery meat' navigation where you wave the mouse around willy-nilly looking for something to click on. Bad design to be sure, but not as bad as I've seen in other games.  OK for fans of the genre, but it's only maybe 4 / 10 score",
            "review_score": "-1"
        },
        {
            "review_text": "I like these types of games because I get a few hours of very calm entertainment. This is one of the ones I would recommend skipping completely.  It's nothing special and it's more annoying than it is pleasureable. The UI has minor annoyances that become greater as the game passes. There are no reasons given for why you have to back track to find other puzzles. Your intentions aren't clear pretty much ever. The time travel aspect is under-utilized and when it is it doesn't make any real sense as to why you it would really matter. These games usually only rely on the hint button when you are stuck on that last stupid thing to find in a puzzle or if you've lost track of things. Here it's the only way you don't waste 10 minutes each and every step backtracking through the entire map.  Speaking of the map, the in-game map is almost not worth it. There are only a handful of points available to teleport to and I don't know what is lazier - The lack of nodes on the map or my need to teleport to ♥♥♥-ends of each area instead of clicking through. I vote the map coding is lazier.  This is one of the worse games of this type I've played. My playtime is skewed because I had a clicker game open at the same time, but I played the whole way through and only finished because once I got past the 'run as administrator' issue in the beginning I was determined to finish the game in one sitting nonetheless.   There are many better ones out there. Skip this one.",
            "review_score": "-1"
        },
        {
            "review_text": " Short version: 56%",
            "review_score": "1"
        },
        {
            "review_text": "You play as Ashley Ford, a adventurous good-looking girl, trying to solve a mystery of her father's disappearance. One day, you find his journal and head to a manshion where he was last seen....  Game is not too long, but not short either. Puzzles are challenging but not too hard to solve. Finding hidden objects was the harder part of the game, which made it a lot fun.  Overall, this game is amazing and totally worth your time. You won't regret buying it.",
            "review_score": "1"
        },
        {
            "review_text": "Nice puzzler with different game difficulty settings. This game his nice graphics art, sweet music and lots of puzzles. The puzzles themselves are not that hard but figuring out where to go is a challenge at times :) Recommended for puzzlers!",
            "review_score": "1"
        },
        {
            "review_text": "Very boring hidden object game that i was forced to sit through to get 3 measly cards",
            "review_score": "-1"
        },
        {
            "review_text": "That. Was. My. Worst HoG experience. Why? Too many things... - Really bad story, cliché of all cliché. - Buggy music. It's actually charming, but after it is played, it stops and everything is mute for a long while. - No animations. - Bad design, poor visualization, nightmare-like hotspot (you can hardly click on some objects). - Useless map. - Useless time-travel: you can change time only in a few direct scenes. - Bad beginning: 'I'm XY and I'm a thief and my father is lost'... seriously? - Bad ending: that's just horrible, sudden and gives NOTHING... and then... 'Thank you for playing'. Well, you're welcome. Avoid this game. 1/10",
            "review_score": "-1"
        },
        {
            "review_text": "That. Was. My. Worst HoG experience. Why? Too many things... - Really bad story, cliché of all cliché. - Buggy music. It's actually charming, but after it is played, it stops and everything is mute for a long while. - No animations. - Bad design, poor visualization, nightmare-like hotspot (you can hardly click on some objects). - Useless map. - Useless time-travel: you can change time only in a few direct scenes. - Bad beginning: 'I'm XY and I'm a thief and my father is lost'... seriously? - Bad ending: that's just horrible, sudden and gives NOTHING... and then... 'Thank you for playing'. Well, you're welcome. Avoid this game. 1/10",
            "review_score": "-1"
        },
        {
            "review_text": "I'm kind of neutral on this game, but there's no option for that and I didn't think it deserved a 'no' recommendation, so I went with 'yes'. This is a relatively linear puzzle-solving / hidden object game. You explore areas looking for items you need to solve puzzles and progress through the story. It's basically point and click to perform actions and move through the world. Overall the game's not bad. The hint function is great if you're having trouble finding a hidden object or need a pointer on where to go next. At least some puzzles seem to have a 'skip' option, and I almost used one, but luckily solved the puzzle before I got frustrated enough to skip it. (This was where you have place tiles with pictures of objects next to their elements -- earth, wind, air, fire. The puzzle's help didn't say which way the tiles need to be placed; IIRC, it's clockwise.) I didn't see any scoring or major limitation on hint usage, beside having to wait a short time between hints, and I was never stuck for very long so the game never got frustrating, which is definitely good. It only took me about 4 hours to play through it, so it's not especially long either, another thing I tend to like.  Some of the parts I didn't like as much? The game seemed to involve a lot of backtracking through the same few locations in order to get everything you need. And that's not necessarily because you missed them the first time around. Sometimes progressing in the story causes old areas to have new items you have to go back to and pick up. This got a little annoying at times. There wasn't a whole lot to the story; enough to keep it going, but it wasn't exactly compelling to me. The ending scene upon completion of the game was rather short and didn't exactly feel satisfying after spending ~3 hours to reach it. There are at least a few typos in the text -- not enough to really affect anything, but enough to notice, and this is something that really shouldn't happen. Especially here where there are no voice-overs to listen to and you have to read all the notes, proofreading should have caught and corrected these before release.  So overall the game was fine. It was generally an enjoyable way to kill a few hours since I never got stuck long enough to really be frustrated (hints helped a lot here), but it aso had some issues that detracted a bit from the game. I'd say if you like this sort of game in general, wait for a sale or bundle deal before getting this. I think you'll be happier with this if you don't pay full retail value for it, even though that is only $5.",
            "review_score": "1"
        },
        {
            "review_text": "Usually when I play these types of game I lose track of time and get really caught up in it. This game I powered through it just to get it over with. The game functions and at its core does the hidden object thing alright but everything else turned me off. Grab this one on sale or in a bundle if you're really curious.  My main issue was the back tracking and the game's complete lack of direction. Usually in these games I try very hard to avoid the hint button but unfortunately it's vital in this game because most of the time you're left with no idea where to go next. Then there is a huge sense of frustration when a lot of the time you're sent back tracking to a past area to get something you could have gotten before.  In terms of story, it's rather bland and horrible. You play a character who is a thief, this fact doesn't even factor into the story at all. Basically you're going to save your dad and what little story there is will be told via pieces of a journal you find. No voice acting either so enjoy reading this blandness! The name of the game is Crystals of Time but this barely factors into the game itself. Only three areas use the time travel aspect and one doesn't even count because by then it's the end of the game. Oh, and the ending is bland as well. 'Thanks for the help!' is pretty much all you get.  I could honestly go on about how much I dislike this game but that wouldn't be fair. It's still a hidden object game and despite my issues with it I played and enjoyed that basic fact about it. The artwork was nice, aside from the character models and the hidden object scenes and puzzles were well done. I just had issues with everything else which is why, in my personally opinion, I can't recommend this title. There are too many better ones on Steam.   This review is exclusively written for  Y.A - Yolo Army , follow the group's curations  here !",
            "review_score": "-1"
        },
        {
            "review_text": "Actually ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "... a lot of fun!",
            "review_score": "1"
        },
        {
            "review_text": "im kind of mixed on this game, it was a decent length for the 5 dollars, but overall way too easy. and the ending was poorly done but i wouldnt want a refund, wish there was more replayability (however you spell it)",
            "review_score": "1"
        },
        {
            "review_text": "i did like this game. hard fun and hints if you get stuck but it was rather short and the ending was disapointing",
            "review_score": "1"
        },
        {
            "review_text": "The story is interesting. You play a girl who investigate the mysterious disappearance of her father. Their is a couple of things I didn't like about the game : It is not intuitive. The item are hidden anywhere, their is no logic. I needed to use the hint button a couple of times, since there are barely any clues to work on. You even end up, a couple of times, with nothing left in your inventory and no clue on what to do next, so you end up having to check every room in the game to find items but and guess your next step, that is, if you don't want to use the hint button. It was still fun, if you don't mind using the hint button, then I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a very simple example of Hidden Object game, no more than that, no less. Good choice if you have a spare hour or two and the game is on sale, otherwise you'll probably be dissapointed. The graphics are quite nice, music is also agreable, but the storyline is very simple and navigation in game has some weak points. There should be a recommendation option 'I don't care' for games like this.  Pluses are just like in every other HO, nothing remarkable to point out.  Minuses: - hidden object scenes use the same items several times and the quest items are not removed from HO the next time you get there, - few times you'll get frustrated becouse you have an object in the inventory that should be good for the task, but it just won't (ex. axe is just for roots, not for a tree) - there are no dialoges or animations, just written text - you'll probably get mad when seing 'I should find the missing item first' for the hundreth time, as there is just this one phrase for every situation - there are very few and very easy puzzles in the game  If you are prepared to deal with those flaws, go ahead and buy the game, but if you are looking for an HO on Artifex Mundi level, don't waste your money.",
            "review_score": "1"
        },
        {
            "review_text": "Simple hidden objects game. The storyline can be stilted at times, and use for the found objects is not always immediately apparent. Still, it was amusing and engrossing. I enjoyed it for what it was.",
            "review_score": "1"
        },
        {
            "review_text": "it was fine, enjoyed it but the repeat searches got a little boring towards the end",
            "review_score": "1"
        },
        {
            "review_text": "Clicks hard. Randomly clicks. Gets cards. Completes. Deletes. Don't waste your time on this game, the cards aren't even worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun, And the story is great.. It almost seem's like Ashley Ford should just hire some ppl to go find her father.. Just saying... :D ___________________________________________________  Good Things:  -Makes you think.. -keeps you wanting to know what happend to her father.. -Free Trading cards  _________________________________________________  Bad Things:  -No 1080p  -No Free Drinks for us that are ( 21+ )    ( ~ GTO880 ~ )",
            "review_score": "1"
        },
        {
            "review_text": "90% hidden object games, but at least most of the item descriptions are accurate. If you like hidden object games, it's okay for a sale price ~2.50  There's some story and adventure aspects to this too, but they're not very interesting. The game ends very abruptly as well.",
            "review_score": "1"
        },
        {
            "review_text": "Another game that I won't receive my refund...",
            "review_score": "1"
        },
        {
            "review_text": "This game is your basic point and click adventure. the game lacks any meaningful narrative that drives the story or tells you what you should be looking for. Put simply it doesn't give you clues as to what your supposed to do at a given time. If you do play it you will spend an extraordinary amount of time just looking for a puzzle to solve. I would have not spent as much time playing it if it werent for the hint button. I am generally pretty good at these games but this one lacks direction.   I suppose you cant expect too much from a game that is on sale for less than 1$.",
            "review_score": "-1"
        },
        {
            "review_text": "I would not reccomend this game to gamers like me. Perhaps ones more interested in point and click puzzles would like it more.",
            "review_score": "-1"
        },
        {
            "review_text": "  Decent hidden objects game. I've honestly played worse.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely LOVE hidden object games and this one is beautiful. The artwork and soundtrack are amazing but the gameplay itself is a little off, but not enough to leave a negativ recommendation. The drawback is how exact you have to be when clicking on the objects, a hair off and it won't work. The text boxes are a little distracting and don't seem to fit the rest of the beauty in this game. I would rate it 7/10 I WILL play again.",
            "review_score": "1"
        },
        {
            "review_text": "Grate soundtrack and good relaxing game.",
            "review_score": "1"
        },
        {
            "review_text": "I got this free with a bundle. I can see why.",
            "review_score": "-1"
        },
        {
            "review_text": "Old; this game seems to be atelast 5 years old (pre 2011).  One of the worst looking point and clicks I have played in a long while.  Gamplay is ok (but old school feeling)so im gonna press like/OK on this one.",
            "review_score": "1"
        },
        {
            "review_text": "  The art is good, but the puzzles are merely ok. The UI is horrible compared to newer games and occasionally buggy. The plot (if you're willing to read the bad font journal entries) is generic and poorly done. Woth it only because it was free, the same idea has been done beter in a dozen other games.",
            "review_score": "-1"
        }
    ]
}