{
    "app_id": 306670,
    "name": "Overlord: Fellowship of Evil",
    "release_date": "2015-10-19",
    "developer": [
        "Codemasters"
    ],
    "publisher": [
        "Codemasters"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Villain Protagonist"
    ],
    "achievements": 40,
    "positive_ratings": 116,
    "negative_ratings": 357,
    "price": 11.99,
    "description": "Overlord: Fellowship of Evil is an Action RPG filled with the series’ black humour and penned by award-winning scriptwriter Rhianna Pratchett. Players embark on an epic new quest in single-player or with up to three friends in co-op, assisted by the mighty, maniacal and occasionally moronic minions.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/306670/header.jpg?t=1447362234",
    "minimum_requirements": "Op. rendszer: 64 Bit Windows 7, 8 or 10 Processzor: Intel Core i3 Series or AMD FX Series Memória: 4 GB RAM Grafika: AMD HD4850 or Nvidia GTS250 Hálózat: Széles sávú internetkapcsolat Tárhely: 5 GB szabad hely Hangkártya: DirectX Compatible soundcard Egyéb megjegyzések: Additional Notes: Performance may be lower on some mobile hardware, this spec is based on desktop hardware.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Imagine everything that was fun about the original Overlord games. Puzzles, combat, crazy ♥♥♥♥, humor, watching your minions do tons of crap. This game has none of that.  Imagine everything that's fun about top-down real-time hack and slash RPGs, like Diablo and Torchlight. Varied character classes, build variety, metric buttloads of loot, tons of different enemies with different attacks and resistances. This game has none of that.  Imagine everything that's fun about button-mashing combat games, like Devil May Cry. Crazy build possibilities, insane combos, really varied enemies that have to be fought different ways. Guess what, this game has none of that.  Instead, it's a combination of the above three, with absolutely everything fun taken out.  There's 4 player classes, which are barely different at all. 2 melee, 2 ranged. Each one has a fixed progression and a token number of weapons that either give you more minion cubes, or have a chance of minor elemental damage. Basically cosmetic differences, other than the minion ones.  You get 3 attacks, a special attack, a chargeable heavy attack, and a light attack. And you're basically doing all the fighting, since your minions, especially reds and greens, basically do jack ♥♥♥♥. Even worse, despite the dumbed-down button mashing gameplay, there's absolutely no combo system at all. In fact, it has the opposite of a combo system. The special attack and heavy attack both ragdoll enemies, making them glitch out, bounce around, and twitch, and more importantly, making them immune to further attacks until they get back up. So you can either hold and release B about every 4 seconds (hurts your thumb less), or just mash A (kills most enemies faster). There's absolutely no point in using both attacks.  Speaking of ragdolls, the last time I saw ragdolls this glitchy was in Colonial Marines. Except Overlord: FoE is actually worse. Every single ragdoll twitches like it's having a seizure and glitches through terrain, every single time. The AI is worse, too. It's essentially the norm for minions to endlessly run away from you, teleport back, and run away again, trying to smash some scenery. The greens and reds are essentially completely useless. They almost never attack unless you specifically order them to attack an enemy. If you just press X to summon everyone, they go running in a straight line, nowhere near any enemies, then commit suicide without doing any damage.  The minions aren't even fun to watch or listen to anymore. The animation is utter crap, even in cut scenes. Each minion has about 5 lines, and that's it. 'I'm here! Sheepies! I like evil! Fight!' You now know everything the browns will ever say. There's no more looting or other interacting with buildings or terrain. All they do is smash stuff into generic looking rubble (while glitching and teleporting constantly, because their AI can't handle navigating anything, even a wide open square room), and grab stupid treasures that the 'treasure goblin' apparently delivers after every encounter.  And the enemies? Elf with sword, big elf with big sword, big elf with sword and shield. A couple bosses, and some flavor enemies that are basically identical to one of the elves (i.e., the big slugs are identical to the big elf with big sword, and the fluffies are identical to the regular elves except weaker). That's all there is. Even the bosses are completely lacking in personality or gameplay interest. They're just a variant on one of the standard enemies, with more HP and maybe a special attack or 2.  Overall, a huge letdown. This game really DOES deserve all the negative reviews. It's neither a worthy successor to the Overlord series, nor is it even a decent game in its own right. It's just plain simplistic, repetitive, boring, and not fun. At least it wasn't priced like an A-lister. $19 isn't bad, but it should be more like $5.",
            "review_score": "-1"
        },
        {
            "review_text": "This game.. is horrible. Remember everything you loved about the original Overlords? NONE OF THAT exists in this game. The hilarity? The wackyness? The hordes of minions looting gold and killing sheep? Nope. Everything you loved is gone from this game. Now imagine they tried to make it more like Diablo, but they they completely missed the mark on that game too.   SKIP this game. Do not buy it, do not play it.",
            "review_score": "-1"
        },
        {
            "review_text": "This is basically the soul-less husk of an Overlord game, with controls that are absolute garbage, unless you happen to be using a controller, in which case, they are mediocre at best. The difficulty is schizophrenic, with enemies in the tutorial being far harder than any I encountered up to act 3, where I gave up due to a boss fight with an inexplicable 5 phases, where if you get hit even once causes death.   The charm of the previous games is barely visible, with callbacks to the previous Overlords, except with barely any customisability, and an incredibly shallow upgrade system.   This game is also very short, with 4 whole acts, each consisting of 4 missions. Most are very short, around 10 minutes or less, with a couple randomly taking much, much longer, fighting 7 waves of the same enemies, the same enemies you have been fighting since the tutorial.  Avoid this game in its current state.",
            "review_score": "-1"
        },
        {
            "review_text": "I rarely review games, but this one earned it for a simple reason: the controls were ridiculously sluggish. I despise the kind of game where most of the challenge consists of starting shocked at the screen snarling 'what are you DOING?' at your character as they fire directly away from enemies or walk onto obviously avoidable spikes despite any input from keyboard or controller. I used both an xinput controller and the keyboard/mouse, neither made the game enjoyable. Gone is the satisfying 'minion sweep' function too - now they just turn up and do whatever they feel like, which generally involves running into the nearest hazard to their fiery (or fluffy) deaths.   I loved the Overlord series and this game looked fresh in the trailers, but it's pretty foul up close.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely abismal. This game was never meant to be a sequel to overlord, understandable as you don't play as the overlord himself. This game works better with friends, it makes it ten times easier. There are so many bugs, some are silly like minions running off of cliffs like lemmings, while others are game breaking like not being able to move your character at all halting the game and forcing you to quit. The minions are hardly usable, even their basic functions don't work within the game, AI pathing taking them on a suicidal run. The controls for the characters are disappointing and quite clunky/useless *cough* Inferna *cough*. Some of the original humour is here but does fall flat compared to the previous games. It is a quaint addition to the series but desperately needs work to make it completely playable, having to quit every couple of hours due to a game breaking bug isn't exactly a working game codemasters *cough* better testing *cough*. However it is a nice little time waster, so long as it doesn't get played for more than a few missions at a time so all hell can't be let loose in the form of bugs and not your abilities. Stay clear of this game until some fixes have come out before buying if bugs and the like annoy you.",
            "review_score": "-1"
        },
        {
            "review_text": "This not the overlord you are looking for.  I adore the Overlord series, I really do. Some of the funniest games ever. Obtuse controls especially the first, but so charming and funny you'll barrel through it.  This one however... this one is something else.  The gameplay emulates a arpg... and a very very bad one at that. Mechanics are uninspired and weak. But it's not even mechanicaly competent. It's buggy also. Like with amateur level bugs.  The good writting is still there, but it's... less, like the writers realized what the game was and wrote it like the lesser of the 3 games.  This not the overlord I was looking for either. One can hope codemasters actually tries for an actual overlord 3.  Really disapointing.",
            "review_score": "-1"
        },
        {
            "review_text": "Very bad console port :/  Hard to control, cant remap buttons UI is half broken if you are using keyboard and mouse. Strange camera pan and no option to disable it.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Instead of this buy Overlord 1 and 2 for a cheap price. They are way more fun to play.",
            "review_score": "-1"
        },
        {
            "review_text": "If you played the overlord 1 &amp; 2 I'mg quessing you had a blast... with this game you wont... yeh there is some fun stuff on the mission blabber... but this game totaly sucks on the game play and on the whole game series. DONT BUY IT!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Took advantage of brand loyalty to deliver a steaming pile of poo poo.",
            "review_score": "-1"
        },
        {
            "review_text": "Again another company makes promises they don't keep. Bought this game for multiplayer so let down.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is really buggy still. Like the characters ragdoll horribly. They just go flying across the screen for no reason. Several times the game bugged and I could no longer cause damage to an enemy and it took ten minutes before the game fixed itself and let him die, standing up and T posing still.  I really wanted to like this game because I enjoyed the other Overlord games but with the way this game is currently, I really can't recommend this for anyone until these bugs are fixed,",
            "review_score": "-1"
        },
        {
            "review_text": "They ruined it.  After Dungeon Keeper this was the closest thing to a continuation I could find. It had a dungeon heart, minions and a 'leader'. It was glorious.  I bought this, luckily with a discount, hoping they'd rehashed the old games.  They had not.  They have managed to completely ruin the series. If you feel like tanking around repetitive areas in a diabloesque fashion, unable to target enemies and just button mashing.. well... this is the game for you.  I am sorely disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "You DO NOT control your minions, If you want to spend $20 for a hack and slash that's only purpose is to remind you how much better the first two games were be my guest.",
            "review_score": "-1"
        },
        {
            "review_text": "The game came out so-so. I do not recommend playing !!!",
            "review_score": "-1"
        },
        {
            "review_text": "As a fan of the Overlord series up until this point, I have only one reaction: :(",
            "review_score": "-1"
        },
        {
            "review_text": "I tried getting into the game but it just doesn't feel like the previous overlord. The controls are weird the minions are limited literally, they're limitting how many minions are on the battle field and never really explain how or why it happens. I spent 55 minutes in the game got the forge mission as I started on multiplayer where you had to collect the dragon eggs and I just had enough of the camera issues on the multiplayer. So I started on single player or 'Local'. Again got the same mission as the game didn't save(?) my progress. And then after getting to said second egg where the troll steals it whilst you kill elves I got stuck and could not move. So with that I stopped playing. I might go to it in the future but for now I prefer Overlord 1 + 2.   I was really hoping this would be better than what it is.",
            "review_score": "-1"
        },
        {
            "review_text": "Start game. Loading screen with 'Unity Engine' logo. ALT + F4. back to play side quests in Witcher 3. Refund requested in less than 10 mins gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing like the other games. As a fan of the series I willingly pre-ordered this game in hopes of another great title for this franchise. I was however disappointed in the release of this game and within the first 50 minutes I asked for a refund. I'm sad to say but I do not reccomend this game for a purchase.",
            "review_score": "-1"
        },
        {
            "review_text": "The duck is this?! Nothing like the Overlord franchise! And where did Triumph Entertainment go huh? They knew their shizzle. If you've loved The Elder Scrolls this is like the disappointment of The Elder Scrolls Online. It's not TES6 nor a DLC for TES5, like this isn't Overlord 3 nor a DLC for Overlord 2.",
            "review_score": "-1"
        },
        {
            "review_text": "The low minion count when starting out makes it almost impossible to defeat the first actual boss without making several trips to the throne room for upgrades, the 'prologue' took me 2.5 hours to get through, the tutorial was shoddy as the 'shining' would normally kill you before you had enough time to kill whatever was stopping the final gate from opening.  The main theme of the previous overlord games such as controlling your minions and grouping them is now gone, you've got either spamming all of your 8 minions at the enemy, or using the 'move' command.  It's definitely a bargain on sale, would reccomend to fellow diablo players that are looking for a change of pace. ",
            "review_score": "1"
        },
        {
            "review_text": "Having finished the prologue and gotten used to the gameplay, I'm going to have to give this game 3/5.  ADDED: This game really, REALLY feels like an Overlord MOBA. And unfortunately for CodeMasters, I don't like MOBAs very much.  Honestly, it's not a bad game. There's really nothing wrong with the gameplay as far as it goes, but it is a *MAJOR* shift from previous Overlord games.  For starters, it's in a mostly isometric view, similar to Diablo. Which would be fine, but *you can no longer control your minions directly*.  Meaning no rally flags, no 'attack this guy', no 'sit here and ambush', nothing. They've also massively lowered your minion cap, and now they've also capped how much Life Force you can hold of each minion type! You start at 2 per color. Yes, 2.  Further, the Life energy management of previous games is barely a thing now, because you find fountains that spout Life Energy cubes (yes, they're cubes now) when you hit them,  The Overlord you start as is the fire one, Inferna. Yes, a female overlord. It makes no difference to the gameplay except for her voice, but they decided that the fire warrior would be female.  And that brings me to something that grates on my nerves. I'm hoping that there isn't any more of it, but there have been a few feminist moments in this game thus far. Gnarl now has a female counterpart named Ricket (which makes no sense, given that minions don't breed, so they shouldn't have sexes). And Gnarl has a like where he says 'Sorry, Ricket, I was totally Minionsplaining there, this is your show!'  Seriously, guys? Overlord is SUPPOSED to be an anti-PC game. We kill baby seals, destroy orphanages, burn homes and people and eat children for breakfast. That's the sort of OOC behavior that irritates me, because it's completely wrong for Gnarl to be *apologizing* to anyone but the Overlord.   So, massive gameplay changes from previous iterations, and subversion of the basic anti-PC theme of Overlord. The dark humor is mostly still there, but I just don't really feel like *THE OVERLORD* the way I did in previous games. Hopefully it gets better.",
            "review_score": "1"
        },
        {
            "review_text": "very fun if u like humor and dont mind some weird stuff on occation",
            "review_score": "1"
        },
        {
            "review_text": "First, this is not Overlord 3 or a Diablo-like game. This is a hack 'n slash, multiplayer game. The tech tree and item loot are minimal at best, but on par with a Gauntlet style game. If you like Gauntlet style games, I recommend waiting for a sale on Overlord: FOE. Both Forced and Gauntlet offer better 4-player co-op for the price point.  I'd say this game most closely resembles Gauntlet: Dark Legacy. This game has the same humor as the previous Overlord games, BUT the minions take a big step back in regards to their utility. If your absolute favorite feature of Overlord was being a Minion Master, then you will not like the minions here.   However, if your favorite part of the Overlord series was killing people/animals/elves/etc. with your Overlord and being followed by a parade of tiny, evil cheerleaders, then you should enjoy this. Think of the minions as the pet familiars from Gauntlet: Dark Legacy. They are somewhat useful, but don't bring a contribute very well to the game.   About the minions: Minion spawners are more frequent than the single-player Overlord titles, to compensate for how expendable they are in Fellowship of Evil. Browns are the only minions I keep out around me, as they stay near you and attack like the previous Brown minions (deal and take damage for you). Blues can only heal you, they do not deal any damage. Greens are better melee damage-dealers against foes, but disappear from your Minion control after they have slain their target. Reds have been completely changed. They are no longer ranged fireball-casters; instead, they are suicidal bombers that run in a straight line towards whatever you were facing and self-destruct on impact.  The game took me roughly 7 hours to beat, in a 2-player co-op session. I doubt the number of players would change this completion time.  Your Overlord has 4 attacks to play with: light attack (fast dps), heavy attack (slow strike with knockback), a charged heavy attack, and a special attack (strongest attack but tires your character for a few seconds and has a cooldown).   The focus is on your character, one of four Netherghuls, whom is trying to reinvigorate evil and the minion horde. Each Netherghul plays vastly different from each other in how their attacks work, but all feel very balanced and neither is OP in comparison to the others.   Final review (TL;DR) : This is a great couch co-op game to play with controllers (I use Xbox 360). If you only played the Overlord games to be an evil Pikmin Minion Master, then this is not a game for you. If you like multiplayer, hack 'n slash games in the style of Gauntlet, then you will enjoy this spin-off of the Overlord franchise.  Overall, $20 isn't a bad price, but I would recommend waiting until it is closer to $12 - $15. Fun game, but Forced and Gauntlet offer a lot more value at the moment compared to Overlord: FOE.",
            "review_score": "1"
        },
        {
            "review_text": "Despite all the negative reviews I think it is a blast. A patch and maybe some added dlc or expansion away from being great.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what all the fuss is about, this is a great game even if it's not overlord III. overall rating is 9/10",
            "review_score": "1"
        },
        {
            "review_text": "always been a fan of this series, now we get classes &amp; co op!",
            "review_score": "1"
        }
    ]
}