{
    "app_id": 306760,
    "name": "Obduction",
    "release_date": "2016-08-24",
    "developer": [
        "Cyan Inc."
    ],
    "publisher": [
        "Cyan Inc."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Puzzle",
        "Exploration"
    ],
    "achievements": 15,
    "positive_ratings": 1807,
    "negative_ratings": 449,
    "price": 23.99,
    "description": "A new sci-fi adventure from Cyan, the creators of Myst. Abducted far across the universe, you find yourself on a broken alien landscape with odd pieces of Earth. Explore, uncover, solve, and find a way to make it home.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/306760/header.jpg?t=1521094354",
    "minimum_requirements": "Mínimo: Requiere un procesador y un sistema operativo de 64 bits SO: Windows 7 SP1 64 bit or newer Procesador: CPU Intel i5-2500 equivalent or better Memoria: 8 GB de RAM Gráficos: GeForce 660 GTX w/1GB / AMD 7700 series w/1GB equivalent or better Almacenamiento: 20 GB de espacio disponible Notas adicionales: For VR: NVIDIA 970 or AMD 480 (equivalent or greater)",
    "recommended_requirements": "Recomendado: Requiere un procesador y un sistema operativo de 64 bits SO: Windows 10 64 bit Procesador: CPU Intel i5-4590 equivalent or better Memoria: 16 GB de RAM Gráficos: NVIDIA GTX 970 w/4 GB / AMD R9 290 w/4 GB equivalent or better Almacenamiento: 20 GB de espacio disponible Notas adicionales: For VR: NVIDIA 980/1060 or AMD Fury (equivalent or greater)",
    "reviews": [
        {
            "review_text": "Overall I was impressed. It took me 11 hours to finish the game without guides. Your mileage may vary. This game makes for a very good spiritual successor to the Myst games that ultimately builds on the original formula. WARNING, this game will not turn you into an Adventure/Puzzle convert if you already hate the genre. This is a slow burn game, in the vein of Siberia, The Longest Journey, and The Secret of Monkey Island. Be prepared to read journals and take your own paper notes. So onto the pros and cons-  PROS -Story; its original and sucks you in -Puzzle mechanics; they were original and varied, often requiring a bit of lateral thinking -World; the world itself builds a great foundation to make it believable without overly painful info dumps -Sound; My god this game has good sound design. PLAY THIS WITH HEADPHONES!  MIXED -Graphics; this is not a negative by any mean. At times this game blew me away with its awesome vistas and alien scenery. However, there were times I noticed painfully pixelated textures or items with just a few too little polygons.  -No hand holding; This game does not hold your hand. I personally find this refreshing but I realize this may not be the case for everyone. Be prepared to use the in-game camera as well as taking notes for the puzzles. -Music; while the sound design blew me away, I found the music rather forgettable sadly enough. Your tastes may vary. -Gauntlet puzzle; You'll know it when you get to it. Its doable but a bit tedious, especially if you are suffering from long load times.  CONS -Load times; Annoying load times in annoying places. I played this game on a solid state drive with a fairly beefy computer and still suffered the load times (some as long as 20 seconds). -Glitches; I have heard some people running into glitches forcing them to reload a save. I had one audio glitch during my playthrough which was corrected after a reload.  I did not Kickstart this game nor receive it for free. I am a fan of puzzle games though. :)",
            "review_score": "1"
        },
        {
            "review_text": "I helped Kickstart this game, and I can hardly believe it turned out this good. If you liked Myst, then please, buy this game and support the creators. It's like a time capsule from before games spelled everything out for you then said 'shoot everything to win'.",
            "review_score": "1"
        },
        {
            "review_text": "8/10  The game varries from pretty damn amazing to slightly amateur at times in all aspects:   Graphics are almost consistently awesome - with a few small graphical imperfections, most notably, the clipping between terrain assets and the ground.   performance on a 1070 was okay - but some moments were terrible. I ran it most of the times at 70-90 fps 1440p on highest settings, but occasionally, I found spots which stuttered and sunk the frames surprisingly low - one point at the very end of the game, I caught it drop to 20 fps. This was due to my view distance setting.  The use of SFM, for the most part works, but there are moments (again at the very end) which breaks the immersion, and seem a bit cheap (a particular explosion at the end of the game looked extremely bad and hurt immersion)  Gameplay was exactly what I wanted. A complex world puzzler with plenty of logic and context puzzles - this was my first Cyan game - it certainly felt like its own signature mix of gameplay elements.  Puzzle difficulty ranged from generally easy to stupidly hard and nonsensical at times. Some puzzles definitely felt fine-tuned and well thought out, others gave me no context and had me wandering the world in search for something that could've been easily missed in the first place.   A few logic puzzles were extremely complex, particularly one reoccuring math puzzle, which I thought was awesome and investing.  some puzzles had you wandering back and forth which got tedious rather quickly, and lasted a very long time, these were drawl stand-out moments which overstayed their welcome, one being a frustrating maze puzzle.  Story was presented in a way that worked well - through text and sfm messages - I felt the ending lacked the depth I wanted it to though, with it finishing a little bit too abrubtly. There were key story moments in the game that really worked on the other hand, and felt awesome.  The general concept for this game world was cool - I simply wish they went further with it, and expanded some of the ideas out further (the ending again comes to mind).   I recommend this game if you like difficult puzzlers and adventure games - it was worth $30 for me. The story was good and very unique, but execution leaves a bit to be desired - core gameplay is interesting and fun.   ",
            "review_score": "1"
        },
        {
            "review_text": "There are almost no words to explain how great this game is.   I have been a fan of the Myst series, having completed every game in the series, and also URU, with the exception of Revelations, which was simply too tedious.  The best way I can describe Obduction is to say it is a combination of Myst, Riven, and Exile, all rolled into one. It resembles Riven, most of all, only as if Riven managed to take crack cocaine, and, of course, with far superior graphics.  The other thing which makes Obduction so unbelievably good is that, while the puzzles are not simple by any means, they are absolutely not impossible, and quite often it is a matter of order of operations.   My wife and I, (who actually legally married in URU in front of nearly 100 people--an advantage of living in the great state of Colorado is that you can marry yourselves!)--have been playing the game every night since I purchased it, somewhere in the neighborhood of a week or so ago, and not one single night has passed where breakthroughs have not been made.   Where this game, imo, most resembles Riven from the Myst series is that everything seems very interconnected. In Myst, one would solve a puzzle in an age, then get the necessary pages (blue and red) to eventually solve a puzzle, but there was little connecting the worlds besides information. In Riven, everything was in some way connected to another problem on another island.  There are no islands in this game, but there are a number of strange alternate worlds or times. I am not yet clear on this yet, but it certainly is important that finding ways to connect these is going to be important as the game progresses.   I have designed (way, way, way back when using BASIC language), and played, adventure games for as long as I can remember, and certainly Myst was a breakthrough in that market. Riven upped the ante and is certainly considered one of the greatest, and quite difficult, adventure games of all time. Obduction out does them both, as far as I can tell so far, and is graphically beautiful on top of that.   I do not write many reviews, but this was a kickstarted campaign which raised nearly $1.5 Million. It is my hope, that if this game is a success, Cyan will continue with further adventure games, so I encourage anyone who is a fan of the genre to purchase Obduction. It is insanely good.  15/10",
            "review_score": "1"
        },
        {
            "review_text": "I'm liking this adventure. I'm only a few hours in so far, but it's everything I've come to expect of Cyan and their 'Myst-style'.    -Puzzles are acceptably difficult and intuitive enough to figure out with enough time. -Visuals are great (reminiscent of Riven) and the music is wonderful. -Load times can be long, but I am also playing on an Intel Core2Quad 2.66GHz. For being so far under the mins, the game is playable will only a little chunking.  Thank you, Cyan, for going back to your roots and giving us yet another world to become our own.",
            "review_score": "1"
        },
        {
            "review_text": "I played the Myst series with my papa, and this really grabs the same myst-erious vibe. Enjoying this game very much.",
            "review_score": "1"
        },
        {
            "review_text": "From what i've played so far in my first 6 hours, this is exactly what you want from a successor to Myst. Such a pretty, smart game with challenging puzzles and plenty to explore.  Game completion edit: The game has it's faults with game-time mostly comprised of walking versus activities and the difficulty of puzzles doesn't change too much from start to finish but does up the amount of tedious repetitive activities.  However, I still thoroughly enjoyed it. Walking was less of a chore with the scenery and it was a good game overall. I found myself enjoying the original story and the more difficult puzzles. I would definitely recommend it for the Myst/Riven fans.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really really good.  Graphics are demanding, but absolutely stunning, this is probably the prettiest game I've ever seen. Both in art style as well as graphical fidelity itself.  But most importantly the puzzles are awesome. It's a real joy to actually find the puzzles around you, solving more as the game progresses, unlocking shortcuts and getting surprises all along the way. I don't want to spoil too much in this review, but there's a lot to explore.  Absolutely one of my favorite games of the year so far. If you like puzzle games, go get this game now!",
            "review_score": "1"
        },
        {
            "review_text": "when the mimimum specs for this game was announced I was gutted as my rig is slightly below the minimum specs- in most things actually - but I do have a ssd. I very nearly decided not to purchase this game but am I glad I did!!! I play it on its highest graphics settings and for me anyway it runs fine - not brilliant but certainly acceptable. Now thats out of the way this game is awesome ! cyan never disappoint so I KNEW this would be a fab game in all aspects. I've only just begun this game so carn't say much more but if you are a fan of myst like games then get this -its a must. I carn't wait to play the game later when it gets dark. After playing for a while I can highly recommend it even more now. It reminds me of uru in many ways -even down to the sounds- but better.  UPDATE: after putting in about 23 hours of gameplay I can see now more clearly that this game is a true masterpiece. I got stuck a few times but in order to solve them you have to learn more about the story (which is unusual in games) and NOT just knowing what notes go with which puzzle (which most games of this genre tend to rely on.) you will understand what I mean when you play it. There isnt much music in the game but I like that as continous ALL the time monotonous music gets meaningless after a while not to mention irritating. The music that there is comes as you have made an important breakthrough. Again I like that. Alot complain of low frame rates and slow loading times YOU NEED A SSD . Luckily I bought one not so long ago. I have a well below spec graphics card a gtx550 ti 1gb yet even on medium settings I can get on average 40 fps although it CAN go up to 50 but also as low as 20. This is NOT an action game so isnt much of a problem. To me its every bit as good as all the other myst games but as someone mentioned because we have become aclimitised to adventure games we know how to play them but we didnt when myst first came out because of that maybe some of the 'puzzles' may be too easy. However there were others that weren't. I carnt understand the negative reviews AT ALL that some poeple make about this game (not including tech difficulties) but they probably criticise everthing anyway. Some complain of too much walking but There would be ALOT less running around if you clearly thought it out where you are going and where you NEED to be next to make further progress. Keep a mental map of where everything is (there ARE maps around but werent really needed) fully absorb yourself and pretend you are actually there. Its what I do and Im thoughroughly (whoops! excuse the spelling!) enjoying this game EVRY bit as much as the masterpiece's of myst, riven, myst exile, myst revelation, myst end of ages and uru complete chronicles. ITS ENDING FINALE : comes too sudden I was wishing for more but left me thinking: will there be a sequel? some story holes but maybe they are deliberetely there for you to ponder over? I dont know.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy Dream-like adventures then this is worth much more than other games that cost nearly twice as much",
            "review_score": "1"
        },
        {
            "review_text": "Played through on monitor and tried it a bit with Oculus Rift.  This game is what fans of Myst have all been waiting for.  Pros: +Awesome graphics and detail. +Great environments. +Interesting and well-made story with just enough clues to keep me searching for more. +Most puzzles aren't too simplified or obvious (i.e. dumbed-down)...but still caters to those of a slightly more simpleton nature. +Retains elements of the original Myst.  Cons: -Last (purple planet?) area looks unfinished, like devs ran out of time but still included it. -This game isn't super fast and does involve patience, which some may not adapt to well. -Ending/s doesn't feel too rewarding or provides enough feeling of closure to the story for some reason... -Once the game finishes, coming back to reality is a drag.  Basically, I highly recommend this game if you like puzzles and exploration, or played the original game responsible for Obduction, of course. Also, you'll likely appreciate this game if you play The Sims, or a Rollercoaster Sim, or some other not-so-violent game (unless your theme park is full of rabid zombie-walruses).  Definitely worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "A really hard puzzle game with beautiful atmospheric landscapes. If you love Riven or Myst, then you'll love Obduction!",
            "review_score": "1"
        },
        {
            "review_text": "A must-have game for Myst fans. You can switch between free roam and point-and-click mode at anytime! Puzzles are similar as in Myst, maybe not as difficult. There were one or two very frustating puzzles, though.   The world is very interesting! Reading notes and journal is recommended, in the end you'll know how everything works.  Graphics look really good, and the game didn't crash once during three sessions totaling 13+hrs. Sometimes you got stuck, but that was easily fixed just by turning free roam off and on. The picture folder was buggy, but then again, I decided to play the game with pen and paper since taking pictures is just additional functionality.  9/10   Would bomb Mofang again.  ",
            "review_score": "1"
        },
        {
            "review_text": "Excellent sequel to MYST and Riven. Please make more! 11/10",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed any of the Myst games, you absolutely have to play this game. That's all you need to know.",
            "review_score": "1"
        },
        {
            "review_text": "I beat Obduction today with about 15 hours of playtime and I'm very satisfied. The visuals are gorgeous, the environments varied and interesting, the puzzles challenging but not so difficult that you completely run out of ideas for where to go or what to check next.  There's also a really satisfying progression of the puzzle system, where you start by manipulating small, recognizable objects like buttons and levers, but where the scale of manipulation expands until you're interacting with the world in a much bigger and more consequential way.  The puzzles are toned down a little bit in difficulty from Myst and Riven, but there are also opportunities for the player to make what they want of the game. Sure, you don't  have to  figure out the notation for that base-4 number system, but if you do, it saves you the time it takes to walk back to the translator, and you get some satisfaction from being able to come up with the right answers yourself.  But despite being more accessible than Cyan's most difficult games, I'm really impressed at just how creative and engaging the game mechanics are. It's hard to describe without spoiling anything, but you really get to change the environment around you in a way that makes you think differently than games usually require. In that sense --- asking players to develop a new faculty that they haven't previously used in gaming --- it's reminiscent of Portal.  Altogether a great game and one I wholeheartedly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "The Myst games were the titles that introduced me to PC gaming. Fast forward to today, Obduction is finally here and I couldn't be more excited. As a Kickstarter backer of this game, I must say, this is everything I thought it would be and so much more. I'm still pretty early on, having only solved a few puzzles but can already tell you, this is a must have. The worlds that Cyan has created are breathtaking. It's nice to see a game come out exactly as promised with such a high level of polish. All of this from an indie game developer. Just goes to show, when you have a talented team, a great idea and an unrelenting attention to detail, a masterpiece can be born. Bravo Cyan, bravo.",
            "review_score": "1"
        },
        {
            "review_text": "This was an excellent spiritual successor to Myst and Riven. Rich world design is a gold-standard of Cyan and tells its own story. The environmentally derived puzzles also capture a sense of purposefullness hard to manufacture in a game.  The Good : Original ideas and fantastic visuals. The environment really encourages players to use their imagination to not only understand the puzzles but also the story and motives behind them. There are no puzzles that exist for their own sake.  The Bad : The art direction could have been a little more polished in places; some color palettes were a bit cartoony and over-saturated, and some of the effects such as 'linking' and live-action scenes fell flat. The story was a great sketch, but lacked tension in the climax. A broader cast of characters and deeper storytelling would be a welcome addition to future titles.  Hardware: No complaints on 'epic' settings. The worst issue I had was the occassional drop in frame rate, and a lag between loading areas. I'd occassionally dial down texture and anti-aliasing to bring up the frame rate. I run a GTX870M on an i7.",
            "review_score": "1"
        },
        {
            "review_text": "An incredible experience so far. I'm a few hours in, I've barely scratched the surface of it, and I'm already amazed.  Firstly, the world is gorgeous, and simply exploring it is already very satisfying. The soundtrack is very ambient and only chimes in on certain key moments and locations, which only helps improve the very immersive atmosphere of the game. The world is presented in a way that makes you feel 100% immersed and in control, as the story is not forced into you, in fact you have to actively seek out the story and try to piece out how the world works by yourself, on your own pace, which feels great.  About the puzzles, the ones I've encountered so far seem really well designed. The world and the puzzles connect in a very natural way, so nothing feels really out of place, and the kind of thinking you need to do to solve them also comes very naturally (at least so far), even if the puzzles themselves aren't easy. It feels just right, and with each puzzle I solve, with each question answered, three new ones appear, in a way that there's always something else to entice your curiosity.  Honestly, it's everything I expected from it, and much more. I'm really glad I bought this game, and if you enjoyed the Myst series, you'll definitely enjoy this game as well. It really captures the best of the Myst 'feeling', with a new setting, which is quite refreshing.   A few caveats, though. By the time of release, a few features were a bit buggy, and I've experience some crashes too. Some were quite annoying, but nothing gamebreaking. Hopefully those bugs will be fixed before long.",
            "review_score": "1"
        },
        {
            "review_text": "Just what you expect from a Myst, Riven, Uru style of game. Try to stay away from spoilers. If you're stuck, just come back the following day and look around some more :) ",
            "review_score": "1"
        },
        {
            "review_text": "My faces thoughout the game: :D :| @_@ D: D8 :DD!  If I could wipe my memory and do all the puzzles again I would! This was an amazing trip from start to finish and by the end of the game I was at the edge of my chair and paranoia was my best friend, just like the old Myst games we loved. ♥",
            "review_score": "1"
        },
        {
            "review_text": "Cyan doing what cyan does best.",
            "review_score": "1"
        },
        {
            "review_text": "It made me feel like I was inside a living, breathing worlds, and it made me feel stupid, then very smart, then stupid again several times in a row, so 100% what I wanted from a Cyan game.",
            "review_score": "1"
        },
        {
            "review_text": "A masterpiece that brought back the feeling I had when first playing Myst and Riven.  Don't stop Cyan. I need more of this.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed this way more than Witness or even Firewatch, which is saying something, as both are excellent games in their own right. Having been a huge fan of Myst, Riven and even Exile, I approached this with some trepidation (never got into Uru), but after a shaky start that old tingly feeling has returned.   Still have some way to go, and frankly I don't want this to end. For me, The Witcher 3 remains a criminally neglected title in my rotund library of unplayed games, as Obduction is providing way more enjoyment, and less of a spreadsheet-simulator vibe. Hopefully Cyan Worlds, the developers, do well enough from this title to make more games, as I'll support them if this is the new standard.  Outstanding!",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed Myst, you're going to love Obduction. This game is fantastic! Thank you Cyan for being amazing!",
            "review_score": "1"
        },
        {
            "review_text": "I really like it. Its Myst, like how it was in the original.",
            "review_score": "1"
        },
        {
            "review_text": "I played all the original Myst games when they came out and absolutely loved them. I'm 45 minutes into Obduction and it's exactly what I was hoping it would be. I fear I may lose some sleep tonight... ;)",
            "review_score": "1"
        },
        {
            "review_text": "I have been waiting for this game for the longest and when I anticipate a game (or anything for that matter) that much, my expectations are usualy not met. I am happy to say that this game has met all my expectations. Beautiful graphics, story and mystery...a great successor to Myst. I limited the amount of images and 'spoilers' before the game was released and was wowed constantly. Puzzles are not Rivenish where most would say 'F this!' and stop playing. A bit of backtracking but the always run (caps lock) feature makes it negligible. If you were a fan of Myst and puzzle/exploration games in general, get this game, you will not be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "A true spiritual successor to the myst franchise, this is the exploration puzzle game I have been waiting for since Myst 5 and URU.  To the uninitiated, this is a non-combat game which revolves around solving mechanical puzzles with logic and exploration.  I highly recommend this game to those who enjoy investigation, story and discovery.  Warning: Currently suffering from a few game breaking bugs, you may want to hold of buying this for a few months. ",
            "review_score": "1"
        },
        {
            "review_text": "Obduction is a sci-fi exploration puzzle game from Cyan, the creators of the original Myst and its sequel Riven, that has been succesfully funded through a Kickstarter campaign. It plays very similar to their previous works (you even have a discrete movement mode, though it seems like it was included to better support VR, which it does), but rather than figuring out intricate mechanisms (albeit it has those too) and solving obnoxious riddles (having pen and paper in close proximity wouldn't harm, though) the main challenge relies on your spatial awareness and attention to details. The game is really beautiful with lovingly hand-crafted world based on Unreal Engine 4, amazing soundtrack and sound design. I have an upper-mid class laptop (Core i7-6700HQ 3.5GHz, 16 Gb RAM, Geforce 965m) and was able to play on 'high' settings (next to the highest which is called 'epic') with little to no discomfort (60 FPS with vsync most of the time, sometimes dipping into 40-ish territory, which is alright for this type of game), but I would highly recommend putting the game on SSD as the developers recommend, that will save you a lot of loading time.  At the end I'm far from being disappointed. I've managed to beat the game in about 10 hours, I found the puzzles to be more on the easier side of the spectrum, but it may be because I'm used to this type of games. Most of anything I enjoyed the atmosphere and the plot, it's just my kind of thing - you may expect strange and mesmerising alien worlds, mysterious alien races and an overall story that is presented more by hinting at it so you gotta fill in the blanks, which is made really well. The game is well worth $30 for the unique experience it provides, I'd definitely recommend it to anyone who's interested in adventure games.  And long live Cyan! Now that you came back, we'd like more of these, please.  P.S.: the game currently has some bugs and stuttering issues, although I've been able to complete it without them spoiling the fun.",
            "review_score": "1"
        },
        {
            "review_text": "Next to The Witness, it's the best 2016 first person puzzle game. But do yourself a favor and install on an SSD. Some puzzles have a lot of loading screens!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, puzzling, great story and I have several hours in the game already. {GOG version, I'm downloading the Steam version now. No difference in the game, I just got both}.  Highly recommend! 10/10 Three thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, puzzling, great story and I have several hours in the game already. {GOG version, I'm downloading the Steam version now. No difference in the game, I just got both}.  Highly recommend! 10/10 Three thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Really draws from the feeling of playing Myst while managing to have its own unique atmosphere and story. A must play for any fan of classic point-and-click games, or any fan of puzzle games in general.",
            "review_score": "1"
        },
        {
            "review_text": "I've played all the Cyan games, and this new iteration does not disappoint. The experience was great, the visuals are stunning, and the story is engaging. If there is one thing to complain about, it's that there are 1 or 2 puzzles that are a bit tedious getting everything moved around once you figure out what the goal is. Other than that, I absolutely loved it!",
            "review_score": "1"
        },
        {
            "review_text": "Obduction does not disappoint. With challenging puzzles, adequately rewarding ah-ha moments, and a compelling plot with plenty of small details scattered throughout the various Worlds, the spiritual successor to MYST holds true to its title. With the challenge level of MYST but the interconnectedness of Riven, Obduction blends elements of the previous Cyan games in a way that appeases long-term fans, but is welcoming to those who are new to the scene. Overall, Obduction is an amazing puzzle-exploration game with many secrets and hidden lore to stimulate the mind.",
            "review_score": "1"
        },
        {
            "review_text": "Weren't kidding when they recommend an SSD, that pretty much resolved the stuttering and hitching in the level streaming. Wonderful game otherwise.",
            "review_score": "1"
        },
        {
            "review_text": "I have played this to completion. Beautifully done and *definitely* worth it, but I was disappointed that the number of actual thinking puzzles (rather than unlocking doors and such) was not higher, and that they were not particularly challenging. Some are pretty neat, though. There is a lot of running around feeling frustrated and wondering what you can twiddle or where you can explore next, or how you are ever going to get to a particular spot. Some people hate that, but it made the Aha! moments so much the better. It's not easy peasy, but not rocket science: if you are using walk throughs and such, you are giving up far too easily, and just wasting your money.   There was one device whose function I did not understand at all, and the photo gallery is buggy. One of the key operations can take a very long time to complete, depending on your hardware.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, looks great. If you liked the Myst games, you would probely also like Obduction. Unfortunately the game is a bit short and the puzzels were to easy. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "I have played through the entire game and must say it was worth every single minute and cent. While many recent puzzle games simply build on a single mechanic or wrap everything in a story taking up a larger part of the game than the puzzles themselves, Obduction proves to be a refreshing return to the genre's roots - and that is a good thing. The player is progressively being introduced to various rules and conecpts of the game's universe, thus creating a flow-like experience when solving the puzzles as you're building-up your knowledge of the game's mechanics. Obduction's puzzles boast great design and personality. Most of the time you can figure out the next step to take with a little bit of thinking and interpreting the game's designer's clues, so you're not chasing any red herrings or dead ends. For me that is one of the most important characteristics of good game design in this type of games. Obduction's creators clearly show their exceptional talent and experience here. I only got stuck (30 minute-ish) two times where I missed a lever or button, this can always happen (especially when you've been playing for 8 hours straight at that point). However, I never looked anything up on the web. Always ask youself what you can interact with at a given moment and you should be able to progress in a rewarding pace. Difficulty ramps up in a fairly linear way and gaining deeper knowledge about some puzzles is rewarded later on, so you can't simply 'cheese' your way through the game. If you have played some of the studio's earlier games, the plot might seem familiar and as you progress though Obduction, you discover more and more details about the underlying story. If you read every note, you get a pretty clear picture of what is going on. Also, there are quite a lot of easter eggs hidden all around the game which are fun to discover.  Obduction is my game of the year 2016 so far - Cyan proved that they still know how to design a great game and that experience shows.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. Liked the graphics, they have a unique feel and the special effects are very well made. Very easy on the eyes. Runs on 'epic' with minimal stuttering only when the game initially loads cluttered areas with lots of special effects going on, but other than that is playing fully smooth on my 6920HQ laptop + 980 GTX desktop chips.  Great job, Cyan.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Nice visuals, unanswered questions, replay value. Cons:(current stance) load times are awful, stutters after loading/teleporting, items do not render or take a while to render.  Just finished the game today and all in all I liked what I played, I didn't really read all the literature throughout the game so a lot of things I still don't know about. Although it stuttered and easily a half hour of my play time was loading processes, it was a fun game that kept me entertained, many sequences really made me think but overall it isn't the hardest puzzle game out there. Most of my cons are due to it still being early in release so hopefully it will be fixed eventually so I can go back and play again and really dive into the lore. Would recommend for anyone who likes walking simulators with puzzles, I enjoyed The Witness and it felt like that atmospherically for me.   TL:DR Glitchy at release Fun and pretty Give it a try",
            "review_score": "1"
        },
        {
            "review_text": "This really does feel like a Myst game with none of the reminders of how old the other games are. There are nice nods to the style choices and environments of ages past, while creating a completely immersive environment. The puzzles are good, the mystery is thick, and the game is just so thoroughly enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "How long have I waited for such a game... I really love the adventure genre, but sadly it has (d)evolved into games what we call 'walking simulators'. So this was something I had really missed playing. And I had so much fun playing it. Just like as I used to, I explored the world not just waiting for some scrpit to kick in, but actively searching for clues and details, always trying to pick up something related to the puzzle I was working with. It was an awesome feeling I had forgotten. Thank you Cyan, and I hope you guys keep this up!  Pros -Not a mere walking simulator -Amazing environment design -Puzzles that vary in style -No death -No timed puzzles -No hand holding  Cons -Save system. I would prefer traditional save slots and ability to save whenever I want. -Collisions. I appreciate that we can move freely in the world, but sometimes you cannot go around obstacles that you clearly should be able to. Also a jump function seemed necessary. -The last world (or lack of it) was a disappointment too.  Overall If you are a Myst fan, you won't be disappointed. Well, it is shorter than most Myst titles but after such a long break in the genre, I can tolerate it. Definately captures the Myst feeling, buy it now.  If you are not familiar with Myst, and are able to tolerate games that don't put markers on everything and actually require you to work your brain, I think this will be a very pleasant experience for you. And be sure to check out Myst games if you like this.  And lastly, a huge thanks to Cyan!",
            "review_score": "1"
        },
        {
            "review_text": "Obduction isn't actually a well-made game.  It's a GOOD game, with a good story; challenging, with puzzles that make sense in the structure of the world (none of the 'give the tuba to the ostrich' arbitrariness you find in some games of this type). It's pretty. Parts of it are kind of brilliant. There were a couple of moments in the game where I gasped when I realized what a particular thing did or what a set of actions had been leading to.  But it has two problems. One, I think, is that Cyan simply ran out of cash. The other is that Rand Miller has learned nothing new since 1993.  The game doesn't have a fourth act, because they didn't meet their stretch goals to write it. It won't exactly leave you hanging but you'll notice something is missing when you get to the end. There are other parts of the game that seem weirdly unfinished as well, and there are bugs and other issues that imply they just hit a point where they didn't have any more money and decided they'd better clean it up as best they could and send it into the world as is.  [It's sad that the major game companies have all apparently decided that an exploration/puzzle game like this won't sell well enough to fund properly; when I see the people responsible for Myst - a game which CHANGED GAMING (yes, whether you like it or not) having to pass the hat just to get this out the door, it makes me sad.]  But you may not notice any of the problems. You may be able to play it all the way through without hitting one of the game-breaking bugs (I did). You may, like I did, not worry much about the Photos not working or the Loading screen that sometimes gets stuck or the not-especially-well-concealed load times on world transitions which means you can never tell exactly how long you'll be stuck in a haze of particle effect.  Even then, you will be unable to avoid noticing that in terms of gameplay, this is just Myst twenty-three years later; and 'Myst twenty-three years later' may not cut it for some people. The graphics look worse, relative to 2016 standards, than the graphics in Myst did relative to 1993 standards. They still won't give you actual interaction with NPCs; you will never actually have a conversation with anyone else in this game. All you get of any other living sentient is bits of FMV that aren't much bigger, better, or clearer than they were in Myst. The character CW doesn't actually say 'Bring me red pages!' but it's in the same league. They still don't want to bother hiring actual actors. The music and puzzles are better now; but to compensate for that, there is no 'zip' fast travel. You will run around the same paths a lot. The game runs on rails far more than Myst did - there will never be a point in the game where you say, 'Oh, I could work on this or I could work on that.' You don't get choices. (You get ONE choice. At the end.)  I feel like Cyan had years to try to evolve the next version of the exploration/puzzle game, come up with something that was as much of a game-changer as Myst was. This isn't that. But perhaps I expect too much.  Anyway, if you liked Myst and you are in the market for a brand-new Myst which will not do anything for you BUT be a brand-new Myst (with somewhat better puzzles), and you are okay with long loads, high performance demands, and the occasional bug, this is for you. I enjoyed it, but a lot of people are going to wonder 'All that fuss over this?'  P.S. For those who evaluate games in terms of playtime, I think Steam's estimate of my 18-ish hours is about right; that was one playthrough from start to finish, taking it slowly and poking into every corner.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it! Puzzles are tricky (but always solvable) and cleverly though out. It amazes me how the team from Cyan has come up with such a stunningly beautiful world(s) - I have caught myself many times just standing still and looking around, enjoying the jaw dropping scenery.",
            "review_score": "1"
        },
        {
            "review_text": "A review for Myst fans:  So if you loved the Myst games like I did, especially the story concept and well integrated puzzles, this review is directed at you! So I'm going to go through three main points - Story, Art, Gameplay - and do so with no spoilers.  Story - In Myst, worlds were called 'ages' and they were created through ink and paper. You traveled from world to world solving puzzles which ultimately would link back to your hub world. Those worlds might have changed, but the formula was the same, and Obduction isn't much different, simply replacing books with another medium of binding worlds. While it is a little off-putting to be so familiar to Myst stories, it is put together in a way that enhances the puzzles and becomes highly satisfying. While I could include it in gameplay, it's also worth noting that the game is rather short, and the story feels like it could have been longer and more involving for the player. Myst certainly takes longer to complete than this game will. Like the other games, there is more than one ending, pay attention to all the little bits of the story and I promise it's possible to figure out which is the good ending. There are very few holes to punch here, it's a very well-wrapped story.  Art - It's hard to down anything in this field! The world is incredibly detailed, the textures are all unique and well-crafted. You'll feel right at home with the alien worlds, resembling worlds you've already visited in Myst games, like a rock-face world filled with dwarven looking machinery. If you played Myst purely for the art, you have no reason not to buy Obduction right now.  Gameplay - Think Portal meets Myst. The main mechanic is a lot of fun, not too complex to figure out, and fits the story without any force. In fact, it feels more like the mechanic was built around the story, than the other way around. As with all Myst games, every puzzle you solve feels like part of the world. You never encounter something that seems contrived or unnecessary. The downside to this is that there is not a lot of challenge to the game. If you loved Myst for how many notes you'd have to scribble down to make sense of combinations and locks - this is where the game will disappoint you. There are only a handful of puzzles in the game which even require remembering clues, and usually only for a few moments at that. Considering the game comes with a photo option (which I would avoid this early in release, the functionality is heavily broken), you'd expect to have to remember diagrams and numbers and patterns. The wonderful combination book puzzle in the first Myst that represented both the beginning and end of the game - that kind of thoughtful puzzle placement simply isn't here. You will progress, rather linearly, through one puzzle at a time. Hopefully, with a new title under their belt, a sequel could receive enough attention to take all the great parts of this game, and go that extra mile with the puzzles as well. Until then, the game is great, but it still falls just short of Myst :)  Total time spent: 21 hours.",
            "review_score": "1"
        },
        {
            "review_text": "When i was 10 or 11 i use to play Myst and Riven with family.  This was a great game that brought me back to those nostalgic times, i thought it was a great game with a decent play time :D  Cheers, guys well done.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of the Myst series I would highly recomend this game. One caveat, there is at least one point in the game where if you do 4 things just right, you can get yourself locked out of completing the game.",
            "review_score": "1"
        },
        {
            "review_text": "beware may contain spoilers...  I recommend it but beware many bugs plague it.... on the positive side it's really beautiful, some good designed puzzles not as hard as riven but like myst rather....  On the bad side only 3 worlds (the last one is a joke), not many choice at the end i d 'like to have the choice between mofangs and villein etc   and there are bugs.... teleporters dissappearing and reappering blocking my progression (and it's not my fault cause between one save to another it reappears),, also some faulty memory errors as well as sometimes be stuck in the middle between 2 textures , solved with going back to click and point... for the price it was ok",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Myst, then this is definitely a buy. It's absolutely gorgeous.   I have a love/hate relationship with the live action acting portions. There are areas where it works and areas where it doesn't. Most of the time it feels awesome, but sometimes it feels a little cheap and cheesy. That being said, I love pretty much everything else. The score is great, the puzzles are engaging and challenging, the area is fun to explore. I'm excited to see what they do next!",
            "review_score": "1"
        },
        {
            "review_text": "I still remember playing Myst, and Riven as a kid. Keeping detailed notes, and studying every frame. The artwork, the story, the sound, were and still are true works of art. For me they are clear cut master works. The other Mysts I was also very fond of, but maybe not quite at the same level.  When Obduction was announced I was over the moon but I was worried. I spent the weekend playing and I am happy to report I was taken away to another place. I was a kid again. It's rare for me to go to work and actually look forward to coming home to a game.   This is the kind of game I wish we had more of. It's great.",
            "review_score": "1"
        },
        {
            "review_text": "The Cyan Worlds crew have done it right. So glad I backed this game!  The graphics and art direction are just as amazing as I was expecting. Feature-wise the ability to supersample up to 200% is a great option and I can't believe how good the game looks when that is set. If you have a powerful GPU, try it!!  The design of so many things in the game have me laughing to myself at how clever and imaginative they are. This is the same charm and awe-inspiring creativity I encountered in Myst and Riven.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, puzzles are not easy, but definitely manageable! Nice visuals, cool atmosphere. Reminiscent of Myst.. I thoroughly enjoyed it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. I believe Cyan was able to re-create a new game that has exactly everything that made Myst a masterpiece.  - The visuals are beautiful, even though sometimes can look a little cartoon or plasticine-like. I love the locations that are explored. Those bring me so much memories from Myst. - The world / lore you are put in is very well done, you want to know more about it. They re-created something just like Myst, a world where you can travel, but with a brilliant new method to do so. They created a method of travel that is so imaginative, without being cheesy, this is such an awesome feat ! - Puzzles feel like a Myst puzzle. Puzzles sometimes require to understand foreign designs and machinery. It sometimes requires you understand the world's lore, just like in Myst: Riven you had to learn a new numerical language. It's usually more than just a panel that you click on and there is a small brain puzzle. They requires you to explore.  There are some issues I have with the game and I believe they could have waited before releasing it in its current state : - In the game you can take pictures with a camera, which is useful instead of writing stuff on a piece of paper. The picture system was obviously unfinished at launch. There are multiple problems with it (dark pictures, hard to browse those pictures, crashes when taking pictures etc...). Those problems are already getting adressed and may not be there anymore the moment you read this review. - The end of the story feels rushed like if they wanted to release the game on a schedule. That is my feeling, I cannot tell more without spoilers but it feels like it could have had more polish in order to be as awesome as Myst and Riven multiple endings.  Do I recommend this game ? God damn yes You must have good deduction skills and logic. A children will have difficulty finishing the game without looking up solutions (this is what I did back in the days with Myst and Riven anyways).  Was my perception of the game altered by the fact that I am a fan of the Myst series ? Most defenately :)",
            "review_score": "1"
        },
        {
            "review_text": "This game had exatcly the same impact on me as when I played the first Myst for the first time. The looks are gorgeous and awe-inspiring. Puzzles are well thought-out, there are no filler puzzles, everything is interconnected and tied into the world and story. There are no illogical puzzles. All the hints are there, in front of your eyes, or on the pages of books and journals. The music is highly remeniscent of the original Myst soundtrack, so it was like a nostalgia trip to me. I can't recommend this game high enough.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it. I'm sad that it's done.",
            "review_score": "1"
        },
        {
            "review_text": "As a huge Myst and Riven fan I do not recommend Obduction. The game is not horrendous but lacks the narrative essence which made Myst an immersive world.  Obduction feels like a game designed in the late '90s--it feels like Myst when it comes to puzzle mechanics. While some improvements have been made upon the original Myst formula, many of the old annoyances, along with new irritations, detract from the overall experience. If you loved Myst's puzzle formula and could not imagine improving it in any way you may still find Obduction frustrating due to some new mechanics which require a fair amount of backtracking. The increased scope of the game also yields to further difficulty when faced with obtuse puzzle logic, which frequents all but the most obvious interactions.  Putting aside the gameplay, the narrative feels weak especially vis-a-vis Myst and Riven. The characters are anemic and sometimes feel like silly caricatures. The art direction does little to help here and at one moment you are presented with a scene which could have been lifted from a 50's SciFi novel cover, complete with a comical blaster pistol. To be clear, these characters and this narrative is a far cry from the rich, imaginative worlds of Myst and Riven.  All that said, if you want a modern redux of the Myst experience, Obduction may be your best bet. Of course, you could always go back and play through the classics and your time might be better spent.",
            "review_score": "-1"
        },
        {
            "review_text": "As a huge fan of the Myst series I feel like this game did a really great job of capturing what I loved so much about that series. I think I kind of wish there had been a few more puzzles or complexity, although I did enjoy that the game never felt overally complex (it always felt like the solutions were right in front of me most of the time, even the few times I got lost). The game introduced a very cool mechanic but it felt like they could have taken it further than they do in the game to create some really cool puzzles (what is in the game felt like it only scratched the surface of what could have been designed). The only truly negative things I have to say are the performance wasn't great as even on a good system the game was chugging at times, and the loading times, both between locations as well as the couple that are built as walls in a couple places which were even worse because you froze in place until it loaded.  Basically if you're a fan of the Myst series I'm fairly confident you'll enjoy this game as well (assuming you can get over the performance hitches and loading times), but you might be left like me wishing the puzzles had been taken just a bit furrther.",
            "review_score": "1"
        },
        {
            "review_text": "a worthy successor to myst and riven",
            "review_score": "1"
        },
        {
            "review_text": "This is a game about walking very slowly down a very long path and finding a locked door with a number pad on it that you'll have to come back to later. Then you slowly walk back along the very long path (or you hold the run button to jog slowly), find another very long path, and walk all the way down it to find another locked door with a number pad on it. After 6 hours of doing this, I got stuck inside a rock and the game autosaved (and there's only one autosave slot). I've decided that's a good time to call it quits.  I'm a huge fan of puzzley games. I loved the original Myst (which is the primary reason I Kickstarted this). Obduction, contrary to my expectations, is not a puzzley game. There are no puzzles to solve like the ones in Myst. Obduction is a series of doors, many of which have number pads on them, and an initially beautiful but ultimately boring series of overly long, linear paths, some of which have the answers to the number pads hidden somewhere on them.  There are also frequent and atrociously-long loading times, and the framerate is terrible. I would not recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Very cool world, good story. Nice puzzles, not too difficult. Getting through feels rewarding. I hope to see more games from Cyan.",
            "review_score": "1"
        },
        {
            "review_text": "bad ♥♥♥ game, myst fans will climax over this one!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful successor to the Myst series. Gorgeous graphics and great puzzles; only two or so puzzles were too tedious.",
            "review_score": "1"
        },
        {
            "review_text": "This game kept my attention long into the night.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished the game, and although a little bit on the short side, it was the best experience of that kind since i played the old myst-series, truly a worthy successor =)  Hopefully this game will be popular enough to justify a second part (and a third, and a fourth, ... ;P)  Big thanks to Rand Miller and his creative team, they did an awesome job there!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game, puzzles are do-able if you stop and think about it. A wonderful return to a genre they defined.",
            "review_score": "1"
        },
        {
            "review_text": "This was a pretty amazing adventure/puzzle game with an intruiging story and environments. I don't think I've played a game like this in a long time, and I wish people would make more games in this style.  In my opinion, the only real negative part of the game is the constant loading times in the later parts of the game that require you to constantly go back and forth between areas. Even with a top of the line PC, the loading times are still significant, so don't think you can avoid them.",
            "review_score": "1"
        },
        {
            "review_text": "WHAT  The ♥♥♥♥ this lever do?",
            "review_score": "1"
        },
        {
            "review_text": "I wander around aimlessly, with little hope of actually figuring anything out. Which is what I pretty much do in my real life. 10/10 - Most realistic game I've played this year.",
            "review_score": "1"
        },
        {
            "review_text": "It's hard to rate this game in such a binary system of 'recommend' or 'don't recommend' because I didn't hate Obduction but I didn't love it either. There is much that I did like about it. The beauty of the world and the inventiveness of the world building. The puzzles mostly feel organic and their solutions aren't random but can be deduced from what you've learned. Figuring out an alien number system was a great experience. The writing is good, as is the premise and trying to figure out what happened from written notes that are scattered in this huge world was great fun. But ...  No matter how beautiful the world is, if you've been running along the same paths for the nth time, you just want them to go away. The choice of not providing maps might be an immersion thing but not only was it annoying af because it made running along the same old paths a hundred times even more of a thing than they would have been anyway, it will also lead people to just alt-tab out of the game all the time to check their position on maps as soon as the internet provides them (there weren't any online when I played the game but I did it right after release) and therefore break immersion. Just as I had to do research on Google to learn about (sorry, very mild spoiler) abbreviations for US states that I didn't know as a non-American.  There are times where the only viable strategy is running through this vast world, looking for the one clue that you've missed earlier, the one path you didn't notice or the one object that escaped your attention. An in-game way of implementing a hint system for such experiences that are just frustrating instead of fun to me would have been a character who was a badly rotoscoped and weirdly live-action aspiring actor that did much to near-ruin the game for me. Not only didn't he fit visually and his acting was atrocious, his presence was also odd with much of the rest of the game being based on the exciting feeling of being dumped into this place that is devoid of people and having to figure out what happened and where everyone went. But no, early in the game you meet this guy on a screen and he could answer all your questions but chooses not to for ... reasons. Instead he yells cryptic commands at you that you need to comply with in a very gamey fashion. When you're stuck and return to him he just repeats his instruction and basically asks you what's taking so long. Even when you learn so much about the world that you know things he doesn't, crucial things, things that he  must  know, there is no possibility to interact with the guy. Instead you're again expected to comply with his instructions but only selectively this time. Obviously other people were smarter than me but my understanding of alien technology did not allow me to predict the different endings the game has in relation to what I did. So what I was left with was a very frustrating ending and the feeling of being betrayed by the game because it didn't tell me that it suddenly had stopped being gamey and had started to expect me to take it seriously.  All in all, there are certainly people who were basically just waiting for a game like this and who will enjoy it a great deal. For me, it had just too much downtime with the frustrating feeling of not knowing what to do, being lost or knowing what to do but going 'oh come on, do I really have to walk all the effing way back to X again?!' And then there is the ending that feels quite rushed and has a bad taste of  Lost  to it in that it feels highly random and fails to explain everything that happened in this world. It also fails to give the player a central part in the story that they have now figured out and have become a central part in.  If I had to bet, I'd say there was much more planned for the last part of this game but it was all cut when time and money were running out.  So back to the binary decision of recommending the game? For some people, yes I do. In general? Not as long as there are so many other games to play and other things to do. When you've run out of stuff to do, come back to this game and you won't regret most of the time you will have spent with it.  Lastly, full disclosure, I backed this game on Kickstarter.",
            "review_score": "-1"
        },
        {
            "review_text": "Short version: This game has a very promising start, then degenerates into a hectic quest for switches. I would rename it, “Lost: In search of switches to flip.” Be alert for red herrings. The game is confusing enough without them. Why? Irritating and off-putting.  I am a veteran and fan of all the previous Cyan games, but this is the first Cyan game I just stopped playing outright. The Russian control panel was the last straw.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely disappointing. Well into the game, I experienced a fatal flaw that prevented me from continuing. The mine cart with the blue laser became lodged in the rocks with no way to extract it. The solution? Start over! Really? Spend 3 to 4 hours repeating what I've already done? How about writing software that isn't so buggy? I loved the puzzles in the Myst games and was very much looking forward to this, but now I feel like I just wasted my money.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is briliant the actors are ok'ish but the thing that kills me is the god damn stutering and loading times, in a game that's suppose to be about the enviorment its paintful when traveling though it causes you headics and forces you to wait ten god damn minutes to travel from area to area.   I may have an old Hdd but I can run the Witcher 3 fine with next to none stutering and issues and loading times. This game itself doesn't look good enough to justify it. It took me out of the game and honestly ruined the expirience. Unless you install this on an ssd, dont buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Stay away from this game.  [After patch 2.0]  First of all, Optimization is absolutely horrible. Using a GTX 980 Ti, 16 gigs of 2133 ram, a 6th gen i7 processor i get loading screens of up to 2 minutes to acess a small area. The framrate drops to 2 fps quite frequently making the game almost unplayable in some areas.  It's a buggy pos too, crashed to desktop four times and my computer once. As a Bonus, every restart randomly resets configurations, such as language. Have fun playing the game in mandarin. One of the most important functions of the game (taking photographs to save information that is relevant to solve puzzles) is bugged as well.  Now the game istself has three things running for it: A beautiful open world, horrible puzzles and a predictable story.  The puzzles arent interesting and not rewarding at all since they do not demand logic but instead trial and error. A great example is an area that is locked off from you through a number code. In a nother part of the world there is a document which refers to this area as 'the tower' and contains a hint towards the solution. You find 'New York' and nothing else. At this point you hopefully recall that on a completely different area in the world there is a wall with some license plates and to convert the New York license plate numbers and letters to all numbers according to a system that is randomly shown on a completely different part of the map and to enter that code into this exact lock. Congrats! You can now acess two small areas that were visible previously. Feeling smart yet? You can miss a tiny detail among hundreds of meaningless tiny details and it's gg.  All in all you will end up running through a beautiful world 100 times at 2 fps, interrupted by loading screens, searching the same area for the tenth time for a small detail that you may have missed to solve a puzzle that you don't care about.",
            "review_score": "-1"
        },
        {
            "review_text": "First let me state that I do not recommend the Steam version of this game. I had to get a refund because I could not get past the loading screen. The tips and tricks that have been suggested did not work for me. I went to Gog games and bought the game over there. It starts up and runs every time. So there is something in the Steam version that is causing problems. Others have suggested going to Gog and that's why I gave it a try. The game still stutters at times but is playable. I am running an AMD quad core at 3.84ghz with 16GB of RAM and a Radeon R9 390X video cardwith 8GB of memory.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this game because it was in my recommended VR titles. Did not realize it had no HTC vive support (or any VR support from what I can see). Refund requested.",
            "review_score": "-1"
        },
        {
            "review_text": "Wouldn't even load, kept getting an error saying i need ms visual c++ 2015. I wish I could have played this, but it wouldnt let me. I literally can't reccomend this because I have no experience playing it. I couldn't find a solition. I would buy this again someday, but I don't even know if it will work.",
            "review_score": "-1"
        },
        {
            "review_text": "Not playing, much less paying for a game with interminable load screen times. I saw a post from the Devs saying they are aware of the issue. That's great and all, but they can't expect my money to fix something so basic. Kudos to Steam for offering the refund option. Maybe I'll buy in a year or so.",
            "review_score": "-1"
        },
        {
            "review_text": " Obduction  is a visual and aural triumph, but as a storytelling vehicle, it wobbles throughout and crumbles in the final moments.  The failings begin with the game's whiteness.  Whiteness  as in 'it's chock full of white people'. The characters of  Obduction  theorize that their world may be an ark—a literal seed to start a new Earth—so it's most unnerving that Cyan's vision for this concept is such a monochromatic one. It doesn't take long to notice that every speaking character is Caucasian, and, when the wider population is briefly encountered, it's quickly evident that there are more space-aliens than people of African or Asian heritage. This game has a major racial bias, and that puts it on shaky footing.  What does work are the puzzles (which are more elegantly integrated than the potpourri of barely plausible machines and locks stuffed into Myst games) and the vistas (which are more beautiful than I knew my graphics card could produce). For most of the game, this  is  the experience, and therefore the game works.  This all collapses, however, in the final minutes. [minor spoilers follow] The immersion experience is damaged by hokey fireball explosions and the storyline is wrecked entirely by the completely bizarre decision to hang the big emotional ending on the wrong character. Of the three speaking characters, only the woman, Farley, manages to feel like a legitimate person. Her diaries, her home, her politics, and her (beautifully acted) voice recordings all amass to something relatable, to something  human . The two men, on the other hand, include a cranky (and implausibly unhelpful) sodbuster and a buffoonish mayor. Why Cyan would give the big finale to the cartoonish sodbuster (whom it's impossible not to hate for his uselessness) is totally mystifying. Did they really not know how little dimension they gave their sodbuster?  What does this mean for  Obduction , which is so good for so much of its run? How should a player feel about a game that delivers hours of fun and intrigue and leaves them with such a bitter aftertaste?",
            "review_score": "-1"
        },
        {
            "review_text": "Well, this game dosent work for some reason. The loading screen never ends... and it is happening to my friend too. I really hoped that I did not waste money on a game that does not work... can somone please help me??",
            "review_score": "-1"
        },
        {
            "review_text": "Decent game, reminiscint of the Myst series of games. Unlike Myst there is not alot of variance in puzzle types.  Ran into a few times where Unreal Engine crashed in mid game, but nothing game breaking.",
            "review_score": "1"
        },
        {
            "review_text": "It was such a joy to revisit the minds behind games such as MYST, Riven and Uru.  It's a new setting and story, but it also feels familiar. And it is BEAUTIFUL. A smorgasbord of sights and sounds. As added ear-candy, Robyn Miller has returned to the fold to compose the soundtrack.  The puzzles are great. They fit into the world in an organic manner and while some are challenging, none are ridiculous (with one exception that I would call tedious, but not difficult).  I really, really hope to see more from the Cyan team in the future. Their art and vision has been misssed.  Go. Play it!",
            "review_score": "1"
        },
        {
            "review_text": "Imaginative and beautiful with very smart puzzles to solve.",
            "review_score": "1"
        },
        {
            "review_text": "Myst is back. Obduction is the spiritual successor to Myst and it proves to be a great modern day Myst.   Obduction is a puzzle game with obscure puzzles, you'll have to play around with what you find to discover what it does and how it changes something else. This game will require you to takes notes, pay close attention to your surroundings and investigate every nook and cranny.  The game is beautiful, from the textures and environments to the world that is Obduction. Sounds and music are great.  Development support for the game is ongoing at time of writing, with fixes and improvements.",
            "review_score": "1"
        },
        {
            "review_text": "Was captivated by the scenery at every turn, Cyan has made another memorable world to imerse yourself in and explore. now to wait until I buy a vr headset so I can do it all again!",
            "review_score": "1"
        },
        {
            "review_text": "Half full or half empty?  Thsi Game was exactly what i was looking for in a puzzle game from Cyan. I grew up with the Myst franchise and loved every frustrating minute of it. This game is a great new platfor for Cyan to jump from. However... there could have been so much more.  SPOILERS: The ending of this game felt very forced and out of the blue. The very last world has literally nothing in it. The different races you read and hear about are just that, different. There seems like there should have been much more more story but it was cut. The last bit of dialog acts more like they know something you dont and the ending leaves you with no idea what happens to your main character.  With all that said, it was still a fun game. I hope that Cyan is getting some momentum back and will give us more like it.",
            "review_score": "1"
        },
        {
            "review_text": "loved it ",
            "review_score": "1"
        },
        {
            "review_text": "Haven't given Obduction enough time to give a solid judgement but my mom keeps going on about how awesome it is. We both backed during the kickstarter announcement and so far it seems great.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the game. I didn't have any big issues solving puzzles until the last few puzzles. Also the areas near the end felt rushed with lack of content. I think it was about $10 too expensive. $19.99 would have been a better fit. It ran well on minimum settings on my older pc.",
            "review_score": "1"
        },
        {
            "review_text": "A three day weekend was the perfect time to binge on this long-awaited release. Story interesting and visuals were stunning. There were some minor technical glitches but nothing that ruined the immersive experience. The game was challenging, at least for me. Two of the puzzles each took me 2-3 hours to solve. This is a must have for any lover of Myst.  Shocking price too, only $29.95. I think the Myst series was higher than that when released many years ago.  Favorite adventure game now except for Riven.",
            "review_score": "1"
        },
        {
            "review_text": "What a great game. I really enjoyed playing Obduction. Gives back the feeling of Myst and Riven somehow :D",
            "review_score": "1"
        },
        {
            "review_text": "Digging it so far, so go ahead and buy it, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "This reminds me of all the hours I spent playing Myst and Riven in the 90s. I am enjoying stretching my brain around their puzzles once more. The studio still has it, and I highly recommend picking this up.",
            "review_score": "1"
        },
        {
            "review_text": "Well I've only played this game about 4 hours so far, so take what I say with a grain of salt or sugar. Love this game, it's just like cyan's old games with really good graphics for being 3d &amp; being able to walk around real time if you choose that option, cause it also has a point and click option which is pretty cool. I say for being 3d being able to walk around real time it's got really good graphics cause that's really hard to do in a game like this, the fact cyan got it this good is is amazing. The game has that cyan game feel too, a nice change from most modern games. Be prapared for puzzles to solve, and if you feel confused you're not alone, once you solve something it's worth it then you go oh! that's how I do it. I won't ramble any more, just make sure your computer can run it before you buy it. Have fun!",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed this game. The stunning and alien enviornments really bring me back to the good old days. I also appreciate the mechanical/logical style of the puzzles; I don't think there's a single puzzle in this game that isn't intimately connected to the world. Plus it has a fulfilling ending. For me the game was stable and bug-free. I didn't have one crash in my playthrough. Totally glad I got this!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! If you love puzzle adventures, and you are a fan of Myst/Riven , there really is no reason not to get this. I enjoyed every minute.",
            "review_score": "1"
        },
        {
            "review_text": "Soooo good, better (on the whole) than any Myst game (but there is few moments where I wished it was more Riven-esque). And the graphics are excellent on High (I need more Ram and a slightly more better graphics card for epic *sigh*).  Worth it at $80, totally a AAA game.   Alienware 15R3 Laptop (bought January 2016)  Intel i7-4710HQ @2.5GHz 8GB RAM Geforce GTX 970M 3GB Windows 10 Home 1920x1080 Installed on the SSD 'boot disk'  And yes I have been meaning to upgrade the RAM...  PS Finished it The Egg(?) Achievement relates to backers only",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes frustrating, but a good kind of frustrating. Everytime you progress feels like a life accomplishment, great stuff!",
            "review_score": "1"
        },
        {
            "review_text": "Being a longtime user of Myst, my friend and I were both glad to have another chance at gaming together again. Unfortunately we cannot play Obduction as we did Uru Live but having the ability to talk on Skype we both can at least work through it together.   He and I are one's who need a walk-through, even tho there are some who see it as a cheat, he and I find it our life line to making it through a game. Luckily the walk-through makes us work for our treasures.   Once we immersed ourselves into the game, we found it hard to stop. Going through, looking, examining, discovering such beautiful new worlds brings us back to a time with Uru. I know, but the comparison is eminent. You do see bits n pieces of Uru Live, Myst, Riven... all of them in this game.   Each puzzle gets harder, but the rewards are exciting. I like how Steam gives awards for special finds. Gives you a boost!  Overall, my friend and I cannot get enough and will be asking for Part Two which I know others will also.  Thank you again Cyan, for rocking our world with your brilliance!",
            "review_score": "1"
        },
        {
            "review_text": "Overall, I would recommend this game. Don't read anything about it before you play it, your experience will be much better with a blank slate. (There are absolutely no spoilers in this review)  In the style of Myst, you're dumped off at a point with almost no explanation of where you are or why. From there, you have to figure out what's going on and solve puzzles on your way to getting to the end. This is an open-world game (ala Real Myst), though there is the option to change it to point-and-click (I did not try the game this way).  For the most part, the artwork/graphics are beautiful, and you can get fully immersed in the experience. The puzzles generally fit in to the world and don't seem contrived. There is a lot of non-linearity, if you get stuck in one area, you can usually find another thing that you need to work on.  There are a couple of of issues that I had: 1. There is a lot of backtracking/running around, especially earlier in the game. In time you open up some shortcuts, but at time  2. A couple of the puzzles were more painful to execute the solution then they needed to be (*cough* Gauntlet maze *cough). That is, even once you'd figured out what you needed to do, it was so time consuming to actually do the steps that it just became soul-crushing. 3. There was one particular puzzle mechanic that I felt was over-used (though you could argue it's one of the game's themes). Once you've played the game, you'll know what I'm referring to. 4. Loading times! They mostly managed to hide them decently, but there are a couple places where it seems like the game has frozen for 30-60 seconds, other than a spinning circle in the corner. I have an SSD so it wasn't as bad as some people are reporting.  Pay very close attention to everything. There were a couple clues that I missed, and it was very hard to get back and figure out what I needed to do. I don't think that's necessarily a bad thing, but this is a fairly challenging game to finish.  I'd give it 4/5 stars. A very solid game, but not perfect. Definitely worth playing, and worthy of the Cyan name.",
            "review_score": "1"
        },
        {
            "review_text": " Another Masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "It just gets more and more confusing. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Really, really dang good in the Myst-ian sense. Bizzare landscapes and brilliant environmental/mechanical puzzles in that unique Cyan style.  If you hated Myst and Riven then this isn't for you, but if you loved those games this is right smack dab up your alley.",
            "review_score": "1"
        },
        {
            "review_text": "I would love to review the game I bought it last month and we're just now able to download it last night but it won't play it that is some kind of a file :'(",
            "review_score": "1"
        },
        {
            "review_text": "  Excellent exploration and puzzle game in the legacy of Myst. Some of it was easy to puzzle out on my own, other things I got stuck on. Beautiful music and visuals, and a very intriguing story behind it all. Maybe not everything felt resolved in the end, but that was also part of its charm. Because some things need to keep a little bit of mystery. Makes me want to play it again!",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting",
            "review_score": "1"
        },
        {
            "review_text": "First class graphics and amazing gameplay. The atmosphere of this game is quite intense. It's very easy to get sucked in. The ending was a bit confusing, but satisfying none the less. High load times but I was running this on a system that was below the minimum specs. Only loading times took a bit. Everything was smooth inbetween.  I highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Having not played any of the games from the Myst series, I was not sure what to expect, but reading about comparisons with games like The Witness I thought I might as well give it a try.  The game has left me a bit with mixed feelings. Initially, the game looks nice and promising, but it can also be hard to figure out what to do at the beginning. After eliminating the first red laser, things start happening and the 'special physics' of this game come into play, which are unique in a good way.   Then, for a long time the game is very fun to play with some great puzzles to solve. The unique mechanics of the game make these puzzles new and interesting, and as this is quite a big part of the game, this dominates my decision for a positive final verdict. I am not quite impressed by the story, but the puzzles are great, the graphics are stunning, and the background music nicely helps create a proper atmosphere.  After that great phase, somewhere around the time the labyrinth and all the rotating blocks come into play, the game started becoming less fun to play for me. Some of the puzzles near the end I did not really consider thought-provoking but rather tedious, for all the long-distance walking that is required, the time-consuming transfers between different worlds (sometimes it takes forever to load a new world), and a few points on the planets where the game suddenly freezes to load new content (seriously, why should I always get stuck on that path below the tree?). In most cases it is also quite clear what has to be done, but finding/remembering the right path and walking that path takes too much time.  Finally, the game ends with having completed all tasks, and suddenly the game is over. Again I was not really impressed with the story-part here - I found the ending to be a bit of an anti-climax.  To conclude: there is a very good beginning/middle part of the game with fun puzzles, but the last part could have been better, as well as the slow loading times and long walking distances to solve some puzzles. Overall I would still recommend this game, but I would not put it in the same league as puzzle games like The Witness, Portal 1/2, The Talos Principle. It's good, but it could have been better.",
            "review_score": "1"
        },
        {
            "review_text": "awesome succesor to Riven and Myst [games i loved when they first came out]",
            "review_score": "1"
        },
        {
            "review_text": "My wife and I played the Myst series and were excited to find out this new game was coming out! All in all we loved the game. The endings were a bit rough and felt abrupt, but everything leading up to it was good. Would have liked a bit more background story on what happened to all the people too. Lots of puzzles and such to figure out and work on. I'd recommend it to a friend.  We played using a mouse and keyboard as well as an xbox controller without any issues.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say? After a bazillion Myst games and a trillion URU Online tries and retries all Myst fans felt like this was a very important anouncement. This was either the rebirth of Cyan or the last nail in the coffin. If you didn't play Myst/Riven/Exile... before this won't be that important. For those of you that did keep in mind that Obduction is NOT any of those, but retains the essence of what made them special. It's a true Myst-like game on steroids. Lots of. I'm talking VR level 'lots of'.  This game is far from the difficulties of Riven (yet some puzzles feel inspired by some of the hard ones there) and makes going through it a very enjoyable experience.  100% recommended",
            "review_score": "1"
        },
        {
            "review_text": "Thoroughly enjoyed the world building of this game. The whole premise of this game felt very fresh, while the core ideas clearly reflected the same philosophies of design used throughout the Myst series.   When the game ended, I was disappointed. I wanted to spend more time in these worlds. I have many questions that are left unanswered. I cannot wait for a Sequel to Obduction.",
            "review_score": "1"
        },
        {
            "review_text": "Much larger and prettier than I expected - Obduction lives up to its predecessors.",
            "review_score": "1"
        },
        {
            "review_text": "i7-4790k O/C 4.8ghz + 16GB Ram + SSD 850 PRO + GTX 970 SLI + 4K (scaled 67%) HDR 50/60fps = BEAUTIFUL   As for gameplay, It' s a typical CYAN studios game, don't balme them if you don't know what you are getting into. This game is about stunning visuals, interesting puzzles, and a unique story line. Typically you are whisked away to some foreign land. So of course you have no idea on what it is you need to do in this land, so it is up to the player to figure it ALL out. If that's not your cup of tea then you should move on.  I just died by setting off a nice WMD, had a feeling it was bad when I walked up to it, but I let my curiosity get me. The device opened, and had some swirly special effects, so I backed up. Then it closed, so I walked to it again, this time getting a ltitle closer. The device opened all the way up, and started to swirl faster, then fade to white, then black, roll credits, oops!",
            "review_score": "1"
        }
    ]
}