{
    "app_id": 306950,
    "name": "Heroes & Legends: Conquerors of Kolhar",
    "release_date": "2014-08-21",
    "developer": [
        "Cuve Games"
    ],
    "publisher": [
        "Phoenix Online Publishing"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Casual"
    ],
    "achievements": 12,
    "positive_ratings": 43,
    "negative_ratings": 29,
    "price": 6.99,
    "description": "Outfit your band of wizards, warriors, and assassins with custom-made weapons and armor built using a full-fledged crafting system, then lead them into battle against legions of lethal foes as you race to thwart an ancient prophecy in this fast-paced strategy RPG!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/306950/header.jpg?t=1478025576",
    "minimum_requirements": "OS: Windows XP Processor: AMD Phenom 9750 orPentium D 800+ Graphics: 512 MB Storage: 300 MB available space",
    "recommended_requirements": "OS: Windows XP or later Processor: Intel Core 2 Duo orAMD Athlon 64 X2 5600+ Graphics: 1 GB Storage: 300 MB available space",
    "reviews": [
        {
            "review_text": "You get to choose 3 of 5 characters to take into a stage of the 'mission'. There are 15 stages. There are 15 challenge stages. None take more than 20 mins so you can play the game is short bursts. If you manage the cool down time on each of your abilities that you brought into combat and you manage which 3 of 5 characters you bring into combat, you pretty much can't lose. In short the stages are a bit too easy.   That said, I still enjoyed it. I played different combinations of abilities and different combos of chars in the stages giving it some enjoyment. If you simply build strongest character and bring to battle, it's much too easy and you won't enjoy it. Play the abilities and characters in combos and the enjoyment factor increases.   Overall, the max you'll get out of the game is about 15 hours of game play. Even before that it starts to get repetitive.  The achievements can be made without any form of grinding, so if you like 'perfect games', this is definitely a candidate.",
            "review_score": "1"
        },
        {
            "review_text": "Wielding sword or spell, help your party of heroes carve a pathway through hordes of demons, undead, and mythical monsters as you race to thwart an ancient prophecy of doom from unfolding in this RPG.",
            "review_score": "1"
        },
        {
            "review_text": "Extremly disapointing, i expected so much more from it. This is why i dont have high expectations.",
            "review_score": "-1"
        },
        {
            "review_text": "Although game could be fun (it is very simple, but got something luring into) I cannot recommend it. This game requires one to be in online mode, it doesn't work offline (I'm playing offline most of the time). This is not Diablo 3 to forgive such thing. Another thing is crafting system, you can craft everything except lumber, at later stages if you invested in item quality you may find yourself in problem like me, no lumber, no first class armor. One cannot buy the best aromor available as it requires first class one first. And the battles, although they are fun, after xxxx wave one starts to feel boringness. Game is not very long as well. For few eurocents ok, but 10 Euro?!",
            "review_score": "-1"
        }
    ]
}