{
    "app_id": 307130,
    "name": "Asteria",
    "release_date": "2014-07-03",
    "developer": [
        "Legend Studio"
    ],
    "publisher": [
        "Legend Studio"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Action"
    ],
    "achievements": 36,
    "positive_ratings": 127,
    "negative_ratings": 97,
    "price": 3.99,
    "description": "Asteria is a fast paced indie platformer, wrapped up in a sandbox sci-fi world where everything is destructible, mineable, collectable, craftable and creatable.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/307130/header.jpg?t=1447362264",
    "minimum_requirements": "OS: Windows Vista Processor: Dual Core 2.0GHz or equivalent processor Memory: 1 GB RAM Graphics: DirectX 10 compliant video card with 512 MB of RAM DirectX: Version 10 Storage: 200 MB available space Sound Card: DirectX compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Asteria is a part-sandbox, part platformer/metroidvania game. It offers a minimum of 12 hours of content and more if you decide to delve into the sandbox aspect of the game.  The dungeon designs were interesting, the bosses were fun (varying difficulties), and the platforming was mildly amusing. I especially had a ton of fun with the dungeon puzzles of the later half of the game.  This game has a lot of potential seeing as the game's source code readily available and the developer even encourages people to code in stuff they want implemented into the game.  I recommend this game for those who want a sandbox game with a sense of 'finality'. I know that sounds counter-intuitive but for a sandbox hybrid game with a tiered boss system and achievements, you can definitely experience finality.  ",
            "review_score": "1"
        },
        {
            "review_text": "The dungeon based area system is pretty interesting in this game. In sandbox games like this, you don't expect platforming puzzles and boss fights like this game has, which turns out to be a really cool idea.",
            "review_score": "1"
        },
        {
            "review_text": "A Terraria clone, with a couple of good ideas but overall less craftsmanship, it feels like, than Terraria itself has. I guess it's alright, but I probably won't be returning to it again.",
            "review_score": "-1"
        },
        {
            "review_text": "Awfull and stupid",
            "review_score": "-1"
        },
        {
            "review_text": "The game has a compeling makings of a story. A never explored planet, adventure etc. The backgrounds are well done and immersive and shows potential. The game has potential.   My main complains are the responsiveness, the mouse lags and is sluggish to respond. Not sure why since this is not a 3d nor does it have much special effects. Even if I got past that, the graphics feel like 1st gen flash animation style.   Again it has potential. If the graphics were more like metroid in animaion and style and the interface was more responsive we'd have a good start.   I wish I could ignore these complaints and move on, however, a sandbox game is one where you need to get comfortable and enjoy the game. With the mouse problem and the graphics, it is difficult to want to build and explore at all. If this is what I was hoping for I would have loved it.",
            "review_score": "-1"
        },
        {
            "review_text": "Feels a LOT like a beta game. Very clunky movement, poorly generated worlds, etc.   Not recommended for anyone looking for a smooth, streamlined game.",
            "review_score": "-1"
        },
        {
            "review_text": "s'all right. bit like turrican with mining and crafting.",
            "review_score": "1"
        },
        {
            "review_text": "Like the guy below me, this game is literally the worst game I have ever played in my entire life. Yes, the soundtrack may be good. But that doesn't qualify for a good game. The people who made this game were just like,'Hey you know Terraria? Let's make a stolen version of the game and only put 2 hours of effort into it!' You can die from the weakest mobs in the entire game; AND IT ONLY TAKES LIKE 5 HITS, THAT'S IT. Luckily, you respawn, keeping all items. But seriously. You start from some sort of space station, to the middle of some planet. I got in the game and had exactly no idea what to do. Dig? There are no trees. I couldn't find any light source for the caves; and once you fall into a cave, if you go deep enough, you're stuck. That's right. I just recently quit the game because I had no light, mobs were attacking me, and I was stuck underneath the ground. If you want to keep your sanity, DO NOT SPEND MONEY TO BUY THIS GAME.",
            "review_score": "-1"
        },
        {
            "review_text": "Another Terraria clone....BUT the resource gathering is a lot quicker.  Initial thoughts on this one are very good....it plays very well.",
            "review_score": "1"
        },
        {
            "review_text": "It is just a messed up versoin of Terraria.",
            "review_score": "-1"
        },
        {
            "review_text": "i would like a refund but not because its a bad game i just feel my money could be spent elsewhere",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would come back. I love the OST and the gameplay is also amazing! Need Game of the year addition!",
            "review_score": "1"
        },
        {
            "review_text": "Get this game on sale But not worth the 10 dollars it wants basicly you have a crappy version of terraria mixed with starbound it is really confusing the mining in this game is a bit hard and the whole aspect of combat is totally not there sad to say i was looking forward to this game but....when i played it..was a horrible experance like i said don't buy it for 10 dollars if your lucky to get it for 1.89 or lower get it",
            "review_score": "-1"
        }
    ]
}