{
    "app_id": 307570,
    "name": "A Golden Wake",
    "release_date": "2014-10-09",
    "developer": [
        "Grundislav Games"
    ],
    "publisher": [
        "Wadjet Eye Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Commentary available"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 18,
    "positive_ratings": 118,
    "negative_ratings": 50,
    "price": 6.99,
    "description": "A story of greed, corruption, and real estate in 1920s Miami.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/307570/header.jpg?t=1447362300",
    "minimum_requirements": "OS: Windows ME or higher Processor: Pentium or higher Memory: 64 MB RAM Graphics: 640x400, 32-bit colour: 700 Mhz system minimum DirectX: Version 5.2 Storage: 350 MB available space Sound Card: All DirectX-compatible sound cards",
    "recommended_requirements": "OS: Windows ME or higher Processor: Pentium or higher Graphics: 640x400, 32-bit colour: 700 Mhz system minimum DirectX: Version 5.2 Storage: 350 MB available space Sound Card: All DirectX-compatible sound cards",
    "reviews": [
        {
            "review_text": "How come I've never reviewed this fantastic game from Grundislav Games and published by Wadjet Eyes Games? How come I've never told you that after the excellent Ben Jordan series, Grundislav came back with another universe?  A Golden Wake puts you in the shoes of a young man, trying his luck during the '20 in Florida, in the real estate market, under Georges Merrick and during his apogee before falling into another universe.   It's a point-&amp;-click adventure, reminiscent of the age of pixelated games, with AGS engine. But here, you have some twists: if you want to be the perfect guy (in other words, unlock achievements), you have to convince people to listen to you and to comply to your requests. If not, well, it's up to you to find another way around. Some puzzles are also included. As far as I know, I enjoyed the plot.  Surrounded by characters that really existed, if you activate comments, you'll have some pieces of history, making it also a learning game for everyone interested in that matter. Yeah, it's in English but who cares? You can have subtitles, no voice acting, etc.. And the voice acting is very good anyway.  The soundtrack is really fitting the '20. Dam dam dam dam dam damdam.... ups, sorry, I was singing some charleston.  I can only recommend it. Not because I love Grundislav's style since Ben Jordan (ah Ben, Simon, Alice, Percival....) - they're free, people, the original games or the deluxe edition for the two first adventures. But because it's a very enjoyable game. Very very enjoyable game.  Do yourself a favor. Buy A Golden Wake, buy the Blackwell series, download the Ben Jordan series and the Chzo Mythose quadrilogy. You'll understand why they are considered as gems.",
            "review_score": "1"
        },
        {
            "review_text": " Read all those reviews saying this game is boring.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a fun small game from wadjet eye, not their best, but still entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "I had been waiting for this game for a while. I've been a fan of Grundislav's games since the first Ben Jordan game and have followed his gaming career for well over a decade now. The game's story intertwines through the life story of a character who starts off feeling like he can take over the world and then realises that life doesn't always go to plan no matter how much you try to achieve. The puzzles are well thought out, and it even has a hint option for the more casual adventurers. Fantastic voice acting, wonderful animations and an engaging story. Highly recommended if you enjoyed such games as Laura Bow and Gabriel Knight. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "A totally overrated-in-hype game due to the publisher, famous for Point and click adventures. I found the plot extremely boring, as well as the way the story proceeds. One may expect a certain rhythm; well, it lacks from the beginning to the tail. There is never the feeling of playing, say, something like The Black Legacy or Gemini Rue. Simply a waste of time for me, I couldn't even finish it, I gave it up.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't have much to say about this.  1) Pixel graphics (some love it, some hate it - completely personal choice) 2) Somewhat average story - just like old american life based drama - you've seen it in many movies 3) except couple of times, puzzles are easy  If you find it cheap, you can buy it for few hours of enjoyment. 6 out of 10 ",
            "review_score": "1"
        },
        {
            "review_text": "A very good traditional point-and-click adventure game with great writing, a historical setting, excellent art depicting real locations, and a great variety of activities. What I like best about this game is that there's no antagonist - it's a rare example of man-versus-himself conflict. I highly recommend this one to anyone interested in history.",
            "review_score": "1"
        },
        {
            "review_text": "Alfie Banks, the main character, does complain a lot. In particular, he complains about having to run around and do erands on behalf of others. Well, as a player of this game I have the same complaint: the game can be summarized by running around and doing completing disconnected straight forward errands. The character is rather flat and doesn't develop, the storyline isn't compelling.  I generally am a big fan of the old school point-and-click adventure games. But I'm not a fan of this one.. Pity",
            "review_score": "-1"
        },
        {
            "review_text": "Very linear, makes you believe you have choices when you don't much like Walking dead or Wolf among us except even fewer. Puzzles were easy, and the characters were okay at best. *SPOILER* Alfie's motivation to betray his boss was really lame, and sudden even for the player.  Just go play Ben Jordan paranormal investigator its basically that without the paranormal. Made by the same guy and it's free and there are like 10 games.  Game wasn't worth 15 bucks, maybe 1-5.  Pick it up when it's 80% off.",
            "review_score": "-1"
        },
        {
            "review_text": "A Golden Wake earns bonus points for its retro charm and unique setting, but the story just simply doesn't have quite the backbone to keep me all that interested. The flimsy characters don't hold much water either. It's an easy enough game to blow through, as the puzzles are flimsy but logical and there's not much meat to it, but retro adventure game fans, particularly those who enjoyed Lara Bow, will find enough here to keep them mildly entertained. Don't expect much more, though.",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░ ░░░█░░░█░░░█░█░▄▀░█▀▀░░░▀█▀░█░█░█░█▀▀░█░ ░░░█░░░█░░░█░█▀▄░░█▀▀░░░░█░░█▀█░█░▀▀█░▀░ ░░░▀░░░▀▀▀░▀░▀░░▀░▀▀▀░░░░▀░░▀░▀░▀░▀▀▀░▀░ ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░ ░░░░░░░░░░░░▄▄ ░░░░░░░░░░░█░░█ ░░░░░░░░░░░█░░█ ░░░░░░░░░░█░░░█ ░░░░░░░░░█░░░░█ ███████▄▄█░░░░░██████▄ ▓▓▓▓▓▓█░░░░░░░░░░░░░░█ ▓▓▓▓▓▓█░░░░░░░░░░░░░░█ ▓▓▓▓▓▓█░░░░░░░░░░░░░░█ ▓▓▓▓▓▓█░░░░░░░░░░░░░░█ ▓▓▓▓▓▓█░░░░░░░░░░░░░░█ ▓▓▓▓▓▓█████░░░░░░░░░█ ██████▀░░░░▀▀██████▀",
            "review_score": "1"
        },
        {
            "review_text": "Sweet and easy point and click adventure where even multiple options advance you to the same future. Good music, linear, but interesting story, good playability. Very easy to play as there are usually just few items and locations.   Includes a few 'action' scenes.  Recommended, if you like straightforward adventures without complicated puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very well made, albeit short point and click adventure.",
            "review_score": "1"
        }
    ]
}