{
    "app_id": 307600,
    "name": "Chainsaw Warrior: Lords of the Night",
    "release_date": "2015-02-17",
    "developer": [
        "Auroch Digital"
    ],
    "publisher": [
        "Auroch Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Adventure"
    ],
    "achievements": 35,
    "positive_ratings": 55,
    "negative_ratings": 31,
    "price": 4.79,
    "description": "Based on the 1987 Games Workshop classic, a battle vs zombies cultists &amp; time! Chainsaw Warrior: Lords of the Night sees the player fighting against hordes of Aztec Zombies, and the clock, to save reality from Darkness.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/307600/header.jpg?t=1500917150",
    "minimum_requirements": "OS: Windows XP SP3 Processor: Intel 1.6GHz Processor or equivalent Memory: 1 GB RAM Graphics: Direct X 9.0c/OpenGL 2.1 compatible card Storage: 400 MB available space Sound Card: FMOD compatible sound card",
    "recommended_requirements": "OS: Windows 7 Processor: Dual Core 2.0 or equivalent Memory: 2 GB RAM Graphics: Direct X 9.0c/OpenGL 2.1 compatible card Storage: 500 MB available space Sound Card: FMOD compatible sound card",
    "reviews": [
        {
            "review_text": "Genre - A Games Workshop Sci-Fi/Horror Solo Card Game Conversion  I played the first Chainsaw Warrior on Steam quite a bit and enjoyed it in short blasts, although I had a few gripes with some of its mechanics. The game basically involves generating a character and choosing items before entering a randomised solo adventure. When I saw this was out for a fiver, I thought I may as well give this one a go too.  I was pleasantly suprised as they had polished and added to the first game quite nicley. Now the clock although a factor is not so harsh. You also get to fight two randomised mini bosses between the three stages, The inventory and skills are also more intuitive.   The only gripe that I still have is that 'The Darkness' can only be destroyed with two items The Laser Lance and an Implosion (suicide) vest. Sometimes you will end up reaching him without the a good enough marskman skill to hit him or sometimes without the Laser Lance itself. Most of the time I can only kill him with a lucky shot, which doesn't have great odds either. There are a few security measures to help with this, like the teleporter. Also this time around you can destroy a few of his minions to make him slighlty weaker. However, I still think this can be a very irritating game mechanic in an otherwise fun game. It would have been nice if they'd have thrown in a few more weaknesses this time around.",
            "review_score": "1"
        },
        {
            "review_text": "If you're into nerdy board/card games then you can't go wrong with Chainsaw Warrior. It's a pretty addicting game. Even when you finally have to (unfortunately) stop playing and leave your house to go about life, you'll still find yourself sitting at work pondering the pros and cons of the implosion vest or what kind miracle 2d6 roll you'll need to keep The Darkness from pimp slapping you right in your c o c k holster. Trust me, that hurts. And he does it often.",
            "review_score": "1"
        },
        {
            "review_text": "3/10 - also not endorsed by Bruce Campbell  Like for the original CSW, graphics are top, story is cool, gameplay is well-thought and fair - but the game is simply to repetetive and TOO SHORT.  Get this one too in a 1 buck bundle or pass.",
            "review_score": "-1"
        },
        {
            "review_text": "If this was the physical card game, I'd have to take it out the back, pour petrol on it, set fire to it and dance gleefully around it's burning embers. It's the only way this game could ever be called fun.  Terrible game. Am I being clear enough?",
            "review_score": "-1"
        },
        {
            "review_text": "Game is about 15 minutes long (if you play normal AND hard)...",
            "review_score": "-1"
        }
    ]
}