{
    "app_id": 307670,
    "name": "Hard West",
    "release_date": "2015-11-18",
    "developer": [
        "CreativeForge Games"
    ],
    "publisher": [
        "Good Shepherd Entertainment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Western",
        "Strategy",
        "Turn-Based Strategy"
    ],
    "achievements": 35,
    "positive_ratings": 2113,
    "negative_ratings": 583,
    "price": 14.99,
    "description": "When a tragic turn of events sets one man down a path of supernatural chaos and revenge, he must brutally hunt down all those who wronged him. Fight and survive through 8 unique story-based scenarios, and try your hand at 40 individually designed turn-based combat...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/307670/header.jpg?t=1538851742",
    "minimum_requirements": "OS: Windows Vista/7/8/10 Processor: AMD Athlon(tm) 64 X2 2.6 GHz / Intel Core 2 Quad 2.6 GHz Memory: 4 GB RAM Graphics: Radeon HD 4670 (512 MB) / GeForce GT 430 (1024 MB) DirectX: Version 10 Storage: 6 GB available space",
    "recommended_requirements": "OS: Windows Vista/7/8/10 Processor: AMD Athlon II X4 3.1 GHz / Intel Core i5 3 GHz Memory: 6 GB RAM Graphics: Radeon R7 260X (2 GB) / GeForce GTX 550 Ti (1 GB) DirectX: Version 10 Storage: 6 GB available space",
    "reviews": [
        {
            "review_text": "I'm a sucker for westerns, comic books, and turn based strategy games and this one nails all 3. The look and feel of the west is great from the sound effects, music, narration, and art direction. The cell shading, fantasy/horror plot, and story telling really nails the comic book vibe.   Then you have the game play, I've played my share of games in this genre and this one does cover/terrain as good or better than any others before it. You are pretty much a glass cannon no matter your build and if you stand in the open you loose. Careful movement and placement are a huge part of the outcomes of the battles. j  On the mechanics side, the luck system is a nice resource management system, the cards add a lot to combat and making hards for buffs is a nice bonus to make it more complex. They could add the whole deck to make it better, once you get so far it does get repetetive.   The downsides are there as well. Inbetween fights is not the best, the stories were good but it got bland. The chapters are short and you start over after each one loosing a sense of progress with your team. After you finish a chapter you go back to the main menu taking you out of the game and ruining any imersion you have.  Not a perfect game, it has flaws but a really great game and I hope we get a sequal because if they iron out some of the flaws it could be a really epic game.",
            "review_score": "1"
        },
        {
            "review_text": "So, after playing the first scenario, a few things to note:  -The comments about the story feeling a little disjointed are somewhat accurate. After each scenario, the game sends you back to the main menu as though you'd just finnished a chapter in a book, but the next chapter wasn't out yet.  -The combat is straight out of XCom/Jagged Alliance. That's not a critisism as much as it is an observation. If you don't like those types of games, you won't like this one.  -Even though it seems like there are different approaches to reach the objective for a map, so far they just boil down to 'kill any and everything that moves'. That may change further along in the story, but the only 'stealth' mission I did still ended up forcing me to gun down all the bad guys to escape.  -Characters come and go pretty much on a whim. Fortunately you don't lose any equipment as the character dumps their gear in your inventory pool when they bail, but anticipating an upcoming battle only to end up having to go in a gun down with nothing to say about it is kinda rough.  -Difficulty options and ironman modes add replayability.  Overall, the game seems solid and decently put together. Yeah, one gun looks like the next but ultimately, if you see a guy with a rifle, he's got a rifle. If that rifle has a scope, it's a sniper rifle. Pepperboxes have their own look as do revolvers and shotguns. It would be nice if everything had its' own unique image, but there aren't any surprises.  All said and done, Hard West is a very functional tactical strategy game set squarely in an old west setting with a supernatural spin. First impressions give it a solid 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "So far so good, I was able to finish the first scenario on medium, and there's a lot more content and difficulty levels. I like the Wild West gameplay and the turn based style works well. Good keyboard and mouse controls and it performs extremely well for me. Levels load in under 10 seconds and I haven't had any glitches or bugs.  The story is actually pretty good as are the graphics.  Definitely worth $20.",
            "review_score": "1"
        },
        {
            "review_text": "Only 7 hours into this game and already hooked.   XCOM style move &amp; shoot tactical combat &amp; cover system is at the core of this game. The focus on movement, flanking and cover make this system one of the best ideas form recent turn-based games. The 'scenarios' are each mini-campaigns complete with a world map to explore and several scripted battles.  What you get in Hard West, that you don't really get in a lot of these tactical games is a great story. Hard West is a gripping series of interconnected stories set in a Steampunk wild west with a bit of Lovecraftian horror tossed in for good measure.  Customisation options are there for your characters and have a lot of flavour to them. Perks are obtained by slotting playing cards, each with unique passive and active bonusses. These can be arranged into sets constituted form classic poker hands.  If the game has a drawback, I guess the lack of legacy. I found that once I got invested in a character, they died or the scenarios finished. That said, the changing cast of characters is part of the charm.  Great little game:  5/5  ",
            "review_score": "1"
        },
        {
            "review_text": "Preordered this game. Played it. Refunded it because of bad optimization and auto-saving - 4/10 After half a year decided to give it another chance and bought it again Game definitely became better - 7.5/10 Still no manual saving, but it isn't a critical feature as i thought before. It's not a hardcore tactical turn-based combat game (it can be with iron man and hard difficulty). It's story-driven game. Different scenarios have small unique and interesting strategy mechanics. ",
            "review_score": "1"
        },
        {
            "review_text": "Polish developers seem to conquer the gaming world with their intellectuall, well-crafted, deep, deep games. While western gamedevs are obviously existing in an infinite loop of their own cliches (dragons, elves, robots and zombies), the Poles break new grounds. Hard West is an exceptional RPG\\strategy game, with strong emphasis on narrative (feels like reading a very good book) that stays with you for days, making you brood on the fates of the game characters (like a good book does). The atmospheric and inventive perk system (dealing cards and trading various weird relics), absolutely glorious tactical combat system (capitalizing on much of Silent Storm battle mechanics), all soaked in dark weird fiction lore (a Lovecraftian literary movement of recent decades) - all together make for a brilliant game where 'brilliant' is indeed an actual product description, not just standard flattery. Heavily recommended for tactical combat gamers, Lovecraft and weird fiction aficionados, and all those who like a high quality game devoid of silly modern cliches.",
            "review_score": "1"
        },
        {
            "review_text": "After completing the game, I recommend it to anyone who enjoys turn based combat games. The setting is great. The weird west theme really shines. The story is decent and the writing is solid. The interesting weapons and the abilities from the cards provide a lor of variety in turms of combat. The art direction and stage design are solid. The narration is top notch and the soundtrack really adds atmosphere.  As for the XCOM and Jagged Alliance comparisons, Hard West really is it's own game. While it is turn based, its combat system is simpler then XCOM's and much less sophisticated then the one found in Jagged Alliance 2. That said, the game doesn't suffer for this. Combat is fun, tense, and always seems fair.  I played it on an older system (Dell XPS 420) and it ran smoothly. There were temporary hangs in the inventory screen and I ran into one mission that did not end when the trigger should have occured. I was able to work around this without any issue.  So, solid game. Fun, not terribly difficult (on normal), entertaining, and very interesting. I look forward to see what the developers do next.",
            "review_score": "1"
        },
        {
            "review_text": "Love the game so far, but it keeps freezing on one scenario, and its not my computer, and I cant get any further! Other than that it has been a great game to play!",
            "review_score": "1"
        },
        {
            "review_text": "Good and fresh look at turn based games. Highly recommended :)",
            "review_score": "1"
        },
        {
            "review_text": "Great Narrative and strategic design. Some replayability in trying to get 100% completion. Each chapter has different main characters but eventually all their stories link up. It was so good that I wish it was longer, even though 40 HRs of gameplay it still felt not enough. I can't wait for a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Most jewels one finds when not actually looking for them. I did not know about this game until 5 minutes before I had bought it. Something aesthetically pleasing about the screenshots and audio samples from the trailor.  Here is another Polish Wild West game. As usual with sublime audio and atmosphere but this time also with a little quirk. Demons. And the involvement of the devil.  Now, this is a low-budget title as you can tell by the price-tag. And yes, it is sub-par to current visual standards. But what the heck does it matter when you get a great authentic and immersive albeit mythical world to play around.   The game is challenging enough what with 'Iron Man' mode - never understood what's so iron about having to actually face the consequences of your actions. The AI is on par with what you get in any other game three times as expensive. Even if the individual scenarios are a bit short, there is enough replay value due to exploring and experimenting with the campaign map quests that come along with the tactical combat gameplay. Each of the scenarios has a slightly different set of gameplay elements and rules. The supernatural abilities of the player characters can be combined in multiple synergetic ways.  I was probably supposed to have mentioned XCOM by now. So ... 'Hard West' is fun. 'XCOM: Enemy Unknown', it is not.",
            "review_score": "1"
        },
        {
            "review_text": "A nice litte game! It deserves a lot more attention than what is has already been given. The game itself is brilliant for what it is. Its a mix of the XCOM turnbased combat and the old Desperado games, sneaking around or going all in guns blazing! You will probably love the story if you have watched even the slightest of Supernatural or Jonah Hex.   7/10",
            "review_score": "1"
        },
        {
            "review_text": "The only negative thing I can say about it, is some of the text is really small. Other than that, this game knocks it out of the park.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very good game in every aspect. If you love turn-based like fallout tactics, X-com, anti-squad, jagged alliance, etc. then this is a must buy. I only hope they will make more and more and more...",
            "review_score": "1"
        },
        {
            "review_text": "Joined up with hard west on Kickstarter, I knew it had potential and now it's finally here I'm very pleased with how it's turned out. Hard west is a turn based tactical western, think xcom enemy unknown in a Wild West setting. I've only just started with the campaign but already I have a few hours in and enjoying it very much. If you love the old western movies and love turn based tactics, give this a go.",
            "review_score": "1"
        },
        {
            "review_text": "Hard West, developed by CreativeForge Games, is a turn based strategy RPG set in a brutal and unforgiving period where a man’s life is worth less than a wad of chewing tobacco; The Wild West. You’ll play as a series of poor souls who were unlucky enough the cross paths with the Devil himself. Overcoming the hardships and tortures of life is only a meager victory compared to the supernatural horrors plaguing the West.  Now, before anything, I think it’s safe to say that Hard West has rightfully taken its place on my list of favorite turn based strategy games. It draws some clear inspiration from X-COM, yet it’s nothing close to a copycat. This game is entirely fresh and adds its own little spins to the genre.   So, as you’d expect, gameplay is pretty solid. Players are equipped with a limited amount of actions, which are spent on movement, the consumption of an item, or attacking. The game offers a series of abilities which can either be purchased or found randomly as you traverse the ruined landscapes. The combination of 1800’s lifestyle and demonic upbringings is not something I’ve seen before in a game, so the results are… surprising: Anything from fanning your revolver to controlling the powers of Satan is available to you.  Also, Hard West has a more lenient feel to it, opposed to other turn based strategy games. It's hard to explain it properly, but maneuvering my characters and setting up flanking positions and whatnot felt so fluid to me. You can utilize almost every inch of the battleground to their favor, and the variety of ways to win a fight is staggering.   As for cons, one thing is SERIOUSLY irking me, and I’ve noticed a fair amount of other reviews bring this up, too. There is no checkpoint/save system when in combat. Fights could last a very long time, depending on the player’s strategies, and if a main character is killed nearing the end of a battle by some stray bandit, you’ve gotta start ALL OVER again. This has happened to me a handful of times, and I could only quench my rage by shutting the game down and taking a break.  Secondly, I've encountered a bug when the enemy is taking their turn in a battle. Sometimes... they just wont do anything, and I end up locked on the 'ENEMY'S TURN' screen. Had to restart a single battle three times before it finally fixed itself. This game's issues are few, but damn, they can be annoying.   I really hope the devs patch this bug, but apart from those gripes, I'm really loving this game.  If you want an intense and addictive turn based strategy game with a hint of satanic horror, Hard West is the place to go.",
            "review_score": "1"
        },
        {
            "review_text": "- Tactical, turn and squad based quasi-RPG. - Set in an indeterminate place and time but in the Weird West. - Absurd weapons (yet still many of them are real). - 90% (citation needed) of the characters are psychotic murderers. You get to form a posse with them. - Cannibalism, half-dead half-alive people, a demon with a guard of women exclusively. - You can slaughter settlements or work peons to death. - You get to control a Hellbent Spanish Inquisitor. - YOU GET TO CONTROL A HELLBENT SPANISH INQUISITOR!  9/10 (because there is no nudity). ",
            "review_score": "1"
        },
        {
            "review_text": "GREAT game. Refreshingly rich and varied story. Great mechanics. Good graphics. Different in a lot of good ways.  If you are a fan of this genre (turn based tactical rpg), you WILL like this game. No question.",
            "review_score": "1"
        },
        {
            "review_text": "I was a little hesitant to buy this game after reading some of the reviews about the lack of persistence, lack of player overwatch, and enemies running up point blank. However, for me, this appeared to be blown out of proportion. Let's review those criticisms first.   Lack of Persistence  This is part of the game mechanics, essentially. The game features various abilities, items, and statuses. Each scenario, you start with a certain set of these. A lot of times the starting circumstances are thematic. Personally, it was enjoyable to rebuild your posse's abilities, and try new combinations of abilities and gear.   Overwatch  Basically, the enemy gets a circle, that if you enter, you will get shot automatically. The player does not. First, this is to prevent the PLAYER from running up point blank and shooting the enemy. Secondly, you are smarter than the AI, so it needs aids like this to keep the challenge. Third, it helps the 'puzzle' aspect of tactics. Manuevering is extremely important in this game, so the overwatch zones challenge you to think about how you want combat to move, and how you are going to flank.   Enemy Point Blank  This almost never happened to me. I think what it might be, is the AI trying to position, then coming around a corner very close to one of your characters. Instead of backtracking to cover, like you might do, the AI instead takes a shot that is likely to hit, and does full damage (as cover reduces damage). Usually, the way this occured for me was the AI running out into the open at medium range from my characters. My characters luck (a form of expendable defense) usually protected them from these attacks, which resulted in the AI enemy getting gunned down, sans cover.  OK, onto the review...   THE GOOD  Combat mechanics - Imagine the typical tried and true XCOM mechanics, plus a few twists, and it moves faster (only 1-2 hits to kill your average guy). First, you have LUCK, which causes enemy shots to miss, but then depletes in proportion to their hit chance (in other words, the better the shot, the more luck is burned off to protect your character). When a character uses certain items, or gets hit, they regen luck. Luck is also spent to perform certain special abilities, meaning you have to choose between defense and (typically) offense. Secondly, if you have partial cover you take less damage... and full cover even less (and the same for the enemy).  RPG Mechanics - This was really enjoyable. Your character does not level up, but instead gets weapons, usable items, a talisman, and playing cards. This last one is really important. Your characters can have up to 5 cards equipped. Each provides a passive bonus, some provide and active bonus, and (here's my favorite part) if you can arrange a type of poker hand (like 2 of kind, full house, straight, etc.) you get additional passive bonuses. These, combined with your characters natural stats, and equipped gear allow you to create awesome combos.  Level Design - The levels are great. They are complex enough to provide a variety of strategy. The best part is that most missions have some sort of objective to complete, and a lot of them have secondary objectives that give you bonuses. Lastly, certain missions start off out of combat, where your characters can sneak around the guards, completing objectives before combat even starts (which is initiated by your actions).  The Campaign - First, it tells several stories, each of which help flesh out the main story line and give you an idea of what happened before, after, and during the main campaign. My favorite part was how most of the campaigns had their own system of how it worked. In one campaign you have to keep track of men and food while leading an expidition. In another you have to research different things, and use tools to track down an important quest item. It reveals how flexible the game engine really is.  The World - It is a great marriage between Clint Eastwood and HP Lovecraft. I love it love it love it.    THE BAD  Line of Sight - Every XCOM style game I have ever played suffers from this, so it's not a huge negative in my mind. However, you will find the enemy making shots you swore were impossible, or set your characters up to be behind cover when they take full damage.    THE WEIRD  The writing - I didn't want to put this down as bad, even though it technically is, because it didn't stop me from enjoying the game. So, the story is great, but occassionally the writing just breezes through details. You will get lines like 'And then you used your powers to kill everyone ever.' WOT. That's not an actual line from the game, but I'm paraphrasing to illustrate these odd lines found throughout the game.",
            "review_score": "1"
        },
        {
            "review_text": "XCom meets Desperado's.   It's no Ja2:1.13, but it's sure as hell an engaging game.",
            "review_score": "1"
        },
        {
            "review_text": "XCom meets Desperado's.   It's no Ja2:1.13, but it's sure as hell an engaging game.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game with interesting mechanics via the Luck attribute. I'm still getting to grips with the ability cards/deck and how they combine to give additional bonuses but I like what I've seen so far (just finished the game on easy setting). These two mechanics lend a very strategic layer to the tactical squad based combat. You could build a character with high luck values and some 'expensive' abilities that chew through luck to turn him/her into a demonic juggernaut, or into a character that spams out prayers/buffs every few turns to make them shoot the wings off a fly from half way across the map. Due to the random supply of cards you can't munchkin/twink your way through the game, at least not in the early parts of each scenario until you have a larger card stash.  I was somewhat puzzled by the 'metagame' in each scenario as the mechanic changed in each scenario with no real explanation in the game itself (the manual had some info). In one scenario I need to recruit servants, keep them fed and healthy in order to secure certain positions or to do certain tasks, in another scenario I needed to mine gold by myself (no servants), in another scenario I had to manage my premonition power to avoid tactical disadvantages later in the scenario or to secure advantages later in the scenario. These changing mechanics in each scenario were interesting, but puzzling at the start with some as it was not clear how best to use them or when they should be saved/stored.  All in all I like the game, in particular the squad/tactical combat parts. A Kickstarter/crowd-funding success in my opinion :-)",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed this game. Great stories with an XCom style gaming system. Very happy with this kickstarter backing.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool take on a western themed turn-based strategy with some occult stuff thrown in. The basic mechanics are similar to XCOM, but it has its own style and intersting features like the luck system and combat injuries. The level design is great and there is a huge amount of weapons and items available.   The only downsides i can think of is that the game often hangs when opening inventory/trade menus, and that the framerate droppes occasionally for no apparent reason.",
            "review_score": "1"
        },
        {
            "review_text": "After 2h Nice atmosphere and good mechanics. Tutorial campaign was a bit too short to see my decisions impact, I wonder how will it work in next missions.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful find! It has alot of cool turn-based elements like X-Com, but is quicker paced. There are complaints of no overwatch, but there is no savescum either, so you either win or you lose. The scenariios are short and interesting. It is not X-Com. There are many new concepts so the differences are a welcome change from other similar games. There is a luck meter, giving the phrase 'your luck has run out' a new literal meaning. The card system is based on poker adding a new dimension to that mechanic. My only complaint so far is I wish the gunshot SFX were more realistic or at least beefier. If you want something diifferent and are a turn-based tactical fan, get this unique little gem.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent strategy game, full of supernatural horror and adventure. You'll get a good 60hrs of gameplay if you're a completionist that likes to know how all the choices play out.",
            "review_score": "1"
        },
        {
            "review_text": "So i bought Hard West after looking at a gameplay demo..it's a split decision because there are a lot of flaws in the game..but for only 10-15 dollars depending on currency rate, i guess i can recommend the game because there are still some fun to be had playing the game..  pros: - the game art and animation is well done..probably on the same level to shadowrun series - the music and voice over is also very well done and brings a good atmosphere to the game - gameplay wise, quite strategic..even if it borrows x-com elements a lot..a lot of variety with the guns and magic..some battles are somewhat unbalanced to favor the enemies (see below) - the lore of wild west meets magic and demons is quite interesting  cons: - some battles are very outnumbering..but still can be done with good positioning..one most fatal/lazy mechanism is this: the enemies have a sort of x-com style overwatch counterattack which automatically attack when you come near them..but the players DON'T! i'm sure they can program this system to work with the players..but it seems that they are too lazy to include it to the system..making battles unbalanced due to this.. - bullets don't have physics..such as really bouncing of walls or hitting bystanders by accident..the bullets simply fly to the targeted enemy and does a rng whether it will hit or miss that enemy..if there is a bystander directly in the middle of the gunfight, the bullet will never hit them..also the bullets will only ricochet by a skill, no accident fire of bullets bouncing off objects and hitting someone..it seems that bullets physics are a forgotten technology since jagged alliance 2.. - characters items and money and cards don't carry on to the next chapter..this is a bit of an odd design choice..perhaps it's made to balance the game, but it seems useless to actually hoard inventory or money if they are going to be gone anyway.. - a save system mid-battle would be nice - there is a bug sometimes which makes the map screen goes blank..i had to restart the game to make it normal again  still..the game is quite fun for it's price so i can vote recommend..but its probably a 60%/40% percentage of recommend or not..",
            "review_score": "1"
        },
        {
            "review_text": "I like the gameplay, specifically the versatility, better than X-COM. The scenario plots are mildly interesting, but ultimately pretty ignorable. Being able to change weapons and 'classes'(via the playing card system) makes it much more engaging. The option to shoot through certain materials like windows and tents, and ricochet off of certain metal objects is a great addition The only thing missing is an overwatch-type function so some of my turns aren't entirely wasted. I got it on sale, but it is totally worth the $20. I'd recommend it over X-COM 2 in a heartbeat.",
            "review_score": "1"
        },
        {
            "review_text": "Barrage is life, barrage is love.",
            "review_score": "1"
        },
        {
            "review_text": "This was my first turn-based strategy game and it is amazing. Recommend for anyone who likes strategy.",
            "review_score": "1"
        },
        {
            "review_text": "Gave me a hard-on",
            "review_score": "1"
        },
        {
            "review_text": "Unique setting with good soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Do I think this game has a couple of flaws? Yes I do. Was I mildly dissapointed with the way the game ended? Hell yes. BUT do I think this game is 10-somehing hour of good time? Oh yes. Do I want more, now that I'm done with it? F-CK YES.",
            "review_score": "1"
        },
        {
            "review_text": "not my usual type of game, but i must say, this was so well excuted it has won me over.  gameplay seems pretty balanced, artwork &amp; visuals are well done. overall the game does a great job of creating the atmosphere   looking forward to a sequel or some more missions/chapters &amp; charachter lines to explore. im hooked!    at the moment the game Does not Scale properly to Support ultrawide resolutions/monitors. BUT! after posting about this on my review, one of the Developers reached out to let me know a fix is in the works! 11/22/15  12-1-15 - patch 1.2 is out &amp; the game is now scaling properly for ultrawide. and it sure does look purdy ;)",
            "review_score": "1"
        },
        {
            "review_text": "Plays like XCOM but has more charm. Shorter game play sessions. There is less depth but you won't even notice it.",
            "review_score": "1"
        },
        {
            "review_text": "love this game!",
            "review_score": "1"
        },
        {
            "review_text": "Apparently text must go here. The game is great but I am not going to bother pretending to be a journalist to tell you so.",
            "review_score": "1"
        },
        {
            "review_text": "FUN AT FIRST BUT GETS BORING AFTER A WHILE ",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Hard West is a fairly solid turn based tactical game. Wisely, it borrows a lot of strong ideas from XCOM, and the combat plays out pretty reasonably.  I didn't like the 'out-of-combat' part much; lots of times I was just speed clicking through story choices to get to the next fight. I didn't find any of the little mini-puzzles or games in the story section interesting.   Building and equipping your characters wasn't amazing. The cards were a reasonable idea, but there wasn't an enjoyable progression to them. Through each section of the campaign, you'd hope to find some of the strong abilities (eg. Shadow Salve, Shadow Kill, Golden Bullet, Cannibalism) but you didn't feel like you were training up a character or building something. You just kind of get what you get, and make a few reasonably clear choices about what to combo together (ie. put the luck generating item on the same guy you gave the ridiculous luck ability to) Their 'fixed story integration' setup meant you couldn't have the sort of control you do in XCOM, and I missed that part much more than I liked the story, which was sort of cheesy and repetitive (oh I'm selling my soul now? again? oh maybe that guy I'm selling my soul to is the DEVIL? WOO).   Lastly, the game could have used more variety in terms of weapons, abilities, enemies, and tactics (you did a lot of engage at distance, flank, repeat).  But... there isn't a bunch of good games in this space. Most of them are garbage. And this definitely isn't garbage. If you want something to hold you over to XCOM 2, this could be your game.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoying this game quite a bit, even though it's not a game I would normally try. I'm mostly RPG focused, but I've been a little disappointed in the recent offerings. Anyway, I like the tactics and the narration is top-notch. My rig is a bit dated, so I had to dial back a bit and I've still had some crashes, which I think is more on my end than the game itself. Some interesting choices story-wise (with consequences), so I would say it definitely has some replayability.  I would absolutely recommend ths game. Short review, I know, but I'm going back in...",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice mix of XCOM-like tactics and (mostly text-based) story. The 'talent-tree' via cards is also a nice thought. The UI still has some bugs (no text for ammo in some scenarios etc.), but nothing game-breaking. Also decently stable, even on Linux (about 1 crash per 5 hours).  My only gripe is that it's too short for the price. Other single-player games do about €/$0.50 per hour of gameplay, this costs double (I took my sweet time, and was through in 13h).",
            "review_score": "1"
        },
        {
            "review_text": "Hard West describes itself as “A Weird West Tactical with world map exploration, a hint of adventure and a drop of RPG.”Which is a pretty good description of this Turn Based Tactical shooter set in the 'Weird West'.  I found out about this game when I was watching a video on YouTube about 'The Most Under Appreciated Games of 2015' and I would have to agree this game is very under appreciated. I was able to buy it on sale on steam and I got every penny back 100 fold in hours of enjoyment.  Essentially, you play different 'scenarios' with different characters. In these 'scenarios' you explore the Hard West map making decisions and discoveries that can lead to big turn based gun battles. Through all of this a new story is told and as you play all the different 'scenarios' you come to understand how the Hard West became horrifically cursed and tainted with evil.   Overall, I loved it. It was unique, challenging and kept me playing. However, like all games it had a few things that could be better.   Keeping in theme with the game there is a lot good, some bad and a little ugly with Hard West, in my opinion and here it is:  THE GOOD: - Combat is solid, you sweat every turn and the AI is smart - Your decisions matter. Decisions you make in the world play can help or harm and really cant be reversed. In combat getting hit hurts and character deaths have impact. Also, you can not just save in order to re-load and avoid your mistakes -Luck Points are unique aspect of the game that make combat more nerve wracking and/or rewarding - Unique environment and style that is maintained through the whole game - Interesting (but simple) stories. 'Scenarios' feel like a module series in a classic pen and paper RPG - It does a good job of rewarding your for characters for selling their soul, the powers truly tempt you - While graphics are not 'cutting edge' the game art is great - Perks and weapons are fun to discover and use  The Bad: - While you really think about your choices in the World Map Exploration, it is a tad lacking and feels more like you are choosing your own adventure than making big strategic decisions - While the combat is solid, it can get redundant after you have played a few of the scenarios especially cause the characters can all use the same guns and perks - Stealth, is a little hard to grasp initially y and when you do understand it, it is kind of dumb  The Ugly: - When in the world map I would often have crashes when switching to my character inventory, this made me lose some weapons and perks. Which is frustrating considering you can not really save your game and you work hard for all your gear.  All in all, if you like tactical turn based games and you want a unique setting, I say get Hard West. Personally, I hope they make more Hard West games, I think there is lots more they could do with this world.  ",
            "review_score": "1"
        },
        {
            "review_text": "To be brief, I enjoyed the extra gameplay they've put in a turn based game like this. The worldmap missions are fun, not too long and not all the same. The core gameplay is solid and the maps are fun. Great work guys!",
            "review_score": "1"
        },
        {
            "review_text": "I got quite a few hours of enjoyment out of this. Not bad at $19.99, but a good value on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! The only way it should be played for its true effect is to select every mode for the episode. because there are NO SECOND CHANCES, in the real old west. xD",
            "review_score": "1"
        },
        {
            "review_text": "I love the Weird West as a genre and Hard West really, REALLY does it right. The turn-based strategy gameplay turned out to be a perfect fit even though I was skeptical about it at first.   This game really does just about everything right. I haven't broken into the DLC yet, but I will soon.  Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun game! Very similar to Expeditions: Conquistador (I'm guessing the same engine or developers). Turn based tactic for this is done very well and the strat view feels like a Choose Your Own Adventure book.  Pros: Interesting story tie ins Luck mechanic No Save Scumming Playing card buffs are fun to play with  Cons: Just when you get a character customized with interesting perks/weapons, the scenario is over Some of the UI screens tend to lag/hang a bit (when choosing cards/inventory) No Save Scumming  In all, buy this game (espeically if on sale) if you enjoy turn based or tactic games. I save scum at times in games like XCom/LongWar when I don't feel like a challenge, but I didn't mind that it wasn't included in this game.  ",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful graphics and fun gampley like XCOM. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I love strategical turn based shooters. I have played jagged alliance to death and also x-com. This game is good and can stand the comparision, but it's too short. I did the campaign on normal in 27 hrs playtime and since it got a pretty linear storyline I don't have that much reason to start over and do it again. I think that I should have gone for hard difficulty from the start since I really had to replay some of the stages max 2-3 times to win.   I'd really like to se a DLC for this game, and I would buy that without thinking twice about it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a hard core tactical, turnbased wild west adventure. Pretty dark story. It is quite challenging. Enjoying it so far, though I have only completed the first story.",
            "review_score": "1"
        },
        {
            "review_text": "Good value for the money if you like the turn based, tactical style of XCom, Wasteland 2 and the early Fallout games. Cool atmosphere in a Cthulhu like setting. Not overly difficult and while the variety of trinkets add superficial variety, in reality, like Wasteland2 you will only use a small handful that are perhaps overbalanced.",
            "review_score": "1"
        },
        {
            "review_text": "Turn-based RPG in the Wild West with a very dark story. You play several chapters and almost each time a different character, who in some way is involved into the main story. I really liked the voice acting, writing and gameplay. I hope they make a sequel :)",
            "review_score": "1"
        },
        {
            "review_text": "A fairly entertaining turn based tactical set in the Weird West. The poker hand system and wide range of gear adds quite a bit of variety to builds and the story is actually pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "It's like X-com, but with less aliens and base managment and more cannibalism and demon cowboys.",
            "review_score": "1"
        },
        {
            "review_text": "I do think this has excellent production values for the price range, and a lot of care &amp; imagination went in to it so all credit to the devs. There's just 3 things keeping me from giving it the thumb's up &amp; possibly from persisting with it:  * As others have said; the lack of a save system is a bit of a downer, especially as the battles can be long (and more than a bit tedious in the case of the lengthy stealth ones) and you're basically making uninformed 'story' decisions on the world map.  * It's a let-down to have no overwatch option (though all AI's do!), or defensive options of any kind - as others have said, a suicidal run-up-for-point-blank-shot by the AI basically trumps everything from a strategic point of view.  * I read up quite thoroughly before buying, but saw no mention of the campaign system; basically the game is split up into chapters that you can replay endlessly, and NOTHING you do persists between runs (except unlocking 3 signature items on a universal vendor from each chapter). Personally I found this massively disappointing, as it really removed any sense of role-playing and gravitas from the 'story' decisions you make; there's zero weight to ANYTHING you do (aside from triggering those 3 unlocks), so long as you can make it through the mandatory battles. This also (for me at least) detracts from the 'poker hand' system of character upgrade cards; you only get so many in a run-through - mostly random - so you can't count on any kind of synergy, and by the time you might assemble a 'hand' anyway you'll likely only get to play it for one battle then the chapter is over &amp; it's gone forever.",
            "review_score": "-1"
        },
        {
            "review_text": "As a veteran turn-based strategy gamer, I cannot recommend this game. It does have a number of positives, which I will enumerate at the end.  CRITICAL FLAWS -- Poor enemy AI -- The enemies seem to lack the ability to use any items other than their primary weapon. Your characters, in contrast, have two weapons a piece, and up to two usable items. This makes you a powerhouse compared to EVERYONE else. More troublesome is the terrible enemy AI. Turn-Based Strategy means that battles are meant to be tactical challenges. This is essentially a squad-based, tactics game. Enemies all act individually, but seem to lack the ability to work together. I realize that AI programming is complicated, but it is essential for a squad-based tactics game to be challeging. This game takes the cheap way out by simply increasing enemy firepower and decreasing your hp for higher difficulty settings. So, if you think that making the enemies tougher by giving them the power to one shot kill your characters makes the game tougher, then you would be correct. It doesn't make it more enjoyable. It simply turns the game into a squad-based puzzle game (avoid all shots). Not my cup of tea.   Big match up at the end of the main scenario line - over in just a couple rounds. I don't even think any of my characters were hit once.  -- Main Character restarts at each new chapter, so all items, injuries, fate cards, etc. are lost (this destroys the role playing element) -- I love rpg advancement because it allows attachment to the characters. Ex. My bounty hunter gets a mangled hand during a firefight. Now, with a mangled hand, he can't aim worth anything, so give him a sawed-off shotgun, sneak him in close, and it won't matter. This sort of thing makes characters develop and change over time - they gain character. In this game all rpg-esque advancements are reset between scenarios (a couple hours a piece). No character has any permanency. Think of it more as Commandos instead of X-Com.  -- Poor proofing &amp; crashes -- I only had a few actual crashes, though there were many lags &amp; slow down. For a while I had a game-breaking error that was caused by having a gamepad plugged in but not using it. (took a while to figure that one out) Fate abilities that I had placed on a character would mysteriously not be present in some combats, and other character would be completely rekitted within the same scenario. Just seemed to lack polish and playtesting.  -- Lack of explanation -- I still don't know what the defense statistic does, and there are less than 6 statistics per character. Perhaps it reduces the enemy chance to hit me. Perhaps it reduces my chance of receiving an injury when hit. Perhaps it increases the effective of cover for that character. Perhaps it provides a chance of decreasing incoming damage. It likely does one of those things. I shall never know which.  Making certain storyline advances in some scenarios prevent completion of side content (with no warning). Combined with the lack of ability to save and reload, it means that you make simply miss big chunks of content unless you want to restart the whole scenario from scratch.  Enemies have a radar-looking effect that appear near them if you walk too close. It means that they get a free shot on you. Given the 'closeness,' a hit is almost guaranteed. This was never brought up during the tutorial. I permanently lost one of my secondary characters in the first scenario when I 'discovered' this mechanic, and was a bit salty about it. Further it is a poor, jury-rigged mechanic to offset the lack of an overwatch mechanic. The jury-rigged nature of the mechanic is clear because it only applies to enemy characters (from what I could tell).  -- Poorly implemented mechanics -- This is mostly about 'heat' and 'daylight' vs. everything else. Heat is about how suspicious/dangerous your current weapons look. It has gameplay effect related to subduing enemies, but was otherwise largely ignored. There was the potential for prefight setups where you have to enter a guarded establishment and must adjust your kit to below a certain heat level to get it. Never happened in any scenario I played. It felt like heat was a mechanic that the developer had intended for much more, but then ran out of time/money to implement fully.  Daylight/Night had the same feel. There are ablilities that are 'stronger' in the shadow, but the difference is tactically insignificant. There is no option to allow your to plan an event during the day or night to get the effect of favorable lighting conditions. They simply are preset going into each encounter. Felt like it had potential that wasn't fully implemented.  CRITICAL SUCCESSES (the things they got right) -- Has a good flavor for the period/setting they try to create -- Lots of dialogue, old west movie style narration, and some graphical flourishes (ex. gunsmoke effect following shooting) all greatly aid immersion.  -- Basic combat mechanics are solid -- Cover based shooting, sight distances, fog of war, actions points, etc. All tried and true mechanics. No innovation here, but they apply them well to the setting (except for the poor AI noted above).  -- Music -- I thought that the music was well applied and thematically appropriate. Some will certainly find it repetitious, though.   OVERALL There are some fun things about this game, but the overall game lacks sufficient development to be a challenging, immersive experience.",
            "review_score": "-1"
        },
        {
            "review_text": "6/10  I bought the game because I love the turn based tactical genre.  The story is well narrated but rather cliche with a few added surprises here and there. Otherwise there is none or very little character development.  As far as tactics I just didn't buy it. Positioning is sometimes weird where you can't really find where to place your posse. This can be where you're always getting killed no matter where you try positioning your posse or finding an lmost bug like flaw where the AI keeps coming at you and you finished the scenario without taking one hit. The Luck system is weird. It just feels out of place. It is also your 'mana' for your special abilities. Then you get shot and you gain most of your luck back. I don't know how thaqt makes any sense. I guess it is to try and manage your health and luck but I just found it weird.  The range, type of weapon, single character positioning and some of the half cover and full cover aspects are pretty solid but as far as tactical multi character combat, it just wasn't there. I guess I would say that each character had their own tactic in each scenario and not really building combos or tactical advantages.  Losing a character and the scenario after killing most of the enemies because you left them exposed in a corridor where you were sure you had cleared became frustrating. Even after spending many turns scouting and taking people out. I would feel bad if I had known it was a stupid move on my part but most of these one shot one kill and your main character is dead came to me as complete surprises. It was hard to find the balance.   I lost interest midgame.  Good music, good sounds, good narration. The foundation for good base tactics wasn't there.  I really tried to like the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I just wanted to quickly mention that the core structure of this game is based off of a single player campaign in a family-tree style format. By this I mean, each chapter you progress through the family tree is ended abruptly. It really annoys me because all the time and effort you invest into any chapter is eventually dissolved because when you transition into the next chapter, it is like a fresh new game, (yes some are different character stories). All the weapons, items, leveled up, and bonus cards are removed. You repeat this cycle 7 or 8 times. After I got through 5, I'm like 'I'm ♥♥♥♥ing done.'   The gameplay is fun, mechanics are adequate, and the wild west theme is great. It just doesn't matter because it is all deleted when you finish the chapter.  Is this really an RPG Strategy game or an Arcade Strategy game. It feels more like the 2nd one. I wish I could get my money back because it was a massive disappointment.   I recommend that this game is worth $7.00-$10.00. NOT a $20.00 game.",
            "review_score": "-1"
        },
        {
            "review_text": "Lost all progress. Saves 'Dissapeared'. Big Rigs had better perfomance than these game. GG dev's. GG.",
            "review_score": "-1"
        },
        {
            "review_text": "too buggy on Linux, can't play",
            "review_score": "-1"
        },
        {
            "review_text": "The graphics and atmosphere are great, but it just has too many flaws to be enjoyed.  No proper controller support. You can use a controller, but the game is just not optmised for it.  No saving system. What if you havw to leave mid game?  No overwatch.  Outisde of the TB combats the game is actually quite bad. It's like a tedious and repetitive 'choose your own adventure'.  Poor performance.  No 10 foot UI or UI scaling for playing on your TV with a controller. Why would the devs add controller support if this game is not meant to be played on the couch? SPECIALLY when there is a LOT of reading involved.  This could have been a great game, but it seems they ran out of money, or spent too much budget on the art.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to like this game, but the way in which the game forces you into certain situations or paths just feels like I'm playing a game on rails. Sure you control combat within individual battles, but overall you are forced into situations to which you have zero control. Now granted, I only played two scenarios, but the game lost me after the second scenario (no spoilers).",
            "review_score": "-1"
        },
        {
            "review_text": "An interesting approach to turn-based strategy game. Unfortunatelly it tries to do so many things that all of them feel mediocre rather than having a few excelent features. The user interface is bad and clunky. It wouldn't be so bad if the game wasn't so damn slow. Play if you want a turn-based strategy game and finished all the other games from that category, otherwise there are better games.",
            "review_score": "-1"
        },
        {
            "review_text": "NOTE TO SELF:  No saving between levels - levels usually forty-five minutes long Waste of free game time.",
            "review_score": "-1"
        },
        {
            "review_text": "Cool story, mediocre gameplay once you figure it out.",
            "review_score": "-1"
        },
        {
            "review_text": "I should have followed my gut... when I see a Very Positive review I look for the negative views to understand their point of view. The main complaint was that the AI does suicide runs because they don't have to live past one round. They also get the advantage of reaction shots.  Now I am a big Xcom player been playing the series since terror of the deep, beat EU on Iron man. I can't even get past the first level of this game (5 tries). You are called to defend your house. 3 vs 7. 79% misses, one shot per turn and if you rush them 3 people come around the barn to shoot you point blank or if you stay in the house, they just burst through the house and shoot you point blank.  Unfortunately I brought through Green Man so my only hope now is a patch to fix this game. DO NOT BUY UNTIL A PATCH IS RELEASE*  *Yeah yeah I read the developer's comments, but we can only hope they change their mind.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game. Awesome tactic battle. Really enjoy all the scenarios and all the cool stuff you can do. Including running around, subdueing, and all sort of wild west gimmicks. I even enjoy the card system.  However, there's no save system in middle of the game. So you will lost 40+ minutes of progress.  Basically, auto-refund, even when it's such a great game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game had a lot of potentional but more or less squandered it all. For some reason they couldn't get the core combat gameplay down despite more or less copying it straight from the latest X-Com game. What we end up with is a game that has a ton of flaws, not only does it have game breaking bugs that can hinder your progress but it also has a lot of game mechanics that feels rushed and doesn't really provide much to the games appeal.  The biggest downfall might just be the whole structural layout of the game. It is made up of 8 scenarios which consist of a few battles each. Sadly nothing really carries over from scenario to scenario and it feels that as soon as you are making some progress it all starts over again.  This game could have been so much more and that is why it hurts so much to leave a bad review but with the choices the devs made I can't give it anymore than a 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "I backed this on kickstarter a looong time ago. Completely *not* worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "2 ambushed toons VS a town full of bandits = GAME OVER cus I can't undo my decision.  Who came up with such a design choice?? Either I succeed (after 50 retries, maybe) or its just GAME OVER.  NO going back..",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I bought the game with rather low expectations just because I wanted to try out a a storydriven western game with a decent plot and hopefully with same tactical and strategical challenge. Ultimately I found the plot lackluster with a paper thin supernatural mythos and gullible/evil characters you don't care about.   Combat is mediocre. It's too straightforward(no, overwatch for the player, cover fire etc.) and the AI tends to ♥♥♥♥ up a lot. I suspect the player character overwatch is missing because the AI wouldn't be able to handle it.  Between combat encounters you move on the map. Basically you just wander from place to place shooting people up and gathering resources. You can choose to do some optional side missions, hoard gold etc. but mostly its just rather dull and pointless since gold doesn't carry on nor is particularly limited resource there isn't a whole lot point to it.",
            "review_score": "-1"
        }
    ]
}