{
    "app_id": 307940,
    "name": "Radiation Island",
    "release_date": "2016-11-29",
    "developer": [
        "Atypical Games"
    ],
    "publisher": [
        "Atypical Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Indie"
    ],
    "achievements": 40,
    "positive_ratings": 265,
    "negative_ratings": 96,
    "price": 7.19,
    "description": "Radiation Island is a survival adventure game where you craft your own destiny in a huge open world environment. As part of the Philadelphia Experiment you have become stranded in a parallel, alternate reality. Discover this new and mysterious world, with all its surprises.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/307940/header.jpg?t=1481038636",
    "minimum_requirements": "OS: Windows XP/Vista/Win7/Win8 32/64 bit Processor: 1.5 GHz or better Memory: 1 GB RAM Graphics: NVIDIA GeForce 8 or higher, ATI X1600 or higher, Intel HD 3000 or higher Storage: 2000 MB available space Additional Notes: A video card with minimum OpenGL 3.2 driver is required.",
    "recommended_requirements": "OS: Windows XP/Vista/Win7/Win8 32/64 bit Processor: Dual-Core 2.0 GHz or better Memory: 4 GB RAM Graphics: NVIDIA GeForce 8 or higher, ATI X1600 or higher, Intel HD 3000 or higher Storage: 2000 MB available space",
    "reviews": [
        {
            "review_text": "I love survival games and it's rare to find a finished one, there are too many survival games that have been in alpha for 2 years or more and never get finished and end up being half arsed disapointments. And generally cost $15+ for a EA game that I wish I didn't buy.  Radiation Island is a rare finished survival game, I was surprised that it was only $3. The game is very good, I find it fun and enjoyable without it being overly difficult, I like that Iam given a choice with the difficulty lvl, adventurer the normal difficulty is perfect for me, though it gives the option of a harder difficulty or easy for those who just want to explore and not have to fight anything.  I love gathering, crafting and building, exploring, fighting zombies, animals and uncovering the story.  This game runs very well on my PC and it should considering I have a high end PC.  There's a few things that could be added or improved, such as even with a roof on your building it rains inside your house. It should not rain inside buildings, that is just strange. I see buildings that are in the game, built by the military or scientists have fences around them, but there is no option to be able to build fences yourself.  I highly reccomend the game if you like, building, exploring, survival and want to play a finished game. It's worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, better than most £40 games lol worth a lot more than £1.99 :)",
            "review_score": "1"
        },
        {
            "review_text": "Stumbled upon this game on steam... didnt expect much because of the price!!  WOW, WAS I SUPRISED!  The base building is super smooth and simple!  The crafting and gathering is extremely well balanced! The Enemy AI is hit and miss, some are dumb, but that causes you to lower your guard then you will run into one thats super aggressive and dangerous! VERY WELL OPTIMIZED  this game is worth WAY MORE than what they are asking, and I am shocked its not more popular!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I love the game! the story is fun and the puzzle will keep you busy. However I would like to see the building mechanics be a little more polished like when you put a stone floor down then put wooden walls the is a very noticeable gap, plus the grass goes through the floor. Now to anyone reading this don't let what I just said scare you into not buying the game, in fact, BUY IT NOW and tell your friends! the requirements are low and the game is cheap and is worth the money. Plus there will be mods soon enough to fix the issues if the developers don't. and if you know how to make mods PLEAS DO or want to learn how to a simple game like this is a great way to start building your skill and a name for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "This one took me by suprise. I put on on my follow/wishlist simply because I am a sucker for survival games. When I saw the price point my heart sank as I thought that this was just another one of those asset flip cash grabs. After reading some reviews I decided to give it a shot. I figured I would only be out $3.00.   This game completely suprised me. It is a lot more polished than what I expected for an inexpensive early access game. The physics and gameplay are solid. The story is interesting (reminds me of Lost).   Get this game. Support this good development behavior. We need more like this on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "The main selling point of the game is its price. The graphics are terrible, there are some bugs (doesn't affect gameplay), and the pathing of the hostiles are pretty crappy (zombies move in twitches is the main one). But for 3 bucks all these flaws are neglible. The game offered me a good 9 hours of gameplay and then the rest was pretty repetitive. The beginning when you're exploring and getting a hang of the game is the best part. Towards the middle when you have armor and find a gun, it's fun to explore dangerous territory and actually make progress in the story. The ending of the game is awfully boring though.The best equipment will be found in the middle game and in abundance, which makes the game pretty unbalanced in the end. I can't remember how many times I died in the first half of the game, and then all of a sudden I never died again. The ending was also a big disappointment. A big disappointment... But again, it's only 3 dollars for 9 hours of fun which is a pretty good ratio for a surivial game. I don't regret buying the game at all, I only wish they'd work on the ending a lot more.",
            "review_score": "1"
        }
    ]
}