{
    "app_id": 308330,
    "name": "Lost Chronicles of Zerzura",
    "release_date": "2014-07-10",
    "developer": [
        "Cranberry Production"
    ],
    "publisher": [
        "Viva Media"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 67,
    "negative_ratings": 15,
    "price": 6.99,
    "description": "When one brother is taken away by the Inquisition, the other must search for answers that will set his imprisoned sibling free. You’ll be quickly immersed in an extraordinary expedition, as you explore the ravishingly beautiful and detailed locations and solve a unique combination of puzzles, mini-games, and other challenges within the...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/308330/header.jpg?t=1447362370",
    "minimum_requirements": "OS: Windows® XP, Windows Vista®, Windows® 7, Windows® 8 Processor: 1.0 GHz Processor or faster Memory: 512 MB RAM Graphics: AGP/PCI-E Graphics card with : Shader Model 2, DirectX®9 compatible, - min. 128MB VRAM (ATI Radeon 9800 or NVidia GeForce 6800) /  Integrated (onboard)-graphics: Graphics with Shader Model 2,  DirectX®9-compatible, min. 128 MB VRAM  (Intel GMA x4500, ATI Mobility Radeon 9800 or NVIDIA GeForce Go 9800) DirectX: Version 9.0c Storage: 4 GB available space Sound Card: DirectX® compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "First impressions:  I've played for about 45 minutes so far.  (optional let's play footage)         YouTube™ Video:  Lost Chronicles Of Zerzura - Let's play&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Really good point and click game, lasted for hours, and hours. Nice graphics, reasonable story, good ending. ",
            "review_score": "1"
        },
        {
            "review_text": "The game is awsome and I like the story. Backgrounds and art elements are very nice and beautiful. Puzzles are good placed in story. The actors voice are great and the background sound are very good. I realy enjoy playing the game. my score is 5/5.",
            "review_score": "1"
        },
        {
            "review_text": "4 times crashed at 40 minutes",
            "review_score": "-1"
        }
    ]
}