{
    "app_id": 310070,
    "name": "The Nightmare Cooperative",
    "release_date": "2014-07-16",
    "developer": [
        "Lucky Frame"
    ],
    "publisher": [
        "Blazing Griffin"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Rogue-like"
    ],
    "achievements": 0,
    "positive_ratings": 56,
    "negative_ratings": 55,
    "price": 3.99,
    "description": "The Nightmare Cooperative is a fiendishly difficult turnbased roguelike featuring an array of characters, each with different powers to help you destroy monsters, escape levels, and collect gold.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/310070/header.jpg?t=1555064100",
    "minimum_requirements": "OS: XP Memory: 1 GB RAM Storage: 200 MB available space",
    "recommended_requirements": "OS: 7 Memory: 2 GB RAM Storage: 300 MB available space",
    "reviews": [
        {
            "review_text": "Take the addictiveness of 2048, throw it into a roguelike game, add some terrain, baddies, and environmental hazards and you have The Nightmare Cooperative. The game deviates from the standard roguelike path by adding more of a puzzle vibe. Like in 2048, you control your units by moving in one of four directions, all units move at the same time in the same direction each turn if able. Of course like any good dungeon crawler, there is no lack of enemies and other hazards to slash your way through or sneak around. The end result is some really fun gameplay that requires lots of foresight if you wish to make any real progress. It's simple to learn and easy to play nature notwithstanding, it offers a nice little challenge.",
            "review_score": "1"
        },
        {
            "review_text": "It seems like the combat is based on sheer luck, which discourages you from engaging in combat. I tried dodging every enemy in the dungeons, but that didn't work either and is not very fun.  The difficulty seems to come from pure luck, rather than skill. The game does not tell you or in any way indicate what you are doing is right or wrong; it feels like there is not much depth, and that I’ve seen all the game has to offer in the 20 minutes I played it.  I do not recommend this game if you are interested in a rogue-like that you can get better at and requires skill. Maybe mobile is a better platform for this? ",
            "review_score": "-1"
        },
        {
            "review_text": "I thought I was buying a graphically boring dungeon crawler, but I ended up getting a puzzle game...",
            "review_score": "-1"
        },
        {
            "review_text": "As we can see from the screeshots, the graphics doesn't hurt. The music and sounds aren't bad without being very interesting either.   Since the progression is not quantitative, it seems that we just have to repetively do the same thing, wich is starting a game after annother as we die. The number of death itself doesn't even show. In fact, except the inventory that shows the creatures we have met and vague info about them, there is nothing ressembling progression that we can see or feel in the game as it is right now.   So, I wouldn't recommend it for anything over $3.",
            "review_score": "-1"
        },
        {
            "review_text": "um what? This is more puzzle game than rougelike.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun and Interesting for a while.... and I got it cheap....  ....but it still left me wishing I had spent my money on something else.....   ....just like your Mom.   6/10 - Not a MILF",
            "review_score": "1"
        },
        {
            "review_text": "Was 1 minute short of a review and thought I would play it one minute more to say It's alright and that I just wouldn't recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Really simple, really great, really addictive. One of the best rougelikes I've played.",
            "review_score": "1"
        }
    ]
}