{
    "app_id": 310390,
    "name": "Advanced Tactics Gold",
    "release_date": "2014-08-15",
    "developer": [
        "VR Designs"
    ],
    "publisher": [
        "Slitherine Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Includes level editor"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Hex Grid"
    ],
    "achievements": 0,
    "positive_ratings": 72,
    "negative_ratings": 11,
    "price": 22.99,
    "description": "Advanced Tactics: Gold offers a unique and infinitely replayable wargaming experience for any strategy fan. Building off of the enormous success of Advanced Tactics: World War II, the Gold edition gives players a more powerful game editor, much improved random game engine, many new features and abilities, and more.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/310390/header.jpg?t=1478077937",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8, windows 10 Processor: 1.5 GHZ Processor Memory: 2 GB RAM Graphics: 8MB video memory Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Rewriting my review to ensure everyone would know how awesome the game is. Been playing with the Matrix Store version of the game prior to its steam release. I believe the game has been around for quite awhile now but it is only known to a few number of people. I was browsing the Matrix store a few years ago after hearing about Distant Worlds and I stumbled upon this gem.  The game is a wargame with a lot of mechanics like entrenchement, morale, supplies, etc. The game may not be the prettiest but it is appropriate for a game of its kind. The game looks like a hex-based boardgame with the unit counters on the tiles. The default units look like the actual units but for those who want something realistic then I would suggest getting the NATO counters mod for the game.  Advanced Tactics gold is made by the same person who made the Decisive Campaigns series for the PC. Advanced Tactics is a traditional wargame that sits in the sweet spot between beer and pretzel Panzer Generals to the complex mind-boggling simulation that is War in the East/Pacific. The game is easy to learn but hard to master. The game could be played like many traditional wargames where there are scenarios (I think it includes a WW2 scenario and some scenarios could be downloaded from the ATG site). The best feature of the game is the random map generator where you can tweak some options like expensive research or starting with only the most basic military tech and researching improved units. The randomly generated map could be tweaked from presets if you want more oceans (if you want more naval combat/invasions) or more land (simulate the eastern front) and a whole lot more. Playing random map generator sorts of lets you play the game as something like most 4x games where you have to uncover the maps and capture resource sites and build some fortifications, ports, factories, etc. The cities serve as important hexes that gives victory points. Capturing victory points would let you win the game.  The best part of this game is that you can't win by brute force. You have to put a lot of things in to consideration. So lets say you got the tech for the biggest tanks but these tanks uses a lot of fuel. A low fuel reserve might turn your tanks in to useless piece of scrap metal. So you are not protecting your supply lines? A well-placed paratrooper unit behind your lines would cut your supplies and weaken your forces. You got 100 rifle units and the enemy has only 50 SMG units well entrenched in a city? They will cut you to shreds! Oh you are laughing at that unit with only 15 rifles and 3 machineguns and you think your 50 rifle units could roflstomp them? Well I don't think so! Your oil reserves are dwindling and you want to move your artilleries around fast? Then you better get the horses to drag them!   Its things like this that make this game close to infinitely replayable as every game can turn out differently and you can choose whether to use air superiority, drop tons of troops more that what was paradropped during market garden or do an amphibious invasion that would put overlord to shame, then you have the option in this game! I paid around $50 for a digital copy of this game and I must say that I have no regrets! It is really worth it. It makes you think and does not ensure that you would just start to steamroll over your opponents once you get your advanced units. I will be bold to say that IMHO this is the best wargame ever!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best turn-based wargames of all time. Notable for having production, supply flow, and tech research - features that are more typical of RTS and Civ games. The core game engine is extremely powerful and flexible, such that there are mods for Roman Empire games, fantasy games, space opera games, and more.",
            "review_score": "1"
        },
        {
            "review_text": "Great sandbox strategy game that you can build your own scenarios. Have played this for years. Highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "A simple looking game but actually really deep and immersive. I really like the supply/logisitcs aspects as well as the development aspect of choosing what new units you want to aim for getting onto the battlefield next. The HQ aspect means you have to plan ahead, keep units close, etc. The random element to each map means replayability is high. Overall, a good wargame that serves as a good grounding for some of this developments teams newer games.",
            "review_score": "1"
        },
        {
            "review_text": "to all who think this game is not good, i have a phrase for you'never jugde a book by it's cover'. and it is worth evry penny you pay.   edit- and if you love this game i seggest you get matrix/siltih other awesome titles that are on steam.",
            "review_score": "1"
        }
    ]
}