{
    "app_id": 310790,
    "name": "Geometry Wars™ 3: Dimensions Evolved",
    "release_date": "2014-11-25",
    "developer": [
        "Lucid Games",
        "Aspyr (Mac & Linux)"
    ],
    "publisher": [
        "Sierra",
        "Activision",
        "Aspyr (Mac, Linux)"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Arcade",
        "Twin Stick Shooter"
    ],
    "achievements": 30,
    "positive_ratings": 910,
    "negative_ratings": 100,
    "price": 11.99,
    "description": "Experience the full evolution of the award-winning Geometry Wars franchise and battle through waves of enemies on 3D grids in this frenetic arcade shooter!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/310790/header.jpg?t=1545238152",
    "minimum_requirements": "OS: Windows 7 Processor: Intel® Core™ 2 Duo / AMD Athlon™ 64 X2 3800+ Memory: 2 GB RAM Graphics: NVIDIA® GeForce® 6800 GT @ 512MB / ATI® Radeon™ X1900XT @ 512MB or better DirectX: Version 10 Network: Broadband Internet connection Storage: 1 GB available space Sound Card: DirectX® Compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If small, brightly-colored, geometric shapes didn't haunt you in your sleep before, they will now.  Hands down one of my favorite arcade series of all time. Continues to impress with the latest addition.  Modes from Geometry Wars 2 are back along with the new Adventure, Co-op, and Versus modes. Even if you don't like the last three modes, the originals from Geometry Wars 2 still will be plenty. Mouse and keyboard controls feel great, but I would recommend a controller for this one. Background music is still wonderful.  10/10 would be scared of squares again.",
            "review_score": "1"
        },
        {
            "review_text": "Geometry Wars 3: Dimentions Evolved is possibly one of the best arcade style games to ever be produced.  I first played Geometry Wars on my Nintendo Wii a while back in Geometry Wars Galaxies- only to be immediately hooked onto the simple gameplay design and incredibly hard- yet, addictive gameplay- so naturally I went and looked for a more modern version of the game on my PC, and to be honest- even from the moment I set eyes upon this game- I knew I would love it.  I waited a very long time to get a good deal on it- this game rarely ever goes on sale for lower then 8 dollars. Fortunately I was able to get a key from GameStop PC for about $3.75. After playing the game, I almost feel like I robbed the game developers blind at that price.  Geometry Wars 3 is worth every penny of it's $15 pricetag, featuring over 10 varietions on the game modes of Geomtery Wars, each providing very different, very unique twists on the retro inspired Twin Stick shooter style of gameplay- and so many ways to experience each game mode through the addition of over 50 unique levels- the game really hits all the right notes for me.  Truthfully, this is another game where I simply love it so much- I can't help but think there's something hard-wired into my brain to like it. There must be some kind of bias here- but honstly- if looking at even a screenshot peaks your interest, pick this up. Don't wait on it either. It's an incredible game.",
            "review_score": "1"
        },
        {
            "review_text": "I picked this up off the back of 'Geometry Wars: Galaxies' being absolutley excellent (easily best in the series IMO). I'd say this *looks* better, but controls worse. When I lost in Galaxies, it was down to a mistake, I could do better. When I lose in Dimenions, roughly half the time it is because of camera angle or frustrating level angles/design and sometimes what feels like plain old dodgy hitbox. While I am enjoying it, it is far far more frustrating than previous games. If I were to try and sum up the overall issue, it say 'It's just less precise'.  All that being said, I'd still recomend it, though maybe at a discount time.",
            "review_score": "1"
        },
        {
            "review_text": "Rating 9.5/10 Overview: Twin Stick shooter   The Good:  + Simple yet colorful graphics  + This game features an insane amount of game modes.   + Variety of different levels, some levels take place on a flat surface, while others have you moving around a three-dimensional object. Some levels feature barriers, warp points, moving obstacles etc.   + Adventure mode allows you to equip different drones and powers to help you. Collecting gems allows you to upgrade them.   + Addicting gameplay  + Game has the “just one more time” feeling to it.   The Average:   Not so much a fault of the game but sometimes the game can become too chaotic and it becomes almost impossible to see where the enemies are.   I would have liked to see more graphical options and settings  Multiplayer is dead  Conclusion:  This is one of the best twin stick shooters on Steam. There is no shortage of ideas in this game and its just so fun to try out different combinations of drones and special abilities and to try and get top score.",
            "review_score": "1"
        },
        {
            "review_text": "10/10  I got so hooked into Geometry Wars when I first played Geometry Wars: Galaxies for Wii and DS and I became so into it that it would be the only game I would play for a couple of months. I also got Geometry Wars: Touch for iOS and spent ages trying to beat my high scores, and then I went back to Galaxies to get as far as possible with the best medals I could possibly get.  My friend got this and taunted me with it, and I was left wanting it for AGES, until I got Steam a couple of weeks ago. Then I soon bought this game and it met all my expectations: -Awesome graphics -Amazing music -Awesome levels -Easy to learn controls (only for those used to Geometry Wars or that have the ability to adapt to controls) -Replayable gameplay  I would SO recommend any player to get this game.",
            "review_score": "1"
        },
        {
            "review_text": "Way back when xbox was around I have the original Geometry Wars and loved it. When I saw it was on steam I got it at once. Geometry Wars 3: Dimensions is still as good as it was back then. I still love very bit of it. Its one of the best arcade games. Its lost a bit of the arcade feel by having levels instead of 'play till you die' But its still really fun. The neon graphics are beatiful!   One thing to not though is the controls are much better with a controler so if you have an xbox controler definatly use that",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play 10 coop levels again.",
            "review_score": "1"
        },
        {
            "review_text": "Was a big fan of the first 2 games and am now a big fan of Dimensions. The soundtrack once again is amazing! The chaos and carnage is still there and now with awesome boss fights!  Play with a controller/joystick of some sort. Keyboard and mouse does not work as well with this game. I use an Xbox 360 contoller with a PC adaptor and it's great!   ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, highly addictive, visually stunning. Runs great for me. If you liked the original GW then you'll love this!",
            "review_score": "1"
        },
        {
            "review_text": "Geometry Wars 2 is one of the best score attack, twin stick shooters ever made.  Geometry Wars 3 is just as good.",
            "review_score": "1"
        },
        {
            "review_text": "awesome awesome game, you have to be fast, you need good reflexes, and you destroy EVERYTHING along your path. Empty all your negative energy on this amazing beautiful geometry abstract universe with music that suits this genre.  Thank you for this game.. a new addiction",
            "review_score": "1"
        },
        {
            "review_text": "Best twin stick shooter hands down",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome.... But Why??  1. Excited theme 2. Nice retro music 3. Can spare your time to play this even 10 mins 4. Can play with your friends 5. Increase adrenaline running  This is AWESOME BUY ONE AND PLAY EITH ME ^^",
            "review_score": "1"
        },
        {
            "review_text": "Excellent arcade game. Easily 15 hours of satisfied game play make this worth the money. If you like arcade games, then this has fantastic replay value.",
            "review_score": "1"
        },
        {
            "review_text": "A huge suite of game modes allow Geometry wars 3 to surpass its console bound predecessor in every way. The gameplay retains the same exquisitely balanced and addictive gameplay that defined the series while fully fleshing out the campaign mode with 50+ levels. This game is truly spectacular in isolation but becomes something special with friends. Each high score begs for one more try, one more attempt to dethrone your friends on the leaderboards. This unending chase for top scores makes Geometry wars an instant classic and the best twin stick shooter on the pc.",
            "review_score": "1"
        },
        {
            "review_text": "Still the king of twin-stick shooters in my opinion. They added some new modes that are actually good, while the classic mode that people love is still there. Very striking neon graphics and a nice difficulty curve that allows you to build up some points fairly easily but ramps up to being so intense that your reaction time and thinking on the spot is greatly tested.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun game to kill some easy time. Various different modes and maps with lots of enemies which keeps the gameplay interesting and challenging. Combine that with nice audio and beautiful graphics and you get a stunning game like this. I tried to play with keyboard and mouse which isn't too tedious but I do prefer to use my controller since that's way easier.   I Highly suggest this game to people who want to complete challenges and high scores with their friends, or who just want a fun casual game to kill some time. And if you have a controller, the better!",
            "review_score": "1"
        },
        {
            "review_text": "This is literally the best twin stick shooter I have ever played in my entire life and I have spent a good portion of my life searching for decent twin stick shooters.",
            "review_score": "1"
        },
        {
            "review_text": "Fluid, collorful and addictive! Lots of replay value if you like to chase high score.   Note that for now you need to put the resolution in fullscreen-windowed mode to get 60 fps.",
            "review_score": "1"
        },
        {
            "review_text": "I just played the game for 8 hours straight. I think my wrists are broken. Send help.  But seriously if you liked the previous GW games then buy this right now.",
            "review_score": "1"
        },
        {
            "review_text": "Just as good, if not better than the classics",
            "review_score": "1"
        },
        {
            "review_text": "Like Geometry Wars? Love Geometry Wars: Retro Evolved? Get this. *pewpew*",
            "review_score": "1"
        },
        {
            "review_text": "I almost hanged myself when someone passed my rank. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Futher proof that the universe doesn't give a dam about how you feel.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, but makes my pc crash every time i close it.",
            "review_score": "-1"
        },
        {
            "review_text": "In this review I'm focusing on comparing this game between Geometry Wars 2 so this review for you - like me - had tons of fun with the second one and are trying to figure out if this one is worth a buy.  Why not compare to the first one? Because the second one was for me a direct follow up, improving the first one and not so many added features. This one should be approached as something completely different - mostly...  Geometry Wars 3: Dimension introduces 'dimensions', which is not as fun as it sounds. Instead of shooting these ♥♥♥♥♥♥♥ flying alien geometry-forms in a fenced rectangular area, you are doing the same but on 3D objects (/maps), sometimes a wavy format of the 'original' rectangular map.   Don't get me wrong here, the concept is good, but in practice this get annoying to say the least. Problems like visability is encountered constantly on many, if not all maps. MAINLY because the map must always be just big enough so it can fit your screen, which often leaves out 40% of the screen for a wallpaper. And i get that if you don't have the 'shape' of the map visible there would be problem to navigate. A fix to this could be to scale down everything on the map, but no, they have not even considered scaling anything down, maybe because of the PC-release with smaller monitors.  Except from this the theme of 'dimension' is within every inch of your screen from the moment you start the game which unfortunatly came in the way of the beautiful background on the second game and replaced it with a moving grid which is just one annoying thing that draws your attention away from the basic gameplay. You are (on every map i think) in this kind of pit or hole in the ground which is meant to reflect your impact on the surface of the map. I can go on for hours about these small details of theme-ruinment, but im not going to. Instead your getting a list of + and -  -The theme of the game penetrates and destroys even basic gameplay -Map layouts are mostly just a pain in the *** -Music is more unseemly  -Spawn of enemies is more than ever overlooked and difficult to handle  +Music is still good +You have and option for 'classic' gameplay on original maps +Online is an awesome feature +Local still kicks a**  Conclusion Is it better or worse? It's different Is it worth a buy if you liked the first and second one? Yes",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic sequel, great new game modes and geometries.  New game modes are fun and add complexity to the game, old game modes are still available though.  Graphics are excellent, rewarding light show as you blast the baddies.  No complaints, even the menu interface has a clean polished look.",
            "review_score": "1"
        },
        {
            "review_text": "I am a huge fan of the Geometry Wars saga, and I am so sad to say this game is not worth buying.  For $19.99 I was hoping to atleast be able to play the classic modes from Geo wars 2 multiplayer. (waves, king, pacifism, SEQUENCE????)  ",
            "review_score": "-1"
        },
        {
            "review_text": "A worthy sequel... to Geometry Wars Galaxies on the Wii, which really was the best one of these they ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Bought for multiplayer and it has lackluster multiplayer at best.  No choice of level or difficulty. No AI to play against. Nothing that would make multiplayer great.  It is pretty though so there's that.",
            "review_score": "-1"
        },
        {
            "review_text": "I have the mac version, running on a 27' 2010 iMac with Mavericks. The game crashes all the time, usually when I get a new high score or beat a level. I've given up playing it's so annoying. The game itself is really fun. I am sad! The developers are very uncommunicative. I have no idea if the crashing issue will be fixed. Until it is, I can't recommend the game to Mac users.",
            "review_score": "-1"
        },
        {
            "review_text": "i love it when the game works! give me my money back ♥♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "It's way to hard",
            "review_score": "-1"
        },
        {
            "review_text": "For me this game is unplayable becouse of steering delays. In this kind of game it is unacceptable. I bought it becouse I liked first one and had no problems with delays. Hope they will fix this soon. At the moment, is there way to get money back?",
            "review_score": "-1"
        },
        {
            "review_text": "Can't recommend this at the moment, as it crashes back to the desktop as soon as it tries to load.",
            "review_score": "-1"
        },
        {
            "review_text": "Geometry Wars 3: Dimensions",
            "review_score": "1"
        },
        {
            "review_text": "My one and only dislike about this game is that Sierra is not making a new Caesar game :@ :D This game is AWESOME!",
            "review_score": "1"
        },
        {
            "review_text": "The king of the twin stick shooter comes to PC.  This new version is in many ways a lot like GW2, a better and bigger single-player portion has been added with some interesting arena design.  Overall, it's more of the same, but that's what fans of the series really want anyway.   It's a bummer there isn't a mode without the geoms.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game! Having played the previous Geometry Wars games, this addition is a must have. The colorful particle effects are amazing as always and the new Adventure Mode adds a fun, objective-based campaign to the game. For those who simply want to experience the classic gameplay modes, those are available in this installation to the series, which includes my all time favorite gamemode: Evolved. The music is very fitting to the game's atmosphere and makes you feel very tense and in the heat of the action while playing. Last, but certaintly not least, the 3D effects and the dynamic stages add an excellent challenge to this wonderul title. Definitely worth the price, and indeed a must have retro shooter!",
            "review_score": "1"
        },
        {
            "review_text": "Super fun, very addicting. It takes everything good about Geometry Wars and adds even more.",
            "review_score": "1"
        },
        {
            "review_text": "I fear this game has dangerously warped my understanding of the word 'Pacifism'...",
            "review_score": "1"
        },
        {
            "review_text": "Didn't get 3k points to highscore, cry myself until i fell asleep.",
            "review_score": "1"
        },
        {
            "review_text": "Geometry Wars: Prepare To Die Edition.",
            "review_score": "1"
        },
        {
            "review_text": "I have to say, this is one of those games that you can get lost in quite easily. It's addictive, it's very well made, it's pretty and it's fast paced. This game is currently the best use of joystick in my library.",
            "review_score": "1"
        },
        {
            "review_text": "good, but the time to turn directions and the hitboxes are a pain, also the menus take forever to go through",
            "review_score": "1"
        },
        {
            "review_text": "tl;dr: Everything I liked about Geometry Wars 2: Retro Evolved, but better. [Except the soundtrack. It hasn't quite grown on me like GW2's. ;)]",
            "review_score": "1"
        },
        {
            "review_text": "So what Lucid Games did was that they took Geometry Wars: Retro Evolved 2, which is criminally not on Steam, threw those modes in with the structure of the Wii and DS exclusive Geometry Wars Galaxies, and mixed in some Super Stardust HD with spherical levels. If that sounds exciting to you, well, go buy this right now! It runs great on less capable machines (I have a Surface Pro and I can run it at 1080p on medium and get a VERY smooth framerate if not 60 fps), it supports the DualShock 4 out of the box, and it has Pacifism mode. Dual-stick shooter fans, this is a must-have.",
            "review_score": "1"
        },
        {
            "review_text": "I've played the first 2. Geometry Wars 2 was excellent. This one is even better. The classic modes in GW2 such as Pacifism and King are still there! Addictive gameplay chasing that ever rising global high score board. Awesome. 10/10. Your $15 will go a long way with this game. Best played with a controller.",
            "review_score": "1"
        },
        {
            "review_text": "This game keeps me coming back... at times it feels unfair but I still go back as it's fun and challenging. The graphics are great and smooth even on my i3 and lower end ATI 5450. Music is decent and adds to the mood of the gameplay.  They now revised the minimum star levels for the bosses and lowered the one star score level. I was finding the challenge of these frustrating but somewhat more rewarding although it's nice to not be stuck at a spot anymore.  Like the game so much, I just got the android version too... which is very impressive. Thanks!",
            "review_score": "1"
        },
        {
            "review_text": "Lots and lots of fun just like the original 2 games!  Brings lots of cool new features and of course 3D environments :D",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic sequel to one of my favorite Xbox Live Arcade games. This one offers more variation in level designs and additional drones to enhance the replayability of each level.  Might go against some of the purist geometry wars fans views with the new design (when I read the first review before buying I thought it sounded like they ruined it) but I firmly believe they have improved upon GW2 (bar removing Waves classic music and changing some of the music to maybe not as good but that is subjective) with some of the best level designs I have seen in this genre.  Truly addictive and very satisfying when you beat your high score, if you liked the last ones or like twin stick shooters this is a must for you.  highly recommended - 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A colorful, fun game that will challenge you but provide enough variety to keep you motivated. It's also the type of game that can keep your attention for 15 minutes if you don't feel like spending long stretches of time. The 3D aspect brings a lot of fun to the core gameplay, though some of the shapes can be a bit annoying and require you to be very careful. The powerups you can choose between aren't worth much since one or two of them are clearly far better than the others.",
            "review_score": "1"
        },
        {
            "review_text": "Quite possibly my favorite shooting game. Lots of interesting game modes, plenty of levels to keep you occupied, cool graphics... But best of all, it's a nice forgiving game with variable difficulty (depending on how much you care about high scores), which is something many shooters lack.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Geometry Wars 2, then you are going to love the third installment even more. The arcade adventure mode has dozens of levels (50 I think?), each unique in its own way. Think of them as 50 new modes to spend hours and hours on. Seriously, some of these levels will just mess with your head and have you restarting over and over again. They are very challenging, and even the most hardcore arcade gamers will be impressed. You thought playing on a plane was hard? Try a sphere. Also, all of the modes (pacifism, king of the hill, etc) from geometry wars 2 are present. It has local co-op and online play.  I do, however, recommend a game-pad, even though the mouse controls are good.  Honestly, this game has it all. Worth at least $30. What a steal.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommend this game. Hardcore twin stick shooter with a focus on highscores and a pretty sweet campaign mode. Hordes of evil geometry is chasing you, you have to dodge and destroy all of it! You can never master this highly skill-based game. Soundtrack is nice, and the graphics - although certainly not next-gen - are very enjoyable.  Biggest negative thing about I can say about this game is that the difficulty - in some of the game modes - builds up over time, meaning that you have to replay easier parts often instead of getting dropped straight into the real hardcore parts.  9/10  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is an incredibly addicting, mind warping, eye-bugging, frustrating, rewarding, and heart-racing time sucker that I am completely in love with. It's beautiful, well designed, and the game modes are all very well thought out. The only thing I would ask for is a random level generator to make it easier to mix up the game. Other than that, it's honestly the only game of its genre that I could recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Not sure what the appeal is, I find it incredibly boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Played this game for 2 days straight until I had completed (ignoring 1 mil Geoms) all the single player achievements. Amazing game and totally worth the price. Framerates do drop occasionally but nothing that affected the game drastically.",
            "review_score": "1"
        },
        {
            "review_text": "home sweet home. i played the first one. loved it i played the second. my xbox got ring of death. i am sad, no more geometry wars. i played the third and it felt like a wonderfull dream come true. it has everything from the previous one and much much much more. if you love waves or geometry wars or the Super Stardust HD from the ps3. you have to buy it you have to play it and ofc you have to love it",
            "review_score": "1"
        },
        {
            "review_text": "It's more Geometry Wars. If you liked either of the first two games, you'll like this. The classic modes are what you got in GW2 (assuming you had an XBox to play it on), minus Sequence (which I hated anyway). The new look serves the game very well. Still full of bright neon colors and lots of particles on enemy death.  The campaign mode is something I'm not super excited about, since I much prefer playing the game arcade-style, but I'll be damned if I'm not getting three stars on every single stage. So, I guess it works in that regard.  The one thing I am a little disappointed by is that the soundtrack this time around isn't quite as good as GW2, and the original Evolved theme is conspicuously absent from this game. That's not to say that the music isn't really good, because it is, but I thought the original Evolved theme suited the game mode so well.  Overall, I'm very happy that this game exists, and I'm definitely going to put an irresponsible amount of time into it after exams.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Geometry Wars 2, then you are going to love the third installment even more. The arcade adventure mode has dozens of levels (50 I think?), each unique in its own way. Think of them as 50 new modes to spend hours and hours on. Seriously, some of these levels will just mess with your head and have you restarting over and over again. They are very challenging, and even the most hardcore arcade gamers will be impressed. You thought playing on a plane was hard? Try a sphere. Also, all of the modes (pacifism, king of the hill, etc) from geometry wars 2 are present. It has local co-op and online play.  I do, however, recommend a game-pad, even though the mouse controls are good.  Honestly, this game has it all. Worth at least $30. What a steal.",
            "review_score": "1"
        },
        {
            "review_text": "If you like twin stick shooters, then you'll like this game. Period.  Pretty much the only thing I don't like about this game is the fact that level restart times aren't instant. Everything else is great.",
            "review_score": "1"
        },
        {
            "review_text": "PHD in Mathematics acquired, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "fun and sometimes frustrating",
            "review_score": "1"
        },
        {
            "review_text": "good controls, high variety of level design, bloodless shooting for when kids are around. lots of replayability for high scores and more stars. only critique is that some of the drones/supers seem weak, but that might be my lack of skill in using them.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, great graphics. Sountrack needs more tracks. DIfficulty pretty hard in some areas. I Kept dying because of the spawing of powerups that come in the shape of golden coins, they will kill you unless you shoot them. Needs more tracks for the sountrack only has like three songs in the entire game. I have no idea how someone could have missed that?  ",
            "review_score": "1"
        },
        {
            "review_text": "One of my most favorite games! This is not for the short tempered as you will die... a lot... like A LOT. Like wow.   The soundtrack is amazing and the insane ammount of levels will keep you busy for a while. I'd like to see a few more multiplayer games going on though as everytime I try to connect there are no games running and it's kinda sad to see so that would be nice.   It's also best played with a controller (just gives you a little more control over the ship than your keyboard and mouse would).  Overall great game! 11/10 E* for eyecandy.",
            "review_score": "1"
        },
        {
            "review_text": "A great fun game to pass the time doging obsticles, manuvering through unique maps, in the campaign bosses to face, also includes classic game modes. The multiplayer is dead though, unless you use something like gameranger to play on servers.",
            "review_score": "1"
        },
        {
            "review_text": "This is good but classic grid wars is better.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent 2 stick shooter with plenty of play modes and options so chances of replay are good. My criticisms are that the final bos in adventure mode is stupidly hard and the dimensions element of the game is under used so naming the game after it is a little miss leading. Most levels take place on a 2d plane. I still think Super Stardust HD is the high water mark for this genre but this a strong contender.",
            "review_score": "1"
        },
        {
            "review_text": "If you're epileptic or have a high risk of seizure when playing video games, I'd suggest you to avoid this game. But if you still want to play it, do it at your own risk.   As I indirectly mentioned above, this game is really colorful and has nice visual effects. Some maps are 2D, others are 3D (spherical or cubic for example), which may either save or kill you (2D maps will have walls, whilst 3D map will give both you and your enemies more mobility).   Despite its seemingly high difficulty at first, this game is really entertaining and you'll quickly get used to the small colored enemies hiding behind all those colors (trust me, I died more than once because of an enemy I didn't noticed because of the colorful game Geometry Wars is). Luckily, you get drones and level-bonus (temporary cannon bonus) to help yourself.   This game is also really light when it comes to requirement to be playable. You can easily borrow an old laptop and play a bit of Geometry Wars™ 3 if you're bored.   Note to achievement hunters : some achievements will really ♥♥♥♥ you off if you have no patience and not well-trained.",
            "review_score": "1"
        },
        {
            "review_text": "Very limited time with this but it's a really good take on Geometry Wars. Worth a punt in the sale!   Shame it seems to have died a death in terms of sales though :(",
            "review_score": "1"
        },
        {
            "review_text": "has the original in it",
            "review_score": "1"
        },
        {
            "review_text": "The more I play GW3, the more I like it. Like so many other games, learning the little things adds up. If you ever enjoyed GW Evolved this is a better version and well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Overall this game is as fun/addicting as the previous ones, so if you liked those, you'll like this. I first wasn't sure about the 3D aspect, but it's quite a nice twist, and it does include all the old modes (minus sequence) from the other games, should you decide you don't actually like the 3D.  One thing they seem to always do is blow the previous games out of the water in terms of content, and this definitely has a lot. You'll find half a million different game modes when playing through the adventure, each with their own enemy types too. I did however find myself not replaying the missions, since you get unlocks later on that make the game easier. I can see why they did it, but it felt wrong having to leave the mission sitting there with a low score.  The visuals are great, and if you've played any of the previous games you'll know what you're in for. The one thing that annoys me a little is that the wormholes looked so cool in GM2, and on here they're just a bit boring. Other than that though, I can't think of any other bad points, definitely worth a tenner.",
            "review_score": "1"
        },
        {
            "review_text": "Great twin stick shooter that is a lot of fun. There is a lot of content especially levels, modes, enemies, this is a steal on sale. Highly recommend this game it certainly has the quality of how a video game is suppose to be. It's a lot of fun, kill tons of enemies and use special abilities and drones and in-level super states that make the mayem so satisfying every time. Plenty of replayability this is one of the best games I've purchased in a while.",
            "review_score": "1"
        }
    ]
}