{
    "app_id": 310880,
    "name": "Basketball Pro Management 2015",
    "release_date": "2014-11-19",
    "developer": [
        "Umix Studios",
        "Cyanide Studio"
    ],
    "publisher": [
        "Bigben Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Simulation",
        "Sports",
        "Strategy"
    ],
    "tags": [
        "Sports",
        "Strategy",
        "Simulation"
    ],
    "achievements": 110,
    "positive_ratings": 24,
    "negative_ratings": 38,
    "price": 6.99,
    "description": "Basketball Pro Management is the ultimate basketball management simulation with a multitude of parameters. Each of your choices will have a direct influence on each game! NOW includes complete North American league system (recruitment, salary cap, luxury tax,...) .",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/310880/header.jpg?t=1539183329",
    "minimum_requirements": "OS: Win8 / Win 7 / Vista Processor: Intel Core 2 Quad, Intel Core i3, AMD Phenom, Athlon X4 Memory: 2 GB RAM Graphics: Intel HD Graphics 4000, Ati 5870, Nvidia Geforce 460 DirectX: Version 11 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I'm a huge fan of basketball and I love management sims like Football Manager so this was an easy buy for me. I have played it for about 10 hours now and I've reached the conclusion that though it is imperfect, it is an excellent sim. This is a game that should attract a fanatical following and the community (like in FM) should improve it by adding content such as new tactics.  Well done stuff:  Unbelievably they have all the exemptions (except the injured player exception) correct. You can balance out the play time and get advice from the coach. You will want to intervene here or the coach will try to play an older guy that is a star for 40+ minutes against even bad teams. You can add plays and call them. This works really well if you have a bad defending but fantastic 3 pt specialist. You can make sure he is on the perimiter, drive a player to the paint and toss the ball to one side of the court to draw off guards, and then funnel it to your player on the 3 point line. It works really well.  You'll want to change your database to the uploaded ones with real player names in them. It is uploaded by users to the forums.  Rough edges:   There are a few small player management issues such as number of players in the off-season. I get the impression that teams don't have strategies for tanking if they are already eliminated which helps rebuilding.  I'd like to be able to scout upcoming draft classes.  There are some calendar issues with the game (for when a trade can be made).  What it's not:  It's not NBA jam. You don't have an immersive gametime experience (when they are on the court). The graphics - even in 3d mode - do not compare to playstation etc. The focus of this game is what happens off the court (though you also have a part of the game for calling plays which you need to beat strong teams.)  Conclusion:  All in all it's a great game. I'm super-satisfied with my purchase. Right now it's 40% off so if you love the NBA and sims you should grab it.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game has great potential. But it's essentially half finished (as of the build in mid Dec 2014), and should actually be labeled as an early access game.  Buy it if you like the concept and want to support the development team. Otherwise, wait another year.",
            "review_score": "-1"
        },
        {
            "review_text": "I am enjoying this game takes some getting us to not like out of the park baseball I bought it on sale  I do love the 3d view of the game very fun if on sale do your research you might want to take a shot",
            "review_score": "1"
        }
    ]
}