{
    "app_id": 310810,
    "name": "Shiftlings",
    "release_date": "2015-03-03",
    "developer": [
        "Rock Pocket Games"
    ],
    "publisher": [
        "Sierra"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Co-op"
    ],
    "achievements": 29,
    "positive_ratings": 52,
    "negative_ratings": 18,
    "price": 10.99,
    "description": "The galaxy's biggest no-brainer!Control two adorably dim-witted alien space janitors on their quirky quest to repair the galaxy!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/310810/header.jpg?t=1447362463",
    "minimum_requirements": "OS: Windows 8, Windows 7 Processor: Intel Core 2 Duo E8200 2.66 GHz or AMD Athlon 64 X2 6000+ 3.0 GHz Memory: 1 GB RAM Graphics: Nvidia Geforce GTS 250 or AMD Radeon HD 3870 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 3 GB available space Sound Card: DirectX® 9.0c or later Additional Notes: Controller recommended for best experience.",
    "recommended_requirements": "OS: Windows 8, Windows 7 Processor: Intel Core 2 Duo E8200 2.66 GHz or AMD Athlon 64 X2 6000+ 3.0 GHz Memory: 2 GB RAM Graphics: Geforce GTS 450 or AMD Radeon HD 4770 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 3 GB available space Sound Card: DirectX® 9.0c or later Additional Notes: Controller recommended for best experience.",
    "reviews": [
        {
            "review_text": "Perfect family game. Lots of fun, must cooperate to solve the puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Really liked this game, would like a better reason why to collect the bottles other then getting the achievement, also the bonus speed run was amazing, wish this was a thing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is adorable, and is providing some surprisingly difficult timing, progression, and reflex puzzles.  Its a relatively simple concept; needing to control 2 inept alien maintenance workers, permanently connected by a tether hose to each other, with a forced size shifting, One must always be fwoomped up large with a weak jump ability, and the other small, more agile, and able to bounce off the head of it's puffed up partner. Switches move platforms and doors, blocks can be shoved around by the larger alien, instant-death traps are littered all over the 50+ levels and the level designs make excellent use of providing limitations for movement with a reasonable progression of difficulty as you learn new tricks to get around areas.  There's an interesting little meta story that goes along with your progression, allowing for an announcer to give commentary as you play through the levels... and there are times that gets a bit irritating, particularly if you're struggling through a difficult section where there'll be a quick quip every time you make a mistake and die, but overall it's pleasant enough.  As a solo-plyer game, you get to alternate control of each alien, or you can control both simultaneously, both following the same directions and jumping at the same time, and though that makes the timing tricky for some puzzles, its very workable. There is also the option to play co-op, and have each player control a single alien, which makes some things faster, but also more confusing.  Limited replayability for time-attacks or item collection (3 semi-hidden collections per level that you can go back at any time and try to grab if you miss them on the first run-through, They are all findable, but some will require some brain-work to snag), but it's a fairly reasonable length game if you're only planning on a single run-through.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        }
    ]
}