{
    "app_id": 311010,
    "name": "The Way",
    "release_date": "2016-05-20",
    "developer": [
        "Puzzling Dream"
    ],
    "publisher": [
        "PlayWay S.A."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Action"
    ],
    "achievements": 29,
    "positive_ratings": 606,
    "negative_ratings": 93,
    "price": 10.99,
    "description": "Journey to another planet and discover its secrets in order to bring your loved one back to life. Experience an adventure, inspired by old school classics like Another World, Heart of Darkness and Flashback.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/311010/header.jpg?t=1551111603",
    "minimum_requirements": "OS: Windows XP SP3 / Vista / 7 / 8 / 10 Processor: Intel Core 2 Duo or AMD equivalent Memory: 2048 MB RAM Graphics: GeForce 8600GT Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Well worth the wait. backed this game on kickstarter back in 2014 and the storyline and artwork had been buried in my mind since. My patience was rewarded 10x by the soundscore, charactor development and very interesting puzzles. game mechanics are very fluid and everything I could hope for from a 2D indie style platformer. Thanks Puzzling Dream for your dedication to completing this project and Playway for everything else. Im proud to have this in my library, (and to be in the credits)",
            "review_score": "1"
        },
        {
            "review_text": "  What would you do to revive a deceased loved one? Perhaps sneak into a high-security warehouse, steal a spacecraft, and traverse through the stars until you reach another planet? Or, would you fight aliens, robots, and even a bounty hunter? Maybe.....just maybe......you would solve puzzles! Oh, the horror!   The Breakdown",
            "review_score": "1"
        },
        {
            "review_text": "A lovingly crafted game which really takes me back to my childhood of playing such challenging platformers as Heart of Darkness. Beautiful pixel art, charming animations, a great soundtrack and thoughtful puzzles help to tell a simple but affecting story. It has it's quirks and can frustrate with difficulty but it rewards those willing to meet the challenge.   Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I’ve played this game before release as a KS backer and liked it a lot. It tells a touching story of a man obsessed with mending the results of a tragedy. The right atmosphere is created using the appropriate music and text description of objects (even the non-interactive ones). The game itself is an adventure with puzzles, some stealth, acrobatics and combat. All the parts feel very nice. Controls are tight (I'm playing with a gamepad), dangerous objects and ways around can be read just by looking at the screen. Puzzles require clues and objects manipulation and don't feel out of place. You get to test all the game mechanics with simple tasks before moving to more challenging parts of the adventure. And the games keeps juggling those mechanics just enough that you don’t feel lost or bored.",
            "review_score": "1"
        },
        {
            "review_text": "There are certainly some minor flaws with enemies being a little too unfair. And some puzzles feel like they shouldn't have been so needlessly complicated. But all in all, this game was fantastic! The writing was simple, yet effective. You grow attached to your character and his goal of saving his wife as you see (and experience) the danger, and the struggles he puts himself in. If puzzles are not your thing, than you probably don't want to try this one. However, if you're like me and have a ton of index cards and a pen at your desk, ready to draw, write, copy, and decode every last puzzle a game has to offer, this was made for you!  BTW Good luck trying finding a comprehensive walkthrough!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Puzzles. Good Story. Simple to tell you that this is an 5* Game!",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game akin to Another World and Oddworld. Beautiful art, excellent music and an emotional story make this puzzle adventure game an unforgettable experience.",
            "review_score": "1"
        },
        {
            "review_text": "A solid adventure game with some clever puzzles, but sometimes punishing platforming. The beauty of this game rests in the art, story and music. These elements create a great atmosphere that is a delight to be in. Most of the puzzles require logic, not clue hunting, which I really appreciated. I didn't appreciate the fact that once you had figured out how to solve a puzzle/problem, on occasion, it required precision accuracy and timing in order to proceed. This lead to frustration o'plenty. Good news is that this only happened a couple of times, but it was bad enough to make me quit for awhile. If you like this genre of game, it is definitely worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic! Excellent atmospheric music, wonderful gameplay with logical puzzles just this side of difficult and old school graphics which really add to the experience.  A game as all games should be - fun, rewarding, and challenging - I love it!",
            "review_score": "1"
        },
        {
            "review_text": "The Way is a puzzle platformer whose story deals with the themes of love and loss, and perhaps the resistance to loss some people display in its wake. Tom, the main character, is a recent widower who travels to an alien world in order to revive his wife.   The story is somwhat minimalistic in its telling. Quite a lot of the details are left unsaid, but what is unshared isn't really important. It's a story about what is happening now, not what has already happened. The puzzles are well crafted, with the hints needed to solve them usually nearby. You just have to keep your eyes open. The music is atmospheric and accompanies the game well. The sprite art is gorgeous.  That said, it is not without its flaws, though I feel they are thankfully few. Platforming is not the games strongpoint, with a few very demanding and unforgiving segments. I did play on keyboard though, so perhaps the digital nature of the keys hampered my ability to be more precise in my movements. The story raises one or two points that go unresolved. This isn't a huge deal, it just feels a bit odd.  Another thing I should mention is that the developers have been very attentive to feedback, adding improvements to the game based on community criticism. Originally there was no auto-run option, for example.",
            "review_score": "1"
        },
        {
            "review_text": "Summary: A really awesome game overall; the platforming isn't perfect, and you'll want to turn on autorun, but other than that it's pretty great.  Music: 6/10. Didn't really stand out to me, but it didn't hurt my ears either. Neutral.  Graphics: 10/10. Absolutely gorgeous artwork, creative environment design... perfect.  Gameplay: 8/10. Engaging and fun puzzles. The more action-y or platformer-y sequences do sometimes leave something to be desired, but they're mostly still solid too. The only majorly negative gameplay element is that your character's two speeds are 'Overly Casual Amble' and 'Wheeeeeeee!', which do not combine well with the Castlevania-esque jump physics. You get used to it though.  Story: 9/10. Ending wasn't the best, but other than that, it was a pretty awesome adventure story.  Overall: 9/10. This one is definitely a classic.",
            "review_score": "1"
        },
        {
            "review_text": "After nearly two years of waiting, The Way is finally available on Steam...and it does not disappoint!  The Way has does a great job of balancing of puzzles and action/adventure platforming elements. The puzzles and gameplay are challenging, but not in a frustrating way. The music is very well done and the backgrounds are beautifully crafted worlds!  Pros: Great pixel art Music compositions Good action/puzzle balance Story and adventure elements  Cons: The movement controls could be slightly smoother, but this is a minor critique  Conclusion: 4 out of 5 stars. The Way is a great platforming, action adventure game with a healthy dose of puzzle elements and an engaging story.",
            "review_score": "1"
        },
        {
            "review_text": "Great old school style pixel adventure. Bring a notebook for clues, becuase it's that type of party. As other reviewers stated: if you love Another World, you'll be at home here.",
            "review_score": "1"
        },
        {
            "review_text": "  This video features a non-biased quick look @ the game only:         YouTube™ Video:  ➜ A Quick Look @ The Way + 1 Steam Key to Giveaway! [1080p] [60FPS] [ENDED]&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I loved every second of this game, even the ones that frustrated me. The visuals, the story, the music... eveything is great.  A bit of advice, have a pen and paper with you. You won't be taking crazy amount of notes but it might help out with some of the puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "The way was an awesome game. The puzzles were perfectly balanced so that they were difficult but possible to figure out after thinking them over. There were very logical solutions to the puzzles not just random solutions you would never think of like some games have. The story was great,the graphics were legit, and the game play, powers, and creatures were amazing. If you don't have patience you may not like this game because you probably will die a lot and have to repeat certain tasks until you get them just right. I would give it a solid 4.6 out of five.  Pros Great graphics. Perfect puzzles. Cool powers. Sweet storyline. Crazy creatures. Good gameplay.  Cons Challenging( if that can be considered a con). Repetitous (expect to have to repeat some tasks) ",
            "review_score": "1"
        },
        {
            "review_text": "Are you a child of the 90s, and grew up loving Another World and Flashback? Then you'll probably love this, as did I.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing story with a great pixel art &amp; immersive soundtrack, that takes the best of games like 'Heart of Darkness', Amiga titles: 'Flashback' and 'Another World' or even SEGA's 'Aladdin'.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game, the puzzles are interesting and the story keeps you hooked until the end",
            "review_score": "1"
        },
        {
            "review_text": "Interesting idea and a beautiful artstyle, but done less well. Spoiler Free review, btw..  Anyone who has ever played Flashback or Another World will instantly think of these two games, and to some extent this game emulates the cinematic platformer style from those games. It doesn't do it very well, sadly.  I will say, that the idea behind the abilities you have in the game is good, even if it often fails to be as good as it could be.  It is hard to go too much into detail without spoiling the game, so I will just go over the things that eventually made me not want to play any more (in ascending order of annoyance):   Autosave:  95% of the time the autosave kicks correctly in just before dangerous places, where you most likely will die. The last 5% of the time it saves somewhere far far away from what you are doing beacuse it was triggered by you passing a point it wants to save at and all the danger save spots, which are often one-time save spots, are gone.    Puzzle objective:  Often you need to do something very specific to get past an obstacle. In the player's mind there might be myriad of different ways to bypass the problem you are faced with, but since this is a linear game, you need to figure out what the developer wants you to do and that is sometimes very convoluted. Not a big problem, but can be a bit frustrating.   Puzzles breaking immersion:  It starts out with a story that moves you through interesting puzzles that are a natural part of the world (like security you have to get past when trespassing) and then quickly devolves into puzzles that just feel forced into the setting without it making any sense for the puzzle to be there. It detracts from the story and the world and makes it feel much less like a game and more like a flimsy frame for the puzzles.   Puzzle feedback:  Some puzzles rely heavily on you understanding what you are doing and how you are interacting with the them. Yet the game often forgets that what is immediately obvious once you figure it out is frustratingly hard to understand if you don't get any feedback from the game when you try the logical solution and something makes it fail.   Puzzle design:  Some puzzles have you doing things in one area while the info you need or the reaction to your actions is somewhere far away on the other side of a horde of things that can kill you or just takes a lot of time to get past (falls/enemies/slow climbing/traps/etc.). Some puzzles have you do a lot of things that require that you study an area you can only see in short glimpses unless you (like me) take screenshots. It makes interesting puzzles, that could be fun into colossal time wasters which are frustrating to no end. One puzzle I solved by going through all permutations of possible solutions simply because it would take me more time to go check on the outcome of my actions than just laboriously go through all possible solutions.   Platformer parts:  This is what finally broke the camel's back for me. There are soooo many parts where you have to traverse long insta-death platformer parts with spikes and falls and things like it. Could be a nice part of the game, but the controls are very imprecise and the physics of the game are strange (Ex: while sliding down an incline you cannot change your speed when you are touching the incline, but you can stop all horisontal movement or speed it up a bit if you jump and use the sideways movement buttons while in the air. It makes no sense). Tiny spikes about 30 cm below you -- can't step down slowly and just walk slowly through them (you can move through them if you stand next to them), you have to jump high up into the air and try to land in that one tiny spot where your character has about 2-3 pixels leeway on both sides or you die.   Conclusion:  I wanted to like this game. No, I wanted to love it. It just has too many frustrating parts.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros, Loving that art style, story seems pretty interesting so far, fairly simple controls for stuff.  Cons, and fairly annoying ones when combined: Platforming can be a pain in the rear compounded with a lack of properly spaced checkpoints, climing up long ladders every time you die is really annoying, and when you go through half the sequence of a challenge and die to a platforming mistake and have to do the whole thing over again it makes me want to ragequit... which I have. If the dev could fix the latter problem and simply add more checkpoints this would be really good.  Overall? It's ok, but the latter issues make playing through what should otherwise be an amazing experience into an annoying slog and chore. If Dev fixes at least one of these issues (the latter being the easiest) then I will recommend.",
            "review_score": "-1"
        }
    ]
}