{
    "app_id": 311040,
    "name": "Rulers of Nations",
    "release_date": "2014-07-16",
    "developer": [
        "Eversim"
    ],
    "publisher": [
        "Eversim"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Politics"
    ],
    "achievements": 0,
    "positive_ratings": 63,
    "negative_ratings": 74,
    "price": 14.99,
    "description": "Will you become the greatest Head of State ?Play one of the powerful rulers of a nation! . Slip into the shoes of the President of the U.S., or the leader of China, Russia, United Kingdom, or other countries. Expand your influence on the world stage.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/311040/header.jpg?t=1453850548",
    "minimum_requirements": "最低配置: 操作系统: Windows 10, 8, 7, VISTA, XP 处理器: 1.6 GHz 内存: 2 GB RAM 图形: any card compatible with DirectX DirectX 版本: 9.0c 存储空间: 需要 2 GB 可用空间",
    "recommended_requirements": "推荐配置: 操作系统: Windows 10, 8, 7, VISTA, XP 处理器: 2 GHz 内存: 4 GB RAM 图形: Nividia or AMD with 512 Mb ram DirectX 版本: 9.0c",
    "reviews": [
        {
            "review_text": "Garbage. The game is buggy as hell.  No word from the developers as to how to fix this game. Asked for a refund, they basically said tough ♥♥♥♥.  Extremely poor quality for the extortionate price.  No one, and I mean NO ONE buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Atrociously made, there are so many illogical design choices that make this game soooo not a geo-political simulator... for example... people get upset about demostrations against the governenments people friendly policies???? Wut?  This game is a ♥♥♥♥-stain on the word similulator! DO NOT BUY EVEN AS A JOKE!",
            "review_score": "-1"
        },
        {
            "review_text": "This game has its perks and is mildly entertaining but overall, it is very annoying. You rarely know what's actually going on. Your advisors are useless and you'll notice people rioting/demonstrating and it doesn't tell you why. There also seem to be some bugs such as advisors telling me the stock market crashed and the graphs show it actually increasing. Budget forecasts don't update sometimes even though I know it has changed. This game could have been great. Tried Masters of the World and it's hardly any better. Don't waste the money.",
            "review_score": "-1"
        },
        {
            "review_text": "if you have Xvid try it see if it works i have xvid but no dice its so buggy! crashes like it was programmed to do so so whats the point of me trying? the only thing that lets me continue is the save!so once more have xvid try it dont have xvid just leave it tha heck alone...",
            "review_score": "-1"
        },
        {
            "review_text": "this game is so frustrating, it looks like it would be a fanstastic game, with the amount of options at your disposal. but every time you click on something, you risk a CTD. i tried to play it three times in a row, no time could I keep it open longer than 15 min. and I would crash. This needs to be fixed asap.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is terrible you can not run a country for less then 15 minutes without having rioting and massive demonstrations and once i noticed a bug to said 62,000 cars were set on fire i mean WTF! and the Ai is pretty dumb when you launch attack on them they dont really respond except for halting diplomatic dialogue and no major military reponse. And then when your military says they are on your side they dipose you! KEEP AWAY FROM THIS ♥♥♥♥♥♥ MESS!",
            "review_score": "-1"
        },
        {
            "review_text": "the game isn't worth it ",
            "review_score": "-1"
        }
    ]
}