{
    "app_id": 311140,
    "name": "The Stalin Subway",
    "release_date": "2014-09-19",
    "developer": [
        "Orion Games"
    ],
    "publisher": [
        "Buka Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "Singleplayer"
    ],
    "achievements": 0,
    "positive_ratings": 199,
    "negative_ratings": 169,
    "price": 2.79,
    "description": "&quot;The Stalin Subway&quot; is a First Person Shooter-style game where the events take place in post-war Moscow. The game allows to plunge into the depressing atmosphere of the Stalin's period and to play as a Soviet officer.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/311140/header.jpg?t=1524559572",
    "minimum_requirements": "Минимальные: ОС: Windows 98/XP/7/8 Процессор: 2.0 GHz processor Оперативная память: 512 MB ОЗУ Видеокарта: DirectX compatible 128 MB Место на диске: 4 GB",
    "recommended_requirements": "Рекомендованные: ОС: Windows 98/XP/7/8 Процессор: Pentium 4/Athlon XP 3.2 MHz or more Оперативная память: 1024 MB ОЗУ Видеокарта: DirectX compatible 256 MB Место на диске: 4 GB",
    "reviews": [
        {
            "review_text": " Warning: install the patch  here  [orion-mm.ru]  or the game will not work.   Extract the files into the main game folder and overwrite when asked.   There also exists an  improvement mod  to tweak the firing sounds of the weapons and improve the translation but it's fairly obscure and I have not personally tried it. Notably it also changes some of the music used in game.  The Stalin Subway is a slightly wonky mid-2000s shooter that still manages to be reasonably entertaining due to an under-represented setting and a fair bit of heart. The stereotype of the under-polished slavic game holds true with this one and the voice acting/translation is so bad it starts to get good.  The soundtrack is mostly generic but occasionally somewhat catchy when it actually ♥♥♥♥ing plays. The menu theme and the first level theme (actually a modern version of a fairly well known Cold War era song) particularly stand out.  There was a degree of thought put into the weapons used in the game. They both fit the time period and those of the same calibre  actually share the same ammo pool  which is a nice touch. The rifles did feel a little underpowered but the rest were fine. Additional features absent from modern AAA shooters like destructible objects and ricochets from missed shots (which can actually hit NPCs or even youself on occasion) were unexpected in such a budget title but also welcome.  Probably worth the price asked and certainly worth picking up on sale it gives 6 hours or so of mildly confusing entertainment. Some degree of challenge can be had if you put it on hard though this will depend on player skill. Bunny-hopping is recommended due to the slow walking speed.   Avoid the sequel (Red Veil) like the plague. You have been warned.",
            "review_score": "1"
        },
        {
            "review_text": "pretty good",
            "review_score": "1"
        },
        {
            "review_text": "The Stalin Subway is an FPS game set in Moscow, Russia where your protagonist named Gleb must find his father and figure out how to foil the bad guys (conspirators) plan to    blow up Moscow, Russia with an atomic bomb   . Gleb must venture through many environments in Moscow, Russia while fighting a bunch of KGB soldiers trying to kill Gleb. Gleb will also meet a few other characters on his adventure through Moscow, Russia. To be honest with you guys, once you fix and patch up the game, this game isn't terrible. The only time this game was a little blah were the character animations and the cutscene dialogue. During the cutscene dialogue, the character(s) dialogue goes a little out of sync and the lip movements of the character(s) are a little bit off. All in all this game is great if you're into FPS games and outdated graphics. I highly recommend this game if you're into FPS games and oudated graphics (well NOT that outdated but a little bit).",
            "review_score": "1"
        },
        {
            "review_text": "You don't see many games set in Stalinist Russia, but the underutilized setting doesn't make up for the fact that The Stalin Subway is pretty bad. If you can even run it, you'll be treated to a mess of a game that can be described as Half-Life: Cheeki Breeki. It's fun if you enjoy laughing at bad games, at least.  What sets it apart from all the other junk on Steam is that it was apparently ( apparently ) made by professional developers, and that it was released on the platform in 2014, two years after Steam Greenlight but a little before it really started to stink the storefront up.  The only consolations are that it has trading cards for some reason, there are patches available to make it run better than a turtle flipped on its shell - and that its sequel Red Veil, also on Steam, is even worse. Buy them if you're a masochist. You know, like me.  Incidentally, this is yet another reason I'd like to see a 'mixed' option for Steam reviews. Stalin Subway merits a thumbs up if you're a bad game connoisseur like  moi , but a thumbs down for almost anyone else who isn't chronically bored and/or addicted to the FPS genre.",
            "review_score": "-1"
        },
        {
            "review_text": "really poorly animated game, opening the menu would take years, poorly optimized, just don't buy it",
            "review_score": "-1"
        },
        {
            "review_text": "I got in game once, I hit EXC to edit some video settings, and it crashed. Best 99 cents ive ever spent.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good if you can stand the long load times.",
            "review_score": "1"
        },
        {
            "review_text": "Stay far far away from The Stalin Subway. Its a terrible shooter, the graphics are bad even for its released ate. The loading times are atrocious. Oh and if you die you'll have to restart the game, as the loading a save often causes the game to freeze. Not even 'funny' bad, just bad bad.",
            "review_score": "-1"
        },
        {
            "review_text": "It's bad, cheap trash.   Some annoying bugs.   The combat could have been better if the crosshair wasn't so incredibly distracting and there's no option to change it. It's this giant thick cicle around a tiny intersection of lines that don't actually indicate the true shot position. it's somewhere below these markings, but it just makes aiming incredibly annoying. I only found out by shooting a wall to see where the hell the center was. I thought the guns just had horrible accuracy or something but they have perfect accuracy if you know where the point is. Still it's just the most ridiculously designed crosshair I've ever seen. It must have been designed by a committe  Nice gun models.   I wouldn't recommend this to anyone who isn't just really curious about cheap trash video games.   I didn't expect much different than I got what with the 46% positive review score for this game.   So, I'm not going to recommend this game for anyone looking for a good game to play. But only for people who are looking to try out whatever.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad coding, bad music, bad story, bad controls, this game ♥♥♥♥ing sucks. 0/10 would not recommend. BURN THIS GAME.",
            "review_score": "-1"
        },
        {
            "review_text": "I got 23 hours of gameplay from this title. Not a bad budget shooter for $1.35",
            "review_score": "1"
        },
        {
            "review_text": "  The Stalin Subway is a decent small shooter game in which you attempt to save Russia by killing bad guys.  Ok so, overall this is a decent game which can get you some casual fun and all that. Level design isn't great, it has some bugs and I had to download a fix to be able to play the game but it was worth it.  My advice is to buy it on a sale because you're probably gonna get bored of it soon.",
            "review_score": "1"
        }
    ]
}