{
    "app_id": 311480,
    "name": "Vertical Drop Heroes HD",
    "release_date": "2014-07-25",
    "developer": [
        "Nerdook Productions"
    ],
    "publisher": [
        "Digerati Distribution"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Partial Controller Support",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Rogue-like"
    ],
    "achievements": 30,
    "positive_ratings": 569,
    "negative_ratings": 123,
    "price": 4.99,
    "description": "Vertical Drop Heroes is a procedural platformer RPG hybrid with roguelike elements, where your hero adventures through randomly generated stages. Armed with a variety of skills and traits, you must use your cunning and reflexes to survive the dangers of each stage.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/311480/header.jpg?t=1480392006",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: Processor 2 GHz (Dual Core) Memory: 256 MB RAM Graphics: OpenGL 2.1 compatible 3D graphics card with 256 MB VRAM DirectX: Version 9.0c Storage: 40 MB available space Sound Card: DirectX 9.0c compatible sound card Additional Notes: Support for Xbox controllers",
    "recommended_requirements": "OS: Windows Vista / 7 / 8 Processor: Processor 2 GHz (Dual Core) Memory: 512 MB RAM Graphics: OpenGL 2.1 compatible 3D graphics card with 512 MB VRAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 40 MB available space Sound Card: DirectX 9.0c compatible sound card Additional Notes: Support for Xbox controllers",
    "reviews": [
        {
            "review_text": "+ Replayabilty + Unlockables + Random characters + perks similar to Rogue Legacy + Mini side missions + Destructible terrain  - Movement feels a bit slow sometimes, not sure if it's the gameplay or the framerate - Becomes a bit too hectic in the later levels  [Rating: 82/100]",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a must buy for all Rogue and Spelunky lovers.  You start with a hero and fight your way to the next level. On your way you can collect coins, free heroes to help you, activate shrines and unlock a lot of abilities and passives. After your hero dies, it starts all over. The ability to upgrade the stats of further heroes (permanently) makes the game addicting and replayable though.   Even if you beat the game, there will be a new mode, where you get three times the amount of your abilities and the mobs are much stronger. Fight your way down and beat the high-score of everyone!",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, this game is a coffe-break title, like Rogue Legacy you can do one run in a matter of minutes (because you die)... but then you see how addicting this game is and sucks you in. Beware, this game is an addiction starter!",
            "review_score": "1"
        },
        {
            "review_text": "If what you're used to is the flash game, you'll find a lot of things different here. I was surprised, but I also ended up liking what I found. It's a much more complex game now, while still keeping the fun and speed of the original.  The big difference is the relationship between your character and the trapped heroes. Freeing a hero from their cage doesn't transform your player character into that hero, but instead releases the hero into the game world to fight alongside you as a friendly NPC. Luckily, your player character is no longer the powerless vanilla jump-man from the original either. In a system that, yes, is a lot like Rogue Legacy's, you start each game choosing from a trio of characters generated with different statistics, traits and equipment. You can unlock new character options through achievements and in-game merchants.  My main complaint about this new system is that the AI heroes can sometimes be quite unhelpful, particularly the paladin breaking blocks you'd rather leave intact and the archer, who lacks mobility-based powers, getting stuck and being unable to contribute to the battle. AI heroes can also trigger alarms, though this never felt too obtrusive or unfair.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. In this game, it is the time of prophecy. The thing about prophecies, are that everyone thinks that it is about THEM. You take place of a variety of these heroes who tried and will fail. You also play as one hero who is actually the chosen one.   This is a rogue-like towercrawl, trying to get to the lowest point of each tower to defeat the boss. You unlock traits, spells, and weapons as you go, which can be used in other characters. The combat is fun, but falls under the mmo problem of 'spam attack, use your hotkeys for spells.' That is not necessarily a bad thing, but if desire deep combat, know that it isn't here.  The biggest flaw of the game I notice is that the graphics themselves are very mobile-esque. The game does not handle like a mobile game though, and is actually rather fun.",
            "review_score": "1"
        },
        {
            "review_text": "Randomly generated levels that is fun as you die and progress at the same time.   It's 1 life per game though, so your characters are always different but you get stronger everytime you progress in your previous life.   Great little game to waste time when downloading something.  ",
            "review_score": "1"
        },
        {
            "review_text": "This is a randomized action game where your goal is to drop to the bottom of each level - combat is basically just touching enemies, although you have some special abilities too. It doesn't sound like much, but it is strangely addictive - I've put at least eight hours into it before I finally beat the boss for the first time, and it's the kind of game you can very easily go back and replay (not counting the new game plus option). It's got a lot of Rogue Legacy in it, and it just all works very well. It's even got a Pacifist goal and rewards for avoiding the enemies (which is harder than it sounds). If you like Rogue Legacy and Spelunky, this should suit you perfectly.",
            "review_score": "1"
        },
        {
            "review_text": "when i started i had my doubts, but its actually pretty fun",
            "review_score": "1"
        },
        {
            "review_text": "[Summary] (Summary first for clarity and people who don't want to read a lot) Over all a quite bad game. It would be ok as a flash game to kill an hour or two but not worth buying. The only redeeming quality is the local co-op, but the game still has fundamental issues with their design.  [Combat] Very repetative and dull combat. Hitting someone isn't an issue of hitting them with you weapon but more of them being in front of you when you strike (as in the weapon never connects). Every battle is composed of hitting the opponent then stepping back quickly so you can go in and stab them again (with slight variation if you still have your spell left to use).  [Store system] You can buy two things that makes you stronger. More damage and more health. You can also purchase an upgrade for the passive coins on the maps (they are worth experience and gold, they disappear when an enemy is killed).  Spread out through the map are merchants selling a single ability each. These will then be shuffled into your random spells for your new generations. Most of these purchases are regretted as there is no way to confirm if an ability is good until you purchase it and use it.  The store system is over all very underwhelming and it feels like the store system was added last minute to balance the fact that levels only get harder because the monsters have more health and hit harder.  [Level design] Throw in random blocks in a maze where you navigate to the bottom where the boss is. Add prisoners (that help you if you let them out) and treasures. Plus a quest per level that is either find Y of X or kill Z and come back to me. The map is not designed so that you can travel upwards, to combat this there are teleporters that bring your to the beginning spread out across the map.  You start from level 1 and progress upwards. Some levels have the ability to pay gold so that you can teleport there instantly (for a negligible price) in new generations. Monster design is pretty limited, the higher level the map is the harder the monsters hit. They look different and sometimes they might be ranged but all in all this doesn't change much.  [Stability] Crashed only once every 30-45 minutes and never in a way that progress was lost. Starting the game is quick and easy through Steam Big Picture Mode so this was more of a nuisance than a problem.",
            "review_score": "-1"
        },
        {
            "review_text": "The HALLOWEEN edition is OUTSTANDINGLY SPOOOOOKY! I love it! Could play it forever! Great names, great weapons, awesome level ups! As long as the Halloween Edition is always available I Recommend this game. Thanks!",
            "review_score": "1"
        },
        {
            "review_text": "Vertical Drop Heroes is a game that you can sink hours into and never fully finish it. As a rogue platformer, it isn't the best, but it is amazing. But combine it with a permadeth RPG type game and it's a cross between Risk of Rain and going down. Just down.    No seriously. You'll be going down the whole game. Just down. Vertically. Down.",
            "review_score": "1"
        },
        {
            "review_text": "if you have a son 4+years old - he will love it!",
            "review_score": "1"
        },
        {
            "review_text": "Vertical Drop is addictive. With a myraid of different class, skill and talent combinations that can be rolled each game. Every playthrough has a slightly different playstyle that keeps things fresh. e.g. a Dagger hero can go solely for backstab damage which keeps the pacifism status throughout the stage, Shotgun heroes only have a very limited amount of ammo per round which once squandered. you're screwed. I particularly like the Staff hero with the Sand Worm skill (Get the game, play it, and you'll know what I'm talking about)  HOWEVER... This game, unfortunately, is plagued with 'Fatal Error's that crashes the game. Which makes it extremely unpleasant especially when you're going for a high score. Looking at Discussions, it seems I am not the only one. Hopefully the devs would address this issue asap. Buyer beware.",
            "review_score": "1"
        },
        {
            "review_text": "  This Game Really Nice To Play",
            "review_score": "1"
        },
        {
            "review_text": "Supa-fantastic.   Fair amount of replay, fun idea, but get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun platform game, Good graphics and game play with lots of fun to be had.",
            "review_score": "1"
        },
        {
            "review_text": "the combat is pretty awful, the graphics are like a newgrounds game.",
            "review_score": "-1"
        },
        {
            "review_text": "Nope",
            "review_score": "-1"
        },
        {
            "review_text": "It is not multiplayer, it is a local network that is useless as can be.",
            "review_score": "-1"
        },
        {
            "review_text": "It has HD in the title and only runs at like 1280x720. I give it 0 out out of 720.",
            "review_score": "-1"
        },
        {
            "review_text": "The store page says there is coop and local coop then i get to the game menu and there is no option for playing online ",
            "review_score": "-1"
        },
        {
            "review_text": "An amazing little game. Very fast paced casual strategy. I didn't have high expectations upon getting it, but's surprisingly fun and provides a good procedurally developed set of levels that keep you on your toes and thinking while maintaining a ton of action. I'm very impressed. Outside of an occasional crash issue and a little uncertainty with hit detection mechanics, I have zero complaints about this title. It just works on so many levels.",
            "review_score": "1"
        },
        {
            "review_text": "I went into this expecting...I dunno. Being bored fairly quickly. But this game is actually quite fun! It gets pretty difficult pretty quickly, but there is tons of stuff to do, and replaying it over and over continues to be an enjoyable experience. I highly recommend playing with a controller, makes things a lot easier. 8.0/10, as I wish there was a way to actually select the classes and loadouts you wanted, or at least turn on and off certain traits and weapons.",
            "review_score": "1"
        },
        {
            "review_text": "I dont usually like games that require grinding but this game is really fun and never gets repetitive",
            "review_score": "1"
        },
        {
            "review_text": "This game is really addicting, and easy to learn. Hours flew by and I didn't even realize it. The soundtrack is amazing",
            "review_score": "1"
        },
        {
            "review_text": "Good fun. My 7 and 8 year old sons had their friend come over and play this co-op mode winner stays on and they loved it. Played it for 3 hours solid. They couldnt get past level 2 but they didnt care. They just kept starting again and again. Graphics are obviously nothing spectacular here but for a cheap little indie game (and my review is based on gameplay for kids) it is great. I have bought them tripple A titles in the past for over £30 and they have got bored after 5 minutes. If you are a parent then buy this game. You can't go wrong.",
            "review_score": "1"
        },
        {
            "review_text": "This a great game that's reminscent of other roguelikes except you're constantly going down. The only problem with this game is that it crashes all the time. This wouldn't be so bad if you could just pick up where you left off, perhaps at the start of the level, from when it crashed. Unfortunately it doesn't work that way. You lose your hero and are forced to reroll a new one as if they had died. This is immensly frustrating as it can take a while to build up a hero and advance through the 10 levels in the game. At most I've gotten to the end of the 6th level only to have a crash just as I beat the boss. The money you earned stays though but that's not really any consolation if you were doing a run to try and beat the game. In those situations you won't have all that much money because you'll have been spending it on one run only buffs at shrines.   As long as the game is this unstable I can't recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun, addictIve game. Give it a try, you can even play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game started out life as a Flash title (as Binding of Isaac did), then later emerged as a playable game on Steam. It is a procedurally generated dungeon crawler, what kids might call a 'roguelike' (if they've never played Rogue or any of its true derivatives like Nethack). The twist on this title is that maps run from the top down with only limited ways to re-ascend after you've fallen a given distance. This makes it play like Kid Icarus in reverse. Heroes can be improved upon generationally a la Rogue Legacy.   Sprites are cute and well designed, putting me in mind of Castle Crashers or Battleblock Theater. Sounds are good with catchy music. Control is fair, befitting the origin as a flash title, but it's suitable for the style of game and a touch of blockiness doesn't feel out of place.   I can definitely recommend this for people who like games that have long replay value.   For: Fans of Tallowmere, Rogue Legacy, Battleblock Theater Not for: People demanding polish, fov sliders, surround sound effects.",
            "review_score": "1"
        },
        {
            "review_text": "why I play this game - grinded a lot to get good hero with good skill and abilities - fought through the dungeons like a boss slaughtering foes - collected a lot of keys - saved npc helpers - killed level 9 boss - killed level 10 boss, finally I think I won - level 11 appears with the chosen one - okay lets do this, easy so far - killed him twice nice cool - killed him third time okay... - fourth respawn, spawns a dwarven turret that absolutely demolishes the area and keeps me cornered with no escape - death 10/10 would play all over again",
            "review_score": "1"
        },
        {
            "review_text": "Admittedly, I purchased this game as part of the Humble Bundle and thus spent far less than the $3 price tag; this review should be taken with a grain-of-I-didn't-really-invest-much-to-begin-with-salt.  That being said:  I had zero interest in playing VDH when I picked up its 'Bundle. It wasn't until two days ago (as of writing) that I actually launched the title-and, admittedly, I had more fun playing this than I had expected of a 'Metroidvania Rougelike Puzzle Platformer Action RPG Extravaganza' or whatever catchy buzzword advertisements are currently affixed.  1. Linear progression that is partly Random Number Generation (RNG) but mostly linear. Permanent hero upgrades, which are applied to all future sheep sent to the slaughter (this game is about dying several times until you win), are reasonably priced to improve damage potential and starting health.  2. RNG isn't awful. I don't know what the map design algorithm is, but it works. The right combination of abilities and traits (the roster of which expands as you play) allows most levels to be beaten without killing any monsters, albeit this is difficult and does require some strategy. Merchants, who sell new abilities and qualities/traits (I don't remember the mechanical title), are occassionally dotted throughought the 10 levels who sell at a reasonable price.  3. Intuitive. Enemy tactics and abilities are easy to learn through observation before confrontation, and information kiosks are everywhere (though most of the game is easy to guess or learn by trial-and-error)  4. Non-punitive difficulty. You are not going to beat all 10 levels on your first 'Run' (attempt); you will lose many, many heroes in your quest to achieve glory (or fame or riches or whatever). You are going to throw several heroes to their deaths, each time making it *slightly* further, knowing your odds will be even better on the next attempt. In most games this is a god-forsaken grind; VDH is built around making small improvements and gains between runs in a manner that is actually fun. Dying doesn't result in all of your grinded currency (used to make permanent hero upgrades, or to purchase healing/offensive help during a run) being stripped arbitrarily. Money is only lost when it's spent.  5. 'Pacifist Mode' As I mentioned above, it is possible to complete levels without a single kill. While it isn't as large an accomplishment as Deux's Pacifism achievement, you are rewarded with orbs that are worth about as much (if not more) $ and XP as killing would. This isn't a tacked-on option, either; some abilities make pacifism easier (like stealth-based powers), and in addition to using gold to improve a hero's attack and health, money can be spent on permanently increasing the value of pacifist rewards.  My only gripe is that split-screen (local) multiplayer is a headache. The camera centers on either of the 2 heroes (who each get half the screen) and moves slightly to track movement. I'm not very susceptible to the headaches of high saturation, screen tearing, etc that most people complain about, but trying to beat 1 level in split screen mode by myself (for an achievement) was extremely difficult. I don't think this is an issue that can be fixed, but it's something to keep in mind: The splitscreen multiplayer has slightly awkward tracking, and the general blur of explosions, abilities, and enemy attacks can make it a true excercise in patience.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and simple little roguelike platformer. You choose your hero and start decending (always decending) from the top to the bottom of the level upgrading at shrines and freeing other captive heroes. Simple fun and also supports split-screen.",
            "review_score": "1"
        },
        {
            "review_text": "Great little time killer. Like a 15-minute Rogue Legacy. Can't wait to try out the split screen mode with a buddy!",
            "review_score": "1"
        },
        {
            "review_text": "A very entertaining romp through a colourful world where you will die and die and die... FUN!",
            "review_score": "1"
        },
        {
            "review_text": "A casual indie platformer about fighting your way to the next level. Players get to choose a character, progress through levels, and collect money. Once that character dies, the levels restart, but the money is saved and can be used for upgrades, weapons, etc. for the next character. Vertical Drop Heroes HD is pretty fun at first, but I found it to be a drag later on because of repetitiveness and increased difficulty. I would only consider buying it if it was on sale. Otherwise, play the demo to see whether or not you'll enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "why I play this game - grinded a lot to get good hero with good skill and abilities - fought through the dungeons like a boss slaughtering foes - collected a lot of keys - saved npc helpers - killed level 9 boss - killed level 10 boss, finally I think I won - level 11 appears with the chosen one - okay lets do this, easy so far - killed him twice nice cool - killed him third time okay... - fourth respawn, spawns a dwarven turret that absolutely demolishes the area and keeps me cornered with no escape - death 10/10 would play all over again",
            "review_score": "1"
        },
        {
            "review_text": "This is a surprisingly fun game I picked up in a Humble Bundle. It does a fantastic job of getting you to balance improving your future characters by saving coins or using them to buy permanent upgrades and improving your current ones by using your coins for all sorts of different boosts and effects. It's fun, it's easy to pick up, and it has a surprising amount of depth to it. Highly recommend.",
            "review_score": "1"
        }
    ]
}