{
    "app_id": 311560,
    "name": "Assassin’s Creed® Rogue",
    "release_date": "2015-03-09",
    "developer": [
        "Ubisoft Sofia",
        "Ubisoft Kiev"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Open World",
        "Assassin",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 4303,
    "negative_ratings": 992,
    "price": 16.99,
    "description": "Introducing Assassin’s Creed® Rogue, the darkest chapter in the Assassin’s Creed franchise yet. As Shay, you will experience the slow transformation from Assassin to Assassin Hunter. Follow your own creed and set off on an extraordinary journey through New York City, the wild river valley, and far away to the icy cold waters of the North...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/311560/header.jpg?t=1532007125",
    "minimum_requirements": "OS: Windows 7 SP1 or Windows 8/8.1 (64bit versions only) Processor: Intel Core2Quad Q6600 @ 2.4 GHz or AMD Athlon II X4 620 @ 2.6 GHzH Memory: 2 GB RAM Graphics: nVidia GeForce GTS450 or AMD Radeon HD5670 (1024MB VRAM) or Intel HD4600 DirectX: Version 11 Storage: 12 GB available space Sound Card: DirectX Compatible Sound Card with latest driver Additional Notes: Supported Video Cards at time of release: NVIDIA GeForce GTS 450 or better, GeForce 500, 600, 700, 900 series / AMD Radeon HD 5670 or better, Radeon HD 6000, 7000, R7, R9 series /  Intel HD4600, HD5200 /  Note: Laptop versions of these cards may work but are NOT officially supported.",
    "recommended_requirements": "OS: Windows 7 SP1 or Windows 8/8.1 (64bit versions only) Processor: Intel Core i5 2400s @ 2.5 GHz or better / AMD FX-6100 @ 3.3 GHz or better Graphics: nVidia GeForce GTX 560Ti (1024 VRAM) or better / AMD Radeon HD 6870 (1024 VRAM) or better DirectX: Version 11 Storage: 12 GB available space Sound Card: DirectX Compatible Sound Card with latest driver",
    "reviews": [
        {
            "review_text": "I Couldn't find a flaw in this game. They took everything great from Black Flag and improved on it. The story was so perfect that I didn't care it was a couple sequences short. I wish it kept going but it was so perfectly laid out I didn't mind so much. We finally got a game with the assassin's being our enemy and they executed it flawlessly. The signature moves were used against you as well as you performing them. Shay is a great protagonist, his decisions are well thought through and makes sense why he would go 'Rogue'. Rogue ties in with Unity, AC3 / and Black Flag perfectly while answering and also revealing so much more to the assassin creed universe. This game had all the elements to be a masterpiece and it succeeded. Worth every penny. Solid 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Initial feelings: While I have only just started playing it, I can safely say that this is the best optimization that I have seen on a Ubisoft game. I am playing this on a laptop with a GeForce 860M and I am maintaining a very steady 60fps on High/meduim graphics with 1080 resolution. As of now the story is pretty great, especially if you played the other AC games. There are cameos of a bunch of old characters like Adewale and Achilles. So far, the game is shaping up to be pretty awesome. So, if you like AC games (especially AC 4- Black Flag), then you shoud definately keep your eye on this game. (It shows promise for better obtimization from Ubisoft in the future. . . hopefully lol)  Edit: Upon playing more of Rogue I have come across a few issues that I think I should address. All of these have only happened once, so don't panic. I got stuck in a loading screen when transitioning between to areas (it just did not finish loading - it sounded like it did but I had to restart the game to fix it). I also loaded in once and could not move. This one might just be a problem with my laptop, but if not I thought I should mention it.  Nevertheless, the story is even more intriguing as it progresses and the gameplay, though mostly the same as Black Flag's, has its own elements that make it stand out as its own game (i.e. avoiding assassins trying to assassinate you, etc...)  Edit: I just wanted to mention that I did bring my graphics up a bit and I still maintain about 60 fps (once in a while it drops to 50, but that is during really intense battles). But there was one time during the story when I was taking down a man-o-war that my fps dropped to like 35ish, not unplayable but definately noticeable. Besides this, the story is coming along nicely, and I am curious to see how it will end.  Story Completion: I have to say that this is an overall good game. I did experience a few bugs, all of which are mentioned above, but only a few. The story did feel a little on the short side compared to Black Flag, but it was still a decent length (about 9ish hours I'd say). Shay is a cool character and this game really ties all of the other ones together (even Liberation). It is fun and a great addition to the AC series.",
            "review_score": "1"
        },
        {
            "review_text": "Finally another good Assassin's creed game  Good story Templar side this time Graphics are great expect for the draw distance Gameplay alot like AC:Black flag with a bunch of new gadgets/weapons 3 area's: Eighteenth-century New York City, Frozen North Atlantic and the Appalachian River Valley. Sea shanties! Runs smooth on max didnt get a single crash =D AI still crap Story a bit short  8/10  ♥♥♥♥ UPLAY!",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly fun, AC: Rogue is like the love child of Blackflag and AC 3. Having a similar setting and atmosphere as AC 3 while retaining the fun and freedom of Blackflag, AC: Rogue saves the series from the sadness and turmoil of Unity. And it isn't unplayably (it's a word now) glitchy, so there's that...",
            "review_score": "1"
        },
        {
            "review_text": "Pros: 1: No stupid tailing missions and the like, each main story mission is fun. 2: Good characters, while some I wish had seen some more screen time, we will adress that in cons. The main protaganist, Shay, develops and chaneges a lot throught the story, questioning his path the entire way. 3:Good ship combat, taken straight from AC:4 Black flag, this combat feels a lot deadlier in these northern climates, as ice bergs and the new addition of burning oil spices up naval combat. 4:Good modern story, you are still a random 'researcher' for Abstergo, but you actually have an impact this time, helping the templars dimoralize the assasins with Shay's story. 5:Ties into AC 3, 4, and Unity. This game is the ultimate branch between these games, with a young Achillies from AC 3, and old Adewale from AC 4, and a special apperance from Arno's father, who is in Unity. 6:Great graphics, Ubisoft really pulled off the rugged north of Vinland and the Gulf of St.Lawrence 7:Playes very well into the actual historical events of the 7 years war (or the French and Indian war here in Merica), you see many prominant figures, including James Cook, George Washington and more.  Cons: 1:New York from AC 3 is ported straight over, and shows the lack of dev time avalible due to Unity. 2:Short, if I had not 100% the game, I could have done the main story in about 6 hours. 3:Characters needed more time, Characters you meet who end up dying, you are supposed to feel somthing, but you met most of them for five minutes at the beggining of the game, and then again at the end.  4:The switch to Templar is way to fast, Shay goes from a Assassin to Templar in the first act of the game, so about 1 hour. I think he should have been with the creed a bit more to show why he left and to develop the other assasins. 5:Collectibles, it wouldn't be an Ubisoft game without hundreds of random collectibles all over the map for some stupid outfit you will never wear. 6:The hacking mini game in the real world, very tedious and boringly easy, or very hard.  Overall: A good game that could have been better, if given more dev time. If Ubisoft hadn't put out two AC games in one year and just focused on Rogue then Unity, most of my cons would have been addressed. I would say pick it up if you enjoy AC games, the naval combat of AC 4 or 3, or want to see how a developer can pull of the frozen north well. Otherwise, pick this game up on sale. ",
            "review_score": "1"
        },
        {
            "review_text": "Perhaps the best story in the Assassin's Creed series, especially when comparing it to AC 3 and AC 4. The gameplay is very similar to AC 4, but there's some cool extra's such as an air gun with which you can fire both darts and grenades. Furthermore whilst the setting in River Valley and New York is familiar, the new locations and missions in the North Atlantic bring a new level of epic to the series. The soundtrack is simply stunning, never more so than when entangled in a massive naval battle and it was in general a very nice game to play!",
            "review_score": "1"
        },
        {
            "review_text": "Another great addition to the AC franchise, while the gameplay is definatly nothing new and basically a complete copy from Black Flag and AC 3, Rogue brings us a new perspective through Shay's eyes as he walks the path of both assassin and templar.   This game benifits alot from his personality and story, along with several other characters that make your game experience totally worth the time.  The story was somewhat short for a stand alone but really enjoyable to go through, meeting new characters each with their own motivations and some characters from previous games that enrich Shay's journey.  The gameplay hasn't changed a bit. from combat to travel and naval battles, there's little to no changes, aside from a few new weapons and the always enjoyable naval battles now with burning oil available aswell.  The territorial disputes could have been better if they brought along the territorial wars from Revelations, but oh well it is well made and it is definatly interesting to play the templar side of things.  It really shows that this game suffered from Unity's release, it could have used some more attention, all things considered, Assassins Creed Rogue is still definatly a better game and experience than AC Unity, even if the graphics aren't as shiny it profits from better FPS, overall superior optimization, solid and fast gameplay without the random bugs and crashes.  Assassins Creed Rogue is definatly worth the purchase, hold on buying it until a sale arrives since most of the gameplay if nothing new but the story will be worth the money, a solid title with a good story, a pity that the developers didn't give it the attention it deserved.",
            "review_score": "1"
        },
        {
            "review_text": "Very simlar to Black Flag (which for me is a good thing). Definatey not the prettiest game out but it is very passable and finally not an absolutely god awful port to pc. A few noticable things:  Graphics: +Pretty good looking +Easy to run on the highest settings -No presets (must manually set everything) -Framne locked at 60 fps from what I can tell (doesn't bother me, may bother others, and no I don't have vsync on)  Gameplay: +/- combat is cut and paste from black flag +New activities +hunting feels a little better, animals are slightly more forgiving to movement (easier) +not broken (I am looking at you unity)  Story (Though I have not gotten far): +Interesting so far (I want to continue playing, again looking at you Unity) +Great main character, Shay is really cool +fun crossover between games, achilles and adalwea make appearances in the first half-hour or so  Engine ------------God damn Uplay man -MSI afterburner (and overlay) can not be used in this game. If you want to track fps, have to use fraps, afterburner causes crashes. Took about a half hour to figure this out. If you have anything over like a 760 though you should be maxing at 60 fps anyway, so don't bother downloading fraps if you have a decent graphics card.   Again game is easy to max and is unfortunately framelocked, but for comparrisson I run:  i5 3570k (stock) msi gtx 970 100me 8GB (2x4gb) kingston hyperx Blu msi z77 mobo    ",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: Main story is short and predictable, but it is definitely worth the buy.  Only 2 hours in, and this game is great. The mechanics are very similar to Assassin's Creed IV, and it plays well on my build, maintaining 60 fps on ultra.  Do yourself a favor. Buy and play AC III and AC IV, then buy this game instead of AC: Unity. 8/10 would turn templar again.  Edit: 12 hours in. Game is still great.  9/10 would continue to templar further.  Edit 2: Okay, I have finally finished the game. The concept is very interesting. It lets you see the side of the AC universe from the Templars view. The ending is very preditable and let climactic than the other AC games, but overall it was a good experience. I'm glad I picked this game up, and I will continue to open all the chests and fragments until I get to 100%.  One thing that did bother be about this game was the weapon variety. The airgun is cool, as it comes with darts and grenade, both with different kinds that you can load into your weapon. However, the darts are a simple one person shot, while grenades are an AOE kind of shot. It was kind of sad to see that this huge potential of a new weapon was short-cut with an AOE and single target option, but it still was fun to experiment with it.  Despite the game's main story being fairly short, it was still extremely fun and it held my attention. Overall, this game is a 8/10, would turn templar and collect the metric ♥♥♥♥♥♥♥♥ of collectables again.",
            "review_score": "1"
        },
        {
            "review_text": "good game and the story is great is not so boring but the one that keep me dissapointed is the ghrahic . the graphic is lower than the previous ac which is black flag but the game is still very fun to play and very challenging i rate it 9/10 but still this game is better than ac unity",
            "review_score": "1"
        },
        {
            "review_text": "A noice mixture of AC III and Black Flag with their snowy and lawny landscapes, naval battles and stuff. That's what I was missing in Unity.  Also, you can scare penguins in this game.  10 scared penguins out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "It's ironic how Unity was promoted as the big next-gen game while Rogue was underplayed as AC 4.5 for current-gen. As we've seen in the past few months, Unity has flopped horrendously while Rogue has stood out as a worthy successor to the AC franchise. Sadly, much of this is mostly because Rogue is simply NOT Unity.  The fact of the matter is that Rogue WORKS. The game is pretty much an extension of Black Flag. It doesn't change much, if anything, but that isn't a bad thing. Black Flag was exciting. Great soundtrack, fast-paced combat, huge world and naval exploration. Rogue has a somewhat smaller scale, but has more areas in New York, the North Atlantic and North America. But it has the same charm and the same feel. Perhaps it could've used its setting more effectively - lots of locations aren't used and New York is mostly a backdrop to several story missions, while Black Flag took you everywhere. But it's still better than Unity.  The story works well too. Ubisoft seems to be trying very hard to make memorable characters like Ezio but in the span of only one game compared to the AC2 trilogy. Shay Cormac is a relatable character - not as epic as Ezio, but within the constraints of only one game, Shay's story comes across very nicely. Sure, it's a token rogue story, but Shay pulls it off really well, going through the moral conflict, becoming jaded with the Assassins and becoming an integral part of the Templars.  Perhaps the most underrated part of Rogue is how it connects the AC universe together. It brings back Black Flag and Freedom Cry through its heritage of older characters. It serves as the prequel to ACIII, with references to George Washington, Haytham Kenway and the fall of Achilles. And, as an extra bonus, it links into the events of Unity. If anything, Rogue stands out by making the other AC games better. The supporting ensemble complement Shay nicely, making the cinematic experience more enjoyable than Arno's attempts in Unity.  The modern-day story is also very well developed. You are once again an Abstergo Entertainment employee, but this time under the control of the Templars directly. It introduces new supporting characters and a whole new aspect of the modern story while retaining the familiar setting from Black Flag, It really does play out as a sequel to Black Flag, and is executed far more fluidly than Unity's excuse for a modern story. In fact, it seems that Unity was made by Abstergo rather than Ubisoft as a ploy to make Assassin-based games utter crap while making Templars games really good.  And that would make a good plot twist.  Ultimately, Rogue stays true to a working formula. There are elements that don't make a lot of sense, but we've come to expect that from open-world games and the series. The story is satisfying, the gameplay is sweet and the soundtrack is epic. Surely, there can be no greater nostalgia trip than when you open the menu and hear Ezio's and Connor's themes mashed together. Rogue respects the series and in turn forms a deep bond with everything that came before it. Perhaps it is a greater unifier than Unity.",
            "review_score": "1"
        },
        {
            "review_text": "When taking off the rose-tinted glasses of how much this game was a success was from the shadow of Unity (basically, this game actually worked whereas Unity didn't), what we're left with is a game that, though it plays decent, fails in the sense of story. It added many new weapons from its predecessor (Black Flag), though the only one which was actually really *new* was the grenades, and added an admittedly interesting gas mechanic to the game. It also was much more filled and felt significantly less grindy than Black Flag; these were all great improvements to the series from the previous title, but unfortunately, these are the only positive things I can say about this game. What this game made up for in being playable, it lost in a dissapointing lack of charm.   **The remainder of this review contains massive spoilers, referrencing the end of the game**  Either due to false marketing on the community's behalf or on Ubisoft, we're lead to believe that the main character, Shay, is the victim of a massive betrayal and seeks revenge against the brotherhood. This story sounded interesting, and for many of us, it was the first time we'd see the story from a Templar's point of view. Or at least, that's what I expected, but not what I recieved. Shay was never the victim of a betrayal, but rather the victim of a mistake in which no one was guilty. Rather than confront his Mentor about what he witnessed, which would be the logical thing to do, Shay gets unrealistically emotional about the situation and blames everything on his Mentor. He then consciously decides to betray his brotherhood, and is retaliated against accordingly.   What follows isn't a story of revenge against the backstabbing brotherhood, but rather a convoluted scheme to stop a man who ends up listening to his own conscience in the end anyways, rendering Shay's entire mission completely pointless. He decides, for no other reason than one of the British officers was nice to him while he was injured, to help his hated rivals, the Templars, and eventually join their Order and assist the British in winning the Seven Years War.  My biggest complain about this game is that under no point of this game do you ever see the positives in joining the Templar Order. The Templars were never painted as the good guys, rather the game regularly reminds you that they are the bad guys, and the reasons for Shay's complete dedication toward the Order seems to entirely ignore his high moral stance which directed him to betray the Assassins. There never seems to be a point, other than the rosey tone of a single man who dies before Shay even makes the decision to join the Templars, where I (the player) feel like I should actually want to be a Templar.   As if the feeling of 'why on Earth am I killing the good guys?' wasn't enough to make the game feel horrible, the ending seals this game as completely unnecessary and makes no sense. I'm not referring to the mission in Versailles (though the mission itself feels like an unnecessary and shoe-horned-in shameless advertisement for Unity), but rather the Naval Missions. I was quite confused while trying to complete the Naval Missions (which must be completed if you are to unlock much of the best stuff in the game) in that they no longer let you complete them until you 'progress further into the story.' This was right before the last mission of the game.  In case that wasn't clear, let me restate this: The final 5 Naval Missions, which are required for completion and for unlocking some of the best gear in the game, doesn't get unlocked until you've COMPLETED the game. Why? Were the developers afriad that I'd be cheating with Altïar's Swords on a mission which doesn't even let you use anything other than your Hidden Blades? Why was this required? So that people would be forced to play hours more of the game after they already completed the story? Who thought this was a good idea??   Overall, I think the game is fine. I never felt like I was doing the right thing, but so what? Plenty of games let you play as the bad guy (though they usually leave out the high sense of morality that constantly reminds you that what you did was morally sketchy and highlights that you're actually the bad guy in this game). The Naval Missions is a cheap and pathetic move on the fault of the developers, but hey, **at least the game plays on PC, Montreal!!**. But would I recommend it, though? No. It doesn't add much from Black Flag, and unlike this game, Black Flag had characters I actually could **care** about. I couldn't have cared less if the characters died; the fact that two of them were Haythem Kenway and Achilles Davenport defeated the possibility of that happening anyways. Comparing that to Black Flag, or more accurately Black Beard, it was geniunely disastrous watching Edward Thatch die. We had actually come to care about him and his death was genuinely devastating. In AC: Rogue, however, none of the characters invoke that amount of compassion. None of the characters seemed to have any real life. When they died, it was difficult to really think anything of it.   This game is fine, but you'd be better off playing Black Flag.",
            "review_score": "-1"
        },
        {
            "review_text": "If you liked black flag you will like this, the ship battles is what i love the most but it has added all the assasins creeds together into one. Pros It's an awesome game plenty to do if when you have finished i run around ship battling hahaha  Cons has a few bugs still but over time that will change.",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite Assassin's Creed game. I've played AC1, AC2, AC3 and AC4 (Black Flag), the latter used to be my favorite before this one came out.  The Good: - The ship battles improve on Black Flag's - The story is interesting - It was a nice break to play as the Templars. Sure they're aristrocratic jerks, but those Assassins and their reckless behavior will destroy the world (according to this game, anyway) - The graphics are impressive - The 'Lite' RPG system is well balanced. Powering up your ship, pacifying cities by taking over bases, and improving your personal armaments is fun. If you grind, the latter levels will be easier because your ship will be extremely powerful. If you don't grind, those levels will probably be harder - Being constantly hunted - instead of hunting, like in every other AC game - by Assassins while in cities is a new and really fun mechanic  The Bad: - The player controls, as usual. Be sure and run halfway up every tree and wall you see - The final levels turn in Super Mario platforming, as ususal - Level repetition, as usual  Basically, the Bad is: it's an AC game with all the inherent clunkiness that implies. But it's a great AC game! It just may turn you into a Templar.",
            "review_score": "1"
        },
        {
            "review_text": "Good old Assassins Creed, same gameplay with a couple of new weapons/tools. If you liked Black Flag but are tired of that story, then you will enjoy Rogue.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Black Flag but with more collectibles. Seriously, why so many? What are they for? For keeping you busy and so avoiding to realize that they've not made anything original for years?",
            "review_score": "-1"
        },
        {
            "review_text": "One of the more enjoyable entries in the Assassin's Creed franchise, Rogue breaks little new ground, but stills manages to be entertaining. The story flips perspectives, showing us someone who sides with the Templars over the Assassins, as well as the negative aspects of the Brotherhood's activities. Combat is fun, fluid, and makes you feel like a badass. Unlike other recent entries in the series, the game runs rather smoothly, with few hiccups and without crashes or low frame rates, though the graphics are nothing particularily special. In short, long live the Templar Order!",
            "review_score": "1"
        },
        {
            "review_text": "This game seriously reminded me of Assassin’s Creed 4 Black flag specially in the controls and well most of the concept and I really enjoy the game even thought the big twist , but other than that the game is very unique and thrilling",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, lots of naval action and swordy swordy touchy touchy. Graphics are nice too.  9.5 coconuts out of 10  -Cons-  You must have a controller as keyboard/mouse = unplayable",
            "review_score": "1"
        },
        {
            "review_text": "  I feel like this game could've been an expansion for Black Flag. Still a pretty good game, but that should be expected. If you had a choice between this and Unity, pick this one.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best AC games in the series, despite using similar mechanics from AC3 and AC4 Black Flag. Shay Cormac is such an interesting character and it really allows the player to understand more of the Templar goals, as it lets you play as a Templar for the majority of the game. Unfortunately, the story is a little short, definitely shorter than its predecessors.  Pros: Great graphics, no different to AC3 and AC4: Black Flag Great optimization, always running on 60 fps (unlike Black Flag) Very Strong Storyline with an interesting protagonist Allows us to see characters from previous games (e.g. Haytham, Adewale, Achilles, etc.)  Cons: Short Storyline   Overall, a definitely must have if you enjoyed the rest of the Kenway Saga of AC, links directly to Assassin's Creed: Unity at the end of the game so I recommend playing this game first.",
            "review_score": "1"
        },
        {
            "review_text": "Best assassin's Creed since Brotherhood 10/10 would use grenade launcher again",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Black Flag or AC3, you probably like this game too.   Had some problems in the start though: Problem with memory leaks after awhile in Abstergo, so i get out of there as soon as i can. Consider the game has been out for awhile, i think it's bad that they haven't fixed the memory leak. Seems to run ok when i'm playing as Shay. Aslo had to change resolution, because the default one didn't show everything on the right side of the screen.",
            "review_score": "1"
        },
        {
            "review_text": "This really is a good Assassin's Creed game, if you buy this you will be in for alot of surprises especially about certain characters which will be brought up! also the Versailles finale is great!  There are new weapons and parcour is pretty good if you ask me. (Even thought Shay has the same animations as Edward which is kind of a dissapointment but the story and setting makes up for it.)      Really, buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe this game is saddest part of Assassin's creed history BUT, Its also one of the best parts. Shay have find out truth about Assassin's (only in this game are Assassin's the bad guys), so he decided to leave.  + Story + Gameplay + Big map + Ships + Great dialogs + Extremely good optimalization, even on wooden PC, I can run it well  - Some little bugs - Short main story line  [9/10]",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game with stunning graphics and a compelling story line. I actually thought I was Shay and I began to sympathize with the Templars. 8/10, only because some parts are so hard they make me wanna cry. ;)",
            "review_score": "1"
        },
        {
            "review_text": "AC: Rogue was an enjoyable title, the gameplay and feel was very much like ACIV, another fantastic title. Rogue felt like an extension of ACIV, and it maintained my interest in the mechanics of the previous game.   Story: Our story begins with Shay, an assassin who is a pupil of Aquilles, the assassin who teaches us in ACIII. An action by the assassins severs Shay's trust in them and begins his descent toward the Templar side. On our way we begin to understand more about the Templars and really see the other side of the coin. The present day storyline is still present, and we still play as the same Abstergo employee from ACIV. This time we're given even more backstory and introduced to a few new characters that bring us closer to understanding the Templars.  Gameplay:  The gameplay is just like ACIV, with a few new gimmicks and weapons for our character and ship. The part I enjoyed most was the range that the Air Rifle introduced. Taking down an entire compound with it was very easy and fun to do, though it did make fights too easy and took away the challenge of having to hide in haystacks and around corners like in ACII. Also from ACIV we don't have 4 pistols anymore, only 2. We maintain our 2 swords and many other weapons like the rope darts, berserk/sleep darts. and of course our hidden blades. A few new additions are added into the game, such as an enemy type that strikes quickly and quietly like an assassin would, but the game makes it easy to find and kill these enemies if you pay attention. Also there are gang compounds which you can clear out and take over in order to access your fleet and bank. The ship combat is pretty similar to ACIV with some new ship additions and we still have 'Legendary Battles.'   Bugs/glitches/What I hated AMD GPU users are at a loss with this game, something caused the game to crash as soon as the story was launched if the environment setting was set beyond normal even if your GPU is more than capable of running the game. This title still suffers from the age old AC problem in which your character will sometimes not respond to commands and plummet to his death instead of jumping to a nearby ledge. One of my favorite glitches was with an assassin we had to kill falling into the ocean and his marker sinking and sinking until I had to restart the mission. Some of the things I hated include the large amounts of animus fragments and the fact that gang HQs really gave no advantage and were just another way for you to see your fleet and visit the bank. There really weren't many new outfits, cool guns, or swords either.   Final verdict: Get this game if you enjoyed ACIV and would like more of that great ship combat, this is a very solid title and defenitely should be picked up on sale. It adds just enough to feel like it's own story but is pretty plain when compared to ACII or ACIV. I enjoyed playing this game and had fun with it, maybe you will too.",
            "review_score": "1"
        },
        {
            "review_text": "Better than Unity, on par with Black Flag.",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: Low effort AI, gameplay is a scavenger hunting chore, story is incredibly short. As of completing ASC 2, Brotherhood, Revelations, Black Flag, and now Rogue... It fixes a lot of problems in Black Flag but lacks the kind of depth to truly enjoy the 100% completion rate  That being said, if you enjoy finding collectibles there is roughly 400 of them across the world to grab :P  Excuse me one second, I need to vent something  NOBODY CARES ABOUT THE GOD DAMNED MOTHER ♥♥♥♥ING CIRCLEJERK COMPANY SECTIONS. HOLY ♥♥♥♥. Every single game. They roll in and ♥♥♥♥ up the gameplay for easily 20 to 30 minutes each. For the love of god make them skipable  Anyways, after venting is over, the game is only about 20 missions or so long. It has a few fixes up from Black Flag so if you haven't played Black Flag before I would suggest running with this instead (unless you care about the overarching story). However, most of the gameplay consists of a couple of story missions (like 5), the rest of the story missions are just introductions to the various time sinks around the world which, while quite a large one, is mostly consistent of the same few setpieces over and over again. Littered with the same positioned collectables, completing the game fully is more of a chore than an experience. The only fun parts are the games you make for yourself on the inbetween consisting of stabbing guards in various manners, which is just as possible in the previous ASCreed games as in this one",
            "review_score": "-1"
        },
        {
            "review_text": " Tip: Before playing this game to completion, watch the first few opening cutscenes of AC: Unity. Don't get Unity though.",
            "review_score": "1"
        },
        {
            "review_text": "Overshadowed by the launch of AC Unity, this exclusively last gen release by Ubisoft is the best ♥♥♥ Creed port yet and an overall solid game.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "they shuld name it Templar´s Creed.",
            "review_score": "1"
        },
        {
            "review_text": "Assassin's Creed is starting to turn into the franchise that makes Call of Duty pause for a moment and reconsider what it's doing with it's life. Yet... I dunno, yeah, it is getting tiring to see the same stuff over and over again each year, but ACreed somehow keeps the formula interesting enough. Don't ask me how, even I don't know, but I can safely say that for the most part, every ACreed game is alright at the least. In 2014, however, AC Unity was released and was a buggy mess. I can't comment on that game but I haven't played it yet. But that same year, Ubisoft released their last ACreed game for the old gen software, Rogue. So I got the two in the sale and started up Rogue. After finishing it, I decided to start up a review. So what did I think? Well, ain't that the purpose of this review? Let's take a look.  STORY: Your name is Shay Patric Cormack. You are an Assassin working in the American colonies... or, at least, you were. After you might've caused Lisbon to have a massive earthquake after retrieving an artifact on orders of the Assassin's, you end up leaving the Assassins and you join the Templars. You end up going after your old friends from your former Assassin bretheren to get the equipment that they used to find the artifacts that did this. It is a very different story, and it did keep me entertained, but... I dunno, I wouldn't call it that good. I mean, it isn't bad, heck, I say it's decent, but it really doesn't keep you interested half the time. The other half, it is pretty interesting, but still. But it's alright, so I won't complain. It takes place during the Seven Years War in that period in between 3 and you also see    Arno, the protagonist of Unity    , so that's kind of neat.  GAMEPLAY: Same gameplay, different game. Literally, since this is just AC Black Flag in AC3's location. You have ship battles, sneaky assassinations, usual stuff. One thing that is new is the new Assassin Hunt feature. There might be an assassin hiding at places you go. You have to go into eagle sense in order to figure this out, then follow a little compass- like that points you to where they are hiding. This is a neat feature, and I know they can't add it to the usual ACreed games, but if they do this idea again they should readd it. It was fun. The rest of the stuff is alright. Don't fix it if it ain't broke, I guess. Kept me occupied for 27 hours (I know game says 19, but steam glitched out) so not bad.  GRAPHICS AND PERFORMANCE: Don't expect an amazing looking game like Unity. This was built for last gen. That said, the game looks pretty good. There are nice little details like snow particles and fish in ponds, and that's nice to see. Game runs well due to the old gen thing as well, which is sweet. If your rig can't run AAA games above 20, this might run at around 40-50FPS, not on Ultra, but Normal with a bit of AA on. So that's nice.  CHARACTERS AND VOICE ACTING: Voice acting is top notch as usual. The character arc of Shay is kind of interesting to see. All main characters are well designed and there's nothing to complain that I can think of. Maybe repetative NPC design, but that's passable for a last gen game.  FINAL THOUGHTS: Nothing special, basically the baby between 3 and Black Flag, but it's a good game. 7/10, alright game. If you like the AssCreed games, pick this up. If you want to start off with the ACreed series, try 4, it doesn't have Desmond, so you'll be fine, if not, this might not be the worst place to start. If you're tired of these games or never liked them, though, this won't change your mind.     A war and a revolution have ended, and another is about to begin.   ",
            "review_score": "1"
        },
        {
            "review_text": "this game is one of the best hidden gems of recent memory. Overshadowed by the boring bug fest unity,this is game for people who loved assassins creed 4 and just want more, with a litlle AC3 thrown in (the good bits of that game).  the game isnt perfect: hacking, or rather fixing, PCs in the modern day part of the game isnt very good. but at least its a far cry (pun intended) from those god-awful glyths of AC2. the entire modern day plot is a bit rushed and the dialogue is a bit sloppy amoung the NPCs: i think we have a modern day equivelent to 'i used to be an adventurer like you, but then i took an arrow in the knee'.  We have never before in this series had a proper look at the other side of the Assassin/Templar coin. this is definately worth your time.",
            "review_score": "1"
        },
        {
            "review_text": " Tip: Before playing this game to completion, watch the first few opening cutscenes of AC: Unity. Don't get Unity though.",
            "review_score": "1"
        },
        {
            "review_text": "'ACC.EXE HAS STOPPED WORKING'  I can play for about fifteen minutes before this crashes the game completely for me, and NONE of the possible fixes I could find online or think to try myself (there are literally over a dozen I tried) have even helped in the slightest. I have a brand new gaming computer that's fairly decent, too, so it's not like it's an issue with an old rig. I can run Witcher 3 on Ultra with no issues whatsoever.  To boot, all this troubleshooting just to play the game for more than half a mission has racked me more than the 2 hours max that Steam allows for a refund. I'm even more upset that I received this as a pre-Christmas gift, bought at full price, and then bought myself the extra content at full price, and won't be getting a refund for myself OR my gifter. I specifically put Rogue on my Wishlist INSTEAD of Unity because of all the issues Unity has had!  The game is excellent when it stays up, very fun to play. But with the current state of the crashes, the fact that SO many people seem to be having this problem as well and Ubisoft has not helped anyone with this problem since they're now moved on to Syndicate, I cannot stress that if you're thinking of buying this DON'T WASTE YOUR MONEY.  Again:  DO NOT WASTE YOUR MONEY, THIS MAY NOT EVEN WORK FOR YOU.  -10/10 Would not recommend to anyone with these ridiculous crashes.",
            "review_score": "-1"
        },
        {
            "review_text": "It most certainly is dark and although the story is short it is very compelling. It tells of the templar turned assassin shay cormac and is a prequel to ac3 and sort of a sequel to ac4. The game mechanics are the same as ac4 except that their are a coulpe of different things like gang headquarters. Also you meet haytham kenway and some other ac3 chararcters. It is quite dark as you must ruthlessly murder all your friends in the assassin order accept achilles. All in all it is a good game but I would get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I'm an Assassin's Creed fan, and have most of them. My favorite is part 2 , Hated part 3's first 6-8 hrs of B/S.   Now just going to keep this short. The control, frame rate, camera, are just great.Combat and kills are awesome as ever. Loved the cut seens. cameo's from past an current characters PC an NPC. tie's In AC3, Blackflag an Unity. I won't give any details on the story to avoid an spoilers. If this were the XBOX 360 version i would recommend 100%.   However...  The PC version has a crapload of gameplay problems. Major rendering issues. I put settings from ultra to low an everywhere in between an still rendering pop ins i have invisable surrounding's , as well as invisable enemys all i could see was their swords. Steam/Valve gave me a full refund wich i am grateful. I just can't recommend the PC port of Rogue.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly I love assassins creed black flag and rogue shows the same type of exploration in this game, with the awesome side activities for you to do and unlock some decent to badass looking outfits,weapons, and pistol sets that you must have and as for the gameplay its just like black flag but with more added features to the animations, combat system, and everything you loved about black flag but modified. Ubisoft made an awesome game and when I heard this came out on PC I preordered it instant and it was worth it with the DLC content and Uplay items as well. So if your a major assassin creed fan and want something fresh for your collection then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "By far, the best AC so far in my opinion. It has all the good qualities from all the games combined. It's the most optimized too. It actually runs like it should on a hardcore gaming pc.",
            "review_score": "1"
        },
        {
            "review_text": "I've played every Assassin's Creed game since the first, and enjoying Assassin's Creed 4, I decided to pick this one up.   It's very similar to 4, first off. If you liked the sailing and piracy of 4, it's practically the same in Rogue. However, there is substantially less content in this game than the last few Assassin's creed games, and apart from some minor gameplay changes and additions, it's just more of what made Assassin's Creed 4 tedious. The endless collectathon of chests and Animus fragments continues, although you aren't required to do this for anything but 100% completion.   This game is also very short, the main story is much shorter than the other Assassin's creed games in recent memory. Not that this is necessarily a bad thing; it took me about 9-10 hours to complete the main story, and that's a leisurely pace. By comparision, Assassin's creed 4 took me about 20 hours to finish, and it really started to drag on at some points.   Story spoiler:   Nothing of any interest happens in the main story; Shay doesn't really have an arc. No significant developments take place, really all Shay does is set up other Assassin's Creed games, namely 3 and Unity. The characters are not engaging, although they don't get any screentime anyway.  This game is really not worth your money. Pick it up if it's 10 bucks or something if you REALLY liked saling around collecting chests, and can't get enough of boring stories.  The scenery was nice though.",
            "review_score": "-1"
        },
        {
            "review_text": "While the game is alright, it does nothing new or special. If you like Assassins Creed get this. If not, you aren't missing anything. The formula for AC works but the whole animus/playing a game about playing a game is getting sloppy and old. it was cool way back when but now it's just bogging down the whole story. It's an AC game from 2012 coming out in 2015    5/12 uplay cant into good",
            "review_score": "-1"
        },
        {
            "review_text": "ship combat is fun (2)",
            "review_score": "1"
        },
        {
            "review_text": "How can they have screwed up AC4? It's the same game!   Nuisance bugs all around make this a forgettable entry in AC.  You can brute force your way through to the end, but overall the game was annoying half the time.  Story not too bad, but the game is shotty and rushed. Interface is clunky and rough (really? craft one item at a time?)  Definitely needs polishing to be decent.  Also, I needed to figure out how to skip the end credits (hold space bar for 3 seconds), it doesn't tell you; that was exceptionally annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "my assasins creed key does not work.I bought game for 20 euros and it doesnt work ",
            "review_score": "-1"
        },
        {
            "review_text": "The f***** boats man, nooooooo!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Keep crushing on my computer, with AMD graphic card.",
            "review_score": "-1"
        },
        {
            "review_text": "good game Kappa can't even get off my ship anywehere i haven't been before without the game crashing fun experience",
            "review_score": "-1"
        },
        {
            "review_text": "Did you love the swashbuckling in AC4? Did you ever want to stick it to those socialist, SJW, terrorist, hippie, welfare queen asssassins? Then this is the game for you! Finally, aid the templars in their noble goal of preventing morons from ♥♥♥♥ing up the world. Now you can prevent socialism and terrorism from your computer! The Templar Order awaits!",
            "review_score": "1"
        },
        {
            "review_text": "Shay is an interesting character and Haytham's back but this is honestly the most boring game in the series",
            "review_score": "-1"
        },
        {
            "review_text": "This might be a good game. I wouldn't know, as it crashes one second after starting up.",
            "review_score": "1"
        },
        {
            "review_text": "As a fan of AC4, I came into this game wanting more of the same, and that's pretty much exactly what I got. In essence, it's the same game with a different story that puts an interesting perspective on the entire franchise. The biggest problem here though is the limits of the port, it was designed for the XBox 360 and PS3, so the graphics are a bit below what you would expect, fortunately this game at least runs extremely smooth on mid tier computers. The other gripe is that it's clearly buggier than AC4, and a few glitches and collision issues can ruin your experience, though it's still nowhere near as bad as Unity or Syndicite.  While the game adds very little in terms of variety, it's enough to keep you playing, and overall the tried and true stealth is still great fun despite how easy it is.  Bottom line, If you enjoyed AC4, you'll enjoy this, maybe not quite as much but it's better than freedom cry.",
            "review_score": "1"
        },
        {
            "review_text": "short campaign, but if you like Black Flag, you'll enjoy it",
            "review_score": "1"
        },
        {
            "review_text": "It is probably better story wise than the last few games, but I can't get it to launch now.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is absolute ♥♥♥♥ when you enter the game the screen goes black accept for a little blue box in the corner   DON'T BUY",
            "review_score": "-1"
        },
        {
            "review_text": "Good for a port",
            "review_score": "1"
        },
        {
            "review_text": "really good but uplay is uplay",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite something. The idea behind the story is great, the story itself is short and really flat. The new reagions and the new ways to conquer new territory are fun and well done.   If you're like me and you want to gather all bonus stuff, chests, etc the time you spend on this game will be like 10 % story and 90% running/sailing arround searching stuff; it's okay though.  Compared to Black Flag I had way more bugs, like 6 gamefreeze/crash and 2 times i glitched threw the floor dying slowly in the cold water....  Overall I believe it's a good game and definitly a must have for fans. It's basicly a big DLC to Black Flag",
            "review_score": "1"
        },
        {
            "review_text": "7/10  If players are interested what happened to Desmond's father, then pick up this game. The story is brief and linear. Free roaming in this game is not recommended only because the lack of people in certain areas of the city. I haven't experienced that many glitches or bugs, only rarely encountered a few during cutscenes. Overall, it is a game worth half its current price.",
            "review_score": "1"
        },
        {
            "review_text": "nice game, what a storyline  could've been better if only it lasts longer",
            "review_score": "1"
        },
        {
            "review_text": "Very Good Well Played Game!! Love It!!!!! Yeah You Go Rogue!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "May the father of understanding guide you.",
            "review_score": "1"
        },
        {
            "review_text": "it's alright i guess. don't buy unless its on sale for sure.",
            "review_score": "1"
        },
        {
            "review_text": "I cant play this game, i cant return it, wtf. im so mad! I dont need to spend my day searching google for fixes. again WTF!",
            "review_score": "-1"
        },
        {
            "review_text": "20% report:   This game is really impressive so far. I don't know why, or how, but I can completely max it out on my rig with pretty steady 60 fps whereas AC IV and even AC III would make my computer bleed. I think Ubisoft secretly released an amazingly optimized, fully-formed, and enjoyable AC game in the wake of Unity (not even going to try to run that mess on my PC).   As for the story, I LOVE it so far. It picks up where AC IV left off in a way, putting you in the shoes of a selfish and hardheaded outsider. Only this time, you're (hurrr spoiler) the 'bad guy,' a Templar, dispelling those self-entitled and whiny Assassins. As a pretty big AC fan, I have to say, it is weirdly satifisying to dispatch members of the Order, almost disconcertingly so.   Oh, you know how awesome it was messing up fools on the high seas in AC IV? You can do that too, with improved and expanded combat, new weapons, and NEW SEA SHANTYS.   Graphically, it looks like AC IV but runs like a dream. Granted, I'm on a discontinued AMD 6100 and a GTX 770, but for me, it's really quite nice. I guess it only took Ubisoft 2.5 games to get their engine optimized for PC...   After AC II, this is my favorite in the series so far. If you're a AC fan, buy it now. Otherwise, just buy it on sale.   8/10 (incomplete review)",
            "review_score": "1"
        },
        {
            "review_text": "Great game! After hearing everywhere that Unity would be the next big step in Assassins Creed i fell victim to lies! For me unity was a great dissapiontment with too many glitches and problems, as well as a simple storyline that is way too simillar to that of Assassins Creed II. Rogue kept me hooked in the story with many characters from previous games like Achillies, Adewale and Haytham as well as some new ones. The graphics are pretty decent especially well done in the Atlantic. A VERY LARGE MAP that will keep players busy long after completing the storyline. Shay Cormac also being a cool character and Ubisoft kept me liking him more after each mission. The new Templar-Based storyline is a good idea and this game has hopefully opened many new doors for the future of Ubisoft and the Assassins Creed series. I highly recommend this game to AC Fans and new players who want a fantastic Action-Adventure game.  Pros: Decent Graphics Very Good Optimization Storyline Soundtrack Map Size and Content Great as Sequel  Cons: Outdated Engine Minor Glitches and Bugs No Mutiplayer",
            "review_score": "1"
        },
        {
            "review_text": "Like black flag, besides the fact that you're a badass Templar. Also this game SAVES *cough* black flag *cough*",
            "review_score": "1"
        },
        {
            "review_text": "I have mixed feelings about this game. I got it because Unity is too broken to play based on other peoples reviews. So when the sale was going around, aka summer sale, I got it. Since I never played Unity I can't say how the gameplay is or story. So I'll talk about how I feel about this game.   The gameplay is very similiar to AC4. Gameplay being for me atmosphere of the game. You're on a ship sometimes and land other times. You gonna go from one place to the other a lot. The map of where you can go is different. You can got to 3 different locations which is pretty cool. Each location has a different evironment. You can modify your ship again with armor and bascially the same stuff as AC4.   Note: I have seen a lot of bugs in this game. Like the character disapearing in cutscenes. A simple reload always does the trick. But it is annoying.   The story is kind of boring. The whole point of this is to see the main character (Shay) go from Assassin to Templar and thats all I was waiting for. And going along with that, since I just wanted to see that I didn't really care about his (Shay) early assassin missions. So I finished the main story pretty quick but if I explored more I would have gotten more hours into it. One thing I did like is that some of the missions didn't feel like 'filler' missons and if felt like an actual mission. Example being, 'Go get this item for this guy, then do something for another guy.' The missions in this feels more like a mission. Like you're actually accomplishing something.  The combat is kind of fluid, it has a lot of the same moves from AC4, but the other motions that they added in are clunky. The game looks good, but again takes me back to AC4.   I know this isn't a great review for something I recommend, but this final bit is why I do. This game wraps up the Kenway Story from AC3 and AC4. Also at the very end it has a scene from    Unity   . It just concludes so many unclosed doors, so to speak, from these two games that left out so much. I recommend this game if you want their story to be finished and never told ever again.   I don't think this game is as good as the others and not worth the $50. Get it when it goes on sale, I got it when it was $20. So for me it was a decent buy.   Thanks for reading.",
            "review_score": "1"
        },
        {
            "review_text": "have all the assassins creed games this is my favorite (1 and 3 arnt on steam) (probably not the bst entry point to the serice though)",
            "review_score": "1"
        },
        {
            "review_text": "I love this game possibly the best AC yet!!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best AC games to date. So far the story line is good, and the graphics are amazing.  I cannot believe how a Single 980 can run this game at 4k maxed out. Looks visually stunning and always above 60 FPS.  Good job ubisoft. I guess you were looking for redemption.   ",
            "review_score": "1"
        },
        {
            "review_text": "Everything that made AC IV great, and then some. Seems to be a good PC port. Runs even smoother for me than Black Flag, graphics maxed out.",
            "review_score": "1"
        },
        {
            "review_text": "My game is sooooo ♥♥♥♥♥♥♥ i n g broken its funny. The screen tearing is a 10/10 and it takes more time to load then windows xp   THIS GAME DID NOT WORK FOR ME   ",
            "review_score": "-1"
        },
        {
            "review_text": "If your looking for a review on this game you've come to the wrong place, but if your looking for an outstanding pie recipe you've come to the right place.  Ingredients: 1. 6 tablespoons unsalted butter 2. 1/2 cup white sugar 3. 1/2 cup brown sugar 4. 1/4 cup water 5. 1/4 teaspoon cinnamon 6. 1 pinch salt 7. 5 apples - peeled, cored and sliced 8. 1 pastry for double-crust pie   Directions: 1. Preheat oven to 425 degrees F (220 degrees C). 2. Combine butter, white sugar, brown sugar, water, cinnamon, and salt in a saucepan over medium heat. Bring to a boil, remove from heat and set aside. 3. Roll out half the pastry to fit a 9-inch pie plate. Place bottom crust in pie plate; pour in apple slices. 4. Roll out top crust into a 10-inch circle. Cut into 8 (1-inch) wide strips with a sharp paring knife or pastry wheel. Weave the pastry strips, one at a time, into a lattice pattern. Fold the ends of the lattice strips under the edge of the bottom crust and crimp to seal. 5. Pour butter-sugar mixture over top of pie, coating the lattice, and allowing any remaining sauce to drizzle through the crust. 6. Bake in the preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C), and bake until the crust is golden brown, the caramel on the top crust is set, and the apple filling is bubbling, 35 to 40 more minutes. Allow to cool completely before slicing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a copy paste from Black Flag, the only new and interesting thing about this game is the story. Nothing else. Don't know if it was worth the money tho tbh.    The game is meh in my opinion.  5/10",
            "review_score": "-1"
        },
        {
            "review_text": "keeps saying ACC.EXE has stopped working but i have no ACC.EXE folder and everyone says to open it and re-install game but nothing, wont fix no matter what i do",
            "review_score": "-1"
        },
        {
            "review_text": "Best Assassin's Creed IV Black flag standalone DLC.   Seriosly though, there is nothing new, the game looks the same, feels the same. They didn't even bother changing fighting animations so fighting with a sword and dagger looks awkward as Shay uses dagger as Edward used a second sword. Lazy production, £40 quid is only worth if you are a big fan. Ubisoft seem to exploit us, as now I feel like I have to thank them for optimizing game well, which is their job anyway.   I am dissapointed in Ubisoft. They tried new generation of consoles with AC Unity, but the fact that they were unable to produce a good quality game, but managed to get this one fairly OK, shows that they are not ready for next gen. They cannot handle it yet. After months AC Unity is still unplayable. AC Rogue is good enough though, for £20, not more.",
            "review_score": "1"
        },
        {
            "review_text": "Shuts off when I try to Start the Game I just get on where you move and Shut's off.",
            "review_score": "-1"
        },
        {
            "review_text": "the uplay is rly bad, its grate game and i like it but uplay wtf ubisoft",
            "review_score": "-1"
        },
        {
            "review_text": "Worst AC I ever played: seems this one is just compiled from assets of AC3 and Black Flag for easy money. unpolished with a lot of glitches and half-localized (russian) years after release... and, yeah, AC traditional facepalmic plot. Why it's rated so high here?!",
            "review_score": "-1"
        },
        {
            "review_text": "game is Beautiful in every way, voice got abit choppy 3 or 4 times, but great game, great character, great animation",
            "review_score": "1"
        },
        {
            "review_text": "In terms of gameplay, it's a rip-off of ACIV, srsly, and ACIII. But some activities are from the perspective of a Templar, which is refreshing.  In terms of plotline, also refreshing, makes you feel sorry for Shay, the plotline is original and good, and do some justice to ACU which was released the same day.   In terms of graphics, think of this as, a combination of ACIII graphics with ACIV gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Graphical it is terrible compare to Unity, The colors look washed out, the only AA is FXAA which is always terrible, the FOV outside the animus is extremely low and this cannot be changed, there is a 62 FPS cap making 144hz monitors useless and the animations are very bad. To me this game feels very dated, and is a step backwards from unity in every way but bugs.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥ this shi dont by tratoris shi u save slavers and kill assass ins this dhi is fukt this giy shud hav stop teh crupshin not b a ♥♥♥♥♥♥ trator ♥♥♥ ubsoft",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome game! Awesome game in Assassin's creed series, for me one of the best.  Excellent optimization, an interesting exposition of the plot, a lot of references to the others assassin's games.  Yes it is made on the old engine, yes it's a port, but so what, I do not understand why so many negatives comments, discussions. The game is amazing and what a difference how it did, what engine use, etc. I play the game and do not dig into her entrails. About the price of it - a great product for this cost.",
            "review_score": "1"
        },
        {
            "review_text": "I'm honestly very confused to as why this wasn't this last year's main Assassin's Creed game. Now, I'm not saying that Unity was a bad game, but it was very dissappointing, It is much better now that they patched it and got rid of the companion app and initiates. However the story is still pretty bad for it, when in Rogue the story is great.   In Unity I barely got to know any of the main characters, aside from Arno, Elise, and Bellec. However in Rogue you get to see characters that you met in prior games, but also new, fun characters. Also you gotta love the naval combat.   Another thing that was wrong with Unity's story was how it was arranged. That Bellec fight shouldn't have been in the middle of the game, but at the end, and should've had it be a sub-plot in which he was killing members of the Creed and Arno was trying to uncover the mystery. In Rogue, though, they aranged it perfectly, from being an assassin in the beginning, becoming a Templar in the middle, and finally at the end finding out what was up with those messed up memories.   This game did much more to further the Assassin's Creed story in a whole than Unity did, in my opinion. Also it wrapped up the Kenway games. I felt this game should've been the main one.",
            "review_score": "1"
        },
        {
            "review_text": "Higly recommended for AC fans. If you loved Black Flag, you will love this one even more. Gameplay is somewhat similar to Black Flag, that includes hunting, crafting, being a pirate, upgrading your ship, combat, collectibles, taverns, etc. However, there is more than that. There are new additions to the games which makes the game pretty much awesome to play, I am telling that from what I have encountered so far, but there could be more interesting things to do in the game. You can even hunt polar bears now, and they have added more animals you can hunt. But, that's only the minor upgrade to the game, there are other nice additions as well.  At first, the gameplay looks like another Black Flag with different environment settings, but after hanging on to it for a while, the game turned out to be pretty good with a good story line to follow. Nice graphics and minor neglictible glitches. If you have second thoughts about buying this game, don't, go ahead and get this one and enjoy the game.   GG.",
            "review_score": "1"
        },
        {
            "review_text": "WOW! If Assassins creed 4, Unity, and 3 had a baby this would be it.  Best Assassins Creed Game I have Ever Played!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I never played Unity, for obvious reasons it was broken, and people said how horrible the story was. Ive played all the other ones on console and really enjoyed their story, minus AC4 Black Flag story but still a great game. YOU DO NOT NEED TO PLAY UNITY to play this if thats what you are wondering. Read up on Unity story line if you want, but Just save some money and get this beauty of a game instead. Here's why:  Pros- The naval combat from Black Flag is put right into this, which is absolutly amazing. I have spent several hours just upgrading my ship, collecting stone to renovate buildings to put into my steady income that consists of plundered ship money and property. Integrating this into the story (which I am getting to shortly since it was 10/10) was great since you weren't really a pirate but a templar/assassin with an ACTUAL recruitment intro... unlike in black flag where you pick up assasin blades and then bam: 'Hey I am pirate assasin now!', so happy they didn't make that mistake again. Oh yeah: and NOT A SINGLE UNDERWATER SWIMMING MINI MISSION CRAP! It's great :)  The property machanic is great. You get some loot into the bank over time while you are out at sea, doing the story line (again I am going to get to here shortly because holy crap is it good) doing intercepting Assasination contracts or whatever it is you feel like doing in the game.  The fleet missions are in it still. Send your captured ships out to do your bidding and collect valueable items and collectables. I got some awesome pistol sets and a good set of swords and daggers from these. Just send and forget as you go back to pillaging the Assasins strongholds or headquarters.  This story had me hooked. You play as an Assassin at first, learning and working with other known Assassins throughout the series kind of, it takes place before AC3. And then some things happen, which I cant spoil, that pretty much send your character to question the brotherhoods motives. In turn this forces an emotional decision that the character has to make and that you (as the player really) pretty much sides with. I felt very confused and distraught as he did, which makes it even better because it's a whole other side of these series that you never get to see SINCE Altiar started questioning why he was killing men who were trying to HELP, not destroy. Playing a templar assassin with virtuous ambition that fights to uphold to, that myself as a player agree with, and huge conflict within him is 10/10 storytelling in my opinion.   You then HUNT DOWN assassins, its a lot of fun. Intercept contracts and take out the assassins that were associated with it. Yes you can be insta-killed but other assassins hiding throughout the game if you aren't too careful, gives it a nice challenge. Throughout it you may have to leave the animus to do some things in modern time like in black flag, but its pretty cool, nothing too lame. It ties together all the other games series too.  Also, you can kill civilians without any drawbacks...except some annoying bounty hunters. But hey, you are a templar ;)  There are a lot of pro's but I can't name them all.. Imagine it like they took all the great things about the other games and threw them into this one, along with some extra goodies.   Cons: NONE except for one bug- taking over a fort where I needed to kill 2 snipers. They were both marked but one of them just wasn't visible, or there for that matter. It was no biggie, just jumped into some fire which reset me back into the beginning of entering the fort.  Overall this game is a must of AC players, especially for those who havent played Unity. Seriosuly you don't need to play Unity to get this. All in all worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "The story was great i love the game but i wish there was a multyplayer now that i beat the game its really boring to play ive done just about everything there is to do in this game. The combat is way to easy and i think that it needs to be harder and more of a challenge.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is one of the best games i've played all year and is better than the next generation game we have currently I definetly recommend it to anyone who enjoyed the games from 1 to 4 its definetly worth the money. Getting the deluxe edition is very much worth the extra $10 and is a blast. The game is good with controller support but even better with the keyboard controls coming from someone who has just started with keyboard controls. The game is not something I had interest in in the beginning but easily got into it in an instant.",
            "review_score": "1"
        },
        {
            "review_text": "I loved the story in AC:R and the twists and connections to two of the previous games since this is a part of the Kenway Saga. It was a little short but the final scene to me was definitely a jaw dropper, as it is for most Assassin's Creed Games. Well done.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite AC's",
            "review_score": "1"
        },
        {
            "review_text": "It's exactly what you have come to expect from the Assassin's Creed series. This time with more cannons!   Pretty casual game with not much replay vaule, but I had fun with it and this game had a unique storyline.   I give it a 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "Purchase game.  Download. Press play.  Uplay account set up pops up.  Frick. After a few failed attampts press recover password. Reset password on Ubisoft's website. Login in to Uplay successfully. 'Your account has been suspended (for an unlisted amount of time) for failed login attempts.' Start new Uplay account. 'Account creation not available at this time.' Contact customer support. 'We're sorry. Customer support not available at this time' Sit on my couch thinking why I can't play a single player game I have purchased simply because I can't log in online. Stab eyes out with a fork.  10/10 would recommend a voice dictation program on PC to write reviews with.",
            "review_score": "-1"
        },
        {
            "review_text": "Classic AC Gameplay. It's better than Unity.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best AC since years beside AC Black Flag (AC 1 was the best)! The Characters are emotional and convincingly , the story has alot changes , the graphic is hilarious and the shipfights are like in black flag (good) The only thing that realy sucks are this abstergo sequences... they are boring and mindless... However the game itself is the money worth and a symbol that ubisoft are good  in producing games ( If they want !!! ) , lets hope that AC Victory gets the same quality!!! Well...the potencial for a good game is given ! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun if you have played Assassin's Creed Black Flag then you should try this out.",
            "review_score": "1"
        },
        {
            "review_text": "A heartwarming story and a touchy one about an Irish assassin who turns into a templar once he learns how wicked the brotherhood really is.  If you want a different AC storyline game, this is the one.  It's well optimized and naval combat is alot better than in Black Flag.  Shay Cormac is by far the most interesting character in AC series, after Ezio and Arno.  Definetly buy this game if you love AC games! In fact it's better than Unity.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, this is a great extension of the series. It plays like they took the best parts of AC3 and AC4 Black Flag and meshed this together, but instead of it ending up like some crappy combo platter it stands up on its own with a fantastically twisted story and the mechanics AC fans know and love. The nonstop sense of danger the game provides with its   constant assassination attempts   keeps you on your feet and always aware of your surroundings. Great game.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "TL,DR: Fun pirate game, but lacking amount of missions (and things to do) compared to Unity and Syndicate  This is fun, acrobatic, and stealthy, like other Assassin's Creed games, but also quite empty. The only other AC I've played was Unity (on my PS4 after they fixed all the bugs) and I LOVED it. Sure, the main story wasn't remotely good, but there were so many other missions to do in Unity that it made up for all of that.   While Rogue was released at the same time, it definitely feels like a step back, because of the lack of things to do. There aren't tons of missions on the map that you can do, it's the main quest and then some occasional others... so for people who want a huge environment to flip around in, kill people, do some detective work, etc, I'd rather recommend Unity or Syndicate. I know I'll definitely be buying Syndicate.  BUT Rogue redeems itself with the ships! Pirating is so much more fun (and so much harder) than the general running-and-flipping-and-stabbing.",
            "review_score": "1"
        },
        {
            "review_text": "crashed on startup every time I tried to play",
            "review_score": "-1"
        },
        {
            "review_text": "This is a good game",
            "review_score": "1"
        },
        {
            "review_text": "There's pinguin,but unfortunately i wasn't able to kill them.There's glitches , and i died in the ocean in front of my crew cuz i was stuck.We can kill civilians that's good.Templar's arent bad guys that's great.We can kill some people that everyone hated. So its 8.5/10. ( Better story than unity's one)",
            "review_score": "1"
        },
        {
            "review_text": "I just started and a great game so far!",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game. It's basically black flag but with next gen graphics. 27 hours played resulted in 58% complete and the main campaign complete.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a huge fanboy of ac. and this review is my opinion.   Ac Rogue follows Shay Patrick Cormac on his journey. He starts as an assassin. But when something happend he left the brotherhood. To become a templar knight.  Story: The story is only 6 sequences long. So don't suspect to play the story for more than about 15 hours. The story is pretty good and would have been a perfect prolouge to ac 3. It explains a lot. Why achillies is the only assassin. And why the templars could get so big in America.   gameplay: The gameplay is almost the same as ac 4 bf. It's just ac 4 but then with small new feutures. So if you hated ac 4 you should not buy this game for it's gameplay. However i think hat both ac4 and rogue have amazing gameplay.  graphics: It came out in 2014. The same day as ac unity (on consoles). In januari 2015 it was ported to pc. So don't suspect a great looking game. However, it's not bad. Just not fantastic.  Verdict: if you loved ac 4 you MUST buy this one. It has an truly HUGE open world! If you disliked ac 4, DON'T BUY THIS!  I would reccomend this to everyone who likes ac and espacialy ac 4!",
            "review_score": "1"
        },
        {
            "review_text": "WTF! Shane was the one who    Killed Arno's FATHER    I love how they're connected in such a way. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the best AC since years beside AC Black Flag (AC 1 was the best)! The Characters are emotional and convincingly , the story has alot changes , the graphic is hilarious and the shipfights are like in black flag (good) The only thing that realy sucks are this abstergo sequences... they are boring and mindless... However the game itself is the money worth and a symbol that ubisoft are good  in producing games ( If they want !!! ) , lets hope that AC Victory gets the same quality!!! Well...the potencial for a good game is given ! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I stopped playing assassin's creed after black flag i felt like the newer games were not as good as the first few but i saw a little gane play if this game and it looked good so i thought about it and then got the game and i so glad i did this was a great game and there's so much to do i highly recommend getting this game",
            "review_score": "1"
        },
        {
            "review_text": "I hope the creator will see this review i write. why do you need to put all those bloody stalker in this game? they are irritating and really WAY TOO MUCH. let me give a an example. i just wanted to do some shopping (due to your idea of not putting enough shop in this game) i went down to nyc, and guess what? i was stalk by a bunch of stalker ♥♥♥♥♥! what for? ALL i just wanted WAS to buy a stupid item and they just come out of no where and attack me. so what even if i kill them? they will come even more! its feel like a copy and paste lazy game play ♥♥♥♥! please stop all these stalker nonsense! one or two is ok but look at that! there are abunch of army my god! the best part is when i finally reached the door of the shop, your stalking ♥♥♥♥♥ attacked me, so i counter and kill her, then guess what! all the soldiers got alerted! ITS DAMN BLOODY STUPID! WHY CANT I JUST GO TO THE SHOP AND BUY THINGS! I PAID GOOD MONEY TO GO TO YOUR STUPID SHOP TO BUY ITEM WHY YOU SEND SO MANY DAMN PERVERT STALKERS AND ARMY TO ♥♥♥♥ ME!? I AM REALLY DISAPPOINTED!",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best AC ive ever played. Shows perfectly the difference between peace and freedom. Besides it shows that with great Power comes great Responsibility and sometimes power corrupts.   Besides the story was good as the story from REVELATIONS. ill rate it 9,5/10 because the rifle couldnt fire bullets",
            "review_score": "1"
        },
        {
            "review_text": "Well first of all Shay doesn't become ruthless and merciless assassin hunter, but slowly he defects from his believes and his code alas one thing remains : Protecting innocents.  He still has attachments to his old creed, but no mercy ( That's what I liked most ) As for gameplay It is nearly similar with Black Flag and Freedom Cry in addition few different mechanics, enhanced eagle vision to see stalker assassins and gatling-gun on your ship ( best for boarding you will see, coolest bitz ever ). The most interesting part is unlike AC3 you don't review how templar order establish but the opposite. You flashback to your assassin days and then you will become a Templar. You will hunt familiar faces including Adewale.  Story takes place before AC3 (story is good). Gameplay is good, no bugs or glitches encountered (only a few that doesnt even need to mention). So overall except for the stupid gang leaders who can detect you miles away and can't be fought 1 on 1 (you can only assasinate them in any way so no fist fight) game is 9/10. So definetely RECOMMENDED. Check DLCs also they help alot. ",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game! Most Assassins Creedy stores are all over the place but this story is short and sweet. Also super great playing a templar, i felt extreamly conflicted hunting down my former brothers and sisters. I enjoyed this game more than Unity",
            "review_score": "1"
        },
        {
            "review_text": "I picked Rogue up during a Steam sale when it was 66% off, because I felt really let down by Unity. At first I didn't want to give the Assassin's Creed franchise another shot, but I'd heard good things about Rogue and seeing it was a year old already and quite a bargain I thought to myself, why the hell not. So I bought it and I don't regret it.  You play as a templar this time, which is pretty interesting, though it took me a while to get along with that - I always really liked the assassins and betraying them felt kinda... awful. But I started to grow fond of Shay Comac, he's a bit of an idiot, but likeable. The story, too, is quite interesting - at least while you're in the animus. I never really cared much for the stuff you do at Abstergo. What I really enjoyed in Rogue was the map you got. They gave you all kinds of stuff to explore: you get New York City, the rich landscapes of the Riverlands and the icy cold North Atlantic with a lot of bad weather, fish to hunt and ships to board. I've loved Black Flag for its marine missions, and I wasn't let down by Rogue on that. I spent so much time on the water, because it just felt pretty damn good.  However, Rogue, like any other of the latest Assassin's Creed games (though I haven't played Syndicate), is just that: an Assassin's Creed game. It's not really all that different. The only thing that makes it stand out from the others is the afore mentioned fact that you're a templar now. Ergo you have assassin's following you like all the time (which got annoying pretty soon, they aren't hard to find or to kill, but there's just so many of them, it bored me).   Rogue isn't as special as it'd like to be, but still worth playing if you've liked previous AC games. They could have made the templar-thing more interesting, but it's still a nice game to spend your time on, especially if you're into sailing and discovering.",
            "review_score": "1"
        },
        {
            "review_text": "The most from-assassin-to-templar badass character i´ve ever played.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Assassin's Creed: Rogue is a strange outing for the series, serving as a spinoff, an 'interquel' (chronologically between AC4 and most of AC3), and something of a last hurrah for the series before it stepped into the next generation (and unfortunately tripped and fell with the release of Unity). It's a game I have very mixed feelings about, for while it is undeniably a good game, I can't help but feel some sense of disappointment, as I think it could have been so much better...  Performance: It works!!! After the absolute disaster that was Unity, I refused to buy another AC game for PC without waiting to see the community's response (Still can't get Unity to work for me over a year later). Obviously Ubisoft is making an effort to improve their treatment of PC releases, as this game runs, for the most part, beautifully on my machine with the graphics settings pretty much maxed out, and I run it on a laptop with a core i7, 2.5 Ghz processer, and an AMD HD8970 graphics card, so we're not talking about a particularly beastly computer here. The only real issue I encountered was a consistent crash to desktop as soon as the game started, unless I set the environment quality to normal, which seems to have been a somewhat widespread problem. However, this issue was easily resolved and hasn't affected my enjoyment of the game at all, so I'd say it's mostly negligible.  Graphics: The game looks beautiful, with some really breathtaking environments. Assassin's Creed is one of the only games that after years of play, I still find myself just stopping and looking around at the environment, in awe of the level of detail and love that went into crafting these historical recreations. Of particular note here are the stunningly reflective waters of the Riverlands, and the sprawling and lively cityscape of New York. With that in mind, however, it should be noted that many of the models and animations are ripped directly out of previous entries in the series. A lot of what you see comes from AC3 or AC4, and while this didn't bother me in most cases, one thing that greatly disappointed me was the animation set for Shay, the main protagonist. Almost all of his combat finishers and free-running movements are virtually identical to Edward Kenway's animations from AC4, who already borrowed animations from Connor in AC3. It really took away from Shay's characterization, and I found it especially disappointing considering Ubisoft went to the trouble of crafting new animations for Adewale in Freedom Cry, which was merely a DLC expansion for Black Flag. You'd think a full release with a new protagonist would get special treatment, but instead they just lazily recycled animations we've already seen before. Bad form, Ubisoft.  Sound and Music: I got chills when I started up this game and heard the opening theme. This brilliant piece weaves together themes from throughout the series' history, including the AC3 main theme, 'Ezio's Family' from AC2, and a very Irish take on what sounds like the 'British Empire' theme from Black Flag. It really brings on the nostalgia for the greatest moments of the series, and leads you to believe that you're about to witness a pivotal moment in the series' overarching plot (sadly, this doesn't quite come to fruition). Overall, the music is really great in this game, epic and grandiose, and I loved the Irish flavor they brought to the table to accompany the series' first Irish protagonist. As always, they really hit the nail on the head here. As for sound effects and voice acting, you'll hear a lot of familiar sounds from AC4, which didn't need improvement, and the voice acting is as good as ever.  Story: To me, this is where the game really failed to deliver. We were promised a plot that would turn the series on its head, showing us the world from the perspective of the Templars, blurring the lines and making us see the humanity in both sides. Unfortunately, I would argue that the opening sequences of AC3 already accomplished that much better than this game ever did. I wanted to like Shay Cormac, our rogue-ish hero, but I just never really cared all that much. Especially after the emotional rollercoaster of Edward Kenway's pirate adventures in AC4, everything here just felt cold and disconnected. Without spoiling too much, I'll say that Shay's motivations for defecting to the Templar's just didn't make sense, and the portrayal of the Templars seemed completely off-base compared to the rest of the series. The game just tries too hard to make you like them, and instead of feeling like we're getting a closer look at the humanity within the Templar cause, it just feels like the same old 'honorable, compassionate good guys' vs 'cold, inhumane bad guys' story we've experienced before, only with the names of the factions switched.  There's also a modern day story in between sequences, but it's largely uninteresting (though Osto Berg does seem like an intriguing character), and the little pieces of lore you find by hacking computers seem more like Assassin's Creed wiki entries to flesh out popular characters than anything else. I miss the mystery of deciphering Subject 16's encoded messages in AC2, and even the hacked information in AC4 had some level of intrigue that's largely missing here.  Gameplay: It's Assassin's Creed 4: Black Flag through and through. Almost nothing has changed in terms of mechanics. You'll still free-run and counter kill your way across the land, and you'll still sail for miles and engage in furious naval battles across the North Atlantic. However, the series does add in some new features. Shay has a couple unique weapons, the air rifle and the grenade launcher. The air rifle is virtually identical to the blowgun from AC4, but it's still a cool weapon. The grenade launcher, however, is new. You can fire sleep grenades, berserk grenades, or shrapnel grenades, and it can be great fun to fire one into a group of enemies from a high tree branch and watch chaos ensue. Otherwise, however, Shay's weapons are pretty much the same as Edward's.  Another new feature is the new Stalker enemies. They will hide in places traditionally reserved for yourself as the Assassin. You can find them using a compass-like indicator only available using Eagle Vision. Then, you can either walk by and let them come at you, only to counter-kill them, or you can smoke them out and hunt them down. It makes traversing the city more interesting and more dangerous, as the Stalkers can pose a real threat if they get a hit in.  A lot of the game will be spent at sea, sailing and engaging in naval combat, and it's as fun as ever. Shay's ship, the Morrigan, is notably faster and more maneuverable than the Jackdaw from AC4, which really helps streamline the naval gameplay. The ship is also equipped with new weapons. The first is the Puckle Gun, an automatic side-gun that actually makes boarding ships too easy, as you'll probably take out all the enemy crew before your ship even gets close enough to jump over. The second new weapon is the burning oil, which allows you to leave trails of fire behind you, and is much more effective in losing a tail than the explosive kegs from previous games. Finally, you get an upgraded ram that allows you to actually control your charge. Another new naval feature worth mentioning is that you can now be boarded by enemy ships if they ram into you, which is a surprisingly exciting and chaotic experience.  Besides the main missions, there's a ton of side content. You can conquer the gangs of New York, raid forts, hunt animals to craft upgrades, and pick up a ton of various collectibles, including chests, animus fragments, the new prosperities which increase your income, viking swords, templar crosses, and more. The naval campaign also makes its return, and if you're really bored, you can just go play checkers at a bar.  My final score: 7/10 Great game in many ways, but I'd probably wait til it's on sale to pick it up.",
            "review_score": "1"
        },
        {
            "review_text": "I just started and a great game so far!",
            "review_score": "1"
        },
        {
            "review_text": "Rogue has a very good premise (you finally are put in the boots of 'the other') and a great ending. But it has bad world/map design, which only serves to advance the story and allow you to kill time. Unlike other AC games, exploring the world doesn't actually tell you anything about the world, and so the greatest draw of the series is missing in this game. And outside of Shay, the Irish couple you meet in New York, and Juhani Otsu Berg, the characters (including the one you play in present day), feel flat or rushed.   An AC game with this story would have been so much better if it had taken place in a better developed environment.  And if you like the mechanics of Black Flag... just stick with Black Flag, because sailing the open seas is so much better than hugging the coast of an overly convoluted, pooly designed river valley or arctic surrogate. I mean, this game has you sail in a worse ship than Black Flag because it's more manuverable around the coastlines, not because it makes combat and actual sailing more fun.  Not recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "I was amazed I missed this gem. I have been disappointed with unity and while Syndicate was entertaining it didn't have the same oomph as earlier titles in the series. When I discovered I had somehow missed a game in this series and tried this out, I was happily surprised and glad I hadn't given up all hope on Assassin's Creed.  Definitely worth a playthrough if you are a fan of the series.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game i like that soundtrack and i like the story.. it's impressive if you like Assassin's creed Franchise, i recommend to buy this.. so you can know about the story before AC 3 and with AC 4",
            "review_score": "1"
        },
        {
            "review_text": "I got all Assassins creed games, the story in this mode is more closer to first games of the series, very solid. Although its a short game if you dont collect all items, its a must for assasins creed fans.",
            "review_score": "1"
        },
        {
            "review_text": "I already own this for my 360 (and have 100% achievements, so obviously this will be a positive review), so my hours play do not matter. AC: Rogue came out on the PS3 and Xbox 360 the same year Unity came out for the next-gen consoles. Ironically, the previous generation of consoles, and later PC, got the good AC of that year. Rogue is more like an expansion to AC IV: Black Flag, borrowing many elements from previous ACs as well, such as renovations. Anyway, pros, cons, and whatevers:  PROS: +Unlike Unity, the game runs well, the parkour isn't broken, and the game isn't as bug filled. +The sailing returns and there are a few additions here and there, such as being boarded by enemy ships. +More sea shanties. +You get to play as a Templar for once, which means the story is taken in a different direction. When I originally got this game, I thought the reason for Shay's betrayal would be half-♥♥♥♥♥ and forced since the story in AC has been lacking. However, color me surprised that the reason for Shay's betrayal is well justified. Bravo writers! You aren't all completely stupid... But see below. +If you wanted Black Flag 2, this game is for you.  MIXED: +/-The past story seems half-♥♥♥♥♥ at times. It's obvious the writers for this game wanted to keep the Assassins as this holy order of Do No Bad, which is very ironic since the enemies are based off a religious order. And, this isn't much of a spoiler but, at the end of the game, for some reason, Shay wants to have another character spared... Yet he kills everyone else. Sure, said character says he's sorry, but you're a bloody assassin! They even make it a point earlier in the game that you kill people who have no threat whatsoever. +/-Whatever issues you, the reader, had with Black Flag make an encore. There isn't much else to say except....  CONS: -Damn it, Ubisoft, quit it with the future story! If you thought the future story for Unity and Syndicate was bad, you have no idea. The stupid officer worker motif comes back again, except you're a different employee and, oh my god, the 'supporting' black chick (screw whatever her name is) and obviously bad guy boss Scar (not his real name, too, but his design is so cliche is hurts to look at him and is a crime to not call him anything else) are the worse additions to the series. They make a cameo in Syndicate and, thankfully, they don't talk much. In Rogue, however, they talk. The black chick can best be described as a wannabe Buffy the Vampire Slayer character with sandpaper for a personality; everything she says is stupid, unneccesary, and I wish she didn't exist. In fact, I wish the person who came up with her would die in a fire. I seriously hate her guts. As for Scar, he's.. um.. a stereotypically gritty white guy with a scar. I could tell he was evil the moment I saw him. I don't have much to say about Scar because... He doesn't say any horrible dialog and looks like an evil stereotype. What has been said about other characters can just be CTRL+c and CTRL+v'd for him. -(Edit due to a revelation when playing Undertale and beating the game on PC) I just realized something. The black chick who calls the character 'Numbskull' and the idiot from AC: Unity who calls the main character 'Pisspot' have something in common: They aren't written well at all. While I was playing Undertale for the billionth time, I realized something: Undyne calls the player 'Punk' sometimes. Sure, she may be similar to the poorly written characters, but the difference is obvious: the fish monster is written than two humans. She doesn't call the player 'Punk' until AFTER becoming friends. Both the black chick and idiot from AC: Unity call the player their respected nicknames at the start, rather than after developing them. -See the cover art for this game? See how Shay has that awesome coat and hood? Well, that coat is in the game, but the hood is not. Ya, I know this is a petty con, but I expect the COVER ART for the game to feature content WITHIN the game. Shay still looks cool in the coat, though.",
            "review_score": "1"
        },
        {
            "review_text": "FUN! Just like BlackFlag but better in my opinion ",
            "review_score": "1"
        },
        {
            "review_text": "Overall a great game. Little slow in the middle, but then picks up greatly. This AC has a lot to do with ships. If you don't like being a captain of ship, this game will surely change your mind.",
            "review_score": "1"
        },
        {
            "review_text": "Much like IV, a questionable Assassin's Creed title, but an interesting exploration game. The story feels too condensed, and the climax of the game occurs during the transition from Assassin to Templar, which is fairly early on. The rest of the game flatlines. Most of it feels like a rehash of IV; you might as well just play that game instead. The best part about Rogue as a whole is how Shay is constantly questioning the motives of the Assassins and Templars, right vs wrong, good vs evil, something we haven't quite seen since the first Assassin's Creed.  - Shay kills characters that feel like they're supposed to be important, but they're unintersting - I care even less about the modern-day story, more annoying computer hacking puzzles - Stalkers are an interesting concept, but quickly become an annoyance - Collectables yield unworthy rewards for all the hours spent getting them - More of the same side missions and islands (a lot of boring repetition) + Good balance between exploration on land and naval gameplay + Assassins vs Templars, good vs evil concept  I don't recommend this game. There are better Assassin's Creed games out there, like IV and any of the games before III.",
            "review_score": "-1"
        },
        {
            "review_text": "Best Assassins Creed Game since Black Flag because it combines the the best from Black Flag and the classic ACs like 2, Brotherhood and revelations. If you liked the old ones and Black Flack then it is worth your money.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like Black Flag, the best game, of all time. However, it is a bit ♥♥♥♥♥♥♥ because you can't be Edward Kenway, who is the best man who ever laid foot upon the Earth. Shay Cormac is Irish.  It's Okay but I prefer to watch videos of cheese.",
            "review_score": "1"
        },
        {
            "review_text": "A wholly singular experience mottled by Uplay and a few directional glitches. Everything good from Black Flag and as far as I can recall, nothing bad. In fact, I'd go so far as to say that if you have neither games, buy this one and don't even bother with Black Flag. Is Black Flag an amazing game? Yes. Is this game better, gameplay-wise, yes. Black Flag got us started on this particular AC gameplay, Rogue perfected it. I played Black Flag twice as long, but mostly because all the cool things in Rogue came from Black Flag first and so I knew them all thoroughly. A big con is still the crafting system. Every island that claims it has a certain type of animals never seems to spawn them. And crafting ammunition is tedious and one-dart-by-one-dart. What a waste. A big pro is naval battles seem better than ever. Even with a brig, a step down from Edward Kenway's Frigate, being super tricked out has never felt so advantagious. Amazing pitched battles and enemies boarding your ship will really put you in the moment. Story ended quicker than I liked but mostly because I didn't do all the side quests. Definitely the most fresh approach to an AC game since they started the franchise. More than worth it on sale. Loads of content.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Assassin's Creed 3 and want that good feeling again, tying the story of both games but now with the other side's perspective (templars), with the open world of AC4 and practically no bugs, that's for sure your game.",
            "review_score": "1"
        },
        {
            "review_text": "I just love this :3",
            "review_score": "1"
        },
        {
            "review_text": "Really great game that rounds off the America series of AC games. Has all the elements of AC3 and ACBF which made them great. Parkour lines are great and controls seem to be more responsive than previous games. Great epilogue to the Kenway story, and a fantastic prologue to Arno in AC Unity. Ties the games together very well.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. Kind of like a Black Flag expansion pack with some AC3 influence as well. Definitely worth a playthrough, and you won't be disappointed like you might have been from the other recent Assassin's Creed games.",
            "review_score": "1"
        },
        {
            "review_text": "Good story, around 5 hours maybe, then 20 hours for collecting everythings. It fill a gap between AC IV and III (So, between Edward and Connor).",
            "review_score": "1"
        },
        {
            "review_text": "If you liked black flag, play this. If you haven't played an AC game ever, start with 2 then play 4, then this. You won't be dissapointed! Just be sure to skip AC 1, 3, and Unity. Each have their own flaws and are best skipped imo!",
            "review_score": "1"
        }
    ]
}