{
    "app_id": 311690,
    "name": "Enter the Gungeon",
    "release_date": "2016-04-05",
    "developer": [
        "Dodge Roll"
    ],
    "publisher": [
        "Devolver Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Bullet Hell",
        "Pixel Graphics",
        "Rogue-like"
    ],
    "achievements": 54,
    "positive_ratings": 24947,
    "negative_ratings": 1573,
    "price": 10.99,
    "description": "Enter the Gungeon is a bullet hell dungeon crawler following a band of misfits seeking to shoot, loot, dodge roll and table-flip their way to personal absolution by reaching the legendary Gungeon’s ultimate treasure: the gun that can kill the past.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/311690/header.jpg?t=1554919009",
    "minimum_requirements": "OS: Windows 7 or later Processor: Intel Core 2 Duo E6320 (2*1866) or equivalent Memory: 2 GB RAM Graphics: GeForce 7600 GS (512 MB) or equivalent Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Saw the game. Bought the game. Played the game. Hated the game because it was too hard for me. Asked for a refund. Got a refund. Missed playing the game. Bought the game again. Finally got passed level 1. Loved the game.",
            "review_score": "1"
        },
        {
            "review_text": "A thoroughly enjoyable roguelite, more challenging and less forgiving than Binding of Isaac as well as more varied and fair than Nuclear Throne.  EtG has a LOT to offer to enthusiasts of the genre:  - 4 playable characters that each have their own past (boss) to kill and a few more unlockable ones  - 200+ guns and just as many complementary passive and active items, many of which are awesome references to well-known movies and video games  - gorgeous pixel art which features incredible attention to detail (i.e. varied, destructible environmental props and enemy death animations)  - a generous assortment of mostly bullet-themed enemies, ranging from cute to creepy  - 20+ rather challenging bosses  - persistent elements such as unlockable weapons/items, NPCs and shortcuts  - Ammonomicon, an almanac that lists all the weapons, items, enemies and bosses, each entry is illustrated and has flavor text!  - quite a few secrets!  A truly sublime title, so easy to recommend.  Praise the Gun!",
            "review_score": "1"
        },
        {
            "review_text": "A more balanced, harder to cheese and skill demanding version of Isaac with guns.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great if you want.... More dodge rolls than Dark souls  More guns than Nuclear throne Less tears than the Binding of Isac And more Table Flipping than any other game 10/10 would roll again",
            "review_score": "1"
        },
        {
            "review_text": "Nice art direction, good mechanics, horrid RNG that lets you down almost every time, lack of progression -- grind the same level over and over and over again starting with the same sucky weapon over and over and over again, practically no health drops, unyielding difficulty level. It's great if you like your rogue-likes with bullet hell and RNG ♥♥♥♥♥♥♥t and still have those 15-year-old-on-Adderall reflexes. Addictive, but not necessarily in a fun way.",
            "review_score": "-1"
        },
        {
            "review_text": "It's like The Binding Of Isaac but replace the religion with guns",
            "review_score": "1"
        },
        {
            "review_text": "My new favorite twin-stick rogue-like (sorry, Nuclear Throne). The numerous weapons, enemies, references and secrets make this a really addiciting rogue-like to play. Everything from machineguns to lasers to guns that shoot teddy bears, and references from everything from Doom to Raiden to even Cowboy Bebop. Not to mention the gun theme that dominates the game (you fight bullets, literally)... can you tell this game is based on guns?",
            "review_score": "1"
        },
        {
            "review_text": "brutal - relentless - no mercy - hardcore - addictive - that's enough about my wife lets talk about the game!  ONE MORE RUN!",
            "review_score": "1"
        },
        {
            "review_text": "This game is hard as my...  teeth . Especially the bosses... Only them, actually. Few mobs are really harder than the others. I hate them. So much. Too many useless items and weapons. We need more powerful weapons... And the monsters are going to pay for them !  But it's addictive , this game is beautiful, it's well-designed and the sounds are great... I never enjoyed losing repeatedly like this.  Oh yeah...   Non ! Rien de rien... Non ! Je ne regrette rien... ",
            "review_score": "1"
        },
        {
            "review_text": "Ver. 1.0.6  A gun-pun riddled dungeon-crawling rogue-lite shooty-shoot 'bullet-hell' that's more reliant on the player's ability to play the game and less on the items found whilst playing.  Aside from the opening and credits, the OST doesn't seem all that superb to me. At the very least they're fitting for the game.  After playing with a controller and KB+M through multiple runs each, I think it all just comes down to a personal preference since the game is very much playable with both. There's even an option to change the Xbox button layout images to a PS4 layout. When playing with KB+M on windowed mode though the mouse doesn't stay in the screen so you can accidentally click outside and pause the game.  There's a tutorial right from the get-go so long as you walk up to it yourself. It teaches you most of the very basic mechanics &amp; features of the game but for the rest of everything you'd either have to figure it out for yourself or search online on what anything does with what.  The game likes to shove the table flipping and dodge rolling to your face as if they're the most useful things ever in the game. The table flipping is barely helpful in the long run since they break pretty fast and bullets will start coming from more than one side. The dodge rolling, while is actually crucial, seems to be advertised as if it's the only way to dodge anything. If anything it's just for projectiles you can't move away from without taking damage. Like in an actual bullet-hell you can just take a few taps of movement keys each time to avoid bullets without having to rely on i-frames since most projectiles that come at you in this game are spread out. In case you're not feeling confident in dodging anything you've got a limited number of these bullet-clearing items, Blanks, that can wipe a room (or your surroundings) clean of enemy projectiles for a couple of seconds.  The game starts you off with four characters available to choose from with two secret ones you can unlock. The only real difference about them are their looks, names, and starting items with their different effects. The four starters' standard guns are short-to-mid-range, low-damaging, peashooters with infinite ammo. Resources such as health, keys, &amp; ammo are generally scarce so you're highly encouraged to be conserving whether that means to play it smart &amp; better manage the usage of items or getting better at the game &amp; making full use of what you've been given with little to no hitches. Or maybe a good mix of both. All that said there are loads of weapons and passive/active items to pick up and unlock.  The game likes to boast about having loads of guns since it does. Unfortunately while these overly pop-culture-referenced guns can be useful when used properly they're hardly different from one another. For example the AK-47 just feels like a more accurate MAC-10; the RPG rockets just feel like a slower-reloading Stinger missile, except the Stinger missiles also have literal bees in 'em just because; the Mega Man gun thing and Metroid gun thing are practically one and the same as they're both semi-automatic, are both chargeable &amp; are fully charged at about the same rate, and although I couldn't compare but I'd think they do the same damage too. All these guns have their uses in some form or another but plenty of 'em don't seem  special  from one another at times aside from their looks and their modern-audience-pandering information. The further you go down the Gungeon the spongier the enemies get somewhat, even the ones you've already encountered in previous levels, so it's almost encouraging you to use the stronger guns with limited ammo. You can try to keep using the infinity-peashooter for conservation purposes but the health scaling on enemies seems like it would more prolong enemy encounters than make them more difficult, especially for the later boss fights who begin to take far too long to kill when the standard infinity peashooter is used on 'em. All  that  said though I've found that you can get through practically more than half a run with more guns &amp; items than you'd probably need with proper management and gameplay skill, but that's something the player has to learn on their own for the game is by no means easy and neither is there a difficulty setting for lowering it. A completed first run can take almost an hour to complete and right now there's no way to save a run in progress.  Throughout playthroughs you'll come across cells and cell keys to unlock them, freeing NPCs who'll have their use outside and during runs. When a cell or a cell key is found there seems to always be the other from my experience, at least so long as the entire floor is cleared so the opportunity for more NPCs is at least more than often available. These NPCs consist of things like ones that give side quests, vendors outside of playthroughs that can add items to the RNG'd item pool, and extra stores during those playthroughs. Money is relatively scarce in the game unfortunately so the extra stores during a run will very often not find their use at all. The vendors outside of runs can add new items to the item pool in exchange for Hegemony Credits, a different kind of currency that are typically found after a boss fight. Some of the side quests given outside of runs take far too long. For one of the NPCs they give a 'hunt a number of these enemies for a reward'. The reward is a new item that's to be added to the item pool and some Hegemony Credits but the enemies required to be hunted down are usually far too little in number for just one run, meaning that you'd have to go through multiple runs just to complete one hunting quest. One of the NPCs provides shortcuts to the last 4 out of 5 chambers in exchange for various loads of gathered resources from multiple runs such as money, keys, and other various items that need to be on hand for the turn-in. Once the currently needed items is given and/or a shortcut is unlocked they stay that way at least.  When going through the shortcut to the third chamber you're allowed one free gun from a choice of three. The choices given are randomly changed after the boss for that chamber has been defeated. For the fourth chamber you get a choice of two guns out of three and the same rule applies with the randomizing and the boss clearing thing. For the fifth chamber you can take all guns and the same rule thing applies. When going through these shortcuts though the bosses you defeat will never give Hegemony Credits.  There's a difficulty increasing mechanic of sorts in the game called 'Curse'. Aside from the skull that appears on the top of the character each time a point of Curse is gained from doing anything related, there's no visible counter to look at to see how many exactly you have. That anything can consist of stealing from vendors to carrying around 'cursed' items that add one Curse point so long as they're held. The more points you have on hand the more chances you'll have of encountering 'Jammed' enemies (bosses included) which are basically harder versions of an enemy who have far more health, move &amp; attack faster, have faster bullet velocities, and always deal a full heart's worth of damage (practically anything else does half a heart against you) unless you have armor, in which case one piece of the armor goes first no matter what. The limit of points you can get is 10 and once it reaches that, an immortal enemy that will constantly follow and attack you will stick around for the rest of that run even if you somehow decrease the points you have on.  Game's tough &amp; requires actual need of a player's ability to get through it. I do think though a bit of balancing should be applied in this game not for difficulty's sake, but for enjoyment's. I found it overall fun nonetheless.  Side-note: I think this should be marketed towards Asians more. Much of that playerbase has more fun with this than the casual 'Isaac' crowd.",
            "review_score": "1"
        },
        {
            "review_text": "Enter the Gungeon is a bullet hell / dungeon crawler in the same vein as Nuclear Throne &amp; The Binding of Isaac's. To progress, you'll need to collect shell casings as currency for purchasing more powerful guns &amp; items which range from the mundane to the downright bizarre. There's real depth here, and you'll spend hours in the Gungeon learning it's quirks &amp; discovering new secrets. Expect a tough challenge &amp; brutal boss encounters that'll test all but the most ardent player. The market is brimming with similar games, but few match this polished gem.",
            "review_score": "1"
        },
        {
            "review_text": "Best Rogue-like I've played this year. Possibly addictive and frustratingly cool. Fun gameplay mechanics and looting opportunities keep you coming back for more. There's enough variety and bullet hell dodging to keep one satisfied in this genre. If only there was more time in a day and more bullets in these guns!",
            "review_score": "1"
        },
        {
            "review_text": "While this game appeared quite novel, fun and interesting at first, it has become harder and harder to get into the game anymore as it feels like there is not much more on offer so to speak. It feels stagnant and really slow at times, where I would honestly prefer non-stop dodging rolling in and out of cover through bullets and so on, it quickly came boring and methodical, not the high risk rush I was hoping for looking at the gameplay.  Im kinda dissapointed to be honest.",
            "review_score": "-1"
        },
        {
            "review_text": "Holy hell this game is amazing! Even after the many hours I have played I only have made it to stage 4 one time, this game is always making me push myself to limit and requires a lot more skill than most other games. The huge variety of guns also promote the game's replayability. If I had more time and had also not had bought overwath, this game would have easily had 100+ hours already. Must buy 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Gungeon takes place in a world of cheerful violence. Where it seems gunsmithing and mysticism combine to produce a colorful, if not strange, obsession with firearms. Filled with unique characters, a quirky religion, and bang-bang. Also gun puns.",
            "review_score": "1"
        },
        {
            "review_text": "Guns, explosions, awesome pixel graphics, bosses, tons and tons of loot, lots of characters, secrets, areas, levels and tons of more content, including future content updates. The Binding of Isaac meets bullet hell. Why haven't you bought this yet?  Oh yeah, there's also lots and lots of rage, many moments where I have screamed into my monitor and slammed my fist into my desk, so git gud",
            "review_score": "1"
        },
        {
            "review_text": "i haven't enjoyed a game this much in a long time",
            "review_score": "1"
        },
        {
            "review_text": "First off. Holy balls. What a punishing game!   Getting through the first dungeon is quite the challenge already. You'll face various epic bosses at the end of each dungeon, each with unique attack patterns. Not only that, if you're lucky enough to get past the first dungeon, your health will only be repleted slightly and you must continue on. I've only made it into the second dungeon so far. Once you die, you'll lose all the guns you've collected from each dungeon along with any other items and you will restart from the beginning.   As for the visuals - great pixel art and animation. I use a 360 controller and it's working well for me, the controls are smooth and easy to adapt to.   Happy gungeoning, comrades!",
            "review_score": "1"
        },
        {
            "review_text": "You know somethings wrong when your steam friends are telling you to go outside and get off this game.",
            "review_score": "1"
        },
        {
            "review_text": "So I'm re writing my review for this game. My biggest grope with the game last time was how the third floor had a 'massive' difficulty spike. And I'm not changing my mind on that whole thing, by the way. I still think the devs could've done a much better job at balancing the game out just in general. Well, I couldn't get past the third floor, so I gave the game a thumbs down. But recently I've been watching some tips and tricks videos, some lets plays of the game, and decided to give it another go. The thing I had to do to get past the third floor was to simply get good. Now that I've fully tasted the game in it's entirety, I feel like I'm much more suited for reviewing it.  RNG, to me at least, can make a game great, it can make a game replayable, it can make a game different every time. RNG can be a good thing. It's just the moment you add too much RNG that it begins to become a problem. This game suffers from some really big RNG elements; if you don't get good guns or items by around the fourth floor, you're simply going to lose. There is no question about it, you will die. You have no hope of beating the game. The RNG in this game determines far too much if you win or not. See, a very good example of well placed RNG is probably a game like Binding of Isaac. Even if the game throws complete curveballs at you in terms of items, you can still pull through. Every run is salvagable. In this game though? I feel like it relies far too much on RNG rather than player skill. I'm pretty damn good at games like these; I think I should be winning far more often than I do. I've only beaten this game once, and the only reason why I think that is because the game handed me some good cards that time around. Almost every other time I've lost though, it's rarely due to my lack of skill. The whole game is a gamble, and every run you play is just you rolling another dice, seeing if you get lucky.  So apart from terrible RNG, what else does this game have? What if the bad RNG was removed? Well, let me tell you. This game would be on the level of Binding of Isaac in terms of good. The graphics are great, the music is fantastic, the bosses are hard and sometimes funny, there are so many references in the items, the variety in guns, how everything in the enviroment interacts with eachother. It's phenominal. Or, at least, it WOULD be phenominal. It's kind of hard to enjoy these things when you don't get lucky on the dice roll.  It's almost a shame, really. I expected that by the time I would beat this game, I would've discovered something that would mask any RNG holding me back. A few days ago I killed the Hunter's past. (EDIT: I've killed every character's past now. Still don't like this game.) And I felt relieved, not because it felt good to beat the game. No, not that. I felt releived because I could finally be done with the game, and never pick it back up again.",
            "review_score": "-1"
        },
        {
            "review_text": "Realllly good game.Verry well made!' And a hell of alot of gun. I mean fun.. I mean gun... ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "I had the pleasure of meeting the minds behind this game at PAX South 2016, sharing a cigarette with one of their marketing people who told me about the game.  He didn't grab my attention with the details about the game, until the -last- detail.  He tells me :   Isometric Rogue-like Procedurally Generated Bullet Hell  ...and then...  'You can flip tables for quick cover.'  It was at this point that he had my attention... and after watching a few YouTube videos, I took the plunge.  This game is challenging... brutally so at some points, but never makes you feel like a '♥♥♥♥♥♥ Gamer', even when you make obvious mistakes. The soundtrack is well put together, memorable, and the enemies feel unique and easy to read against the backdrop, as well as beside other types of enemies. You will ALWAYS know what you're fighting, and what they're capable of.  ---  You walk in to a room, and have to quickly make a plan of attack, how to move about the room, what weapons to use. You have to look for floor traps, pits, explosives, as well as walls, tables, and anything that can be used to block enemy shots. Be quick on your feet, quick with your mind, and quick on the trigger, while un-lifing adorably rendered enemies.  I'm giving this a solid 10/10...  If you want a quote?  'Adorably Brutal.' - J. Wolf",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Im going to skip whats great about it because many others have done that and did a very nice job. The things that I think could be made better would be the ability to resume games ands have multiple save files. Also more content would be nice, ive played 100+ hours and it has a lot of content but MORE WOULD BE BETTER!",
            "review_score": "1"
        },
        {
            "review_text": "What looked slightly uninteresting on the surface pulled me in the second I opened it. Charming graphics, a kickass soundtrack, tight gameplay, and sacreligious amounts of content make this a  MUST HAVE  for any fan of the rougelike genre.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great for pretty much everyone, it changes every time you play and it's got enough items to keep you interested for a long time. Definitely recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "Binding of Isaac with guns",
            "review_score": "1"
        },
        {
            "review_text": "[As of writing this review, I have spent 9 hours playing this game]  tl;dr: Became boring after a while, but I'm sure the majority of potential customers will enjoy it   I highly anticipated 'Enter The Gungeon' before release, and decided to buy the full package with soundtrack a little while after it had been properly released on steam. It is a very good game with lots of replayability, however some of the aspects that make it replayable may fall flat in some cases. Where starting the game and finding new weapons was exciting, I feel that now playing the game it is a case of good gun/ bad gun whenever you open a chest, and it is better just to run the starter pistol for the first floor or two anyway. That aside, there is good room for player skill development in order to reach higher floors with greater advantages through better grasping of the games core mechanics, such as Blanks and the Dodge roll, giving the game a suitable difficulty curve for all players.  I would normally reccomend this game, however for me the novelty soon wore off. The gameplay has become boring, for lack of a better word, and there is no real incentive for me to continue playing for the time being. That being said, I am sure that many people would enjoy the game for it's Binding of Isaac esque design, and at points, Hotline Miami levels of difficulty. Unfortunately, the game has quickly become stale for me, thus my review being negative.  Pros: - Great Mechanics - Wonderful Soundtrack - Good replayability - Good story (if you are willing to spend a lot of time in the game to complete it) - Modest price, for what I think an average person may spend playing the game - Devs actually update the game - Good difficulty curve  Cons: - Repetative at times - Little incentive to play again if the game has not grasped you well in the starting hours",
            "review_score": "-1"
        },
        {
            "review_text": "This game will eat your soul. I am serious. If you cannot handle dying so much it makes your own death look trivial in comparison I suggest you kindly ♥♥♥♥ off and don't even bother looking at the title... this game is HARD. Nuclear throne hard. It is unforgiving. It is malicious, unkind, unkempt. It is waiting for you, patiently, plotting each step and each pathway with more and more annoyingly difficult and supremely rage inducing roguelike chaos.   This game, will take you by the horns and ♥♥♥♥ you in the ♥♥♥.  Seriously recommend, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Opens a gate using my one and only key.  Sees chest inside.  Chest contains another key.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "A brutal rouge like dungeon crawler that shows no forgiveness to you, but at the same time kills you with cute bullet emenies making the deaths hard to rage at in my opinon. Altough people might argure that it gets way too burtal and almost impossible to beat at times so they should making a easy mode, I have 4 words, this, Isn't, the, game. You're going to have to adapt to the game, the game doesn't adapt to you. Go play Dora's The Explora: The Adventure To Stop Swiper if you want your kind of games. This game refuses to hold your hand into the adventure, it lets your hand go and drives you to a forest, beats you up, and drives off without you.    If you dont own the game and what I said is giving you second thoughts to buying this, dont. Its part of game, its just makes it more rewarding to defeat bosses, enemies, chambers, etc. This games is fun, challenging, lots of replayability and makes it feel reward going to the next chamber after those couple dozen deaths.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! It is very difficult, making the journey to kill the Past a slow and steady trek. Each playthrough you learn a little more about each floor of the Gungeon, enabling you to go a little farther each time. It took me 47 hours to beat the game for the first time, but then only 1 to beat it again with a different character. That said, even after beating the game for the first time there are still a huge amount of achievements to earn and guns to unlock. It has huge replayability, and the co-op is done really well also.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game two weeks in and its blown my mind. Yes it may be hard when runs comeout dry but its nothing compared to how bad isaac can be to get started. 9/10 would by again",
            "review_score": "1"
        },
        {
            "review_text": "I kinda hate this game. It took me 185 hours to finish it ONCE. ONCE. With ONE character of four. Which unlocked more, harder bosses. ♥♥♥♥ this game...damnit I'm not gonna be beaten by a stupid game (fiends some more). Real review. The movement is brilliant, the dodge rolling adds a dimension I never knew Isaac was missing. Also the teleporting system is fricken Genius! Bad parts include incredibly dull, repetitve early levels that are just as long as later ones. Boss fights are hard especially if you want the extra health drop and getting a crap gun or no keys on the first floor is almost restart worthy. Still reccoment it though.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "'Like Binding of Isaac with guns' - Machinima",
            "review_score": "1"
        },
        {
            "review_text": "but Quests are too hard. The require too much money. In order for you to have enough money for the sidequests, you cant buy ANYTHING at all. or else you wont be able to afford it. all those piece of crap quests where you have to amass all kinds of money to complete are freaking BS. like the dude who fixes the elevator asking for 150 money and 4-5 keys! wth! Its hard enough to get that much and if you do, you end up putting yourself in such a disadvantage and it comes back to bite you in the ♥♥♥ later on in the game. You NEED that money and those keys. also the quest where you have to finish THE bullet by buying a part in the shop worth 110 money. AGAIN its BS because you need that money. I have bought it multiple times but never managed to take it to the chick thats very far in the game. I can beat the whole game to the credits screen but not when I spend all kinds of money and put myself in dept and end up losing. I cant even unlock costumes and the other character yet because of this. There is such a thing as making a game too hard you know. I would gladly spend hours in this game I love it. but dont force me to keep trying and trying till a finish the quest.",
            "review_score": "1"
        },
        {
            "review_text": "Very much your typical dungeon crawler game but with a few new elements. I started playing Issac before this, but I can say that EtG takes what Issac started and creates a wonderful baby that can handle a gun right out of the womb. Difficult learning curve that keeps on going. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is very good but I mean it is a slow pase but if you have some one to play with it is super fun and I mean the game is pretty good and the jokes are every were",
            "review_score": "1"
        },
        {
            "review_text": "Enter the gungeon is one of best bullet hells I have played in a long time. Its beautiful pixel art, gun puns and vast arrays of guns, enemies, levels and mysterious objects really help to justify purchasing this game. Be warned though, on the surface the game may seem simple or even easy, but the difficulty will help you to 'git gud'. Overall, enter the gungeon is a gem among the sea of games flooding in on PC during the current generation, and I strongly recommend a purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Very addicting bullet-hell roguelite. Enter the Gungeon is extremely difficult while still maintaining a sense of fairness. It does get a little old, fairly quickly. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is very fluid and rewarding, but some parts (especially bosses) can be unreasonably hard. Definitely recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "This game will undoubtedly go down as my favorite game of all time.  This game is outstanding from a technical and design standpoint. The art is nice and has a unique style, the gameplay is top notch with more decisions and processes in a single room than some games have in an entire level.  Pros - 1. Incredibly easy to learn, yet hard to master gameplay. 2. A solid variety of weapons and passives make good runs alot of fun 3. Tons of unlocks and hidden things make for high replayability 4. Incredibly satisfying when you play well, or beat the game.   Cons - 1. Very difficult. It will take you a long long time investment to clear the game.  2. Drops and consumable items are extremely rare. It makes some runs just a disaster as you run out of ammo and other resources and it essentially becomes unfun/unfair. 3. Some of the guns are so worthless you are almost better off leaving them on the ground. 4. The good items are -REALLY- rare. There are numerous items ive only ever seen once in my 300+ hours of play.  Overall this game is fantastic and worth playing for anyone who likes the twin stick genre.",
            "review_score": "1"
        },
        {
            "review_text": "yes, this game should be an INSTANT-BUY! seriously, it is better than the Binding of Isaac, im dead serious. the game is challenging, loaded with unique guns, cute styled enemies that are badass at the same time, and my fave thing about this game, it isn't just about running and gunning, you have to actually be SMART to beat this game! you can't just get an OP combo and beat it like it is nothing, oh no, you have to actually DODGE instead of just standing there shooting like every other bullet hell. i give this game a perfect score, a 10/10 it is that good. this game has me hooked!",
            "review_score": "1"
        },
        {
            "review_text": "I'm one of those people that came expecting this to be a good ol' TBoI experience and realized this is MUCH harder than that. Which I felt is actually pretty nice! I like myself a good challenge. But this game gets preeeeetty close to the line of unfairness, because it's really RNG reliant, because you're not always aware of enemy placement and you can suddenly have things pop close to you and hit you, and because sometimes you still get hit by bullets because you dodged them a millisecond late. Also progress is really slow. Like, rrreeeeeeeally slow. It's still a pretty darn good game, for sure! But sometimes the mistakes feel like the game's fault, and not yours. I wish I could play it nonstop like other games, but failing over and over makes me frustrated enough to just put it aside for a while until I feel ready to tackle it a couple times again.",
            "review_score": "1"
        },
        {
            "review_text": "Very much like binding of isaac but with guns. Guns, guns, and more guns.  Very fast-paced, difficult and extremely addictive.  Lots of cool stuff and secrets to see.  It also has a pretty good soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "I would say that this game is worth it- there is so much satisfaction when fiding out new guns and finally beating the final boss (im literally shaking after just beating the boss right now). I would say that it takes determination to get to the end and may be fustrating at times however is very enjoyable. However you cant beat the game in the first runs you have to die in order to unlock new items in order to win. This game is also very unforgiving for my first Rogue like game but that made it more the satisfactory when beating the game! This is simply an amazing game however i wish that the runs were more customizable such as having synergies with the guns/ items.",
            "review_score": "1"
        },
        {
            "review_text": "I’ve found that roguelikes can be rather hit-or-miss when it comes to maintaining my interest. I really enjoyed FTL and Rogue Legacy, but Binding of Isaac and Dwarf Fortress didn’t grab me at all. Happily, Enter the Gungeon managed to hit the bullseye (... Sorry, but if you aren't a fan of puns and wordplay, this game is not for you!) With its fast-paced tough-as-nails bullethell gameplay, multiple characters, tons of unlockables and beautiful music, Gungeon is my new favourite game of 2016. I don’t say that lightly. I ADORE this little gem. I’ve played it for hours already and I intend to play it for hours to come.  It does have a couple of problems though. Some people may not be able to see beyond the gameplay and just dismiss it as a clone of Isaac, or Nuclear throne. But the essence of what made those games great is also present in Gungeon. The player is going to get their butt handed to them multiple times before the RNG will provide them with suitable items and weaponry for taking down the final boss. The only other problem I had with the game is that the 45 degree top-down perspective to the gameplay can sometimes give the player a bit of a skewed idea about where they reside spatially. This can lead to taking accidental damage, which can mean all the difference when health drops are entirely randomised.  A lot of people may despise bullethells for their nature. Why would you play a game where there’s nowhere on the screen you can stand without taking damage? That’s cheap! But Gungeon has the answer to this, in the form of its Blanks and dodge-rolling. The player has a limited amount of blanks, but they can clear a room of every single enemy bullet, as well as knock back enemies. Very good last-resort game mechanic for when the player is in a super-hostile environment.  As I mentioned earlier, the game is full of puns and wordplay. Everything within the Gungeon is somehow based on munitions. The enemies, the bosses, the weaponry, even the scenery in some cases. Even the most basic mobs are little bulletpeople with revolvers! Although I do question if one of them ever looked into the breach of their gun, realised what their ammunition was and had a ‘Soylent Green’ moment.  If you like cartoony roguelikes with the difficulty cranked up to 11 – this one is for you.",
            "review_score": "1"
        },
        {
            "review_text": "hard, rage inducing, but that moment when you find a legendary gun is so worth it.  10/10 all day long",
            "review_score": "1"
        },
        {
            "review_text": "Perfect marriage of binding of Isaac and nuclear throne. with Its own stuff thrown in. Tons of replay value. I've killed the past of all the characters and im still going strong. The unlocks with keep you going and going and going...",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Looks great, many little details. Sound design is quite mild and could have been stronger. Finetuned and tight gameplay. Lots of randomness involved, which makes some runs harder than others. Bosses are not an easy task. Great deal of original guns. Makes you chuckle here and there. Gives out Spelunky or Binding of Isaac vibe, with its mysteries - not knowing what to do here and there, but feeling it would be awesome to crack it. Progressively games do get longer (first runs 10 mins, later 40+ mins) and shortcuts are not simple to get, but are in place. With all that said, it does feel one step from being a perfect game.  Definitely recommend playing if you enjoy Nuclear Throne (feel very different actually, but in the same genre), Binding of Isaac (for the mysteries, things you find and how it changes the gameplay each session) or even Hotline Miami (for the fast-paced gameplay).",
            "review_score": "1"
        },
        {
            "review_text": "Challenging Twin Stick Shooter.  If you struggled with games like Binding of Isaac, I would NOT recommend this game in its present state. But if you're up for a demanding game, that requires time and effort to learn, this is perfect for you. Just when you think, you figured out how to play to win, the game will throw a new secret passage at you and show you, how hard you really suck.  Enter the Gungeon was designed for longevity, not for casual gamers. Which is a good thing. But opinions might differ.",
            "review_score": "1"
        },
        {
            "review_text": "The art is nice. The guns are nice. The music is okay. Bulletkin are cute. Also there's a ♥♥♥♥ing corgi, holy ♥♥♥♥, what the ♥♥♥♥! also it's kind of hard",
            "review_score": "1"
        },
        {
            "review_text": "Very good game,all can play it",
            "review_score": "1"
        },
        {
            "review_text": "stop reading reviews and buy this legendary game!!!!! But for real, It is hard so if you get mad easily stay away. Also has a bit of rng but it is not really annoying. Gun game is fun but a sandbox mode were you can use any gun you want would be awesome. This game 22.8 hours in does NOT get stale fast. Worth the $15 all day!",
            "review_score": "1"
        },
        {
            "review_text": "Well this game is an extremely challenging,but rewarding indie bullet hell with a lot of charm and polish. It is essentially is dark souls had a baby with a bullet hell and added guns and pixel graphics into the mix. It is brutally difficult as previously mentioned with a very steep learning curve about attack patterns, how to deal with certain enemies and generally which guns are good and which ones are bad. Although once you get past these frustrating things it feels amazing to clear a whole floor without getting hit once. So this game has a very mixed love-hate realtionship with me. More love of course as it scratches my binding of issac itch which it is very similar to, but with you know........... GUNS. In short it is a great game that requires a lot of skill and patience that is definitely worth checking out. 9/10 Pretty great game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is both difficult and addictingly fun. Its kind of like Binding of Isaac as far as gameplay goes, bearing the bullet hell, rouge-like, and randomly generated dungeon crawling aspects. The only real difference is its less gory, there are a few cool mechanics like table flipping and dodge rolling, and you can aim your shots instead of firing in only the 4 cardinal directions. It's also extremely hard, possibly even harder than Binding of Isaac, especially if you are a keyboard user. I recommend a controller, because some bullets are just impossible to dodge when you can only move 8 directions with a keyboard. I already have 32 hours in the game as of writing this review, and I still haven't beat the game once, so just a fair warning.",
            "review_score": "1"
        },
        {
            "review_text": "Truly the best of two worlds. A good bullet hell, with great animations, amazing controls and lovely charisma about everything. And guns.  Doomguy would be proud.",
            "review_score": "1"
        },
        {
            "review_text": "Enter the Gungeon is by far my favorite game of 2016. If you are a fan of dungeon crawls, roguelites, shmups, or bullet hell games, this game is a must buy.   I am very excited for the content cannon update.   Great job!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely stunning pixel art, attention to detail, and the best glitches in the world (Mostly in multiplayer) No online co-op though, if you're into that.",
            "review_score": "1"
        },
        {
            "review_text": "The game is really that good, nuff said. Hits a sweet spot between the usual roguelite and a bullet hell, where leaves most people satisfied.",
            "review_score": "1"
        },
        {
            "review_text": "heavy weapon's guy's favorite game on steam  ",
            "review_score": "1"
        },
        {
            "review_text": "  Good game, but needs more guns. There can never be enough guns.",
            "review_score": "1"
        },
        {
            "review_text": "Some people say this game is really hard. And it is. Sometimes I don't make it past the first floor. But I've really enjoyed it anyway. Though there are times that the screen is covered in bullets, almost every time I take damage, I see how I could have avoided it.  Basically there are games that you enjoy for the power fantasy, becoming a super powerful mage/warrior who can take apart armies or whatever. And then there are games that are frustratingly challenging, where you enjoy watching yourself become better at the game rather than your character get stronger. If you, like me, are a fan of the latter, then you'll probably enjoy Gungeon.",
            "review_score": "1"
        },
        {
            "review_text": "Gungeon is a tight and excellent shooter which boasts a sturdysingle player rampage, charming NPCs and diverse gungeoneers, and manages it's co-op with spectacular finesse. Isaac meets Darks Souls but with guns and less ♥♥♥♥, ♥♥♥♥, blood and agony, with a killer soundtrack to boot. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "It has guns and puns. What more do you need?",
            "review_score": "1"
        },
        {
            "review_text": "Laugh,shoot,remember ! Nostalgic gun dungeon rummager kept me laughing and admiring the priceless descriptions of items/guns. A super fun, replayable, pretty pixel gem done right. Thank you.",
            "review_score": "1"
        },
        {
            "review_text": "A game with lots fun",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun, i would recommend it if you like The Binding Of Isaac or Nuclear Throne. This game is a top down, bullet hell type of game. There are a lot of weapons, the maps are different every time, and the game is not to easy, definantly harder then Nuclear Throne over all. If you like a challenging, fun game that has a lot of content in it, this is the game for you.    P.S. will you ever make online co-op gungeons? I personaly would like it a lot.",
            "review_score": "1"
        },
        {
            "review_text": "This might be one of the contenders for 2016's Indie Game of the Year. Truly an amazing, hard as balls game that goes alongside Nuclear Throne and Binding of Isaac in terms of unique gameplay, replayability, and a difficulty that takes a while to master.  Highly recommend getting it, even if it's not on sale.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game with retro-like graphics that keep you playing for hours at a time.",
            "review_score": "1"
        },
        {
            "review_text": "This game can be pretty difficult. In the beginning you will die. A Lot. You will die to bosses many times and think it's impossible to win. And then you will learn the ways of the dodge roll. You need to dodge roll. Eventually you will start flawlessing the first boss and then die immediately to the second. Rinse repeat getting good, then die to a normal bullet kin. It's a very fun game but it has a steep-ish learning curve. It isn't very fair to compare it to The Binding of Isaac in any way because it is much faster and doesn't focus as much on synergies, only skill. However it isn't always fair. Many of the guns in this gun game are worse than your starting gun and some which are fun run out of ammo to fast. The drops are still being balanced and they have fixed a key dropping issue where you would get almost no keys, but many times you will get a useless trinket or useless gun. Don't be fooled it can be very difficult at first. Sometimes it can be very grindy so maybe play it in bursts. I have only been playing for around 80 hours and it is easy to get caught up it, but just know you probably aren't going to get good items most of the time. This game requires more skill compared to other games like Isaac that require good items and some skill. The bosses are the real bullet hell though. It is worth noting that you may have bad luck and will spend up to 2 minutes on the first boss since you need good guns and that bosses are bullet sponges. The first floor will always have a chest with a weapon and a chest with a passive item. May RNJesus be on your side. Just watch out for dirty rats.       TL:DR It's still being balanced but is a fun and grindy bullet-hell game where you need RNG and skill  Tl:DR;DR Don't be a scrub and git gud",
            "review_score": "1"
        },
        {
            "review_text": "+Absurdly fun blend of dungeon-crawling and bullet-hell shooting +Frightenly large number of guns and items to be found +EPIC boss battles +Glorious, glorious gun puns  -RNGesus is King in the Gungeon - you will love his favor, and fear his scorn. You will have runs where you don't get a decent gun in addition to your starter, or even none at all. -Unlocking the shortcuts to lower levels is very difficult - demanding high amounts of coins and keys, as well as beating the boss in the level above without getting hit once. -(Nitpick) Holding guns vertically looks very... weird. Can't stop noticing it.",
            "review_score": "1"
        },
        {
            "review_text": "I did not even notice I had played the game for 150hrs. If you like games with lots of replay value (i.e. Spelunky, Binding of Isaac, or anything speed-runnable) this is the game for you. ETG offers a good challenge for people who like bullet hell games. The amount of items and guns add a lot to what a run will be like. I have not played it on multiplayer, but I can only imagine it plays nicely.  Every time you beat the game, or after you unlock certain achievements new guns/items will be added, and you can also unlock certain NPCs who can help you on your journey to the depths of the gungeon.   I would say the only thing that actually gets repetitive is the music, but you can turn that off. This game is worth its price. Give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "Very happy with this game!",
            "review_score": "1"
        },
        {
            "review_text": "  Like Binding of Isaac with guns.        No seriously tho 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Got killed by a giant eye that shot rockets at me. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "tl;dr: good fast-paced bullet-hell top-down shooter with plenty of content.  23 hours and 38 attempts in, I finally managed to beat the last boss. Yet, I still haven't found even half of the guns and items available in this game, and there are still a tonne of things I haven't discovered and unlocked. Would definitely recommend.   +++ Variety and content: this game is all about variety. Through sheer variety, the game simply refuses to get repeatetive or boring. Each run, you will be forced to try and survive with a completely different gun. There's a lot of different things to shoot at, too: 86 regular enemy varieties (still haven't seen 8 of them even once), and 22 bosses to fight.  +++ Difficulty: the game is what games are supposed to be; a challenge. You learn as you play, and, eventually, you get better -- not because of grinding or a progression system. but because you understand the game better and learn to make better decisions.  ++ Mechanics and secrets: Gungeon is pleasantly different from other games of the same type in a very important (at least, to me) way: it doesn't make you want to check the game wiki to read about mechanics you feel like the game should have told you about itself. The in-game gun/item/monster encyclopedia gives you just enough info to have a general idea about what something does once you find it, but still leaves plenty of interesting things for the player to discover on their own. There are some secrets to discover, and players have plenty of opportunity to discover them themselves.  + Action: the game is pretty fast-paced. Once you get into a room, you cannot leave until you kill everyone in the room. This makes the game a largely uninterruptable series of small bullet hell challenges. Very fun.  + Theme: everything is somehow related to guns. There's like a million puns about guns and references to gun-related things. They really went all out on this.   I'm going to keep playing until I do everything with every character and unlock everything to the very last item.",
            "review_score": "1"
        },
        {
            "review_text": "Ohh, Boy This game is AWESOME!  Pros and Cons! Let's go! ( This is only my personal opinion.)  Pros: ★ Pretty Cheap ★ Alot of Fun if you like the genre ★ Run nice on old spec computer most of the times ★ Alot of Weapons and Items ★ Alot of Diffrent Npcs ★ Variety on Floors ★ High Replayability   Pro/Con: ☕ I hope they add more characters so there's even more variety to the game and players can have more chooses.  Cons:  ☢ Weapons and Items you buy are not always really an upgrade to the base one. (some of them are actually worst) ☢ You cannot leave armor, ammo or items on the ground or else it will get stolen by a creature (No Spoiler) and is REALLY annoying .  I do recommend if you like the genre or you like casual action games, This is for you. ",
            "review_score": "1"
        },
        {
            "review_text": "it's better than Isaac",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game, but the problem is that it is not rewarding enough for its difficulty and can become old very quickly especially if you are not skilled enough to get passed any bossed and end up doing the entire dungeon over only to fight a different boss you are not used to and die again and start all over again and do the same thing over and over again untill some how you progress. I am still going to play this game and try my best to beat it, but most of the time i do not enjoy it. This is alot more difficult than its bullet hell reletives like raiden. So if you like a REAL challenge, play this game. Other than that, try it and see what happens.",
            "review_score": "-1"
        },
        {
            "review_text": "One of my favourite games, that is very hard but good. It is worth the price and there is a lot to do in this game. I recommend this to gamers who likes hard games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is wicked fun, color and has a great soundtrack for fighting bad guys. There are a few different characters to choose from. Each have their own starting gear.  As any dungeon crawler, the enemies become more frequent and harder to kill. You can flip tables to hide behind, although they can be destroyed. You can dive to evade gunfire or to get across a hole(s) in the floor. There are items and weapons that can be picked up via unlockable chests. Each level has a dungeon shop where you can purchase items like health, a chest key, weapons, etc. The items in the shop are random, I believe, and are limited to only a few items in the shop.  Overall this is a good dungeon crawler, its tough, it's fun, looks great, sounds good but I really hope they decide to add in online co-op at some point. I realize it's no longer early access but that doesn't mean they can't add in online co-op since local co-op is there.",
            "review_score": "1"
        },
        {
            "review_text": "this game is a lot of fungeon",
            "review_score": "1"
        },
        {
            "review_text": "the enemies r bullets, you shoot bullets out of bullets, you can become the bullet, this game is a bullet.  10/1 IGN 'it was meh' - Some IGN worker",
            "review_score": "1"
        },
        {
            "review_text": "there is a dog",
            "review_score": "1"
        },
        {
            "review_text": "Its fun as hell &lt;3 And if you dont like it... refund it",
            "review_score": "1"
        },
        {
            "review_text": "A delitefully fun and action-packed little game, Enter the Gungeon is the game that every Binding of Isaac player has been waiting for since the release of Rebirth. Not only is Gungeon in the same line as Isaac, but it is, on all accounts, an upgraded version of Isaac: where Isaac has long areas of no action, and its action is not particularly compelling, one finds themselves completely invested in the action of Gungeon, to the point that they will feel a small triumph at every succesful dodge and utter a groan at every hit taken. Gungeon sweeps its players into the fight with a deftness that is nothing short of remarkable.  Basically, Gungeon is Binding of Isaac, except Isaac grew up and purchased a gun.  Cheers! -Camolot",
            "review_score": "1"
        },
        {
            "review_text": "Buy it now.",
            "review_score": "1"
        },
        {
            "review_text": "The only thing that it mostly needs - online",
            "review_score": "1"
        },
        {
            "review_text": "Very hard but very good.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best 'bullet hell Rogue-like dungeon-thingy' i have ever played.  Lots of guns and other stuff, loads of bosses and enemies on diffrent floors and ofc the smexy pixel graphics.  The only thing i would like to be added is that you would be able to sell your weapons when u dont need them anymore, and probably a little more characters. Still a great game though,   8.5/10  Oh and please add some trading cards :)",
            "review_score": "1"
        },
        {
            "review_text": "Enter the Gungeon is a game that most likely started out as a drunken game development joke and soon was realized it could be a fully fledge twin-stick rogue like game about shooting bullets at bullets shooting bullets at you. The art, music, and overall style are very appealing and fans of Rogue Like games are sure to find something addicting here.   It has all the makings of a solid game, but I can’t help but feel like something is missing. Perhaps the progression element isn’t strong enough for me, or I needed to be nudged just a little more; whatever the case may be I feel the carrot on the stick isn’t quite big enough here. Couch co-op is a good time in short bursts, and while it can be frustrating, it often yields to hilarious results. That’s not to say the game isn’t fun, you’ll definitely have a good time shooting bullets at bullets shooting bullets at you.  Exerpt from my  Co-Optimus.com  review. Code provided by Devolver Digital.",
            "review_score": "1"
        },
        {
            "review_text": "In its current state I cannot recommend the game, it has some great ideas and fantastic features but the bosses are straight up bullet sponges and take away a lot of the fun of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "BEST GAME EVER Nuclear Throne + The Binding of Isaac If you like good games that involve skill, a lot of raging, praying to RNG, and awesome everything, then buy this game.         Why are you still reading this... GO BUY IT ALREADY",
            "review_score": "1"
        },
        {
            "review_text": "I personally think this game is too hard for the casual player especially when compared to other similar popular games. Specifically, I feel the enemy HP is too high and the first couple of area's bosses take too long.  Other than the above, if you enjoy these types of games and are up for the challenge, go for it!",
            "review_score": "-1"
        },
        {
            "review_text": "Enter the gungeon is a unique rogue like game. It is also a bullet hell, what a under staitment. This game is so hard. You barely get any health or bullets. The only way I really found was to buy them from the shop. But that is only if the shop sells it. If there is one thing the devs should fix its that. The game is very fun but you will have to take many breakes. The weapons are unique and funny. It is so funny shooting enemies with a shirt gun.  8/10 would rage again    Broke part of my controler because of it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is seriously amazing. I have played a number of Rogue-Likes/Lites (like Binding of Isaac (Rebirth/Afterbirth), Rogue Legacy, FTL, Nuclear Throne etc.), and none of those games really compare to this, no matter what many people try to say. Enter the Gungeon is a really, really unique experience and is incredibly well-made - progression-wise, balance-wise, art-wise and fun-wise. If you want a game which you can play for many, many hours, this is definitely a good one!",
            "review_score": "1"
        },
        {
            "review_text": "The best rogue-lite I've ever played. Get this game, now.",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't worth 15 dollars...it's worth at least 20. Probably more. Now, first, I want to talk about the negative reviews.   I noticed 10% of the reviews for Enter the Gungeon were negative. I decided to see how this was possible. I noticed 2 general trends.  1. People weren't very good at it and felt like it was too hard. 2. People who had played similar games (like Binding of Isaac and Nuclear Throne) thought it would be like those and it wasn't what they expected.  This is a rogue-lite bullet hell game. It's not supposed to be a cake walk. Did the graphics throw them off? I don't know, and I don't care. It's supposed to be challenging.   Some people also said that they didnt think they'd ever get past a certain floor. Not with an attitude like that, and not without practice. I bet a large majority of people die their first time fighting any boss in this game. You have to learn those bosses patterns so you CAN beat them, and rise VICTORIOUS.   Oh and god forbid that it's not exactly like those other games. Enter the Gungeon would probably have more negative reviews if it was, because these same people, and MORE, would complain about it being a bad copy (even if it's actually better. SHOTS FIRED.)  Now on to what I think of it.  CONS  I'd give the gameplay/controls a 9/10. It's practically perfect. The only complaints I have are that, sometimes, the dodge roll is a LIIITTLE unresponsive. I also dont like how when you're using a charge gun, if you take a hit while charged, it loses its charge. I'm fine with it if that's how they intended these things to work, but these are things that could be changed with an update, which, by the way, is entirely possible. They update this game ALL THE TIME (and don't worry, you shouldn't lose your save when they do.)  As far as finding weapons, items, keys, etc, I think it's fine...except for ONE thing. So, the easiest way to get keys is to buy them from the store. Now, the thing is, sometimes on the harder levels, you have to use a key to get to the store. It's a bit of a problem that I actually do think should be changed.  PROS  This game is FANTASTIC. It's one of the best 'fresh' games I've played. I haven't played a game I enjoyed as much as this since Terraria (by the way, i have almost 1000 hours on Terraria. #nolife.)   I'm a loot man, so the fact that there are tons of weapons and items is a HUGE plus for me.   The bosses are all very challenging and unique. There's a pretty large variety of enemies too for that matter.   Theres more to do in it than just try to make it through every floor. There are MULTIPLE NPC's that you can save. While most of them are shop keepers, they all have their own unique inventory, and the NPC's that aren't shop keepers are what keep the game interesting.  There are lots of steam achievements and in game challenges.   The music...there's a reason this game's sound track is purchasable. It's great. Absolutely great. I still havent gotten tired of it.  I would recommend this game to just about anyone. It's got A LOT of play time value and a lot more than you would expect from such a straight forward concept. I personally love this game, and i give it 9/10 bullets. Would shoot again.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game about shooting bullets with guns with your bullets and flipping tables. One time I flipped a table and threw it down into one of the bottomless pits. Moments later, I get an achievement: 'I knew someone would do it', followed by 'Why?' It unlocked an upgrade that made my table flips rocket into enemies.   This is a good game.",
            "review_score": "1"
        },
        {
            "review_text": "its lit",
            "review_score": "1"
        },
        {
            "review_text": "Great game with many great mechanics that just work together",
            "review_score": "1"
        },
        {
            "review_text": "I played this game a lot, but it's somewhere oddly on the boundry of love and hate.  The gameplay is clean, art is nice, and the huge diversity of weapons and effects is amazing. It stays fun as long as you aren't stuck with your starting gun.  Unfortunately, you do often get stuck with said starting gun, or even worse alternatives, due to bad luck. I have about a 50% chance of taking no damage clearing the first three bosses if I get a decent weapon, and a nearly 100% chance of beating them untouched if I get a great one. About half the time you get jack ♥♥♥♥, lose too much health, and then get pounded to dust a few floors in. You can spend a few hours dying, then get lucky, and speed through the game on easy mode.  I'm aware that randomness is the nature of the roguelike, but the dificulty is a bit too high when the random number gods show you no favor. It starts to feel like you're wasting time instead of progressing.",
            "review_score": "-1"
        },
        {
            "review_text": "Its very good if you like game like TBOI then you will probably love this.",
            "review_score": "1"
        },
        {
            "review_text": "Guns, guns, and more guns. Guns you might even recognize from other shows, movies, books and more in this game.   It feels like your typical dungeon twin-stick shooter, but the dodge roll/bullet-hell mechanic is what elevates it to being a truly unique game in its genre.",
            "review_score": "1"
        },
        {
            "review_text": "  After playing this over at a friends house I was hooked immediatly. Everything from the art style to the music just suits the game so well and makes it enjoyable. Truth be told I had never played a rogue-type game before but theres just something about this game that makes me keep coming back for more. Can it be frustrating? Definetly. But ever time you die it feels justified. Its because you messed up that you have to start from scratch, not because of shoddy game design or RNG. So if you like a good challenge and enjoy throwbacks to older game styles you should take this for a whirl.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Binding of Isaac or Nuclear Throne, you'll love this game. This game is a challenge and very difficult. Each floor has a big learning curve from the last. There are plentiful of guns, passive items, and usables. Enter the Dungeon also has an 'in-game wiki' in which you can learn what a specific item does most of the time once you find or unlock it. There are also plenty of synergies and combos with passive items and guns to keep the game more alive and different each time. It starts with four playable characters, but you can unlock two more later on (though I haven't gotten that far yet). Plus one more character used for local co-op. It offers a tutorial that explains all the basic movements and abilities. Finally, I got to kill a   shirtless muscular bird   with an   exploding banana  .   Pros: 200+ guns 100+ enemies and/or bosses local co-op multiple playable characters secrets to be discovered 144 fps  Cons: Difficult (I find this good and fun, but some may find it bad) No saving (the devs claim to be working on a save feature) No online co-op ",
            "review_score": "1"
        },
        {
            "review_text": "A Tale of the Gungeon  The marine had just cleared the first floor, and was ready to take on the boss. He checked his map and noticed he missed a chest! He had an extra key, he could always use a bit of support before a boss fight. Quickly he ported in to the adjacent room... Hooray! he thought, the chest didn't have a lock! The marine sidled up close to the chest... Pressed E... BAM!    The chest came alive! Gun's blazing!  A mimic?!   The gungeonear screamed... After a fearfull chase through the gungeon's halls,   the mimic had the last laugh  ...  Mimics are OP  10/10 would fight mimic again.  ",
            "review_score": "1"
        },
        {
            "review_text": "what's the point of being an asexual when this game ♥♥♥♥s me all the time bullet/10 good game",
            "review_score": "1"
        },
        {
            "review_text": "isaac with guns",
            "review_score": "1"
        },
        {
            "review_text": "Enter The Gungeon is one of my favourite games already. I've only played about 10 hours now, but I will keep on playing it. Pros &amp; Cons  --Pros-- -A crap ton of replayability -Tons of different guns, items and enemies! -Super difficult (I take that as a pro, I like challenges) -It feels super rewarding to proceed longer into the Gungeon every time since you gain experience and skill all the time -You gain more stuff to do by playing it (Unlocking new NPCs, Items/Weapons, Shortcuts, Etc.) -The cheap price and that you don't need a superb pc to run it  --Cons-- -Sometimes it can feel super imbalanced since the bosses can be so difficult and the enemies aren't -There could be more characters to choose from in the start cause there's only two more characters and they're fairly hard to unlock  In conclusion, I'd say it is a must buy for Rogue-like game fans!",
            "review_score": "1"
        },
        {
            "review_text": "Games hard, if you want easy this is not what you want. If you played Binding of Isaac this game is like hush.....on every level......with multiple of them.....while you also have to aim accuratly.....its good",
            "review_score": "1"
        },
        {
            "review_text": "Gorgous game. Great music. Terrible balance.  Enter the Gungeon is a bit of a mash up of Binding of Isaac and Nuclear Throne, however while it incorporates many elements from both, it seems to miss the mark on the bits that make each truely enjoyable. Part of this comes from the fact that enemy health scales per floor and bosses take far too long to kill. But part also comes from the pacing and frankly, terrible randomness the game provides. Like Isaac, the game has numerous passive and active item drops, and like in Nuclear Throne, guns are also part of that pool. However, unlike both, it offers far less. You gain items and weapons from locked chests of varying quality. Think Isaac's treasure rooms, cept the quality of chest draws from a pool of items, making it a little easier to decide if you should open a chest or not. The problem however, is that there is seemingly a much larger pool of rubbish items and guns you can obtain regardless of quality. Many items even don't have a proper explaination on what they do, making it tough to even discern if they're helping at all and even things that increase the damage you do are negated by the increasing HP of even common enemies. Making matters worse is that the general shop doesn't always sell a weapon or even items, and the other shops you can unlock have a rather low chance of appearing as well. This isn't even mentioning the rarity of keys runs can have, making it very possible you can say get stuck with no gun but your default loadout until after the first boss.  Speaking of bosses, as mentioned earlier each one has an absurd amount of HP. Which is only made worse on those runs when you get no weapon drops at all, or are stuck with a gimmicky weapon that does next to no damage. The bosses themselves can range from ridiculously easy to rather tough for their stage as well, making for an overall uneven experience when playing. This can be noted especially due to the fact that several bosses spawn in additional enemies to deal with while you're fighting them, making already chaotic fights more diffuclt.   On the note of enemies, every stage causes even common enemies to take more damage. Its not terribly bad, however it becomes quickly noticeable. A good example is the basic bulletkin can be taken out by the Huntress's crossbow in one hit on the first level, and then requires two on the next floor. This doesn't mean the enemy changed, or got more difficult. Just a pointless change in health for no discernable reason beyond to make it so your guns will do seemingly less damage the further you go.  Finally when it comes down to variety, Enter the Gungeon just simply doesn't offer as much as other games of its ilk. Every character plays the same, just with a few very minor feeling passives. Only the secret characters seem to change that up in any kind of meaningful fashion. An example of this is.. One character starts with armor and increased aim, but another has a secondary weapon and a dog that has a small chance to find things. Or a character that has a side arm, a space bar item and an ability to do more damage temporarily if damaged, which the game penalizes you for by the way with less money drops and bosses giving you worse rewards. Overall, the characters all feel fairly samey which can make playing multiple times, especially with poor drops, really boring.  I wish Steam had a middling option for recommending it or not, since the game is still fairly decent despite all of its issues. If you wanna try something new and have already played Isaac and Nuclear Throne, this might tide you over a bit. But if you haven't, I'd recommend trying the other two first. They'd offer a better and more even challenge towards introducing new players.",
            "review_score": "-1"
        },
        {
            "review_text": "Enter to Gungeon tries to be Bullet Hell and Roguelite, which causes it to fail as both.  The biggest problem with this game is that it's stingy. Yes, the drop rates are horrible, but that's only tip of the iceberg. Through the course of the game you can rescue characters from prison for them to appear on later runs through the game. There are also NPCs you don't have to rescue, and some power-up shrines to spice up the gameplay. Problem is that these things hardly never appear. And many of the NPCs have quests tied to game progression, so you hope that they'll show up in run, only for nothing to happen. This results in most of the runs feeling very samey after a while. Continuing with the trend of stingyness, let's talk about guns which are big part of the game. There are good ones, but they are in the rarity. Most of the guns you can get are either generic, or poor performing joke guns. Which are fun when you first encounter them, but after a while you notice that they are taking spots from something you'd actually like to use. For every Serious Sam Cannon there are too many generic handguns and rifles. Granted, this does make it great when you actually get something good, but also means that most of the time you're stuck with rubbish. Also most of the guns feel horrible to shoot. Too much of 'pew pew pew', which is why less standard ones like explosives or beams are more amusing here. Too bad those are minority.  Going back to quests, after you complete them, they are removed from the gameplay. Sure, things do change at the character hub and you unlock item, but actual variety of doing things is removed from gameplay. For example, one quest requires you to kill an option bonus boss during a run, which nets you standard rewards for beating a boss in addition to intended boss of the floor. After doing this you'll never get the bonus encounter again. So unlocking things and doing quests actually makes the game less variable in the end unless you really want some more guns into rotation.  There are good things about the game too, like excellent presentation and soundtrack, but in the end this just isn't very fun.",
            "review_score": "-1"
        },
        {
            "review_text": "A charming characterful shooter that ultimately feels lifeless and lackluster. Weapons largely feel dull and unvaried, and lack of any discernable power progression turns combat into a slog. Dungeons are large, but drops are sparse making exploration feel unrewarding. Couple with gates requiring special keys that don't drop, and one gets the sense the game is resentful of being played. UI is stylized but hampering, to the point where it is quicker to Alt-f4 and quickstart rather than sit through the slew of animations that play on character death.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10, Has throwable babanas and more ridiculous weapons.",
            "review_score": "1"
        },
        {
            "review_text": "coming from the binding of isaac i thought this would be the same experience, unfortunately i was wrong. I really wanted to like this game but it's just too slow and RNG heavy for me.  I haven't gotten further than the 4th floor and that took 40 minutes and the rest of my game time was me trying to find good weapons and dying. I'd recommend this game if they made it a bit more fast pace.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Binding of Isaac + Nuclear Throne. More skill based than item/drop based. Hard as nails if you're not a bullet-hell veteran. Super fun. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "It pains me to say this, but this is a poor roguelite with excellent presentation. Its cardinal sin is that every game feels the same. You start out with a popgun and it takes minutes to get through the first world to the first boss. It all stacks up to massive amounts of time wasted. After a few hours of play I feel I've gotten no better, and seen very little :(",
            "review_score": "-1"
        },
        {
            "review_text": "Kevin Michael Costner is an American actor, film director, producer, musician, and singer. He has won two Academy Awards, three Golden Globe Awards, and one Emmy Award, and has been nominated for three BAFTA (British Academy of Film and Television Arts) Awards.",
            "review_score": "1"
        },
        {
            "review_text": "quality game with quality guns",
            "review_score": "1"
        },
        {
            "review_text": "(╯°□°)╯︵ ┻━┻ [TABLE FLIPPING INTENSIFIES]  Stop Hating this Game, every Positive Recommendation, gets a 'No' jezz. Still its a Great Game i enjoyed every Aspect even the 'Beast Mode'. Try it for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "I love Nuclear Throne and was hoping this would scratch the same itch without the pretty terrible framerate issues of Nuclear Throne. I was wrong. There is something that just doesnt click with this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is too dependant on RNG, you can't quickly restart when you die and very few guns are actually usable/upgrades over your regular gun. Game is quite tedious and boring until you find your first gun",
            "review_score": "-1"
        },
        {
            "review_text": "This game has delivered everything I expected in spades. Fantastic moment to moment gameplay, tough but very fair enemy and boss design, excellent pixel art, inventive items to make the tries varied and interesting.  Then theres the things I didnt expect. Really interesting lore exposited in a Dark Souls item description method through your Ammo-nomicon (complete with an Crestfallen Soldier type in the hub that exposites on bosses youve killed). On that note, I didnt expect such a plethora of NPCs with good dialogue.  So if your OK with a game handing you your ♥♥♥, cuz this one prolly will, then you owe it to yourself to try this.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥... ♥♥♥♥,,, ♥♥♥♥! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I had forgotten the use of teleporters so I backtracked to when Gaben didn't have a neckbeard. By the time I had gotten my heart piece and remembered the use of teleporters I died of Leprosy     GG one of the best games I've played",
            "review_score": "1"
        },
        {
            "review_text": "it is a very nice game! Riddler approves! 420 out 69! ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, too bad i'll never get past the first floor. Game is hard as hell",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty good... still think there should be online multiplayer...",
            "review_score": "1"
        },
        {
            "review_text": "I'm Addicted",
            "review_score": "1"
        },
        {
            "review_text": "Like a Hard Mode Binding of Isaac/Risk of Rain. Clean, precise, quirky and it just feels good all around, as long as you rebind the keys.  I can't recommend this game enough unless your reaction time is slow. In which case you should buy Enter the Fungeon where you sit around and talk about games you wish you were good at.",
            "review_score": "1"
        },
        {
            "review_text": "I dunno it's got a few guns and *insert binding of issac feel here*",
            "review_score": "1"
        },
        {
            "review_text": "Tired of BInding of Isaac? Try this game! It is really addictive and fun",
            "review_score": "1"
        },
        {
            "review_text": "An amazing addition to the rogue-lite bullet-hell random-loot genre. If you thought isaac was hard well then get ready to Enter the Gungeon.",
            "review_score": "1"
        },
        {
            "review_text": "Every weapon feels like ♥♥♥ and the items you find are really boring. I got a refund about an hour in. Refer to the big long negative review for more.",
            "review_score": "-1"
        },
        {
            "review_text": "I genuinley was looking forward to this game as i needed a new Isaac to play as it was getting stale so thought id give it a go. dont waste your money and stick to Isaac.  the movement of youre character is TOO SLOW from the get go even if you can get speed ups if youre lucky enough. the weapons are TERRIBLE if youre lucky enough to get something worth while. NOTHING is explained, I know that its a bullet hell game but come on!!! the bosses are absolutley ridiculous, and you might as well spit at them while fighting them.  enter the gungeon would benifit from difficulty settings for a start, not being attacked off screen would be a welcome addition.  even though ive totally gone off Isaac what with the rampant bull that goes on in that game id still reccomed it over this crock of ♥♥♥♥e.",
            "review_score": "-1"
        },
        {
            "review_text": "The story of me and this game:  -Read some reviews of this game and bought it  -Started playing it  -I was playing my first run  -First special room i've ever entered, there's a Rainbow chest  -Opened it and i was happy because of all the things it dropped, but i wasn't aware of what i had just found  -Got killed by the first boss  -80 hours later and i haven't found another one yet  10/10 would kill myself again",
            "review_score": "1"
        },
        {
            "review_text": "best rage uninstall simulator 2016 420/10 -IGN",
            "review_score": "1"
        },
        {
            "review_text": "GRRREat game.",
            "review_score": "1"
        },
        {
            "review_text": "I have 33 hours in 2 days...",
            "review_score": "1"
        },
        {
            "review_text": "Great game overall. I like how you ca nget really godly runs and pretty trash runs to make it more of a challenge instead of getting very strong weapons on the first floor. Also I like all the puns :) hehehe. *insert pun here* Overall good game to get for $14.99. Great if you enjoy a permadeath challenge like The binding of isaac.",
            "review_score": "1"
        },
        {
            "review_text": "ton of gun  ton of item ton of enemy ton of fun  10/10",
            "review_score": "1"
        },
        {
            "review_text": "the only game where a water-gun is strong enough to kill bosses.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "In this game, first you GUNS! Next, you GUNS! Then, you GUNS! I find this game very GUNS! and GUNS!, but a little bit GUNS! as well.  My rating for this game, is GUNS!/10",
            "review_score": "1"
        },
        {
            "review_text": "Had to stop my cocaine addiction to play another round",
            "review_score": "1"
        },
        {
            "review_text": "Really Really Fun! If you like this type of game then its highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. But it needs online co-op.",
            "review_score": "1"
        },
        {
            "review_text": "Guns are Unbalanced",
            "review_score": "1"
        },
        {
            "review_text": "buy it...just buy it and thanks me later",
            "review_score": "1"
        },
        {
            "review_text": "Well, coming from around 230 hours of Binding of Isaac: Rebirth/Afterbirth, I was looking for a new experience similar to Isaac that would suprise me and maybe even challenge me. Gungeon was all I could have hoped for and more. Difficult, yet fair, all the different guns make me want to fill up my Ammonomicon, and just the game itself has an amazing art style and allows the player to find their way about it. I highly recommend this game if you're looking for bullet hell, puzzle, Isaac type of experience that'll challenge you. Great game",
            "review_score": "1"
        },
        {
            "review_text": "I got shot by a knife with a gun 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fish aren't the only ones that roll...",
            "review_score": "1"
        },
        {
            "review_text": "Please help me, I think I became addicted to this game.",
            "review_score": "1"
        },
        {
            "review_text": "Tjhe game is fun and has plenty of nice features, the one thing I think it needs is an online multiplayer as opose to only doing local multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "A great game if you enjoy harder games. Lots of replayability and if you're an binding of isaac fan this game is even better.",
            "review_score": "1"
        },
        {
            "review_text": "Swords and shields = guns.",
            "review_score": "1"
        },
        {
            "review_text": "game owns   lots of shooty gun stuff.   get a xbox controller from walmart for like 20 bucks its way better than the mouse for this trust me",
            "review_score": "1"
        },
        {
            "review_text": "This game is such a fun bullet-hell / rouge-like. The sprites are all really well animated and the game in general has a lot of polish. I recommend this game to anyone who likes a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "This game is, in my opinion, one of the best games that I've played in a long time, if not ever. Words don't do justice; if you want to know about this game, look it up on youtube. Exhilarating action, clever names, funny jokes... This game combines all of the good parts of Binding of Isaac: Rebirth, Nuclear Throne, and pop culture.",
            "review_score": "1"
        },
        {
            "review_text": "The beauty of this game, so much to do, so more to come, its a roguelike i am ready to play for a vary long time.",
            "review_score": "1"
        },
        {
            "review_text": "One part Nuclear Throne, one part Jamestown, one part Towerfall, one part Renegade Ops. Shake them up and pour them onto your TV for a really great co-op game.  P.S. I hear it's also like Binding of Isaac.",
            "review_score": "1"
        },
        {
            "review_text": "fun but short, definetly must buy on sale",
            "review_score": "1"
        },
        {
            "review_text": "(Also sorry if my english isnt all that great I didnt feel like going back to correct all of this)  Sooooo, recently i've been reading lots of really harsh reviews for enter the gungeon and since I dont want people to be driven away from this AWESOME game i'm gonna list my opinions in the shortest way I can.  Enter the Gungeon is a roguelike, bullet hell with lots of cool mechanics and items that make the game interesting. BUT you may be thinking, ' EVERYONE SAYS YOU NEED A GOOD GUN TO WIN OR THAT THE GAME IS POINTLESS CAUSE YOU JUST DONT GET BETTER' And to that I respond with a simple 'Dont believe what you hear until you try it' on average those people who review it in that way have either no prior experience with bullet hells or they just dont have the willingness to continue improving at the game'  THE GAME IS FAIR, rarely do I ever die and say 'Ugh this game is so F#@%king Bull@!#t'  Enter the Gungeon honestly might just be the hardest game i've EVER played in my life but that's why i've always enjoyed it more than games such as TBOI (and I almost like it more than nuclear throne :D), so I can understand lots of the responses from the community about difficulty but I dont think that just cause a game is hard it's particularly 'Bad' After all lets list some of the games pro's and con's.  Pros - Great soundtrack - Lots of cool mechanics (espescially when it comes to table fliping items) - Secret levels  - Enough content to put ALOT of other games to shame - Looks REALLY nice when you turn on shaders and lighting to max - THE DEVS LISTEN, HUZZAH   Cons - Certain guns are just TOO weak to want to use them *cough* snowballer *cough (There aren't too many that really needs a buff though) - I agree that the enemy hp scaling is kinda silly but it doesnt really annoy me TOO much (maybe make it that your starting pistol damage scales per floor a little?)  So overall I think Enter the Gungeon is a very good game with some 'annoying' issues that can VERY easily be fixed if the devs just get to work on it so with all that said I would have to rate this game A MUST BUY for people who love games like Nuclear Throne and TBOI and an overall score of a 7.5/10 :D  ",
            "review_score": "1"
        },
        {
            "review_text": "Bougth the game today, LOVING IT!!! Thou i suck at it :D ",
            "review_score": "1"
        },
        {
            "review_text": "Binding of Isaac and Nuclear throne combo with lots and lots of guns. If you enjoy bullet hells, then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING GAME but it is crazy hard so beware",
            "review_score": "1"
        },
        {
            "review_text": "The game is good, and i love it's art but theres one problem... It doesn't have multiplayer via internet. That's the weak point. But rather than that this game is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "I play it like a Stormtrooper.",
            "review_score": "1"
        },
        {
            "review_text": "An extremely polished and detailed variant in the issac inspired rouglike genre.  The biggest difference from those games I feel is that not only is this more fun, but more depth.  Floors have a many possible rooms besides normal enemy rooms, which can be unlocked by unlocking npcs and completing challenges.  The most note worthy thing about this game is the variety of weapons, the game doesnt skimp out.  Theres a gun from every movie in here that shoots everything to any thing.  Theres even the ghost busters vaccum.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really good, but the upset about it is that it is difficult, sometimes u want to completely destroy everything in ur face like ur keyboard, ur mouse, but it is difficult in a good way. The way that makes u want to succed and progress on the game. I definetly recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "As someone who enjoyed Isaac and NuclearThrone, I knew what I was getting into. Loving the game so far and can't wait to play more of it!",
            "review_score": "1"
        },
        {
            "review_text": "whoever ♥♥♥♥♥ on this game because you sometimes cant get what you want needs to remember that its completely roguelike and random so its not the games fault its the seed and your playstyle  but i love this game its great for all nuclear throne/isaac fans and with a borderlands weapon system",
            "review_score": "1"
        },
        {
            "review_text": "Get ready to enter the punegon. The meaning 'bullet hell' is not exaggerated enough in this game.   Full of charm.  Buy it if you have money. If you don't, go to Norway and rob the bank. If that fails, it least you will go to a five star Norwegian jail with Xbox and Playstation. They might even have Enter the Gunegon.",
            "review_score": "1"
        },
        {
            "review_text": "I can't believe how difficult this game is. 5 hours in and feel as if I've barely scratched the surface. Of course at this point I only have made it to the 4th level a couple of times.",
            "review_score": "1"
        },
        {
            "review_text": "John Woo Action Scene:  THE GAME   Really good. I give it a 93 out of 17.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Dungeon Crawlers out there =)",
            "review_score": "1"
        },
        {
            "review_text": "If ya like to shoot stuff ya get to do that a lot in this game.  Like, a good amount more shooting than a regular game about shooting.",
            "review_score": "1"
        },
        {
            "review_text": "I just can't seem to stop, so just so I can get some closure I'll just try to get all the achievements. One more run! ...again! ...again! ...AGAIN!",
            "review_score": "1"
        },
        {
            "review_text": "Binding of Isaac meets Nuclear Throne.  AKA RNG-based trolling meets fast-paced bullet hell.",
            "review_score": "1"
        },
        {
            "review_text": "The most fun I have had playing a game in a long time. The game really shows how much effort was put in by the devs. The game play mechanics are spot on and it feels fun and alive. Prepare to be frustrated at times by your own lack of skill (especially when a stray bullet comes from off-screen to kill you on a good run). I do not think that the skill level required is too low as to make it boring, nor too high as to make it impossible; just dodge roll!",
            "review_score": "1"
        },
        {
            "review_text": "This game is charming as all hell. As someone who has about 700 hours in Binding of Isaac, and a relatively short time having played Nuclear Throne, I can say that this game is stellar, and brings a lot to the table. The art and animations are well made, the enemies are deadly cute, and you even get a ♥♥♥♥ING PUPPY! I'd recommend this to pretty much everyone who likes   either   Binding of Isaac, Nuclear Throne, Rogue-Like games, or a fun, yet difficult challenge. I give it 10 Pixel Puppies out of 10 Cricket's Heads.",
            "review_score": "1"
        },
        {
            "review_text": "Only five hours in and I'm hooked harder than I was on Binding of Isaac. While it is a difficult game and I have yet to beat the third chamber boss, I am enjoying it even when I'm getting torn to shreds. Would definitly recommend for any fans of Rogue-li(t/k)es or just enjoy kill cut little bullet dudes.",
            "review_score": "1"
        },
        {
            "review_text": "Just one more run. Just one more. (Looks at clock) Awww crap! I have to be up for work in a couple of hours?!",
            "review_score": "1"
        },
        {
            "review_text": "Pirated Game Played 3 Games Bought Game Bye",
            "review_score": "1"
        },
        {
            "review_text": "This game is Epic,   I've never played a rogue like that reminded me so much of so many other fun games, but had it's own driving twist. It's a challange right out of the gate once you get going. It's hard to put down, and easy to pick up. I get a laugh at every item I come across, and marvel at the skill needed to fight the enemies.  This game is Great, I can't wait to see this game expand!",
            "review_score": "1"
        },
        {
            "review_text": "Ok so first of i like this game alot so i'll list off what i like first to keep it simple  -Gameplay great (the way you move,shoot,roll,aim feel natural) -Art style is great and cute sets itself apart from most indie pixel art games -The Various Gun types are awesome, fun and silly which i really love -Table flipping mechanic is a unique feature -Falling down pit ins't a ♥♥♥♥ing insta kill thank ♥♥♥♥ing god -enemies and boss designs are great and varied -Npc's are cool looking and i've seen alot of them to save so that's cool  Now what i don't like  -First off the gun damage most of the guns you'll find look powerful but sadly they'll most likely do the same amount of damage as the standard pistol (3 shots to kill)  -Keys They're so ♥♥♥♥ing rare why? the drop chance is rare even with the hunter passive that guarantees item drops after a room clear it just doesn't and when you encounter a locked door use your only key to find a chest that needs another key you better pray to the almighty YV gun god for a key drop or that the shop keeper is selling another one because the chances they are slim :-I  -The game can be very painfully slow this is mainly because of gun damage and as i mentioned before it's get's worst for every floor deeper you get the more hp enemies get so a basic bullet that took 3 shots to kill with the basic gun now takes 4 shots (from what i can remember) and it increases every floor so guns that found on floor 1 can become useless on the 2nd floor because of the lack of dmg they do so dev's please fix this  -The Bosses ok so this one is more to do with the guns again doing ♥♥♥♥ poor chip damage which makes the fights tedious after a few encounters because you basically know the bosses patterns, attacks etc and it becomes a patiences test of how focused you can stay on the fight and not get hit because you're zoning out from how annoyling long it takes to kill the boss because your luck to get a decent gun was ♥♥♥♥.   -The shot shop keeper honestly ♥♥♥♥ this man ♥♥♥♥ this man in every way he's a stupid ♥♥♥♥♥♥♥ firstly he will only sell to you (yes i know the green guy buys your guns but still he's the shop keeper not the slime ball the slime ball should give you more for your guns while he gives you less)  secondly the amount of items he sells on every floor never increases but it doesn't from what i can tell (it's not like binding of issac's shop mechanics) Thirdly this mother ♥♥♥♥er will lock his shop door forcing you to waste a key if you just want to see what he's selling now i wouldn't be bothered by this IF KEY'S WEREN'T SUCH A RARE ♥♥♥♥ING DROP!!!! and when you get in his shop he might not even be selling a key so your ♥♥♥♥ out of luck  -some enemies are able to fire off a bullet while your hurting them This only bothers me because they do a stun animation whenever you hurt them so you don't really expect especially if you've played nuclear throne where most of the enemies won't attack back if you shoot them and they do a stun animation so don't stand still even if it's the last guy in the room  -the chest colour so i theorized that the chest colours represent what item you'll get from them like green chest is a gun chest and etc but from memory i found out no it's all random for no reason so when you start out on first floor opening a chest hoping for a amazing gun and get a ♥♥♥♥ active you'll get mad and saltly because you just wasted a key.  -Forget about getting a crazy build like in binding of issac it ain't happening passives can only be brought or found in chest and the amount of keys you'll find or money you'll get wont be enough and most passives or in this case passive i've found don't really increase damage :I  -Lastly the ♥♥♥♥ing Rat npc is the most obnoxious thing ever put into a video game if you don't know what im talking about then you haven't left an item in a room alone before, basically this rat mother ♥♥♥♥er steals your items that you leave alone in rooms now i know that doesn't sound bad but no it really is because soon as you leave the room and that item is off screen he spawns and steals now granted you can stop him BUT i have no clue if he keeps coming back! SO DO NOT LEAVE AMMO BOXES, PASSIVES, ACTIVES AND GUNS ALONE HE WILL STEAL THEM!!! but i think what really pisses me off about this unnecessary obnoxious game mechanic is the rat will leave you a note basically calling you a ♥♥♥♥♥♥ because you though that item was safe alone and you could come back for it later to replenish your gun or pick it up after you sell the active item you don't want. So in short ♥♥♥♥ you devs i better be able to kill this ♥♥♥♥ for good at some point in the game so he never comes back or steals your stuff.  so would i reccomend hmmmm yea score 6/10 ♥♥♥♥ that ♥♥♥♥ing Rat",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game. Now that I got that out of my way, lets look at the things that need altering  There are tons of pros in this game and I'm lazy so sit with my little cons  When a room is cleared, the movement speed needs to be buffed. I know teleporters exist, but wouldn't it be nice for every room to have one?  Enemy bullets should harm other enemies. This would impose cheap strategies like sitting behind walls  These suggestions should make my runs shorter than thirty minutes each time. Thanks for reading",
            "review_score": "1"
        },
        {
            "review_text": "If only I could kill all the time i'm going to waste playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Mix of Binding of Issac, Crypt of the Necrodancer and Spelunky. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is the prefect blend of Binding of isaac and Nuclear Throne. If you love either of those games i highly suggest you buy Enter the Gungeon",
            "review_score": "1"
        },
        {
            "review_text": "Fast-paced, well-themed Rogue-lite. The reloading isn't awkward, and the enemies certainly aren't bullet sponges (except for the bosses, which is an understandable design decision). I am really thrilled: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I'll keep it sweet.  Pros: -Extremly addicting (even solo) -Oddly rewarding for a game where you lose everything when you die -Asthetically pleasing -Under $15  Cons: -A rather steep learning curve for mastery of chambers (Not getting hit once) -Lack of customization  Summation: I excluded all other points to make about this game, because they lack relevance to me. 9.5/10 Would reccomend!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent roguelike. Nails 'gamefeel.' A ton of content. Would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "6 hours in and this game is *amazing*.  Buying this is luke upgrading from Binding of Isaac and Nuclear Throne - *plus* gorgeous pixel art.",
            "review_score": "1"
        },
        {
            "review_text": "Finally another truly great Twin Stick Shooter. The best since Dead Nation on PS3 and Geometry Wars before it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is everything you could want in a Rouge-Like game. The art style is great. The music is appropriately chosen and sound effects are intense. It's easy to pick up and get into, and challenging and fun to master.  The game does a great job of being challenging without ever feeling impossible. The controls are tight and you feel agile.  I truly love this game, it has a certain charm that other games of this sort lack. I love the inclusion of local co-op, but my biggest complaint is no online multiplayer. While certainly a daunting task to engineer from an indy developer, it would absolutely be 100% worth it.  Cons: Very little reward or drops. Breaking jars and barrels will never give you anything.  No multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "Great game only thing it is missing is online coop! besides that LOVE IT!",
            "review_score": "1"
        },
        {
            "review_text": "My Review for: Enter The Gungeon  If you don't feel like you may enjoy this game buy the game and set a timer for an hour and forty five minutes this will give you plenty of time to figure out if this game is your kind of game.  What I enjoyed Its brutal.. In a good way getting destroyed by enemies and bosses made me actually observe there patterns and mechanics to overcome them whether that meant dieing dozens of times to a boss it made it ever more satisfying to finally lay them down instead of getting my hand held by and proceeding to steamroll everything.  *On a side note if you need help got to the discussions page the devs are active and the community is as well  Negatives? I cant find any but if I do they will be updated to the review I guess you can say difficulty but its highly opinion based  TL;DR Buy this game if you enjoy rogue like games such as Isaac   ",
            "review_score": "1"
        },
        {
            "review_text": "Enter the Gungeon is currently a strong base for a great game. As long as the devs continue to provide updates, I look forward to playing this for a while.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much everything I've been hoping for in a rogue-like for a very long time. I thought Nuclear Throne would be my last hope after Binding of Isaac's RNG failed me, but Enter the Gungeon has quickly become my new mistress. After 200 hours in BOI, I can't wait to see what this has to offer.",
            "review_score": "1"
        },
        {
            "review_text": "Roll dodged into a pit full of spikes.  10/10 would do that again.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Very difficult, but not without its rewards. I'm finding that so far, as a novice of the game and its systems that 'winning' the game isn't as fun as just playing the game. As a developer of a similar game, having Enter the Gungeon in my library is an honor.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, I have seen people complain about difficulty but I think it's hard in a good way. I have not beat the thied chamber in 6 hours of gameplay but I am still able to progess as in unlock guns and npc's, which is a big plus. The music on the main menu is brilliant and the art work is great. Overall I can't think of a bad thing to say about Enter The Gungeon. I'd honestly give it 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great rougelike with awsome animations and style. I personaly love the feel of it. Be warned IT IS DIFFICULT you will die a lot. The guns are plentyful and it feels great when you pick up a new one. Some are pretty terrible and some are amazing. There seem to be lots of secrets to unlock and challanges to do. The bosses can be insane but with practice mastery is attainable. My only sadness with the game is the lack of unlockable characters as there are only 2. I was hoping there were many more like in the Binding Of Issac. I hope they add new characters and chambers in an update or DLC. The co-op mode is fun but still super hard. If you enjoy games like the Binding Of Issac and want something new to master this is the game for you. As I said before the game has a dark souls level of difficulty, know this and get gud.",
            "review_score": "1"
        },
        {
            "review_text": "JESUS, yeah, this game, I mean... It's really awesome, obviously but there really needs to be more loot... yeah... hard af too but it might just be that I suck... Take it for sure if you like games like binding of Isaac and Crypt of the necrodancer (sucks that Devolver didnt make such and awesome job for the music as in Hotline miami tho)",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would flip tables again. sweet twin stick shooter. heavily recommend a gamepad (But not essential).",
            "review_score": "1"
        },
        {
            "review_text": "Oooh. Guns, guns, guns! C'mon, Sal! The Tigers are playing... tonight. I never miss a game.",
            "review_score": "1"
        },
        {
            "review_text": "-Lots of guns  -Lots of puns  -Lots of difficulty  -Futurama reference  10/10 would roll into spikes again",
            "review_score": "1"
        },
        {
            "review_text": "1. I entered the Gungeon 2. I lost almost all hearths while fighting with iron maiden 3. I found weapon which says 'Bullet' while shooting and his bullets form word 'Bullets' 4. I rolled into wrong direction, falled down into abyss and died.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "You can finally fight the Eagle from Broforce.",
            "review_score": "1"
        },
        {
            "review_text": "Plain fun. A blast. Runs fast and smooth. Hard but fair.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun rouge like game, that I've only put so much time into, but love nevertheless. Play this game! Please, it's worth every cent!",
            "review_score": "1"
        },
        {
            "review_text": "I am glad that I Entered the Gungeon",
            "review_score": "1"
        },
        {
            "review_text": "This is pretty much if The Touhou Project and The Binding of Issac had a Child.  And then that Child got a gun-license.  So to Answer your question; Yes, It's fun but hard as hell.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just so cool, a lot of enemies, bullets, guns, npcs, bullets, items, bosses, secrets and what else.. umh oh yeah.. Bullets!   If you like rougue-like/bullet-hell games, and you looking for some challenges in your games just give a chance to EtG and you wont regret.",
            "review_score": "1"
        },
        {
            "review_text": "Game is extremely fun and entertaining! a few kinks but it will get fixed soon! very enjoyable and exciting gun fights! Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Quite a fun game defintelly can ♥♥♥♥ you off if you mess up, but the thing is you know it was your fault and not the games. If you love a challenge this game will feed that addiction to beat it. Only gotten through three levels so far and have loved every pulse pounding, dodge rolling, gun toting second. If you don't like bullet hells or rogue likes AVOID THIS GAME. If you do, buy it faster then your mouse can click.",
            "review_score": "1"
        },
        {
            "review_text": "Seems Dark Souls didn't use condom when It hitted on Binding of Isaac.",
            "review_score": "1"
        },
        {
            "review_text": "Great game i love it, one of the best games that you can buy for 15e.",
            "review_score": "1"
        },
        {
            "review_text": "I have played my first hour and I am pleasantly surprised. This game is like The Binding of Isaac with guns and better UI, you needn´t to search items on the web, because you cam look into 'inventory' at any time and there you can see info about all items and guns, which you found. Different characters have different starting items like in Isaac and you can find out their abilities just in the menu by inventory. We might also say, that it is nuclear throne with different graphic and items and of course better UI, but there is much more guns, than in nuclear throne.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is Super COOL!! i would love this game even more if they added online mupilyplayer then i would die TWICE!!",
            "review_score": "1"
        },
        {
            "review_text": "Pros: +Replayability since it's a rogue-like +Very beautiful pixel art +Free updateeee +Around400 items and guns +Good curve of difficulty  Cons:  -Unfair to new players -When you run out of content to buy in the breach (menu) you don't really have a purpose to play other than for fun -No online multiplayer (yet)",
            "review_score": "1"
        },
        {
            "review_text": "This game has stolen so many hours from my life. If you're into rouge-likes in the vein of Nuclear Throne, Binding of Isaac etc, I can't recommend this enough. One of my favorites this year by far.",
            "review_score": "1"
        },
        {
            "review_text": "Y DO I KEEP DYING??!!   10/10 Would rage again",
            "review_score": "1"
        },
        {
            "review_text": "You're just a simple person that wants to destroy your past by destroying a gungeon with a whole lot of guns. It's pretty fun :)",
            "review_score": "1"
        },
        {
            "review_text": "This game has terrible controller support. I guess it works with xbox controllers, but any other controller seem to not work without hacking around. The claim that this game has full controller support is a lie.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a keen fan of rougelikes with me having over a 100 in the 2 Binding of Isaac games so when i heard of this game i immediately purchased it and i haven't looked back since. It's a load of fun and while difficult at the beginning what rough-like isn't. A must play.",
            "review_score": "1"
        },
        {
            "review_text": "Don't question buying this game. Just go enter the Gungeon.",
            "review_score": "1"
        },
        {
            "review_text": "I hate ♥♥♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "It's like the Binding of Isaac, except instead of a crying little boy using his own tears to fight an army of mutated fetuses, you're a badass hero using an assortment of laser guns and T-shirt cannons to fight a legion of sentient walking bullets who are wielding machine guns.  I love this game so ♥♥♥♥ing much.",
            "review_score": "1"
        },
        {
            "review_text": "Highly addictive, I love it!",
            "review_score": "1"
        },
        {
            "review_text": "+ adorable graphics + nice soundtrack + you shoot bullets at bullets  BULLET / 10",
            "review_score": "1"
        },
        {
            "review_text": "I didn't think NRA propaganda would be so much fun.",
            "review_score": "1"
        },
        {
            "review_text": "I'm having a lot of GUN with this game.  It's also really fun too.",
            "review_score": "1"
        },
        {
            "review_text": "imagine binding of isaac but 99% of items are pageant boy and lemon.  then imagine that every chest is locked and there are no keys on the level, but you have high hopes so you rake through every boring carbon copy room to find one.  then all the bosses have tons of health and boring attacks so every level ends with 30 minutes of bullet spamming and dodging predictable attacks.  Then you try co op and the camera makes you want to vomit.  And you have to split items with your partner.  and you can't get items if your partner is dead.  also it's extremely rng heavy.  and worst of all, the game is SLOW and BORING.  every encounter is just a stand off where you fire bullets about as harmful as pillows and dodge giant clouds of extremely slow attacks whilst the same dull music plays on an incredibly small loop.  there are maybe 12 interesting guns or powerups in the game with everything else being indistinguishable and dull  On the bright side, the hitboxes are excellent, the animation is charming, and the pc controls are pretty good, with the exception that your dodges are not influenced by the direction you are facing.  I greatly regret my purchase, despite having bought it during a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Adolf Hitler (German: [ˈadɔlf ˈhɪtlɐ] ( listen); 20 April 1889 – 30 April 1945) was a German politician who was the leader of the Nazi Party (NSDAP), Chancellor of Germany from 1933 to 1945, and Führer ('leader') of Nazi Germany from 1934 to 1945. As dictator of Nazi Germany, he initiated World War II in Europe with the invasion of Poland in September 1939 and was a central figure of the Holocaust.  Born an Austrian citizen and raised near Linz, Hitler moved to Germany in 1913 and was decorated during his service in the German Army in World War I. He joined the precursor of the NSDAP, the German Workers' Party, in 1919 and became leader of the NSDAP in 1921. In 1923, he attempted a coup in Munich to seize power. The failed coup resulted in Hitler's imprisonment, during which time he dictated the first volume of his autobiography and political manifesto Mein Kampf ('My Struggle'). After his release in 1924, Hitler gained popular support by attacking the Treaty of Versailles and promoting Pan-Germanism, anti-Semitism, and anti-communism with charismatic oratory and Nazi propaganda. Hitler frequently denounced international capitalism and communism as being part of a Jewish conspiracy.  By 1933, the Nazi Party was the largest elected party in the German Reichstag, which led to Hitler's appointment as Chancellor on 30 January 1933. Following fresh elections won by his coalition, the Reichstag passed the Enabling Act, which began the process of transforming the Weimar Republic into Nazi Germany, a one-party dictatorship based on the totalitarian and autocratic ideology of National Socialism. Hitler aimed to eliminate Jews from Germany and establish a New Order to counter what he saw as the injustice of the post-World War I international order dominated by Britain and France. His first six years in power resulted in rapid economic recovery from the Great Depression, the effective abandonment of restrictions imposed on Germany after World War I, and the annexation of territories that were home to millions of ethnic Germans—actions which gave him significant popular support.  Hitler sought Lebensraum ('living space') for the German people. His aggressive foreign policy is considered to be the primary cause of the outbreak of World War II in Europe. He directed large-scale rearmament and on 1 September 1939 invaded Poland, resulting in British and French declarations of war on Germany. In June 1941, Hitler ordered an invasion of the Soviet Union. By the end of 1941 German forces and the European Axis powers occupied most of Europe and North Africa. Failure to defeat the Soviets and the entry of the United States into the war forced Germany onto the defensive and it suffered a series of escalating defeats. In the final days of the war, during the Battle of Berlin in 1945, Hitler married his long-time lover, Eva Braun. On 30 April 1945, less than two days later, the two killed themselves to avoid capture by the Red Army, and their corpses were burned.  Under Hitler's leadership and racially motivated ideology, the Nazi regime was responsible for the genocide of at least 5.5 million Jews and millions of other victims whom he and his followers deemed Untermenschen ('sub-humans') and socially undesirable. Hitler and the Nazi regime were also responsible for the killing of an estimated 19.3 million civilians and prisoners of war. In addition, 29 million soldiers and civilians died as a result of military action in the European Theatre of World War II. The number of civilians killed during the Second World War was unprecedented in warfare, and constitutes the deadliest conflict in human history..",
            "review_score": "1"
        },
        {
            "review_text": "After few runs i can already recommend this amazing game. If you like TBOI or/and Nuclear Throne you will have great time playing Enter The Gungeon.",
            "review_score": "1"
        },
        {
            "review_text": "OMFG just got to the end of the tutoriel but it's still ♥♥♥♥ing amazing!!",
            "review_score": "1"
        },
        {
            "review_text": "It is definetly Binding of Isaac style game. And I love it  Gd work anyways, love the graphics, its so cool and the animations are great  Wp",
            "review_score": "1"
        },
        {
            "review_text": "This game is so cool, it sucked a guys ♥♥♥♥ for a bus fare, and then it WALKED. This game is so cool, it slept with my girlfriend, and I didn't even care. This game is so cool, I had to beg for my life when it threatened to kill me. I rate it 9/11",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - The game is difficult but not unfair - The theme song is badass - Tons of guns - Everything is a pun - Everything is a reference to something else - Beautiful art style - Loads of content and replayability Cons: - ???",
            "review_score": "1"
        },
        {
            "review_text": "This game is superb! I am having a blast and it definitely reminds me of Binding of Isaac (BoI). I have played 285 hours of the Binding of Isaac and 115 of Rebirth. If you like BoI you should try this game out. I am very happy with it and adds a fresh twist to the gameplay I love in the Binding of Isaac.  Randomly generated, making every run unique? -Check Tons of awesome weapons and items? -Check Cool Bosses? Check A way to upgrade the loot that has a chance to drop while in the Gungeon? -Check  10/10",
            "review_score": "1"
        },
        {
            "review_text": "First day review: This is an extremely action packed game similar to binding of isaac. I'm totally ♥♥♥♥ at this game but every time i dodge a bullet i feel like a god damn champ. Also definetely use a controller if possible",
            "review_score": "1"
        },
        {
            "review_text": "Terrible for people who are not on a scale of 1/10 10 being greatest. A 8 at Bullet Hells",
            "review_score": "-1"
        },
        {
            "review_text": "This game is exactly like my sex life. I only lasted until the first boss, then I stopped trying.",
            "review_score": "1"
        },
        {
            "review_text": "Next rogue game you must own",
            "review_score": "1"
        },
        {
            "review_text": "Warning Co-op is local Co-op so not online i bought the game to quickly i guesse and based on the trailer saying co-op i thought it would be online but it isnt... its co-op on your own computer though there is a guide showing you how to co-op but its tricky and in my case i havent got it to work yet. Other then that the game is playable.. but i wouldnt recommend it untill Co-op is online.  EDIT: Gampeplay is fun but devs FFS give the super bullet a higher % to spawn cause jezus christ i can play 5 whole games to the end game and i still wont see 1 what? i playd 80+hours and i only saw 6? and killd 5... 3 out of 5 were cause of burn dmg that i didnt create and twice cause i shot him dead because he spawnd out of my screen and i had a gun that shoots through multiple enemys -.- i got 1 though yay 4 more to go that would prob take 200+ hours to complete f*cking b*llsh*t.",
            "review_score": "-1"
        },
        {
            "review_text": "Binding of Isaac + Nuclear throne = Enter The Gundeon+loads of fun B.U.L.L.E.T B.U.L.L.E.T B.U.L.L.E.T B.U.L.L.E.T B.U.L.L.E.T B.U.L.L.E.T B.U.L.L.E.T B.U.L.L.E.T",
            "review_score": "1"
        },
        {
            "review_text": "Killed the first boss once because I got lucky with power ups and guns and now I can't do it again, bullet hell gods please go easy on me! 9/9mm.",
            "review_score": "1"
        },
        {
            "review_text": "Granted I haven't spent a lot of time on this game. I think I've only spent an hour or so playing with just two characters and I'm already hooked. If you dumped some crazy over 200+ hours into The Binding Of Isaac, will do it here for sure as well. Excellent sound track. Easy controls. I haven't tried using a controller since this game supports it. Just from the little bit that I have played though on single player, I can say I have enjoyed the experience and plan to just dump more hours into playing this. The enviorment can be trickey in the lower stages or in certain areas. With so many bullets flying your way you might forget about what is around you. I know I have.   Let me just say... Mistakes were made. Big time. Numerous times on my end. I don't find it disturbing the flow of things.  A rouge bullet hell dungeon crawler? Yes please. Thank you. Now to no longer exist for hours at a time because I'll be too busy dodging bullets and firing mine back. I highely recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "A magazine packing with moments of joy",
            "review_score": "1"
        },
        {
            "review_text": "A accurate recreation of the Jonestown Massacre.",
            "review_score": "1"
        },
        {
            "review_text": "Alright, so uh Enter the Gungeon...gonna jump right into this and say it's a good ♥♥♥ game and possibly one of my favorites of the year so far.  The Guns: Well you start with a decent little pistol with infinite ammo. When you're in the chambers (The Gungeon) You'll come across chests that require keys. Some of said chests contain guns. A TON of guns that all work very differently and have special little charm to them where you'll either love the gun to death or you'll hate it. It's up to you. Now I've got an OK amount of hours (I mean I think I do I dunno...) put in and I've yet to find even half of the guns. And mind you you'll actually be adding guns into the Gungeon from 'special' shopkeepers by ordering them. The Guns TL;DR: You get a good pistol, and you'll find a lot of guns in chests.  The Stage Variety: Oh boy where to begin...so basically the game is always randomly generated so every run you do will different from the last. Each chamber is pretty big so there's always plenty to explore. You're given a radar so if you think you've missed anything don't worry you're covered it'll tell you pretty much everything (which rooms you've been in and haven't been in) and such). There's also parts that require some platforming...nothing to write home about, but hey it's there I guess. The Stage Variety TL;DR: Randomly generated levels, you get a cool radar and there's basic platforming.  The Bosses: Ah yes...the bosses...they're hard if you've got poop-tier guns (and yeah you'll get a few poo poo-tier guns). The bosses themselves have lots of charm to them, You'll be fighting a bird that has a musclear human's body that's carrying a gattling gun to fighting two giant bullet twins. They're all very difficult and have some sort of special move aside from well y'know shooting. The Bosses TL;DR: They're all 10/10  The Lore: Okay this game has some really fun lore. All those tons and tons of guns you find in the game? They all have a story. Some a little deeper than others, but lore is lore at the end of the day. It's nothing crazy, but they might give you a light chuckle or two or intrigue you. Even the enemies have some affiliation with why the Gungeon is the way it is so you'll learn more as you face different enemies. The Lore TL;DR: The guns and bad guys got stories.  The Enemies: Okay there are a lot of enemies ranging from cute little bullets to slime monsters, to giant knights. Each enemy needing to be taken on a certain way and will attack you in a unique way. Learning every enemy is HIGHLY essential in this game if you want to progress. The Enemies TL;DR: There's a lot of them and they will most definitely ♥♥♥♥ you up.  Well there you have it it's a great game and I highly recommend this to any dungeon crawler...or anyone that just likes guns really.",
            "review_score": "1"
        },
        {
            "review_text": "I have entered the Gungeon. Can I stay here?",
            "review_score": "1"
        },
        {
            "review_text": "if first you dont win, try try again.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Spelunky, Raiden Project 2, and Binding of Issac all had sexual relationships and spawned a challenging Rogue-like that relies almost purly on gamer skill. It's challenging, and fair. Everydeath teaches you something new, every run goes faster and smoother. If you played Touhou Project, this will be a cake walk in bullet dodgeing, but the varried enemies add a fresh hurdle.  Only Con:  -Treating player 2 like rubbish. It's funny, but meh. Would of been nicer to have two gungeneers in place of a Child of the Cathedral from fallout 2.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun and challenging which makes it a great game. Everytime you die the levels change but the only problem I have with this game is there isn't a kind of save game option or when you die it takes you back all the way to the first chamber. Don't like it at all. Please change it other than that its a great game !!!",
            "review_score": "1"
        },
        {
            "review_text": "I can't stop play",
            "review_score": "1"
        },
        {
            "review_text": "I murdered a couple twins with a pillow that shoots pillows...",
            "review_score": "1"
        },
        {
            "review_text": "They did it Jim",
            "review_score": "1"
        },
        {
            "review_text": "Don't like BoI or Nuclear Throne, this is the 144+ FPS ultimate mutation of the two!",
            "review_score": "1"
        },
        {
            "review_text": "A WaterShotGun that makes barrels explode. ... ... ... ... ♥♥♥♥ing hell m8.   Gameoftheyear out of 8 - IGshrek   ",
            "review_score": "1"
        },
        {
            "review_text": "You can shoot people with a lower case 'r'",
            "review_score": "1"
        },
        {
            "review_text": "Really good. A bit like Binding of Isaac but bigger and better looking and with guns, dogde rolls and bullet hell elements. One thing that BoI does better though is the visual character progression. You can really see how the progress in the game changes your character. This game is a lot harder than BoI though. Be prepared to die a lot. Especially when going up against one of the many bosses.",
            "review_score": "1"
        },
        {
            "review_text": "Best Isaac that is not Isaac",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Flipped my table more often than in the actual game.  Full 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, highly recomend. Similar to Binding of Isaac and Nuclear Throne. Lots of variety, encourages replaying to see new things and have new experiences. IT'S SOOOOO GOOOOOD!",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "I pointed gun and shot  10/10",
            "review_score": "1"
        },
        {
            "review_text": "first day having it 10/10 7.4 hours into game :D",
            "review_score": "1"
        },
        {
            "review_text": "Everything about the sound design, soundtrack, and even the sprites feels good. I couln't have asked for a better game.",
            "review_score": "1"
        },
        {
            "review_text": "Difficult as ♥♥♥♥. I love it!",
            "review_score": "1"
        },
        {
            "review_text": "HELL. YES.",
            "review_score": "1"
        },
        {
            "review_text": "No words to describe. ┬─┬﻿ ノ( ゜-゜ノ)  (╯°□°)╯︵ ┻━┻  ┬─┬﻿ ノ( ゜-゜ノ)  (╯°□°)╯︵ ┻━┻ ︵ ╯(°□° ╯)",
            "review_score": "1"
        },
        {
            "review_text": "-Got brother involved -Beat a boss -Went into next room and saw a coffin -Both died  Restarted -Simillar scenario with a coffin amoungst many other enemies -Killed them all -Left Satisfied  Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Its ok.  I find the guns underwelming compared to other games available. Its very slow paced compared to nuclear throne. I still have a single ♥♥♥♥♥♥ 6 shot and i've killed the boss 10 times. I have no idea how to improve the runs...  ",
            "review_score": "1"
        },
        {
            "review_text": "Litteraly a bullet hell type game. The games wepons are also increadbly cool or goofy, ranging from Bannana Bombs, to Tommy Guns, to a Dungeon Eagle, ya a f***ing Dungeon Eagle.",
            "review_score": "1"
        },
        {
            "review_text": "Holy this game is addicting",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of my favorite roguelikes to date, and I love roguelikes.",
            "review_score": "1"
        },
        {
            "review_text": "I saw a drunk blue lizard thing? Hits close to home... 10/10",
            "review_score": "1"
        },
        {
            "review_text": "If Binding of Isaac had a butt-baby with Nuclear Throne.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know how to feel about this game. It seems good, the idea is nice, it looks great (shell hearts as hp looks awesome), but it lacks certain something that would keep me playing for longer periods of time.  Sure, the game has A LOT of guns, but most of them feel mostly the same. There are few exceptions of course, but most of the time when you pick up a new gun it will be either higher magazine, higher damage or higher fire rate when compared to your starting weapon.   You also can pick up items, but they seem 1 dimensional, if that makes sense. They don't change the way you play, they just offer you a little bit of a boost. I got spoiled by The Binding of Isaac: Rebirth I guess and I was expecting some crazy syngergies, but all I got was a duct tape that I can use to tape two weapons together.  Overall it's not a bad game, but it lacks polish. The balance is bad, bosses seem unfair at times and it lacks interesting synergies to keep you playing, so you can discover more of those. I hope it will get updated, because it could be a really, REALLY good game. A game that you will play for hundreds of hours. But right now I cannot recommend it as it lacks that 'something' that would make me want to play more of it.",
            "review_score": "-1"
        },
        {
            "review_text": "Perfect!",
            "review_score": "1"
        },
        {
            "review_text": "It's boring. It's a clone of an already full genre and it brings nothing new to the table. Might be worth buying if it's on sale for like $4 or less but certainly not worth paying full price for.",
            "review_score": "-1"
        },
        {
            "review_text": "A gun that shoots bees, nuff said. 10/10",
            "review_score": "1"
        },
        {
            "review_text": " More like   Enter the Pungeon   amirite?",
            "review_score": "1"
        },
        {
            "review_text": "Honestly pretty mediocre the whole way through. Bosses are too tanky. You can't get OP like you do in Isacc and synergies are rare. Also I really hate how enemies get more health every floor, instead of the game just throwing different ones at you.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like having a good time then you will like Enter the Gungeon.   Fun/10",
            "review_score": "1"
        },
        {
            "review_text": "Has full health before entering room  Dies in room  -_-  ♥♥♥♥ this game",
            "review_score": "1"
        },
        {
            "review_text": "yes I like this game very much",
            "review_score": "1"
        },
        {
            "review_text": "I don't know yet, seems to be good, can't run cause don't have new pc yet",
            "review_score": "1"
        },
        {
            "review_text": "step 1: complete tutorial step 2: get into actual game step 3: aquire water gun step 4: ♥♥♥♥ off shop keeper step 5: get shot down to half a heart by shop keeper step 6: fight giant bird with a gatling gun step 7: get bombed by the missles it shot out of its mouth  9/11 would be bombed again",
            "review_score": "1"
        },
        {
            "review_text": "sick game",
            "review_score": "1"
        },
        {
            "review_text": "Edit:  A) If you haven't already played Gengeon, you'd be doing yourself a favor by doing so as your soonest convenience.  B) The co-op is functioning fine. But it isn't obvious how to enable it. There is a dude in a purple robe in the main lobby that you must talk to, and then he asks if you would like to turn on Co-op. Then you you need to open settings and change player 2's controller scheme to 'Controller 2'. However, the second player gets shafted as they don't get to choose from one of the protagonists. Instead, they are forced to play as that boring Purple Robed sage whose skill is a singke-use heart-shaped cookie that brings your companion back to life. I think he is a good enough character that he could have made the ranks of the normal heroes, but forcing us to use him is a bit drab.  C) Reviews are the best place to voice technical issues. A forum has no relevance and often glarig issues can be buried u der pages of help. While a review has tangible effects on a title that developers will eventually need to acknowledge if enough negative reviews get posted.  Original Post: Local co-op doesn't work with Xbox One Controllers. It detects both controllers as X-Input Controller #1 so both players control the same character. Unable to even review the co-op mode as it doesn't work.  Under settings, I configured Player One as Controller-1, and Player 2 as Controller-2 but it doesn't fix anything.",
            "review_score": "1"
        },
        {
            "review_text": "T his game is super super addictive beware bullet hell is an understatement.. the game is very difficult especially if you aint skilled at skill games but i am and still i struggle sometimes 4th floor is the highest i got to the bosses are overwhelming especially for the early floors like boss 2 medusa look a like is much easier than boss floor one ammo is ahrd to come by unless you are marine but i love the challenge and the weapons i mean omg the weapons!!!!!!!!!!!! lmao ... so many and so funny one of them things you have to buy it to experience it this game is amazing better than the classic game alike game like this forgot what its called but this game beats them all happy i paid the price for this. i racked up 22 hours in space of two days so addictive please buy if you want a challenge and fun... p.s it is easier if you gain plenty of passiv eitems to help you a long the way like the table flip bang one tech ones are best and the necklaces you could complete this game 10 times and still not found every time there are so many secrets to that i have figured out with no help atall i love the minigames to so much of a comical yet challenging game x ... the game can be unbalanced sometimes regarding weapons and moeny unelss you play on best mode then not a problem",
            "review_score": "1"
        },
        {
            "review_text": "a gun that shoots the word bullet exists here 10/10",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing ♥♥♥♥♥♥♥t you cant beat any challange 'dont doge roll' the next room you have to doge roll to finish the room ",
            "review_score": "-1"
        },
        {
            "review_text": "I played The Binding of Isaac for hundreds of hours. I played Nuclear Throne for houndreds of hours.  Now I'll play Enter the Gungeon for hundreds of hours.   10/10 cutest bullets ever",
            "review_score": "1"
        },
        {
            "review_text": "There are guna that shoot words, there are water guns, there are many guns and its great",
            "review_score": "1"
        },
        {
            "review_text": "The game is very well-made, it has a nice soundtrack, the style in the game is good, the story is good too. But there's one thing: It is very annoying because if you die, you have to start at the beginning, no checkpoints or something like that, and that is the only negative about this game, if there where checkpoints and more health drops the game would be just awesome. But for now I won't play this game anymore until there's something done with it becasue this is too annoying for me. I would rate this game Yes if it had somekind of chekpoints and more health drops but for now I don't recommend this game if you aren't good in playing games and if you don't like a game where you die and need to start at the very beginning of the game",
            "review_score": "-1"
        },
        {
            "review_text": "It's like if Nuclear Throne was much slower-paced and 20% as satisfying.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is way too dependent on luck.",
            "review_score": "-1"
        },
        {
            "review_text": "I love challenging games, but, when the challenge comes from the random chance to get a decent gun on the first few floors then the challenge just feels cheap.   The stock weapon you are given at the start sucks and it's meant to suck, but most of the guns you find are pretty crap as well. The game really starts to shine in the rare event that you find a cool combo of guns and items.   That's not to say this game is terrible. It has it's moments and with some patches I'm sure this game could be amazing and addictive.  I just personally couldn't get into the slot machine style chance gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Hunters revolver realod animation is worth the 15$ on its own.",
            "review_score": "1"
        },
        {
            "review_text": "bad rats was better game is terrible",
            "review_score": "-1"
        },
        {
            "review_text": "I'm too lazy to write a full review, so here is the short version:                        It's real good srsly.                 Also if you hold down ALT while in the menu screen everything goes blurry, for some reason.",
            "review_score": "1"
        },
        {
            "review_text": "Guns don't kill people.  Ridiculously hard Rouge-likes do.  Look it up bro, this ♥♥♥♥♥♥♥t probably gives out more heart attacks than mcdonalds.",
            "review_score": "-1"
        },
        {
            "review_text": "C'mon dev, Can we please get online multiplayer? The game just feels laking when I can't play with a friend.",
            "review_score": "-1"
        },
        {
            "review_text": "Difficulty, difficulty, difficulty. Where can I start?  This game is honestly just too hard, coming from someone who has godhead in Isaac and looped many times in nuclear throne. Why is it so bad? Lets start with the dodge rolls. If you dodge roll, there is about a second before it is actually executed, then you roll, stand up, and almost always die because of the HORRIBLE bullet placement that makes the game practically impossible.  Guns Unique, funny, horrible, punny, etc.  Enemies. Too much health and fire rate  Bosses Way too tanky at first and way to trashy during and after floors 4 5 and 6  Graphics Fine",
            "review_score": "-1"
        },
        {
            "review_text": "Takes heavy inspiration from binding of isaac, mixing ti with some nuclear throne. I would reccomend geting either of those two instead of this one.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game, 8/10 for content.   However, the tutorial is almost useless and gives 0 indication of the fact that NPCs exist. Nor do any NPCs function properly; the supposed 'elevator repairman' didn't do anything. The boss currency shop doesn't give me the items I buy.  ",
            "review_score": "-1"
        },
        {
            "review_text": "At this point, the game is not worth it. The lack of progress, lack of gun drops/health just make the game slightly too difficult to be fun. They should implement a system similar to Rogue Legacy, where you can level up and be better off after every run. The game is still fun, the music is great and the mechanics are fine.",
            "review_score": "-1"
        },
        {
            "review_text": "Do yourself a favor and save your money for something better, much better. My first gripe with this 'game' is that whatever character you choose will be slow and clunky. Yes, the control is responsive. It just feels like it should be more polished in terms of maneuverability. But the most important issue is the sheer stubborness of this 'game' to give out any frickin' guns that don't need constant reloading. If levels, weapons, and loot are random why not the starting weapons too?   This game could be decent but it just kills itself with an over emphasis on reloading. Christ, just thinking about any kind of pistol in this game makes me wish the earth would explode. I can't effectively articulate how dreadful and monotonous it is to reload every two seconds because the game refuses to dish out any weapons worth using. Chests suck. The shop sucks. Maybe if you're a witch you could be lucky and conjure up something funcional. If you do, kudos. Then go fight a boss with the reloader, I mean pistol. It already feels like an eternity to kill regular foes with the pistol, but boss battles with the pistol feel like writing a novel that is written by engraving it on stone tablets with a chisel.   Hell, I'd say about a third of the guns I've come across are one shot then reload. Frickin' seriously? Shooting stuff hasn't been this tedious since soldiers used muskets in the Revolutionary War. I once saw a video of someone getting to level nine without the sword on the first Legend of Zelda. And that's what this game reminds me of, an unnecessary lesson in tedium. Make the game tough as nails but give people a reason to play through it.   This game should be focused solely on a white knuckle intense experience. Instead, you get one very long reloading tutorial. As a warning, you have to play the actual tutorial. This is where you will get first hand experience at how much it will suck to shoot that cursed pistol.   Don't let the developer of this reload fest take your money and laugh at you like they did to me. Run. Run far away from this reloading fest. Never look back. Just. Run. Away.   If you've taken my advice you are now fifteen dollars better off. You're welcome.  Oh yeah, and way to copy the Ninja Gaiden 2 (NES) fortress on the game's opening screen! Way to be creative development team! You're the best! My profile pic shows the comparison. The left side of the pic shows my Ninja Gaiden 2 Nintendo Power from May of 1991. The right side of the pic is the start screen from Enter The Reloadfest (the skull entrance came out a little bit too bright, oh well). If you're going to blatently rip off a game, maybe you should choose one that isn't part of one of the most well known franchises ever.",
            "review_score": "-1"
        },
        {
            "review_text": "Best game ever  pros lots of ammo lots of guns  cons not enough time in the world ",
            "review_score": "1"
        },
        {
            "review_text": "Really fun for the first few rounds... Then the game changes your control scheme without telling you, and with no way to turn it back. This has lead to several hours of frustration, trying to revert it. From what I've read, this is 'intended' to make the game more difficult, but really, is just incredible stupid. If I wanted the game to be more difficult because of a more annoying control scheme, I'd play with a god damn dance pad.  The game is really fun, but this has frustrated me to the point that I can't enjoy it any more unless it's fixed, and therefore I can't recommend it either",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game ever. ♥♥♥♥♥♥ controllers and the worst possible way to run a co-op game. Save your money and buy Link To The Past instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Nuclear Throne is a much better choice. Why? Because Gungeon's loot drops are infrequent because keys to open weapon chests are EXTREMELY rare. And when you do spend a precious key to open a chest, more often than not you get a passive item or a mediocore gun. In this way, most runs you spend the first two levels using your horrible starting pea shooter. Horrible RNG and horrible balancing in this game. The tutorial was well made though. The actual dungeoning was not.",
            "review_score": "-1"
        },
        {
            "review_text": "Played 65 minutes and the applied for refund. Didn't enjoy the gameplay at all. Too much rolling bullets for my taste and aiming with controller very hard compared to mouse and there for much too hard game for me, coz I like to play with Controller on bigscreen. Visaully it was ok.",
            "review_score": "-1"
        },
        {
            "review_text": "  You're better off playing Rebirth/Afterbirth.",
            "review_score": "-1"
        },
        {
            "review_text": "boy, look at that lack of content.",
            "review_score": "-1"
        },
        {
            "review_text": "Classic example of a lazy indie company trying to get rich quick by releasing a buggy, unimaginative game. If the company had spent as much time actually fixing the bugs in the game as they have trying to find puns for their items/gun. It might actually be playable. Half the mechanics in the game that are supposed to help you end up getting you killed. Dodge roll? Try it and some of the bosses and you will still end up dodging right into bullets. Table flip? You cannot shot around it,enemies can use it and with the high amount of enemies in some of the random rooms it is next to useless. Also unflipped table can block you if you are not aware of it at the worse times. This game has a long way to go before it can even be considered good.  Edit:11th April  Now every character that I have rescued with the exception of the elevator repair man is gone.  Guess this is why there's things like reviews.  To warn people away from trashy games.",
            "review_score": "-1"
        },
        {
            "review_text": "don't let the trailer fool you this game is not fun i requested a refund after the first 8 minutes",
            "review_score": "-1"
        },
        {
            "review_text": "The controls are extremely slippery, and the game has no `Easy, Medium, Hard` modes. I want a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Enter the gungeon is a fantastic game. which makes its trival flaws all the more embarassing.  Enter the gungeon is your standard fair roguelike shooter, with your stat buffs being traded in for better guns. this creates quite the interesting situation and encourages you to save ammo and stick to basic weapons to dispatch most enemies. the issue with this system stems from the fact that the guns aren't balanced, many of the low tiered ones feel like straight up downgrades from your normal weapon unless you have some synergy going on from some items. this feelings of 'why does this exist' when you grab a bad gun is such a painful flaw it hinders some of the genius of the game.  These 'bad guns' are problematic specifically because you have an unlimited ammo weapon you start with, the result is essentially a weapon that will never come up.  another major issue, that is actually a real flaw is the controls. enter the Gungeon fails spectacularly at so much i can't believe they didn't remedy it. here let me ask you some questions.  did you like those old nes games where you'd have to hammer the button for hours on end just to fire?  Did you like the blistered it brought?  Do you like carpal tunnel?   me neither. and to the game's credit, almost every weapon in this game has a sort of automatic functon to it - if you just hold the button down.  The issue is, for semi auto pistols, this is a straight up downgrade, because holding the button down actually gives it about half the maximum firing rate. this game actively encourages button slamming to the point of carpal tunnel, im not joking. i literally just tried this on a controller and just optimally using my pistol for the hunter had me in agony in the first 7 minutes of gameplay.  to this you might say 'oh well, whatever, i'll just hold the button down and just deal with it' and nope, the developers still managed to screw that up. when click firing you auto reload at the end of the clip with just one more click, however when you hold the button down, you dont auto reload, until you either hit the fire button again or press the designated reload button.   so many minor issues that shouldn't exist and ulimately makes the game bad, and unenjoyable at points. i feel like i'm playing binding of issac with chocolate milk on forever. this system works in games like hotlie miami, but not rogue like shooters which have runs go on for like an hour.  a whole slew of other minor flaws also exist, but the fact remains   Enter the Gungeon is a fantastic idea, and a fantastic game, but a few minor flaws compeletely spoil the game. hopefully these issues (at least the reloading and button mashing ones) will be fixed so i can recommend this. But i legitmently had to put this down when i was playing it on the controller because my index finger hurt so bad.   Major edit:   okay, to make it clear, reloading is a problem because on controllers, the button layout is suboptimal and its troublesome, and regardless of your control scheme, reloading happens a ton. it kills your fingers when you are firing two shots from cover, reloading, and repeating about 1000 times over the course of a run, the lack of auto reload compounds the issue in a different way.  in issac reloading doesn't exist, and items that force you into a pound heavy position are avoided like the plague, you just hold one arrow key, and you're all set. but this game just constantly wants you to push buttons, over like a hour long session, which is absurd. its painful.     to put this in perspective, great bullet hell games dont do reloads, or at least have the decency to auto reload. they task you with a screen clearing ability if things get hectic, and just want you to focus on staying alive, hitting that nirvana like state of weaving in and out of fire, while just holding the fire button in the enemies face. this game adds another layer by forcing you to manage positioning in rooms. but you aren't allowed to just hold a button and fire and enjoy it, you have to constantly slam the button just so you dont have to worry about your ammo counters, so a reload will happen the moment the clip is empty, and the result is just... sloppy.  i dont want to walk away from 2 hours with this game having my hands legitimently hurt. its the mark of a badly thought out system, that could have been avoided so easily, but instead they chose to make 'no auto reloads' and 'faster firing rates if you spamthe button' a thing.   other flaws because i was asked for them:  Animations for teleport run on way to long, and a means to just speed up walking has for some reason lengthy animations to make it tedious and anoyying, just like walking around normally.  Grappling hook glitches all over the place in the oddest ways (canceling randomly (i know it can be canceled with space, this wasn't because of that) weird intereactions with rolling, pulling you through some impassable objects (like tables) sometimes and othertimes, not)  Gun list can't be reordered (this affects keyboards, numbers 1-9, and 0 (i haven't ever had 9 so i dunno if it goes that high) this causes an issue when you want to grab a certain weapon because after 5, numbers start requring a stretch from your left hand, but mid combat that isn't easy. they are put in linear order, but that causes the issue of bad guns being in slots 2~4 and then good ones being in 5-6. and the mouse wheel for trying to grab precisely the right gun for the situation isn't easy because confusion between places in order from the last run come up.  the idea of perfect runs is... awful. so this one is more of a personal point but, okay you've all played issac i hope. well in issac when you perfect clear a boss by not taking red heart game, you have a chance with a deal with the devil (not an objecive upgrade) or a very small chance for a deal with the angel (an objective upgrade) Well this game likes feels the need to make a vast majority of hp upgrades garenteed drops for perfect clears, but taking damage even on shields will kill your chances. the issue is this really does just make the game horrible for newbies, as the major second chance mechanic (life) is gated around playing a boss perfectly. binding of issac has the decency to make deals with the devil at least a trade off (some were really bad and avoided, doing nothing) and deals with the angel had slimmer chances. And even those rooms could be accessed even if you took damage from the boss through cards, other modifiers, goat head, etc.  and finally...  Dropping stuff for the sewer thing in the job is a pain, and i mean A PAIN   ^this one deserves its own spot this is horrid. theres a dude in the shop who clings to this sewer grate from below asking for items, in exchange for gold.  now thats a great idea except: A: he wont manually take items out of your inventory for you B: The game doesn't go over dropping items or the need to drop them C: The items must be placed into the little square that is the sewer grate for him to take them D: ITEMS DROPPED FROM YOUR INVENTORY GO ANYWHERE THEY PLEASE.   i've had items merge with walls, being lost forever, or just fly around the shop, having to pick them back up, and then try again.  and yes, this is the propper way to do it, once you finally get them in, he gives you like 40 gold (this is super useful because of an item called 'trash' you can get which is free money essentially)  i dont know how these issues weren't addressed prior to launch, and its why its not getting a recommendation from me.",
            "review_score": "-1"
        },
        {
            "review_text": "if you're interested in yet another roguelite where all of the enemies are damage sponges, this is the game for you",
            "review_score": "-1"
        },
        {
            "review_text": "game is ♥♥♥♥♥♥ and i can't get refund now due to a glitch  so i am out 16 dollors i am not happy and the game lied i thought if peroder game get some free stuff like it said on steam page but i guess that thier way making money off  suckers i would not tell any of my friends play this trashy ♥♥♥ game it's money grab and  seems be verry red neck and belings in landfill",
            "review_score": "-1"
        },
        {
            "review_text": "This Game Is For Sure On My Top 5 Favorite Games. Dont Sleep On This Game, This Game Is Sooo Fun.",
            "review_score": "1"
        },
        {
            "review_text": "我们需要中文  we need chinese please",
            "review_score": "1"
        },
        {
            "review_text": "Enter the gungeon is a Rogue-like that is more hard and challenging than games like 'Binding of Issac' and 'Nuclear Throne', if you do not like getting frustrated, then you should most likely not buy this game. It is procedurally generated with loads of weapons and items, but with that in mind you don't see a gun twice very often which is kinda disapointing. One thing you should do is not to give up, it might seem impossible at first to defeat the first boss, but with practice it is rather done easily. PROS -Weapon Variety  -Enemy Variety  -Punishing, but fair  -Visual Stlye  -Fun Bosses  -Very Funny  CONS  -Rare to see the same Gun twice  -Sometimes Runs are Based on Luck  - (In My Opinion) Not much Characters  Overall  This Game is alot of fun, and I can see myself playing for a another 20 hours. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "A very good game each playthrough is diffrent and there are a ton of weapons to find. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, but over a while it becomes repetitive. Play it as much as you like, but be sure to take breaks between every two runs so it does not get boring.",
            "review_score": "1"
        },
        {
            "review_text": "borderlands and nuclear throne with some issac and table flippin",
            "review_score": "1"
        },
        {
            "review_text": "I assume Bullet King is the final boss... Right?  Edit: Finally made it to chamber 2",
            "review_score": "1"
        },
        {
            "review_text": "I haven't beaten this game yet but I still keep coming back to it.  (The game has beaten me 20 times over though)",
            "review_score": "1"
        },
        {
            "review_text": "Better, harder, and bulletheller than TBOI  It has a lot of what you would expect from a modern roguelike. Procedural generation combined with challenging fast-paced combat.  If you're like me (I suck) you will have spent over 90hrs in the game and have had over 220 runs before beating the 'final' boss (not really final). The game may seem very difficult and punishing at the beginning, but all that you really need is constant practice, and the mastery of the dodge-rolling mechanic.               also if you're like me you may be a masochist ♥♥♥♥ that enjoys playing this kind of ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Twin stick shooter, Rogue-like elements, Guns, pixel art, good music, fast and dangerous, yup this is a tasty game. I like it alot already. Replay value is through the roof. worth every bullet spent.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely and wonderfully fun and challenging. So much to do, no run is the same. Cannot wait for the supply drop update.",
            "review_score": "1"
        },
        {
            "review_text": "I now have epilepsy but it was probably worth it",
            "review_score": "1"
        },
        {
            "review_text": "Great game, can't wait for the supply crate update!",
            "review_score": "1"
        },
        {
            "review_text": "An extremely fun and challenging game. Think Binding of Isaac with guns. The lore in the game is intriging and the enemies are quiet well designed. Overall an amazing game and can't wait to play more.",
            "review_score": "1"
        },
        {
            "review_text": "At a first glance, this dungeon-ish game looks lovely, but contains hell loads of bullets and difficulties. Has some rogue-like elements such as many guns,   too   many guns in fact, which sometimes leads to unreasonably tough situations. The dodge system with your right click is fun but also tricky. The hard-to-measure rolling action makes you an instant super hero, and what kind of hero would collide with absurdly slow bullets headfirst? Players can move in only 8 directions like a compass, which accelarates the annoyance. I am personally glad it is a retro 2D-style game, but that sacrifices some flexibility like these mentioned above.  So, eh, you wanna try? Go ahead, if you want to test your luck. Guns and items drop at random. The colors of treasure chests show what rarity they are, but the chests themselves are apparently randomized. Got a life extension? Then you could get past some levels. Got a gun from an ominously huge black chest? Save your bullets, then shoot some ♥♥♥. So you will beat all the levels with lucky booties? Maybe not, 'cause your control may suck in front of the last boss.  But never get mad at the difficulty to control; luck smiles upon the smiling. WIthout luck, how could you beat a rogue-like anyway?",
            "review_score": "1"
        },
        {
            "review_text": "Fun overall experience, despite its challenge. Great humor as well.",
            "review_score": "1"
        },
        {
            "review_text": "I never even liked perma death games till i played this one. Just get it. You wont regret it.",
            "review_score": "1"
        },
        {
            "review_text": "While I love the concept, and the puns are absolutely amazing, I am absolute garbage at this, and I personally don't enjoy it too much. If you love bullet hells though, it's definitely worth your time, even if it's just for a few minutes.",
            "review_score": "1"
        },
        {
            "review_text": "Sooo much gun, its lit, please buy",
            "review_score": "1"
        },
        {
            "review_text": "Roll and live.  Roll and accdently roll into a bullet, get exploded into a million pieces from a random exsplosive barrel, and accdently fall into a pit and die.   10/100",
            "review_score": "1"
        },
        {
            "review_text": "I love this game!",
            "review_score": "1"
        },
        {
            "review_text": "Too difficult for you? HA 2ez4M3 M8 Just kidding this game is a challenge!",
            "review_score": "1"
        },
        {
            "review_text": "So hard, but I can't stop playing it...",
            "review_score": "1"
        },
        {
            "review_text": "endless replayability",
            "review_score": "1"
        },
        {
            "review_text": "great game addictive gameplay great difficulty only problem is when you get to a boss if you die you have to go through the hole dungeon again",
            "review_score": "1"
        },
        {
            "review_text": "simply a 10",
            "review_score": "1"
        },
        {
            "review_text": "If you play as brown chick you get corgi",
            "review_score": "1"
        },
        {
            "review_text": "Truely a great game. Can not wait for new content being added.",
            "review_score": "1"
        },
        {
            "review_text": "Good game a little hard at first but fun",
            "review_score": "1"
        },
        {
            "review_text": "Great game to pass the time.",
            "review_score": "1"
        },
        {
            "review_text": "Great game,with lots of references to other games. ",
            "review_score": "1"
        },
        {
            "review_text": "Great game about to get a decently sized update and sure to provide pleanty of enjoyment",
            "review_score": "1"
        },
        {
            "review_text": "One of the best rogue-like shooters since the binding of isaac.",
            "review_score": "1"
        },
        {
            "review_text": "This game has so much depth its beyond great. The time it takes to get every gun and passive item in game is beyond belief its a game i thought would be simple yet its tough as nails but keeps dragging me back into. I could pretty much hype this whole game as iits something alot of people would go for and theres not really any negatives as iupdating the games is always something they try to do and adding more content well thats not nessary but wow ill take it.",
            "review_score": "1"
        },
        {
            "review_text": "From start to finish a challenging game, it will not get easier unless you're willing to invest time and dedication, as skill is your greatest weapon. Definetely recomend if you're into Rougue-likes, especially those like binding of isaac or nuclear throne",
            "review_score": "1"
        },
        {
            "review_text": "A very great and creative rogue like game with plenty of nice and fun weapons to toy around with and plenty of gun related enemies to test them all on!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing for passing the time",
            "review_score": "1"
        },
        {
            "review_text": "The pixel style game on the market many, but return to such a view like this pixel game is little wind. I very want to be able to appear more interesting games. Big love pixels in the wind!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game! Tons of different weapons and room layouts, and several characters to choose from. The game is unforgiving, and each run you learn something new that you can use on your next one. So far, I haven't gone beyond the second floor in my hours so far, but I'm still having a blast since combat is fun. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Hey, thats pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Litteraly a bullet hell   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome coop game, extremely fun and addictive ",
            "review_score": "1"
        },
        {
            "review_text": "Has the best apple barrel physics I've seen outside of apple barrel simulator.  10/10, GOTY Winner Material",
            "review_score": "1"
        },
        {
            "review_text": "Wow, Let me tell you what this is!!! Its the Biggest compeitition to Binding of Isacc, something we all thought nuclear throne would be, But failed. Let me tell you the reason I LOVE THIS GAME. And a few problem about it.  Pros: GUNS- TONS AND TONS OF GUNS, What more do you need Abilities- A lot of abilities to help your gun play and beat the levels Progression- This game has a level of progression, It will start out hard, But as you play more unlocking more guns and abilities, you slowly become better and better at the game which means hours of fun Characters- 4 diverse characters all having their own perks and disadvantages Bosses- The bosses are fun and tough to play Puns and Funs= This game doesn't take itself too seriously, So their are plenty of puns in their and a couple of easter eggs (such as a gears of war reference, that is a perk so you can get active reloads) Dodge and Roll- This mechanic adds a new layer to the game giving you a brief time of invincibility Soundtrack - Is like a angel throwing up RAINBOWS, Its just AMAZING  Cons: Nothing too serious more of thing I would like to see Bosses- Though the bosses in the game are dynamic, There doesn't feel like there is enough a few more to sproof it up would be dandy Characters- Same thing about bosses, Great and fun, But 4! You guys could make more, And may name one MrGenton, I kid, Unless your cool with it... 4 just make it feel repeititive and makes me feel that I am playing these characters over and over. (I wouldnt count the 5th one because he is only for co-op and I have no friends) Co-op Online- Speaking of co-op, why not have it online, I am sure you guys are already doing it, Cant wait,,,  Thats about it, It mostly can only go up from where its at, and I cant wait to see what to come, Defnitley BUY THIS GAME, Unless your Chicken ",
            "review_score": "1"
        },
        {
            "review_text": "what do i have to say about enter the gungeon. well over the many runs one thing holds true, i suck at this game.  on a serious note though, enter the gungeon is a hard as heck game. you certinally wont beat the game in a few hours. but you will slowly learn and find you way through the gungeon farther and farther.   i do like the graphics and the over all feel that enter the gungeon has, with its dark setting but packed with comedy and noticable references in its items and guns. the gimics are funny some times but you will figure out which guns you like and which guns you will want to get rid of.  all in all i would reccomend this game to people who like rogue likes. be warned though the game is so difficult but its worth it when you finally do it. ( i haven't made it past floor 3 at this time)",
            "review_score": "1"
        },
        {
            "review_text": "Very enjoyable game that you can just keep on playing.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. Some may say that this game is too hard, but that is what I like about this game. You won't just 'win' it, you will play it, and enjoy every little thing about this game.",
            "review_score": "1"
        },
        {
            "review_text": "Best Game on steam for a great price honestly",
            "review_score": "1"
        },
        {
            "review_text": "So, i was a TBOI player. I recently came across a game called Enter The Gungeon on youtube... im so glad i did. I would highly reccomend this game to anyone who likes dungeon based games or TBOI.",
            "review_score": "1"
        },
        {
            "review_text": "gud game (real review coming soon)",
            "review_score": "1"
        },
        {
            "review_text": "Although the steep difficulty curve of this masterpiece might steer some newcomers to the genre away, the game is a perfect mix of luck and skill",
            "review_score": "1"
        },
        {
            "review_text": "Much like the Binding of Issac or Nuclear Throne with a bigger emphasis on guns and a very silly/parody vibe.  EtG has an ideal balance of RNG, learning mechanics, secrets, humor, skill development, and persistent progression to keep you invested all the way through some very intense scenarios. Sometimes luck can screw you over but the runs are short. Not to mention the feeling of finally defeating a difficult room, floor, or boss is so unique and well earned. It can be quite addicting.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun game, it has tons of hours and gameplay. One problem I have is that the game crashes on the title screen from time to time and I have to restart my hole computer. Other than that the game is great and I definantaly would recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "After unlocking everything in 150 hours of gungeoning, I can easily tell you that this game is awesome. If you are into these type of games (rogue-like, RNG based rpg) you should definitely try this game, at least. It may come difficult at the beginning, but you will get used to it in time and it will become kind of addicting to try over and over again. It's beautifully designed, chapters and boss fights are really fun, characters are nicely balanced and have great achievements to complete.   I will probably wait for further updates (hopefully) to play it again, but I can't wait for that day to come even just after 'finishing' the game.",
            "review_score": "1"
        },
        {
            "review_text": "Defeats the final boss, needed the bullet that kills the past from blacksmith, tries to find it, had half health left, accidentally steps in poison and dies...  10/10 would lose my sanity again",
            "review_score": "1"
        },
        {
            "review_text": "i think this game is very good but should include co op play ",
            "review_score": "1"
        },
        {
            "review_text": "Enter the Gungeon: A multi-story dungeon filled with protectors and guardians whom prevent the progression of the 4 main protagonists, and although only one can enter at a time, there is room for one more character via the multiplayer set-up. Each floor is a labyrinth of its own, randomly generated, containing loot, baddies and bosses unique to its level. Defeating them alone and especially with the starter weapons can be a challenge, but thanks to the creative maneuvering techniques and loot-filled chests buried inside the labyrinth, results may vary, from weapons and tools to health enhancements, it becomes much more of an adventure for the lone protagonist. Defeating a boss will give loot, and along with that allow the character to proceed to the next floor, where difficulty increases, different entities spawn, bosses get harder and gear you get from the shop on each floor costs more. On top of that you are met with falls to your death, traps and more. How far will you reach? Will you attain the ultimate treasure? Do you dare to... Enter the Gungeon!? Anyways I love this game, it's creative and challenging. It can be hard to put lack of storyline into a game so cutos to the game creators for that. I was a little hesitant to buy this game at first since the price, but after checking the game out with my cousin, my mind had changed. Perhaps allow a demo allowing players to get a feel of the game. Other than that, LOVE THE GAME! Thanks to the developers for making it!",
            "review_score": "1"
        },
        {
            "review_text": "This is by far one of the most genuinely fun games in my library. Of the 20 or so hours I have logged on it so far, half of those hours were just me plunging into the gungeon again and again, just shooting ♥♥♥♥ and having fun. Only recently did I realize the amount of depth this game had to it; the NPCs, the story, the secrets. Now that I have a goal in mind, I'm having so much more fun playing this. I almost find myself confused by all the people who complain that this game is too hard; it's part of the experience. Die and die again until you know the patterns and the flow of the game. The variety of weapons, items, and enemies in this game is incredibly large for some indie pixel title. These devs know what they're doing with a video game. In all honesty, I wish there was some sort of *substantial* DLC for this game. I would eagerly pay a little bit more for extra content; I feel like this game has a lot of potential for longevity in the market.",
            "review_score": "1"
        },
        {
            "review_text": "I killed the first boss with a banana. If that doesn't make you want to buy this game, I don't know what will.",
            "review_score": "1"
        },
        {
            "review_text": "a game with core bullet hell mechanics, pun-driven design and lots of attention to detail  where have i heard that one before",
            "review_score": "1"
        },
        {
            "review_text": "Blind russian translation",
            "review_score": "1"
        },
        {
            "review_text": "I like this game, but no in game online multiplayer makes me sort of upset",
            "review_score": "1"
        },
        {
            "review_text": "I really wanna recommend EtG for anyone who loves bullet hell games. But personally i felt it was a little underwhelming for a number of reasons. For a game about guns EtG sure feels like it has an overall lack of BFG 9000's and way to many functionally identical peashooters. To many wasted keys on chests than bore the fruit of mediocrity and it wasn't just the weapons, most consumables and passive items are situational at best and fewer are useful against bosses. No custom load outs means you're at the mercy of RNG and with so many different items you'll probably never acquire the right combo of items needed to create synergy. So much lost potential when it came to synergy and what a shame because i think this game could be fantastic with a few tweeks and maybe a save function between floors.  Pros:  great style/theme. tasty lexicon fulled fleshed out with bad puns galore. controls are responsive and worked well with an Xbox controller. certain weapons are a blast. the amount of enemies and boss types boss battles are fun and engaging. challenging.  Meh: the music is ok it just doesn't fit the action on screen is the issue for me. All the characters play the exact same way. No item description available on items sold by vendors.   Cons: Perfect runs result in extra hearts while getting damaged during a boss fight do not. This feels backwards. Synergy between items rarely happens. Not enough total ammo for most guns No custom load out Insane item requirements for elevators Buying items in the breach is underwhelming without custom load outs General lack of guidance from the game on how to achieve certain events. RNG can result in a busted run early on. Keys and ammo are a bit to uncommon.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of the best (and one of the more joke filled) bullet hell games i've played in a while. Really good visuals, a plot that keeps bringing me back, an intense amount of difficulty, and some pretty good controls. The only problem I have is that my mouse glitches out every once in a while, but otherwise it's amazing. So buy it. Like right now.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Isaac (Any one) and Nuclear Throne, this game is in it for you. Interesting Bullet Hell + Roguelike combination of a game that does it well. Rooms and Items like Isaac, Guns and bullet dodging like Nuclear Throne. ",
            "review_score": "1"
        },
        {
            "review_text": "A true action roguelike. Featuring shmup style bullet-hell ish]  dodging and nice enjoyable twin stick shooter controls which work great with a gamepad.  I haven't beaten it yet, I may never beat it, but I'm having tons of fun trying.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful bullet hell with great variety in guns enemy's and characters all around a great game.",
            "review_score": "1"
        },
        {
            "review_text": "would r8 8/8 m8 supa gr8 (no seriously it was worth every penny GET THIS GAME NOW!!!11111)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing and skill based.     Well, in terms of movement and dodging, its skill based.  But like many rogue-likes, the RNG tends to either:  A) Showers you wth love and affection, and giving all the weapons and resources you need.  or  B) Violenty screws you in the bum and throws you into its basement and ties you up.",
            "review_score": "1"
        },
        {
            "review_text": "Roses are red Violets are blue How in the heck Do you get to level 2",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and difficult rogue like videogame. I get an arcade vibe everytime I play. The bosses are all very unique and fun to battle. I recommend playing alongside a skilled friend for your first couple of times to play. There are a ton of different guns and cute annoying enemies to shoot and slaughter but I only recommend this game to people who are not easily frustrated at difficult games.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game!But can we have chinese version^^?",
            "review_score": "1"
        },
        {
            "review_text": "Do I recommend this game? Yes, I do. I really do.  fun: yep graphics?: actually pleasing and pixely co-op: yes sir Soundtrack?: yes yes very very good vERY Good job be proud characterS: yes guns?: nope guns you personally prefer?: super soaker. strongest wep in the game 100% garunteed anybody would win with this - My last words before dying in the next room, using only the Super Soaker. things to discover?: lots lots lots lots lots lots lots lots lots of stuff replay value?: yes!! rougelike?: yES!!! spent your mom's credit card?: [The client's answer was a piece of paper, saying '(✓) please do not ask again'] guns?: not a single one.. wait, déjá vu... was this repeated... or????????  conclusion?: you should REALLY get the game like now. it's a good waste of money, and a well-worth waste of time. like all in a good way. but if you're not sure if you should get it you should ask your parents for help.  Basically: get the game",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS BY FAR ONE OF THE BEST AND WELL THOUGHT OUT BULLET HELLS I HAVE EVER PLAYED!!!",
            "review_score": "1"
        },
        {
            "review_text": "sos, can barely get through first level",
            "review_score": "1"
        },
        {
            "review_text": "Bought this on a whim, did not expect to love it as much as I do.  Animation, sound, and 'feel' are all wonderful. Enemies range from cute and bumbling to terrifying (but still cute). Difficult but fair (most of the time). If you like roguelikes, its worth the $ 15 easily.",
            "review_score": "1"
        },
        {
            "review_text": "bought this game, Played it, Hated it, Returned it, Played some other games, Used my steam refund to buy this game again, Loved it, 8/10 Only problem is there some bugs with co-op",
            "review_score": "1"
        },
        {
            "review_text": "Its fun",
            "review_score": "1"
        },
        {
            "review_text": "Enter the gungeon is one of the most addictive and fun rogue-like(lite) games i have ever played. For people who like the gun theme and are into games like The Binding of Isaac, this is a must own. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I REALLY like this game. I'm not a big fan of RNG games usually, so I was suprised at how much fun I've been having with this game. I don't have much to say besides I really like a lot of its aspects. My only issue is with the bosses. They have a tad to much health and have no real 'pattern.' They have very loose attack patterns (as in, when the do X, it will result in Y), but usually the bullets will get too hectic and there will be no way for you to dodge it, resulting in you taking damage regardless. At least in most bullet hell games you can still avoid them if you're good enough. I can't tell you how many times I almost killed a boss (whom, again, has way a bit more health than it should), just to be hit by a load of bullets I couldn't dodge and have to start all over from the beginning. You do have 'Blanks' which clear the screen of enemy fire, but you'll probably run out of those really quickly.  The game is still good though. Its just that the bosses are BS hard because of undodgeable bullet spam. They're hard for other reasons too, but those other reasons aren't total BullSh*t.",
            "review_score": "1"
        },
        {
            "review_text": "They really should have called this 'Enter the Pungeon' because there sure are a lot of puns in this game. Just puns everywhere.",
            "review_score": "1"
        },
        {
            "review_text": "Enter the Gungeon is a bullet hell rogue-like where you shoot bullets at bullets and try to dodge their bullets.   The story is somewhat irrelevant, since the only thing I know so far is that a long ♥♥♥ time ago some sort of explotion happened and the Gungeon was created.  The game being a rogue-like shares some similarities with other popular games of the genre, you got the rescuing characters and them setting up shop on the main hub like Crypt of the Necrodancer, the randomness of weapon and crazy synergies as in Binding of Isaac, and the fun gun play that you'd expect from Nuclear Throne (Which I've yet to play).  Pros: - This game is fun! It's addictive gameplay keeps me going back to it. - The pixel art is seriously good. - Controls are really tight on this game, and funnily enough it's actually better to play with a controller than trying to aim with the mouse.  Cons:  - The game needs some serious loot balance, I swear I've gone through 3 floors and not found a single key, on several runs. - Sadly, the guns are not that impressive, and I usually just get dissapointed that I wasted a key in order to get a really bad gun. - I couldn't tell you if this game has music, or if it's good or not, because most of the time you don't even notice it.  Overall it's a great game which could benefit from the devs hearing what the community has to say. 7/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Fun game for the price. For sure worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "gr8 gaem the vinesauce fellows inspired me to buy this gaem keep up the good games devolver",
            "review_score": "1"
        },
        {
            "review_text": "Enter the Gungeon is an extremely fun game that's a bullet hell, while also being a top-down shooter. There's lots of depth and content, too. My only, and I mean  ONLY  problem, is that it's hard. I can't even get past the second floor, and I don't even have the elevator to get to it. Basically, it might be too hard for some people, so if that's not your jam, you might want to just not get it. Also, I'm a person that cleared Super Meat Boy, which is what tons of people say 'Extremely hard'. So, yeah... that's basically it.    Game rating: 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Still just getting into this, but there's so much content.   Gameplay is very reminiscent of The Binding of Isaac, but with gunplay from Nuclear Throne. The rooms are varied and interesting, and the items keep impressing me with different abilities and playstyles.",
            "review_score": "1"
        },
        {
            "review_text": "  My Enter The Gungeon Review | Why I RECOMMEND It",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Genius mix of dungeon crawler, bullet hell and try &amp; die. Finely crafted, great design, references and jokes. A beautiful world, entertaining and challenging, for all ages, as it's graphically sweet. A masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "OK. I'll admit. I suck at this game. Like, REALLY BADLY. I can't even defeat the first boss. But what keeps making me come back to this game is how fun it is.  Words can not describe what I feel when I play this game. I'm happy, oblivious, mad, insane, dangerous, weak and strong all at the same time. This arcade-like bullet hell dungeon crawler is one of the best bullet hell games I've played, hands down.   The art style, the music, the fact that everything relates to bullets (even the hearts are just 2 bullets crossed over eachother), how you can play with friends locally, how every gun is unique, it just amazes me.  The gun selection is as plentiful as The Borderlands series, the graphics style reminds me of Crypt of the Necrodancer, and everything works well together.  I really cannot find any negatives about this game other than I suck at it (which isn't a reason to make the game lose a point out of ten). It's a perfect game for many types of people.  Here are the some of the game's pros and cons so far for me.        Pros   Cons       Bullet Hell          Variety          Music &amp; Graphics         Buy this game.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "You can flip tables in this game. Like, how could you not enjoy game where you can flip tables to make cover? Can you flip tables in Overwatch? Cod? Battlefield? Any other mediocre shooter ever? I don't think so.",
            "review_score": "1"
        },
        {
            "review_text": "You shoot bullets with bullets nuf said.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "In this game pure skill is wayyyyyyyyy more important than RNG.  And I absolutely love that.  10/10 ♥",
            "review_score": "1"
        },
        {
            "review_text": "Enter the Gungeon is like playing Dark Souls with a random weapon every time There's alot of skill involved and while consistensy is gained from experience, it's alot of work to get there.",
            "review_score": "1"
        },
        {
            "review_text": "Good things: the gameplay is very solid and enjoyable. Movement is fluid, shooting and killing things feel good, there's a good variety of items and good synergies between them, dificulty is high but progression is fair. Pixel art in this game looks mostly good. Sound effects feel nice.  Bad things: most of the music in the game is forgettable.",
            "review_score": "1"
        },
        {
            "review_text": "This game DOES contain a dog.",
            "review_score": "1"
        },
        {
            "review_text": "sick yea",
            "review_score": "1"
        },
        {
            "review_text": "What happens when you don't have enough gun to finish a floor? Use more gun.  This game is exceptionally fun, and sufficiantly difficult. In Isaac I always felt like bad items can lead to a bad run. In Enter the Gungeon it's all skill, baby! Definitely a must have for any rogue-lite fan, and a game I can strongly recommend for anyone who likes a good challenge from their games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is sooo tryhard, but very fun to play :)",
            "review_score": "1"
        },
        {
            "review_text": "Tenx 2 this game... it inspired me to play more of this kinds of game :D. Not only that... but i was able to play with my friends and play co-op. And even used my ps3 controller to play locally with my brothers. :D Thank you again",
            "review_score": "1"
        },
        {
            "review_text": "Whatever you ♥♥♥♥ing do. Do NOT fire in the shop.  I had to learn that the hard way.",
            "review_score": "1"
        },
        {
            "review_text": "*ahem* Very Nice.",
            "review_score": "1"
        },
        {
            "review_text": "All you need is luck",
            "review_score": "1"
        },
        {
            "review_text": "HARDEST ♥♥♥♥ING GAME IN THE HISTORY OF MANKIND! but its fun",
            "review_score": "1"
        },
        {
            "review_text": "My personal favourite rogue-like. Fast paced, combining quick thinking and good aim. The best of the top-down shooter and bullet hell genres combined into a brutally difficult game. Insanely difficult to master, but never unfair. I always feel like I died for a reason, or because I messed up. Would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Difficult at first, but once you get into it this game is incredible. It is very replayable due to the number of weapons and items available. Fast gameplay, bullet hell rougelike very similar to Binding of Isaac.  Also theres TONNES of references which makes it all the more satifsying to play and explore more of the features surrounding the game.  The only drawback that I can think of is how angry you will get trying to progress through late-game (although the satisfaction of progress really helps)",
            "review_score": "1"
        },
        {
            "review_text": "If this game had Online multiplayer id love it so much more than I already do",
            "review_score": "1"
        },
        {
            "review_text": "Super Fun!   Also super tough.  10/10 would poorly time my dodge rolls again.",
            "review_score": "1"
        },
        {
            "review_text": "I really loved this game, but the lack of mp over the internet killed it for me.",
            "review_score": "1"
        },
        {
            "review_text": "Needs online Co-Op and then it'll be perfect :)",
            "review_score": "1"
        },
        {
            "review_text": "love this game",
            "review_score": "1"
        },
        {
            "review_text": "One of the most polished, thematically realized Binding of Isaac successors out there. Seriously, this game is what other indie games aspire to be. I can't believe how much love and work went into every facet of this game's assets.   11/10 (+1 for sick pun action)",
            "review_score": "1"
        },
        {
            "review_text": "So so good. One of my top games. Worth more than they are asking.",
            "review_score": "1"
        },
        {
            "review_text": "It's a roguelite very similar to Binding of Isaac, Nuclear Throne, and Risk of Rain. What separates Enter the Gungeon from similar titles is the focus on the gunplay itself. Don't expect the type of roguelite game where the upgrades and items you find influence the course of your run. This is first and foremost a 'twinstick shooter'. The roguelite elements serve to keep runs fresh, but upgrades and guns generally won't carry you by themselves. So what you get is a sort of top down Gunstar Heroes where one run you'll be firing rockets, and another you're using a barrel with fish for bullets.  The particular strength of this focus is that your attention will never be drawn from the main purpose of this game: kill ♥♥♥♥ and DON'T get hit. Roguelite action games can sometimes get muddled up in straying from the action to focus on optimizing your build. If that's what you specifically like about the genre, then you might want to avoid Enter the Gungeon. However, if you enjoy fast paced and challenging action with tight controls, you'll definitely like this game.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "Bought this for the jokes but its actually really good. 10/10. Best game.",
            "review_score": "1"
        },
        {
            "review_text": "Sweet god this game is stingy. I like it but the rigamarole for unlocking shortcuts is just absurd. Don't buy this if you are at all prone to frustration.",
            "review_score": "1"
        },
        {
            "review_text": "I literally cannot believe anyone would give this a negative rating. Play it more than I work in a week!  10/10 love every minute.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, would recommend to anyone who really enjoyed Binding of Isaac. Too many negative reviews by people who just find the game too difficult when it's supposed to be that way. It also has some great references.",
            "review_score": "1"
        },
        {
            "review_text": "Hard to play at first but when you get out of noob stage your like （╯°□°）╯︵( .o.) LET'S DO THIS",
            "review_score": "1"
        },
        {
            "review_text": "really great and fun game",
            "review_score": "1"
        },
        {
            "review_text": "cant even get past the first floor, the first gun i get takes forever to kill guys(tried numerous charaters) and any other guns or ammo i get dissapear when i die thus making it much more difficult as i cant progress at all.",
            "review_score": "-1"
        },
        {
            "review_text": "yes it good game",
            "review_score": "1"
        },
        {
            "review_text": "Enter the bad RNG. A game about losing an hour of your time because you go two floors without any ammo dropping and having to fight the    real    final boss with your starting pistol. Would struggle for thirty minutes again.",
            "review_score": "1"
        },
        {
            "review_text": "Still haven't beaten the game. 10/10 Best game ever.",
            "review_score": "1"
        },
        {
            "review_text": "Really hard! But really fun! I it was a worth while purchase!",
            "review_score": "1"
        },
        {
            "review_text": "So much fun, so many guns so many bullets.",
            "review_score": "1"
        },
        {
            "review_text": "Enter The Gungeon (i cant be bothered to make this a proper in depth review or anything or even to explain the basics of the game) is a good game. It's fun and hard, as it should be, the level design i find is kind of boring and bland the enemies get repetitive but it is still a fun game. The Bosses are dificult , well im bad at it, so thats a plus.  One thing that i find useful about the game, the diffrence between Controler and keyboard and mouse , for me is kind of big, i can dodge better on keyboard but the aim assit that comes with controler makes it a lot easier to consistentally hit the enemies while trying to dodge, but im bad at the game so it could be just me.",
            "review_score": "1"
        },
        {
            "review_text": "Live and Die by the Bullet...... or whatever gun you get that shoots whatever ammo (there's a lot). P.S. Sometimes I feel like I am stuck in the gungeon trying to beat it and maybe try and get a gun to kill all of my past time spent on this game.  10/10 would shoot again",
            "review_score": "1"
        },
        {
            "review_text": "I reccomend it. But it does stutter on my main pc so I returned it",
            "review_score": "1"
        },
        {
            "review_text": "I hate this game.",
            "review_score": "1"
        },
        {
            "review_text": "It's difficult, but fair.",
            "review_score": "1"
        },
        {
            "review_text": "I like it... It's a nice bullet hell with an excellent sense of humor. I believe that it was worth all $15.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing badass. Loads of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Haven't played much, but I'm enjoying most everything about the game so far. The art style has some great drive behind it (although not super polished) and the music is pretty good. Nice humor to the game and a lot of replay value. The game plays like Binding of Isacc (sorry if I spelled that wrong) but just in a different universe. Only complaint I have is the fact that you have to beat the game once to unlock co-op, and when you unlock co-op your partner is locked into one certain character. Not sure why the devs did this tbh other than for the challenge factor, but it's quite annoying. At the least I hope they'll allow co-op to be played from the beginning in a later update",
            "review_score": "1"
        },
        {
            "review_text": "Overall I really enjoy this game. The only thing I wish they'd add is online co op. Otherwise it's a challenging but fair game.",
            "review_score": "1"
        },
        {
            "review_text": "Shooting bullets with to save time.  Liberal SImulator 2K16 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Very challenging, constantly offer something new, keeps you guessing and heaps of fun! just so much fun! I can't give the team at DodgeRollGames enough credit for their fantastic effort!",
            "review_score": "1"
        },
        {
            "review_text": "Great Rogue-like game very fun , little hard but its better to be like that , to bad low on stages and weapons ,  theres some minor bugs but great game",
            "review_score": "1"
        },
        {
            "review_text": "the first bosses are a too bit difficult. but other than that its awesome",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun bullet hell game, not sure why more people don't have it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most addicting games I have ever played, If you like getting killed repeatedly for hours on end this is the game for you, Just as you learn something, something new pops up that you die to... have Fun i love it 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "Guns. Lots and lots of guns. Spent a good amount of time playing this game, and continue to do so. Always different runs and guns, making the game addictive. A good purchase 10/10 would reccomend",
            "review_score": "1"
        },
        {
            "review_text": "A tremendously good action rogue-like game. It is perfectly balanced so that it seems impossible on the first few tries but as time goes on you learn how the game plays and how to take on each enemy. Then you get a little further, find/unlock new items and push on deeper into the gungeon.  Has more than enough challenging endings/secrets to find to keep even skillful players coming back for dozens of hours.  Are you up to the challenge to become a total bullet hell badass?",
            "review_score": "1"
        },
        {
            "review_text": "it is highly fun to play, you may get addicted and possibly rage. make sure to buy keys, keys and more keys! you gotta sweat on boss stages!!! just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "great game underrated bulletheck",
            "review_score": "1"
        },
        {
            "review_text": "Enter the Gungeon is a really fun roguelike bullet hell adventure. Kind of a combination of Binding of Isaac and dare I say Realm of the Mad God? It is hard which makes it fun, no sense in breezing through a game. The only negative I have to say, is that there is no save feature (similar to Binding of Isaac). So if your run is taking long ~45 mins, you cannot just stop and pick up where you left off. This is the one feature I love with Binding of Isaac, as I often cannot sit down to game for very long.  In short, very much worth buying!",
            "review_score": "1"
        },
        {
            "review_text": "Entered with pleasure",
            "review_score": "1"
        },
        {
            "review_text": "Super fun, challenging and fast game.   For all the biding of isaac and roguelike fans, this is a must have!",
            "review_score": "1"
        },
        {
            "review_text": "The design of this game is great.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun, challenging and fast game.   For all the biding of isaac and roguelike fans, this is a must have!",
            "review_score": "1"
        },
        {
            "review_text": "   ",
            "review_score": "1"
        },
        {
            "review_text": "If you look on the map, the rooms Smile at you",
            "review_score": "1"
        },
        {
            "review_text": "It's really hard. Like really hard. The assortment of guns that you can get are really cool. If you like Binding Of Isaac or other games like it, then this game would be fun for you.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game. I like that every play of the game is a different layout.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun but at the same time pretty frustrating.. Not in terms of difficulty wise(although it is difficult game for the most part) It's mostly due to pacing The pacing in the game isn't really fast enough to finish the entire run in a proper time. It takes bit too long to finish the run and at the same time the weapon in the game is just not feeling different enough to feeling 'developed' instead it feels more like static and you can't do any better in the game unless you found super O.P gun item called Gunther. Still the game is well polished enough to be recommandable.  게임은 재밌는데 좀 짜증유발 요소가 좀 있다난이도가 어렵긴해도 난이도의 문제라기 보다는 페이싱이 느린편이고 이런 장르에서 한판하는데 게임이 시간이 너무 오래 걸린다. 무기는 컨셉상으로는 독특하긴 한데 실용적으로는 딜링이 거기서 거기라 게임을 하면 할수록 게임 캐릭터가 발전한다는 느낌이 안든다 어지간해서는 사기 무기를 언락하고 그게 한판할때 그 무기가 뽑힐때까지 계속 하는것밖에는 방법이 없을정도로 게임자체가 시너지가 별로 없고 매번 한판 할때마다 똑같은 상황만 벌어진다는 느낌이 들정도로 좀 질리게 된다대신 게임의 조작이라던지 기본적인 부분에서는 완성도가 매우 높기 때문에 여전히 추천할만은 하다 ",
            "review_score": "1"
        },
        {
            "review_text": "Can't put this one down....just anothr minute or two...it's so addictive.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, try it!",
            "review_score": "1"
        },
        {
            "review_text": "Binding of Isaac made casual.",
            "review_score": "1"
        },
        {
            "review_text": "its a game, its got gun puns, its pritty good...   7/10 -needs more gun puns",
            "review_score": "1"
        },
        {
            "review_text": "The best way to sum up this game is that its Binding of Issac meets bullet hell",
            "review_score": "1"
        },
        {
            "review_text": "its lit",
            "review_score": "1"
        },
        {
            "review_text": "pew pew pew nonstop ♥♥♥♥♥♥♥♥♥♥♥♥s",
            "review_score": "1"
        },
        {
            "review_text": "It's hard, it keeps you trying, and you can't beat it on the first day you buy it (Or at least I couldn't. I dont speak for demons, ok?) Yeah, other than that, the theme is guns. If you don't like guns, call your squire and trot off to Chancellot on your donkey elsewhere. Want details on the game? Those are spoilers, go read another review, you're not getting it from me.",
            "review_score": "1"
        },
        {
            "review_text": "This is basically 'The Binding of Isaac' but played with mouse and keyboard instead of mouse and mouse. And the game has a very big emphasis on bullet dodging ala Japanese shmups.  There is basically no story, thankfully. It's just gameplay with random items. Each game will be somewhat different, depending on what items you get, so there's plenty of replayability.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me come back to it once in a while and then I remember how much I've loved it, love that feeling!",
            "review_score": "1"
        },
        {
            "review_text": "aye this is pretty good got guns and uh...guns  the bosses are unique for a gun only theme and the weapons have a lot of variety",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this game is a blast. If you love bullet-hell twinstick shooters, you won't find much better. Combine that with the fantastic humor, even challenge, and massive armory, and there isn't much else I can say before I'm gilding the lily. Buy it, you won't regret it. 15 dollars is a pittance for endless hours of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Life is rude, tables are friends. Guns are violent, enemies are bullets. Death is excuse, 100th run is cool. Get rekt by mistake, complete whole run without a scratch.  11/9 better than 9/11",
            "review_score": "1"
        },
        {
            "review_text": "So as you can see, i have a lot of time in this game. I LOVE IT, but it hates me. Kind of a love/hate relationship at the moment, starting from when i downloaded it. I haven't beaten it yet. But I will. Eventually. The pixel art is charming and sometimes downright hilarious.  There are guns, many many guns. There are also references, many many references. It is difficult, as shown by my complete lack of beating it yet. More Binding of Isaac: rebirth then Nuclear Throne map wise, (and items) but pulls very strongly on the Nuclear Throne vibe. You will cry, lots. But then you will be happy that you beat up a giant gun-wall (I havent done that one either).  Overall I give this game an 8/10, just needs slightly more rng-related runs. Please try it!",
            "review_score": "1"
        },
        {
            "review_text": "Brutally difficult, yet compelling. Worth every penny. Plenty of levels and so so many strange guns to keep you entertained. A game with a great sense of humour.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. It's simplicity is what really makes it magical. You're given a simple set of mechanics and go from there. The amount of lore, weapons, characters and story to come across made my jaw literally drop on several occasions.",
            "review_score": "1"
        },
        {
            "review_text": "A surprising and really fun game",
            "review_score": "1"
        },
        {
            "review_text": "Okay. It's very interesting when a game just royally kicks your ♥♥♥ left, right, up, and down - and yet you cannot seem to rage quit.   It's frustrating, yes, but every time I died, I was able to say it was my own fault and needed to get better from it. 22 incredibly quick hours in, I have been to the 3rd level only a few times (given, bullet hells aren't necessarily my forte). This one's got me hooked. If you want a satisfying challenge with tons and tons of randomized replay value, Enter the Gungeon is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Unbelievably addictive. The game mechanics are spot on and the lore is absolutely brilliant. Tons of hidden content make the game replayable for hundreds of times",
            "review_score": "1"
        },
        {
            "review_text": "ITS LIKE NUCLEAR THRONE EXCEPT I DONT HAVE IT SO THIS IS THE CLOSEST THING TO IT",
            "review_score": "1"
        },
        {
            "review_text": "This game has engrossed me for hours on end and when I play at college people always are intrigued by it. The game is difficult yet fair and so clever. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Fun Rougelike. If you like Binding of Isaac or the genre you'll like this one as well. Tons of replayablilty",
            "review_score": "1"
        },
        {
            "review_text": "Just reviewing this to get my nomination badge, but this game is actually something I would recommend for a quick burst of fun. Also quite challenging.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game. I put a lot of time and effort in order to complete the gungeon. This was all in all a good experience and one of the better bullet hells that i have played",
            "review_score": "1"
        },
        {
            "review_text": "I only have 20 hours on this game, but it is a well rounded game. The interesting and unique mechanics in it make it different from many rogue-like dungeon crawlers. The quick combat in the game is really addicting and most guns are fun to use, if not unbalanced. I do not like the fact that people are comparing Enter The Gungeon to The Binding of Isaac. The games in my opinion are very different. Anyways, this game is very addicting and I can't wait to discover new mechanics and secrets!   Though, the only catch the game has is the fact that it is rather difficult. Not for people that are not good at rogue-like games.",
            "review_score": "1"
        },
        {
            "review_text": "You like Bullets? You like Hell? We put 'some' bullets inside your hell. 10/10 would get a would smash my keyboard.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game to those who like a good challenge/bullet hell/game with great OST/story. I rather enjoy this game even when I get my ♥♥♥ handed to me. It has a unique feel to it that no other game really seems to have.",
            "review_score": "1"
        },
        {
            "review_text": "Two words: ♥♥♥♥ing brilliant. Extra words: play, quit, rage, repeat. GLHF.",
            "review_score": "1"
        },
        {
            "review_text": "I just beat the final boss after 107 hours of gameplay, countless playthroughs, and I still want to continue playing and unlocking stuff. This is the best Rogue-like game I have ever played. It may not have on-line coop but it is still has local coop and that's very fun. Can't reccomend this game enough!",
            "review_score": "1"
        },
        {
            "review_text": "it is highly fun to play, you may get addicted and possibly rage. make sure to buy keys, keys and more keys! you gotta sweat on boss stages!!! just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Very fun and interesting, seemingly endless aswell. With 82 hours I've probably not even finished 25% of it. Recommended for anyone.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I've spent a LOT of time into this game. It's really good, and definitely worth the money. Although it can get crazily difficult.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, interesting take on the bullet hell genre with plenty of difficulty.",
            "review_score": "1"
        },
        {
            "review_text": "While I understand the concerns of everyone who dislike the game and everything, I still don't think thts any reason to be so pissy about the game. I personally seriously enjoy this game and when I'm bored this always manages to motivate me and once I pick up the controller it fells like I can play for hours until I eventually cave in to the @$#%&amp;!$ IRON MAIDEN. To many tears have been shed from tht boss. Personally I believe the difficulty is part of the charm of the game and I don't want to start any fights here but I think u guys r just not determined enough for a game like this and if t looked so hard for u, why'd you buy it? I don't even know where the hell people even got the idea that this game wasn't creative. Everything from the passive items, to the active items to the bosses to the guns is unique and punny. Personally I believe this game is great. EXCEPT THAT LITTLE %$^&amp;# IRON MAIDEN. TRRRRRRRIIIIIIGGGGGEEEERRRED",
            "review_score": "1"
        },
        {
            "review_text": "Great game, tons of replay value.",
            "review_score": "1"
        },
        {
            "review_text": "when you're playing this game and the rng basically makes you start over from the very beginning",
            "review_score": "1"
        },
        {
            "review_text": " TLDR - just buy the damn thing",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the best you're gonna get from an indie game and to be honest, its more than I would ask for.  Enter the Gungeon is a rogue-like. Kind of like a gun/bullets themed Binding of Isaac as there are floors with a bunch of rooms that lead to a boss room which leads to the next floor and so on.  The aesthetic is very colourful and the pixel art is really pretty to look at. On top of that, the animations for enemies, bosses, etc. are well coordinated to the point that its possible to tell whats going on even when theres a bunch of stuff on the screen.  But dont let the up-beat graphics, music and witty humor fool you, this game is hard. You'll be dying on the first floor for quite awhile if this is you're first rogue-like. But this game has a good enough balance between luck and skill, meaning thaf if you wana win, you gotta git gud. And thats fine, it adds to the overall experience of the game because when you do beat the part that you were struggling with, it makes it so much more rewarding.   Over all, Enter the Gungeon is a very solid game thats worth every single penny.  TLDR;  - Great rogue-like - Great visuals - Great music - Easy to pick up, hard to master  Edit: Apparently the devs are gonna add some guns, rooms and bosses soo thats another plus :)",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game on a whim during the Steam winter sale in 2016. I heard about how it was an enjoyable experience from people I've seen play the game. Combine that with the fact I've never played a rouge-like game before, I decided to give it a shot, and from what I've played, having never touched the genre before, I can safely say that I'm now a fan of rouge-likes because of it. I found the controls to be tight, responsive, and very easy to learn and get a hang of, at least for the keyboard controls because that's the one I use. It's fun to go around the Gungeon kicking down tables and getting into fire fights with enemies, and setting off whatever environmental hazards that are available. I feel that the game is difficult, but it isn't unfair. If I got hit, it was usually because I didn't act fast enough in response to an enemy attack, or I made the mistake of getting in the middle of a group of enemies ready to attack me, all of my mistakes were of my own doing in this game.   While it is true that this is a rouge-like game, and you lose everything when you die, there's still a constant, gradual feeling of progression with each attempt. You unlock more guns, more active items, more passives, and unlock more facilities with each gungoneer you rescue. It's satisfying to see the Breach become more and more populated as you unlock more guns and items to try. All of this new gear, in addition to your own growing understanding of enemies and their attack patterns helps you get through the Gungeon a tiny bit farther with each consecutive run. I started out only ever being able to make it to the third floor if I was lucky, but with practice, I'm getting to the fourth and fifth floors more and more often. It feels good knowing your own growing skill is such a big reason you're suceeding.   Another thing I need to make note of in this game is the achievements. So many games have them, and they feel like they're just there to earn for no real reason. Gungeon's achievements usually always have a gun or an ability unlocked with each achievement gotten, and that gives the player a great deal of insentive to get them all so they can get more weapons and abilities. It's safe to say that I've had the most fun gaining achievements in this game than any other.   Overall, if you're looking for an introduction to the rougelike genre, I'd say you've come to the right place. Enter the Gungeon is a gave that's filled to the brim with enough charm, puns, guns, and everything in between to make you come back time and time again. This game is difficult, but it's rewarding. Go in, have fun, run and gun, and don't get triggered.",
            "review_score": "1"
        }
    ]
}