{
    "app_id": 311850,
    "name": "Zombie Solitaire",
    "release_date": "2014-07-03",
    "developer": [
        "rokapublish"
    ],
    "publisher": [
        "rokapublish"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Card Game",
        "Zombies"
    ],
    "achievements": 0,
    "positive_ratings": 83,
    "negative_ratings": 34,
    "price": 6.19,
    "description": "Play your cards right and you might escape the zombie apocalypse! Biting humor and fun card-game action await you in Zombie Solitaire.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/311850/header.jpg?t=1554458929",
    "minimum_requirements": "OS: Win 95/98/2000/XP/ME/Vista/7/8/10 Processor: 1 GHz Memory: 512 MB RAM Graphics: 256 MB DirectX: Version 9.0 Storage: 95 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is actually pretty good. It is exactly what it says, basic solitare with zombie cards. You can buy some 'powerups' from the shop with money you can get from playing the game, cards that will eliminate a pile of cards, zombie types etc. The game also has a few sections of the hidden objects/map type things, I was not a fan of those, but luckily they werent too long. All in all, a good solid solitare game, but with zombies.",
            "review_score": "1"
        },
        {
            "review_text": "I like solitair games.  This one has an easy mechanic with variety in the layout of cards, and interesting extras. You play a bunch of games in one location, then move on to the next, until you get to safety from the zombies.  The zombie theme is done in a humorous way, and very amusing. And there are even brief point and click adventure-like scenes in between locations.   The interface is comfortable, and while I sometimes think an undo function would be nice, I think it is not really needed.  Very nice to play during a break, for longer, while watching TV, eating,... Whenever you'd like to play a solitair game and want something new. Even after reaching the goal, you can go back to any of the games. ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, highly recommended!!!",
            "review_score": "1"
        },
        {
            "review_text": "Zombie Solitaire (ZS) has much in common with Faerie Solitaire ( click here to read my FS review ).  ZS has some different mechanics and is, in my opinion, more difficult overall.  You might not necessarily want to pay top price for Zombie Solitaire, but if you seek a different type of solitaire game with which to consume time, check it out.  I'll cautiously recommend this game based on its adequacy as a time waster.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little variant on Solitaire, but not worth the full asking price. I got this on a super sale, so I'm not disappointed. I wouldn't pay over $2 for this. Buy it if you have Trading Card Steam Wallet money to burn, and if it's on a big sale. Either that, or if it's part of a bundle.  Good, simple time killer. Good for kids as well.  Note: don't expect it to be normal Solitaire.",
            "review_score": "1"
        },
        {
            "review_text": "zombie solitaire is not a terrible game. you get your standard solitaire gameplay with a zombie theme and good enough artwork, there are even point &amp; click sections, albeit very basic ones, before entering each area, and there are 103 levels to play through, so you should be entertained for a few hours. or you would be if it weren't for a few issues.  what little music there is isn't that bad, but it gets repetitve really fast and the sound effects aren't great either, so I turned both off pretty soon, something I hardly ever do. replaying levels is kind of a pain too, because once you complete one, the replay button disappears, so it's either back to the menu or clicking the menu button, selecting replay, etc. and if you're going for a perfect (3-star) rating on the first level of a new location, be prepared to get annoyed even more because you can't skip the p&amp;c sections, you have to do them every single time you start those levels.  an even bigger annoyance is that as soon as you reveal the last card in the deck and it's not usable, it's game over, even if you have tombstones (replacement cards) you could use. the solution? have at least one power card on you at all times (you can buy these with the money you collect), but preferably more. this way the game asks you if you want to continue using power cards and/or tombstones, even though, like I said, having only tombstones doesn't let you do this. and even this is not perfect, because as soon as you use up all your power cards, it's game over for good, even if you could still use a few tombstones.  also, it seemed to me that the way levels are randomized, they want you to use power cards, otherwise you'll fail more often than not. getting enough money to buy them won't be an issue even if you use them liberally, you'll be swimming in coins like scrooge mcduck in no time, but I think these cards are really overpowered and cheap, so some self-restraint might come in handy, otherwise you'll blow through the game pretty fast. the existence of an instant win card is really baffling too, you can buy them after level 50.  these are all issues you may or may not find that bad and if you love solitare as much as I do, you'll want to play zombie solitaire anyway, but if you're only looking for some of the better ones (the best being  fairway , sadly not available on steam), you can skip this.",
            "review_score": "-1"
        },
        {
            "review_text": "Back when I was a broke-♥♥♥ kid my only gaming option was my grandma's PC. It was a 386, and my choice of games were limited to the bargain bin at Wal-mart. Still, I got to play a lot of games that would influence my interests as I got older.  Castle of the Winds - Got me interested in rogue-likes, and then loot-heavy action-RPGs (Diablo, Torchlight, Path of Exile). The Bard's Tale - Naturally it led me into other dungeon crawlers like Elminage, Etrian Odyssey, and so on.  Wolfenstein - Enough said.  And then there is good ol' Windows Solitaire....I hated that game so much. When I got bored of everything else it was back to Solitaire. You know that saying: Wherever you go, there you are. That's how I feel when I play Solitaire, it's such a depressing game. Today I own an Xbox 360, a WiiU, a Playstation 3, a PC that can play most anything, a 3DS, a Vita, and a freakin' Japanese Saturn. Next year I'll probably get a PS4, but you know what? None of that ♥♥♥♥ matters.  Because I'm reviewing a ♥♥♥♥♥♥♥ Solitaire game right now. I just can't get away....I....just...can't....get.... ARGH!  As a bonus this game is called Zombie Solitaire. It's like my own personal hell. Zombies used to be cool, but when rotting undead that eats brains is somehow as kid-friendly as Strawberry Shortcake, you know something's wrong. Personally I'd rather the zombie apocalypse actually happen so I'll never see these freakin' games ever again.  Where was I? Oh right...I'm reviewing a game or something.   Zombie Solitaire has all of the qualities of a Solitaire game, it is addictive as hell, and it kills your productivity. Unfortunately ZS isn't even a better game than the Solitaire that came with your copy of Windows (Unless you're a Win8 user). No it's not just because it has zombies in it. ZS doesn't work because it's a bland overly-safe vanilla soft version of Solitaire. It's good at wasting your time, and not much else.  (This paragraph was originally an overly-long explanation of how Solitaire works.) Basically the goal is to get rid of all the cards  Zombie Solitaire adds a bunch of stuff. First off there's a store where you can buy special cards and tombstones. Tombstones are numbered cards (2-9) and you can use them whenever necessary. Special cards are straight up cheats. My personal favorite is the sudden strike, which simply destroys all of the cards, making you the winner. This is just plain silly because ZS has a ranking system, and even if you use the sudden strike, you still get the best rank. Sure they're expensive but money is easy to come by. Sure you know you cheated, but the game doesn't treat it as such. By the way, getting the best ranks in Zombie Solitaire is not at all brag-worthy.  Even without the overpowered cards, this game is still too easy. About 90% of Solitaire games are winnable, so it stands to reason that luck plays a factor. Zombie Solitaire has tons of levels, but there's still randomness to the cards that are dealt. The later levels are supposed to be more difficult, but if I get a good deal, then it's all rendered moot. At least Windows Solitaire tracks your wins &amp; losses. Plus it captures the main appeal of the game, the combination of logic &amp; luck. It's dealing with potential worst-case scenarios, decision-making, regret, and ultimately despair.  YMMV however. I spent far too much of my free-time playing Window Solitaire, and have become jaded because of it. If you're looking for a way to kill time, this is a decent way to do so. I'm not hip to the PC Solitaire scene, so I don't know if there's some Ultimate Solitaire 2014 simulator or whatever, but if you want something different, you could probably do better than Zombie Solitaire.  ",
            "review_score": "-1"
        }
    ]
}