{
    "app_id": 311870,
    "name": "Super Trench Attack!",
    "release_date": "2014-07-24",
    "developer": [
        "Retro Army Limited"
    ],
    "publisher": [
        "Retro Army Limited"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "RPG",
        "Indie"
    ],
    "achievements": 24,
    "positive_ratings": 992,
    "negative_ratings": 80,
    "price": 3.99,
    "description": "Super Trench Attack™ is a goofball comedy twitch-shooter based in a World War setting.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/311870/header.jpg?t=1478099080",
    "minimum_requirements": "OS: Windows XP Processor: 1.6GHZ Memory: 512 MB RAM Graphics: 64MB DirectX: Version 9.0 Storage: 196 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Super Trench Attack! can be described with two words: YES PLEASE!  Do you want one of the best WW1 games? Do you like crude humor? Do you like your boxers? Do you enjoy a silly joke? Do you like atmospheric and immersive games? Do you want a game as funny as Metal Slug but with action set in WW1? Do you want a pyro companion? You like to kill monkeys and sailors? Would you confront the Kaiser and kill him? Do you want to feel the '5$ well spent' feeling?  YES PLEASE!   10/10 for a great game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is alright. The humor isn't cringe worthy and I actually got a few chuckles out of it. It plays like an isometric shooter where you move with keyboard and aim/shoot/reload with the mouse. A few levels are made like shooting galleries (like Virtua Cop). They are the trickiest to finish especially the final one where you barely get a chance to reload.   There are mild RPG elements but they are pretty rudimentary. I upgraded my casual pistol so much that my rifle wasn't useful anymore so I pretty much finished the game with a revolver and this got boring pretty fast. There are only the revolver and rifle weapons plus grenades and booby traps (not useful at all).   The story is bare-bones and I'm kinda glad it is because I couldn't really see it going far in that territory from the get-go. Anyway, the game isn't challenging really and the whole challenge comes from some cheap boss fights that take hundreds of hits before finally going down. On the whole, it is a pretty functional game and there are a few distractions here and there to prolonge the 4-5 hours lifespan.   Super Trench Attack is a practice in patience. It MAY prove mildly enjoyable as a time passer and it PROBABLY is worth getting on a super cheap sale but you can pretty much pass this one up without feeling any kind of gaping void in your life.   Thumbs up by a slight margin.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game with a good sense of humour. 8-10 hours to get 100% achievements.",
            "review_score": "1"
        },
        {
            "review_text": "This game have taught to earn money by the legal way, not gambling them at the Casino. P.S. The Casino guy really cheats a lot!  Speaking of the game, I really enjoyed shooting the black army and laughing out loud at some moments, but I'll be short, 11/10 - It's worth your money! Waiting for the sequel btw!",
            "review_score": "1"
        },
        {
            "review_text": "This game is just AWESOME.  -You'll never get sick of the simple combat system. -You get gold to upgrade your gear, buy some ammo, or just lose it all playing black jack (all the games that involve any kind of currency should have black jack). -You can even loot stuff to decorate your tent. -The main feature: This game is so funny that i used to walk inside the gun 'store' repeatedly just to talk to a crazy guy.  I recommend it for everyone. It's just a little short, but also cheap and goes on sale often.",
            "review_score": "1"
        },
        {
            "review_text": "Super Trench Attack is a simple third person shooter a la Commando from NES. You are sent on missions which takes no more than 10 minutes each and shoot your way through each one. The pace is casual, though you will die and you will restart missions, though because it's casual the enemies will typically remain at the same HP you left them with when you died. I love the comedy that was added into the war theme. The game is lighthearted throughout. Graphics are retro, though nothing outstanding or boring about them.  I was able to finish this game and obtain all achievement in less than 10 hours easy. Just a simple casual 3rd person shooter with some humor mixed in. Definitely not a must play, but definitely a good pick up in a bundle or on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I dont know how anybody could dislike this game, its just pure fun and funny as hell",
            "review_score": "1"
        },
        {
            "review_text": "i like the atmosfere and humor, is not the best game you will play but it try his best to gave a good time.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game! Got it for 0,49 and it's quite good unlike some other cheap games that are repetitive and worthless.  9/10 if you get it for 0,49  7.2/10 if you get it for 4,99",
            "review_score": "1"
        },
        {
            "review_text": "Funny script and memorable characters mixed with arcade gameplay makes a REALLY good game. My only qualms are the Rail-Shooter sections, as defeating them with an X-Box controller proved impossible.  And the blackjack guy cheats.",
            "review_score": "1"
        },
        {
            "review_text": "Its a very good game for 2$.",
            "review_score": "1"
        },
        {
            "review_text": "I love games that are based on WWI and/or WWII. I also love comedic games. And this game is both of those things, and I LOVE IT!",
            "review_score": "1"
        },
        {
            "review_text": "WOW this is NICE game..... i laught so much!! funny, easy ........ 8,5/10",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game! It feels like Chaos General and Metal Slug mixed together with tons of good humor. You must have it in your collection.",
            "review_score": "1"
        },
        {
            "review_text": "After roughly 70 minutes of gameplay I can think I can weigh an opinion about this, so Super Trench Attack is a goofball comedy shooter type of game that sorta makes fun other war games and movies. I really liked its style and gameplay, nothing too complex or innane. Certainly worth getting and I would recommend it to people who are looking to take a step away from traditional shooters and have a good laugh.",
            "review_score": "1"
        },
        {
            "review_text": "Picked it up during a sale, definitely worth 39p.  Doesn't have a huge variety of weapons or armor but it's a fun arcade-style shooter. The writing (conversations) and the characters in the game are just insane and funny. It's a short but nice experience, a nice game to play when you're bored of all the AAA titles.  Also, the art style in this game is very retro, love it!",
            "review_score": "1"
        },
        {
            "review_text": "A game like fast food – satisfying while playing but lacks depth in the long run.  The game is either a very shallow Action RPG with shooting mechanics or a simple Iso-Shooter with mild RPG mechanics. It's this missing focus which lets the game suffer a bit. The shooting part is basically reduced to clicking on the enemy and occasionally throwing a grenade or placing a decoy or mine. As simple as that is, it also features limited ammo, reloading, line of fire and hit zones. The later are key to defeat some of the enemies like shield bearers or helmeted machine gunners, which is all the strategy there is. The RPG part features some character stats, level ups and an inventory and item system and loot drops. But none of these really shine. XP gains are mostly hidden and level ups only unlock new stuff at the shops and grant you some points to marginally improve your character, the loot is mainly gold, health/ammo if you're low on either and every so often a piece of equipment which is always outshone by vendor items. New weapons – the only way to improve your damage output – are even vendor only. There are also some uninspired passive skills like +DMG for your knife attack, +HP gain from health items or -DMG from explosions, but they're all acquired by buying them. A peeve of mine are shooting gallery passages which often take place as a boss fight and dumb down the game just this little bit more.  The art style fits the humour perfectly. The comic look allows for situations like NPCs dressing up as a giant monkey or hanging from the flag pole on their shorts without feeling out of place or awkward. If this level of childish goofiness is not your thing, though, you'll have a hard time making it through the game because it's virtually around every corner. The game is also enticing enough to make you forget the pixelated look, although the stills and cut scenes would benefit from a higher detail and less crudeness.  The world is rather small and the game fairly short. In 5h you should be through and have seen everything there is, found every hidden place and every collectible. Which is a shame, because even with all its faults the game is very enjoyable. On the other hand this enjoyment might come through the fast pace and its shortness. Just like fast food.",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't find the 'clever humor' people were talking about, and what I played was just stupid, I can't recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Very funny and addictive game.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "I really, really liked this game. It sort of reminded me of playing the original Wolfenstein back in the 80's, but not that hard.",
            "review_score": "1"
        },
        {
            "review_text": "You can kill monkeys in this game",
            "review_score": "1"
        },
        {
            "review_text": "Fuuuuun and cheap!",
            "review_score": "1"
        },
        {
            "review_text": "Almost as good as Call of Duty: Ghosts",
            "review_score": "1"
        },
        {
            "review_text": "It's at least an hour better than most games I own.",
            "review_score": "1"
        },
        {
            "review_text": "I`m still finishing it, but I already totally recommend! It has RPG elements, kind of graphic that I love, funny dialogue and scenes, fair gameplay (not too hard, not boring).  I`ve bought it on sale and it was definitely one of most well-spended money.  Completely worth a try!",
            "review_score": "1"
        },
        {
            "review_text": "Think of Metal Slug but in isometric shooter format ala Alien Shooter. It's fun. Challenging, but not too hard. Has lots of stuff to collect too.  It's quite unfortunate that the game doesn't have multiplayer option.  It could've been twice more fun playing with friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game is funny and I am to play more in the future, reccomeneded if you need some laughs and cringe in your life. 10/10 would buy random games again",
            "review_score": "1"
        },
        {
            "review_text": "The game is also good, bought no loss The operation is very simple with a sense of BGM is also very interesting.   So",
            "review_score": "1"
        },
        {
            "review_text": "If you like to shoot ♥♥♥♥, get this game.",
            "review_score": "1"
        },
        {
            "review_text": "Ok heres how it goes - This game is : SUPER FUN  : SUPER EASY (u dont rly need to spend HOURS like most of games to learn it)  : SUPER CHEAP ?!  : SUPER TIME KILLER    Totally worth a try - &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "This game is always so cheap on sale you'd think it was trash - but it's absolutely not.  The graphics aren't exciting, and the humour can be hit and miss (mostly hit), but it does exactly what it wants with the gameplay and gives you several good hours of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Get it it's tons of fun and the graphics are style everything is great Just buy it on sale",
            "review_score": "1"
        },
        {
            "review_text": "It's not a bad game by a design or mechanic standpoint, but I can't recommend it because the story (and 'comedic dialogue') isn't enjoyable or engaging for anyone over the age of 12. Even then it's a very short game. Basically, it feels like this was a browser game that's been moved to Steam, although I'm sure that's not the case.",
            "review_score": "-1"
        },
        {
            "review_text": "it was eh",
            "review_score": "-1"
        },
        {
            "review_text": "I started playing this and instantly got super heart attack. Super Trench Attack tries to be old-school and humorous yet succeeds in neither. You control a soldier that get's missions from the headquarters to clear out bunkers and search for random crap etc. Missions consist of clunky movement where you get stuck in walls when you think you were far enough from those and shooting walls when it's supposed to hit the enemy. The shooting part is the worst, you aim with a croshair but the accuracy feels terrible and you pretty much end up clicking somewhere in the general direction of the enemies. You can also throw grenades and... oh who am I kidding!? This flash-based-looking terrible excuse of paint-art is nowhere near something I could ever recommend to anyone. The whole 'program' called game hurts my gamer feelings and I want people to feel awesome and BEST.",
            "review_score": "-1"
        }
    ]
}