{
    "app_id": 311820,
    "name": "RC Mini Racers",
    "release_date": "2015-07-16",
    "developer": [
        "Decane"
    ],
    "publisher": [
        "Decane"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie",
        "Racing"
    ],
    "tags": [
        "Racing",
        "Indie",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 69,
    "negative_ratings": 39,
    "price": 3.99,
    "description": "RC Mini Racers is a fast paced and explosive racing game with 20+ remote controlled mini cars, lots of missiles and mines, turbos for an extra boost as well as great hard rock music.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/311820/header.jpg?t=1447362529",
    "minimum_requirements": "OS: Windows XP and newer Processor: Dual Core 2GHz Memory: 2 GB RAM DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "RC Mini racers reminds me much of Revolt, but without the imagination. The game involves racing toy RC cars around various tracks in either of 3 modes, Circuit Race, Sprint and Coin Race. Circuit is exactly that, Srint is A to B and Coin Race has you searching the map for randomly sporning coins. At the end od each race you win money that can be used to unlock other tracks or can be saved up to by coins.  Coins are used to unlock other RC Cars or mod them by changing the colour or wheels or the arial. Getting coins can be either fun or a grind depending on your point of view as it takes quite a while to aquire them.  The graphics are basic but suitable for this budget racer. The only fault I noticed was occasionally the wheels clipping through the floor. One other perculiarity I noticed is that the wheels are not actually attached to the vehicle. While this in no way spoils the game, it just look strange when the cars flip over.  Control is by either keyboard or game pad. Controls are not changable so your stuck with what is. I use the gamepad and steering, accerate and brake are all on the left thumbstick. Dual thumbsticks would have been much better, or at least the option of. The gamepad only controls the cars though, not the menu. So mouse clicking is also a must.  The cars themselves sound and handle like toy electric rc cars from the local toyshop. So don't expect any Pro racing here. Weapons are also included, Missles, mines and a speed boost.  This game is a fun single player ( no multiplayer ) rc racer with weapons. Its a budget game but does what it does pretty well. As long as you don't expect to much from it its worth the asking price.  Good, well done.  ",
            "review_score": "1"
        },
        {
            "review_text": "What can i say...Just don't Not the worst game i have played, but something in this day I cannot recommend.  -During my first stage, the car leaned right the entire race -you have to start on easy before you can play on normal. Can't just start on normal -Taking turns almost always ends in spinning out -during all maps I would go from being in 2nd or 3rd, to magically being in 9th or 10th. -resetting your car will put you in last place -says partial controller support, wrong, no controller support(game didnt recognize analog stick)  these are the more important flaws I found with the gameplay.  I cannot in good conscience recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Where do i start with this game? I got it as a deal, so was happy there, thought it looked like a bit of fun to blow off an hour or so, But boy was a i wrong. Opened game, turned overly loud music down abit, hopped into the first race, and the car is constantly turning left, holding right turns it right, let go and it goes straight back to turning left.  It is stupid and impossible to play, I restarted the game, redownloaded the game and still the same problem.  There is no way i can recommend this game as there is really no way to play it effectively without your fingers getting sore.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I don't understand why this game has positive reviews, it's a pathetic re-make of ReVolt!",
            "review_score": "-1"
        },
        {
            "review_text": "A remake of Re-Volt alright. Oh like the old times on PS One...",
            "review_score": "1"
        }
    ]
}