{
    "app_id": 311910,
    "name": "DIG IT! - A Digger Simulator",
    "release_date": "2014-10-14",
    "developer": [
        "Cape Copenhagen"
    ],
    "publisher": [
        "rondomedia GmbH"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Stats"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation"
    ],
    "achievements": 26,
    "positive_ratings": 78,
    "negative_ratings": 56,
    "price": 8.89,
    "description": "Do you love that moment when the engine starts and that rich diesel sound fills the air? Do you get a kick out of moving earth with a variety of high-powered diggers, bulldozers and dump trucks? Do you yearn for the feeling of power that flows through you as the hard steel of the bucket digs into the earth while you remain in keep...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/311910/header.jpg?t=1447362537",
    "minimum_requirements": "OS: Windows Vista/7/8 Processor: AMD/Intel quad-core processor running at 3.2 GHz (Intel Core i5 2nd gen or AMD FX 8350 or newer architectures are recommended) Memory: 4 GB RAM Graphics: ATI/NVIDIA dedicated or mobile graphic card with at least 1GB of dedicated VRAM and with at least DirectX 9.0c and Shader Model 4.0 support. ATI/AMD Radeon HD6850 and NVIDIA GeForce GTX460 or better DirectX: Version 9.0c Storage: 3 GB available space Sound Card: Integrated or dedicated DirectX 9 compatible sound card Additional Notes: Input devices: Keyboard and mouse",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Got it on steam sale worth it... played 50 minutes didn't get bored dis simulator inspired me alot.. to do dis as a real life job.. that's why there simulators right?   Invisible walls can be annoying, controls perfect, smooth gameplay...",
            "review_score": "1"
        },
        {
            "review_text": "i like this game a lot ! fun to play ! if u like excavators buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Can be very boring i would not recomend it. ",
            "review_score": "-1"
        },
        {
            "review_text": "nothing like the real thing at all ",
            "review_score": "-1"
        },
        {
            "review_text": "good game but i wish they would support dual joystick controlls like t.16000m joysticks and attack 3's etc",
            "review_score": "1"
        }
    ]
}