{
    "app_id": 312230,
    "name": "Spirits of Xanadu",
    "release_date": "2015-03-26",
    "developer": [
        "Good Morning, Commander"
    ],
    "publisher": [
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Action"
    ],
    "achievements": 25,
    "positive_ratings": 238,
    "negative_ratings": 60,
    "price": 3.99,
    "description": "At the farthest edge of the explored universe, the research ship Xanadu slumbers in orbit around a mysterious planet. Her systems remain active but there has been no message from her crew for months. Now a lone operative has been sent to wake the Xanadu and bring her home to Earth.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/312230/header.jpg?t=1531776072",
    "minimum_requirements": "OS: Windows XP SP2 or later Processor: 2.451 GHz dual-core Memory: 2 GB RAM Graphics: Dedicated graphics card with 512MB of VRAM and shader model 3.0 DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows XP SP2 or later Processor: 3 GHz dual-core or better Memory: 4 GB RAM Graphics: Dedicated graphics card with 512MB of VRAM and shader model 3.0 DirectX: Version 9.0c Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "It's nice (and very rare) to see a game with some good writing. The people in Spirits of Xanadu seem to have had a real human life before you got there, they do not seem to just be there for the sake of the story. Overall a great game with a superb mood.",
            "review_score": "1"
        },
        {
            "review_text": "This might just be one of my favorite games.   Now don't be fooled, this isn't a shooter, at least not really. It has shooting in it, yes, but that's not the focus and there are a limited number of enemies which will never respawn. The map is also fairly small but very easy to navigate once you've been through once or twice (and get the lights on) I'd say this is far more of a puzzle game with an incredible atmosphere. The majority of the gameplay revolves around puzzle solving while occasionally shooting robots. The puzles for the most part aren't all that difficult, with the exception of one which leads you to one of the three endings. The minimalist style might be a bit offputting depending on your sensibilites but I personaly thought it looked pretty nice. (again, after I got the lights on, Before then it COULD be a bit difficult to figure out what you're doing or where you're going)  Now, onto the thing the game get's REALLY right: atmosphere. This game scares the absolute ♥♥♥♥ out of me, but not because of cheap and ♥♥♥♥♥♥ jumpscares. From the very second you step out of your little pod you are instilled with a deep sense of dread and a feeling of 'something ain't right here...' There are a handful of scares but you could go through the game and completely miss all of them because there isn't some ♥♥♥♥♥♥ musical sting to startle you and in most cases when they happened I spent a second asking myself 'Did I actually see that?' and that is what I love so much about this game, it's smart with its scares and baths the entire experience in a rich atmosphere that stuck with me even after I turned the game off.   The voice acting in this game is incredible as well, at least for the most part. I personally thought the voice actor they had for Solomon Agnew stole the show and the other two voice actors they had weren't quite on par with his performance. Not to imply they were bad, quite the contrary, they just weren't quite as good and it was pretty noticeable to me.   The game however is pretty short (maybe 1.5-2 hours if you're quick about things, 3 if you take your time a bit) and despite being very replayable I don't know if that's really worth the $10 it's being sold for. Additionally the game doesn't seem to be optimized very well. I'm not playing on a very poweful machine but I can generally get away with playing most modern indies on mid to lower settings, but Spirits of Xanadu had very frequent framerate drops and even on the absolute lowest settings I was barely pushing 20 fps most of the time so if you're running on a budget machine keep that in mind. The default controls are pretty wacky as well so before you start the game I'd highly recommend going through and changing everything to your liking, as well as lowering the mouse sensitivity. Speaking of the mouselook, perhaps it's just me but the mouselook didn't feel very great in this game. I can't quite nail down what it is but now matter how much I fiddled with the sensitivity and whatnot it just never felt quite right.  All that said though, if you're looking for an atmospheric horror game with a super solid story then Spirits of Xanadu is gonna be exactly what you're looking for. Seriously, please please please play this game and give these guys your money, they really deserve it.  UPDATE: So sometime before I wrote this review an update was rolled out that was at least partially focused on optimization and the game runs like a dream on my computer now. There are also a few things I wanted to mention but left out of my inital review because at the time of writing I hadn't actually played the game in some time and was just going off about a dozen or so YouTube videos. 1. You can choose between a female and male character. It literally doesn't do anything other than change the grunts you make when you're injured but it's a neat little addition nonetheless.  2. There are 4 different difficulties, one of which being a peaceful mode that makes it so the enemies won't attack you unless you shoot first. I particularly like that one for repeat playthroughs because for me the second (and subsequent) run through the game was a 'Lets find the things I missed the first time!' kind of run and it's nice to not have to worry about the bots going after you.  3. The endings. I mentioned that there was more than one ending but I didn't go any deeper than that and I thought I should. There's your standard good and bad ending (Although they won't be exactly what you think, at least not right off the bat) and there is also a really neat ambiguous and kinda trippy ending that I really like but is a massive pain to actually achieve (there are walkthroughs for those of us who simply don't have the time/brain power to figure it all out) Those endings are part of what provide the game wiht so much replayability. 4. The characters. What kind of reviewer am I to mention voice actors without mentioning characters? Well it's simple, I'm not a professional. Anyway, There are three main characters in the game; Solomon Agnew, Lucy Zhao, and Cornell Johns. You never meet any of them throughout the game but in listening to the various audiologs in the game you really get a sense as to who each of these people were. I felt like I really knew these chracters as people which makes it all the more hearbreaking as you piece everything together and learn of their fates and that really is a testament to the strength of the writing and voice acting.  Another thing I absolutely need to mention is that the mouselook is fine. The issues I was experiencing I think were directly related to the low framerates I was getting and had absolutely nothing to do with the game itself. After the optimization update it feels great.",
            "review_score": "1"
        },
        {
            "review_text": "A short, enjoyable existential space scifi experience that pays homage to the System Shock series and 2001: A Space Odyssey (among others). The gameplay mechanics are varied but with limited depth: light exploration, light combat/stealth, light puzzling. Similarly, the visual aesthetic (and, some might argue, the graphical fidelity) is minimalist; yet smooth and responsive. The real focus in Spirits of Xanadu is the high quality narrative and its beautiful integration with the simple but immersive game world, aided by strong writing and voice work.  That said, I don't know that I can recommend paying for the game at its full price given the extreme briefness of the experience -- even including the multiple replays required to see all the endings. It's also worth noting that on almost all difficulty levels you will likely face at least a few frustrating/unfair 'deaths'... though at least a couple of these are tied to the narrative. When on sale, however, the System Shock 2 nostalgia evoked here alone is well worth the (sale) price to me.  I'm hoping these developers continue in the vein of Spirits of Xanadu, preferably with larger/deeper game worlds.",
            "review_score": "1"
        },
        {
            "review_text": "This...this is pretty great. I am a big fan of System Shock 2, and playing this game made me remember the good parts of it. Of course, they upped the creepy, unnerving factor of SS2 significantly, and I would have to say that this is one of the few games in recent memory that has truly unsettled me. As a big fan of psychological horror, System Shock and Sci-Fi in general, I reccomend this game. If all of the above didn't persuade you, the attention to detail in the world of the game will. The Xanadu really does look like a place that was once lived in, even more so than SS2 in my humble opinion. Pick it up!",
            "review_score": "1"
        },
        {
            "review_text": "'Now arriving at Citadell station' The unity-bred ♥♥♥♥♥♥♥ child of System Shock 2 and Deus Ex directed by Stanley Kubrick. Retro kicks to the dozen, dark corridors and lasers, space! SPAAAAACEEEEE! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of those games I had consult online help to figure out. I did it because I thought the game was broken (it isn't), not because I couldn't get my brain to noggin the puzzle. Certain task cues, mainly the power allocation part, need to be made more obvious.   But as a fan of 2001: A Space Odyssey, I enjoyed it. If you play it, make sure you see all of the possible endings.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game when it first came out because it looked like something I would enjoy and I have not been disappointed. Wandering around an abandoned space ship, shooting at robots and running away from them, solving simple puzzles, that's fun for me. It's nice that the developer is still supporting the game with updates and bugfixes.",
            "review_score": "1"
        },
        {
            "review_text": "Unlike my other reviews, with intro, explanations, pros and cons, is is going to be short:   This game is AWESOME.   It may be short, but the achievements are a heaven on earth (not too easy and not too hard or time wasting). The playtime is just perfect, the story is good and this game is a rare case of 'really worth the full price'! Buy it!  EDIT (I played it again):  I love this game. There´s not much to tell: The atmosphere´s great. Speedrun is a heaven but still you want to suck in every bit of this game. There are funny moments but also lonely moments: These moments give you the time thinking about the ship, the crew, yes maybe about yourself. You can make your own story: If you are pretty creative you can write your own story into this game because it is still pretty empty... Sounds weird? The game is weird! But let me tell you, don´t give something about graphics this time, because if you want to FEEL then play this wonderful little game.",
            "review_score": "1"
        },
        {
            "review_text": "It really is remarkable how much 'Good Morning, Commander' have accomplished with the very simple components the game is built with!  A neat, focussed little game which should be of interest to anyone who enjoyed the System Shock games or Bioshock. Pick it up cheap for an hour or two of space mystery and lasers.",
            "review_score": "1"
        },
        {
            "review_text": "Short and intriguing. Absolutely worth giving a try when on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Will ask for a refund.  PROS: - very good story and atmosphere - even tho it's not as good it reminds me of System Shock  CONS: - I get a game breaking bugs (2 rooms I can't enter, just fell through the ship and died every time; how is something as unplayable even on store)  Bottom Line: Wait till it's patched up which it clearly isn't to this point",
            "review_score": "-1"
        },
        {
            "review_text": "Short, but very enjoyable. Spirits of Xanadu delivers a precise, focused experience whilst at the same time, not holding your hand.  Would recommend",
            "review_score": "1"
        },
        {
            "review_text": "A perfect example of how you don't need blood, gore, or jumpscares to make a thrilling horror game. Bravo P.S. if you think the game is a bit short maybe you should try finding ALL THREE ENDINGS",
            "review_score": "1"
        },
        {
            "review_text": "The game has interesting premise, and there's some depth to the story. However, the actual gameplay is very tedious. Progress, especially for the 'good' ending, relies on finding items scattered throughout the ship, and there's unclear logic with regard to where those items might be. As a result, it becomes necessary to check all rooms and open all drawers / containers. The fact that the character starts in a totally dark ship with only a flashlight and a gun made early exploration more annoying. Much of the game's length is due to this search for items and bits of information. It becomes very obvious on replays -- with knowledge of all the important information (e.g. location of required items, coordinate for destination you want), the game itself can be completed in about 10 minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "I was quite looking forward to this game, as I love a good Sci-fi game setting. The concept sounded good, some good reviews also helped sway my decision to purchase the game, however I think my mistake was probably playing Alien Isolation before playing this game.   Both these games have a very similar storyline, both set in space and on an abandoned space station where strange things have happened (we'll say no more to avoid spoiling it for anyone}, and of course we go in by ourselves to find out whats been going on. On paper the story is sound but in practise the Spirits of Xanadu left me feeling like I was back in the 1990s. The visual style can be forgiven somewhat, as I was fairly prepared for that after seeing the video on the store page. What I didn't expect to find is a virtually non-existant learning curve when it comes dealing with the kamikaze style robots onboard who immediately start shooting at you almost as soon as you set foot on the station. You have a weapon of course too which comes in pretty damn handy straight away, not like in Alien Isolation where you picked up weapons over time, but at least in that game you didn't have quite a much to deal with from the start, and you were very capable of sneaking past the enemy and avoiding any combat.   In Spirits of Xanadu however it was almost a regular occurrance, and one that is immediately so frustrating that for me anyway I decided it was too much too soon, and gave up. It seemed like gaming had taken a gigantic step backwards in terms of playability.  I can appreciate that combat in games like these is a necessary requirement, but when there is very little (or not at all in this case) learning curve to ease you into a particularly simple and dare I say it 'old style' of shooting game, reminiscent of playing Doom many years ago, just with plainer graphics and simpler but just as deadlier A.I.  Yes I am over 40 and have played many games of this kind before, but frankly this game needs a lot more work to become a more enjoyable gaming experience.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was really frustrating. It is a FPS game where you roam around an abandoned ship. I played it for about half an hour and the game did not give any clear instructions on what needs to be done. I just kept dying against the aliens. The gunplay was very poor and I did not like the graphics style at all. It was all very tedious to carry on and figure what actually was going on. It seems that ther was some mystery going on in the ship but I was too bored to try and figure out what was happening. there appear to be various sections of the ship you can go to to find out.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty much the best low-fi System-Shock-2-alike I ever played.  Short and sweet!",
            "review_score": "1"
        }
    ]
}