{
    "app_id": 312220,
    "name": "Tales of Adventure 2",
    "release_date": "2014-07-14",
    "developer": [
        "XIAOYAO",
        "BetaSparkUK"
    ],
    "publisher": [
        "XIAOYAO"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "RPG",
        "Action"
    ],
    "achievements": 2,
    "positive_ratings": 15,
    "negative_ratings": 28,
    "price": 6.99,
    "description": "Set in a mysterious yet dangerous fantasy world, you have to constantly grow stronger to defeat the powerful monsters on your journey. Magical items will also randomly appear and aid you in your adventure.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/312220/header.jpg?t=1447362556",
    "minimum_requirements": "OS: Windows Vista®/XP, Windows 7, Windows 8 Processor: Intel Pentium IV @ 3.0 GHz or AMD Athlon64 3000 + @ 1.8 GHz Memory: 1 GB RAM Graphics: nVidia GeForce 6800GT or AMD Radeon X1950 Pro (256MB VRAM with Shader Model 3.0 or higher) DirectX: Version 7.1 Storage: 500 MB available space Sound Card: DirectX Compatible Sound Card with latest drivers",
    "recommended_requirements": "OS: Windows Vista®/XP, Windows 7, Windows 8 Processor: Intel Core 2 Duo E4400 @ 2.0 GHz or AMD Athlon64 X2 3800+@ 2 GHz Memory: 2 GB RAM Graphics: nVidia GeForce 9600GT or higher, AMD Radeon HD3850 or higher (512MB VRAM with Shader Model 4.0) DirectX: Version 9.0a Storage: 1 GB available space Sound Card: DirectX Compatible Sound Card with latest drivers",
    "reviews": [
        {
            "review_text": "So you are a white tiger head with a halo that flies around and shoots 3 kinds of laz0rz from itself. The aim is to move up through the level and kill everything around you. As you kill stuff you get 'exp points' that you spend on leveling up your kitten head. So... You die. A lot. Ok. Let's say it's a hardcore top down bullet hell shmup? Right.   Everything with a word 'design' in it is not that good in this game. It feels like some regular not popular PS1 game. Monsters are poorly done, the level design doesn't exist, the sounds.... Let's say I didn't find them attractive. Storytelling is poor. And the core action - the combat. Well. It's fair. But sloppy controls, and no 'emergency! spend your skills' button that we all loved in Crimsonland and Nation Red?  Just to defend this game, I'd say that there WILL be some people, who would actually like it. And, surprisingly, this is NOT among the worst games that got on Steam because of WGN promotion. 4/10 Cheers!",
            "review_score": "-1"
        },
        {
            "review_text": " First Try reviewing. First Try of this game.",
            "review_score": "-1"
        }
    ]
}