{
    "app_id": 312360,
    "name": "To End All Wars",
    "release_date": "2014-08-29",
    "developer": [
        "Ageod"
    ],
    "publisher": [
        "Slitherine Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "World War I"
    ],
    "achievements": 0,
    "positive_ratings": 92,
    "negative_ratings": 47,
    "price": 29.99,
    "description": "Ageod’s To End All Wars is a grand strategy game set during World War One. Players will take control over one of the major powers that so desperately fought for control over Europe and to end all wars.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/312360/header.jpg?t=1489397225",
    "minimum_requirements": "OS: Windows XP/Vista/7/8/10 Processor: Pentium 4 or higher Memory: 2 GB RAM Graphics: VIDEO: 1024Mb video card Storage: 3 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "AGEod is a great strategy engine and WWI is a forgotten war in videogames. So this is a very good combination. Honestly, it's not easy and not easy to learn. We need much time to understand the mechanism - even if you play with American Civil War for ages - and we need time to set everysmall details in the turns. But it worth the time. Oh, and this is an another 'one more turn' wargame.",
            "review_score": "1"
        },
        {
            "review_text": "One of the more complex Ageod games. But if you like WW1 this is a must buy. But it takes some time to get into it if you havent played any Ageod before. For Ageod starters i advise to play Alea jacta est ,also here on steam, first. Its less complex and easier to get into Ageod games. Its all about the supply thats the first hard thing to learn.",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing AGEod games since the first release. The games have always amazed me by the combination of strategy yet details. Simplicity yet complexity. It is up to you how detailed you decide to go, but for those that simply love strategy, you can focus there. For those that want to dive into details, you have that option as well.   To End All Wars is no exception, tackling WWI, an era that, in retrospect, had a more profound impact on our world today than I ever realized. ",
            "review_score": "1"
        },
        {
            "review_text": "Very deep game, very big learning curve , VERY big payoff.",
            "review_score": "1"
        },
        {
            "review_text": "Poorly optimised as usual. Youre fighting the interface as much as you are the in game opposition. Standard fare and a standard grognard mess.  Okay on a rare humble deal. Barely.",
            "review_score": "-1"
        },
        {
            "review_text": "I been playing this game off and on since i bought it. The game is very Historical and very fun once you figure out the game mechanics. I do reomend anyone to buy it also i have not one time experince any bugs and also when you have questions about the game the devlopers respond pretty qucik and they are a good help when you need some questions ask..",
            "review_score": "1"
        },
        {
            "review_text": "Europian Air War",
            "review_score": "1"
        },
        {
            "review_text": "This Game does not run on my machine. Can't even get past the play game screen. Would not recommend due to this.",
            "review_score": "-1"
        },
        {
            "review_text": "You can pick different war plans before the war starts, try your best to gain new allies, its a hard game but man its fun to play. :D",
            "review_score": "1"
        }
    ]
}