{
    "app_id": 312300,
    "name": "Heroes Rise: HeroFall",
    "release_date": "2014-07-11",
    "developer": [
        "Choice of Games"
    ],
    "publisher": [
        "Choice of Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "Indie",
        "RPG",
        "Text-Based"
    ],
    "achievements": 35,
    "positive_ratings": 118,
    "negative_ratings": 10,
    "price": 2.89,
    "description": "Would a hero like you assassinate the president? &quot;Heroes Rise: HeroFall&quot; concludes the epic &quot;Heroes Rise&quot; trilogy of interactive novels where your choices control the story. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/312300/header.jpg?t=1538616393",
    "minimum_requirements": "OS: Windows 7 Storage: 50 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is amazing. Rarely does a book (and game) invoke such strong emotions upon me.  This book, no, this game it should be a testament of everything that is great in choice of games. I laughed, I cried and sometimes I even got angry... It just goes to show how someone could easily get invested on this game. I would recommen that you start at the very first Hero Rise: The prodigy. *warning to all gamers- This game does not contain graphics or music, do some research before buying*",
            "review_score": "1"
        },
        {
            "review_text": "So this game is a text adventure by Choice of Games, which has many games on its website and mobile devices. They create their own games and host other games that people write using their software. If you care more about plot than cutscenes and running around then you will like this game, if you don't then perhaps you should go play something else. I love visual novels, and this is very similar except no pictures. This is the third and final game of the original trilogy (they are supposed to release a fourth game with a different protagonist). You can import your saves from the second game or start new. There are a lot of choices and endings in this game, or at least it seemed like there were more compared to the first one. The major villian from the first game shows up as a companion this time, and now you are on the run from the law. Your parents, who were put in jail for killing a supervillain, are about to be executed, and you need to find a way to save them without getting arrested. There are several romances, and you can be male/female and gay/straight. All the romances from the firs two games show up again, and new ones are also avaliable.",
            "review_score": "1"
        },
        {
            "review_text": "It is an exciting and fascinating story that's waiting for you right here! The whole Heroes Rise trilogy is definitely worth reading AND playing - yeah, despite of being a text novel this is still a game, and quite a re-playable one.  1. Convincing characters cause empathy. You will love them, you will hate them. 2. You'll face a thrilling plot and experience well executed storytelling. 3. You choices are not just nominal here: you become a real co-author, a co-creator of the narrative fabric.  If your imagination is developed well enough to perceive the text, be sure to pay attention to this creation.   Resume: it is definitely worthy of purchase!",
            "review_score": "1"
        },
        {
            "review_text": "Out of the trilogy I would say that this is the most satisfying to play as it ties up many loose ends and allows for greater exploration of how a characters powers could be used. My only complaint would be that some of the storytelling feels a bit weaker than the other two installments. I would still encourage anyone to play this game as it has been great fun tracing the career of a hero that I created from scratch.",
            "review_score": "1"
        },
        {
            "review_text": "The conclusion to the trilogy of Heroes Rise. This one really made me enjoy all of this series and make me feel at ease. I felt like I was the Batman or any hero you love, standing for what I felt was right, with my AI companion that followed me through all 3, the drag queen Lafawnda. I forgot to mention the fact in all 3, I had put on a few soundtracks that seemed fitting and became immersed in the game. This one wraps up the story, while still making you on your toes, waiting to see what comes next. Replay value is around the same with Hero Project, but after this involving story, some may say they see the replay value as less, all up to you. If you love a good choose-your-own adventure, or maybe the thought of being a super hero, check this series out.",
            "review_score": "1"
        },
        {
            "review_text": "The feels     #ReviveProdigal2014 pls ;-;  ",
            "review_score": "1"
        },
        {
            "review_text": "Omg i wish there were more, I only wanted to buy the first one and it got so addicting that i actually bought them. It is so different to any other game and the story line could actually make an amazing movie or comic",
            "review_score": "1"
        },
        {
            "review_text": "Great third part and finale to a very exciting choose-your-own-adventure trilogy!  Highly recommend the entire trilogy!  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Book 3 of 3 - Interactive Novel Thoroughly enjoyed the 3rd book of the series, it wrapped up all of the loose ends nicely and had some unexpected twists and turns included in it.  All up, the 'Heroes Rise' series was worth the 'play', though slow at times the hero that you create feels like your own imprint into the heroic annals of time...",
            "review_score": "1"
        },
        {
            "review_text": "If you had to choose between getting an angry pet ferret, and getting 20$, you should get the 20$... and then spend that on this game.",
            "review_score": "1"
        },
        {
            "review_text": "A considerable improvement over The Hero Project, winnowing down the list of characters considerably and allowing you more genuinely free choices with more logically-following outcomes. A return to the high narrative and characterization standards of The Prodigy.",
            "review_score": "1"
        }
    ]
}