{
    "app_id": 312440,
    "name": "Legions of Steel",
    "release_date": "2015-07-16",
    "developer": [
        "Studio Nyx"
    ],
    "publisher": [
        "Slitherine Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Turn-Based",
        "Sci-fi"
    ],
    "achievements": 21,
    "positive_ratings": 21,
    "negative_ratings": 14,
    "price": 14.99,
    "description": "The Empire of the Machines is threatening the entire universe. The other factions have banded together to defend the galaxy from the invader. Battles are raging in the corridors of the Machines underground production facilities!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/312440/header.jpg?t=1517304140",
    "minimum_requirements": "OS: Windows 7, 8, 10 Processor: Core 2 Duo Memory: 2 GB RAM Graphics: Intel HD 4000 / ATI Radeon HD 2600 / Nvidia GeForce 2xx or higher DirectX: Version 9.0c Storage: 1 GB available space Sound Card: DirectX compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Playing through the tutorial campaign &amp; enjoying learning the game mechanics. The art style &amp; music are both cool too. Only gripes are: 1. screen sometimes shakes wildly in a weird manner when scrolling, and 2. some typos, bad grammar (e.g. missing or misplaced apostrophes) &amp; inconsistent style (e.g. 'Machines' is sometimes capitalized &amp; sometimes not) in the text. Hopefully fixed in a patch. But solid gameplay &amp; aesthetic.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for the right person. I think this is a very well done tactical turn based game irregardless of time period. If you like tactical turn based games this is programmed very tight with few if any bugs.   I like this one a lot. My issues with it:  1. Graphically nice, however I find the background distracting. Use the tactical view for unhindered mayhem. (T key). They should give you multiple backgrounds to play with / in.  2. Ony two campaigns, yes and one is a tutorial campaign that is very thourough and well done. That being said, humans are the best to play against.  3. No editor. But you can customize some maps with options you select, however it is limited.  4. Sounds. Nice if you could change the music, not a big deal though.   Again, I think it's a great game and my issues are minor compared to what the game accomplishes. I enjoy it very much.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 did not let me shoot anybody         money well wasted",
            "review_score": "1"
        }
    ]
}