{
    "app_id": 312510,
    "name": "Mega Coin Squad",
    "release_date": "2014-08-15",
    "developer": [
        "Big Pixel Studios"
    ],
    "publisher": [
        "Adult Swim Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Stats"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Local Multiplayer"
    ],
    "achievements": 23,
    "positive_ratings": 64,
    "negative_ratings": 12,
    "price": 10.99,
    "description": "Tackle 16 levels in the solo quest for the Mega Coins in this manic 2D platformer from Big Pixel Studios and Adult Swim Games. Or invite your friends over to rob them of victory -- and their coins -- in four different local multiplayer modes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/312510/header.jpg?t=1447362579",
    "minimum_requirements": "OS: Windows Vista or Later Processor: Intel Core™ Duo or faster Memory: 2 GB RAM Graphics: Video card with 512MB of VRAM Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A simple title with good pixel art and audio, but some odd performance problems that could be related just to my pc (any major action like getting hurt or picking up a weapn seemed to pause my game for a second or so).  The basic game design is solid, but not really what I was looking for. I would recommend it as a party game if you pick it up on sale, otherwise you could do a lot better for $15. ",
            "review_score": "1"
        },
        {
            "review_text": "I was lucky enough to get a pre release copy of this game - well executed, with spot on mechanics - alot of items, great randomity, will be a great party game. Thank you for yet another great one Adult Swim",
            "review_score": "1"
        },
        {
            "review_text": "best game eva i luvs it get it or die, thank u very much for ur time ",
            "review_score": "1"
        },
        {
            "review_text": "A very well made game. Can be addicting and frustrating at times. The price is a bit up there though and the replayability is lacking. Overall could use more variety, but as it stands it is a very soundly built game with a comfortable control scheme.",
            "review_score": "1"
        }
    ]
}