{
    "app_id": 312560,
    "name": "Xanadu Next",
    "release_date": "2016-11-03",
    "developer": [
        "Nihon Falcom"
    ],
    "publisher": [
        "XSEED Games",
        "Marvelous USA, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "Action RPG"
    ],
    "achievements": 15,
    "positive_ratings": 188,
    "negative_ratings": 21,
    "price": 16.99,
    "description": "Whenever mist hangs over Lake Orwell, sailors catch sight of a phantom castle just out of reach. As they draw near, it fades away, leaving only questions for all who have seen this “Castle Strangerock.” Now, you must aid your charge in uncovering its secrets...even if it costs you your very soul.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/312560/header.jpg?t=1523575902",
    "minimum_requirements": "OS: Windows XP Processor: Pentium III 866 MHz Memory: 1 GB RAM Graphics: 32 MB VRAM, 3D accelerator compatible w/ DirectX 9.0c DirectX: Version 9.0c Storage: 2 GB available space Sound Card: Compatible with DirectX 9.0c",
    "recommended_requirements": "OS: Windows Vista or later (64-bit supported) Processor: Core 2 Duo 2GHz or higher Memory: 2 GB RAM Graphics: 64 MB VRAM, 3D accelerator compatible w/ DirectX 9.0c DirectX: Version 9.0c Storage: 2 GB available space Sound Card: Compatible with DirectX 9.0c",
    "reviews": [
        {
            "review_text": "Originally released in 2005, the game was relatively off western shores. Xanadu Next is a unique mix of Diablo and Zelda with a touch of Ys to boot, Great music and decent graphics, 10/10 check it out!",
            "review_score": "1"
        },
        {
            "review_text": "It's a very cool action-RPG thus far. The story actually starts out surprisingly decent (though it seems like it has fallen off a bit now that I'm in the first real dungeon, but one event actually caught me off guard), and the combat is quite good. It feels satisfying AND forces you to make a lot of strategic choices. For example, one enemy explodes and hits every creature in the room, including yourself, when you kill it. Another enemy goes down far easier with magic, but can be killed with melee attacks if you're low. And magic reliably damages enemies that you're too weak to defeat in melee, but is VERY limited (i.e. you have to recharge in town or use MP restoratives, which aren't sold in shops, to get more spell charges).  And related to that, stats make a HUGE difference in this game... I went from only doing 1 damage against certain enemies and the first real boss to 1 - 3 shotting the enemies and having an actual chance against the boss simply by allocating all my level up points for one level into attack.  Death hurts in this game, and the difficulty is no joke. You lose every unimportant item you were carrying plus 50% of your gold. The only save point I've seen thus far is in town, but after you get a certain item, you can warp back to town any time you like, plus there's moderately expensive Diablo style portals you can buy on top of that that'll take you back to where you stopped, so there's quite the risk vs. reward system going on.  People who like lore in their games will love this. You collect tablets and journals, your companion translates them for you, and once translated, you get to read up on some of Xanadu's history.  ...Oh and, oddly enough, the game seems designed with keyboard and mouse in mind. You click and your character (who's default name is Falcom, so I can only assume they REALLY want you to name him either after yourself, or with a fancy name of your own making) goes there like in a PC hack and slash game. I think you can use controllers, though the store's page says 'partial controller support,' and given what that often means, I haven't brought myself to try it yet.  So yeah. Even if the rest of the game sucks, and I don't think it will, I'm glad Falcom, XSeed, and Marvelous brought this game over. I'd love to see more older RPGs like this that we didn't get back in their heyday.  UPDATE: Tried the controller. Actually worked mostly fine for me using an Xbox 360 controller. Only issue is, by default, you have to hold down the start button to use the mouse for navigating your equipment menu. The game still feels like it was designed purely with a keyboard and mouse in mind when it came out back in 2005, but a controller does have certain advantages, like having a single button for using items instead of four, and not having to 'aim' the cursor at enemies.  I also have run into some mild bugs, but nothing gamebreaking like some people are saying, just minor text bugs (seemed to happen when I used the default name of 'Falcom' for some reason, restarting and using an original name seemed to fix it), and a weird graphical glitch in one room that quickly went away.  I've heard of more serious things happening, but haven't run into them myself, so I cannot comment on them. I'll just say, be aware that there might be issues.  I still highly recommend the game though. The gameplay is incredibly satisfying. The combat just feels great, and the way you explore in this game is extremely well done, unlocking bits of the island and its dungeons piece by piece.",
            "review_score": "1"
        },
        {
            "review_text": "Xanadu Next is your classic oldschool RPG. As oldschool as you can get. Played best with just the mouse and some keys. Literally, you can play this game with one hand, and sms someone at the same time. This game has a mix of the Ys games, Zelda (as you whack grass and objects alot to gain items), and old school crpg's like Baulders Gate, Ultima, or even Diablo.  The dungeons are a grid map style just like the old days of RPG's. It has that addicting nature of progression as well. With very slick combat, intuitive leveling system, and choices in Guardians you can use that allows you to choose which style you prefer to take the game on. If you want Strength, Endurance, Magic, etc.  If you're a snob about oldschool games and want to only play Skyrim or The Witcher 3, and these games are trash in your eye sight... Then yeah, don't buy this game. Sad to say you are missing out on a gem. If you like old school RPG's with dungeon crawling and randomly smacking down enemies? Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "It`s a Falcom game whats not to like.",
            "review_score": "1"
        },
        {
            "review_text": "Xanadu Next comes from a very different side of Nihon Falcom, one of drab, morose color schemes, calm yet profound music, and excellent dungeon design.  It is VERY apparent that the designers of this played Squaresoft classic  Vagrant Story , as the flow of gameplay, the puzzle usage, the music, and general political melieu got mixed with Ys for some interesting positioning-heavy combat that one can fly thru once you get how the game works. From the Ys side, you get the real-time combat, the coarse stat system, and the way tools open up new areas (which older Xanadu titles share).  The music is most in-line with Trails in the Sky FC's more subdued folksy and aggressive Prog sides, hitting some incredibly soaring or daring highlights. It was a delight entering into new areas and getting the game's music get more ominous and more bold with tempo and time signatures. Great selection.  Loved, loved, LOVED the last dungeon. Huge, intricate, full of secrets, puzzles, loot, shortcuts and plain clever design, I can't for the life of me cant figure out why so little of the company's later output can't hit this game's work. Maybe they don't work there any more?   I liked the localization here; it was calm and carefully chosen. A real treat for the eyes.  There are a couple of small problems befitting old J-PC coding though: renaming our protagonist friend here causes lines of text to vanish, a crash happened, and a few minor problems.   But these are nothing too serious. Put money where you people's mouths are and buy stone-cold JRPG classics like XN!",
            "review_score": "1"
        },
        {
            "review_text": "求增加当年台湾翻译的繁体中文语言,现成的游戏2005年的Xanadu Next已有现成的台服语言 Taiwanese translation of the year seeking to increase the traditional Chinese language, ready-made game 2005 Xanadu the next page has become a Taiwan service",
            "review_score": "1"
        },
        {
            "review_text": "Love this game so far. Great history behind it as well. Must play.",
            "review_score": "1"
        },
        {
            "review_text": "I'll start off with, I really did enjoy the game as far as I was able to play.  BUT... About an hour in, I noticed there were a few bugs with the game. I was unable to select my Skills or Spells tab from the inventory. So I decided I'd just play through as a warrior using the base attacks. Later after getting stuck, I looked up a guide and realised that theres a point where you need to use a Fire spell to progress any further. I've tried using both mouse/keyboard and an XBox 360 controller and cannot find any way to access my spell and cannot progress beyond about 3 hours into the game.",
            "review_score": "-1"
        }
    ]
}