{
    "app_id": 312630,
    "name": "OTTTD",
    "release_date": "2014-08-06",
    "developer": [
        "SMG Studio"
    ],
    "publisher": [
        "SMG Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Strategy",
        "Tower Defense"
    ],
    "achievements": 41,
    "positive_ratings": 176,
    "negative_ratings": 58,
    "price": 5.79,
    "description": "Take command of HEROCORP™ and launch a Preemptive Defence Campaign™ against parallel dimensions in OTTTD, the most outrageous Tower Defence title around.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/312630/header.jpg?t=1549405761",
    "minimum_requirements": "Минимальные: ОС: Microsoft® Windows® XP/Vista or later Процессор: 1.4GHz or faster Оперативная память: 1 GB ОЗУ Видеокарта: Any from the last 4 years DirectX: Версии 9.0 Место на диске: 300 MB Звуковая карта: All soundcards would work",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "OTTTD is an extemely fun tower defense game that doesn't take itself to seriously. That's not to say the game isn't challenging though. The cartoon like graphics are very good and I also enjoyed the chatter of the chars as they were instructed to do my bidding. Plenty of characters are available to play with and learn what works best on which maps. However, once you open up a few chars I would suggest you stick with 3 or four of them exclusively if you want to 100% the achievements as two of them can take awhile if you do not. I have only one complaint about the game and that is sometimes the mouse arrow disappears for a bit at the most inoppurtune times and also it can be difficult sometimes to get the right character selected because sometimes you think you have clicked on the char only to find another one still highlighted. The game represents the tower defense genre perfectly with plenty of maps and plenty of different types of towers and placements. Mix in the correct chars and you can dominate a map, if not it may take awhile to three star each map. I highly recommend the game as it is easy to learn but is a challenge to master.  *It says I have played this 313 hours to complete it but, I have a big chunk of afk time, plus after I had played the game quite a bit, I forgot to save my game to the cloud and had to start over when I lost all my games/saves do to a pc issue. So it should not take 313 hours to complete.",
            "review_score": "1"
        },
        {
            "review_text": "I'm having about 4 to 5x more fun with this tower defense game than I did with Defense Grid 2. So there it is.",
            "review_score": "1"
        },
        {
            "review_text": "This game seems to be a good tower defense game. The main negative comment is after playing the game for 1 hr, it seems the heroes die easily and take 45 min to respawn. I had to quit the game and wait for the respawn because the heroes are necessary for level progression. This smacks of mobile ftp gaming timers.  EDIT: After many more hours of playing, I have learned how to keep my heroes alive. I would recommend this game to my friends.",
            "review_score": "1"
        },
        {
            "review_text": "A solid last hurrah for government backed local video game development. These guys are worth supporting, even though at times this game feels a bit 'freemium' for a purchased product. Charms regardless.",
            "review_score": "1"
        },
        {
            "review_text": "OTTTD is now my favorite tower defense game of all time. Yeah, my favorite.  There's something about the aesthetic value of the game that I just absolutely love. Not to mention all of the lovely gore everywhere! It really makes you feel like you've totally eradicated a wave of enemies. Absolutely awesome! There's just a special charm to the game that really makes me come back and play the same levels over and over, although there are 25 campaign levels and even endless modes. Definitely not short on content for a $10 game. I would've even paid $20 for this because it's that fun. Also, a nice amount of humor is a great touch to this game.  I'll give it a 9/10 because sometimes I wish the camera could have more freedom but it's okay, it doesn't hinder the game that much at all.",
            "review_score": "1"
        },
        {
            "review_text": "I made a video review to show off some of the features and gameplay of this game!         YouTube™ Video:  IndieView - OTTTD&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, just wish it was more popular.",
            "review_score": "1"
        },
        {
            "review_text": "From my Hooked Gamers review  Tower Defence games are fairly popular. Games like Plants vs. Zombies have bought Tower Defence games into the mainstream. They are normally simple to play, easy to understand and can be played in short bursts. I do like tower defence games, but mostly as a mobile gaming fix. They are perfect games to play during my daily commutes. When the PC version of OTTTD (also known as Over the Top Tower Defence) turned up at our office, I was somewhat intrigued as to what made it ‘over the top’.  The gameplay is fairly standard for a tower defence game... you build a range of towers to stop the invading horde of enemies from reaching your base. Money is awarded for killing the enemies in which you can use to build further towers, upgrade existing towers or repair damaged ones. The towers unfortunately can only be built on pre-determined sites. There are four different tower types , although each tower can be upgraded to various other towers, so that during the latter levels you have access to twelve types. Each of the towers has varying ranges, firing speed and reload times.  Along with the mix come the three hero characters that can also take the field. There are actually seven heroes to choose from, although some are locked at the start of the game. Each of the heroes offers variation in play styles. The Engineer, for instance, focuses on repairing and strengthening towers, whilst the Assault class is a grunt who does his best work up close, using his powerful weapons to dispose of encroaching enemies. The Rocketeer on the other hand is better suited to attacking from a distance with his bazooka and ability to rain down rockets on unsuspecting foes. Part of the fun with OTTTD is working out which of the hero characters suits your game style and was is required for each of the levels.  After completing each mission, points are awarded to each of the three competing heroes. Score enough points, and the character will level up, granting three skill points. These skill points can then be spent on improving the sixteen skills available to each of the heroes. Most of the abilities are locked until the pre-requisite skill has been activated. All of the characters can learn passive skills that can upgrade their health bar, enable firing from a greater range or even have a quicker reload, but each of the different classes have their own four unique abilities that can be used in-game. Of these four they can only select two to use prior to a mission.  I did find however that since new characters are added gradually, I was often deciding to play with those heroes who had levelled up and gained use of more of their special abilities. As they had been much improved, I was loathed to give up on them in favour of a new, as yet untried, hero. I did have to use a couple of them at some points during the latter stages of the game, as one of my first choice squad died in battle. This locks the character out for a period of time and I was forced to select another hero.   I did test out each of the characters though, and each has their particular value. Their usefulness often depended on the attacking enemy though. Foes range from speedy, but lightly armoured fish, to heavily armoured, slow moving tank turtles. There are some hilarious nods to pop-culture with some of the crazy enemies. Sharks with laser beams attached to their heads and walking severed hands (like Thing from The Addams Family) are just a couple. Other standard enemies include zombies, giant teddy bears, helicopter crabs and motorcycle riding squids and each have their own strengths and weaknesses.  A number of the campaign levels contain Boss characters. In these missions, gamers don’t actually have to complete all the waves of enemies, but simply defeat the bosses. Easier said than done though, as they are usually more heavily armoured than the standard enemies, and can pack quite a punch, often disabling the towers until you repair them again. The Kraken was particularly tough, as its tentacles would appear from various water holes and damage the nearest tower quite quickly.  There are actually two game modes in OTTTD - the 25 mission campaign and the five Endless mode games. The Campaign requires gamers to defend their headquarters against certain opponents over a set number of waves of enemies. As long as the headquarters survives the onslaught, the mission is completed. Having less damage to the headquarters earns a greater score and can give a maximum of three stars for each mission. The Endless mode places you on a particular map and then continues to send wave after wave of foes until your headquarters is finally destroyed. The more waves that you survive, the greater the score.  OTTTD has a cartoonish look about it, made more comical by the variation of weird and wacky enemy invaders. The settings are bright and colourful, further adding to the cartoon feel. As enemies are destroyed they explode leaving bones and gore all over the landscape. Eventually, as the level progresses and more and more waves of enemies are destroyed, the ground becomes completely covered with viscera. This definitely looks cool, but it often completely covers the paths that the invaders follow. Towers and enemies variations are easy to distinguish luckily, and the interface is clear to read. All the important details are simple to find, making for an enjoyable experience.  It is not just the visuals that have a comedic touch. The hero characters come out with some hilarious one liners that had me chuckling to myself. The voice acting is actually pretty cool, with Arnold Schwarzenegger impersonations amongst others. The hilarity continues when you read through some of the weapon descriptions and mission briefings and de-briefings.  Tower defence games are a dime a dozen, but I found myself playing OTTTD for hours on end as I moved through the levels. The difficulty is set about right, with the early levels simple, whilst the later levels being fiendish tough. And even when completed there is always the opportunity to play through again and gain the full three stars available for each mission. The colourful visuals compliment the voice acting perfectly, setting a humorous tone. With the seven playable characters and the variation in towers, there is plenty of replay value - well, until you finally complete each level with three stars. But up to that point OTTTD is a heap of fun and worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great tower defense game with RPG elements. I was surprised at how well made this game was. There are some stages with some steep difficulty curves, but you can level up and buy new weapons to overcome that. There are also many ways to beat a single stage, depending on which heroes you choose and what towers you like. I also enjoyed the light-hearted humor.  ",
            "review_score": "1"
        },
        {
            "review_text": "OTTTD is the over-the-top tower defense game Michael Bay would make. It's full of massive explosions, gibs, gore, blood, handheld weapons of mass destruction, cheesy one-liners, motorcycle-riding octopi, flying sharks that can swallow the Goodyear Blimp whole, and action heroes that make Stallone and Schwarzenegger look like wimps.  BRING IT!!",
            "review_score": "1"
        },
        {
            "review_text": "Best tower defence game ever played! The music and 'shuffle name' function alone was worth the ten bucks!",
            "review_score": "1"
        },
        {
            "review_text": "realy cool game like the feel of it rpg/tower defence",
            "review_score": "1"
        },
        {
            "review_text": "Over the top tower defense, or OTTTD, first released on mobile and now an Steam has loads of issues. More info either in the following video or below that in written format. Choose whatever fits best for you.         YouTube™ Video:  Swash! ❧ OTTTD Critique (Steam Review)&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "OTTTD is your standard tower defense game, but somehow it's  over the top . It features a few gameplay tweaks and lovable artstyle that make it different from traditional TD titles seen before.   The Pros  OTTTD is strange. Like, it felt like something someone far younger than I would have enjoyed, and yet I still played tons of it. The characters are wonkey and different, playing is far more engaging than you'd think, and... just... somehow you end up sinking hours into it.   The Cons  OTTTD is also a bit bipolar. I can't quite figure out what it's trying to do from a gameplay perspective. There's essentially one control source (mouse, arrow keys are optional and I didn't find them useful), which makes the gameplay really simple, right? But the maps are huge, and without an indicator on turret status, it's hard to predict where mercenaries should be going. Another note is that the early game is far too easy, while the late game's difficulty is based on who you've been leveling up. I got to one of the later stages, and I've still been there after 4 hours, because I levelled up the wrong mercenaries. I understand how the mercs are supposed to be varied, but I almost feel like there's a set of mercs that are  must haves  for certain situations.   My Verdict  I haven't a ruddy clue. I expected nothing great after playing Fieldrunners, and found it more enjoyable with a similar asthetic. Then just, the time dissapeared until I hit a wall and prematurely ended my run with it. I don't think it felt rewarding, the levels aren't particularly memorable, and the new game mechanics feel implemented, but not refined. The game in and of itself isn't bad, I just don't think it was very special. It's a 'meh' out of 10, where I don't think my time was wasted but it wasn't used as well as I value it.  I'm sure someone younger would have enjoyed it more.  6.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "Mediocre graphics and bad gameplay. Save your $10.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not my cup of tea.",
            "review_score": "-1"
        }
    ]
}