{
    "app_id": 312600,
    "name": "Rime Berta",
    "release_date": "2014-12-16",
    "developer": [
        "NEXT-SOFT+"
    ],
    "publisher": [
        "AGM PLAYISM"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Strategy",
        "Anime"
    ],
    "achievements": 80,
    "positive_ratings": 80,
    "negative_ratings": 35,
    "price": 10.99,
    "description": "Command an army of puppets in this Japanese SRPG as you hunt for a relic said to grant any wish. Livia's village is dying, and all that can help them is an ancient relic situated somewhere within a mystical tower.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/312600/header.jpg?t=1555563803",
    "minimum_requirements": "OS: Windows XP,Vista,7,8 Processor: Intel Pentium 4 2.0GHz Memory: 512 MB RAM Graphics: DirectX 9.0c Shader Model 2.0 compatible DirectX: Version 9.0c Storage: 500MB MB available space Sound Card: Resolution of 800x480 or more   Sound   : DirectX compatible sound card Additional Notes: Pointing device (Mouse)",
    "recommended_requirements": "OS: Windows 7,8 Processor: Intel Core2 2.0GHz Memory: 1 GB RAM Graphics: DirectX 9.0c Shader Model 2.0 compatible DirectX: Version 9.0c Storage: 1 GB available space Sound Card: Resolution of 800x480 or more   Sound   : DirectX compatible sound card Additional Notes: Pointing device (Mouse)",
    "reviews": [
        {
            "review_text": "Rime Berta is a strategy role-playing game from the small doujin circle Next-Soft Plus, and their first (and at the time of writing this review, only) game. Drawing heavy influence from the likes of Tactics Ogre and Final Fantasy Tactics, Rime Berta debuted in Comiket of 2013, and has become available on Android. Since then, it made its way on Steam.    Story:   The game tells the tale of a couragous young girl by the name of Livia. Hailing from a village that has been pleagued with an uncurable illness, she sought to help by climbing a mysterious tower that contains a wish-granting relic at its top: the Hallows. However, many 'Guardians' patrol the tower to prevent intruders, and Livia must recruit 'dolls' that live in the tower as she fights her way up.  As far as stories go, Rime Berta's isn't completely original by any means. Much like the gameplay, it's simple, but has a certain charm to it. The few characters there are have distinct personalities, and their interactions can be pleasant. Unforunately, it is relatively short.    Gameplay:   As previously mentioned, Rime Berta draws heavily from games like TO and FFT. The dolls you receruit in the tower can belong to one of three main types: a Swordsman, Archer, or Magician. Aside from main characters, whose class cannot be changed, each of these three types can branch out into different classes for up to 24 in total. Once you go into a class path, you can't change to another, but you can backtrack to a class you were using before.  Each class has its own unique active/passive skills, and class upgrades depend on mastering some of these skills up to a certain level. You can't change weapons, armors, accessories or any of that stuff, nor can you use items. In fact, there's no monetary system for buying/selling in this game at all. You only have your skills to serve you in battle.  In battle, your units have an HP and an AP bar. Your unit dies when its HP reaches 0, and each action, whether physical skills, magical skills, moving, or normal attacks cost AP that regenrate by an amount each turn. All action skills have a countdown number that decreases when used, and cannot be used once it reaches 0.   Skills gain Skill Points with usage and level up, which is essential for class upgrade. This could be problematic when a skill you never use is part of the prequisite, and you're forced to grind that one skill to its needed amount.  There are also some glitches in some aspects of the gameplay, such as with certain statue effects, that brings the gameplay down a notch. Other than that however, the gameplay is fun and can be quite addicting.    Graphics:   The sprites in-battle look surprisingly good for a doujin game. They're crisp, smooth, and most importantly, cute. The battle animation, especially with magic, looks style-ish.  Unforunately, the illustrations outside battle are somewhat plain, as you can see from the screenshots.    Sound:   This is what I'd call the strong point of Rime Berta. The music is notably good. While there isn't much variation due to the game's short length, each track has a tinge of folk-y feel to it, and is distinctly catchy, which helps quite a bit when grinding. It's a shame because the OST doesn't come with the Steam version.    Summary:   Cutting to the chase, should you get this game?  I'd say, not with its standard price. The game is enjoyable, but is simple, short, and requires grinding for the more advanced classes. If you liked FFT-style games, you'll like this one. But for its length and overall quality, I'd only recommend you get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "one of the better SRPGs released in a long time. Hard difficulty is quite hard. There is no Disgaea nonsense here. There is no ffta or ffta2 nonsense. This is a pure SRPG not a Korean grinder pretending to be a SRPG. If you're bad power leveling isn't going to help you much. At least not on hard.   Plays like FFT mixed with either older front mission or tactics ogre. Compared to FFT you have far fewer skills per unit but they all do significantly more (e.g. damage + status or defense + status removal). You can pick up to 6 things from a list of actives, passives and overwatch/reaction skills.   You have limited 'casts' of actives per battle, but outside of high tier star spells its hard to run out. There are no items. Passives are basically your items. If your strategy is good you'll progress, if not you wont. Simple as that. If you can't figure it out and refuse to think of some good strategies don't play SRPGs.",
            "review_score": "1"
        },
        {
            "review_text": "Very Quick review from only playing the first 2 levels.   This is a very poor man's final fantasy tactics. It doesnt seem terrible for what it is so far. To enjoy this game I would say SRPGs have to be your favorite genre.    +Different job paths for party members to take.  +Ability to 'fuse' 2 characters together to make 1 better one -No gear (atleast so far, 2 levels in, I dont see any options for it anywhere or anything) -As basic of a grid SRPG combat system as you could possibly have  All in all, I will give this a 'recommend', but barely.",
            "review_score": "1"
        },
        {
            "review_text": "Hmm this game is nice, i suppose, the level growing is very fast, and can destroy novice players in strategy games very fast, if you are a regular player of strategy games you can see at least on the first levels the typical strategies, created to destroy newbies formations like archers, mages on the front, warriors on the midlle and a almost invencible unit at last guarded by a healer that heals the little damage that your warrior can do, and some mages for clean your units with big space attacks",
            "review_score": "1"
        },
        {
            "review_text": "Id meant to review this game back in March, but better late than never. Rime Berta is a very fun, yet basic game. It combines the battle systems of both Phantom Brave and Disgaea, creating a very enjoyable gameplay experience. It lacks high-quality art, however, so the visuals may be offputting to some graphic♥♥♥♥. I personally found the simplistic art charming, and the spritework very smooth. Easily the best game out of the Humble Bundle, a very very solid 7.5/10 in my book.",
            "review_score": "1"
        },
        {
            "review_text": "No Voice Acting in English, Poor Controller Support - can't configure camera properly, most keys aren't recognized. No tutorial of any kind, simplistic combat, absent story. Can't even choose a 1080p resolution despite being released in 2014. So a NO from me.",
            "review_score": "-1"
        },
        {
            "review_text": "stopped playing level 2 because you have to face 20 enemies that are the strength as you with 4 people... how am i suppose to win ♥♥♥♥ licks?",
            "review_score": "-1"
        },
        {
            "review_text": "It's a fun, barebones SRPG. The biggest failing is that there is an enormous difficulty spike for the final battle. Otherwise, the battles are fun, though the story is bland.",
            "review_score": "1"
        }
    ]
}