{
    "app_id": 312640,
    "name": "Power-Up",
    "release_date": "2014-08-29",
    "developer": [
        "Psychotic Psoftware"
    ],
    "publisher": [
        "Psychotic Psoftware"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Shoot 'Em Up"
    ],
    "achievements": 0,
    "positive_ratings": 146,
    "negative_ratings": 96,
    "price": 1.99,
    "description": "With a monster soundtrack, challenging gameplay and an impressive arsenal of weapons - Power-Up is the modern-retro styled Shoot-Em-Up from one-man game studio, Psychotic Psoftware.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/312640/header.jpg?t=1447362586",
    "minimum_requirements": "OS: Windows Vista Processor: 2.40GHz Memory: 4 GB RAM Graphics: DirectX drivers for HiDef graphics. DirectX: Version 11 Storage: 80 MB available space Sound Card: Standard Additional Notes: Compatible with the USB Xbox 360 GamePad.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Uninspiring name for an unoriginal game.  'Power Up', is yet another Shoot 'Em Up we've seen countless of times. Perhaps, it's not entirely fair of me to review a game like this since I'm just not a big fan of the genre and I've played too many of these kind of games.  Truth be told, 'Power Up' is not a bad game, it does what it has to do. It looks OK, some of the bigger enemies look kinda cool. I did not have any problem with the gameplay either; you kill a lot of enemies and try to pick up all the ... well... Power up's, of course, which increase things like your shooting power and shooting speed.  You are able to switch weapons the whole time like shooting backwards, shooting sideways or frontal shooting.  I must say I did like the soundtrack, it doesn't get annoying like in many other games.  Overall, Power Up is not the best game in the genre but it's not the worst game either. If there was an option between recommend and not recommend, I would've picked that option. Shooter fans will probably have a good time with this game, besides the game is fairly cheap, which is why I'm recommend this one.",
            "review_score": "1"
        },
        {
            "review_text": "A 2D classic shooting game that still requires XNA framework.",
            "review_score": "1"
        },
        {
            "review_text": "Oldschool game and hard so not easy as a result this is a good game. And you can get trading cards.",
            "review_score": "1"
        },
        {
            "review_text": "Simple side scrolling shoot em up but done really well. If you are after that 16bit nostalgic side scrolling shoot em up go for it.",
            "review_score": "1"
        },
        {
            "review_text": "I've played it only twice, so it's an early review, but as a fan of shmups I feel like I've gotten a fairly good grasp of the game.   Gameplay: The gameplay reminds me of a hypothetical Gradius clone for the Amiga. That is a good thing. It's the first old school shmup I've played on Steam that actually feels oldschool without being too simple. While the enemies are fairly basic, they are better than similar games at this price point. The weapon switching and power up system is the highlight of the game design. They are well balanced for various play styles. Switching on the fly and strategizing is excelllent.  Difficulty: It's difficult, but not that bad. It's much, much easier than something like Strikers 1945 or Ikaruga. Using no forcefields, on the first play through on the hardest difficulty (Psychopathic - 1 life) I made it to the end of the third stage. It's suitable for people new to the genre. Thankfully, it's not cheap.  Control: I played with the keyboard and it was okay, except for when I got to about speed level 5 it became a hinderance. A slowdown button would be helpful for navigating bullet fields.  Sound: The music is good. The sound is decent, but occaisionally a bit repetitive. The voice samples for the weapon switching are at the perfect volume and sounded awesome.   What is missing: * No score keeping? For a game that places quite an emphasis on score, it is a strange, glaring omission. * Slow down button. * A more difficult, extreme difficulty to satisfy the veteran shmup players.  * Sound control. The laser effects can grate after awhile.  What would be nice (but, hey - it's a solo developer): * Score-based challenges.  * A few different playing ships. * Online score competitions. * More enemy types (down the road).   Overall: It's good. It's not perfect, it's a bit clumsy. However, It's worth the pricepoint and a good oldschool intro to the genre for new folks. Support the dev and hopefully the game will grow a bit to meet it's potential.   ",
            "review_score": "1"
        },
        {
            "review_text": "Terrible, even for a bundle game.  It has cards so I guess there is that.  The controls are bad, gamepad or keyboard. It doesn't play like or even compare to the classics like R-type. Graphics are very poor, and there are no options to speak of. The music is loud and grating, the resolutions are 'windowed' or that resolution stretched to full screen. The story is just kind of pathetic. I generally like casual games like this that I can pick up quickly. However this wasn't any fun from the beginning and that didn't change.  The game is incredibly easy, the only challenge to speak of comes from the unresponsive poor controls.  It would be fine I guess as a flash game from a website, but as an actual game it's not worth the money, even if it's from a 'one man studio' or whatever kitchy buzzword you want to throw at it.",
            "review_score": "-1"
        },
        {
            "review_text": "Doesn't attract at all. And it has way too many cards.",
            "review_score": "-1"
        },
        {
            "review_text": "For fwee",
            "review_score": "-1"
        },
        {
            "review_text": "An addictive, retro style 'shoot em up' game! I am not usually into these sort of games but I lost six hours of my life somehow playing it. LOL. Really awesome game for a super low price. I found out from the other comments here that ONE man made this game which is quite impressive! Bravo!",
            "review_score": "1"
        },
        {
            "review_text": "Power-Up is a good game. That's the good news.  Now the bad news:  - Resolution options?, ♥♥♥♥ them, there is none...  - Control options, again: there is none.  - Control explanaintions?, forget it: you are a mind reader, so starting the game you should be able to read the mind of the developers and know before hand the controls for keyboard...  - Sound options?, who need them?. You will love that music, louder than the SFX!  By now you should see a patter here, as clear as day: there are no options. Well, almost, there is actually two options: keyboard or gampad, and fullscreen or window.   To me, this game is an easy 7/10 but until they add some options I will rate it 5/10.",
            "review_score": "1"
        }
    ]
}