{
    "app_id": 312900,
    "name": "Zoo Rampage",
    "release_date": "2014-07-09",
    "developer": [
        "ViWo Games"
    ],
    "publisher": [
        "ViWo Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Stats"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 45,
    "positive_ratings": 80,
    "negative_ratings": 40,
    "price": 2.79,
    "description": "Did you ever wonder how it was like to be on the other side of the fence? In this zoo you can figure it out - take control over the whole area and destroy what kept you in prison for so long.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/312900/header.jpg?t=1447362599",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Dual-Core 2.8 GHz Memory: 4000 MB RAM Graphics: NVIDIA GeForce GTX 650 Storage: 1000 MB available space",
    "recommended_requirements": "OS: Windows 7 Processor: Quad Core Processor 3GHz Memory: 4000 MB RAM Graphics: NVIDIA GeForce GTX 560 Storage: 1500 MB available space",
    "reviews": [
        {
            "review_text": "Great concept, but the could have been much better. it is fun to be honest and it has 4 players Local Co-op which made it even better, the game is basically you control an animal from a Zoo and try to do as much damage as you can (destroy trees, cars and also hitting guards and visitors) to get higher scores. you will finish the game within an hour cause it is really short, it has 2 mini games also, you have soccer where you have a goal and up to 4 players fighting to score as many goals as possible. the other mini game consists of people that can be knocked so you could steal as many fishes as possible.  P.S. you can get all 45 Achievements within 2 hours of playing, they are really easy to get.",
            "review_score": "1"
        },
        {
            "review_text": "Just played it for the first time while doing a Let's Play for my channel, and it was a lot of fun. I had played the Zoo Tycoon games a while ago for a little bit, but it is more fun to be the animal running wild.",
            "review_score": "1"
        },
        {
            "review_text": "+ Different kinds of animals you can control + Destroying stuff is fun  - Mediocre graphics - Extremely short - Small levels  [Rating: 58/100]",
            "review_score": "1"
        },
        {
            "review_text": "boring and repititive nothing interesting at all, should have change to Free to play instead waste of my 1,100 Gems  Get this game if you want but i would suggest that you save your money to buy other game.",
            "review_score": "-1"
        },
        {
            "review_text": "not even worth it  its really make me sad to say this about videogame but  if you can call this a videogame then rip videogames",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty simple game. Would be fun if the partial controller support wasn't busted. Controls are only WASD and space right now. Would have expected arrow keys to usable alternatively.",
            "review_score": "-1"
        }
    ]
}