{
    "app_id": 313010,
    "name": "Cities XXL",
    "release_date": "2015-02-05",
    "developer": [
        "Focus Home Interactive"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "City Builder",
        "Simulation",
        "Building"
    ],
    "achievements": 27,
    "positive_ratings": 575,
    "negative_ratings": 1286,
    "price": 7.49,
    "description": "Design, build, and manage the world’s largest and most diverse cities in Cities XXL. Bigger and better than ever before with a more powerful game engine and new interface, become the mayor of your very own sprawling metropolis.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/313010/header.jpg?t=1488273979",
    "minimum_requirements": "OS: WINDOWS VISTA/WINDOWS 7/WINDOWS 8 Processor: AMD/INTEL DUAL-CORE 2.5 GHZ Memory: 3072 MB RAM Graphics: 768 MB 100% DIRECTX 10 AND SHADERS 4.0 COMPATIBLE ATI RADEON HD 5670/NVIDIA GEFORCE GTX 260 OR HIGHER Storage: 8 GB available space Sound Card: DIRECTX COMPATIBLE Additional Notes: INTERNET CONNECTION REQUIRED FOR THE GAME ACTIVATION, WINDOWS XP NON SUPPORTED",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's... not terrible.  As city builders go, it has issues, and if you own previous iterations of the game, then probably not worth it, but it isn't terrible at all.  In some ways it's deeper than Cities Skylines, in other ways it isn't, I miss districts, for example, but I actually prefer some of the mechanics and the 'feel' of XXL. There's plenty of content to unlock and the graphics work well, though not sure with the big-head design choice for the population.  I wouldn't rate it as the greatest game, or even the greatest City Builder I've ever played, but if you are a Builder fan, then, well, it's not terrible.",
            "review_score": "1"
        },
        {
            "review_text": "This being my first game for this franchise and not having played anything from Cities XL Platinum and before, I am quite impressed with this game. The way they allow you to zone the housing, the farms. I am really enjoying it though no game is to be honest perfect in every way. This game has performances issues when I zoom in too much to zone houses or zoom in to street level, I'd experience several FPS drops but apart from that I am loving this game and I am impress at the level of detail in some aspects but appalled at the lack of detail in some areas. This has so far been worth my money and addictive and it's just fun cracking my brain and trying to solve whatever problem that comes up :) A whole new experience from Sim City 5! Rated 7/10",
            "review_score": "1"
        },
        {
            "review_text": "So, I wanted to give it some serious play time before attempting to critique this game. It recieved alot of harsh comments but all of them seem to be from people who were expecting some massive change from thier XL content. I have never owned Cities XL so I can say this XXL version is well worth the purchase. I love the global overview off the starts that allows me to basically build several citites on a continent and attempt to balance economies by trading between them. Its adictive...I find myself spending an hour or more on each city of mine daily to increase population and balance trade. No bugs or lag issues to speak of. I have a solid 30fps at all times even when conducting long roadway placements. One week in and I've got 4 cities up to 300,000 and each has a market niche to generate revenue. Once you find what your city excels at you can either trade to the game 'OMNICORP' for cash flow or use it to balance your other cities shortcomings. Stratigic thinking, decent graphics, larg scale cities &amp; global economies make this a big winner in my book.",
            "review_score": "1"
        },
        {
            "review_text": "Its a city builder game what can i say if you like this type of game this is a good one its like sim city on steriods.",
            "review_score": "1"
        },
        {
            "review_text": " Basically Sim City but more advanced.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "This was the first game in the series I bought, so I don't share the animosity others do about XXL being overpriced, but I still don't understand why people think the actual game is bad. It's actually very good imo. It's the most realistic city builder available, and the city builder which gives you the most flexibility in building. It can feel a bit lifeless in comparison to other modern city builders (notably CSL), and isn't that challenging, but it is my go to game for making beautiful, realistic cities.   As far as technical issues, the game runs fine for me. Had it bug out on me once when I tried to place a blueprint structure. In my latest city, I've filled about half the map and am getting 25-30 fps on medium graphics with a marginal GPU (although I do have a high-end CPU). Bridges and interchanges are a royal pain in the ♥♥♥, but other than that I find the user interface intuitive and easy to work with.",
            "review_score": "1"
        },
        {
            "review_text": "first of all. YES the game is pretty much exactly like XL, not much has changed, so if you already own XL platinum maybe wait until this is on sale.   the game BY ITSELF is definitely a good game. workshop support is nice new feature, although since everyone seems to be bandwagon against this game, I doubt the workshop will get much love. This game also runs a lot better than XL did for me, so there's that.",
            "review_score": "1"
        },
        {
            "review_text": "I actually like the game. I have never owned the previous titles of Cities XL so getting Cities XXL after getting fobbed off with Sim City was a welcome change.   Positives  The maps are huge The graphics are nice The building options are extensive  Good neighbourhood creation tools  Negatives The people of the city have big heads (WTF!) The Simulation of the mechanics of the city is shoddy  Sometimes confusing bridge and tunnel links  No overground trains (Huh? Weird) No building evolution mechanics  ",
            "review_score": "1"
        },
        {
            "review_text": "The game is MUCH better than any version before. Performance is way better, and by that I mean that it doesn't laaaaag after a city gets larger or after playing for a few hours. I know this because I did beta testing and I have hundreds and hundreds of hours playing Cities XL 2012 version. That laaag the previous versions had made a lot of people give up after reaching a certain population / city size. All that is now gone.  If you played any previous version and liked it then you will love this one.   If you are a new player and want a great city builder/planner that looks great and has large maps (11x11km) then look no further.  The game by it self is fun for some time. Like any other city builder you will get bored after making a few cities. That is the case in any Sim City game as well.  BUT! Thankfully the game has a great modding community which took this game to a whole new level. So you will never get bored because existing mods and new ones coming out on a regular basis will keep you hooked for a long time. There is a great comunnity forum that you just must check out:  www.xlnation.city   Don't listen to the trolls saying the game is not better, it's the same as before etc. etc. Like I said I have hundreds of hours in previous versions and this one is extremely improved. Yes it is the same in many ways which is a good thing considering that old mods will be compatible.   - It now spreads the workload of the game across all cores of the processor which makes it run smoother when the city gets larger. Is it true multicore or not doesn't really matter as long as the performance is better, and it is. - It now has DirectX 11 support - They added the workshop option - Now you can use fbx format to make mods - They added eco green upgrades for Heavy industry and Manufacturing buildings. Upgraded buildings produce much less polution. - It has some new transportation options (new park &amp; ride bus system, new cargo airport) - New leisure buildings (including a large leisure airport, speed boat marina and a yacht marina) - New skyboxes to choose from (with clouds) - New parks - New polution reducing/enviroment improving buildings - New camera (just hit 'C' on the keyboard and use page up, page down / arrow keys / Ctrl button to move around)  All in all this is a great game if you want to have FUN making/designing your dream city be it modern american style city or an older looking european city or even an asian style city. Or maybe all of those on a single map. The possibilites, specially if you use mods, are endless.",
            "review_score": "1"
        },
        {
            "review_text": "Over the past week, city building fans have waited patitently for what they were hoping to be the definitive city builder since SimCity 4. Unfortunately the opinions of players has been mixed at best. So is Cities XXL better than Cities XL or worse in every way? We have heard people say this is just a re-branding of an old game, so we decided to find out for ourselves.  Cities XL first launched in 2009 and was a spiritual successor to City Life. The game offered expansive landscapes in which to build your dream city along with online capabilities (long before SimCity). However this did not live up to expectations, the online was a flop, the game suffered from poor optimization such as only using one core on multi-core systems and various memory leaks. Despite this, fans of the series have remained loyal. Despite its faults, Cities XL has offered a very fluid and flexible city building game.  When Cities XXL was announced, it was detailed to have an all new engine, more low-level micro-management and various improvements including to performance. These alone should make it a worthy upgrade or entry point for a budding city builder.  Well the first thing we questioned is the games engine. It is possible this is a new engine under the hood, but on the surface it looks very much the same engine as before. Graphically the game looks the same, albeit with a new black UI. The controls work much the same way and the menus are largely the same. So on the surface at least, the engine seems to have been tweaked rather than fully re-worked from the ground up.  Performance wise, this game is far better. Our city of 425k inhabitants is still as smooth as when we started. In Cities XL Platinum, a similar sized city we had suffered from terrible frame rates and choppiness at this point. The UI is also more responsive than before. We did encounter some minor graphical glitches, mostly that at night, streetlights would illuminate a grid beneath them. But nothing game breaking.  There are some new buildings to place in your city, like a pollution sensor and an eco-car dealer. There are not enough with too little function to add much weight behind a new game release, but welcome additions.  Talking of pollution, this has been greatly tweaked and works more the way you would expect. It makes more sense than ever before to ensure your industry is far from residential areas, where as before it was more of a case of “Does City have Heavy Pollution? Yes, City becomes polluted everywhere quickly”.  What we found most disappointing is there is not much of the low-level micro-management that was promised. What sets the Cities XL/XXL series apart from the SimCity series is the latter focuses much more on micro management and is more organic. In SimCity you say where you want residential, commercial and industrial areas, then depending on the desirability of the area would dictate what would be built there. This would not be static, you could have a luxury hi-rise apartment, but if crime in the area goes up this may become abandoned becoming an eyesore on your landscape. Cities XL/XXL cities generally remain the same, you will not find one neighborhood going from being desirable for Elites to suddenly becoming deserted.  Despite this short coming, one major addition that will help over time to make the Cities XXL the city building game we have been waiting for is the inclusion of the Steam Workshop. I really look forward to seeing the modding community making new buildings, new functions, improvements, fixes and potentially new functionality.  If you are a fan of the series, the current 50% discount off the price is very reasonable. Even not as a full game but £15 as a kind of expansion is not bad value. If you’ve never owned a game in this series and you want large sprawling cities rather than the small towns in SimCity then this is a game well worth picking up.",
            "review_score": "1"
        },
        {
            "review_text": "A great Game, fixes many of the problems in Cities XL, however it still needs polishing.  I'd give it a 9/10.  I'll skip the pros and go to the cons: needs better road construction needs better terraforming tool needs to fix coastal building, they are useless ",
            "review_score": "1"
        },
        {
            "review_text": "As a long-time SimCity fan - I love it !! Lotsa buildings,big maps on a grand scale,plenty of micro-managing if you like.",
            "review_score": "1"
        },
        {
            "review_text": "I normally dont review games but I wanted to throw in my 2 cents on this one. I love City builders and this game in all its versions has sersiously frustrated me. It's a good game but just as you get going in the previous versions it would lag to an unplayable state.  That being said, I want to note a few things for people that are considering buying this for first time as well as upgrading.  1) So far im well past population where issues start occuring in the old version and I have flawless performance. So the folks on here and youtube that are stating there is no performance increase I'm calling BS.  2) It's a GREAT City builder that got a bad rep because of past versions performance issues (this HAS been fixed)  Now on to a few points concerning the company. Do I think they are shady and does it anger me that I had to pay 20 bucks for a patch? Yes Is this the same game reskinned? Yes Is it a bad game? NO  The people raging on Steam are simply ♥♥♥♥♥♥ off that this isn't a new game. I watched the trailers and any people that has played the previous games would know by looking at the trailers that it was the same game. What do you expect? They have released 3 'new versions' that were literally the same game. I didnt expect any less. I just wanted the performance fixed so I could enjoy the damn game for what it was and unfortunately I was forced to pay $20 to do so.  Focus you should be ASHAMED for treating your players like that.  They said a long time ago that the game needed to be rebuilt to get multicore support and maybe thats how the justified the 'new game' this time. But its the same game WITH MULTICORE. People are saying there is no multicore support when indeed there is you can see it in your CPU monitor.   Is it even across all cores? No, but it works and it runs great.  So take the complaining with a grain of salt. A lot of people expected something different when the trailers clearly showed the same damn game and anyone that spent any time in XL knows it.  Thanks and I hope this helps you buy or not buy the game. As for me, I am enjoying it and going to recommend it based on the fact I got it @ 50% off (still a ♥♥♥♥ off) and I am actually able to play it again. Also going to up vote to help counter the RAGE reviews.  I want to DOWN vote it based on Focus being a slimy money grubbing company that treats their gamers like crap.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  -multi-threaded finally -for first timer worth the buy  -Not challenging at all -no micromanagement -focused mainly on building -no need to worry much what people think just build.  -cons: -no micromanagement -Not challenging at all -focused mainly on building - Feels like there is no interaction with your city. -no need to worry much what people think just build.  Final Thoughts: You will either like this game or not, I personally dislike this game as i need a strategy or some point to play the game. the building aspect alone does not statisfy my fun meter in this game, so i will spend my time elsewhere in other games, although some might like it, all depends what you're into, all and all, it's a hit or miss with what you like to do",
            "review_score": "1"
        },
        {
            "review_text": "Well, I broke down and bought Cities XXL and I must say at first glance It looked alot like Cities XL but as I exsplored I saw many new features that were pritty cool. I like the ability to be able to switch between zoning and individual building placement. This feature gives you the ability to build your city in more detail. My favorite thing is the Steam Workshop application. Modding is going to be what makes this game rock. Though I would have liked to see an above ground rail network I am not totaly disapointed in the game. Hopefully this will be added in a later update. I would have also liked to see the traffic interacting in the city like ems responding to calls or police like sim city that is the only thing that game really had going for it! I would also like to see car crashes if traffic is to bad. But my over all impression is there is alot that one can do with this game and with steam workshop and some great modders who have not given up on this franchise I think this game has a lot of potential. So rather you get it now or wait on it to go on sell I would recomend this game!",
            "review_score": "1"
        },
        {
            "review_text": "hay i see the newer veshon cities XXL plantom is that one better and how",
            "review_score": "1"
        },
        {
            "review_text": "So far overall it's a good game and is what it's expected to be. However I noticed there may be a save game corruption issue. Saved a game and reloaded it later on, city was in a state it was a long while earlier in playthrough yet my blueprint project I started much later on had started (with no way to cancel). Why did I need to cancel it? It wasn't on the map and would make 0 progression when resources were allocated to it. So there are some bugs.",
            "review_score": "1"
        },
        {
            "review_text": "Its decent. The skies are pretty, there are some new buildings and finally there is a new menu and ingame toolbar skin. Of course I could hate about the fact that it is the same, but what do you expect? They have been doing this since CXL2011. Enjoy the buildings and enjoy the fact that this game can finally be played with less lagg. And just be patient for the great mods that modders like monty will make.",
            "review_score": "1"
        },
        {
            "review_text": "Well I can't say whether this is the same game as CitiesXL or not, as I was unable to ever play CitiesXL due to it always crashing after about 10 minutes. At least this one didn't crash, so if you always wanted to see what CitiesXL was like and never could before, this is probably worth trying.",
            "review_score": "1"
        },
        {
            "review_text": "i never play any old v ... but this game is so cool  so if you are never play old v ... buy it  but if u already got old v i think from other commants, rev, post .. dont bec almost the same.  'they fixed momery leak ,m.core'",
            "review_score": "1"
        },
        {
            "review_text": "It's only just come out (5th Feb 2015) but already I've played it enough to know it's an almost exact clone of the predeecing version (XL Platinum), the only difference being that the GUI has had a 'Windows 8.1' makeover (it's turned funeral grey and is bordeless). Otherwise, it's the same game it ever was, complete with stutters and jutters and rather poorly realised calculation tables that means as the city gets larger, the whole thing slows down. This was always a talking point of earlier versions, but looks like the programmers have simply ignored all suggestions (yet again...!). I've yet to get a really big city going, but a medium sized one is already showing signs of buckling under the claculations strain.  Despite this, it's still a better game (in my view) than it's big-company rival Sim City, with its kiddy graphics and sandbox square townships. It will appeal to those who just want to get on with building a city, along more accurate simulation models. Just be prepared to fill your swear box when things start grinding to a standstill. Oh, and they've changed the muzak yet again. Nice touch that.",
            "review_score": "1"
        },
        {
            "review_text": "Cities XL had it's shortcomings, and most of them have been fixed. The 'new' UI might not be enought to satisfy some of the older players of the series, but to me it it is sufficient enought to be called a change.  The gameplay is fluid, and once you get a hang of the game you will have loads of fun. It will probably become even better once the workshop has gotten filled with new content.  And remember that this is more of a city builder than a city simulator. Even though this game has a ok supply and demand-mechanic, you might get dissapointed if you are looking for awesome simulation, then you should probably look for something else.   And also, CLOUDS!",
            "review_score": "1"
        },
        {
            "review_text": "Only played for about 10 minutes, didnt expect much only bought it becouse it was cheap and will be good to pass time until cities skylines come out.",
            "review_score": "1"
        },
        {
            "review_text": "I want my money back.  This game is just the game they released 3 years ago, with the UI color changed from blue to black.  Don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY !   This is the same game as before. I mean, IT'S THE SAME GAME. They changed the color of the UI.. It's the same maps. The same grapics. The same interface. The SAME GAME as before.   DO NOT BUY.  I want my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "This is exactly the same as XL. DO NOT WASTE YOUR MONEY. get cities skyline.",
            "review_score": "-1"
        },
        {
            "review_text": "If you own Cities XL is like you are paying twice for the same game, literal. And thats it, a scam, a fraud, so evident that even the executable its labeled as Cities XL.",
            "review_score": "-1"
        },
        {
            "review_text": "Updated graphics. Steam workshop. Multi threading support.  Those are the features that set this apart from Platinum and the rest. If that justifies $20 for you then so be it. I however simply wish I could have spent my money on something better.  Also, I liked Cities XL because, well, SimCity was garbage. Cities at least thought outside of the box, and there are some things I still miss like trading between all your cities and realistic population calculations. But alas, it has been overcome by Cities Skylines in the overall experience.",
            "review_score": "-1"
        },
        {
            "review_text": "Should have been a free update for XL.",
            "review_score": "-1"
        },
        {
            "review_text": "If you already own Cities XL, then I recommend you DO NOT buy this game as they are near identical.  Better alternative: Cities Skylines",
            "review_score": "-1"
        },
        {
            "review_text": "Hey look, it's the last game in the same series with a new name.  If you can point me to anything that's changed and improved that wouldn't have fitted in a patch, that'd be lovely. Also impossible.  Valve, just refund every single person who's posted a negative review of this.",
            "review_score": "-1"
        },
        {
            "review_text": "If I had skipped the video intro and the title screen, I would have thought I opened Cities XL by mistake.  I pre-ordered early based on the promise of 'more powerful game engine and new interface', as both were really lacking in XL. Well, they're still lacking in XXL, since as far as I can tell there isn't a difference.  Games like this is why there should be a refund option.",
            "review_score": "-1"
        },
        {
            "review_text": "More of the same, go buy Cities Skylines",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just a re-hash of Cities XL and is not worth the money. This is the exact same game and was NOT woth the money! Shame on the developers for outright ripping us off.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid 20 Dollars for the same game. Very dissappointed in this game. I even prefer the old user interface over the new one. I want my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "I literally just bought the same game twice and by that I mean cities XXL and cities XL Platinium! Don't buy this unless it's the first time you buy from this series. The game as the same maps, buildings, even the menu is identical! Only change I saw was the UI color change from blue to black/grey. WANT REFUND!",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing really new, the same old game with Steam Workshop added. This games was literly announced a few months ago with a short release date. I really wish some company would fill this genre with a quality product.    Cities XXL does not even qualify to be called Cities XL+",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty much the same game as the previous one.  The only thing this game has that is better then sim city is map size.  The cities feel dead.  Wait for Cities: Skylines to release.",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of money, nothing new. This one must be a joke",
            "review_score": "-1"
        },
        {
            "review_text": "For a newcomer to the franchise this is not a bad game. For everybody else though...  This game is basically the same as Cities XL. The only big change is multicore support but let's be honest, that should have been a free update ages ago.  I call every enthousiast to boycot this game. Don't buy it. Basically you are buying what should have been a patch.  The only reason Cities XXL exists is so Focus can squeeze some more money out of it. As long as we keep buying crap games producers will keep selling them. We need to send Focus a message: they need to understand that we're not taking it any longer.  That is why people should not buy this game, that is why this game should as many bad reviews as possible and that is why everybody should ask for a refund. The game simply does not deliver what it promised and that is false advertising.",
            "review_score": "-1"
        },
        {
            "review_text": "It is wery dissapointing to see a game with should be a new product, and yet it just an upgrade for wich you need to pay normal price.  No, no, no.... Do not buy it if you have a previus fersion.  SM4 or SM5 are good to.  Mabey CITIES SKYLINE will change how we see City builders. Can't wait",
            "review_score": "-1"
        },
        {
            "review_text": "It's really not a bad game, but it's still a thumbs down as it's pretty much identical to the previous version (Cities XL).  It's more than a little annoying to pay for a game I already had when I was expecting it to have been an upgrade.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty much the same game as Cities XL. Why oh why didnt I listen to everyone.",
            "review_score": "-1"
        },
        {
            "review_text": "Whats new - nothing!",
            "review_score": "-1"
        },
        {
            "review_text": "Old Game New Theme",
            "review_score": "-1"
        },
        {
            "review_text": "As everyone writes before me, it's just basically another expansion, at best. The tutorial, UI, build menu is almost the same except for a few graphic changes. If you don't have cities xl12, and you want to buy it, wait for it to go on sale. If you do, it's the same ol' same ol'.",
            "review_score": "-1"
        },
        {
            "review_text": "Sadly, this is just a rip off. Same thing as 2012 Plat. with small changes. There are very few additions to this game. Most of them were available as mods on the earlier game. Overall a complete waste of money. Probably won't ever play it.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is unplayable for me due to road-graphics glitch. Either the roads decide to act like a seizure inducing stroboscope or outright disappear unless im fully zoomed in! Placing roads makes the fps drop dramatically from a steady 60 to 4-5fps, this in combination with the glitches i mentioned earlier makes the game completely unplayable. Where do I go for a refund!",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing has changed from what i have seen.",
            "review_score": "-1"
        },
        {
            "review_text": "I was expecting stuff from this game. I just got Cities XL with a new name. Disappointing...",
            "review_score": "-1"
        },
        {
            "review_text": "I should have read up on this game before buying it. I already owned Cities XL and initially I thought 'Cities XXL' was a lame title to begin with. That should have been a red flag. The title is not even creative. The game itself literally is almost exactly the same game as its predecessors, as has already been said many times. There may be some new buildings buried in there somewhere but I haven't found them yet.  I really tried to give this game a chance. I wanted to give it the benefit of the doubt (especially since I spent $20 on it...), but I'm afraid there's nothing for it. It is not worth the money, and worse yet it is a total scam.  Don't buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Some bugs have been fixed, performance is slightly better but other than that it's pretty much Cities XL from 2009. Game is still very choppy when building roads and the management scheme is still obsolete. It still evolves mindlessly placing buildings.  I wouldn't even recommend the game for newcomers. Wait for Cities Skylines, it appears to be a much more promising experience.",
            "review_score": "-1"
        },
        {
            "review_text": "Cities XL wasn't that good, so I didn't expect a lot from Cities XXL. What I did expect was something different to Cities XXL. Now I have paid for the same game twice. I think Steam needs to look into this - a refund would be appreciated.",
            "review_score": "-1"
        },
        {
            "review_text": "total rip off is the same game with diferent UI color, same engine = same memory leak.. minors changes some new buildings. i think they could sell this as dlc not as new game.. disappointed one more time...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is more of the same, I truely think that they noticed Cities Skylines on the horizon and decided to put out a release in hopes of getting a few city builder frieks like myself to part with their money. It is the same game, If you have played CitiesXL and grown tired of it you will not find any new or fresh content that will make it fun again. I cannot find a difference between it and the last game. I want to like this game, and I can succeed in it, but after a few cities you just end up bored by the same tired old mechanics and fake it till you make it economy.  I wish I could get my money back. Oh well, back to banished.",
            "review_score": "-1"
        },
        {
            "review_text": "This is not a game for anybody who owned the any previous version of Cities XL. If your new to it, its worth the buy but not at $20. Around $5 more like.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Repackaged garbage, I want my giggle back.",
            "review_score": "-1"
        },
        {
            "review_text": "If this game was released like this 10 years ago I would have been impressed. I played Cities XL 2011 and thought it was quite good even though it had room for improvement. When I played Cities XXL everything looked the same and I realised it was not a new game but just an upgrade. I feel the promotion of this game was misleading and so I won't even get started with what I still think this game lacks.",
            "review_score": "-1"
        },
        {
            "review_text": "If this game was released like this 10 years ago I would have been impressed. I played Cities XL 2011 and thought it was quite good even though it had room for improvement. When I played Cities XXL everything looked the same and I realised it was not a new game but just an upgrade. I feel the promotion of this game was misleading and so I won't even get started with what I still think this game lacks.",
            "review_score": "-1"
        },
        {
            "review_text": "A lot of bugs like in Cities XL... Sometimes buttons doesn't work (I click the button but the game doesn't 'understand' it. If you already have Cities XL, don't buy XXL... It's the same ♥♥♥♥, sorry, game...",
            "review_score": "-1"
        },
        {
            "review_text": "Same game as Cities XL Platinum - not to buy, the same buggs !!!",
            "review_score": "-1"
        },
        {
            "review_text": "Thought it would be much better!!!! turns out its just as glitchy and bad as the old ones and now it wont even open the game wow!! what a rip off really. didint wanna say it but wow, GIVE OUR MONEY BACK",
            "review_score": "-1"
        },
        {
            "review_text": "Another rehash of the existing game. Nothing really new to see here. Avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "Can I have my money back?  I think I've accidentally bought Cities XL again...",
            "review_score": "-1"
        },
        {
            "review_text": "The only thign i have noticed are some maps are 3x the size they used to be, but other then that a horrible crappier version of its former self.  to be honest i would wait for cities skylines, which has far more promise.",
            "review_score": "-1"
        },
        {
            "review_text": "After crashing and control issues, I finally got to building a city. View controls were laggy (none of this 'Smooth FPS no matter what size' stuff) and plotting was incredibly laggy too. So much for smooth performance. If you are new to the game, it's worth it at maybe $20 max, but otherwise, avoid it. It has issues that should have been resolved years ago. Makes sense why gameplay vidoes and such never surfaced before release.  If you want something with similar features and such, look into Cities: Skylines. Much better value for the money. Uninstalled Cities XL XXL edition (or whatever you want to call this 'new game' DLC) after it came out. Put your money towards developers and publishers who care about the end product and the customers, and who aren't trying to rip you off.",
            "review_score": "-1"
        },
        {
            "review_text": "I have played the earlier CIties games and love them, which is why I jumped on the discounted newer version. However that discount just lured me into playing the same game I have always loved... I have since logged nearly 30hrs of playtime, while I haven't experienced any of the crashes some folks have (I have a ridiculously awesome pc) I have noticed plummeting FPS and ridiculous road glitches. And the delete/bulldoze tool still pisses me off (WHY DO YOU HAVE SOME KIND OF LOCK ON THE DELETE ITEM OPTION?!?! AND WHY IS MY DELETE TOOLS SMALLEST SIZE STILL THE SIZE OF A MASSIVE FREAKING AVENUE/HIGHWAY?!?!). While I still love this game, even through the quirks, I was really hoping for some of the engine and graphics updates I have seen elsewhere. So I am left $20 lighter and disapointed in the Cities XXL franchise in total. You sucked more money out of me to give me the same game... New players to Cities will enjoy this game, and the franchise, it is a fun time. But I am bummed out beyond belief... 30hrs in and I haven't noticed anything really new... at all...",
            "review_score": "-1"
        },
        {
            "review_text": "try not to 'make' the same game again next time  guys,okay? ",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this game 40 ♥♥♥♥ing bucks ♥♥♥♥ of. Money doesn't grow on my back. I truly wish I could go back in time to not buy this games, and save money voor cities skylines.",
            "review_score": "-1"
        },
        {
            "review_text": "This feels like the same game as Cities XL, which I already own. The interface, the building tools, the game mechanics all seems the same to me.   What's different?  * Allegedly performance does not fall apart so badly in the end game as with Cities XL * Some new content * Steam Achievements * Steam Workshop  Pretty sure engine, achievements, and workshop could have been a game update for cities XL, and the new pieces of content could have been DLC for cities XL.   So why did I buy the same game released under a new name? Somehow I thought it would be a different game. Perhaps because it is sold as a different game. But it seems to just be a port of mostly the same game to a new engine.  Why would you buy this?  * You don't already own Cities XL and the game is on sale * You desperately want the steam achievements and the game is on sale * You desperately want the steam workshop support and the game is on sale * You desperately want the new content and the game is on sale  Even at the 50% pre-order price offered to those who already owned Cities XL, this seems like a well played con job.   Other developers have demonstrated how to update existing games with additions like steam achievements, 64bit builds, engine updates, additional content, etc.. It's a shame that Focus decided to ignore the good examples set by others, instead pulling an insulting scam of a strategy out of their rear ends.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is really not worth the money. I used to play sim city 4 deluxe edition when i was a kid. I was thinking that this was going to be a 2014 version of that 2003 game and i was gravely mistaken. They are incredibly simplar with some minor graphical improvements. Its not worth the money.",
            "review_score": "-1"
        },
        {
            "review_text": "Do NOT buy this game. It's just another version of the previous games. It is NOT a new game, and they are asking new game prices.  This is simply cities XL with a new (worse) UI. Avoid at all costs.",
            "review_score": "-1"
        },
        {
            "review_text": "TLDR: Close to being such a good game and yet so far away. Overall it comes across as having all the ingredients to be the the greatest city building game ever, and If they fixed some of the flaws it would be great, as it is, I just can't recommend it.  I know of the big furore over this game essentially being a poor update on a previously released title 'Cities XL', but I never bought those games and cannot judge this game against it; this review will just be of the game on its own and in isolation. If anything my comparison point would be 'SimCity 4', because like most people we've all just been crying out for a sequel to that game that has never happened (at least not how we wanted it, looking at you SimCity Societies).  The Good: - You can build a city as pretty as the pictures above, it's all very zen. - The music is quite nice and generally the onscreen notifications aren't overwhelming or irritating. - Gameplay is fairly intuitive with nicely varied levels of difficulty, especially if you're used to the city building game format. - The trading system is balanced meaning specialisation of a city can be done easily, you want to build a tourist paradise or an farming utopia? Knock yourself out, it's a lot of flexibility with how you play.  The Bad: - Poor terrain modification tools, the maps look how they look and you'd better like it. - The UI is a little bit clunky, occasionally you'll miss-click things. - Zoom out a little bit and all the vehicles turn to weird grey/black boxes on the road. It upsets your zen greatly. - I can build individual buildings to a style or I can basically pot-luck it with the city zoning, I can't just set a style of building? You crazy. - Roads vs Terrain, being unable to properly terraform the landscape makes this maddening however. - The tutorial thinks it's funny.  The Ugly: - This game will crash on you, a lot, regularly. - Lag. Laaaaaaaaggggggg.  Verdict: If they got rid of the ugly, you could live with the bad, with both however you end up struggling to play the game, this then magnifies any flaws with the game. Like old Lara Crofts terrible camera angles, or resident evils weird control schemes, you fight with them for a while and then you put the game down and you just never pick it up again.",
            "review_score": "-1"
        },
        {
            "review_text": "Simcity digital delux is mutch better.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is crap and constantly crashed.",
            "review_score": "-1"
        },
        {
            "review_text": "great load of b***** just as well only paid 20 euro for it.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a scam, shame on Focus and Steam.  All they have done is recoloured the Ui, all the same old bugs are there.  There is nothing new here like they say there is, it is all total lies.  This needs to be removed from Steam and refunds given out, this sort of behaviour HAS to STOP.  Believe it or not this is even worse than the WarZ fiasco.  There is a flag to report this game, do it now, everyone should be reporting this game, it is about time we the gamers stood up and said enough of this sort of scam.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is identical not only in gameplay but in appearance to all previous releases of the game. There may be some new buildings included, but you can't obviously tell. The only real positive is that this edition runs so much smoother than the older editions which makes the huge cities that you can build so much more playable. Overall, quite a disappoint and at its current price of $39.99 USD, just feels like the biggest rip off if you own previous copies of the game.  If you don't already own a copy of any of the Cities games, then this is a not so bad alternative to let down of Sim City 2013.",
            "review_score": "-1"
        },
        {
            "review_text": "I never review a game before ..... but this one need mine. DO NOT BUY THIS &amp;?%$ game!",
            "review_score": "-1"
        },
        {
            "review_text": "don't buy this game, it waste your money",
            "review_score": "-1"
        },
        {
            "review_text": "what a f*ck?)",
            "review_score": "-1"
        },
        {
            "review_text": "It is the same game as Cities XL. I wasted $20.00...",
            "review_score": "-1"
        },
        {
            "review_text": "It is the same game as Cities XL. I wasted $20.00...",
            "review_score": "-1"
        },
        {
            "review_text": "Well... I was suspecting about this.... I just fell sorry about Focus Home Interactive ... they have just lost most of their fans.... I cant say more than all the other comments that are the same!!!!!!!!!!!!!! lol...",
            "review_score": "-1"
        },
        {
            "review_text": "I suppose i will never learn. Buying a game before it is released because you enjoy the previous games and hope for good, that time is over.  I played alot of platinum, and played a few hours of this XXL. I realised after a few thousands of population that nothing, and i mean nothing, changed. Will we get our money back because we are unhappy? No. The company will bankrupt or shutdown in the near futur, its leaders laughing their asses off. Sad times for the pc gaming community",
            "review_score": "-1"
        },
        {
            "review_text": "Buy one of the older cities xl games instead. They are the same game and cheaper.",
            "review_score": "-1"
        },
        {
            "review_text": "I should've listened to the reviews this game IS terrible.  Pros; - It's a city builder - Large maps - I didn't suffer from too many performance issues - Graphics... maybe.  Cons: - Road creation system is horrific! - Zoning system is horrific! - GUI is hard to navigate. - The camera is horrific. You can't get it in a good position and it moves too fast. Theres also no options to change the speed of it or anything (or atleast none that I could find)  I honestly prefer Simcity 2013 and that isn't really saying anything since I actually loved that game but you know.",
            "review_score": "-1"
        },
        {
            "review_text": "retitled/colored cities XL... move along.",
            "review_score": "-1"
        },
        {
            "review_text": "Like its predecessor the game boring, The soundtrack is very annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "Buggy and nothing new",
            "review_score": "-1"
        },
        {
            "review_text": "biggest rip off in history same as th xl game.",
            "review_score": "-1"
        },
        {
            "review_text": "Buy cities: skylines instead",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I use to have a positive review, but after months of waiting after release, this review is now negitive because not only did the developers fail its old community, I feel it has failed its new one.  Literally almost zero developement been done in those months, no indepth micromanaging, traffic is impossible to work with as you can't do special turnpikes,make straightaways, the tunnels are horrible, can't do anything special with the roads what so ever, no content being added (even though it was released as a 'finished' game) has left the game with no veriety, and since there was such a huge let down between XL and XXL the modding community is almost non-exsistent leaving us a game worse than the most recent simcity. The only thing this game might have over other games is larger maps but whats the point of larger maps if the game just lacks, or just sucks in general. Keep your money, go to Cities Skylines. (The only way I see that this game will get back a good review is if micromanaging got a huge upgrade and being able to see almost every little stat in your town like how many crimes, where those crimes are committed, how efficient is your facilities are being, basically redo the whole game please, that'd be grat)",
            "review_score": "-1"
        }
    ]
}