{
    "app_id": 3130,
    "name": "Men of War: Red Tide",
    "release_date": "2009-11-01",
    "developer": [
        "1C Entertainment"
    ],
    "publisher": [
        "1C Entertainment",
        "1C-SoftClub"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "World War II",
        "RTS"
    ],
    "achievements": 0,
    "positive_ratings": 294,
    "negative_ratings": 69,
    "price": 3.99,
    "description": "Men of War: Red Tide is a sequel to the critically acclaimed RTS Men of War. Red Tide introduces a new story driven campaign based on the writings of Soviet scribe Alexander Zorich, it also includes dozens of new or upgraded units and weapons.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3130/header.jpg?t=1552483822",
    "minimum_requirements": "OS: Windows XP (service pack 1) Processor: Intel Pentium 4 2,6 GHz (Athlon 3000+) Memory: 1 GB RAM Graphics: NVIDIA GeForce 6200 or ATI Radeon 9600 (128 MB RAM) DirectX®: 9.0c Hard Drive: 5 GB of free hard disc space Sound: Sound card compatible with DirectX 9.0c",
    "recommended_requirements": "OS: Windows XP (service pack 1) / Windows Vista Processor: Core 2 Duo 2,33 GHz Memory: 2 GB RAM Graphics: NVIDIA GeForce 8600 or ATI Radeon HD 2600 (256 MB RAM) DirectX®: 9.0c Hard Drive: 5 GB of free hard disc space Sound: Sound card compatible with DirectX 9.0c",
    "reviews": [
        {
            "review_text": "You want a real game where you expierence the actual Russian side, that's harder than ♥♥♥♥ing a owl? Get this game, better than CoH 2, which was a complete let down. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "-Buy this thing -thinking it would be like company of heroes or something -playing the first mission -rushing my squad to the enemy -WTF!!! my squad is gone!!! f**kin MG!!! -see some walkthrouh -finally can pass the mission -continuing the second mission -the naration makes me bleed -don't give a s*it about the naration because is the most hardest RTS i've ever played -they want me too charge a hill with 2 squad then take over the town which is full of tanks -lose 1 of my squad completely to some mot**fuc**n MG again!!!! -try to take the howitzer from the hill ,and take over the town -get REKt by anothe howitzer placed next to the field -fu*k -able to finish the mission by taking some mortar and fu*k the nazi after 2 hours. -continuing to the 3rd mission. -get 1 squad... have to take over a village full of enemy and tanks -15/10 would get REKT again",
            "review_score": "1"
        },
        {
            "review_text": "Red Tide is the second chapter in the Men of War series, presenting WWII engagements from the Russian perspective, refreshingly. There are some subtle improvements over the original. Large battles in particular are much easier... you are given a relatively small force to command, and the AI forces will advance as you do. It is strictly a single player campaign, with some challenging maps, even on easy. I love the game despite its difficulty. When you are intimately familiar with the controls, and nimble with the view options, every engagement is a treat visially and tactically. The only thing I would ask for is a replay option that records your battle and then allows you to observe the battle later or share with friends. Hopefully that option will appear in the Vietnam version due later this year.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Prepare for the rage quit though. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "What enemy has: -Unlimited light machine-gun user soldiers -15~ Cannons and Heavy machine-guns -Tanks which can ♥♥♥♥ your tanks in minutes -2 howitzers at completeley different locations which can attack every point in the map -and some armored vehicles which can destroy your tanks easily Objective: Defeat the enemy defensive line and destroy every enemy in the village What you have: -Some soldiers with rifles (not automatic) -2-3 tanks which can do nothing against howitzer fire -Stupid AI ally who charge front of heavy machine-guns with soldiers. 11/10 want charge again front of heavy-machine guns along with my ally.",
            "review_score": "1"
        },
        {
            "review_text": "This game was hard becase of the units not following my orders half the time. Impossible to anything when they don`t move and walk past or stand next to enemies without shoting. Controlls are horrible and the AI is dreadfull. I do not recommend this at all and do not understanc why everyone recommends this",
            "review_score": "-1"
        },
        {
            "review_text": "Communism.. How amusing.. How majestic  MoW: RT is well done as well",
            "review_score": "1"
        },
        {
            "review_text": "This is by far the hardest, and worst Men Of War game I have ever played.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Dont buy this game... i mean like... dont even think about it.. At first i thought it is a good game ... but then.. omg i will have nightmares from playing this game!",
            "review_score": "-1"
        },
        {
            "review_text": "If you would like to fight tiger tanks and elephants with 2 men (Who happen to have peashooters) This game is for you.   You play as Soviet Stronkforce in a battle against the Facist Scum. You will battle Romanians, Germans, Itallians, Germans and lastly, Germans.   Your mind will be blown if you have a ♥♥♥♥ PC beucause you can run the game even when you're bringing a city to the ground with heavy Artillery.  This game is definitely the Hardest MoW in my opinion. (I have experience in MoW Vietnam and Assault Squad 2)  If you want to be good at missions with lots of men I reccomend getting good at AS2 or if you are playing with a small squad of me MoW Vietnam.   The game isn't as hard as people say. You'll be able to tackle hard right off the bat.",
            "review_score": "1"
        },
        {
            "review_text": "Can't even finish the first mission on easy with cheat engine -.-     8/10 buy this instead of Company of heroes 2",
            "review_score": "1"
        }
    ]
}