{
    "app_id": 313200,
    "name": "The Abbey",
    "release_date": "2014-07-15",
    "developer": [
        "Crimson Cow"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 29,
    "negative_ratings": 18,
    "price": 14.99,
    "description": "Thou shalt not kill!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/313200/header.jpg?t=1447362626",
    "minimum_requirements": "OS: Windows XP / Windows Vista / Windows 7 Processor: 1,4 Ghz Memory: 512 MB RAM Graphics: 64 MB RAM GeForce FX Generation or ATI Radeon 9500 DirectX: Version 9.0 Storage: 3 GB available space Sound Card: DirectX 9.0 compatible Soundcard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "While not at the top of the pack when it comes to adventure games, I still enjoyed this game's environment and story. It took me until the end of the game to realize that the same voice actor performs all of the characters (it dawned on me when he mixed up a couple of the characters' accents in some dialog at the climax).",
            "review_score": "1"
        },
        {
            "review_text": "I am really happy I waited until I got this at such a discount. Not owrth my 2 euro, to be honest.  Let me tell you something: I have set my eyes on this game last year when I first saw it... a year later, I get it at this huge discount here and start playing right away.  problem 1: The game constantly shows that it cannot find specific files, because either the game modules or the steam ones cannot read the special characters in the file/folder names. (I have to rename them or just constantly hit enter until the segment is skipped)  problem 2: After 80 minutes of playing and just getting to the puzzle-solving part of the game, I had to go to bed (early work on the next day). Well, welcome back to me after a nasty day at the office, and here are no saved games for me to load.  Overall: Too many bugs to have me return to it.",
            "review_score": "-1"
        },
        {
            "review_text": "(Spoiler Alert)   Loosely based in similar fashion to the movie 'Name of the Rose' which is one of my favorites. In the movie a Abbey is being investigated for what seems like a series of supernatural killings, for instance one guy gets killed in a locked room with no secret passages. A visiting wise monk investigating the murders believes that it is human who is killing everyone and sets out to discover the culprit through unconventional means like scientific observation. Unfortunately for him now enters the Spanish Inquisition who is close on his heels wanting to blame anyone for the murders so they can simply put to rest these rumors. Hence the unconventional methods which are his friend in finding the identity of the real killer, may also be in fact become his worst enemy. The investigating monk soon learns about a secret library and feels that this Abbey and the secret library might be hiding some very dark secrets...  So how is the game in comparison to such an interesting story? First mistake is that the murders in the game are hardly supernatural. One gets strangled by a belt, the other has a sentry dropped on his head. Therefore any suggestion of the supernatural seems unwarranted. While the movie suggests supernatural and ends up being anything but that, the game does quite the opposite. In the last few minutes you'll find that the culprit was a megalomaniac striving for supernatural powers through possession, your then treated to some Harry Potter incantations. Why the devs thought this cheap twist would be more suitable is beyond me.  The murders in this game are boring in comparison to the movie, the secret library is a tedious adventure in comparison also. Your side kick is such a moron that if the game offered an opportunity where I could make him swallow belladonna, mercury and rat poison I would have taken it. Your charcter moves so slow it is difficult to tell when your moving and when your game is set on pause. I've seen crushed garden snails move quicker. Why the dev's thought this speed would be good for the game is also beyond me. Your main archnemesis in the end is so stupid that it's hard to believe he has learnt how to tie shoe laces never mind world domination. The Abbey's layout is hardly gamer friendly and the puzzles are simply walking around and being at everyone's beck and call when they want something. The game is laboriously long, less tedious if you just sit through it with a walk through.  Credit where credit is due. Cartoon animation great, voice acting and sounds, music fitting at least. With all the work spent on this I'm surprised with the finishing result though. Definitely NOT worth full price. Sale maybe if your curious. Instead watch the movie. It's a masterpiece in comparison...",
            "review_score": "-1"
        }
    ]
}