{
    "app_id": 313340,
    "name": "Mountain",
    "release_date": "2014-08-18",
    "developer": [
        "David OReilly"
    ],
    "publisher": [
        "Double Fine Presents",
        "David OReilly"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "VR Support",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Indie",
        "Casual"
    ],
    "achievements": 31,
    "positive_ratings": 10936,
    "negative_ratings": 1516,
    "price": 0.79,
    "description": "Existential Nature Simulation",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/313340/header.jpg?t=1550463720",
    "minimum_requirements": "OS: Windows XP/Vista/Windows 7/Windows 8 Processor: 1.7+ GHz or better Memory: 2 GB RAM Graphics: Radeon HD5450 or better; 256 MB or higher DirectX: Version 9.0c Storage: 200 MB available space Sound Card: 100% DirectX9.0c compatible sound card and drivers",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Just like my life, it's boring, tedious and meaningless, but I still can't end it for some reason. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "At least now when I die, I'll be known as that chick who wasted her life on a virtual mountain.",
            "review_score": "1"
        },
        {
            "review_text": " I have no idea what's the point of this game but it's quite soothing. In fact there are no controls and there is feature to play your own music theme because some of keys are making piano sounds.",
            "review_score": "1"
        },
        {
            "review_text": "Like Skyrim with mountains.",
            "review_score": "1"
        },
        {
            "review_text": "You play as a camera observing a mountain, and you can play the piano. If it were free, I would reccomend this. But I feel for 99p, there is not enough content. It should be freeware, in my opinion. Also, it is a CPU hog.",
            "review_score": "-1"
        },
        {
            "review_text": "Still better than COD",
            "review_score": "1"
        },
        {
            "review_text": "Major unadvertised feature: prevents you from playing steam games when you should be doing more important things.",
            "review_score": "1"
        },
        {
            "review_text": "The game where you and your friends can get, and spend 2 hours describing your mountains to them.  10/10 Would mountain again",
            "review_score": "1"
        },
        {
            "review_text": "I love how peaceful and calm this game is. Good for people looking for something to just relax to.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy the questing and the combat system presented in this game, everything is pretty balanced except for that one abilitiy that kills everything in one shot. Also the optics for certain weapons dont work when their supposed to. 10/10 a great family game great for the kids and fun for the adults",
            "review_score": "1"
        },
        {
            "review_text": "It changed my life!  I don't need social interaction anymore nor friends! All i need is a Mountain, slowly spinning while calm music is playing",
            "review_score": "1"
        },
        {
            "review_text": "This is not a game.  It is more. What is Mountain? By definition a mountain is a large natural elevation of the earth's surface rising abruptly from the surrounding level. But what does this mean exactly? This is a form of art we ourselves cannot comprehend. It may seem like there is nothing, but a mountain may also be described as a large pile or quantity of something. A great deal. A lot. A profusion. An abundance. There is more to Mountain that we cannot understand. Is it in the trees? Is it in the Mountain itself? Do we wait for the weather to change to ask these questions? The subtle piano melody. The scale. The depth. Maybe it's in the clouds which glide over head. It's a metaphor for life. We see little, but there is much more. So I ask you. Or do you ask? 'Why spend 99 cents on Mountain?' A synonym I can conjure from that sentence follows: 'Why spend 99 cents on the answer to life?' Mountain is the answer to the worlds problems. This is what philosophers have been trying to figure out for years. And these answers are in Mountain. Or is the answer the Mountain itself?  I ask one more time. What is Mountain?  ...  That is for you to answer. Or has it been answered already?  ...  Mountain.",
            "review_score": "1"
        },
        {
            "review_text": "Mountain by David OReilly is the best FPS in the market, from storytelling to gameplay, Mountain will blow you away. The graphics are totally next gen and rivals call of duty advanced warfare. Not only Mountain has a great and superb single player but also has one of the best and fair multi player. The euphoria that I got from this game, you can’t get from any where else  because this game is a masterpiece.  REASONS WHY TO GET THE GAME: + Game has an outstanding OST + Amazing next gen graphics  + Fantastic storytelling and RPG elements + Great gameplay and handling + Cheap price  - It’s a very demanding game  RECOMENDED SPECS: 64 gigabytes of ram INTEL i9 10th generation processing 1 terabyte of SSD free storage 4 SLI 880TI GTX NVidia graphics cards  THE FINALE VERDIC  GAME OF THE YEAR 2014 10/10 – IGN  ",
            "review_score": "1"
        },
        {
            "review_text": "It's ok",
            "review_score": "1"
        },
        {
            "review_text": "better than photoshop and SAI  and you can even play a piano",
            "review_score": "1"
        },
        {
            "review_text": "Playing this made me realize I was missing an essential part of my life.",
            "review_score": "1"
        },
        {
            "review_text": "Would waste my whole life in front of my monitor again.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "&gt;has 1€ remaining in steam wallet &gt;searches games under 1€ &gt;finds mountain &gt;downloads mountain &gt;launch mountain &gt;draw 3 penlses &gt;get an oddly penls shaped mountain &gt;someone throws a sword in it &gt;grab sword &gt;sword fell out of my god hands &gt;sword is rip  10/10 would spend 20€ on it",
            "review_score": "1"
        },
        {
            "review_text": "Best game to use while studying, look at is as a zen garden of sorts, or a place to just relax.",
            "review_score": "1"
        },
        {
            "review_text": "IF YOU LIKE INTENSE, STRESSFUL, AND ACTION PACKED GAMEPLAY ALONG WITH ENDLESS REPLAYABILITY, THIS IS THE GAME FOR YOU. GREAT STOYLINE ALONG WITH KILLSTREAKS.",
            "review_score": "1"
        },
        {
            "review_text": "This. Game. Changed me. Before i was just a little boy with a dream. And now im a man a strong man, Thank you mountain",
            "review_score": "1"
        },
        {
            "review_text": "8.2/10 - Mountain is more than meets the eye!  You don't need VR to enjoy this game; but I definitely look forward to trying this game again when I get a good setup. This is more of a passive game which you sit back and watch the wonders of your mountain evolve and diminish.   The keys are musical notes that will trigger special events. If you aren't going through some of the 20+ codes then you are really missing out! I highly recommend the Annihilation trigger.  Worth the $0.99! I can't wait to try with VR.     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "This hill need time to grow into the mountain,and your life need time to become more colourful.Everything around us just need time to change themselves.Only time...",
            "review_score": "1"
        },
        {
            "review_text": "I m God of a moving wallpaper.... 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Most stressful game i've ever played, had me on edge the entire time. Gud Game.",
            "review_score": "1"
        },
        {
            "review_text": "my friends wouldn't read my reccomendation anyway",
            "review_score": "1"
        },
        {
            "review_text": "Mountain. A game of true beauty. Let me say, that throughout all seventy-five of all my games, I have NEVER had the chance to become a mountain before. Ever since I was little, I have always wanted to become a professional mountain. But I never got the chance. My parents always told me 'You will never become a mountain, and control the universe, your just a potato'. WELL LOOK AT ME NOW WORLD! I have the power to grow trees and rocks, and I finally feel like a true mountain. This game is revoulutionary, and will truley break the bounds of the video game world! I feel like a new person after playing this game. So will you join me in this journey to become a true mountain?  In all seriousness, all this game is, is you get an all around view of a mountain that is growing and changes during seasons, at least from what i've seen. Also, for some reason, the mountain grows pies and chairs and umbrellas. So thats cool I guess. This game looks like it might actually have a lot of content though. For just a game with a mountain, it looks like there are still a lot of things to see and discover. I don't know. I bought it because, why not I guess. It looks interesting, and random. Plus, i'm going to get a ton of hours because I have no life.  So if your a person who doesn't like looking at mountains, this game is not recommended. I think for a dollar, this game is worth it. But thats just my opinion. I recommend you look at some of the other reviews. Peace Out!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Peaceful game :D",
            "review_score": "1"
        },
        {
            "review_text": "Simply put - I love my mountain.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would be a mountain again!",
            "review_score": "1"
        },
        {
            "review_text": "11/10 It's not by EA. Would watc.... I mean play again &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "This 'game' is not a game its more of a 'interactive' screensaver, i wouldnt recommend this to my worst enemy 0/10 bad 'game'",
            "review_score": "-1"
        },
        {
            "review_text": "Mountain is not only a game , but a philosophy . Just one dollar , and you will get a lot .Nowadays , we live in a fast-paced world and we may forget the beauty in our daily life . Be a slow walker , and enjoy Mountain !",
            "review_score": "1"
        },
        {
            "review_text": "Truly an aesthetically pleasing, ground breaking, mind blowing masterpiece of a game, It's a game I'd see myself playing until I die, it's just that kind of a game, the gameplay is less than enjoyable, but that's not the selling point of the game, it's the truly mesmerising graphics and sound of the game, it makes you feel like you're THERE, you ARE the mountain. 10/10 MASTERPIECE",
            "review_score": "1"
        },
        {
            "review_text": "Mountain is not just a screen saver you have to play through the the game to figure it out the story on this game is beautiful it will send you on a roller coaster of emotions you will be happy, anrgy, mad, and by the end of the game you will be crying. This is definitely a next gen game I would give it a 10/10 and the story and gameplay is so much better than call of duty. So if you are thinking about buying acall of duty but buy this instead it will be worth your money/",
            "review_score": "1"
        },
        {
            "review_text": "Why is everyone complaining about this?. Yes I agree I wouldn't call it a game but more so a artistic phenom. You sit there watching your mountain float in space which sounds boring and quite frankly is but for 99 cents I can't complain, it looks great and has a majestic feel to it.....",
            "review_score": "1"
        },
        {
            "review_text": "I like it. so there!  my mountain has lil' mushrooms. :3",
            "review_score": "1"
        },
        {
            "review_text": "Isn't a game, just a 3d rendering of a floating mountain that rotates and changes slowly.",
            "review_score": "-1"
        },
        {
            "review_text": "Watch the trees grow, and the sun set. As the Mountain finds itself. You also find a sense of inner peace. 10/10 game of the year. ",
            "review_score": "1"
        },
        {
            "review_text": "This game saved my life. I was about to throw myself down a tall building but then when I played this game I realised I'd much rather throw myself down a mountain and roll all the way down. It was fun untill the mountain ended and I fell into the unknown depth of space never to come back. I can't say I did not enjoy my journey though it is yet not over...",
            "review_score": "1"
        },
        {
            "review_text": "So, I played it a little. Though it was OK.",
            "review_score": "1"
        },
        {
            "review_text": "do spinny spin say bye to clouds 10/10 sometimes rainbow",
            "review_score": "1"
        },
        {
            "review_text": "Imagine, if you will.    An Enigma wrapped in mystery sprinkled with oddity.  Now imagine that burrito stuffed into the microwave of your mind and turned to extra-high.  When it comes out, you get Mountain.  Mountain is odd. Like your sister gently massaging your teddy bear.  It's a combination of the shear immense abyss that is your boredom and the expectant anticipation of an eager fawn.  But, like that small brown 4-legged deer, you run the risk of being struck by something you hadn't seen coming. You haven't the time to piece out the details before it ultimately strikes you and you're a crumpled heep of delicious fawn meat and sadness.  Only the car is a giant golfball.  And the fawn is you.   Mountain.",
            "review_score": "1"
        },
        {
            "review_text": "this will fulfill your empty life",
            "review_score": "1"
        },
        {
            "review_text": "everyone that doesnt understand this game is just something to watch grow over time so if you are shallow its prob not the game for you if you can actully be greatful for the small things and like to see your own personal mountain change over time which is a different experience everytime you play then you should get it and for the people that are like 'this game aint worth the dollar is spent on it' they are too ♥♥♥♥♥♥ of a person to instead say something like hey this game isnt my cup of tea but atleast my money is being donated to help someone else out this game is awesome yes its mostly a screen saver but its a good one i normally just open this game up in the background of other games and its awsome to get to see my mountain grow and develop over time and change differently everytime i play ive never got two mountains that were the same some people just need to learn to be more greatful instead of being a idiot and complaining because you read the reviews and bought it because you thought it was going to be a interactive expereince how about you grow a brain cell just one please thats all you should need in order to realize hey if im going to ♥♥♥♥♥ about a game that was cheaper than anything off the dollar menu at the fast food places then maybe i should watch a review of it on the youtube and guess what using youtube and watching videos is 100% free and then you have those people that say whos going to pay for my electricity and internet and to that i say if you have the internet to download the game then you not only have the eletric but you have the internet that youd need for youtube also if you are really that shallow that you feel the need to complain about the graphics then i hope you are blind or are mentally disabled other wise tyou must be truly brain dead because theres frickin pictures of the 'graphics' of the game when you buy it like damn if youre looking for a game with good graphics go get it dont expect good graphics from a game thats under a dollar seriously are you that dumb that you cant look at the damn picture then you must be truly idiotic this game is about 95% experice and like 1% graphics this game is supossed to be relaxing and for people who like to see things change and develop over time not for people who want some crazy graphicly intence game",
            "review_score": "1"
        },
        {
            "review_text": "This is literally a rotating mountain. There are no controls. You can look at it from different angles using the mouse. If you press keyboard keys, it plays piano sounds.  This is not a game....I think it's a waste of money and hard drive space.",
            "review_score": "-1"
        },
        {
            "review_text": "The sound alone makes this game worth buying in my opinion. Also, it's fun to grab things off the mountain then throw them back into space. A queen sized bed flew into my mountain, so I proceeded to grab the bed and throw it back under the mountain. He is now in a new universe.",
            "review_score": "1"
        },
        {
            "review_text": "A mix of thriller and an mmorpg (potential wow-killer), Mountain covers the life of Mountain, from birth to ultimate annihilation. You take care of Mountain by cleaning it, taking out the trash, and help its singing career, which could save it from the apocolypse. In its lows, fish and fire will rain from the sky but if you are good enough, you can make it rain cold hard cash (coins). If you are the type of player who likes to see things burn, lead Mountain to its demise.   I would only recommend this game to those willing to put a lot of time and effort into grooming your Mountain into success. Those who only play this shortly without allowing this game's amazing depth and quality influence your life indeed are very poor souls. In my personal experience, it takes several hundred hours with this game to fully experience it.  I have only completed Mountain a couple of times in the time I've played, and I hope to get a lot more in the future. I can easily recommend this to anyone willing to sell their souls to the Mountain. 10/10 would sacrifice myself to the mountain again.",
            "review_score": "1"
        },
        {
            "review_text": "So far so good! this is a 'game' fundamentally about a spining mountain! the game will gradually put random stuff liek shoe, pistol, umbrella, etc onto the mountain the more you play the game.  69/69",
            "review_score": "1"
        },
        {
            "review_text": "'This game changed my life' -Morgan Freeman",
            "review_score": "1"
        },
        {
            "review_text": "Sold all my trading cards to get this game and now I'm hooked. This game is now my life. I have dropped out of high school and quit the swim team in order to invest all my time into this game.  '11/10 would buy again' - IGN",
            "review_score": "1"
        },
        {
            "review_text": "made me live for mountain",
            "review_score": "1"
        },
        {
            "review_text": "I like to watch the mountain.",
            "review_score": "1"
        },
        {
            "review_text": "Always wanted a game as a screensaver..",
            "review_score": "1"
        },
        {
            "review_text": "This is the greatest meditation video game ever made in the history of meditation video games! Seriously get this if you're a fan of the meditation video game genre.",
            "review_score": "1"
        },
        {
            "review_text": "Not a game",
            "review_score": "-1"
        },
        {
            "review_text": "It's a game you idle in the background and check in on to see what has happened recently. Fun little distraction.",
            "review_score": "1"
        },
        {
            "review_text": "It's ok",
            "review_score": "1"
        },
        {
            "review_text": "I got this game yesterday, I didn't really know what to expect. I launched Mountain. My Mountain came to be. I watched MY Mountain. I laughed, I cried, I loved...I hated. While talking to Mountain through musical notes I discovered annihilation. The first time I saved Mountain with not a moment of hesitation. But then I began to torment Mountain. Letting the object of destruction get closer and closer before saving Mountain. As my hatred grew deeper and deeper for Mountain I once again initiated the annihilation sequence a s , z b this time with the intent of ending Mountain once and for all. The object of destruction was beautiful, a massive pulsating eye, it hungered for Mountain. I watched eagerly as the Eye approached, closer and closer it came. Ohhhh how happy I was to finally see Mountain pay, but then something happened. As the Eye was mere seconds away from ending Mountain as I knew Mountain, a single rogue item drifted on to my screen. A heart. I was astounded. Even after all the terrible hatred I vented at Mountain, Mountain loved me. I quickly mashed my keys in an effort to save Mountain and the screen went blank. Through a miracle I had managed to save Mountain. I do not know what happens if you let the object of destruction hit Mountain and I do not plan to find out, nor do I plan to ever see that wretched Eye again. From this day forward I will never stop caring for Mountain, not for even a second. Many of you hate Mountain, but you have not seen the Mountain I know. Live Mountain, be Mountain, and you too shall know Mountain. All you need is patience.",
            "review_score": "1"
        },
        {
            "review_text": "'Its like skyrim with skyrim' - IGN",
            "review_score": "1"
        },
        {
            "review_text": "I am mountain, I am god. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is not a game. It is a waste of a dollar.",
            "review_score": "-1"
        },
        {
            "review_text": "This isn't a game.. this is a masterpiece! This is easily the game of the century a must buy title!! A fun experience for the whole family!!! 1337/69 ",
            "review_score": "1"
        },
        {
            "review_text": "Its not a game, its not a screensaver. Its a Mountain simulation. Its a World simulation. Its a meditation.  There are so many things about this Mountain. There are so many emotions in this Mountain.  This Mountain, is me. This Mountain, is you. This Mountain, is me and you. This Mountain, is us. This Mountain, is the world This Mountain, is our world. This Mountain, is our future. Without the Mountain, I feel pain. Without the Mountain, I feel war. Without the Mountain, I feel lonely. Without the Mountain, I don't love. Without the Mountain, I wanna die.  This Mountain helps me to live my life, like I couldn't do it. There are many things in my life. There are many sad things in my life. But I can't talk with someone about it. This Mountain helps everybody, who has sad, emotional and happy feelings at once, or as well. This Mountain was made, to let it be open in the rest of your and my life. Why nobody understands me, what is the meaning with this Mountain? Many people think this game is a bad joke. Friends are laughing about me...  But it isn't.. but I also won't talk with you about this. If you are the right person for this game, we'll see. If you are the right person for the Mountain, we'll see. If you are the right person for me,.. we'll see..  Thanks for reading. And thanks for Mountain. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "0,99!? This is much better than a Cheeseburger at McDonalds !",
            "review_score": "1"
        },
        {
            "review_text": "I feel at one with the universe inside this creamy morning.",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this! it's pretty much a scam and you won't ever use it after your first 15 minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "Do I recommend this game? That's a bad question, because it implies that this thing is a game. Hell, I'm not even sure what it qualifies as. The best description I can give for it is that it's a glorified screensaver. It does nothing except spin, and occasionally the Mountain gets existential. The player can do nothing except watch. I have no clue why critics are obsessing over it. It's a cute concept, but I have literally seen screensavers that do the same thing. The developer notes on the page are straight up lying when they say that it is a game, or that you can play it, or even that it plays itself.  0/10.",
            "review_score": "-1"
        },
        {
            "review_text": "You're looking at a mountain, watching it become something special. Add a few cheats, ruin your mountain, then get mad. It's just a fun little game that will cost you hardly anything. It's better than any new Call of Duty game. Anyway, I'd give this game a 12/10.",
            "review_score": "1"
        },
        {
            "review_text": "$0.74...  I like mountain, its a quick little escape and the A to . keys give you a great sounding piano to play on, making the mountain spin.  I dont think I'd pay more than 74 cents though",
            "review_score": "1"
        },
        {
            "review_text": "Literally best game I've ever played..... I've spent hours watching my mountain get more personality than me......",
            "review_score": "1"
        },
        {
            "review_text": "Mountain has become the essence of my universe, Never before have I felt so much alive  Thank you mountain for providing me this wisdom which keeps my heart in the right place  I love the music which you produce ",
            "review_score": "1"
        },
        {
            "review_text": "Stupidest ♥♥♥♥ ive Ever Played.  i actually want my dollar back. im serious   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game,  next-generation graphics, better than Call of Dooty.  Screensaver simulator 2014 where nothing interesting happens and eats up CPU usage like a ♥♥♥♥♥  gr8 g8me m8 8/8 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "It was love at first sight. When I saw the game, I just knew we were perfect for each other. 'Mountain is love,' I said. 'Mountain is life.'  ",
            "review_score": "1"
        },
        {
            "review_text": "Best game I have ever played. (type as,zb in game)",
            "review_score": "1"
        },
        {
            "review_text": "Its the best game I´ve ever played, better than dota or lol, better than real life, better than watching a mountain live.",
            "review_score": "1"
        },
        {
            "review_text": "Next level game! I expected nothing and got everything! 10/10 !",
            "review_score": "1"
        },
        {
            "review_text": "Right so this is going to sound as hippie-dippie as possible, but just recently, I was getting ready to do my first live spoken word performance in nearly twenty years. My stomach was in knots, and I thought I was going to vomit. I sat down with this game for five minutes, and you could have tapped me and sold the juices from my brain there was so much dopamine flowing through my system.  This isn't so much of a game as it is a snow globe that comes alive and hugs you.",
            "review_score": "1"
        },
        {
            "review_text": "literally the best game ever - I feel that I can just sit down, load up the game, and then play for hours with no breaks. Thrilling story, amazing gameplay, and great graphics. 10/10 would buy 15 copies again",
            "review_score": "1"
        },
        {
            "review_text": "autism simulator 10/10 would cry staring at my mountain again",
            "review_score": "1"
        },
        {
            "review_text": "I want this as my screen saver.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly relaxing.",
            "review_score": "1"
        },
        {
            "review_text": "You are Mountain. Mountain is you. Mountain is life. Mountain. ~Tacosaurus Approves",
            "review_score": "1"
        },
        {
            "review_text": "Don't expect the Hound if you buy the Mountain.",
            "review_score": "1"
        },
        {
            "review_text": "By far my favourite mountain simulator.",
            "review_score": "1"
        },
        {
            "review_text": "I cried.",
            "review_score": "1"
        },
        {
            "review_text": "致虚极，　 　Attain the utmost in Passivity, 守静笃。　 　Hold firm to the basis of Quietude.  万物并作，　 The myriad things take shape and rise to activity, 吾以观复。 　But I watch them fall back to their repose. 夫物芸芸，　 Like vegetation that luxuriantly grows 各复归其根。 But returns to the root (soil) from which it springs.  归根曰静，　To return to the root is Repose; 静曰复命。　It is called going back to one's Destiny. 复命曰常，　Going back to one's Destiny is to find the Eternal Law. 知常曰明。　To know the Eternal Law is Enlightenment. 不知常， 　 　And not to know the Eternal Law 妄作，凶。　Is to court disaster.  知常容， 　　He who knows the Eternal Law is tolerant; 容乃公， 　　Being tolerant, he is impartial; 公乃王， 　　Being impartial, he is kingly; 王乃天， 　　Being kingly, he is in accord with Nature; 天乃道， 　　Being in accord with Nature, he is in accord with Tao; 道乃久， 　　Being in accord with Tao, he is eternal, 殁身不殆。　And his whole life is preserved from harm.   吾道当兴!",
            "review_score": "1"
        },
        {
            "review_text": "They see me mountain' They hatin'",
            "review_score": "1"
        },
        {
            "review_text": "if your looking for a game that will give you acheavements and rewards for unlocking doors, killing dragons, building empires, and other small world things, go back to COD. if you want to be god to an object coming to grips with its reality, pay a dollar.",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST INDIE HORROR MOUNTAIN EXPERIENCE YOU WILL EVER NOT PLAY 10/10 WOULD &lt;3 AGAIN ",
            "review_score": "1"
        },
        {
            "review_text": "I am Mountain. I am God.  I have been sitting here watching it rain fish while playing hot-cross buns for 20 minutes. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Sold my wife and children into slavery to buy a better monitor for my mountain.",
            "review_score": "1"
        },
        {
            "review_text": "It is exactly as it describes in the title, with a little added bonus. Don't expect a huge fun game when buying this. It is a screensaver. A lot of people complain that you aren't actually 'God'. But you are. 'God' gets to sit and watch us mess up the world, without being able to do anything about it. And that is exactly what happens in this game. You watch the mountain grow/be destroyed, and you cannot do a damn thing. I love it. I run it in the background while I work because the nature sounds are nice and enjoyable, and I like to tab to it to check on my mountain. I also keep it on while I sleep, so that I can look at it if I wake up, and it will slowly relax me and I can fall asleep. I love this screensaver 'game' and I feel like people like me will enjoy it too. It's cute and calming. It's also good for panic attacks. Nice job, Devs. :)",
            "review_score": "1"
        },
        {
            "review_text": "I got this game free, and was decently surprised at how special watching a Mountain could be.  10/10 Will fall asleep to again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very nice. Very very atmospheric and ambient.  Keyboard is a piano. The mountain talks to you. It's pretty damn nice. Best 99 cents i've ever spent to be honest.  In terms of gameplay... there is none. Sometimes random things will pop up on your mountain and the weather and seasons change. New trees grow. Night time is extremely gorgeous, with a full view of different galaxies and lightning bugs come out of the trees.  What i'd really like to see in this game are animals like deer or wolves that multiply and have their own offspring.  ",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty cheap game, can work as your desktop screen saver to fool your friends. It's more on the visual art and no controls. Well besides mouse and just pushing random buttons to make music. If It was any sort of price higher I would say no to it but it's pretty neat of how it goes through the seasons and such and the more you play it you'll find out about it and what goes on. Even when you zoom out it seems a little bit odd of how the universe can seem to just a mountain lonely in its own space but is it's own god to itself. Good mountain god is best mountain.",
            "review_score": "1"
        },
        {
            "review_text": "it is a great screen saver. i quiet enjoy staring at the moutain for hours but that is all you do. but if you want a game IT IS NOT A GAME!!!!! i quiet enjoy this defentily worth the .66 cents. i recomend you get it if you want a good screen saver.   subscribe to beastbugs youtube",
            "review_score": "1"
        },
        {
            "review_text": "I was a mountain. I was God.",
            "review_score": "1"
        },
        {
            "review_text": "Go to work. turn on this on your offscreen. no more work stress. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I feel like i completed my objective in life...  10/10",
            "review_score": "1"
        },
        {
            "review_text": "In the five mintes I played this I instantly knew this game was better than COD and I have figured out life and death means nothing at the end of the day.",
            "review_score": "1"
        },
        {
            "review_text": "It's kind of like a bonsai for your computer that sometimes makes you hella sad",
            "review_score": "1"
        },
        {
            "review_text": "At first I was bored with it, then I realized I was checking on my mountain every half hour or so. Worth a buy.",
            "review_score": "1"
        },
        {
            "review_text": "my mountain has grown an earth. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "sim of a mountain it spins with clouds and has trees mash that keyboard yo",
            "review_score": "1"
        },
        {
            "review_text": "Funny, but weird, should've more purpose! Not sure what is this 'exactly'. But well, worth 1€! :)  ?/10",
            "review_score": "1"
        },
        {
            "review_text": "The future of mountain simulation and, quite frankly, the best Mountain Simulator I've ever played. The sound is the standout feature, but everything else is great, too.  A true revolution in the genre with that rare universal appeal nearly gone from modern life and rarely even seen in video games - a kind of appeal that only Tetris, the Beatles, or Jesus Christ could even hope to rival.   There are only two groups of people who won't like this game - terrorists and pedophiles.  Ratings cannot describe how amazing this is. I am literally a superior human being for having played this. Not just culturally, but morally and physically.  11/10. ",
            "review_score": "1"
        },
        {
            "review_text": "ok lets start off buy (get it? (it's a pun)) saying buy the Mountain, for Mountain is love, Mountain is life. the joy one gets out of this game it just too good to put into words but i will try. it's good and not just oh you wake up and someone made you breakfast good, it's you wake up and someone gave you pizza and said have a day off work and we'll still pay you good. if it's not clear by now i am a mountain enthusiast, and honestly i would recomend this game to anyone.  Overall: 10/10 would Mountain again.",
            "review_score": "1"
        },
        {
            "review_text": "BEST ♥♥♥♥ING GAME YOU'LL EVER PLAY IM NOT EVEN JOKING ♥♥♥♥ EVERYGAME EVER NOTHING COMPARES TO THIS BEAUTY HOLY ♥♥♥♥ING ♥♥♥♥ I CAN'T BELIEVE IT DID YOU THINK SEX WAS GOOD WELL ♥♥♥♥ THAT BECAUSE THIS IS BETTER IM NEVER GOING TO STOP PLAYING THIS GAME IM QUITTING ♥♥♥♥ING SCHOOL TO BECOME A PRO MOUNTAIN PLAYER IN ALL IT MOUNTAIN WATCHING GLORY MY PARENTS ARE TELLING ME TO GET A LIFE BUT THEY DONT KNOW WHAT A REAL LIFE IS BECAUSE MOUNTAIN IS LIFE IT HAS CONUMED ME AND ALL THAT I AM I WAS GOING TO GO TO HARVARD AND BECOME A DOCTOR BUT THEN I REALIZED WHO NEEDS A ♥♥♥♥ING JOB WHEN YOU HAVE MOUNTAIN........MOUNTAIN PEOPLE I DONT UNDERSTAND WHY THIS GAME IS 2.00$ WHEN I WOULD SPEND OVER 100OOO$ ON IT.....MY BROTHER COULDNT HANDLE HOW ADDICTED I WAS TO THIS GAME SO HE KILLED HIMSELF BUT DO YOU KNOW WHAT I DID AFTER THAT I PLAYED ♥♥♥♥ING MOUNTAIN BECAUSE MOUNTAIN ISTHE ONLY REASON TO EVEN LIFE AND HE WASNT PLAYING MOUNTAIN WHICH IS WHY HE KILLED HIMSELF.....I HAVENT MOVED FOR THREE DAYS MY PANTS ARE FILLED WITH ♥♥♥♥ AND ♥♥♥♥.....BUT I FEEL LIKE THERE IS SOMETHING MISSING AND THEN IT HIT ME I REALIZED THAT MY MOUNTAIN ISNT REALLY A MOUNTAIN IT WAS A SYMBOL...A SYMBOL FOR LIFE BECAUSE YOU'RE NOT REALLY LIVING IF YOU'RE NOT PLAYING MOUNTAIN....AND THEN AFTER FIVE YEARS OF PLAYING STRAIGHT THE GAME CRASHED AND WHEN NOT KNOWING WHAT TO DO I GRABBED A GUN AND SHOT MYSELF TOO BUT I ENDED UP SURVIVING TO WRITE THIS REVIEW AND SAY ITS A TERRIBLE GAME DONT BUY IT 0/10",
            "review_score": "1"
        },
        {
            "review_text": "Thought i was on earth found out i was in space, i found myslef inside this game i saw the real me not what america told me to be. 10/10 ign recomend!",
            "review_score": "1"
        },
        {
            "review_text": "+Good storyline +plenty of characters +Nice selection of weapons to choose from +Long story  -Too many intense gamers online -Shotgun glitch",
            "review_score": "1"
        },
        {
            "review_text": "Nice   Game   Screensaver 10/10",
            "review_score": "1"
        },
        {
            "review_text": "You are Mountain ! You are god ! Best game ever ! Best spent 0,99 euro in my life ! I want GOTY edition ! Mountain speaks to you ! Piano unlockable events ! Play your favorite songs ! Buy it now !",
            "review_score": "1"
        },
        {
            "review_text": "YOU are mountain. You.",
            "review_score": "1"
        },
        {
            "review_text": "my mountain is the worst",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't played the Mountain.... you haven't lived....",
            "review_score": "1"
        },
        {
            "review_text": "I bought my own mountain for less than a dollar. Here's what I got out of it: I apparently drew myself as a ♥♥♥♥♥, my mom as a ♥♥♥♥♥♥, and beauty as breasts I became a mountain I got to play the keyboard I learned that pressing period on my keyboard gave out psychopathic thoughts I earned myself a screensaver -1/10 at least it was 66 cents for me ...",
            "review_score": "1"
        },
        {
            "review_text": "Is it too early for GOTY?",
            "review_score": "1"
        },
        {
            "review_text": "This game saved me. like really saved me. Before i had this game I was a lonely average teenage boy, but this game made me a man. After spending 20+ hours on this game i had gained all the things a man could want, a sword, a gun even a BIG ♥♥♥ SHIPPING CONTAINER. With my new found manhood i decided it was time for a girlfriend so i went out found a suitable mate (current girlfriend ;) ) told her about my huge sword. she came back to my place to see the sword. i turned on my pc booted up mountain to show her. i dont think its wat she expected, but it we started talking after a few weeks we ending up going out.   moral of the story, GET THIS GAME, GET A GIRLFRIEND!!",
            "review_score": "1"
        },
        {
            "review_text": "VERY GOOD  Sat for 3 hours waitng to do something secretly a hill 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game is a waste of time, but it feels so right.",
            "review_score": "1"
        },
        {
            "review_text": "insane game  it's like being a mountain in the middle of nowhere  10/10 would spin my mountain forever",
            "review_score": "1"
        },
        {
            "review_text": "lololololol xd this is lake so amazin worth more than it acchully is",
            "review_score": "1"
        },
        {
            "review_text": "Its a game where you watch a Mountain getting speared by different objects ! WARNING THIS IS NOT FOR KIDS !!!! YOU HAVE BEEN WARNED!  9.9991/8.76",
            "review_score": "1"
        },
        {
            "review_text": "This is not a game, this is life",
            "review_score": "1"
        },
        {
            "review_text": "I had so much fun with my mountain today. We went for a spin in a circle and stuff fell into its lap. Incredible game. Only lacking multiplayer. Would love to spin with friends. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I am mountain. My mountain is my mountain and we are one.  He has his little quirks - I do too. But at the end of the day, we embrace and accept one another's oddities  I know that we can both get sad sometimes. Hurtling through space, alone, that's normal. The little memories we pick up along the way help remind us, that there is hope in finding meaning in the ether. ",
            "review_score": "1"
        },
        {
            "review_text": "BEST. GAME. EVER. add me, my name is SniperKillerDeathBringer69GetRekt420 you can join my sniper clan if you have good aim and good gear",
            "review_score": "1"
        },
        {
            "review_text": "I think my life is now complete.",
            "review_score": "1"
        },
        {
            "review_text": "Captain Kirk is climbing the mountain, to hug it, to envelop it, to make love to it. He knows.   Finaly this   song   makes sense!",
            "review_score": "1"
        },
        {
            "review_text": "Literally not even worth One ♥♥♥♥ing Dollar. As a start, insulting me at the start by telling me that my soul was an empty white space with nothing on it, and then saying that this is a game at all.   Yeah. It's a game. If you are a hipster that thinks a black line on a white canvas is art.   1/10 Would not bother playing this even if it were free.  If you want to create an atmospheric mountain, at least pull people in with something interesting. Some manner of control, some manner of Zaz that will make it fun.  Vote for Worst Game (if it can even be called that) 2014. ",
            "review_score": "-1"
        },
        {
            "review_text": "More fun can be achieved from masturbating over a ham sandwich.",
            "review_score": "-1"
        },
        {
            "review_text": "It's relaxing. Not really a game, more like a more interactive snowglobe to keep at your side.",
            "review_score": "1"
        },
        {
            "review_text": "It said I could be a mountain so I became a mountain 11/10",
            "review_score": "1"
        },
        {
            "review_text": "An amazing philosophical game, the soundtrack is great, it has a huge friendly community and while playing the feeling that you can do anything is like beyond any of your dreams !  The gameplay is thrilling like hell, soon you will forget about anything in life, anything but mountains !  And lastly, this game can make you understand the mountain by being the ♥♥♥♥♥♥♥♥♥♥̶i̶n̶g̶ mountain, feel the mountain, embody the mountain   BE MOUNTAIN BE GOD RULE THE UNIVERSEEEEEEEEE !!!!!!!!!!!!! Mountain/5 -IGN   And lastly(bis), here is a little poem wrote with all my m̶o̶u̶n̶t̶a̶i̶n̶ heart  As the proud mountain rise to reach the sky Bound to the ground for an eternity You, as the feeble human shall rise As the mountain face the down       Mountain is illuminaty, take care !",
            "review_score": "1"
        },
        {
            "review_text": "Easy to pick up, hard to master.",
            "review_score": "1"
        },
        {
            "review_text": "Can destroy my mointain, make it rain frogs, make it snow, make it bleed, and make it look good. 10/10 Still better than DayZ Standalone",
            "review_score": "1"
        },
        {
            "review_text": "I always dreamed of being a mountain.Sometimes I just stood there doing an imitation mountain in my room. 10/10 screensaver simulator 2014. ( Yeah My fetish come true.) Just buy it.Best app in the Steam the ''Money Taker Simulator.''",
            "review_score": "1"
        },
        {
            "review_text": "I actually liked this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game changed my life. After playing 5 minutes I now have a new house, a triple digit job, and a smoking hot wife. Not only that but I was cured of Ebola and learned how to fly! Simply amazing. A must have",
            "review_score": "1"
        },
        {
            "review_text": "Well, theres some content to it and it's definitly a different type of game! If the developers added stuff like life and villages/cities I'd recomend it! But whatever, it's like 1€....",
            "review_score": "-1"
        },
        {
            "review_text": "This is not a game, but it's the perfect screensaver. It's missing two things in my opinion:  The fact that it can't be made into an actual screensaver.  And the fact that I can't set it to fullscreen on my second monitor, let it run, and do stuff on my main monitor.  If either of those were to be added, I'd recommend the 'game.'  EDIT: I feel that I should point out that it is cpu intensive and that there's really no reason to buy it unless you're alright just letting it run in the background or off to the side.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a game you play in words, it's a relaxer simulater about a mountain. I wonder who tagged RPG when you don't play anything. It's a bit pricey for what it is. But i like it, nice calm relaxing but nothing you should pay for.",
            "review_score": "1"
        },
        {
            "review_text": "I sold all my steam cards to spin around a floating space mountain and learn the piano. That lasted for a minute then i watched an office marathon and forgot to close the game. 11/10 would watch office again",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome but you have to have patience to play and must be smart or extremely stupid and random.",
            "review_score": "1"
        },
        {
            "review_text": "It's a Screen Saver, For £1 it's a nice one. I'd recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "this game is basically a piano but with a 3d cgi mountain      guess what it ♥♥♥♥ing sucks  buy it for your friends and family as a birthday gift!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's great to run in the background, especially if you can stream it to a TV in your loungeroom or some other central place. I found it relaxing, interesting and well worth 99c. It's visually quite beautiful as well. Granted, there isn't a great deal you can do beyond play some music, rotate your mountain, zoom out to space &amp; back again, read the random thoughts your mountain has, and watch objects land in it, but I still enjoyed it. Hell, this game would have absolutely amazed me as a kid growing up in the 80s. I certainly had less interactive games back then and never thought less of them.",
            "review_score": "1"
        },
        {
            "review_text": "I see this game get a lot of hate sometimes, but when you get down at the bottom of it, it does everything it promises: it's an ambient procedural mountain. It's a game that plays itself.  Draw some doodles. Watch the mountain get generated. Watch it get rained on. Watch it get snowed on. Watch it get annihilated by random cosmic activity. Play notes with your keyboard. Sit back and get hypnotized by it for a good 45 minutes. Simple as that.  You buy coffee on your way to class every morning? Skip it for just one day, save the ninety nine cents and try this one out. You'll enjoy it for far longer than an eigh-ounce coffee.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game to leave open at the edge of the screen while you work. every 10 minutes or so a strange object crashes down and makes you laugh. e.g. a giant toy horse to distract me from partnership accounts for 10 seconds",
            "review_score": "1"
        },
        {
            "review_text": "'But ♥♥♥♥, it was 99 cents' - Macklemore",
            "review_score": "1"
        },
        {
            "review_text": "The most realistic Mountain simulation I've ever seen. My dreams have been fufilled. That, and it's a dollar.",
            "review_score": "1"
        },
        {
            "review_text": "There is absolutely nothing you can do in this games, excluding zooming and playing piano. It's like a screensaver.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is revolutionary. Search as you might, you will never find a game quite like it, AND it's only a dollar! I would recommend it to anyone who has that extra dollar in their Steam wallet.",
            "review_score": "1"
        },
        {
            "review_text": "Mountain is what seperates you from reality and virtual reality. Mountain is a way of life. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I mean,mountain.",
            "review_score": "1"
        },
        {
            "review_text": "It will tinkle your mothers clitorous every time it ring that bell ;) If you want a heavy breathing hardcore 3rd person ringadingdingbingbong experience, This is the game for you 21/10 SAMWELL'S MOTHER RECOMMENDS THIS (HIGHLY)",
            "review_score": "1"
        },
        {
            "review_text": "More intense than COD: Advanced Warfare.",
            "review_score": "1"
        },
        {
            "review_text": "I have a 15TB hard drive of porn and this still gets me harder.",
            "review_score": "1"
        },
        {
            "review_text": "Ya like Mountains?  ya like staring at things cool be A Mountain now for a limited time!!!!! call 1 800 mountain!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "We used to annoy our friends by gifting them with Bad Rats. Now, we just use Mountain.",
            "review_score": "-1"
        },
        {
            "review_text": "i will eventually hang myself from this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is phenomenal it has anything you could ask for in a game like this. Drawing, Aliens, Beds, Snow, and excting PVP and PVE. I would personaly recomend all my friends and everyone reading this to purchase this game and buy it for their friends so they can have a fun time.",
            "review_score": "1"
        },
        {
            "review_text": "Screensaver: The Game",
            "review_score": "-1"
        },
        {
            "review_text": "I just got Hampus to buy this game. 10/10 would make Hampus buy again.",
            "review_score": "1"
        },
        {
            "review_text": "Best game I've ever played.  10 red containers/10",
            "review_score": "1"
        },
        {
            "review_text": "literally can't believe they put this on steam",
            "review_score": "-1"
        },
        {
            "review_text": "The game is not worthing picking up for those reasons: 1.You do nothing but you look a mountain. 2.Nothing from the pictures is actually in the game. 3.It doesn't worth 0,99 euros.You can spend them better. As you can see i don't have much time on that game because i just got bored.I don't recommend this game for the reason it has no mods or something to keep you interesting.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a bad game in the slightest. Not even satisfactory. I realize how great it, more of an experience really. However, it is just not my cup of tea.",
            "review_score": "-1"
        },
        {
            "review_text": "This game would be good if you had nothing to do or just needed something to help calm you down - but i would not recommend it, as it can get quite boring after half a hour of waiting and nothing happening.",
            "review_score": "-1"
        },
        {
            "review_text": "This game brought me out of a dark time in my life. Early on as a child I had a bad experience with a mountain. One time I was hiking and then the mountain took everything I love, my life was gone in an instant. I had been traumatized ever since. For years, my friends, family, even teachers mocked me. I was ashamed to be who I was, to express my feelings. I hid under a cover of darkness. Everyday I'd try not to be seen, but my actions only ended in more despair. I wished for someone, something to help me. Then I found this game. My life turned around. I overcame my fear and took life into my own hands. I had come out triumphant, victorious in a way of life. I was the mountain. The mountain was me. And I was happy.",
            "review_score": "1"
        },
        {
            "review_text": "Left it running for 10 hours and was killed by something. 10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "'Sit for hours and observe the rare but beautiful creature in it's natural habitat called 'Mountain'. Watch Mountain grow, experince feelings, or change according to your music. Mountain is truly one of the most brilliant pieces of art ever created and will be looked back on in the future.' -LordLiquidBacon II  ",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic, excellent addition to anyone's game library.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would buy and play again.",
            "review_score": "1"
        },
        {
            "review_text": "My mountain that full of mountain dew and more get hit by iluminati then didnt get destroy 0\\10 Iluminati Not Confirm",
            "review_score": "-1"
        },
        {
            "review_text": "You fly around in space and play piano as you observe a floating mountain pass through an endless cycle of weather, days and seasons.  Cheap alternative to drugs. ",
            "review_score": "1"
        },
        {
            "review_text": "This game was life changing. At first it started off with me being a mountain, but slowly it progressed into me being a mountain. I just watched, endlessly for a few minutes... watching my mountain progress. As my mountain progressed, my own self being progressed. I rapidly began to transform into something which was unbelievable. Without this game I would of still been nothing, but now... I am a mountain.  10/10.",
            "review_score": "1"
        },
        {
            "review_text": "A video of a mountain rotating in space.  Good if you have literally nothing else to do in your life.",
            "review_score": "-1"
        },
        {
            "review_text": "You have a mountain. You can rotate it. You can play sounds.  So much fun.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is almost too action packed for me; Almost;",
            "review_score": "1"
        },
        {
            "review_text": "what?",
            "review_score": "1"
        },
        {
            "review_text": "To point out. In the Preview you will hear a real piano playing. Dont get fooled by this. There is ANY real piano. to be played. only the keyboard letters which will give you the xylophone sound (you cannot compose).   If you like to throw money for fun or you were looking for a useless game where you just do nothing except randomly pushing buttons this game is for you, otherwise avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "I am the mountain. The mountain is me. I understand now. My place in the universe. My mountains place in the universe.  Here I am waiting for an asteroid to hit... my fate.",
            "review_score": "1"
        },
        {
            "review_text": "Nice , the BGM i rly luv it. Recommend players while plying this game use headset , listen to the sound of the rain , wind more clearly. This game aso can ply like a piano games , when i feels tired i like to ply this game cause can make me feel relax. If the highest mark is 10 i will giv 9.99 :)",
            "review_score": "1"
        },
        {
            "review_text": "Greatest screen saver of all time. I'm going to do as suggested and just leave it on in the background to suck up my CPU and memory so I can't play real games. I'm just kidding. You should totally get this. You see, it's this thing...and you draw some things, then there's a mountain..and you just leave it there. That's how mountain works.   Remember screen savers? In the days when those old CRT monitors with Windows 3.11 would get super bad screen burn that would never go away? That's what this does, only with a quad core CPU and memory. And you draw pictures to tell it how to procedurally generate. I guess. Yeah.   10/10 best screen saver simulator EVER.",
            "review_score": "1"
        },
        {
            "review_text": "Pro-tip: typing 'as,zb' (minus the quotes) makes it more interesting.    The game is essentially a simulator of life in a sense. It is about a mountain that is floating in space- yeah, you heard me, SPACE!- and has random things happen to it. It conveys its feelings sometimes and can be mildly interacted with by the player.  It is basically a game that, as said on the store page, should be run in the background. It isn't something you're supposed to sit and stare at and wait for something to happen (I mean, you can if you want, I wouldn't recommend it).  You can play piano notes on your keyboard by hitting the A-K and Z-,(comma) keys, supposing you use a QWERTY style keyboard. Hitting some combinations will unlock different modes such as blood rain, fish rain and constant snow (those are the three they give you on the store page). There might be more, I have no idea really. Hitting these keys can also change the speed of rotation of the mountain.  Randomly, objects such as bowling pins, crates, hearts, steel girders, etc. will fly from space into the mountain. You can click and hold on these items to drag them around the mountain and move their placement. As stated above, your mountain apparently can die. It is dramatic and depressing, because mountain is love, mountain is life.  Lastly, if you hit .(period), the mountain will say random things to you as if it is expressing its feelings. Along with this, it will randomly say things if just left alone for periods of time as well.  Over all, if you're expecting a very interactive, hands-on game, then this  isn't  the game for you. This game is meant to sit there and essentially just be for random events / fun, as if it were a screensaver. I believe it was made for the user to ponder life and their own existence based on the feelings and events that occur to / with the mountain.",
            "review_score": "1"
        },
        {
            "review_text": "My mountain sings songs to me on a gramophone.",
            "review_score": "1"
        },
        {
            "review_text": "My little Mountain-kun can't be this cute  Or can it?  Mountain has shown me the way. From the darkest depths it pulled me up. It has shown me beauty, wonder and grace.  Praise be to Mounatin   Mountain is life Mountain is love ",
            "review_score": "1"
        },
        {
            "review_text": "I would like DLC for this game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "After working hard on 3 perfect hentai scenes, I got a mountain -_-  I regret purchasing this game, Burning the money would make me more satisfied.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is so awesome, it just sits on my second screen while im being bored on facebook/tumblr and tells me its thoughts, wich is more than the people who dare enter my room do :D",
            "review_score": "1"
        },
        {
            "review_text": "The peak of the mountain is the only part of this game that has a point.",
            "review_score": "-1"
        },
        {
            "review_text": "Still looking for a deeper meaning.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "  A vicious vape filled, ear hole induced, vegan pizza abundent trip to San Fransisco. ",
            "review_score": "1"
        },
        {
            "review_text": "Very good relaxing mountain viewing game, best of its genre 7/10",
            "review_score": "1"
        },
        {
            "review_text": "I have achieved sentiance as a mountian and collected a lime and cinder block.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would Mountain Again",
            "review_score": "1"
        },
        {
            "review_text": "One of the best game I have ever gotten on Steam. Will play for rest of life. 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Mountain, how do I begin to explain the complex, tranquillity of which is mountain.  You are a mountain, alone in a world with no one to touch, talk to or love, you are world you are mountain. Alone in space, with random giant objects hitting you constantly, to later be destroyed by a giant ice cream cone.   11/10 ~ Mountain is love, Mountain is life  (sry for shrek is love, shrek is life reference, I feel it was needed)",
            "review_score": "1"
        },
        {
            "review_text": "If someone gives you this game, immediately unfriend them. They clearly do not have your best interest in mind. This thing, like Adventure Capitalist and a few others here on steam, claims to be a 'background game' - one you can leave running while playing other games and come back to every once in a while, to see what has changed.   However, there are plenty of much better 'games' out there that will not prove to be the biggest waste of CPU that you will ever see. This is not a game. This is an interactive simulation that has this mountain spinning in space. There are asteroids in space, a great nebulous vista, and occasionally junk will accumulate on your mountain. You can make it spin, and if you have an X-Box controller, you can use the A B Y X buttons to produce tones. That is literally all there is to this horrible thing that I cannot at any length call a game.  There is no defending this. Something is not a game simply because of some interactive features. A simulation differs from a game because rather than usually offering the player a challenge or objective, the purpose of a simulation is to simulate and that is all.  If for some reason you still want to interact with this mountain, have at it.",
            "review_score": "-1"
        },
        {
            "review_text": "I just love this game just staring at it listening to the music is very relaxing.",
            "review_score": "1"
        },
        {
            "review_text": "IGN 10/10 would Climb again!",
            "review_score": "1"
        },
        {
            "review_text": "Girls kik me at @approvethemap2 if you wanna see my giant m0untain ;)",
            "review_score": "1"
        },
        {
            "review_text": "This game has changed my life. For the better or for the worse? No one but the Mountain knows... I pray everyday to the Mountain, seeking its absolute wisdom. When I was on the verge of death, it was the Mountain that granted me another opportunity to live. It is an infinite cycle of life, but what really is life? Life is when I hear the holy music of the Mountain, cleansing my body and soul. It gives me power. It gives me freedom. The Mountain is my religion. When it rains- I cry, when it shines, I smile. Without the Mountain, I am nothing. Before the Mountain, I burned babies and ♥♥♥♥ed nuns. Now, I teach German at an orphanage. Everything made sense when I touched the Mountain. The moment I breathed in its sulphuric aroma, I knew it was the one. Mountain is love, Mountain is life.  ",
            "review_score": "1"
        },
        {
            "review_text": "Had fun playing this game Kappa",
            "review_score": "1"
        },
        {
            "review_text": "What did I just play",
            "review_score": "-1"
        },
        {
            "review_text": "Is fun but if left running too long it will do as most shemeji's do and drain all your CPU. Seems to be no patch for this yet.",
            "review_score": "-1"
        },
        {
            "review_text": "i had a 0.99 cents until i spent it on this game its boring and just not worth it. but it looked nice",
            "review_score": "-1"
        },
        {
            "review_text": "this game is great its a little too much but its got huge potential but the creators of the game can easily ♥♥♥♥ it up so i leave u with this note its a good game too play as a stress reliever but if u play it too much it will get boring ans just plain stupid",
            "review_score": "1"
        },
        {
            "review_text": "Thought it was cute for a day or so, then uninstalled.",
            "review_score": "-1"
        },
        {
            "review_text": "well hello everyone let me start by asking you a few questions and answers of course first one is what is this game and who would buy it? this game is a mountain simulator now you dont do anything but you can press keys like a piano keyboard now only buy this if you would like looking at a screen as mother nature does its job and watch the circle of mountain life and the graphics are fantastic on high on this game.Next question how does the game look? The game looks great graphics card is kind of demanding for what it is but if the graphics card is a realy good one then your all good for some sweet graphics. Next question and the last,What are the flaws of the game mountain? Ok so i have some flaw dissapointments i would love to see in this game like wildlife and harvesting for mother nature but the flaw of this is the seasons they move to fast but the game does not end so good but it just moves so fast like its summer then beofre you know it its winter and well thats it so over all i give this game a thumbs up a 9/10 so buy now and enjoy the peaceful cycle of a mountain everybody have fun!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Join my mountain server  eu.mountain.com:25444 .",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Am Mountain &gt;Press Buttons &gt;Raining Blood &gt;11/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "Just like Call of Duty, only with guns 4/20",
            "review_score": "1"
        },
        {
            "review_text": "Im going to say this right now, I like this... creation. While many say its not a game it sure is something.  I just got back from a game of dota 2 that went south and needed to relax, saw this little curio and tohugh for 99p '♥♥♥♥ it' and bought it and so far, I really like it. There is something mesmerising and thought provoking about staring at the lkone mountian (you) adrift in an empty universe, watching time go by, seasons change and the plants wither and come back to life. Really makes ya think...  Anyway, did it help me relax? Hell yeah, I feel very calm and stil lwant to keep 'playing' just because... well I don't actually know XD Like I said its kind of mesmerising. I don't do drugs personally but I can imagine they would also make the experience even better.  And I really don't get the dislike surrounding this game, the trailer shows what its about, and for 99p you basiclly traded a paper, bar of chocolate etc. for this... thing :)  I reccomend buying it just because of its charm and uniqueness.",
            "review_score": "1"
        },
        {
            "review_text": "Mountain stop being sad... I feel like I'm doing something wrong but I can't do anything so clearly it's not my fault but there's a gun sticking out of your metaphorical forehead and its always raining and cloudy and just miserable... Mountain no... Please... Stop... MOUNTAIN I LOVED YOOOOOOOOOOOOOOOOOOOOOOOOOU",
            "review_score": "1"
        },
        {
            "review_text": "The story in this game is amazing, it's almost as good as the gameplay! 80 Billion/10",
            "review_score": "1"
        },
        {
            "review_text": "The most intense game ever 10/10 would pay 60 bucks for this",
            "review_score": "1"
        },
        {
            "review_text": "The Mountain is better than anything EA has touched in the last 5 years. It's still not worth a dollar tho.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ING BEST GAME I EVER PLAYED!!! IGN 11/10 !! No really its ♥♥♥♥ing relaxed to just sit there when its winter and watch this ♥♥♥♥ no idea why.",
            "review_score": "1"
        },
        {
            "review_text": "If you have some trouble in life, buy this. You can calm down watching the Mountain. It's better with listening buddhist chant.  Peace will be with you.",
            "review_score": "1"
        },
        {
            "review_text": "Game of the Year",
            "review_score": "1"
        },
        {
            "review_text": "This isn't a game or much of anything at all. I'm going to go back and stare at it some more and hope the secrets of the universe are revealed to me.",
            "review_score": "1"
        },
        {
            "review_text": "i found a new mod coin mod ccc ccc cbzxc",
            "review_score": "1"
        },
        {
            "review_text": "i found a new mod coin mod ccc ccc cbzxc",
            "review_score": "1"
        },
        {
            "review_text": "it goes to show something so small and cheep can sell well and look good 10/10",
            "review_score": "1"
        },
        {
            "review_text": "First off, its important to not that this is not a game by any stretch of the imagination. It is nonetheless the best dollar I have ever spent.    Mountain is more like a procedurally generated, slightly interactive screen saver.   It is beautiful and it has a peaceful charm that nothing else could ever offer.   I love. this game and would highly recommend that everyone spend an hour a day with nothing to worry about but what isnt (or maybe is!?) happening on your mountain.  Buy it. It'll be worth it.",
            "review_score": "1"
        },
        {
            "review_text": "First off, its important to not that this is not a game by any stretch of the imagination. It is nonetheless the best dollar I have ever spent.    Mountain is more like a procedurally generated, slightly interactive screen saver.   It is beautiful and it has a peaceful charm that nothing else could ever offer.   I love. this game and would highly recommend that everyone spend an hour a day with nothing to worry about but what isnt (or maybe is!?) happening on your mountain.  Buy it. It'll be worth it.",
            "review_score": "1"
        },
        {
            "review_text": "If your one of thoes people who put ambient music on to sleep or study, then this is perfect for you.",
            "review_score": "1"
        },
        {
            "review_text": "At first I thought that the game was going to be boring, I sat there for about five minutes thinking 'this is a complete waste of my time. But then it happened, the unthinkable, a chair comet came down from the heavens and smashed into my mountain. After this wonderful occurance I couldn't help but play longer and longer, until I sat there for four hours straight staring at my mountain. Many wonderful things grace the side of my mountain now; including an empty liqour bottle, a plane, a glowing blue comet, and much more. This game has become more to me than a simple pass time, it has now become my epic quest to not close the game until my mountain is covered, I better get back to it.",
            "review_score": "1"
        },
        {
            "review_text": "I am emotionally attached to a virtual mountain.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "'This game sucks 11/10' - IGN",
            "review_score": "-1"
        },
        {
            "review_text": "Listed as VR but doesn't support either the Oculus CV1 or the Vive",
            "review_score": "-1"
        },
        {
            "review_text": "This is definitely not what all the game reviewers are saying this is. Also making my computer go hard out to wtf?",
            "review_score": "-1"
        },
        {
            "review_text": "It's says I have 5 minutes, but those 5 minutes were the longest ones in my lifeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee.",
            "review_score": "1"
        },
        {
            "review_text": "Your a mountain 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Interesting thing to run while idle or in the background or whatever... I mean, $1 is not that bad. I like it. But what if I want to start over?",
            "review_score": "1"
        },
        {
            "review_text": "I have become one with the mountain. 10/10 would mountain again :D",
            "review_score": "1"
        },
        {
            "review_text": "You are God. And just like God, you do nothing.",
            "review_score": "1"
        },
        {
            "review_text": "This games makes zero sense, what's the point. All you do in the game is look at dumb mountain and tap the keys to make sounds and thats just about it. Occasionally some nosensical word pop up like 'Who are you? are you a part of me?' or something like that which doesn't make sense either. You can't interact with any part of the mountain, you can't even add anything, it's just one huge boring game. Don't even think about buying this game, it dull and boring.",
            "review_score": "-1"
        },
        {
            "review_text": "A game that by most reviews seem to be fun, isnt. You stare at a mountain. You could do much more productive and enjoyable things than stare at a cgi mountain, given Ive only wasted half an hour of my life on this, I dont have much of a say, but thats long enough to realize the stupidity of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "*Sigh* It was on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't say this is a glorified screensaver 'cause I've seen much better screensavers free of charge. Basically, you play notes on the keyboard and some graphic effect happens on the screen. That's it. You play some little song, fishes rain down, or rather cross the screen form top to bottom, 'cause it has absolutely no effect at all on anything. I admit, *if* actually something happened, like, rain creating rivers, or lakes, too much rain and mudslides happen, just enough and trees and flowers are created, and so on, it would be actually interesting. Sort of like what happens in several flash games who also do not charge anything for a WAY better experience.",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth the $1.07 (which is after tax) you have to pay for it it's literally just rotating around a mountain.",
            "review_score": "-1"
        },
        {
            "review_text": "This is not a game in any shape or form.  Draw 3 random squiggles on the screen (to provide the seeds) and then sit back in and be massively underwhelmed by program generating a floating mountain.  This would be overpriced at 20 pence!",
            "review_score": "-1"
        },
        {
            "review_text": "Your mountain passes through seasons, has thoughts, grows, shrinks, picks up trash, and passes by random objects in space like suns, planets, and more. It might even die.  A ping sound is made when it thinks, so you can let it do it's thing in the backround. It's a pretty fun little distraction when not totally focused on one task.",
            "review_score": "1"
        },
        {
            "review_text": "ITS ARRT DAMMMIT!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Is this game great? YEs. is this a god game? No. Please make yourself able to control the mountain. THEN I'll call iy a god game.",
            "review_score": "-1"
        },
        {
            "review_text": "Nerd Cubed made me get this he is bad but this 'game' is okay",
            "review_score": "1"
        },
        {
            "review_text": "Not Pay2Win 14.67/14.69",
            "review_score": "1"
        },
        {
            "review_text": "You are mountain. You are bu||sh|t.",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing happened,,,, nothing happening... then a pickaxe landen on my mountain, I noticed i can hold my left mousebutton over it to pick it up and let it go, it embeded again into the mountain, then I accidently picked it up and let it go, missing my mountain and it floated of in space!! NOOOOOOO!!!! pickaxe come back!!! :(  10/10 :) ",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for something to 'play' skip this game. If you're looking for a beautiful, thought-provoking experience I definitely recommend. It's beautiful on so many levels.",
            "review_score": "1"
        },
        {
            "review_text": "  I was really taken a back when i first stepped foot into this game i was expecting a rich story with an amazing lore like skyrim or COD but i was really disapointed when i found out that my hard earned cash was spend on such a sad dissapointment of a game theres nothing to do i thought i was gona be shooting jews up in nam but insted im ♥♥♥♥ing sitting here staring at a mountain in the middle of ♥♥♥♥ing no where you might think im ♥♥♥♥♥♥ yeah im ♥♥♥♥ing ♥♥♥♥♥♥ i spend $20 on this peice of ♥♥♥♥ excuse of a game and i want my money back ♥♥♥♥ing hell what a peice of ♥♥♥♥ cant bealeave i left my game running for 2 hours plus to see what would happen i came back in the morning to find jack ♥♥♥♥ nothing just some tennis balls and ♥♥♥♥ on a mountain if i wanted to see a ♥♥♥♥ shack with trash all over the place i could have just went over to a moaris house.  Still better than no mans sky though i give a 3/10  No mans sky was a big dissapointment to me when i first opened it i was expecting a rich lore filled game with an inviting expericence and thats exactly what i found... well sort of for the first few hours i was inlove with the game gathering resources to repair my ship so that i could leave my starting planet and venture off to go find friends (me and a bunch of my friends had previously brought the game hoping to play togeather imagining an experience close to star citizen but in more of a cartoony work but almost all of us were completely dissapointed except for one of us my friend will who doesnt know a good and bad game when he sees one (he said that skyrim was ♥♥♥♥) anyway after the first few hours of exploring learning heaps about the game and expecting hours more content i was disspointed to land on the next planet and find..... nothing almost the exact same setup as the last planet i was on, was there more to explore No. Was there more to do No. the planets are all almost exactly the same with little variation between them, i left my second planet hoping the next would be better but i was utterly dissapointed to find that every planet was all the same and the game was just a fraction of what we were promised by hellogames. it almost feels like a Worse version of Elite danerous which in its self is just a worse version of stat citizen  no mans sky 1/10   Elite dangerous compared to star citizen is just little snack to tide us over while we all wait for the legend to arrive, star citizen it has promised of amazing ♥♥♥♥.    -Cheech      Yes i would recommend Star citizen to anyone looking for an amazing space game      TL:DR =   I was really taken a back when i first stepped foot into this game i was expecting a rich story with an amazing lore like skyrim or COD but i was really disapointed when i found out that my hard earned cash was spend on such a sad dissapointment of a game theres nothing to do i thought i was gona be shooting jews up in nam but insted im ♥♥♥♥ing sitting here staring at a mountain in the middle of ♥♥♥♥ing no where you might think im ♥♥♥♥♥♥ yeah im ♥♥♥♥ing ♥♥♥♥♥♥ i spend $20 on this peice of ♥♥♥♥ excuse of a game and i want my money back ♥♥♥♥ing hell what a peice of ♥♥♥♥ cant bealeave i left my game running for 2 hours plus to see what would happen i came back in the morning to find jack ♥♥♥♥ nothing just some tennis balls and ♥♥♥♥ on a mountain if i wanted to see a ♥♥♥♥ shack with trash all over the place i could have just went over to a moaris house.  Still better than no mans sky though i give a 3/10  No mans sky was a big dissapointment to me when i first opened it i was expecting a rich lore filled game with an inviting expericence and thats exactly what i found... well sort of for the first few hours i was inlove with the game gathering resources to repair my ship so that i could leave my starting planet and venture off to go find friends (me and a bunch of my friends had previously brought the game hoping to play togeather imagining an experience close to star citizen but in more of a cartoony work but almost all of us were completely dissapointed except for one of us my friend will who doesnt know a good and bad game when he sees one (he said that skyrim was ♥♥♥♥) anyway after the first few hours of exploring learning heaps about the game and expecting hours more content i was disspointed to land on the next planet and find..... nothing almost the exact same setup as the last planet i was on, was there more to explore No. Was there more to do No. the planets are all almost exactly the same with little variation between them, i left my second planet hoping the next would be better but i was utterly dissapointed to find that every planet was all the same and the game was just a fraction of what we were promised by hellogames. it almost feels like a Worse version of Elite danerous which in its self is just a worse version of stat citizen  no mans sky 1/10   Elite dangerous compared to star citizen is just little snack to tide us over while we all wait for the legend to arrive, star citizen it has promised of amazing ♥♥♥♥.   ",
            "review_score": "1"
        },
        {
            "review_text": "This is a troll game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a peculiar game. One that will take time to grow on you; but much like the mountain, it will grow. And it will be a source of fascination within a few hours.",
            "review_score": "1"
        },
        {
            "review_text": "Super boring- Why would anyone buy this?",
            "review_score": "-1"
        },
        {
            "review_text": "There is nothing to do.",
            "review_score": "-1"
        },
        {
            "review_text": "u will never find a betr gaem",
            "review_score": "1"
        },
        {
            "review_text": "Like skyrim with bloodrain",
            "review_score": "1"
        },
        {
            "review_text": "You start off with an amazingly advanced artistic program. You then continue on into a world unknown, A place so mysterious and exotic. They call it 'Mountain'. This game has insane graphics and a great story, 10/10. I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "An expensive screen saver",
            "review_score": "-1"
        },
        {
            "review_text": "As expected.",
            "review_score": "1"
        },
        {
            "review_text": "You are a mountain!!!Big deal.the only good is the graphiks!only the graphiks the gameplay is 4/10!  the end?",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game for people who dream of being a mountain. Of course, I don't mean the 'Game of Thrones' Mountain, as that kind of person would surely be disappointed by this title.  There are plenty of things you can do in this game. You can watch it, minimize it, adjust the size of the window it's running in, heck, you can even enter fullscreen!  Mountain is heaps of fun.",
            "review_score": "1"
        },
        {
            "review_text": "All joking aside... This is a waste of a dollar.",
            "review_score": "-1"
        },
        {
            "review_text": "Its alright.",
            "review_score": "-1"
        },
        {
            "review_text": "This game made me cry over and over again",
            "review_score": "1"
        },
        {
            "review_text": "Mountain is a revolutionary breakthrough in gaming. Its state of the art turn physics and next-gen floating objects make it a must-buy. Also you can play music, which is fun.",
            "review_score": "1"
        },
        {
            "review_text": "  i got this when it was free but now it has a cost and like 0 content why u buy this?",
            "review_score": "-1"
        },
        {
            "review_text": "'I am mountain, I am god.'  This game is a beautiful work of art which also has a couple of hidden gems if you leave it running or play specific sequences on the keyboard.",
            "review_score": "1"
        },
        {
            "review_text": "this is how screesavers should be in the secound decade of the 21 century, for the low price of 0.99$ you get a neat screensaver.nuff said....",
            "review_score": "1"
        },
        {
            "review_text": "I was a Mountain for some time, then a giant Bed crashed on me. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Yes? No? I don't know. I have no idea what im doing but pushing buttons that makes noises. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the best game of the century, I can't find the words to describe how good it is! I would have pay like 10000 dollars for this game, please support for more DLC.",
            "review_score": "1"
        },
        {
            "review_text": "Be a mountain in your car, be a mountain at your house, for the love of high stuff don't stop being a mountain",
            "review_score": "1"
        },
        {
            "review_text": "Your own boshanlu, the Taoist paradise of the immortals in your computer. Vary nice you have running for a relaxing mood.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 michael bay approves.",
            "review_score": "1"
        },
        {
            "review_text": "Nice, peaceful game to rethink all your life decisions and regret your mistakes. But buying this game isn't one of those mistakes.",
            "review_score": "1"
        },
        {
            "review_text": "I am one with the mountain.",
            "review_score": "1"
        },
        {
            "review_text": "it may seem cr***y as f*** but it's really relaxing",
            "review_score": "1"
        },
        {
            "review_text": "This game showed me that being a mountain is wierd  11/10 16/10 with rice  - ign                              /r/pcmasterrace",
            "review_score": "1"
        },
        {
            "review_text": "Most charming mountain ever!",
            "review_score": "1"
        },
        {
            "review_text": "I first bought mountain as part of a bet. my friend told me it was the most boring game ever and i had to marathon it for 24 hours wich i did and after the first hour i was hooked. at first i was wondering why the ♥♥♥♥ i was going to stair at a screen saver for 24 hours but eventualy i was hooked, i loved watching my mountine develope as a acumulate more debri and what not. now i cant do any kind of work on my pc without having mountin pulled up in windowed mode. hell i have mountin up as a write this review.im no philosipher or anything but i cant shake the feeling that the silly drawings from the begining and the some what criptic and on ocasion creepy messages that come up through out he game mean something more and all i can do is keep playing in hopes of one day understanding the secrets that mountain holds ",
            "review_score": "1"
        },
        {
            "review_text": "But ♥♥♥♥, it was 99 cents.",
            "review_score": "-1"
        },
        {
            "review_text": "The best game ever!",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever fallen in love with a mountain before? I mean a real, heart tugging love?",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the haters get to you mountain. I &lt;3 you.",
            "review_score": "1"
        },
        {
            "review_text": "Hours of Fun!!! Gameplay unlike any other! 10/10 Best game of the year!!",
            "review_score": "1"
        },
        {
            "review_text": "    / \\  / \\ /_ _ _ _\\",
            "review_score": "1"
        },
        {
            "review_text": ".....",
            "review_score": "1"
        },
        {
            "review_text": "I like the part with the mountain.",
            "review_score": "1"
        },
        {
            "review_text": "Would have a mountain again. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is definately the most satisfying mounain simulator I have ever experienced. It has changed my life.",
            "review_score": "1"
        },
        {
            "review_text": "Flawless",
            "review_score": "1"
        },
        {
            "review_text": "Needs a multiplayer dlc. Call it Mountains. 11/10 this game is rated M for Mountain.",
            "review_score": "1"
        },
        {
            "review_text": "A very beautiful game. Although it isn't made for actual gameplay, it's meant to be played whenever you quote on quote feel like it. As said before, it's a very beautiful game. I can't even describe it, bruh.",
            "review_score": "1"
        },
        {
            "review_text": "It is an interesting game to keep you entertained for a few days",
            "review_score": "1"
        },
        {
            "review_text": "Yeah its a fun game n all, it looks good, fun to play, havent gotten far myself but it looks pormissing, for what a mountain can do then, id give it a 10 if it had a bit more of commands",
            "review_score": "1"
        },
        {
            "review_text": "Mountain is love mountain is life. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "What is this? It is the the sh*test game I have ever played. I don't even think it is a game. There is no end goal. It is more like an interactive showcase of a mountain. Allot of reviewers hyped this game up and that was what made me purchase it in the first place. It is no where near as good as they make it out to be.  Sure it was only $1 but seriously? This would be better for something like a wallpaper not a game.",
            "review_score": "-1"
        },
        {
            "review_text": "The mountain has explained the meaning of life to me.   10/10 would mountain again .",
            "review_score": "1"
        },
        {
            "review_text": "Screw the negative reviewers. Seriously; 'It's a screensaver' - is that all you've got?    Short Version:  Buy it if you want something to take your attention every few minutes, so you can see how it's changed. That's its' beauty - an ever-changing semi-interactive painting on your desktop.  Don't buy it if you want something to grab your attention and hold you for hours. - And don't drop bad reviews on something just because it's exactly what it claims to be!   Proper Review  It's a semi-sentient mountain, of which you are mreely an observer. It's pretty much a digital pet rock that asks psuedo-philosophical questions about it's exsistence, and comments on it's current mood, based on the time of day, season, and / or weather. Sure, it starts with 'You Are God. You Are The Mountain'. But that's not correct, not really. At least, not to me. But that's not a bad thing, either.   IF you go into this, looking at it as an art piece that is designed to run forever in the background (on my second monitor wilst I'm not actively using it to scoop up deals on Steam) - and you realise that there are no 'controls' in this game, then what is there to complain about? It's exactly what it says it is on the tin: you know what you are getting, so WHY are you complaining?    Interactions  The play through begins with it suggesting some themes, and asking you to draw something based on those emotive words. I gather it uses these couple of sketches for it's World generation. Then, the Mountain is 'born', populated with tress, and set spinning for you to watch it.  You can move the camera with the mouse, controls most gamers / CAD designers already find instinctive; (click + drag to rotate in any direction, Mouse scroll to zoom). you can play Music to your mountain, using A-through-K and Z-through-&lt; {less than} to represent notes on a piano. I believe playing melodies speeds up time, and I actually think my mountain sang back to me once 'beeboobeebupboop'.  When the Mountain has something to say, He'll chime at you, then type it out across the top of his screen.   World Generation  as previously mentioned, It uses sketches that you provide to generate your mountain.There is a full gamut of weather here, sun, rain, storms, fog. I haven't seen tornados or the like yet. There is also Seasonal differences... You mountain gets covered in snow, trees lose their leaves in autumn. An entire year cycle seems only to take a few minutes, and days are no more than 1 minute, so you get a wide variety of things going on very quickly.  Trees, I've observed 3 distinct types thus far. They grow and die. New ones seed and sprout. I like that as a feature. There are some little touches, too - like evergreens don't lose their leaves, and thus get a full covering of snow. Things spawn periodically, and crash into your mountain, becoming part of it's landscape. Party hats, Electric fans, Dice, and I have no idea what else yet. My first item spawned inside 5 minutes though. This mechanic provides some variety to what would otherwise be a very serene experience.  The only kind of Fauna I have seen so far is fireflies... merely a flickering light near the trees, at night, during summer.   Universe  Clouds. wow, they look great, they really do... now get them out of my way so I can see my mountain! The other thing I don't really like is your zoom options. Zoom out too far and everything gets hazy, like looking through a mist or fog at something from a distance... which youy are... but you lose a part of the joy, I feel, that could e had by observing your Mountain from afar. Also, I'd like to be able to Zoom In more. I'd love to get up and close with those mushrooms.   Computer Resources  I don't normally mention this, but I will this time, as I think it's relevant, for a 'game' that's supposed to sit on your desktop for most of it's life. It's idling at 250mb RAM (this is fine) and 65% of my CPU. That's more than BIOSHOCK INFINITE Stressed my computer. This interested me enough for me to install it on my old game rig, and when the game puts Mountain in the rain, it lags. (1gb ddr3 gpx card... I said 'old'). This doesn't bother me, unless I'm planning on running a few of my VM's at once, or want to play a game fullscreen (Mountain will let you run another game next to it, unlike most Steam games So in this respect it's more like a tool than a game).    Thoughts  I'd really love to see fauna here - I'd prefer it to random Traffic-cone-Asteroids making my pristine Mountain look like someone tipped out a public rubbish bin all over my lawn****. I'd love to see animals, with varied animations - feeding, grazing, grooming, wandering.... The young getting old and dying? It would be awesome if you could folllow one around and watch it's lifespan over a few minutes, or maybe as much as an hour. This, plus the improved Zoom functionality I mentioned would make this game... better. The Author wants you to connect with Mountain, I think. He wants you to feel that you ARE the mountain. having some kind of life to observe in the game would certainly help with that. I'm thinking fairly in depth, too. I'd love to be able to see opossoms in the trees, deer on the slopes, bears coming out of hibernation... 'and fish in the stream'... hint hint. (Author; you would need a stream!)  Buy it if you want something to take your attention every few minutes, so you can see how it's changed. That's its' beauty - an ever-changing semi-interactive painting on your desktop.  Don't buy it if you want something to grab your attention and hold you for hours. - And don't drop bad reviews on something just because it's exactly what it claims to be!   **** I've learned some things about this game since writing this. One observer compared this 'junk' to the belongings that accumulate over our lives, how most of it is usless, or ultimately meaninless in the course of things, but it's there and it's difficult to make it go away. I like that comparison.  There are 'secrets' in this game. Certain song combo's will produce different effects, such as climate change. i don't recommend this, as (for example) once it started Snowing... it never stopped again. Also, it may ruin some of the 'magic' of this game if you read too many things and come across a spoiler. I regret that this happened to me.  Oh, and an actual trash can just crashed into my Mountain.",
            "review_score": "1"
        },
        {
            "review_text": "its a cool.......... something?  not really sure what to call this but its neat.",
            "review_score": "1"
        },
        {
            "review_text": "Mountain is love. Mountain is life.",
            "review_score": "1"
        },
        {
            "review_text": "Neat idea. Could work if it was an organic and evolving senario where things happen and you sort of just watch it grow and change, but its just a boring mountain sitting in the middle of space. Nothing more, nor less. Do yourself a favor and get an ant farm instead. That would be far more engaging and fun to watch than this poor excuse at 'art.'",
            "review_score": "-1"
        },
        {
            "review_text": "niatnuom is mountain but spelled backwards",
            "review_score": "1"
        },
        {
            "review_text": "Buy this instead of Cod:Ghosts, it has a better quality/price ratio",
            "review_score": "1"
        },
        {
            "review_text": "I have 40 minutes on this game and uninstalled it.  10/10 I love it",
            "review_score": "1"
        },
        {
            "review_text": "Pretty useless until I found out you can use it as a screensaver, so yeah pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "It's hard to say whether or not I recommend this game. As the other reviews have said, there is little to this game. Whilst I have racked up some hours playing, I have spent little time interacting with it. I'd say that it would make an excellent interactive screen saver, and I find it difficult to justify it's title as game. But even so, I found myself stangely attached to my mountain. It felt like it was mine, and I wanted it to reflect me. When ever something ugly landed on it, I would take measures to throw it off into space, and at one point I accidently chucked a light bulb away and was shocked at distressed I was at it's loss. The best analogy I can make to this game, is a rock garden, it never changes except by your hand, and lends a sence of clarity and solidarity to the back ground of everything. Even though I have given a very vague review, I have thoroughly enjoyed my time with this game, and ask people to give this game a chance before putting it back down.",
            "review_score": "1"
        },
        {
            "review_text": "I have seen rain, I have seen snow, I have seen trees come and go. A glowing blue meteor has inspired my trip, i encountered a barbell. Life is good 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has changed my life; I can finally live out my fantasies of being a mountain and do what mountains do.",
            "review_score": "1"
        },
        {
            "review_text": "A NIT MORE INTERACTION WOULD BE PERFECT  8/10",
            "review_score": "1"
        },
        {
            "review_text": "This amazing game is honestly very peaceful. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "There is alot to say about this game but ill try shorten it.  It is very good.",
            "review_score": "1"
        },
        {
            "review_text": "Hearts: ssfssfsfjhggf Flames: cvbnmbm Coins: ccc ccc cbzxc Snowglobe: bbbbbcb Fish: cxzxccc xxx cbb",
            "review_score": "1"
        },
        {
            "review_text": "Really more like a neat little dynamic screensaver than a game. Still, for 99 cents its pretty interesting.",
            "review_score": "1"
        },
        {
            "review_text": "An allegory for meditation.  Or for the human existence.  Or just a game about a mountain in the middle of space. Who cares?",
            "review_score": "1"
        },
        {
            "review_text": "Different, great to just leave on for ambient sound. I have wasted a dollar in worse ways.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ tho innit.",
            "review_score": "-1"
        },
        {
            "review_text": "Mountain isnt just a mountain, its more. Its a magical piano mountain that spins and collects objects.  Mountain=life  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Not a game, but quite moving nonetheless. For only a dollar, this little mountain will make you feel melancholy. I like that feeling. Buy it if you like that feeling.",
            "review_score": "1"
        },
        {
            "review_text": "One does not simply understand Mountain. Mountain understands you.  My conclusion for this masterpeice:  10/10 - 'IGN'  'Graphics put any game to shame' - Gamespot  'Multiplayer is surperb' - Homeless Guy down the street from my house  'Beautiful Story' - Oprah Winfrey",
            "review_score": "1"
        },
        {
            "review_text": "Absoulutely fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Difficult final boss.",
            "review_score": "1"
        },
        {
            "review_text": "I am usually boggled by the fact that I having nothing play and I am bored. After purchasing this game, I still am...",
            "review_score": "1"
        },
        {
            "review_text": "i think they should add the ability to watch a small group slowly build there evelution to our time period sloly developing cities towns or even just mior huts and maybe the ability to typesituations for the people to overcome that would make this game 10 time better than it already is like this if u want a update like this to happen or repost something like this just try to get the word out there",
            "review_score": "1"
        },
        {
            "review_text": "I survived Anihilation by playing a tune with my keyboard.",
            "review_score": "1"
        },
        {
            "review_text": "Personally I think it's a bit ridiculous that the developers are charging any money for this. There really isn't anything that you can do. It's nothing more than a screensaver that you can rotate. I wouldn't recommend spending money on this but if you are able to get it for free at any time it's something that's kind of cool to leave open for a few hours to see what your mountain will acquire.   4/10 not worth the money",
            "review_score": "-1"
        },
        {
            "review_text": "I have a philosophical sadness over me when I play this ... amazing ... so deep and yet so simple. I have no idea how to do much but to reset the mountain you write:  as,zb  while the window is active. Last time my mountain was destroyed by a giant icecream :)   The mountain grows and thinks... its almost like I feel connected to Mountain sometimes, like its me...   I got this from a friend here on Steam but have tested it before and I really had to write a little about it. I havnt played it alot on my computer yet, but I suspect Mountain will be in the background alot so Mountain can keep me company 'or I keep Mountain company'.",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand, I must be doing it wrong. I left my Mountain alone for 3 months and when I came back, it was more alive then when I left it and told me it had had the best sleep ever......is my Mountain an obediant kiss ♥♥♥? lmfao.  Oh btw, best geopet ever. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I was killed by a giant ice cream. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "great world!",
            "review_score": "1"
        },
        {
            "review_text": "Best game of time. Such a majestic screensaver you cant go wrong by doing nothing and watching this game not change 4 4 hours and 30 minutes in counting. Pls give mod support and put in death star in background, it would highly improve the game even more",
            "review_score": "1"
        },
        {
            "review_text": "In the amount of time that I played this game, it made me feel something. Something you don't feel from a video game. If you look past the part where this is isn't a game, which it really isn't, then you see something beautiful. You get a sense of isolation and yet beauty. Don't expect thrills, expect chills.",
            "review_score": "1"
        },
        {
            "review_text": "I get really attached to my Mountains. I've only had two and none have ever been annihilated. I just put my first down because it was not doing well.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why I bought it. Anyway I can say I have no regrets. No regrets in my life.",
            "review_score": "1"
        },
        {
            "review_text": "I got a Fire Extinguisher on mine!   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Having bought the game with no illusions about what I was getting, this was easily the best dollar-for-dollar purchase of the Summer Sale.  I never have guilt about not finishing 'Mountain'. I don't say 'Oh, I'll never play that game, what a waste'. The mountain doesn't need me. The mountain just is.  ",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, i do not understand what the creators tried to accomplish with this game. It's a game where you sit there and wait and wait for things to pop up. its a decent looking game, and is perfect if you have absolutely nothing to do, and love spending $0.50. In my opinion don't waste your money. If your bored out of your mind and this game is free give it a couple minutes of your time.  GOOD  * interesting graphics.  * you can play a piano with your keys, and if you zoom out it sounds really cool.  BAD  * extremely little to no gameplay experience   * you can spend 40 minutes playing and nothing even pops up, it just switches seasons.  * the only thing that is interactive is time, but even when you fast forward time, nothing really happens.  Rating: 1/10  ",
            "review_score": "-1"
        },
        {
            "review_text": "I dont get it. This is the sort of game you forget is running and leave on for a whole day. Meh. Still more fun than Call of Duty.",
            "review_score": "-1"
        },
        {
            "review_text": "One of those things where it will be called a game but in reality is just a pathetic excuse to take your money. Don't waste your time reading the reviews because it's just a bunch of people in denial of wasting their money. People are all like 'you just gotta appreciate it' and 'thats the point man. there doesnt have to be a point, man.' I feel like an idiot giving a dollar to someone who seems to have done jack ♥♥♥♥ to make this any sort of enjoyable or worthwhile experience. It's games like this that make me question whether the standards of games is dropping or we're just running out of ideas, and just forced to pretend to like this so we seem 'appreciative' of something 'different' (aka so dumb it cant be grouped with normal games) while some ♥♥♥♥♥♥♥♥♥ is taking our money and then rubbing it all over his ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Is this how i feel when i have a baby..?",
            "review_score": "1"
        },
        {
            "review_text": "Oh, Mountain, I love how I bought you for the sole purpose of watching things that not be swarm ro your orbit and launch themselves into your earthy embrace. But that hasn't happened yet. So thou sucketh. Until, fair Mountain yonder, I realized that despite your infuriatingly excellent landscape hygiene, I just killed over an hour simply staring at you. One hour at a time, that is.",
            "review_score": "1"
        },
        {
            "review_text": "Get Dazed and confused looking at your mountain just want for something to happen sure enough you look away for sec then theres something odd sticking out of mountain. If your bored and want something running in the background while your busy this is perfect for you then Just for 99 cents you can have the most interractive wallpaper  highly recommended ha  Also are some tips that i got form another user   1] You can pick objects by clicking and holding them 2] Lowwer keys can be used as notes  A-K high notes   Z-, lowwer notes 3]Play the notes in a certain order and magical things will happen  SnowGloge- BBBBCB  Hearts- SSFSSFSFJHGGF  Flames- CVBNMBM  Rain Fish- CXZXCCCXXXCBB  Artifacts- VMVMAMAMADADAGNANAD  Coins- CCCCCCCBZXC   4] Shake the mountain with the mouse to make the clouds disapper 5] Mash the note butttons to make a light glow around your mountain this will protect against falling objects 6] Want snow our rains to go away mash the note keys until they disapper ",
            "review_score": "1"
        },
        {
            "review_text": "i really dont like that i just bought a game where you do nothing...........",
            "review_score": "-1"
        },
        {
            "review_text": "AS you can see from my time on this game i know what im talking about. This game is one of the best games ive ever acutally had the pleasure of playing. not only do you get to customize your weSDFSDAapons you can wFSDAFDSAFDSAFSDDFSADFADSFADSFDASF DASFCG 3THYTG5WBGUJfrewfgewrhwtegref 4 2v4v45bu6tuku8euunsr urntbrt4665ytwgrefrcrtrvhhtththrhhtwthhthtththwhwtr7",
            "review_score": "1"
        },
        {
            "review_text": "Very mountain, much wow!",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand this game. I'm still tyring to figure out how I got 20+ hours on it!",
            "review_score": "1"
        },
        {
            "review_text": "6/5",
            "review_score": "1"
        },
        {
            "review_text": "Changed my life. Upped my sprituality and mental awareness. Made me contemplate so many aspects of my life. Cannot imagine what my life would have been. Became a Mountain.   If you see me playing this game, i'm afk, most likely meditating about being a Mountain :3",
            "review_score": "1"
        },
        {
            "review_text": "When I first bought this game, it was intended to be as a joke. My friend told me he had purchased it, telling me about the basic idea of the game, and we laughed... Then I found myself. For $0.99, an incredible price for what I recieved, I achieved a complete sense of Who.  I dwelved deep into my inner core, truly embracing who and what I was, all along....A Mountain. Not just any mountain...Me. From that moment on, I stopped the lies and false personalities I hid behind the previous years of my life, as I let the truth finally flow out. My peaceful and now open atmosphere, letting strange objects soak into who I am, creating who i was meant to be.  I spiritually unlocked my meaning and purpose to life, and no longer have to try to succeed in this false world, for I know who I am. 10/10, I most certainly can say this is the best purchase I have EVER, made in my life. Oh, and the piano keys are fun :3",
            "review_score": "1"
        },
        {
            "review_text": "This game may just be about watching a mountain gain random objects, but it's special because it is your mountain. There are many like it, but this one is mine. It's only a dollar and it's worth a shot if your bored.",
            "review_score": "1"
        },
        {
            "review_text": "would have given it a higher rating but my ♥♥♥♥♥♥♥ friend gives me a code that sent an astroid hurtiling towrds my mountain. in that one moment i saw my life flash before my eyes. ♥♥♥♥ this game for having a kill switch. grope the game for being amazing.",
            "review_score": "1"
        },
        {
            "review_text": "The name of the game is 'Mountain', but for me its the space and astroids that are more compelling. I find it stressful trying to constantly keep my mountain clean from all the rubbish that's constantly appearing on it. Where does it come from? Maybe I should let the mountain fare for itself.",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer would be nice.  10/10 would buy it again",
            "review_score": "1"
        },
        {
            "review_text": "Kinda boring, but when something lands on your mountain, you get all excited and just wait for something else, over it now though.",
            "review_score": "1"
        },
        {
            "review_text": "'There's a THING! On my THING! Wow.'",
            "review_score": "1"
        },
        {
            "review_text": "  um....this isn't a game. That's the short and simple of what I can say about this...visual experience. I don't hate it, or like it. It's just....there. I got this from the E3 ticket, so I didn't have to spend a dollar just for this, and I like that. Other then that, I don't recommend this as a game. I have no opinion over this because it's not in my....view of reviewical vision, if that made any sense. So yeah, form your own opinion on this, or save up for something different, it's different for everyone. To me, it's staring at a static screen, to you, it maybe hope for the future.",
            "review_score": "-1"
        },
        {
            "review_text": "You dont do much, but it is soothing.",
            "review_score": "1"
        },
        {
            "review_text": "wow, so mountain eee",
            "review_score": "1"
        },
        {
            "review_text": "I may be late to the party but eh, I'm doing it for the nomination ceremony as well. The game is super philosophical. I'm not sure how the artworks are integrated into mountain creation but the concept of just having a mountain is honestly quite appealing. There is no reason for it, it is just there. Sometimes there may be a storm of fish, frogs or hearts, but what happens is all connected to you in the end. The game uses a kind of allegory to make you compare it to real life and that's just beautiful in my eyes.",
            "review_score": "1"
        },
        {
            "review_text": "Revel in Mountain's warm embrace, and watch the objects of mysterious space come unto thee. Please feel welcome to our Home on Steam! -Search for Mountain in the Steam groups.^",
            "review_score": "1"
        },
        {
            "review_text": "Best gameplay, better than Skyrim, harder than Dark Souls, better story than Undertale, better simulation than ArmA 3 and better graphic than Crisis 3.",
            "review_score": "1"
        },
        {
            "review_text": "Quality game",
            "review_score": "1"
        },
        {
            "review_text": "really makes you think",
            "review_score": "1"
        },
        {
            "review_text": "It looks beautiful sometimes, nice effects included, but it`s not a game. You can say it`s some kind of modern art, but still not a game. Steam, you should mention it. Big letters: NOT A GAME, JUST SOME KIND OF VIRTUAL WORLD, PRETENDING TO BE AN ART.  I don`t recommend this game, because it`s not a game.   As something eles it`s interesting, I will spend more time with this.",
            "review_score": "-1"
        },
        {
            "review_text": "I'd recommend this especially as alt-tab material that you keep open most of the time, just keep ambience off. Pretty good when waiting for a friend to brb, but definitely not for staring at for half an hour. 5 minutes every now and then and you'll see something new and interesting every time.",
            "review_score": "1"
        },
        {
            "review_text": "In a fleeting moment, I thought myself as a child to what I am now. The mountain is a tool for self-discovery. It is a gateway to knowing of existence; of all past, future, and present. The mountain makes the knowing of truth, transcendent.",
            "review_score": "1"
        },
        {
            "review_text": "I got very anxious when I found a pair of bananas on the mountain. I should have realized that this game can be hard on you, but it will teach you the virtues of life, mainly the virtues of being a mountain. Therefore I began to realise that the pair of bananas engraved in the mountain was a good thing and that I should embrace it. The pair of bananas are a part of the mountain, therefore part of me. Then in came a meteorite, unexpectedly, and the impact did not only resonate within the mountain, but it did so within my heart. From there on I could surely and solidly confirm that I had become one with the mountain. I have now become a stronger being, and the mountain is the one I owe that to.",
            "review_score": "1"
        },
        {
            "review_text": "Really good. Fired it up, stared at the screen for 10 minutes and then went out to see a movie. The movie was average but when I got back a trash can had slammed into the side of my mountain. 10/10. Will turn on game and go see a movie again.",
            "review_score": "1"
        },
        {
            "review_text": "I've really gotta say, I legitimately enjoy this. While so many reviews are bad and sarcastic and call the game a waste of time and stuff, it is enjoyable. And for $.99 it is perfectly fine. Everyone spends $.99 on other apps anyway. It is extremely difficult to be dissapointed by this game as it tells yo before you purchase that you simply become a floating mountain. Super simple. And you get to play a pretty badass little piano on your keyboard. That is a perk. MY only issue is that there aren't many song combinations revealed to be in the game or simply not in the game yet. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Mountain is a whole different beast. This game is not really a game, kind of just like a random 'pet' you have that you aimlessly care for that has no purpose?   Mountain is more of a pet Mountain, you play musical keys to your Mountain and pretty much sit there and care for it, atleast I tend to RP (roleplay) Mountain. I like Mountain because it doesn't give you any details, no dialogue, no menu (kind of a menu in-game) it just tells you to draw 3 pictures and boom, it'll generator your little Mountain that will start to live!   Think of this game as anything you want it to be... Because at the end of the day, that's all this game is about!",
            "review_score": "1"
        },
        {
            "review_text": "I am a mountain and I am at peace. The secret of this game is patience, things will happen, seasons will come and go and you will grow as a mountain and as a person. You are a mountain not a race car.",
            "review_score": "1"
        },
        {
            "review_text": "A great idea with thorough execution.",
            "review_score": "1"
        },
        {
            "review_text": "Best game since Warz",
            "review_score": "1"
        },
        {
            "review_text": "Universal transcendence for only $0.99?  If anybody still thinks video games aren't art, buy this and play it for a few weeks.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the meaning of life",
            "review_score": "1"
        },
        {
            "review_text": "You stare at a uprooted like mountain, while it spins.... Whats not to love!",
            "review_score": "1"
        },
        {
            "review_text": "Easily the 4th best Mountain Simulator I've played this week",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. I don't know how or why but it is. You don't play the game you LIVE it.",
            "review_score": "1"
        },
        {
            "review_text": "Yay i bought a sheep",
            "review_score": "1"
        },
        {
            "review_text": "its pretty good idk",
            "review_score": "1"
        },
        {
            "review_text": "This game is a beautiful, medatative game that kind of puts me in a trance. I would definitly recomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Mountain is Love Mountain is Life",
            "review_score": "1"
        },
        {
            "review_text": "A giant ice cream was about to annihilate my mountain, spammed some keys and created a shield. I surived annihilation. I am mountain. I am god. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Nifty so far. Didn't expect alot but for just under a dollar..... Would be interesting if it responded to music playing on the pc rather than only the keytar sounds.",
            "review_score": "1"
        },
        {
            "review_text": "I can finally die as a mountain",
            "review_score": "1"
        },
        {
            "review_text": "Best mountain simulation game in its class.",
            "review_score": "1"
        },
        {
            "review_text": "I bought mountain yesterday, and i love it. i share my thoughts with it and he shares its thoughts with me, i am its company and its my company. i named it Mountain, and a log has grown inside of Mountain and it looks like a nose, i call it nose. The game doesn't make sence, Mountain and I meke the sence I love Mountain and Mountain loves me. You can't recommend Mountain as a game, you can only want it as a friend, as a personality.",
            "review_score": "1"
        },
        {
            "review_text": "While not a super stimulating game it's quite relaxing to have open while I'm reading or studying, especially when it's raining. Variety of the plants is neat as well.",
            "review_score": "1"
        },
        {
            "review_text": "Very Relaxing",
            "review_score": "1"
        },
        {
            "review_text": "This is not a game. This is a mountain. SHE is beautiful, and i cry everytime i see HER although i have only 13 minutes on record.",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is So Real, So.. Fantastic That When You Play It U Cant Stop Nor Will You Stop . A Day To Learn 8 Lifetimes To Master .    PS You Will Need 8 More Lifetimes To Recover The Damage This Game Will Cause Aswell   ",
            "review_score": "1"
        },
        {
            "review_text": "Very calming. Got it 10 minutes ago, and I already love it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "it's an ok game but i don't get the point of it. In my opinion it was a waist of money :/",
            "review_score": "1"
        },
        {
            "review_text": "Hey guys I'm planning to develop a game called 'paper simluator' It will be worth 59.99$ and it's about watching an A4 paper exist. Sure u guys will buy the game for me. And for the dlc i'm planning 'Boob simulator'. It's 49.99$. Thank you",
            "review_score": "1"
        },
        {
            "review_text": "a barrel hit my mountain... i mean thats all i have to say.      10/10       ",
            "review_score": "1"
        },
        {
            "review_text": "Odly enjoyable to look at..",
            "review_score": "1"
        },
        {
            "review_text": "Great game!  Gives you the opportunity to really relax.",
            "review_score": "1"
        },
        {
            "review_text": "Its art,Not a game....,But I like Art!",
            "review_score": "1"
        },
        {
            "review_text": "Believe it or not, this actually isn't the stupidest game I've ever bought. It's not even the stupidest game I've bought on Steam. I've bought way stupider things than this.  OK, so what is it? It's a 'game' only in the loosest sense. I bought it out of pure morbid curiosity. What I got was..a mountain floating in space. You can move the camera around. You can play music with your keyboard (and if you play certain songs, things can happen). The point, near as I can tell, is...there isn't one. It's a mountain, floating in the middle of space. There's really not much to it. That said, the ambient noises are oddly relaxing, and looking at it I almost can't help but feel ..tranquil. It's rather bizarre. I don't even really want to call this a game, since there's no real controls and no real objective.  But ****, it was 99 cents. I've spent worse dollars than this.",
            "review_score": "1"
        },
        {
            "review_text": "Still cheaper then a key in CS:go",
            "review_score": "1"
        },
        {
            "review_text": "Used all of my 7 years of music theory knowledge to create Canon in D for my mountain. No reaction from mountain. Aggresively played Mary had a little lamb. fish rained from space 10/10 would kill off classical music again.  ",
            "review_score": "1"
        },
        {
            "review_text": "Best game of the month choice out of 10 could use animals n dragons n sh-itz",
            "review_score": "1"
        },
        {
            "review_text": "in love with this game so indepth and interactive &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Would sit there watching my mountain rotate for over 1k hours, It is a nice relaxing game to play after bashing your head repetadley on your keyboard after an intense FPS game. Best game 2k14",
            "review_score": "1"
        },
        {
            "review_text": "Never going to get that dollar or five minutes back.",
            "review_score": "-1"
        },
        {
            "review_text": "The death of my mountain was the end for me, I had grown emotionally attached to it. Coming back to mountain to find it simply gone with a simply written explanation followed by 'try again' has just left me hollow. I became mountain, i became nothing.  please let me simply be without end. To be unable to fight against ones end is simply too much.  I also miss my horse.",
            "review_score": "-1"
        },
        {
            "review_text": "Really awesome and amazing, but it could use some more gun options. I tend to no-scope to hard so it breaks the game.  At least its not Call of Duty -11/10",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever asked yourself 'I wonder what it would be like if I was a mountain?' well look no further        11/8 dis is gr88888",
            "review_score": "1"
        },
        {
            "review_text": "I started playng this game because it was cheap. I kept playing this game because it was the opposite. On the seurface, it appears simple, but the more you play, the more you fall in love with it. I would reccomend this game to any who have ever dared to dream.",
            "review_score": "1"
        },
        {
            "review_text": "This is a beautiful work of art. A game you can apreshiate as it plays itself. Sometime I just want to exit the complex world and just escape. While most games are just or colplex and complicated, the mountain is simple and perfect for relaxing my mind with the minimalistic style. I would happily pay $5.00 for this rather than the $0.66 i did.",
            "review_score": "1"
        },
        {
            "review_text": "it reminds me of dota and how in dota you play a mountain and you wait for other mountains to say you good and then your all like tanks m8 im best pudge NA",
            "review_score": "1"
        },
        {
            "review_text": "This game, not really a game, is just plain fun. You get to watch your mountain spin and have thoughts. I have a chair in my moutain, but I would definitely recomend this game. I just can't seem to NOT have it running. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "My mountain has weights and a sword and right now a big burning meteor (meatball) has just appeared. I did nothing of difference in the game except switch audio off, because I was watching 3rd Rock from the Sun on the other screen. Seems everyone else likes this, mob mentality, I like this?  I'm still confused 5/5?",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, very good indeed!",
            "review_score": "1"
        },
        {
            "review_text": "Just the best. In a long time",
            "review_score": "1"
        },
        {
            "review_text": "10/10 just soo relaxing cant close it :)",
            "review_score": "1"
        },
        {
            "review_text": "bought it for .66p dont know what im doing with my life but hey why not buy this its got a great drawing pad to shape the mountain",
            "review_score": "1"
        },
        {
            "review_text": "10/10, would mountain again",
            "review_score": "1"
        },
        {
            "review_text": "I'm God and a mountain at the same time. 8/8",
            "review_score": "1"
        },
        {
            "review_text": "Perfect for when you want to do something else near your computer. Or you just sit back and watch, watch how your mountain grows.",
            "review_score": "1"
        },
        {
            "review_text": "A very interesting game. Not to be played on it's own, but observerd every now and then.",
            "review_score": "1"
        },
        {
            "review_text": "Hours of gameplay, unrivaled depth.",
            "review_score": "1"
        },
        {
            "review_text": "A procedural multimedia installation that runs on my PC? I'll buy that for a dollar.  The mountain does it's thing, and I do mine. Sometimes it reminds you it's there and says silly things. I'd like to see more games that you can hang out with.",
            "review_score": "1"
        },
        {
            "review_text": "i am the mountain",
            "review_score": "1"
        },
        {
            "review_text": "Musical Inclined",
            "review_score": "1"
        },
        {
            "review_text": "Spawns random stuff everyy now and then, 11/10 would stare again.",
            "review_score": "1"
        },
        {
            "review_text": "Even though it not a game, it kept me interested for a few minutes...",
            "review_score": "1"
        },
        {
            "review_text": "It's great to be able to understand the hard part of being a Mountain. This game really made me a more caring person, especially with mountains.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "an absolutely beautiful game.a bit long and boring,but can't resist to play.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like music? Do you like mountains? Always wanted to play a musical instrument while sitting on a mountain? Wh not be a mountain and play music from the comfort of your own home?  If Skyrim's devs and Michael Bay had a love child named Odin, He wouldn't play this game, But it doesn't mean you shouldn't!  Go on be a mountain! ",
            "review_score": "1"
        },
        {
            "review_text": "i just got this game its basically a 1 dollar screen saver but its strange... i find myself.... hypnotized by it... like.. i just.. cant move... from my chair... its like... my life was missing somthing... now.. that i have moutain... i feel... like... im complete its all i will ever need moutain is love......... moutain is life... ",
            "review_score": "1"
        },
        {
            "review_text": "Its all well and good trying to be funny and give it a good review for something that has nothing todo with the game, but this is not a game, nor entertaining in any way shape or form. Idle games on websites like Kongregate and the app store are so much better, and free.  Don't support this with money as it isnt worth it. Nothing new has been explored with this 'art'",
            "review_score": "-1"
        },
        {
            "review_text": "I struggle to imagine the kind of person who could get their money's worth out of this game, even given its very low price. Upon discovering that you can play a piano with your keyboard, and even make some environmental changes if you play certain melodies, I was excited. However, the system is rather finicky, and once you've seen every weather effect, you're pretty much done. I actually do like the idea of a game that you have very loose control over and mostly just watch. The Sims is like this. My Pokemon Ranch is like this. Many visual novels are like this. However, there isn't enough going on with Mountain to make you want to keep watching the mountain.",
            "review_score": "-1"
        },
        {
            "review_text": "Still better than some stupid products from industrial assembly lines.  This is just a mountain. Yeah, a pure mountain with no car, no gun, no ball, no artificial happiness.  What else do you expect?",
            "review_score": "1"
        },
        {
            "review_text": "Why is mountain? Because it is there.",
            "review_score": "1"
        },
        {
            "review_text": "Playing music is very relaxing after a long day of doing work. 10/10",
            "review_score": "1"
        },
        {
            "review_text": " Mountain  was an insanely simple game that gave me a very pleasant experience. It's not physically difficult and the instructions and gameplay are grasped quite fast. This game does challenge your view of who you are though, it requires a deep knowledge of yourself. Be prepared for some serious introspection. I would suggesst that the game not cost more than 4$ and a restart button would be nice.",
            "review_score": "1"
        },
        {
            "review_text": "Just glad it was free to me. It looks kinda cool, the zen type music is kinda cool, its even kinda cool that the keyboard is a piano. Then you see that this game has no point whatsoever. No controls, no game, just a mountain you rotate, and look at. If you really want to try the game I suggest looking at the sample photos, and play some zen style music. If you do this its pretty much the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I find this game very relaxing, yet also slightly mesmerising..... Big thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "This Game has something else that no other game has. It has character, charisma, and a ton of satisfying content. I go to sleep looking forward to seeing what happened to my Mountain the next day. I don't see why everyone hasn't paid the buck to buy this. You won't get emotionally attached to that buck like you will your Mountain, you won't shed a tear for a dollar, you won't talk to that dollar. Sacrifice that one dollar bill and welcome a new friend to the family.",
            "review_score": "1"
        },
        {
            "review_text": "The game asked me to draw Life, Death, and Suffering, and then a horse crash-landed into my mountain.    This must be the meaning behind Existence.",
            "review_score": "1"
        },
        {
            "review_text": "This experience, because calling it a game would just not work, is bound to spawn a religion. I have been buying copies for my friends to try to spread the good word. The Mountain awaits us all. Come to The Mountain.",
            "review_score": "1"
        },
        {
            "review_text": "It just sits spinning. Where did that pitchfork come from? What will it do now?  ",
            "review_score": "1"
        },
        {
            "review_text": "I am become mountain. 10/10. Would mountain for mountains.",
            "review_score": "1"
        },
        {
            "review_text": "99 cents to be a mountain.... totaly worth it",
            "review_score": "1"
        },
        {
            "review_text": "Game is terrible. There is quite literally nothing to do. I sat for 20 minutes waiting for something to happen, or to calm myself, and nothing happened.   The game isn't very calming. It's loud, it doesn't make sense, and honestly you can buy a few small things for other games with the money. I got a refund and am currently waiting for my money to be sent back.",
            "review_score": "-1"
        },
        {
            "review_text": "Mountain symbolises everything that is wrong in my life. The grass is just a layer to protect the outside from my dark insides. The fireflies at night represent that you have great ambitions but they eventually vanish. The objects that rain from the sky represent that everyone can do whatever they want with you and you can not deny.  I could go on and on with all symbols but I will let you discover for yourself. Also playing 'My Hearth Will Go On Flute' is recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Metaphor for life, if it were a procedurally generated mountain",
            "review_score": "1"
        },
        {
            "review_text": "Best game ign 10/10 play this 10 hours a day every day",
            "review_score": "1"
        },
        {
            "review_text": "JUST KEEP CALM...you're a mountain.  And being a mountain is calming...best mountain simulator ever! View it from space and play the keyboard piano, and just be calm...    (It really does calm you) (Really it do)",
            "review_score": "1"
        },
        {
            "review_text": "This is more like a screen saver then a game.",
            "review_score": "-1"
        },
        {
            "review_text": "ALL IT IS IS A INTERACTIVE SCREEN SAVER!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I am become mountain.",
            "review_score": "1"
        },
        {
            "review_text": "Darn. I missed when the hammer flew out of nowhere and landed next to my mountain's traffic cone. Construction Mishaps 101,..grade of D. 10/10 will retake class again.",
            "review_score": "1"
        },
        {
            "review_text": "I paid one euro, This game is more than awesome, superb screensaver.  It's adorable, my beatiful small mountain, I think i am God. ",
            "review_score": "1"
        },
        {
            "review_text": "i learned how to kill myself",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS SOOOO AMAZING!!!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely the best mountain simulation program there is on Steam, nothing like it, absolutely worth your purchase with a low, low price of $0.99.",
            "review_score": "1"
        },
        {
            "review_text": "You could spend 99 cents on a lot worse things.",
            "review_score": "1"
        },
        {
            "review_text": "Make sure your mountain does not get attacked by the mysterious forces.  Otherwise it's all good.   9/10",
            "review_score": "1"
        },
        {
            "review_text": "its mindless entertainment. just sit watch...walk away leave it running a few hours come back...repeat....over and over",
            "review_score": "1"
        },
        {
            "review_text": "They only thing satisfying in this 'game' is playing a secret tune that activates the big-as-heck-dice-of-destruction which slowly and doomingly marches toward that stupid mountain. All that while playing a foredooming track. Finally seeing the impact, the mountain is no more. I beated the game. Well worth the $0.99.",
            "review_score": "1"
        },
        {
            "review_text": "Better than No Man's Sky!  No bugs, space and earth, better music and visual 1.00$",
            "review_score": "1"
        },
        {
            "review_text": "This isn't even a game.",
            "review_score": "-1"
        },
        {
            "review_text": "  I got this in the E3 Humble Bundle. I wasn't sure what to expect, but them greatness happened. This is very relaxing. I enjoy the ambience of Mountain. It is amazing white noise when playing a game. I didn't understand a first then starting hitting keys.. Playing the songs of my imaginary people is so amazing. The more I play music the more my Mountain grows. Yaas Quen. Slay. 20/10 recommend for a stressed out person.",
            "review_score": "1"
        },
        {
            "review_text": "This game is weird :D Just start it and wait..",
            "review_score": "1"
        },
        {
            "review_text": "Game running in the background simulator 2014  10/10 -IGN",
            "review_score": "1"
        },
        {
            "review_text": "Pass into the Iris",
            "review_score": "1"
        },
        {
            "review_text": "Since I was born I have dreamed to become a mountain, a big, chunky rock that watches everyone from afar and this game helped me achieve this.  I give this title a perfect 5/7.",
            "review_score": "1"
        },
        {
            "review_text": "quality game, no hackers and bugs 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Pointless...",
            "review_score": "-1"
        },
        {
            "review_text": "This game,just by playing 11 minutes with it,made me feel very happy and very guilty now that i turned it of to play a game,this game though gives you a feeling,Such a nice feeling that it makes me happy and energetic it feels like,I want to spend my money on this since it feels like it is just...Well developed by a indie developer that is minor.This game is unique,it is ambient,and i somehow want to have it as a pet,i might be early on reviewing but it is worth it.DO NOT PIRATE,it isnt that expensive,and if you truly live with a computer and do not have any money,why are you having a expensive computer?   sincinerly,LibertyOfDoom.",
            "review_score": "1"
        },
        {
            "review_text": "Mountain is love...  Mountain is life...  It will seed you with all of its love juice...",
            "review_score": "1"
        },
        {
            "review_text": "CALM, INTENSE GAME C:",
            "review_score": "1"
        },
        {
            "review_text": "I wouldn't exactly call it a game. It's more of a... mountain simulator. A really fun and thought-provoking one, at that.   All you have to do is start it up, leave it open, and go about your other business. Simply peek in from time to time or when you hear a ping announcing that your mountain has a thought to share. A few hours pass and you won't recognize your mountain anymore under piles of fun, but also meaningful stuff that drops onto it. Where are the things coming from? What is their purpose? Is the mountian aware of them? Seems like it is... just like it is aware of the weather, time of day, and its own existence.   Use the keyboard to play it a song, too. Chances are you might trigger some unique weathers/special effects in the process. Or just use one of many guides to help you with that if you're impatient.  It's obvious that Mountain is not a game for everyone. Cerainly not for the instant-gratification crowd that only hungers for action, achievements and kills. And blood splatters on screen. Mountain is peaceful, lazy, laid back, with a touch of philosophy and a sprinkle of peculiar humor added to the mix.   To be honest, I can't imagine working on my computer without Mountain running in the background anymore. Recommended with all my heart.",
            "review_score": "1"
        },
        {
            "review_text": "A good game to procrastinate with.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game. Great gameplay, involving story, awesome easterggs.",
            "review_score": "-1"
        },
        {
            "review_text": "'Lady With The Spinning Head'",
            "review_score": "1"
        },
        {
            "review_text": "My mountain is my life. It breathes with me. Its heart is in sync with mine. Every time I merely think of my mountain I experience an immense bloom of fulfillment and a burning passion for more. My mountain is me. I am my mountain. We protect each other from Fluffy, the Bringer of Guilt, and will stop at nothing to make sure the other lives on. Together, we strive to make every molehill in existence into a living, breathing, warm, sentient mountain.",
            "review_score": "1"
        },
        {
            "review_text": "Nice screensaver, definitelly recommend",
            "review_score": "1"
        },
        {
            "review_text": "this game is an emotional rollercoaster",
            "review_score": "1"
        },
        {
            "review_text": "All these haters showing they don't understand the simple but complex beauty that is Mountain.  Do its thoughts mirror your own? Do they present the opposite ideas? Or do they, in them, show the truth you try so hard to deny?  Does its ambiance calm you? Frustrate you? Terrify you?  Are the relics it collects treasured memories of your past? Are they vague images of your future? Or do they belong to someone else entirely? Am I being facetious with this review? Or do I truly understand what Mountain has to offer? Perhaps the real question is... Do you?",
            "review_score": "1"
        },
        {
            "review_text": "Legit simulator...  Pros: A built in piano, a bunch of random objects flying out of space into your mountain, awesome sunrises, and lots more stuff which I will probably discover later!  Cons: They lied... there are controls. You use the mouse to look at you mountain and you can sort the random objects...",
            "review_score": "1"
        }
    ]
}