{
    "app_id": 313360,
    "name": "The Maker's Eden",
    "release_date": "2014-07-30",
    "developer": [
        "Screwy Lightbulb"
    ],
    "publisher": [
        "Screwy Lightbulb"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Cyberpunk"
    ],
    "achievements": 0,
    "positive_ratings": 82,
    "negative_ratings": 27,
    "price": 5.99,
    "description": "The Maker's Eden is a first-person hypertext adventure game presented in the style of a motion comic. You play a character trying to discover what their predefined purpose is, in a science fiction/noir inspired world filled with androids, flying cars and an early 20th century vibe.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/313360/header.jpg?t=1455060598",
    "minimum_requirements": "OS: WIndows XP SP2 Memory: 2 GB RAM Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7 or higher Memory: 2 GB RAM Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "First off, please note that I had accidentally left the game running when I went out - it actually takes less than an hour to beat this game, proceeding at a leisurely pace. At the time of writing this review, there have been two extra vignettes released, both of which are meant to be extremely quick, supplemental material. They each take around five minutes to complete. Be advised, the game is a three-part series, and I assume that owners of the game will receive the other 2 segments when they are released.  If you like graphic novels, sci-fi dystopian themes, and super casual gameplay, then you will enjoy this game.  The aesthetics are very good - the detail in the environment and art style are both well-done. The music is also good, and adds to the atmosphere of the game. The story is pretty interesting, although it is nothing elaborate or intricate (granted, I have read A LOT of fantasy and sci-fi). I look forward to trying out the next instalments.   As a point-and-clicker, the game runs mostly like a graphic novel, with some dialogue options and very simple puzzles. That being said, the controls are super easy to understand. The learning curve is minimal, however, there is one 'main' puzzle that took me a few minutes to figure out.    I had thought that the keypad grid required you to connect EVERY letter to its corresponding number (ex: A -&gt; 1, B -&gt; 2, etc), which is absolutely impossible.     During gameplay, most of the 'puzzles' can be solved intuitively, and the game provides a fair amount of hand-holding to ensure you progress through the story. My favorite puzzle would have to be    the part where you record a guard's responses and have to splice/edit a 3-part dialogue in order to get another guard to leave his post.     Overall, the game is a nice, quick experience that will be enjoyed by sci-fi lovers. A good time filler.  Recommend!  Cheers, DJSF  @DJSF's Rogue Reviews  ",
            "review_score": "1"
        },
        {
            "review_text": "The Maker's Eden has a great premise, I've always been a sucker for plots like this one. The 50's vibe that's going on is also something I'm very into so of course upon reading the game description I was drawn in. Only after purchasing and finishing the game did I discover the snags in development, however from what the devs are saying the remaining two parts are coming, albeit slowly, these things happen, and frankly, based on the strength of this first part I don't mind waiting. From the sounds of things we should have part 2 soon.  The art style is painterly and comic-inspired and fits with the rest of the game. The way it ends (I'll keep this vague to stay spoiler-free) is done in such a way that even in the event that the remaining two parts don't get finished it could really just be a very short game that is left open to interpretation, I mean there are films that do that. I wouldn't say that the game feels incomplete without the rest but it does leave you with questions and I'll definitely be eagerly awaiting the remaining parts.  The soundtrack is also really good, and again fits well with the rest of the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is not finished yet. Also, I )*(&amp;^ing hate adventure games. However, this is well done, what there is of it. Excellent backgorund music. The paralax effect adds nicely to the game. The graphics are consistent, stylish, and feel great.  Despite not being finished, this game is a gem, and I have ahd a great deal of fun playing it.  I look forward to act 3.",
            "review_score": "1"
        },
        {
            "review_text": "Q:  WHAT'S THE WORST THAT COULD HAPPEN WHEN BUYING AN UNFINISHED 3 PART EPISODIC INDIE GAME FOR $10? A:  THE DEVs COULD RELEASE 1 SUPER SHORT EPISODE THEN ABANDONED THE GAME FOR 2 YEARS &amp; THEN RELEASE A 22MIN GRAPHIC NOVEL... NOT AN ACTUAL GAME.  After playing the super short, but highly stylized demo I was sold. The futuristic film noir vibe was right up my alley. The illustrations were futuristic &amp; mysteriously beautiful, yet somber. The storyline was intriguing enough to hold my attention from interesting puzzle to puzzle. The writing, acceptable &amp; the last few puzzles all seemed very promissing... Like there would be so much more in the full game. So I chalked the super short demo up to the Devs not wanting to ruin the story's mystique &amp; I immediately purchased the game.   I justified justified spending $10 on an unfinished indie game because of the promise of 3 full episodes &amp; that seemed WELL worth it at the time. IT AIN'T WORTH IT PEOPLE. I take back everything nice that I said. EVERYTHING. smh  1. BOTH episodes are FAR too short (EP1 Puzzles/Story/Ok EP2 30min of reading, 0 Puzzles) 2. EP2 is just a 'Dialoague SImulator' with NO real puzzles or choices = ZERO FUN 3. Waiting 2 years for 30mins of reading?? W..... T...... F........ 4. SAVE YOUR MONEY, this isn't $2 let alone $10 bucks. 5. I'm never buying anything from these crooked DEV's ever again",
            "review_score": "-1"
        },
        {
            "review_text": "The constant reading is so annoying.  Interesting game, would've been x1000 times better with voice dialouge.  ",
            "review_score": "-1"
        },
        {
            "review_text": "A classic Cyberpunk Story that remind me of Blade Runner and Normality (without the comedy) .  Very atmosferic music and good drawing.  The bad sides are: - no voice acting - the first chapter is very short (finished in a single session) ",
            "review_score": "1"
        },
        {
            "review_text": "If Blade Runner is one of your favourite movies or if you like tech-noir setting, androids, and stories with a touch of mystery and conspiracy, you will probably like this short interactive graphic novel.",
            "review_score": "1"
        },
        {
            "review_text": "Can't wait for the next two episodes",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy the storyline, art and music. Can't wait for act 3!",
            "review_score": "1"
        }
    ]
}