{
    "app_id": 313480,
    "name": "Blitzkrieg Anthology",
    "release_date": "2014-09-16",
    "developer": [
        "Nival"
    ],
    "publisher": [
        "Nival"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "World War II",
        "RTS"
    ],
    "achievements": 0,
    "positive_ratings": 495,
    "negative_ratings": 65,
    "price": 3.99,
    "description": "March into the real-time strategy legend, Blitzkrieg, and prepare for war. This legendary WWII RTS blends unprecedented realism and accuracy to form immersive 3D backgrounds and a game where brute force often takes a back seat to strategy and wits.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/313480/header.jpg?t=1545220634",
    "minimum_requirements": "OS: Windows 98 / Me / 2000 / XP Processor: Pentium II 366 MHz Memory: 64 MB RAM Graphics: Riva TNT, 8 Mb DirectX: Version 8.1",
    "recommended_requirements": "OS: Windows 98 / Me / 2000 / XP Processor: Pentium III 600 MHz Memory: 128 MB RAM Graphics: GeForce256, 32 Mb DirectX: Version 8.1",
    "reviews": [
        {
            "review_text": "I first played Blitzkrieg way back in 2002/3 and played it now and again over the years, and I loved it. And the same is now! Eventhough it may look a bit old, the gameplay is still great. I still need to try multiplayer, but for the singleplayer, it is worth it!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever.",
            "review_score": "1"
        },
        {
            "review_text": "Much more tactical than your typical strategy game, the Blitzkrieg series really focused on when, and how you move your units instead of wasting your time building a base or mining 'resources'. Addictive game and would certainly recommend it for $4.99. Don't expect the graphics to blow you away, but I wasn't really concerned with that. Throw on some background music (I recommend something from your favorite WWII film) and I guarentee that you'll be hooked.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RTS games i've played  It is very similar to C&amp;C red alert 2 (graphics wise)  And I was able to steamroll all of Europe with my Panzer Tanks  10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "Played ALOT more hours than on steam.  Saw it for 3.99. Bought it. Not regretting it.  Massive thumbs up.  Awesome game.. not as hardcore as Theatre of war but a blast to play.",
            "review_score": "1"
        },
        {
            "review_text": "Gerat Game! I wanna more Blitzkrieg-Based Game!",
            "review_score": "1"
        },
        {
            "review_text": "Fabulous old game! Bought this when released back in 2003, played again and again, so addictive. Having to protect engineers and ammo supplies and trucks to keep your army well stocked. Bombers and fighters, spotter planes fill the skies, whilst snipers take out mine clearers. This is an awesome lesson in war. Tons of missions to keep you busy. Plenty of campaigns including operation barbarossa, shame it's missing kursk but buy this gem and you wont be dissapointed, also check out Stalingrad game on steam based on this game engine.",
            "review_score": "1"
        },
        {
            "review_text": "Great so far.",
            "review_score": "1"
        },
        {
            "review_text": "Blitzkrieg is a tremendous experience. In Blitzkrieg you can command armies of the American, German or Soviet nations. A great RTS, with many realistic elements and modern military tactics it challanges you to defeat it's competant AI.   8/10",
            "review_score": "1"
        },
        {
            "review_text": "I blitzed craige 8/8.",
            "review_score": "1"
        },
        {
            "review_text": "The art style is dated, but in a charming way that only old sprite based games can be. The gameplay is difficult and punishes your mistakes, but in a good way. I could only make it to the fifth level before the game would glitch out and close. So if you have windows 10 stay away from this game it. I would recommend the game if it actually ran on my PC, but seeing as how it crashes I can't recomend it.",
            "review_score": "-1"
        },
        {
            "review_text": "way to hard to play",
            "review_score": "-1"
        },
        {
            "review_text": "I was a little wary of buying this game cause it looked old, but seriously its fantastic and worth it!!.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love this RTS. One of my favourite games ever. 110% recommend.",
            "review_score": "1"
        }
    ]
}