{
    "app_id": 313400,
    "name": "REVOLVER360 RE:ACTOR",
    "release_date": "2014-10-24",
    "developer": [
        "Cross Eaglet"
    ],
    "publisher": [
        "AGM PLAYISM"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Shoot 'Em Up",
        "Action",
        "Indie"
    ],
    "achievements": 60,
    "positive_ratings": 258,
    "negative_ratings": 15,
    "price": 6.99,
    "description": "The world really does revolve around you in this mind-bending shooter where changing your perspective could save your life.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/313400/header.jpg?t=1555562260",
    "minimum_requirements": "OS: WindowsXP/Vista/7/8 Processor: Core2Duo 2.33GHz or faster Memory: 2 GB RAM Graphics: Shader Model 3.0 or later (GeForce 8600 GT/Radeon HD 3650 or better) Intel HD graphics 3000 or better DirectX: Version 9.0 Additional Notes:",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "People who are looking for a Bullet Hell SHMUP with a new gimmick should really try this game]. It's got a great presentation, with great visuals, a decent soundtrack, and a unique revolving mechanic that allows you to place bullets for maximum points or to help you get out of an impossible situation. The live update for where you place on the leader boards really adds to making the player want to better their skills at destroying the most bullets as possible to increase the score multiplier. I really can't believe the game hasn't gotten any buzz.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best shmups I've played in a long while. The central rotation mechanic is really cool and the manuvers you can pull off with it are mindbending. It's tough at first, but when you get that perfect angle to vaporize everything on the screen with your awesome lazor it's satisafying as hell. A must buy if you love shmups.",
            "review_score": "1"
        },
        {
            "review_text": "ok that button shoots  nice lazer this stage is crazy dunno what exactly is going on but looks awsome ok shoot anything that moves got it holy crap alternate routes witch one do i pick? overdrive ready wth is that? O_O what button is it oh crap what did i just do the world seems to rotate...TRIPPY caution???oh crap that things commin at me from the background what?! the heck how did i shoot it down wheres my health?? screw it im alive lets keep it that way ......boss!! X_X get this game if u love shumps it trully is something else i had fun playing it everything i said above will make sence when you play it n its 10 bux is it worth it to me??YES!! dont forget the headphones musiuc is pretty awsome too",
            "review_score": "1"
        },
        {
            "review_text": "&gt;&gt; This review might be updated later with some extra info &lt;&lt;  DAAAAAAAMN! THIS GAME IS AWESOME! REVOLVER360 RE:ACTOR is a shoot'em up game; but it has a very interesting difference from other games in this genre: you can rotate the enviroment! For example, you can use this ability to line up several rows of enemies and destroy them at once or to avoid screen filling attacks. This ability also made the game a lot challenging since the enemies and some goodies are placed around the enviroment. In addition to this ability, you have access to a straight laser attack which can eliminate enemies and some projectiles, and an overdrive move which removes every projectile from the screen. There are three modes to play in this game. I recommend completing the challenges before playing through Reactor mode to learn the basics.  Positive Points: - The enviroment rotation mechanic is very innovative and has made the game unique - Multiple paths in stages - Nice difficulty (The game is hard at first. But when you get used to the mechanics it becomes easier.) - Nice visuals and soundtracks (Soundtracks are bundled with the game.)  Negative Points: - TOO MUCH BLUE COLOUR!  Notes: - The game can freeze on launch due to one reason: downloading scoreboards. To avoid this, check ((Offline Mode)) in game's config file which is in the game's main directory. - I haven't finished the game, so it's early to tell the game is short or not. I'll update the review later about this.",
            "review_score": "1"
        },
        {
            "review_text": "An underrated shoot em up with beautiful graphics and great music, although sadly no option for unlimited continues so i can't complete it.",
            "review_score": "1"
        },
        {
            "review_text": "Intense. Only 3 levels tho. (not easy by any means)",
            "review_score": "1"
        },
        {
            "review_text": "I remember a time when games were this manly.  11/10 would go again.",
            "review_score": "1"
        },
        {
            "review_text": "Best Schmup I played in years.",
            "review_score": "1"
        },
        {
            "review_text": "This game is blue, just sayin'",
            "review_score": "1"
        },
        {
            "review_text": "Just no.",
            "review_score": "-1"
        },
        {
            "review_text": "Seldom do I feel the need to praise a game for its uniqueness, creativity, or its functionality, even less so all three together. A fast paced game that will never feel the same each run (unless you always die at the start). Its rotating mechanic is its defining part, its graphics are elegant, beautiful and well designed. The landscape (and everything in it) contrast well that I can only describe it as stunning, even the name registration kicked my scifi geek within into gear as I tactifully inputed my desired name (although I might just be easily impressed). The music is well made and only adds to the excitment. I look forward to seeing how they will continue to further this in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥ I love shooter games like this. Like those side scrolling blast everything style stuff...with rotations and awesome mechanics. and bloo all the bloo",
            "review_score": "1"
        },
        {
            "review_text": "Well first of all this is a good game. Its 360 game mechanic is so well developed and its really interesting to play. Its fun for an hour or so but after that....it just gets so repetetive and just outright boring. Theres no story or plot to it. Theres no upgrades to get and basically you are just replaying the same envirements over and over again withour change at all. You dont earn money to buy items, you dont get skins, and there is nothing to get out of this game. Some of you guys may like it, but it just ticked me off at how there was so much potential in this game.....But if you like this kind of game I highly recommend a rental. Go to your closest game shop and rent it for a week or so. overall I would rate it a 6/10.  ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing unconventional bullet hell experience in which you rotate the world and enemies around you, so you can line up enemies, objects and bullets in front of you. Quite challenging.  If you encounter the issue where it freezes when exiting the score board, the fix is in the comments.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a really good Bullet Hell with a jamming soundtrack.  Just be prepared to see blue for a while.",
            "review_score": "1"
        }
    ]
}