{
    "app_id": 313630,
    "name": "The Solus Project",
    "release_date": "2016-06-07",
    "developer": [
        "Hourences",
        "Grip Games"
    ],
    "publisher": [
        "Teotl Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "VR Support"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Survival",
        "Adventure",
        "Exploration"
    ],
    "achievements": 43,
    "positive_ratings": 1776,
    "negative_ratings": 430,
    "price": 14.99,
    "description": "The Solus Project is a single player exploration adventure with survival elements. The adventure is set on a mysterious planet and is the spiritual successor to The Ball - 2010 PC Gamer Action/Adventure Game Of The Year...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/313630/header.jpg?t=1480876448",
    "minimum_requirements": "OS: Windows 7 64 bit and newer Processor: Dual Core 2GHZ+ Memory: 4 GB RAM Graphics: DirectX10 Compatible 3D Card - Minimum GeForce 460 or equivalent  - Integrated graphics (Intel) may not work well and have not been tested. For use with Intel integrated graphics please run the game in DirectX10 compatibility mode. DirectX: Version 10 Storage: 11 GB available space Sound Card: Any Windows compatible card Additional Notes: Supports Tobii Eye Tracking. Vive and Oculus VR supported but still partially in development. Playing the game in VR requires a powerful computer.",
    "recommended_requirements": "OS: Windows 7 64 bit and newer Processor: Quad Core 2GHZ+ Memory: 8 GB RAM Graphics: DirectX11 compatible 3D card strongly recommended - GeForce 760 or equivalent and higher DirectX: Version 11 Storage: 11 GB available space Sound Card: Any Windows compatible card",
    "reviews": [
        {
            "review_text": "FINALLY a game worth playing in VR! If you have the VIVE get this game! I am so sick of games for VR being extended tech demos. This is the real deal, when the rain starts up and then a tornado hits in VR its EPIC!!!! Very scary and enjoyable. This is the first review I have ever written and I have been with steam since HL2 was the new hotness. in short I LOVE this game in VR. I can't wait for more fleshed out games, the tech is there the games are not.... This is a glimpse of the future God Bless You Guys and keep up the good work!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Holy sh** this game is captivating. All the negative reviews are from VR kids who don't like the VR implementation. If you don't care about VR, then there is no reason not to buy this. Absolutely worth the full $20.  It's a survival game, but there are more things to be mindful of than in most survival games. Ways you can fail to survive include: --Starvation --Dehydration --Hypothermia --Overheating --Exhaustion (lack of sleep) --Physical damage to body (falling, etc)  The game makes all of these even more challening by putting you on a planet with volatile temperature and weather conditions. One minute the temperature is below freezing so you have to huddle in a cave throwing sticks on a fire while waiting for the cold front to pass, then the next minute it's blistering hot so that you have to run from shade to shade to keep your body temp from rising too high. And of course you have to stay on top of food and water.  Unlike other survival games, there is no farming---only gathering. And there is technically no storage, although you can still hoarde piles of things because the game will remember where you dropped them.  Also unlike other survival games, there is a narrative and an overarching goal to this game. It's not just a game of seeing how long you can survive---you're also trying to scavenge materials from crash sites to build a satellite uplink. There are also huge caves and dungeons to explore (be sure to bring food, water, and light!)---not to mention loads of secret items as exploration rewards.  If you like survival gameplay but also like exploring and having a definite end goal, then this game is worth every cent.  I emphasize again that this review pertains to the regular, non-VR experience.  *edit*  Updating this review because it's also worth noting the following:  --This is first and foremost an adventure/exploration game, but there are some survival elements as described above. HOWEVER. The game lets you tweak the survival settings to make them more intense or, if you prefer, make them completely negligible so you can focus on just the exploration (which is also fantastic!). So FYI if you like exploring but dislike survival.  --By default the game uses the metric system. But if you were born in stubborn America, like me, then the game options can be tweaked to use Fahrenheit / ounces / miles / etc.  --By default the protagonist is male, but you can switch to a female voice in options (mostly just your typical grunts and groans, but the protagonist DOES talk occasionally, so take your preference).  */edit*   7) A classic, essential, and/or must-buy game that is worth full price.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Just. Amazing. The next level atmosphere, the incredible story. Uncovering the history of this species just gave me thrills. It's a generaly long game, but I never felt like I was slaving away trying to do some sort of useless puzzle. No. In this game you are always doing something productive. It's like you can never get bored because every area is different. In short, I loved this game.   The only complaint I had was the ending. I feel like the game could've even gone on a little while longer. The ending was very short. I just felt like it didn't fit with the rest of the game. But otherwise I loved it. I have never felt so involved in a game. 10/10 worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game on the Vive. It's probably my favourite experience on the device so far, after having bought about 50 games. And that from a game with VR support added after the game was mostly done. That of course has its limitations. The inventory is cumbersome (but l understand the devs are working on it), and the controls aren't always logical. You have to push a button to interact with things (that is probably hard to fix as the game is designed around a controller). But you can use your hands independently, light your way with the torch etc. and move about freely. The default locomotion will be tough for some, but with a little tinkering you can adjust the walk speed, and even make the in game clock slower so you have more time to explore the incredible looking locations. You even get a teleportation gun you can use for moving around if your VR legs isn't good (I haven't used it much though as I find the default locomotion very nice, but I've had some time to train my VR legs). It can be quite scary in VR, with an eary atmosphere, and I have more than once had chills go down my spine.  And the story so far is really good, keeps me pushing on. This game is fantastic! The VR implementation is an example for other devs to follow, and its improving with every update. Thank you devs for giving me this amazing experience in VR!",
            "review_score": "1"
        },
        {
            "review_text": "A VIVE USER PERSPECTIVE – A VR EXPERIENCE LIKE NO OTHER  The Solus Project is a prime example of what implementing VR to an existing, originally non-VR game can accomplish. The result is a supremely immersive, story-driven, athmospheric, and gorgeously beautiful exploration and survival sci-fi adventure, on a vast, mysterious alien planet. The game exemplarily captures the feeling and pace of arriving to and exploring a great unknown.  I think VR (Vive room-scale) really makes the game. A couple of weeks back, before VR support, I watched a bit of a playthrough video on YouTube, and thought the game looked slow and boring. But once I heard the developers were adding Vive support, I had to try it, and haven't looked back since. I must say the Vive room-scale implementation really makes the game for me. It truly places you in the middle of a mysterious planet, exploring around, experiencing the story that is really well and immersively paced. It's quite amazing; a testament to what VR can do to a game, and surely a benchmark for the future.   For me, what initially looked like a boring survival game on a 2D monitor is now an amazingly immersive sci-fi adventure that I would wholeheartedly recommend to anyone who has the Vive and the least bit of interest in a good story. With The Solus Project, you'll get to experience one like never before.  To add, the developers are still making adjustments and fixing bugs, making their VR support even better with future updates. Frankly, with the current price of 18,99€, getting this game should be a no-brainer, especially for a Vive owner. A++  (This review was based on version 1.01, using the walk control scheme while playing standing up in a room-scale setup.)",
            "review_score": "1"
        },
        {
            "review_text": "Literally speechless. This game in the VIVE is completely indescribable and something I have never felt in any game. It was so freaking immersive and beautiful, with the right blend of suspense and atmospheric challenge. I want more!!! This is what VR should be all about!!  If you have a VR headset, you owe it to yourself to run through this game in its entirety.",
            "review_score": "1"
        },
        {
            "review_text": "This review is strictly for the vr version of the game.&nbsp; The quick review is this: It’s the best experience I have had to date with my vive and I highly recommend it. &nbsp; Now for a little more detail.&nbsp; I was skeptical of this game since it is a port from a standard pc game.&nbsp; I’ve read that porting a game is a recipe for disaster for vr.&nbsp; The port does come with some down sides.&nbsp; Since the game wasn’t made with motion controllers in mind, most of the interactions are point and click.&nbsp; For example: you have a can that you want to open up and eat the food inside.&nbsp; With the motion controllers and playing other vive games you may get the idea that you can set the can down, pull a pipe out, and swing for the fences with your controller to have the pipe smash open the can.&nbsp; This is not the case.&nbsp; You simply drop the can on the ground, pull the pipe out, point the cursor at the can and pull the trigger “simulating opening the can”.&nbsp; The other negative in its current state is the inventory system.&nbsp; Right now you have to cycle through everything which is a bit cumbersome.&nbsp; The devs are working on an update to this issue and supposedly will have it out in the next couple days, so this will more than likely be even more of a non-issue than it currently is. &nbsp; Now on to the positives of the pc game port.&nbsp; This is an actual, fully-realized game.&nbsp; This isn’t a cool concept. Its not a wild 10 minute tech demo that has you salivating for more. My previous favorite experience was the gallery.&nbsp; The gallery is $30 and lasts about 3 hours.&nbsp; It’s a wonderful experience and great use of vr, but its over before you really get into it.&nbsp; The Solus Project does not have this problem.&nbsp; I am currently 5 hours into the game and have only scratched the surface of this world that you get to explore.&nbsp; The devs say that you can beat it in roughly 17 hours, but can take up to 50 if you explore all the areas.&nbsp; I long game like this is what the vive needs. There is depth to this game that you simply won’t find on any of the current made for vr games on steam.&nbsp;&nbsp; Now let me take a moment to break down a couple aspects of the game. &nbsp; Controls: &nbsp; There are several different options you can do to move around the planet.&nbsp; The standard teleport option which most games use is also available for The Solus Project.&nbsp; For those that can handle it, you can also use one of the track pads to move around.&nbsp; In the options I have set the walking speed to 30% and love the experience that it provides so much more than teleporting everywhere.&nbsp; It’s a nice slow pace that will probably take me ages to complete the game, but its at a pace that I feel like I’m actually walking through the caves.&nbsp; Overall the control options are good enough to allow you to play the way its most comfortable for you.&nbsp; I also need to mention that the motion controls are definitely utilized in the game.&nbsp; I mentioned above that the interactions are mostly point and click.&nbsp; While this is true, the motion controls still work great.&nbsp; When holding up the torch, you can move it around to change the angle of the light hitting off the cavern walls, point the flashlight where you want, etc.&nbsp; the controls are 1:1 in terms of movement, just don’t expect to swing a sword around and have it physically hit something. &nbsp; Graphics: &nbsp; Holy crap is this game gorgeous.&nbsp; Again, this is what sets this game apart from most games out for the vive.&nbsp; These devs have taken a lot of time to make the caves look as organic and natural as possible.&nbsp; The Unreal engine really shines in this game.&nbsp; The feeling of being in a large alien cave chamber is indescribable.&nbsp; The pacing of the game also lends to the visuals constantly changing.&nbsp; By the time I was getting used to the cave scenery, the cave would end and you would be thrust into a gorgeous outdoor scene with alien beaches, rock formations, meteor showers, crazy storms.&nbsp; It really pulls you into the game and gives you the feeling that you are on this alien world. &nbsp; Audio: &nbsp; The audio is perfect.&nbsp; The general creepy ambiance they have created with the sound is superb.&nbsp; I &nbsp;hate horror games and jump scares. This is definitely not one of those games.&nbsp; However walking around in a cave is inherently creepy.&nbsp; Add in that this is a cave on an alien planet and the creepy factor goes up a couple notches.&nbsp; There have not been any jump scares or anything scary that I have experienced in the game.&nbsp; The creepiness and general foreboding as to what is behind the next turn is greatly enhanced by the audio.&nbsp; I’m pretty sure it has spatial audio in the game.&nbsp; There have been several times where I know I’ve heard something behind me.&nbsp; Being able to pinpoint sound locations also adds to the overall atmosphere that they have created in the game. &nbsp; Gameplay: &nbsp; This game so far is more of a walking-simulator where you are the lead in a mystery story that is unraveling before your very eyes.&nbsp; You aren’t going to feel like a badass like when you play holopoint or SPT. If you are in to movies like interstellar, or books like The Martian, you will absolutely love this experience.&nbsp; I have been awestruck by the beauty of this game, and I have had to tell myself that I’m really just in my basement and nothing is going to hurt me if I keep moving forward.&nbsp; The puzzle’s have been non-existant to really easy so far, but I’ve only just begun. &nbsp; Overall, this is the exact type of experience I was dreaming of when I first learned that VR was becoming a reality.&nbsp; This game gives you the ability to travel the cosmos and explore an alien planet while you try to survive and figure out what’s going on with the planet.&nbsp; Not too bad for only $20!&nbsp; I can’t recommend this game enough! Go buy it now before the devs realize that this is at least a $50 experience. You won’t regret it.",
            "review_score": "1"
        },
        {
            "review_text": "I come back here to say that the lasts updates regarding the controls in VR are awesome. Perfect movement controls, and inventory are now available. It is actually one of the most enjoyable and complete experience I got in VR.   thank you so much for these updates, and have a good continuation !  ------------  Original post:  Played all the time on HTC vive, overall it is a great experience but the controls are not the most intuitive yet. It misses some functionalities like to be able to move backward and an item selection inventory ;) I'll look forward for these improvments to continue to play this game.  Thank you and wish you a good continuation !",
            "review_score": "1"
        },
        {
            "review_text": "So far a fairly good game but does need to sort out a number of things, hopfuly an update soon to iron out bugs.  Custom controls the default ones dont make senses, PDA in left hand but controled from right??  Also tip text runs too far to the edge of the screen and cannot be read.  Pad too small and cnnot read text, needs much bigger screen, Button to pull out bigger display??  Great game just feels like a Beta!",
            "review_score": "1"
        },
        {
            "review_text": "This was a great game. I purchased the Solus Project becouse i heard it got VR Support and I was not disapointed. This is just a game that is meant to be played in Virtual Reality. The Areas the Caves its just beatifully looking. Befor the latest patch i had to play parts of the game without it becouse it was not possible to climb ladders reliable in VR. Thanks to the newest patch this problem has been solved. I got arround 10hours of gametime to finish the game, but i didnt explore alot, becouse i wanted to see how the story progresses. If you try to find all the secretes it will probably take you alot longer.  With this i can recommend the game to everyone, but if you have a HTC Vive... its simply amazing.",
            "review_score": "1"
        },
        {
            "review_text": "For starters, I haven't had the chance to try this game on VR, so my review is with non-VR play in mind.  I really enjoyed this game, through-and-through. First of all, the art of the planetscape, with all its unique flora especially, was spectacular. While at first I doubted that the survival and story elements would cooperate, I was quickly surprised by how well they worked together to form and immersive experience. The game is really engaging; I really felt like it was  me  stranded on this strange planet, seeing so many strange things, trying to understand what was going on. There wasn't a dull moment in this game, from start to finish, but it didn't feel stressful either, like some survival games. All in all, a great experience that I intend to play again. Would also love to try this game out on VR - after playing it normally I think it would  significantly  enhance an experience I already really enjoyed.   Really the only thing I can think of about this game that bothered me was that your PDA is called 'Wilson' but has a female voice. That's literally the only thing that bothered me. Everything else leads me to recommend this game :)",
            "review_score": "1"
        },
        {
            "review_text": "This game has heaps of atmosphere, from the volatile weather to a story that doesn't give you all the answers but lets you think about it and draw your own conclusions.",
            "review_score": "1"
        },
        {
            "review_text": "I play this on a Vive. The VR experience is great! In the beginning I had to experiment a bit with finding out how to cycle through the inventory and use items but afterwards it went fine. Great job on the game and the VR part of it.",
            "review_score": "1"
        },
        {
            "review_text": "  Best VR game for me so far. I played this on the Xbox preview program and thought it was ok. Playing on the Vive was amazing! I preffered palying with the Xbox controller in VR over the wands though. This finally makes me happy to have VR. So far, I feel like it's a 'real' game compared to most of the product demo style games.",
            "review_score": "1"
        },
        {
            "review_text": "I picked this game up within the first week it was in EA (I am an EA survival game recovering addict). When I learned they were going to eventually add VR support, I held off playing past the first area and waited. I am so glad I did! Not only do I now get to play through the entire game but I also get to experience something on a whole different level with VR. It really gives you the feeling you are exploring a different world. I am only a few hours in but its a great experience. I recommend this game to any VIVE (or other HMD) user looking for full on game! Its crazy because the VR experience actually made me have the strangest dreams after playing last night. The graphics are great (running on a 1070 had a huge performace boom over my old 970) the music is great, but, the immersion factor is what will keep you coming back. This game fulfills what I originally imagined VR to be like.   10/10 for providing a close encounter with a tornado which will likely never happen to me in RL while living in Arizona.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite game adapted to the Vive so far. Aside from real life, there is nothing that can compare to the VR experience of looking up at tornadoes and meteors coming down from the sky to ruin your day.",
            "review_score": "1"
        },
        {
            "review_text": "This is a must buy game. I wasn't expecting to have as much fun as I did. The game ran smoothly, the graphics were great, and the story I can not express the satiaction I had with it. The mystery is amazing. Well done developers I hope they make another one in the near future. Great game guys.",
            "review_score": "1"
        },
        {
            "review_text": "It takes a lot for me to enjoy a survival game: I find most either too punishing or downright frustrating. The Solus Project manages to be neither of those, while at the same time keeping your stress level just high enough that you never feel exactly safe. The game provides you beautiful vistas and a wonderful soundtrack to admire, but then rips you back into reality by reminding you that you are rarely ever safe. This combination of peaceful and stressful moments is perfectly balanced and creates an incredibly unique experience.  I played the game through on my Rift and it is one of the most complete and polished VR games to exist at the moment. VR support is amazingly well done for being experimental. The game is downright gorgeous in VR, and all of the mechanics translate over well. The only qualm I have is that inventory management—scrolling in one direction through each inventory item individually—got annoying near the end, especially when you're dealing with extremes in temperature and really don't want to pull out your torch in a scorching hot environment.  The gameplay is relatively simple while at the same time never feeling too easy. Your basic goals are to survive and keep moving forward: you have to maintain your basic vitals (body temperature, hydration, and nourishment) while moving into new areas, each one more deadly than the last. There's an old-school point-and-click feel in the mechanics, with much of your time spent searching for that one special item or finding ways to combine the items available to you. There are tons of secrets hidden off of the beaten path, and hunting them down while oftentimes risking your life is a lot of fun.  The game's story is enthralling and plays itself out in both passive (pages from journals, tablets with carved language/images, one-way transmissions to your character) and active (interacting with alien lifeforms) ways. Despite being battered by the elements, I felt compelled to hunt down as many pieces of the story as I could to better understand the situation upon Gliese-6143-C. A few of the later transmissions you recieve are downright harrowing, with incredible voice acting bringing poignant feelings of isolation and desperation across.  Near the end of the game I was legitimately sad that my time on Gliese-6143-C was coming to a close. I definitely have to say that I got my money's worth, and I really hope to see more games from these devs!",
            "review_score": "1"
        },
        {
            "review_text": "  You begin The Solus Project as a crew member aboard a colony ship sent to find a new home following the destruction of Earth. After an unknown event causes you to crash land on an alien planet you find yourself wandering out into the wilderness trying to find survivors and a way to contact home.  The Solus Project is by and large and exploration game with some puzzle solving with the survival aspects never really causing too much concern. I played the game on medium so if you are looking for more of a survival edge to your experience it may be worth cranking up to hard from the get go.  As you explore the hostile planet it becomes clear this is not an empty planet at all as you start to uncover signs of civilisation. To not give away any spoilers I will not talk about this in detail but let’s just say that the bits of civilisation play a key part in the game’s narrative and exploration.  You have a number of other items at your disposal such as a teleporter which is useful for getting through gaps and up ledges and a beacon allowing you to return if you get lost in a cave. There is also a basic crafting system allowing the creation of items such as a fire torch but this never seemed to run out and could be out away in your inventory for use later.  The inventory system is actually one of my least favourite parts of the game. You can actually hold a lot of items and cycling through these can take a really long time. Especially when stood in pitch black trying to search through mountains of food and water bottles in search of the flaming torch.  Visually the game is gorgeous and contains some of the best weather effects I have ever seen in a game. The tornado and meteor showers that occasionally fill the landscape are awe dropping and were one of the first times in a long time I have been genuinely impressed by graphics in a game.  The pacing in the game is a little odd. The game is broken up into a series of “islands” connected by underground caves. These cave sections are usually one long corridor connected by a series of puzzles and these often felt too long to traverse. Equally while I get the idea of wanting to make the players feel like they are on a massive planet (even though we happen to crash land literally next to these alien structures) some of the outside areas are a little sparse and could do with being a little more densely packed with stuff to see and things to explore.  A few little gripes aside The Solus Project is an excellent adventure game that I enjoyed playing although I do feel that the game actually being a little bit shorter and more concise would have helped it in the long run.  This written review was taken from our original video review which can be found:   Here   [www.thegametutor.co.uk] ",
            "review_score": "1"
        },
        {
            "review_text": "So, I ended up really enjoying this game, which isnt typical of me and exploration games. The Solus Project sets a really good vibe from the start and looks absolutely amazing. During my gameplay, I ended up staying up too late a few nights during the week since I didnt want to stop exploring.   The only thing I'd like to see is a NewGame+ without having to worry about survivability and stats (increased speed), allowing pure exploration.  Anyways, if you get the chance, definitely pick this game up or add it to your wishlist for those steam sales. I also suggest getting it bundled with 'The Ball', also by Teotl Studios/Grip Digital.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Playing it in VR (Vive). It works great. A must have for people who love sci-fi adventure games. ",
            "review_score": "1"
        },
        {
            "review_text": "It's fun to play",
            "review_score": "1"
        },
        {
            "review_text": "This was a new genre to me, exploration/survival. I found the plot and world compelling enough to want to keep exploring. I found myself reacting in a very realistic way - fleeing from threats or cowering behind rocks to avoid the elements. I'd recommend the game to anyone who thinks they might like this type of game, it's a satisfying play for the money",
            "review_score": "1"
        },
        {
            "review_text": "If you have a VR HMD, go buy this game  You will really feel you're there, on that alien planet, with all its amazing day night cycles, weather events, dark caves and unnerving mysteries.   Large open worlds absolutely shine in VR, and more are desperately needed.   Now the game is not perfect, controls for the Vive are kind of unintuitive. Also, although it has been made clear that the game is about exploration and survival some more action would have been nice.  In any case, I hope to see more, in a DLC or a sequel. There are too many things left unanswered.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game - possibly my favourite game of all time. If you're an SF fan, and ever imagined living on a distant planet, this is for you! This is probably about as close as you will get to 'The Martian' film as a video game. After crashing, you are thrown in at the deep end, and must learn to surive before the harsh environment of this alien world kills you. You must find food, water, shelter &amp; tools, while dealing with temperatures that fluctuate wildly over the day &amp; night, and violent rapidly-changing weather. And just when you think you're managing to surive, the story takes some unexpected turns (you might not be alone...), which will see you travelling to new places, all the while struggling to survive. These continually provide you with new challenges, so you never get bored (nor find things getting too easy).  And despite being created by 'indie' developers, this is a HUGE game, with massive sprawling areas, and tons of gameplay. And the graphics are amazingly beautiful, while the sounds fit very well. It's taken me upto 33 hours to finish (probably less due to Steam counting time paused). (No doubt you could rush through it, and maybe finish it in half the time, but then I think you'd miss half the stuff &amp; have half the fun.)  But if you are looking for a first-person shooter (where you kill lots of aliens), or a horror game to scare you, then please look elsewhere! This game is about exploration &amp; the struggle for survival on an alien world, with a story &amp; several mysteries that you gradually uncover. There are definitely horror elements (especially later in the game), but it's not the central focus of the game.  On the down side, while the major plot points are voiced, much of the smaller parts of the story are told through tons of short bits of text scattered everywhere, which you can find &amp; read. I'm not a fan of this kind of story telling in games, and even though time slows down while you read them, time does still pass (especially as the text appears gradually), so it's harder to survive if you spend time reading them! What I now do is glance at the bits of text, which stores it in my 'Journal', and then occasionally pause the game &amp; read them from my Journal instead. At the very least the game ought to completely pause while you read the text. And I'd have preferred less individual bits of text to read (it's not essential but you will miss-out on the background story of how things ended-up as they are... which will mean you won't fully understand the ending of the game).  Another down side is that the game's performance can drop very badly after playing it for a few hours, almost as if it is running out of memory (due to a memory leak). Quitting &amp; restarting the game will fix that.  Apart from that, the game feels VERY polished. They must have play-tested it heavily, because although challenging, it's almost impossible to be completely lost or overlook something important. (Despite it's huge sprawling areas &amp; freedom to do whatever you want.)  I highly recommend buying this game, even at full price. It's massive value-for-money. Just don't expect tons of voice acting... Nor an ending that doesn't leave itself open to a sequel!",
            "review_score": "1"
        },
        {
            "review_text": "An interesting take on exploration and survival games. Very well done. The visuals, sounds and story all intermesh perfectly to make this a great game.  My only gripe was the lack of a mapping system. You would think that a civilization advanced enough to build starships and fly to distant planets would have the technology to incorperate a map in their hand held PDA devices. Does this ruin the game experience, not at all. But it severly handycaps the player that wants to explore everything and find all the misc items in the game. I give this game 1-1/2 thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "Very Nice game !!! Left me with alot of Imagination",
            "review_score": "1"
        },
        {
            "review_text": "The best Vive game I played!",
            "review_score": "1"
        },
        {
            "review_text": "Good game over all, I have only played in VR and it is obviously still in development yet still the quality of the game and visuals make up for the VR kinks and make this one of the few completly fleshed out games that support room scale VR.",
            "review_score": "1"
        },
        {
            "review_text": "Great experience, land on an unknown planet, see weird ♥♥♥♥, uncovering mysteries and get stalked by creepy alien babies. I might consider getting The Ball... ",
            "review_score": "1"
        },
        {
            "review_text": "Amnesia/Penumbra without horror. Interesting story with a twist.  Survival elemnts are more annoying than interesting.  You can as well watch walkthrough just for the story. Also detailed enviroment models should make this game great for VR, but havent tested it.  took me ~16 hours to finish it,  price-wise not exactly worth it. Game-wise it is worth of attention.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Vive review from a 1 hour play session.  First of all let me thank the devs by making this the first standing room only VR game that i have been able to properly play in VR. I have a very limited amount of space and most standing room titles require some degree of movement which i cannot perform. This is the first title i have played that allows me a full range of movement using the game controls to allow me to experience the game.  On to the game there hasn't been a whole lot to do so far in terms of actual game play. It is very much an exploration game more than anything, however exploring in VR changes the whole experience and i am looking forward to diving into it more and seeing what mysteries are hiding in the planet.  Overall if you have a VR headset and you want a game that is more of a compete experience this is a good place to start.",
            "review_score": "1"
        },
        {
            "review_text": "CV1 owner here.  I been playing for an hour or so after setting up everything to my liking so its too early to say anything about the story and such but, so far the (beta) VR experience is great! I mean, After this, I cant imagine playing a first person survival in a monitor ever again!   I finally settled on playing standing, using my head/body for turning and the controller only for forward/backward movement. No sickness at all. This is my third day with the Rift, its not like Im accoustomed to it or something.  With that movement schema I miss lateral strafing, I dont know If that would cause sickness but doesnt seem like it.  Other controls are a little ackward but perfectly functional (specially the inventory) The developer is actively working on it so Im sure they will come out with something.   Overall, I like it very much! If you own a Rift you MUST try this game!",
            "review_score": "1"
        },
        {
            "review_text": "Disapointed by No Man's sky ? This game is made for ya. A survival exploration adventure with great atmosphere. I really recommand it.  PS : This isnt an open world hardcore survival with nothing on a lost planet. This is a guided adventure with survival and crafting component. But a really nice one, you fill a bit guided but still have freedom to take your time to visit the planet and his dangers discovering secrets and tools to survive.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a real treat. As always, I advice to play at normal to get the best experience. Finished it in 19 hours but had to get help on youtube two times. As always, with these kind of games, I wish them to be longer. It's a good story, good graphics and interresting puzzles A great achievement and well worth a buy.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! I have been playing Osiris: New Dawn and liked it, but it was missing a compelling story. This game is very similar (in some ways) to Osiris, but with so much more. There are many areas to explore and stuff to collect, but no crafting of any consequence. Anyway, it is a massive open world of islands connected by underground tunnels. You are working on establishing communicaiton with your ship after crash landing on an alien world. So much to explore and collect. It can be a little frustrating that your pack is so small, but it makes you think about what you really need. A couple of suggestions: look around EVERYWHERE for hidden artifacts that can give you important boosts and keep the heating and cooling devices that you can make with the red and white light crystals.  There are no aliens to battle, but they seem to be lurking just around the corner. Exceptionally creepy moments when mummies follow you with their dead gazes and zombie baby doll things follow you around in the dark. If you like wondering if something is watching you, this is the game for you. There is even a killer smoke monster (think; Lost) that you have to run from or die.  The ending is equally creepy and scary, so I wont give it away, but be patient with the puzzles, they are very doable if you think about trying different ideas, using your teleporter, and looking for hidden switches. Youll need to keep any eye on hunger, thirst, and sleep. Sometimes, you need to sleep but cant find anywhere where you can sleep. Somewhat frustrating but lends to the realism.  This is a great game and you should be hooked, like I was. Enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Great game but I recommend it as part of the bundle with The Ball so you get the complete story.",
            "review_score": "1"
        },
        {
            "review_text": "Intense experiance in room scale. Little wobbly and the controls , I think, could be tweaked more. Overall, they are onto a great start getting it to work in VR. Really awesome concept",
            "review_score": "1"
        },
        {
            "review_text": "Good challange, great visuals and map design. 4/5 stars.",
            "review_score": "1"
        },
        {
            "review_text": "The Solus Project is a first person exploration and survival game, set in the distant future, after Earth has been destroyed. The last Human survivors are aboard a deep space colony ship, and the player is one of several scouts who have been sent out in search of a planet capable of sustaining life. After crash landing on your assigned planet, your goal is to stay alive long enough to repair a communication tower, and report back to the colony.  As you explore the planet, you need to keep an eye on hunger, thirst and exhaustion meters. Fortunately there's plenty of food and water to be found, and you have a large inventory capacity, so running out is never really a problem. You can sleep almost anywhere which also restores health.   The biggest danger comes from the environment, especially when you're on the planet surface, which is rarely a safe place to be. At night the temperature is freezing, and if you become wet because of rain or swimming through deep water, you can quickly die from hypothermia. Meanwhile, during the day, some areas are really hot, which can lead to death from heatstroke. You'll also occasionally encounter extreme weather anomalies such as tornados, lightning storms and meteor showers. When you venture underground, you'll find many hazards such as spike traps, land mines, killer plants, ice caves, acid lakes and boiling lava.  The developers have done a really great job of creating a planet that truly feels alien. As you explore deeper, you'll begin to uncover the ruins of an ancient civilization. You'll find massive buildings and machines, and historical records written in a strange language. And without wanting to spoil too much, you're not alone on this planet. There isn't any combat as such, you don't get any weapons, but there are things down there that want to kill you. I had one particular encounter in a very dark area that genuinely freaked me out a little.  You can find or craft objects to help you survive, such as torches to see in the dark or crystals to increase or decrease your temperature. There are hidden artefacts that buff your resistances to negative status effects. And you also get a teleportation device, which functions kind of like the old Unreal Tournament translocator, and can help you reach higher ledges or avoid hazards.   The game is let down slightly by a poor user interface and inventory system, which has several flaws. For example, when I was trying to collect some dried roots to combine with a lead pipe to craft a torch, the first thing you need to do is use something sharp to cut the roots down. I had two different sharp objects in my inventory, so the game popped up another menu to ask me which item to use, when it makes no difference. Having crafted my torch, I wanted to collect some more roots to keep in my inventory for future use. But when I tried to pick them up, the only interaction option I had was to set them on fire with the torch I'd just made. I had to drop my torch first, pick up the roots, then pick up the torch. Later, when my torch expired, I found out you can't combine two items in your inventory. I had to drop the roots on the ground, and then interact with it to combine with my pipe to make a new torch. Sure, none of this is game breaking, but its annoying, especially when you consider that there are lots of things to craft, so you'll spend a lot of time dealing with this crap.  I also find it strange that a society that has technology capable of travelling to distant planets, and a PDA capable of tracking life signs in real time and translating alien languages, doesn't have any way of recording map data. Okay, there are waypoints on the HUD to guide you through the main quest. But when I'm trying to thoroughly search the area for those artefacts and other secrets, sometimes its difficult to know which areas haven't been explored yet.  My final little complaint is that, whilst keys are rebindable, the game won't recognise my mouse thumb buttons, or mousewheel click. On a more positive note, I didn't encounter any bugs, and the music is fantastic, really intense and dramatic, especially when you're in danger. There isn't a lot of voice acting, but those small parts have a decent quality.  Overall, The Solus Project is a really interesting experience, which I give a strong recommendation for. Its a kind of sequel to the developer's previous game, The Ball, and although it expands on some of the story, you don't really need to have played The Ball to enjoy The Solus Project. (The Ball is also a pretty good game though, which is worth checking out). It took me 12 hours to finish, so the standard purchase price is fairly good value for money.",
            "review_score": "1"
        },
        {
            "review_text": "Best game I've played in years. A very good surprise. Excellent game with an astonishing atmosphere, a touch of psychological horror that makes you just anxious enough about what's coming next but the intrigue is so good you just need to keep going and know what's happening. Really got hooked on this one !",
            "review_score": "1"
        },
        {
            "review_text": "really enjoying not playing this in VR! its a solid exploration puzzle game with great atmosphere, environments and fairly interesting story. tried it in VR, got dizzy, now playing it normally on my ultra-widescreen and it's kept me occupied all night so far.  the survival mechanics are not too punishing on normal difficulty but you do need to keep an eye out in weather or at night - you can die if you are more than a few minutes away from a cave and haven't set your 'quick escape option'. food and water is easily found however.  it's a bit like a scifi amnesia but not as scary.",
            "review_score": "1"
        },
        {
            "review_text": "So my friend came on, restarted my game then somehow screwd himself over. 11/10 vr game",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game, just one small flaw i think. The torch you make in the beggining will last forever. It always stays lit unless put under water but otherwise it seems to not burn out. great game though.",
            "review_score": "1"
        },
        {
            "review_text": "Ok so everyone knows what I'm going to shout so go ahead and shout with me starting   1....   2....   3....   SEQUAL!!SEQUAL!!SEQUAL!!",
            "review_score": "1"
        },
        {
            "review_text": "This game captures the essence of a puzzel survival game the story may be a bit repetitive but each time around you get new challanges and the story has nice twists and turn great game and worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a mild horror game with exploration at its core. It's a fun survival game that's not to hard to balance. Food and water come often so it's not to easy to starve or get dehydrated. The story is pretty good as well! Only issue I've had is once I got through the second temple I cannot progress any further. Everytime I hit the loading screen the game freezes and loops the loading animation and song. Not sure if this is a problem with the game itself or with my computer. I'll look into it more and update this review when I find the solution",
            "review_score": "1"
        },
        {
            "review_text": "I reccomend this highly to anyone who enjoys a good story. The atmosphere created by the dev team is f***ing great and the plot keeps you interested and wanting to learn more about the strange forsaken planet you find yourself on. Totally worth it's small price tag and a very enjoyable experience. I would really like to see more games focus on the kind of things that this game kept close at heart.",
            "review_score": "1"
        },
        {
            "review_text": "This was one of my best gaming experiences of 2016. I've seen other people say that playing this game is similar to being captivated by a great book. Where you are being guided through a journey but the exploration never feels predictable or tiresome.   While completing the puzzles aren't incredibly challenging the reward of new lore and areas is very rewarding.   I did play this game traditionally but I have seen that most of the VR reviews aren't the greatest at the moment. That shouldn't deter people from picking this game up. It's definitely worth the price of admission.   ~Beware dark clouds~",
            "review_score": "1"
        },
        {
            "review_text": "Got this game on the June sale and I have to say this is 100% worth the price for the amount of content here.  Without giving too much away the atmosphere of this game is great and a lot of detail was put into the design of the alien world.  While the VR component is pretty new there are a few niggling interface issues but nothing that would stop you playing the game solely in VR. I'm 7.7 hours in and have been having a great time. I don't tend to get VR sickness so the locomotion has been fine for me.  It would be great if the inventory system was a bit more fleshed out that next/prev item.",
            "review_score": "1"
        },
        {
            "review_text": "The Solus Project is a sci-fi exploration/survival game set on a distant, seemingly uninhabited planet that you've crash landed on. Despite very little dialogue, or substance to the story, my early access to this game still managed to suck me in.  PROS:  - Beautiful, immersive environment, atmosphere, sounds and weather. The juxtaposition between the dream-like cosmic surface world and eerie, cryptic caves is well done. The weather system is dynamic ,and at any point you can experience meteor showers, rain, earthquakes, temperature fluctuations, all which have an effect on your characters well being.  -The survival feels intuitive. A PDA companion gives you lots of great vitals on your body, survival status and environment such as body temp, humidity, sleep/energy levels, weather temperature etc. What makes this great is that every little thing affects these vitals accordingly. Get wet from a rainstorm or swimming in the ocean? Your body temp will lower and you'll become at risk for hypothermia, but you can bust out a torch or start a fire and watch it come up in response. There are plenty of other ways to help maintain homeostasis. Tons of little things like this make you feel like you're actually surviving on a strange planet.  -There is an in-game adjustable difficulty. Want to mainly explore without worrying about dying of thirst? Slide it down for an hour, seamlessly. Want to have a complete immersive experience with no objective markers or help markers, and a completely hardcore survival difficulty? There's an option for that too.  -Exploration is rewarded. The different areas are littered with bits of lore, random items which may or may not be useful (I've found everything from a teleport device to a solar-rechargable flashlight), 'relics' which can boost various survival stats, things that give you temporary buffs, crafting and survival supplies, small puzzles and other random stuff which never gives a dull moment.   NEUTRAL: - No immediate combat. There doesn't appear to be any enemies thus far in the game, thus your only enemy is surviving and not falling to death.  - The game is not completely open-ended. You are free to explore each area, which is rather large and packed with secrets, but ultimately there is an end goal/story of establishing communication which will lead you from one area to the next.   CONS:  - This is a fresh early access game, so expect about 4-6 hours of content from this first piece of the game, as well as some bugs which will cause the game to occasionally crash, thus losing any progress between saves.   VERDICT:  An extremely promising game with a lot of fun aspects and potential. Worth supporting through early access. The beautiful environments, rewarding exploration, and cryptic lore leaves you wanting even more. I can't wait for them to add more content.  ART/DESIGN/MUSIC: 9/10  GAMEPLAY: 8/10  STORY: 8.5/10   25.5/30 - Should be near the top of your wishlist if you're a fan of survival/space/sci-fi",
            "review_score": "1"
        },
        {
            "review_text": "I'm a fan of sci-fi and good storylines.  Latter is built up by happenings and small pieces of text which can be found through the whole journey. These texts tell you the story of the planet as well as the story of your character. So take your time and explore this very detailed world and try to find as many hints as you can! The graphic and gameplay is made detailed and 'realistic' as much as possible but doesn't causes despair. I love this kind of realistic hard sci-fi. Very much fun and therefore a very Good Game.  Hint: Play 'The Ball' beforehand. While it has a slightly different gameplay, it is set in the same universe and connects to the story.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game but i hate the ending.",
            "review_score": "1"
        },
        {
            "review_text": "I play this in with a Rift. It's just amazing standing on an alien planet, like something I dreamed about as a kid and this is as close as I'll get.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good exploration game if you like atmospheric games. A few mechanical issues with the crafting and controls, but nothing super major. Also some slight pathing errors with some of the events in the game. Really enjoyable if you like old school secret hunting and a decent survival challenge.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, and I highly recommend playing it. Well worth the 20 dollars. The only negative I will give this game is the bugs it has right now. As of now I am currently unable to progress through the game due to a loading screen freezing my game.",
            "review_score": "1"
        },
        {
            "review_text": "Albeit slightly less optimized than I expected, on my gtx970 this game looks and feels absolutely gorgeous, with everything from the natural (and unnatural) landscape to the weather catastophes to the phenomenal star patterns and literally everything inbetween. If a game has ever made me want to buy VR, this would be it. Side note - patience is a virtue, especially when exploring.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! It is the best PvE survival and exploration game I have ever played.  Whether it's the exploration of the deep underground caves and tombs or the survival in the inhospitable weather conditions outside, it kept me glued to the screen for a very long time. The atmosphere and graphics are amazing. Can't wait to play this in VR :)",
            "review_score": "1"
        },
        {
            "review_text": "This is the the most engrossing VR experience I have had to date. The visuals, the colors, the sense of being on another planet is awesome. Even though there are some VR bugs at this time, I am enjoying it too much to care. I did not have motion sickness.",
            "review_score": "1"
        },
        {
            "review_text": "Respected this game so much. A must have.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Finally what seems to be a real game for VR. Judged from a few hours play I find it very complete and very beautiful. A must have if you have HTC vive...  It is an exploration survaval game though not an action fast paced thing.",
            "review_score": "1"
        },
        {
            "review_text": "Good enough for the price. Suggestion for the game, the lighting in this game really sucks ruining the might of UE4. Need approvement.",
            "review_score": "1"
        },
        {
            "review_text": "[VR Review]  I got a Vive VR headset, and this was the first game I wanted to try it on. Anyways, first impressions were very good - the VR experience is very amazing. The controls took a bit of getting used to (although keep in mind that this could just be because I'm new to VR).  My current graphics card is an AMD Fury, but even with that I had to lower the settings to around medium quality overall to stop the framerate tearing I was seeing. The calibration and aiming controls for interacting with the environment work well, and I ran into no problems with those.  The only major issue I had was that I could not figure out how to open the inventory. All the other buttons worked correctly (i.e. interacting, movement, jumping, etc.), but no matter what I tried the inventory button wouldn't work. I may have been using it wrong I suppose, but I doubt it, as I'm already very farmiliar with the gameplay of The Solus Project. The radial menu for inventory opens correctly for crafting and interacting with other objects, too.  But besides that one issue, it's a truely excelent VR experience!   ------------------------------------------- &lt;ORIGINAL NON-VR REVIEW&gt; [The review was getting so many edits to it, and was getting really messy, so I'm doing a complete rewrite...]  First impressions were a bit clunky - it took me a while to get used to some of the controls and elements of the game, but I started having fun after that with a lot of the puzzles. The game reminds me the most of 'Myst/Riven', and the puzzles are somewhat challegning. That being said, the 'challenege' of the puzzels is mostly the challenge of finding the next switch far too often lol...  In any case, if you are looking for an atmospheric puzzle game with a deep intriguing story, I high heartily recommend this game. It is a lot buggier than any other 'Early Access' game I've played, though.  Some of the biggest annoyances for me are that you get ONE save slot (which can be TERRIBLY gamebreaking for any number of reasons when a save occurs at a TERRIBLE time), and there is no real way to completely turn off the 'survival' elements of the game for people (like me) who would much rather just 'explore' without having to manage an absurd amount of 'survival' elements...  Additionally, the falling damage is ABSURDLY unfair and broken - your legs must be made of chewed up toothpicks, because a 3 foot fall causes falling damage ffs, and it scales in damage EXPONENTIALLY fast, so that anything above 15 feet or so just plain up MURDERS you.  THANK GOD that the collision detetction is ETREMELY sound, so at least I'm not dying because I slid down a slope all the time like some other games I could mention! n.nU  On the plus side, it's SO REFRESHING to see a game that DOESN'T use 'invisible walls' all over the place (the ONLY time I ever ran into one was when I tried to swim very far out into the ocean, and I guess that's fair - it's hard to come up with any other way to add a barrier in that situation).  Also, the game runs flawlessly in 'Fullscreen Mode' - it just freezes up and lags like mad in 'Windowed Mode'.  So I DEFINATLY recommend you try this game! I've been wanting a fun and challenging puzzle game for a long time (one that DOENS'T include tons of 'horror' elements, whcih all the morte recent ones usually have, sadly...).",
            "review_score": "1"
        },
        {
            "review_text": "Chosen to save humanity traveled the stars in a spaceship crashed on a planet went into a cave crapped my pants  10/10  would crap pants again",
            "review_score": "1"
        },
        {
            "review_text": "Heat stroke during the day, nearly froze at night, made a campfire, took a nap, rudely awakened by a meteor shower (the bad kind), then had a tornado hunt me down (I swear it homed in on me.) ....all that in a span of 10 minutes.  10/10, would ♥♥♥♥ bricks during another night of terror.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, fabulous graphics.",
            "review_score": "1"
        },
        {
            "review_text": "**Update** YES! Fantastic, so much better - this is the only long-form game you'll find for the Vive so far, and it plays so well with the new improvements!  **Updated** Still Not quite ready for Vive just yet.  This game definitely has potential - the intro is really cool, and the environments (what I've seen so far) look pretty good.  However, this game isn't quite Vive ready yet - here's what's broken or is needed to get this ready for a Vive release:  Different movement scheme - a simple point in the direction I want to go and click and hold the touchpad to walk in that direction would suffice. As it is now there are several movement options, all of which rely on treating the touchpad like a joystick, and none of which work well. Don't do this - it's confusing (especially when trying to suss out how head-decoupled steering should work - the point and click method above gives you that 'for free')  Inventory - there is no UI (in the vive, not sure about on a monitor). Cycling through the inventory is no good. Check out Call of the Starseed's backpack system - it's pretty straightforward, and doesn't require any additional buttons.  Having the tricorder thing in one hand with all the info is cool - but why is that the only thing I can have in that hand? I should be able to pick up anything with either hand and use it (so the control button maps should be symmetrical).  Don't need a crouch button. I understand that physically crouching will be difficult to resolve (adjusting the colliders in UE4 dynamically... I know), but don't do it with a button.  So, for now, if you want to play on a monitor or seated VR with a controller, it seems fine, but with the vive controllers, it's not quite there yet.  Other than that, from what I've seen so far, fantastic job! I'm looking forward to updates!  **Update 1**:  This last update did some to improve the experience, but it still isn't quit there yet.  Movement:  - Teleporting is good, however it breaks a few places in the game (I can teleport through barriers that I clearly shouldn't be able to). Personally, I don't mind 'artificial locomotion', and in this case I would prefer it if when you pressed forward on the left touchpad, the pawn moved in the direction that the teleport marker is facing (since this faces in the direction the controller is facing). This would allow the movement not to be locked to the head rotation or the 'forward' vector of the play space (the latter is super unintuitive). This might not suit people who are more prone to sim sickness however, so the teleporting is good - but I think it's resulted in a few content bugs.  Tutorial  - It's helpful, and informative, however, reading lots of text in vr is unpleasant. A show-then-do approach might be better - similar to the beginning of the game instructing you how to build a torch.  Control Layout  - I still feel like a more symmetric approach to the control layout for the vive is better - I keep having to refer back to the control layout diagram to remember how to do things. This might mean removing button-based interactions in favor or more 'physical' interactions, which generally 'feels better' in VR than complex button mappings.  Glad to see the progress though - I'll definitely keep watching for updates!",
            "review_score": "1"
        },
        {
            "review_text": "I am really sad to give this game a thumbs down, I had very high hopes for it because I found the idea of a non-violent planet exploring game where you fight the elements interesting, unfortunatly, it's not that fun. Not a whole lot is happening, you do a lot of walking to find stuff and combine stuff, and that's about it, that's the gameplay. You gotta keep dry, warm, drink, eat and sleep, that's great, but apart from that, you just walk, find things and combine them. This is the problem with a no-combat game, you have to substitute the combat with something else or you end up standing next to a campfire doing nothing and waiting to get dry.  Tl;dr: It's boring. Yes, I knew from the start that it's 'one of those games' but I don't like it. I find it neither challenging, nor engaging.  Also, I got stuck in a dark cave that I didn't know had water in it, I lost my torch and couldn't teleport out, which was very annoying. This pretty much rekt my playthrough and I had to decide then and there if I want to continue or else I couldn't get a refund if I started all over again. I decided no.",
            "review_score": "-1"
        },
        {
            "review_text": "Boresome, beautiful, linear. The opposite of an open world. For such a great game, see Subnautical and Planet Explorers.",
            "review_score": "-1"
        },
        {
            "review_text": "In VR, the game is incredibly bad performing. On my system it runs with &gt;60 fps on highest settings at 1920x1200 in the normal mode, but in VR it's stuttering when I go beyond the lowest settings. VR needs a serious performance update to be feasible. Lowest options will make UE4 (one of the most advanced engines in existence) look worse than UE2 from more than 10 years ago (which is not exactly furthering the immersion), stuttering will get you motion sickness.  Games of this kind have to be played standing (except you have a solution for the headsets cord wrapping around you and your seat), without being able to freely rotate you will get uncomfy very fast. The devs are working on the neccessary adjustments for inventory handling, but at the moment they are not released and you have to rifle through all your pesky items every time you need something. The VR controls do not allow strafing (walking sideways), which is very annoying as you have to rotate all the time to make a step around an object (which may give you a headache over the time), will hopefully be fixed soon.  While The Solus Project offers an interesting world to immerse yourself, the technical side of the game in VR is severely lackluster at the moment. I'd recommend to put it on your wishlist and wait for the neccessary patches to be implemented. Review will be updated as the game was.",
            "review_score": "-1"
        },
        {
            "review_text": "Review for VIVE version only, this is no reflection on the base game which by all acounts looks pretty fantastic.  I'll get this out of the way first; If youre buying this to play purely on the Vive, unfortuately I do not recommend the game in its current state, for a few reasons:  - Many of the interaction nodes are superfluous. For example, if im holding the torch in my actual hand, theres no need to have an extra step to trigger the combination with the oil container - i should just be able to dip it in myself. Same goes for many of the other cutting/combining actions.  - Similarly, a crouch control is unneccesary when I have full freedom of movement in real space  - The scale of many items, as well as the terrain is far to too large. The PDA is a prime example, appearing approximately a foot long! I can move the thing up to my face so it doesnt need to be that big  - Inventory management seems unnecessarily cumbersome with the current contol scheme - this is the main thing putting me off at the moment  - It would be nice to have proper positional audio for the PDA (environmental sounds are already vaguely positional), as currently it appears as though the messageas are coming from inside your head rather than from the PDA itself and this is initially disorientating. (As an example, in the game Call of the Starseed, holding the tape player up to your ear sounds as if the tape player is really next to your ear)  - I can walk though walls (again, Call of the Starseed solves this problem quite well)  In summery, if youre buying this to play on the Vive, wait a while untill its a little more polished, as in its current state it is not likely to be an enjoyable experience, in my opinion. Ill be sure to check back later to see how this develops as the gme itself looks rather good!",
            "review_score": "-1"
        },
        {
            "review_text": "This is my fourth time checking the game out and the fourth review I am writing. Still negative sadly. I keep trying to give it a chance but it only slaps me in the face with new bugs every time.  This time around it threw me about 4 saves back so I was supposed to repeat the annoying 'push huge rocks around' puzzle and then repeat about 90min of gameplay. This game, along with the insufferable load times, just knows where to push the buttons for frustration.",
            "review_score": "-1"
        },
        {
            "review_text": "Decent game, good graphics, seemed like a good story. Only problem is, the game consistently and I do mean CONSITENTLY not only crashed itself, but instantly rebooted my entire PC. Core i7, 16GB RAM, 1TB SSD, GTX 980, all latest drivers in Windows 10 and nothing helped. And I'm not referring to a crash every once in a while, but every few minutes. Over 12 reboots in less than 3 hours. If this was a BETA or Early Access, I could understand be sympathetic....but it's NOT. I had hoped to try and see how the game worked with VR, but it wouldn't even run normal.",
            "review_score": "-1"
        },
        {
            "review_text": "I played for ~3 hours and made some meaningful progress in the game, but I honestly just didn't like it.  I didn't have any fun exploring the world. The survival component was simplistic and tedious, and it detracted from exploration rather than contributing anything desirable to the gameplay. I also didn't find the world to be immersive or suspenseful or even particularly aesthetic. It felt transparently artificial. I was not amused by any of the puzzles either.  ---Who Might Enjoy This Game?--- If, in the year 2016, Myst still excites you as much as it excited people in the early 90's, then you might enjoy this game. But even *if* you're part of that niche, I actually think you may prefer The Witness, which I thought was a much better game than this. I can't strongly recommend The Witness either, but insofar as open-world puzzle games go, I think it succeeded in all the ways that I wish this game had.",
            "review_score": "-1"
        },
        {
            "review_text": "Controls are too restricted and unintuitive on the Vive. Allow the option for free rotation and free movement and I will repurchase immediately.",
            "review_score": "-1"
        },
        {
            "review_text": "After completing this game I am left with a feeling of having endurer. It was grind, the Forward Vector guidance was about as useful as the wife with map reading, without the arguments just vague 3 dimensional directions as to the end point in relation to current position, except when it decided to disappear. I felt I spent most of my time not knowing where I supposed to going or what I was susposed to be doing when/if if got there. The game didn't flow or lead you through a stor, it happened around you and you got snippets.  There is a good game in ther but it fails to deliver by simply presenting too many WTF am I supposed to be doing now moments. However if you are prepared to live with the vagaries it has some good stuff in there.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is not designed for roomscale as described. I was willing to give translation movement another try, but this game's controls are not up to the task. At best you can press forward to walk in the direction you're looking, but straffing is still locked the left and right of your playspace. Absolutly terrible. This is not a game designed for VR.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has serious performance issues in VR. It constantly stutters even with my GTX 1080 and medium settings. Not to mention the controls are awful. I played for about 20 minutes in my Oculus Rift and felt nauseous. I still feel like I'm swaying. First game I've ever asked for a refund from Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Sadly this is just not working for me. Looks like it could be fun. But the VIVE controls seem almost random. I've read through the discussion and still couldn't manage to get to the point where I can make a torch!  Have to refund. I would like to try this again in a few months time after some better VIVE reviews come along.  So not for VIVE users.",
            "review_score": "-1"
        },
        {
            "review_text": "This is ported to VR worse than No Man's Sky was ported to PC.",
            "review_score": "-1"
        },
        {
            "review_text": "I played the normal PC version.   This game is basically a frustration simulator with some terrible design decisions that prevent it from being an enjoyable experience. The premise of being an astronaut stuck on an alien world having to explore and use your ingenuity to survive is an enticing one and here the developers have created a beautiful looking and sounding world to wander.   However, I have played for three hours now and have become increasingly frustrated by the janky movement and jumping mechanics, the regular occurences of being stuck in the environment with no way out (except to reload your previous safe) and dying because your character's spacesuit is not hardy enough to tolerate a 6 inch drop. The worst moment was probably exploring up to the top of a mountain and dropping down into a secret cave below full of giant shells. I found some new items there and an interesting headstone but when I went to leave I found there was no way out of the cave. 45 minutes later and I had to reload the game and lose those items and the time I spent. That kind of thing is just not fun and I simply don't have time to play a game that punishes you purely for doing so.",
            "review_score": "-1"
        },
        {
            "review_text": "This SUCKs so badly in VR. they most not have focus alot of time into that but i will look forward to when they have.",
            "review_score": "-1"
        },
        {
            "review_text": "i bought this and returned it, the hand gadget was very difficult to read, it seemed alright at first until the story is told by a million peices of torn up paper on the ground you have to read through the crappy hand gadget. then during the tutorial you have to cut down vines that you cant cut down easily with a tool readily avaliable 5 minutes into the game, probably because I teleported past a net with the vive controllers. overall, this is a trash game for PC we know that, it showed VR promise, but it has a LOT of bad ideas that make the experience tedious and not enjoyable. Im here for an engaging experience in VR, this game did not come close to providing. tear up a book and leave it on the ground in your room, its about the same. #refunded",
            "review_score": "-1"
        },
        {
            "review_text": "boring, pointless walking simulator (supposedly a survival game but surviving is almost automatic unless you really let yourself die) set on what is perhaps the least interesting alien world ever designed. Got tired of it rather quick, and i usually enjoy the genre.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't want to be overly critical, but I was unable to continue forth with this game. On my vive, the navigation quickly turned my stomach. I've logged plenty of hours with my vive across 50 different games and experiences, but this was the first to make me feel uncomfortable.  The visuals were also not on par with what I would hope for $20. The abundance of small text seems like such a poor choice for a VR game, and staring closely at my hand to read quickly removed me enjoying the world around me. I may have been willing to push through the queasiness if the game had been more instantly engaging, but unfortunately I will be requesting my first Steam refund ever.   I'm sure many people will enjoy this but I personally would spend that $20 elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "Tremendously poorly designed game. I spent the first several hours getting stuck between pillars in the I'll design environments with no way to get out. Forced to restart the game because there is no way out and my save stuck me between the pillars. Beyond dissapointing experience.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has a crouch button. If there's a crouch button it's not VR (unless it's a hydraulic wheelchair simulator, which this game is not). The Gallery does a MUCH better job at VR.",
            "review_score": "-1"
        }
    ]
}