{
    "app_id": 313690,
    "name": "LEGO® Batman™ 3: Beyond Gotham",
    "release_date": "2014-11-11",
    "developer": [
        "TT Games Ltd",
        "Feral Interactive (Mac)"
    ],
    "publisher": [
        "WB Games",
        "Feral Interactive (Mac)"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "LEGO",
        "Batman",
        "Adventure"
    ],
    "achievements": 70,
    "positive_ratings": 2269,
    "negative_ratings": 375,
    "price": 19.99,
    "description": "The Caped Crusader joins forces with the super heroes of the DC Comics universe and blasts off to outer space to stop the evil Brainiac from destroying Earth.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/313690/header.jpg?t=1552479434",
    "minimum_requirements": "OS: Windows®XP SP3, Windows Vista/7/8 with latest service packs and updates installed Processor: Intel Core 2 Duo or equivalent AMD dual core CPU Memory: 2 GB RAM Graphics: NVIDIA GeForce 7600GS or ATI Radeon 1950, 256 Mb RAM DirectX: Version 10 Network: Broadband Internet connection Storage: 10 GB available space Additional Notes: Windows XP and DirectX® 9.0b and below not supported",
    "recommended_requirements": "OS: Windows XP/Vista/7/8 Processor: Intel i5, 4 x 2.6 GHz or AMD equivalent Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 480 or ATI Radeon HD 5850 or better, 1Gb RAM DirectX: Version 11 Network: Broadband Internet connection Storage: 10 GB available space Additional Notes: Windows XP and DirectX® 9.0b and below not supported",
    "reviews": [
        {
            "review_text": "Long story short, the game is a lot of fun. Short story long, if you hate lego games there is nothing for you here. If you hate lego games and are a fan of DC comics, you MIGHT find this game enjoyable as it does delve heavily into the DC worlds. Now here are my thoughts on the PROS and the CONS:  PROS: -Voice acting is top notch -Fun with friends -Ton of content -Every character felt like they were treated with love and care as they each have their own unique reticle unlike Lego Batman 2 where all the side characters had a generic reticle.  CONS: -Listening to Conan O'Brien can be annoying as he repeats himself every 10 seconds -Story is not the best -Repetitive gameplay (as expected with all lego games) -The free roam worlds felt empty and lacking the emersion of Gotham from Lego Batman 2  OVERALL: -Great game 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I bought Lego Batman 3 during the christmas auction. It was a steal and I am glad I did. However, I wouldn't advise you to pay full price just yet.   Batman 3 is the sequel to Batman 2 (duh) and shifts the series' focus further from Batman and more onto the Justice League and the DC universe in general. It also extists purely to not fall behind on Marvel because all the gameplay additions made in Lego Marvel over Batman 2 can be found copy pasted into three. Anyway, the regular production values from Tales give a good show. The evil Brainiac has come to Earth to shrink it and to collect it. He kidnaps the seven Lantern corps leaders and uses them to power his beam weapon. Up to the heroes to stop him. Once again you punch and puzzle your way through the DC galaxy collecting bricks, figurines and powerups to stop Brainiac.   The thing plays like a lengthy cartoon episode and is certainly fun when played with a partner. Be it your sibling, offspring or spouse. The selection of characters is considerable, with virtually every franchise providing at least five representatives. Unfortunately, the powers and abilities are all pretty much standard fare by now. Nothing really new is introduced from Marvel. Some characters feel downright lacking (lantern corps can't even light a dark room. LANTERNS!) Still, it is a funny game to buy and play at a discount. Especially if you're a comic buff. The game likes to reference its own past even includes Adam West from TV.  Unfortunately, it reeks of bad business practices. The main menu greets you with a wealth of DLC that can be unlocked for rather unreasonable prices. Most packs contain about 20 batmans and a single stage. Not much to write home about, so you can do without.",
            "review_score": "1"
        },
        {
            "review_text": "This is yet another great LEGO game. I have played LEGO Batman 2 but the flying mechanics are horrible in that game; in this one the machanics matches the LEGO Marvel game. For local co-op games with little ones this is a must have.",
            "review_score": "1"
        },
        {
            "review_text": "Crashes &amp; bugs. This game has a few.  Those aside, pretty decent storyline, good amount of exploration available.. What I enjoyed most however, was discovering characters I never had even heard of in the DC universe.  Other than that though, your average Lego game, doesn't really compare to a good Star Wars Lego game, but it's good enough. Also the DLC for the game is pretty naff, not really worth it.. If you want all the achivements though, get them on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game has allot to do with the main story and has aplenty of DLCs that expand the game with more playable characters and some new levels where you get to play with the DlC characters and then with any character in free play mode.",
            "review_score": "1"
        },
        {
            "review_text": "Unlike previous LEGO batman games, this one talks down to the player more-so than the previous games, but the story itself is quite fun as a way to get those who know little of the DC universe can learn about the many different planets of the different lanterns. The game itself had some launch issues, but appears to be working much better these days.  I love the inclusion of Batman Beyond characters and the massive worlds where you can search for new character tokens, golden bricks and costume peices can lead to many, many hours of play and if anything, this game got me to re-watch Batman Beyond: Return of the Joker after I finished it, though I disliked their portrayal of Brainiac where in the second game the hint for Brainiac was kind of intimidating where as in this game he's every two dimensional villain who only wants to bottle up worlds and not digitise them into information like the real Brainiac...despite attempting to do that to the main characters who attack him.  It's still worth a playthrough though, but only on cheap with all the DLC giving you access to many different and fun characters to play as in free play mode.",
            "review_score": "1"
        },
        {
            "review_text": "This game is annoyingly fun. Quite possibly my favorite lego experience since Lego Star Wars. Incredible amount of characters, and really, who could resist Daffy Duck as a Green Lantern?",
            "review_score": "1"
        },
        {
            "review_text": "This game tops the list as one of my favorite LEGO franchise games",
            "review_score": "1"
        },
        {
            "review_text": "Lego Batman 3: Beyond Gotham is another great adition to the Lego series of games and features a vast amount of characters as per usual. With this being DC we have the return of other previous characters from the previous title and the known DC universe as well as new characters. The story is very well constructed yet I was dissapointed on the portrayal of Braniac when comparing him to the DC comics and films.   Credit goes to the designers as they have carefully inserted lesser knwon but amazing characters with great backstories as well as witty little remarks and jokes that in some cases only the die hard DC fans will get. Although the gameplay is fun and you'll get hours out of the game there is the case of replay value and repetition. Freeplay offers around another 8 hours of play depending on the player and is even better with a friend but as with most Lego games there is repetition which deters players after a while.  Having played the game thoroughly and completing it several times I was very pleased with the time I spent on the game, there are some features that could do with looking at or improving but not by much. Despite these very small issues I would definately say give the game a go. In my opinion it's a solid 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Cracking game. Shame about the no city free roam, but there's so much to do you won't really miss it",
            "review_score": "1"
        },
        {
            "review_text": "I've an affinity for many of the Lego Games, most especially the Lego Marvel Superheroes game, which happened to have the best combination of open world with smooth controls, hilarious dialogue, and just looked sweet!  Batman 3 Beyond Gotham iterates on the system. I've played/own a ton of Lego games, and I gotta say that with Batman 3, it's really apparent how TT's matured much of their control scheming and gameplay 'modes'. Comparitvely, flying is a lot smoother than it was in Batman 2, and I think they've taken a lot of the critical feedback to heart and really optimized the game well. I haven't had many frame stutters, and I'm running max settings all around.   I really appreciate the suit changing system too, which in Batman 2 involved you finding a suit changing station. That was pretty tedious to say the least, but Batman 3 makes it much more fun by allowing players to switch to the various suits at any time simply by holding a button down (Y, if you use an X360 controller).  I haven't spotted any errors/glitches, and I haven't touched Open World yet, but if it's anything like it was in the Marvel game, it's gonna be awesome. Really, I'm only a few hours in, but already I can see myself repeating my gameplay for a long time! Looking forward to seeing TT fold these new iterations into the next Marvel Superheroes 2!",
            "review_score": "1"
        },
        {
            "review_text": "I think this is lego...",
            "review_score": "1"
        },
        {
            "review_text": "How can a LEGO Batman game run and play better than Arkham Knight and be better that AK? o.O  Anyways, it's the best LEGO Batman game so far. Funny story, same gameplay we like and the inclusion of so many DC characters is great addition. Still, pick it on sale.  And the best DLC level is the Arrow level. And Kevin Smith rocks.",
            "review_score": "1"
        },
        {
            "review_text": "This game has the largest amount of characters in any lego game yet! The free play is more about several small planets to explore, instead of one big city. I has just about every DC character you can think of (and some you'd never think of) plus a new stimulation room and an awesome bonus level!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, follows the Lego game formula but expands the Hub worlds to have more gameplay. Would highly recommend",
            "review_score": "1"
        },
        {
            "review_text": "8/10 Great game, but it lacked the open world adventure.  PROS: Nice graphics LOTS of playable characters Smooth gameplay Great customisation Interesting side quests I love how the moon and the lantern planets are ROUND and not endless.  CONS: No open World Levels could be better Some things took a long time to figure out Infinite jetpack fuel would be nice  All in all, it's a pretty good game. Definately worth 30 dollars.",
            "review_score": "1"
        },
        {
            "review_text": "very fun to fly around as a bigfig character and the DLC is amazin",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game cannt beat all the content love it!",
            "review_score": "1"
        },
        {
            "review_text": "Kinda disapointing, not the best lego game but it is still a solid lego game ",
            "review_score": "1"
        },
        {
            "review_text": "Worst Arkham game for sure",
            "review_score": "1"
        },
        {
            "review_text": "Good Game so far. But i pre-paid for Premium Edition with all 6 DLC packs and dont think i have got them yet. ill have to check again soon",
            "review_score": "1"
        },
        {
            "review_text": "classic lego game always good",
            "review_score": "1"
        },
        {
            "review_text": "I thought that it was going to be OK but then I was amazed by the amount of things you can do. (It brings Lego games to a hole new level)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game im having a ton of fun playing this. If you're an adult thinking of getting this get it ,Im 26 years old and this game is for everyone and is worth every dollar you pay. Very fun game and pretty graphics awesome gameplay and lots to explore with an awesome story. Would recomend highly to others.",
            "review_score": "1"
        },
        {
            "review_text": "Lego Batman 3 is an awesome game.  If you're a Lego fan then this is a game for you.  Pros:  -Good Replayability -Good Puzzles -Massive ammount of playable Characters -Great level Design -Quests for after Game completion. -Story is good -2 player fun!!! -Good dlc -lets you explore the lantern planets. -Daffy Duck is a Green lantern. BAAAAT COW!!! moo -Great improvement on Graphics since legobatman 2.  Cons: -Many Many Glitches.  -The lantern planets feel empty with no people or vehicles. -Bad Controller Support(just use the friggin keyboard) -Story is short.  Overall it is a good game 8.5 out of 10. If you are a lego or dc fan this is a game for you. JUST DONT PlAY WITH A CONTROLLER.",
            "review_score": "1"
        },
        {
            "review_text": "I'm new to this game and I started playing but after a while I quit the game(thinking it would autosave) and left the game. then I realise I did not save, but the problem is how to save? can you save inside the game or must you download something cuz I cannot find the save button in the game :((",
            "review_score": "1"
        },
        {
            "review_text": "took them several months to fix this issue so im changing to recomended EDIT: SOLUTION TO GET CONTROLLER SUPPORT IN MY CASE I HAD TO SWITCH from XInput (X) to DirectInput (D) while playing, flick the switch to D mode a screen will pop up saying controller disconected but just press enter on the keyboard and use the keyboard to go into control configuration. Once in control configuration select change device and tap a button on the controler and then the game should auto fill in the remaining buttions. finally click accept and you will be good to go.  The main problem with this is while playing the game does not use the Xbox controller button colors and button referances like it will say use button 4 or 3 and not Y or X with its associated color which will be a problem for my kid. THIS PROBLEM NEEDS TO BE RESOLVED AND WILL NOT CHANGE MY RATING UNTILL IT IS.  This game will not work with my Logitech f710!!!! It make no sense because it works with all of my other lego games so... there is some bug in this software!!!  This is a pain becuse all other games, INCLUDING PAST LEGO GAMES, use D input now have to switch between the modes to get other games to work!!! FIX THIS!!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome! Takes some getting used to the controls, but once you have, you will enjoy this fun game.",
            "review_score": "1"
        },
        {
            "review_text": "A nice little LEGO game, the only thing I hate about this amazing build is that you can't go to the open world after you finish the main story. It sucks since if you've bought the season pass or any DLC, you can't use it until you finish the main story. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        },
        {
            "review_text": "Flew around as Batman killing things with a lazer, then blew up superman with missles.  10/10 would defy all DC logic again.",
            "review_score": "1"
        },
        {
            "review_text": "Love it",
            "review_score": "1"
        },
        {
            "review_text": "An extremely fun LEGO game set in the DC Universe, with lots of characters and side missions to do.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game to play. It's so fun and addictive, not the mention the HUGE amount of replayability that comes with this game, only at $7.49 on sale... I'd recommend for you to buy this game if you like collect-a-ton games or just LEGO games in general... IF IT WEREN'T SO BUGGY.  I tried to play this game so much, but it freezes up for short instances (UPWARDS OF AROUND AN ENTIRE MINUTE), characters get stuck in walls or don't appear in areas they should, resulting in levels where you cannot progress because a certain character is unusable. The game hasn't crashed to desktop for me at all, but it doesn't like to minimize itself for no reason at all. I can't even pass the 5th level of the game because it's one glitch after the other preventing me to move forward or progress! Either its Joker getting stuck in a wall or Cyborg deciding to go out of bounds, I just can't pass the level since a bug will cause me to never be able to progress.  This is such a charming and fun game too... But the developers/publishers were too lazy to bother patching the game up to at least prevent these game-breaking bugs but I guess WB Games already got their fill from the purchases of this game, so why bother?",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game like all Lego games. Love all the DC characters and the way they made changing Batsuits. Unlike most people my xbox 360 controller works great.",
            "review_score": "1"
        },
        {
            "review_text": "The game has better graphics and slightly improved UX over Lego 2 (like split screen), but has plenty of bugs (that can make you stuck and need to reload level from start) and camera problems (when heroes get invisible). Additionally missions are somewhat contrived, are split into sections (if you go through a door you cannot go back), and have unreasonable barriers (like superman cannot fly over a bride right, he needs to go around on land together with batman).",
            "review_score": "-1"
        },
        {
            "review_text": "Lego Batman 3 Beyond Gotham is one of the best Lego Superhero games ever, the story is very good and the roster of characters are awesome i mean 150 characters + DLC givs us more characters and more levels! TT games has done a great job of disigning the characters and the levels. Playing the game makes you wanting to read the comics and see the movies! This videogame has a promising titel so definitly check it out!",
            "review_score": "1"
        },
        {
            "review_text": "Game is broken and has a part that crashes everytime you get to it, Do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Seeing how this game came 1 year after TT game's big seller Lego Marvel Super Heroes you thought they would have learned a thing or 2 about what people enjoyed in lego games.  But apparently not.  I guess a part of it comes from not being very set-in on DC characters since the characters i know i can probably mention on my fingers.   But what mainly did it for me was the overall dull look.  The DC movies and pretty much everything has often been dark toned and tried to be cool and taken very very seriously. Which means it translates poorly into lego worlds. It means the world just become awefully dark but without any sort of cool or interesting feel to them, it just makes the maps dull. The main hub you're left at too is something that's bad.  While Lego Marvel Superheroes had a whole city to run around in with vehicles to choose and go around in and special levels to play through gates that you make with golden blocks, this game gets a space station. One that you can't even fully explore. Yeah, it got like 6 rooms in total. Actually, if you've played Lego marvel super heroes, let's say it this way. Imagine only being able to run around the helicarrier. That's what the space station is like.  It has other worlds you can travel to,like the hall of heroes which is really just 1 room, with a hidden path that leads to the legion of doom, which is again. 1 room. They do give you all the lantern planets to play on, which sounds cool. Until you play them.   These planets are so damn small, and so lacking of anything interesting that it's almost interesting how they managed. Not only are they a pain to walk on, (can't find a good way to describe it. Just look it up on youtube or something) they also give you the moon to play on. Which is pointless, there's nothing to do there. Except find portals to the lantern planets, but you can fast travel to them via your map which you carry around. Sooooo...  The biggest offender of worlds though, must be the damn green lantern planet. This is the ONLY MAP IN THE WHOLE GAME THAT YOU CAN USE VEHICLES ON.  And do you know what it is? JUST A BIG GREEN EMPTY ROCK WITH A FEW RACES THAT YOU CAN DO JUST AS WELL WITH CHARACTERS RATHER THAN VEHICLES.  I thought the lego games were going to be interesting, but i was wrong. I completed this game to 100% like i do all my lego games, and while i sunk only 40 hours into this, it felt 3 times as long as Lego marvel super heroes, because that time i had fun, this time i didn't. I thought lego jurassic world was the worst offended of all lego games but no, this by far is.  They even nerfed the combat. You heard that right. The big characters, they nerfed them. I remember playing them alot in Marvel super heroes because they were strong and easily dispatched groups of enemies in seconds, but this time, no attacks they do can target more than 1 enemy. Now, you might say ' But that's just so people won't use an OP character ' which would be fair. IF THEY DIDN'T HAVE GOD DAMN SUPERMAN IN THIS WHICH IS THE VERY DEFINITION OF OP.  I really can't see anyone have much fun with this game, it feels rushed and overall dull.  I do have to give it credit for bringing in Adam West as voice and character to find and rescue, but he's no  Stan Lee  so to say, even if he on his own is a great person  The most fun i had with this game was whenever Mr. Mxyzptlk was on screen, because of all people. They choose Gilbert Gottfried to voice him, in a KIDS GAME. Sure he doesn't swear but, really?! Pretty much anything that guy says is ment to offend someone, so just hearing his voice is cracking me up because i hear curse words and offensive jokes just by hearing his voice even if he don't say them in this game. That's just hillarious.",
            "review_score": "-1"
        },
        {
            "review_text": "This game constantly detected my keyboard as another imput device and started the mission into co-op. I only wanted to use my controller, but no matter what it would start the keyboard as well, which could not be turned off, only the controller. Bad, very bad.",
            "review_score": "-1"
        },
        {
            "review_text": "If you came to this game because you are arkham's series fan and you looking for more, Just run away from this game as fast as you can.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible PC controls. DO NOT BUY UNLESS YOU HAVE A CONTROLLER. Trust me, don't make the mistake I did. Don't buy unless you have a controller. Waste of money. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Huge let down &amp; massive disappointment.  Cons: Lots of glitches in levels mean characters get stuck with no way to free them without quiting. Bugged in many places causes lots of rage quit &amp; reloading saves losing a lot of progress. Way too many characters its overkill &amp; not required at all. Poor gfx &amp; levels uninspired level design for the majority of levels. No native Xbox 360 controller support you have to copy a file from the previous Lego Batman games to use this controller &amp; even then if you go into the controller options its not recognised properly. Massive oversight due to poor QA. Massive step back from the quality of Lego Batman 1 + 2. No replayability its too boring to even finish once is a big struggle. QA level is very poor. Uannounced patch introduces online server DRM which is not yet enforced as of 06/01/15.  Pros: Some of the ingame levels albeit very brief are nice to look at.  Save yourself some money buy Lego Batman 1 &amp; 2 instead they both offer a far superior experience to this shovelware garbage. ",
            "review_score": "-1"
        },
        {
            "review_text": "THIS IS THE WORST GAME I HAVE EVER PLAYED IT DOESN'T WORK",
            "review_score": "-1"
        },
        {
            "review_text": "hay my game just completley restarted so now i have none of my progress and i dont want to finish the entire campaign so can you guys fix it I even have an acheivmnet for the last mission and I could't go to any of the lantern planets so my friends were going to get this but im going to tell them not to if you guys do not fix this",
            "review_score": "-1"
        },
        {
            "review_text": "DISCLAIMER: I am a huge batman fan and the other games in the serries are pure gamming genius in my opinon.  Nearing the completion of this game I thought it was time to share my opion, straight of the top it was a good game, the levels were for the most part stong, though some of the watchtower and lantern levels were very repeditive with the stand out levels being 'Europe Against it' and the 'Same Bat-time Same Bat-Channel' Bonus level. It was a good change leaving gotham which had already been the main focus of the last two installments, but it wasn't a batman game, which sempt really weird with it not only being named 'Lego Batman 3' but being relased on his 75 Aniversary .   The game was highly adicting which is obvious seeing how i've been playing this game for the last week and am currently sittting at 98.5 percent, and you would think that I would have finished, but I haven't and probaby won't.   Two days ago I atempted to complete all of the planets but the shape of the planets being round and to small to look flat made me sick and often the experince would be boderline nuziating. Odym was the worst as it was layered and there were difrent floating islands, most of the other planets followed a similar structure. all but Oa  Oa!!!!!!! BlOODY OA (Rage Is CoMING!!!!) I completed all of the virtual reality simulators to unlock vechiles, vechiles with the most confusing driving mecanics ever!!! i have to pull the controller down to go up and vise versur? it was alfull and is the reason I have yet to get the 100% i have tried so hard to get. Ana i'm just peved that im missing 15 gold brick all of which are vechile races based on Oa........  This is probably clased as a 'kids game' but any kid abble to complete this deserves a medal.   To end on a postive note the adition of celerbitys and lesser known charecatrs made the game for me and that why i can say  5.5 Bat-Mites Out of 10   ",
            "review_score": "-1"
        },
        {
            "review_text": "What the ♥♥♥♥, no automatic recognition of xbox controller, shame on you!",
            "review_score": "-1"
        },
        {
            "review_text": "Couldn't get past level 1! When you're supposed to tap h to fire the net at killer croc to activate the cutscene the character just sits there and nothing happens! Not at all impressed also the game is very jumpy.",
            "review_score": "-1"
        },
        {
            "review_text": "Why can't they make a patch so it supports windows 10 as well, it's stupid to see Star Wars: The Force Awakens, support windows 10 and not the older ones like: The Hobbit, LEGO Star Wars (except The Force Awakens), LEGO Movie The Video Game, etc. and this game is not even THAT old.   FIX IT NOW!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Awful, the camera angles are so cancerous.. u will 100% get motion sickness from this game",
            "review_score": "-1"
        },
        {
            "review_text": "NO. It says that I can't play this game on my Mac. Nope. I'm already requesting a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "LEGO Batman 3... What to say about this game but: It's a LEGO game. That says a lot actually, though this one stands out a bit further than the rest. But first, let's start with the story; It slowly starts with Batman and Robin kicking crime's behind as usual, until a supervillain by the name of 'Brainiac' captures the lanterns to possess their power to shrink planets down to pocket-size and keep it in a bottle... At least Lex Luthor wanted to be president... Anyway, Batman, The Justice League, and some of the known villains go on a mighty mission to stop Brainiac from shrinking Earth.  Now the graphics: This new LEGO game does it's best to look spectacular at it's highest, whilst staying optimised for older compters, I never not liked the graphics of LEGO games, and much like most of their playsets, they are more innovative with each generation. Of course, it does suffer from motion-blurring and lighting. The lighting seemed to be more blinding than pretty. Anyway, it plays, that's what I care about.  Gameplay: As per usual, smash, smashy-smash. But more smash than puzzles, half of the time I was stuck because I didn't think to destroy this crate, or this random structure. Plus, working out the controller settings is a pain in the neck. Worse than someone slapping your sunburn. It works a few minutes in and suddenly, it decides not to let me play! Though it is easily solved it's just annoying.  What I call 'Suit-Centres' or 'Suit-Dispensers' (the things where you'd change suits for different occasions) aren't in the game anymore, instead you have a 'Bat-Tastic Gadget Wheel'. They actually call it that. Either way, suits in your pants and I'm not complaining. It, too, works.  Occasionally you'll run upon some bugs: one I find particularly annoying is when moving diagonally: the character walks instead of runs, when most segments require you to go diagonally, you'd walk, resulting in getting smashed, or falling to your inevitable demise, oh well, it's a small problem. There is a pretty wide arrangement of characters to unlock, over 150 characters supposedly, but you'll only get a handful playing the story. Also Conan O'Brien is in this, I don't know why, or how, but he is.  Speaking of the story, it is slow, and too slow to keep my attention until later than half-way through.  Characters: Here I go trying to say if the acting is good, frankly, I don't know what makes a good voice actor, but I'll try. There is some extremely good talent behind the characters, the actors did what they do, and that is: bring life to these personalities we love so dearly, and some we hate, I'm looking at you Aquaman. Either way, talent!  Overall: I do like this game, not quite love, but like. It just has a few qwerks, the story is so long! Six hours in and nearly at the end, hopefully. The walking bug, fix it! It works in other games why not this one? Okay, enough blabbering, I give this... 8/10 Recommend IF you really want to get it. The price is a bit high, but thank goodness there was a sale at my store.  It is a treasure to have amongst the other LEGO or even Batman games, and if you like lego, and the old batman sets, you'll love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game, spent days playing it!",
            "review_score": "1"
        },
        {
            "review_text": "Many annoying glitches but I still got over them and beat the game.",
            "review_score": "1"
        },
        {
            "review_text": "baman has lots of friens",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun to play!",
            "review_score": "1"
        },
        {
            "review_text": "Great fun from the latest in the Lego Batman franchise! Play as any number of DC Heroes and Villains!",
            "review_score": "1"
        },
        {
            "review_text": "I like how there are heaps of characters that you can get. I love the storyline and this game is heaps of fun and great for kids.",
            "review_score": "1"
        },
        {
            "review_text": "october 2015 and still with the same old controller issue. fix or my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "Get this Game so much fun Great Characters,Very interactive Must Buy",
            "review_score": "1"
        },
        {
            "review_text": "Thoroughly fun as always from the Lego team. They just keep getting better and better at making their games easier to pick up and more diverse in the characters that you can play. Keep them coming!",
            "review_score": "1"
        },
        {
            "review_text": "LEGO Batman 3 is an action-packed sequel to LEGO Batman 2. LEGO Batman 3: Beyond Gotham brings a comical and action-packed gaming experience to the player, with many characters and costumes, levels and secrets, you'll find yourself deeply addicted to this game in no time.",
            "review_score": "1"
        },
        {
            "review_text": "I have really enjoyed this game and if you are a dc fan I highly recommend it. The ownly problem with this game is that the free roam is not as fun as lego Batman 2. In lego Batman 2 you can explore a huge city that gos on for miles but in lego batman 3 there's just small hub worlds to explore (lantern worlds, the batcave, ect.). That is not a deal breaker though because the game is still fun. The thing that makes the game so cool is the characters you can play. There's like 150 characters to play plus about 40 some dlc characters (which I recommend you get). Over all this game is great so if you like DC, get it!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Don't cover a judge by it's book.",
            "review_score": "1"
        },
        {
            "review_text": "Its one of the best looking lego games i have seen besides lego hobbit and has a great story 9.9/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Great Game ! Especially love the local Co-Op.",
            "review_score": "1"
        },
        {
            "review_text": "Epic filled with great characters and sweg  Nightwing is da best",
            "review_score": "1"
        },
        {
            "review_text": "I like it, great selection of characters",
            "review_score": "1"
        },
        {
            "review_text": "awsim as hal and be killawog",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of DC and LEGO games you are in for a treat.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest of all lego batman games. Huge selection of characters. Interesting game play and a great deal of fun. Love the challenges in unlocking various characters. Superb game.",
            "review_score": "1"
        },
        {
            "review_text": "I played the arrow mission on repeat",
            "review_score": "1"
        },
        {
            "review_text": "I barely recommend this game. I mean, it's a LEGO game, but on the PC it's just kind of... hard to control. Sure, you can switch the controls around, but when you start off it gives you the worst button combination EVER. I rate this 6/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is a awesome game that I totally 100% suggest you buy! I do not have a gaming laptop rather a terrible laptop and I can still run this game nicely Storyline is fun and this game comes with a MASSIVE open world which is something really cool about this, you can travel to different lantern planets and complete tasks which in turn gives you characters or vehicules. I loved this game so much that I 100% percented the game so I have fully experienced it and loved it!",
            "review_score": "1"
        },
        {
            "review_text": "Haven't completed the story yet, only got to use it a few ours today. But so far it seems pretty good. VERY weird batman, but yeah. Pretty good. Definately gave me some nostalgia from the good ol' days!",
            "review_score": "1"
        },
        {
            "review_text": "Look, I've been playing LEGO games since I can remember, in fact, I own the majority of them! However, this LEGO game in particular doesn't stack up to the others. LEGO Batman 2, and LEGO Marvel Superheroes were, in my opinion, the last good STORY-BASED LEGO games (LEGO Worlds isn't story-based). I mean, where is the Open-World that was in both those games? They divided the Open-World terribly in this game. Plus, the story isn't all to good, either. Look, no hate on LEGO, I still love them, but please, step up your game. I'm losing faith in Story-Based LEGO games ;-;  3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Highly recommend this game!!! I love it so much!! so fun to play even though I'm grown ♥♥♥ man already.....",
            "review_score": "1"
        },
        {
            "review_text": "very fun game. love this",
            "review_score": "1"
        },
        {
            "review_text": "Very cathartic games i love them",
            "review_score": "1"
        },
        {
            "review_text": "All Hail DC!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Its humor is rather childish but it is a kids game and I still got a good chuckle for quite a bit of the story, even laughed pretty hard at other parts. Gameplay is simple, and the new suit system is a great addition to the game. If you love DC comics then you will probably love this game, especially if you don't mind laughing at charactatures of the heros. The game does make fun of the heros to a certain extent but its all a good fun. The best part of the game is the huge list of playable characters especially the stange ones from the depths of the comics. One criticism I have is the many of the cameos (aside from Adam West) are rather unnecessary and pull the focus away from celebrating DC comics.",
            "review_score": "1"
        },
        {
            "review_text": "such a good game, im even in it",
            "review_score": "1"
        },
        {
            "review_text": "Its A Great Game All Round And Cool Interesting Characters Only Down Side Is that the DLC Missions Could Be a little Longer",
            "review_score": "1"
        },
        {
            "review_text": "  this does get a tad boring after you complete campaign mode ",
            "review_score": "-1"
        },
        {
            "review_text": "this game is incredibly glitched i am only on level 3 and will haven to start a new game because of that for example on level 3 the gold area that you have to cut out if you use the space suit fuel cells before flying up the game will break and the reqired pieces wont appear to finish the level another example is that at the end of level 3 when battleing the jack in the box if you dont catch a missile you will just be sitting there with the jack in the box laughing at you and as in this stage you are not able to move and have no hearts you will have to restart your game   sorry i am just being honest i hope the developers take a look at this comment and feel obliged to update the game in the end there is a lot to love about this game such as great charecter rosters fun levels and a brillient story line",
            "review_score": "1"
        },
        {
            "review_text": "I have Lego Star Wars Saga, Clone Wars, Indiana Jones, Lord of the Rings, Marvel Super Heros and Batman 1, 2 and now 3. I am about halfway through Batman 3 so far and its been alot of fun. Its a solid game and runs well on my computer. My only complaints are the lack of free roam and the levels seem a little long and drawn out. I am an Adult and its kinda funny. I get weird looks from my friends when i tell them to check out the lego games, until they actually see the game. We are all huge comic book fans and they are shocked when they see how many characters are unlockable and how great these games are. I love that Batman 3 included a Batman 1966 level and i admit i am kinda rushing through the game to unlock it. Its not the best Lego super hero game, i'd have to give that to Marvel, but its worth the price and will keep you entertained for hours!",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Innocent gaming at it's best. As a comic collector I was thoroughly entertained by this game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is completely unplayable, due to the insane forced split screen. It has a two-player mode, and there's no way to turn it off. It's like having an extremely crappy set of bifocals on, showing two different views even if both characters are right next to each other. I liked Lego Batman 2, but I'm not getting any more of these things.",
            "review_score": "-1"
        },
        {
            "review_text": "If this game was only about Batman, as the title suggests, it would already be good. Being a Justice League game is even better. I only wish Superman could be used more.",
            "review_score": "1"
        },
        {
            "review_text": "I love these games and they nail each and every character every time, great humor, great soundtrack and fun gameplay. I just went through the story mode which took about 8 hours. Not much else to add to this game because most of these games are all the same. If you have played other Lego games and liked them this will not disappoint.",
            "review_score": "1"
        },
        {
            "review_text": "why do lego games have really good graphics",
            "review_score": "1"
        },
        {
            "review_text": "Got this game for my son to play and I'm equally as into playing it as he is. Both of us could spend hours playing it.",
            "review_score": "1"
        },
        {
            "review_text": "The game is not FINNISHed...  I'll dumb it down for you, there is no Finnish in it.",
            "review_score": "1"
        },
        {
            "review_text": "Has a hidden Weeping Angel hidden in the game. This gets my seal of approval! ",
            "review_score": "1"
        },
        {
            "review_text": "If you know any of the previous LEGO games, you know exactly what to expect.  Graphics and sound deliver what they are expected to- surroundings and characters look fine and the music includes licensed tunes from official TV- and movie soundtracks. Nice, but nothing raelly outstanding.  The reason to play LEGO games is the gameplay and that is so addicting that you just keep coming for more. So I was really happy to see that the levels felt longer and overall better designed in this game than its predecessor.  The downside is well known: hardly anyone seems to like the multiple hub worlds. I don't see the 7 lantern planets as actual level hubs, as neither of them actually connects to any level or, any other world than the moonbase (which in turn becomes a hub for the planets). Actually, there are only two real hubs: the space station and the moonbase, with no less than 9 additional areas to explore. Sounds great, but becomes tedious as none of these areas are interconnected. All in all, a big step down from LEGO DC Superheroes and LEGO Lord of the Rings with their enormous overworlds.  On the other hand, the side quests are fun and sometimes form small story-arcs (or rather, arcletts) wich can be quite funny. The variety of the quests is great and I could have done with quite a few more.  All in all, a solid instalment of the LEGO series that offers more of the same- not yet stale, but lacking fresh ideas.",
            "review_score": "1"
        }
    ]
}