{
    "app_id": 313980,
    "name": "Proxy Blade Zero",
    "release_date": "2014-07-28",
    "developer": [
        "DragonSix"
    ],
    "publisher": [
        "DragonSix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Hack and Slash"
    ],
    "achievements": 30,
    "positive_ratings": 114,
    "negative_ratings": 40,
    "price": 5.19,
    "description": "Proxy Blade Zero is a hardcore action game with technical combat. Play as Fenrir, an advanced battle android, against the armies of King Anima.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/313980/header.jpg?t=1485230147",
    "minimum_requirements": "OS: Windows Vista or superior Processor: Intel Core 2 Duo 2.4Ghz Memory: 4 GB RAM Graphics: AMD Radeon HD 5750 1GB or Nvidia GTS 250 1GB DirectX: Version 10 Storage: 1 GB available space Additional Notes: Xbox gamepad recommended for optimal play",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game doesn't quite feel like it's a finished game, just yet. I'm uncertain if the developer understood what kind of combat system they were making.  See, while the greenlight page and the developer's blog both made suggestions that it's a similar breed of game to Devil May Cry or Bayonetta, it really isn't. The gameplay ends up being a balance closer to Ninja Gaiden, where one spends much of their time kiting enemies to leave one vulnerable enough to actually deal some damage. Between the wide area attacks, and large enemies with uncounterable (though not unblockable, as I first thought) attacks, and projectile attacks, almost every enemy in the game encourages the player to stay away as defense. This in of itself isn't a bad thing; it can lead to hit and run tactics, which I had initially tried, only to realize that it's near impossible to do so.  Except, the tools the player has aren't built for kiting, or for hit and run. They're built for dueling. One on one fights against enemies with complex patterns. The parry/counter system is actually fairly well implemented. The player has full ability to defend against melee attacks, and end a batch of them with a counter attack to reverse momentum a bit. It still needs some fine-tuning, because the larger enemies (such as the hammer guys, or the gun-type's melee attack) seem to have the parry window mistimed. No, where the game actually starts to fall apart is the dashing. It's unresponsive, with what feels like a 5-10f startup, it has a limited duration, and because it has a 'special attack' associated with it, The player can't use it to reengage with an enemy. Especially since the dash attacks are the only attacks you have that can't be canceled with a parry. What this means is that the attack the player is supposed to be using defensively, to wear down enemy armor, is only useful AFTER the shields are down. The player can't dash in and out of range, because the startup is so long that the player will not have moved out of the way by the time the attack lands, assuming they're dodging from reaction, and not trying to predict when the enemy is going to counterattack. It means that the grenades end up being far more dangerous than they should be with the huge window you have, because the player can't use the only way to escape its range in time.  I have other minor gripes with the combat, such as not being able to parry from the counter animation, which means that seemingly open windows for counter attack are actually just a chance to get wrecked. The player can parry from the parry's cooldown, but it can't parry from the counterattack. The overdrive system doesn't actually require variety. It's VERY easy to max it out using only the normal attacks, which I'd eventually resorted to, for reasons I've already stated. Lastly, the game has some minor issues communicating thus far. I didn't realize the grenadier enemies were different from the first enemies I fought until I saw both in the same fight. They have the same animations, and since both the initial weak enemy and the grenadiers have red heads, they look identical. The only visual difference they have blends into the background. The range of a grenade is illustrated by the red circle that initially appears around it, but when it explodes, the game shows nothing, except the player getting flung away. Only the player is thrown away, I should add. I presume it's an attempt to keep the player from using grenades against the enemies that threw them, except that similar tactics are specifically designed for use against the gun enemies when they appear.  Dragonsix, or Ben L. Grauer, whichever you would prefer: Redo how dashing works, or Rebalance the enemies for the combat system you actually have. Now, I'm far from an expert, and I can't very well crack open the code and see how well the changes I'd make would work in practice, but I do play enough action games to have some sense of what works and what doesn't, and why. Make the dash FAR more responsive by letting the player cancel into it. Maybe not let them immediately cancel out of it, but at the option to at least cancel into the dash would mean that a surprise grenade can be dealt with in time. In fact, you might very well be able to make the window tighter without interfering with the gameplay. Either remove the dash attack, or make its supposed anti-shield properties far more drastic. The player shouldn't have to worry about accidentally doing a dash attack and being unable to parry because of it. Don't punish the player for being risky, punish them for failing to take advantage of near misses. Other reviews have made suggestions of being able to parry the lasers from the gun enemies, and while that sounds pretty awesome, being able to dash in and out of the line of fire sounds far cooler. Take your pick. Tweak the overdrive system so that it actually requires variety, while you're at it.  tl;dr - Either let the player cancel into the dash so that they can take advantage of it in short bursts, or tighten up the parry system. I'd recommend the former, so you aren't wasting the mechanics you have. Tweak your visual designs so they communicate better. This game does NOT feel finished, just yet.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is (almost) unplayable with mouse+keyboard. the buttons of the controller are shown, even when you use the mouse-keyboard combination. you definitely need a controller (xbox360) or you will rage-quit. i will replay it again soon (with a controller obviously!), but so far...it´s not much fun at all. graphics are also not the reason for you to get it. the fighting can be fun though (with controller). exiting/closing the game was only possible with Alt-F4...ESC didn´t work.  without controller: STAY AWAY with controller: take a closer look (wait for a sale maybe)",
            "review_score": "-1"
        },
        {
            "review_text": "Ooooo lawdy, such a great hack n' slash game. BUY IT NOW.",
            "review_score": "1"
        },
        {
            "review_text": "I recommended it for those people who want just a challenging action game whit awesome music.  with a more detalied comment i had fun while playing it but it seemed more like a tech demo. There is no plot, no particular art style and is really short. The game doesn't offer replay value, that could be improved by upgrade or a simply a score board. the enemy pattern is too simple and easy to predict, and when you choose a different difficulty the gameplay doesn't give different feeling, only enemy damage and HP are changed, that in critical seems only a way to have a cheap death.  tl;dr: is a good game but is short.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it on the XBox Live Indie Game Arcade, loved it on there. Saw it on Steam for a dollar and thought it was a great excuse to play it again.  The combat is simple to pick up but very hard to master, I've actually never beat the final boss because he's just so dang quick. The best part of this game is that as the enemies 'level up' you dont. You just have to get good. It's based on player skill not how many things you've killed.  4/5 - Highly recommend",
            "review_score": "1"
        },
        {
            "review_text": "(Author's Note: I'm 27% through the game at the time of this review, still working on it. But i've enjoyed it enough so far that i figured i'd do a review.)   Summary: This game, is fun. Frustrating, but fun. It isn't the greatest looking game, but it looks nice enough, the soundtrack fits the mood, and the gameplay is fairly tight.   There isn't exactly much of a story past the opening text dump. Basically: Good Robotguything wants to stop the Evil Robotguything. The main focus was definately on the gameplay.   The game is a character action, spectacle fighter hack and slash ALA Devil May Cry, God of War, ETC. It's got a fairly simple, if deep enough to be enjoyable combat system. Press a button for basic attacks, a different button for power attacks, etc. The game's sort of 'calling card' as it were, is the addition of a dash. It's useable any time as long as you have the energy, and if you attack during the dash, it does an 'energy attack' which does more damage to shields, and combined with power attacks basically tears through anything.   My biggest gripe with the game is that it quickly manages to show you that doing what it tells you is probably a BAD idea. It teaches you in the (thankfully short) tutorial how to attack, dash, parry and some other stuff. The tutorial definately teaches you that parrying attacks is a GOOD thing, because you can power down enemy shields with it. Welp, by the third level, the game will start throwing enemies at you that if you get close and try to parry their melee attack, it'll knock you into a stun animation and they'll just attack you again, and take off a rather large chunk of your health. Then it starts throwing these enemies at you in droves, forcing you to play a game of 'dash up, dash away, do two attacks to their shield, repeat.'   Overall, the game is quite good though, if very short. I'd definately recommend it at sale price, and even at full price if you can accept that it'll be short, but quite good. (And can accept that it'll be a little frustrating. x3)  ",
            "review_score": "1"
        },
        {
            "review_text": "Not bad. first time i play it, i think this game is not hard. but it all changed after entering chapter 2 -...-",
            "review_score": "1"
        },
        {
            "review_text": "This game has fun, fast combat. It has a very responsive conrol system that lets you more-or-less do what you want even though the fights are fairly complex. The game introduces new enemies regularly, so you have to constantly apply new stratedgies to each room.  The graphics are extremely simple, although designers made good choices about how they used the resources they had. The animations are great, the colors are good, the robots and enviornemnts just don't have extremely detailed models or textures. The music definitely adds to the game at points.  I want to compare this game to Dark Souls titles a little--the combat is comparable in terms of the fight-stratedgy dynamic, as well as the twitchy melee combat with manual blocks and parries. You have a jet pack instead of the ability to roll. I would say the difficulty is about the same, espcially when it comes to learning bosses.  Overall this is an awesome game, exactly what you would hope to see from an indie studio--gameplay on par with the best AAA titles (with relatively simple graphics) at a fraction of the cost.",
            "review_score": "1"
        },
        {
            "review_text": "If you make a game in the hack and slash genre, it should generally be a fast pace, limb chopping, action filled good way to numb your senses. This game offered none of that. It all but requires an xbox controller to use, but it doesn't even make use of the few controls on the gamepad. A is select (that's it it opens doors) B gets your character in 'technique' to attack, Y is the attack, and X block. The right trigger and bumper boost you, and the opposite lock target. Now while few controls may not be a bad thing, the lack of variations to attacks gives no flow to the game.  There are only two attack animations / patterns, and a boost attack which is a one swing move that does not a thing. The regular attack where you just mash Y over and over (which does fukall to your opponents health), and the 'technique' attack (mashing B and Y consecutively, oh joy) which does some damage, but leaves you stuck going one direction. Oh, and you can do a little blip sort of 'counter' to opponents you block but it's more of a hinderance to you than them. Both of these pattens are boring, and do little to invest your attention into the action. What little of it there is.  The main mission flow of the game is to go through rooms and kill two, maybe three opponents each until you find a key to unlock the next set. That's all I have to say for the experience. Some enemys have shields, some don't. Oh and there are a few rediculously O enemys with huge laser cannons. They fail to inform you of there existance from the start. And while those opponents hit hard and require a little thought from your end to kill them, you really only have three attack patterns so...  All in all, I'd say that this game is the 'tic-tac-toe' of slasher games. It does little to invest you in the combat, does not push graphics of any modern standard, and isn't much fun to play. Don't bother with it, Steam gives away coupons for it for a reason.",
            "review_score": "-1"
        },
        {
            "review_text": "This is probably one of the hardest games I've ever played, and I rage constantly. For some reason though, I keep comming back. Super fun, intense gameplay. Go play it.",
            "review_score": "1"
        },
        {
            "review_text": "Such awkward xbox controls.... and they're not customizeable. Game is probably pretty good... if you get used to the weird controls. Re-review later.",
            "review_score": "1"
        },
        {
            "review_text": "PBZ is unfortunately a bad game. It's too ugly and too hard and doesn't play well. Buy something else. :(",
            "review_score": "-1"
        },
        {
            "review_text": "         Points out of 10       Graphics   2       Story   1       Gameplay   10       Fun    9       Difficulty   8     ",
            "review_score": "1"
        }
    ]
}