{
    "app_id": 314000,
    "name": "Pool Nation FX Lite",
    "release_date": "2015-12-07",
    "developer": [
        "Cherry Pop Games"
    ],
    "publisher": [
        "Cherry Pop Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards",
        "Includes Source SDK"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie",
        "Simulation",
        "Sports",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Sports",
        "Simulation"
    ],
    "achievements": 38,
    "positive_ratings": 777,
    "negative_ratings": 442,
    "price": 0.0,
    "description": "Pool Nation FX, is a seriously fun Pool &amp; Snooker Sim! A visually stunning billiards simulation with the critically acclaimed POOL NATION physics engine. Play 8 Ball, 9 Ball, Snooker, Killer &amp; more, unlimited Career modes with customised difficulty levels, Trickshots, Local and Online Multiplayer, spectate live matches and feel...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/314000/header.jpg?t=1461780747",
    "minimum_requirements": "OS: Windows: 64-Bit Windows 7 Service Pack 1, or Newer: 64bit Processor: 2 GHz Dual-Core 64-bit CPU Memory: 2 GB RAM Graphics: DirectX10 Compatible GPU with 1 GB Video RAM DirectX: Version 10 Network: Broadband Internet connection Storage: 3 GB available space Additional Notes: Xinput Supported Controllers",
    "recommended_requirements": "OS: Windows: 64-Bit Windows 7 Service Pack 1, or Newer: 64bit Processor: 3.3Ghz Quad-Core Memory: 8 GB RAM Graphics: DirectX11 Compatible GPU with 4GB Video RAM DirectX: Version 11 Storage: 4 GB available space Additional Notes: Xinput Supported Controllers",
    "reviews": [
        {
            "review_text": "This game is really a worthy succesor to Pool Nation. The controls are intuitive, the visuals are very impressive, and the new modes are very welcome. Only two real problems with this game, you have to tinker a bit with the graphics to get it to run smoothly, and two which is sorta minor is that they don't list the challenges for each particular match in the pause menu like they did in the original. This is really annoying when you forget them, but it's minor. I think the worst thing the developers could have done to this game is make it free-to-play. This invites the stereotypical freeloading gamers who think they're always entitled a completely free game and review the game negatively. This is not how commerce works, so get over it! It's a great game for what it is, and ignore the majority of the negative reviews because they don't even bother to review the game itself.",
            "review_score": "1"
        },
        {
            "review_text": "More players need to play the game.Great value for free 161 hours now played.",
            "review_score": "1"
        },
        {
            "review_text": "Awkward controls,and game just feels ... wrong somehow",
            "review_score": "-1"
        },
        {
            "review_text": "I played this game before I went to the bar, it gave me a lot of confidence. Sadly I still suck at pool IRL.",
            "review_score": "1"
        },
        {
            "review_text": "Crashes a lot,Wait till its finished.",
            "review_score": "-1"
        },
        {
            "review_text": "Game never lauched properly. It wouldn't show graphics at 3440x1440 so I adjusted to 1920x1080 given reviews discussing max resolution. Still no dice. I've played Pool Nation at ultrawide resolutions with relatively little issue.  I'll be uninstalling this 'free' game.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't like the camera angles and how they turn with your mouse. I don't think you should have to shove the mouse extremly hard to get the cue to go far.",
            "review_score": "-1"
        },
        {
            "review_text": "Game asked me before i left if i enjoyed playing this  Yes i did :)",
            "review_score": "1"
        },
        {
            "review_text": "Free to play, but one must pay for versus? get a clue!",
            "review_score": "-1"
        },
        {
            "review_text": "+nice 3D +variety of control settings +controller + mouse control at the same time +helpful onscreen hint -lack of physics &amp; animation ok to try, but need to pay or grind for full experience...",
            "review_score": "1"
        },
        {
            "review_text": "The online community for this game is awesome - great sports - loving it Played one person tday - really wanted to send a friends request but couldnt find him in recently played. Started with the free version but got hooked. Great game",
            "review_score": "1"
        },
        {
            "review_text": "Sweet graphics",
            "review_score": "1"
        },
        {
            "review_text": "this game need a user defined jukbox folder?",
            "review_score": "1"
        },
        {
            "review_text": "Very good pool simulator, quite fun and pretty unrealistic. The purchases kinda are silly but eh, 8ball pool for free is cool with me, 8/10  'Climbing that clock tower assuming something I'm eavesdropping' 'ANIGET!' 'Nevermind me Scott!' (turn off music and just turn up your crowd volume and listen closely)",
            "review_score": "1"
        },
        {
            "review_text": "not free to play",
            "review_score": "-1"
        },
        {
            "review_text": "This is basically just Pool Nation with better graphics and little more content. The 'free' version has nothing to it though as you need to earn cash to do pretty much anything. Being someone who loved the first Pool Nation, this is a great game, but if you're looking to ACTUALLY have this game, you should buy it. The 'free' part of it is as if you were given a game's case for free, but you had to pay to get the actual disc. All in all, this is a great game, IF you really like pool games enough. If you're not crazy intp pool and you want the same experience for cheaper, get the first Pool Nation.",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't ever figure out how to shoot the ball, I guess if you use a trackball this game won't work for you? Also couldn't figure out how to close the game either, had to ctrl alt del and end process. Completely unplayable.  10/10 would download and uninstall again",
            "review_score": "-1"
        },
        {
            "review_text": "fun pool and snooker game",
            "review_score": "1"
        },
        {
            "review_text": "Good game to spend some time by playing.",
            "review_score": "1"
        },
        {
            "review_text": "dang dude i am getting so lucky oh and this game is veran dunk coold godered nice! this game is fun it is well made and very nice good cool bro nerd",
            "review_score": "1"
        }
    ]
}