{
    "app_id": 314030,
    "name": "Guilty Gear X2 #Reload",
    "release_date": "2014-09-05",
    "developer": [
        "Arc System Works"
    ],
    "publisher": [
        "Arc System Works"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Fighting",
        "2D Fighter",
        "Great Soundtrack"
    ],
    "achievements": 0,
    "positive_ratings": 390,
    "negative_ratings": 47,
    "price": 7.99,
    "description": "As humanity endeavored to better themselves, they created the biological marvel known as Gears. Originally intended as the next step of human evolution, they were instead fitted for war and turned against their own creators.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/314030/header.jpg?t=1483724562",
    "minimum_requirements": "OS: Windows XP/Vista/7/8 Processor: Pentium III 700Mhz Memory: 256 MB RAM Graphics: 64MB or better DirectX: Version 8.1",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "NETPLAY! FINALY ITS HERE! AN ARC SYSTEM GAME THAT HAS NETPLAY ON PC!",
            "review_score": "1"
        },
        {
            "review_text": "The Guilty Gear series has come a long way since it's humble beginnings on the original Playstation, up to it's high resolution upgrade X in arcades and on the Dreamcast, where the game really broke out and put itself on the map, especially when XX (Also known as X2) came along on the Playstation 2. Many iterations later, Slash, Accent Core, Accent Core Plus, Accent Core+R, Guilty Gear finally got a true sequel in the form of Guilty Gear Xrd.  And yet, here I am still playing X2 #Reload. This game is by any means not even close to being balanced, nor as refined as later versions of X2, like say Slash or Accent Core, but I always keep coming back to it. I just like Guilty Gear back when it was a bit more simple, ya know? No Slash Backs, no Force Breaks, hell you can't even Throw Tech, no Blitz Shield, and no silly stuff like Danger Time and Hellfire. Just good ol' fashioned Guilty Gear with it's absurd gameplay, ridiculously awesome soundtrack and character designs, and thanks to this PC port, the first iteration of the series to have decent netplay, thanks to a fanmade patch.  I would highly recommend this game if you consider yourself a fan of fighting games, I mean, you can't call yourself a fan of fighting games if you don't play a legendary series like Guilty Gear, and X2 #Reload was like the peak of the X2 series popularity. Even Daigo Umehara was playing X2 #Reload. You owe it to yourself to play this game. Sure it's outdated compared to Accent Core+R, but ya know, going back to the roots is always fun.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best 2D fighters (and series).The visuals may be outdated but they do pay off regardless, the gameplay is frantic, rapid but also precise and the soundtrack just adds up with hard rock tracks.  The game features a roster of several different characters with unique mechanics, personal music themes &amp; story modes.The CPU is challenging, especially in Arcade mode, utilizing all of the combat features the game implements.Highly customizable training mode for the essential practice.Gameplay is kept balanced at all times - it only takes skill to become better.  The community has blessed this game with an online mod that allows satisfying netplay.  Overall, a title worth owning for all fighting enthusiasts and a must-have for fans.",
            "review_score": "1"
        },
        {
            "review_text": "This game is mad hype and with a little modding you can get a really nicely featured online mode working. You'll need to find some other people in your country interested in playing it to organize some games though.  Well worth the price even if all you do is muck around in arcade and enjoy the soundtrack. Buy it and support Guilty Gear on PC.",
            "review_score": "1"
        },
        {
            "review_text": "remamber Bridget is boy",
            "review_score": "1"
        },
        {
            "review_text": "Guilty Gear X2 on PC what more could you want...online? Pffft",
            "review_score": "1"
        },
        {
            "review_text": "Good game didnt sleep till like one in the morning on a school night........but ♥♥♥♥ it 'la vida es un riesgo carnal'",
            "review_score": "1"
        },
        {
            "review_text": "Solid and stylish old school fighter",
            "review_score": "1"
        },
        {
            "review_text": "I'm in no way qualified to review this as a fighting game- I'm a total newcomer to the genre (outside of button-mashing and incredibly mediocre Soul Calibur skills), so I trust those who rate the series highly.  What I do want to warn potential buyers of is that outside of technical fundamentals (the framerate is rock-solid and the game is responsive and looks as good as you'd expect), this is the most bare-bones port imaginable. The problems:  *no support for higher resolutions, or a fullscreen window *no subtitles for the extensive in-game spoken Japanese (and at least two characters' names on the select screen are in untranslated kanji) *a wonky menu system (be aware that 'quit' simply returns you to the splash screen; the escape key, on the other hand, immediately shuts down the game regardless of where you are) *bizarre default key bindings (while it's easy to figure out that Space acts as 'start,' you'll need to hit, for some reason, the U key to select menu options) *following on from that, far more fiddling than necessary to make an Xbox pad usable- you can get through most of it with the Joy2pad-looking interface in the game's setup utility, but be aware that the setup program won't recognize input from the left and triggers, which have to be bound manually as 1ZMIN and 1ZMAX respectively *and following on from that, the in-game key binding screen is worse than useless, since it only displays Playstation inputs (circle, X, triangle, square) and the player is left to find on their own which arbitrary keys these have been assigned to  I have no doubt I'll be able to enjoy it eventually, but hopefully this review will others make a purchasing decision or get the game to work properly after buying it.",
            "review_score": "-1"
        },
        {
            "review_text": "pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc pls xrd on pc",
            "review_score": "1"
        },
        {
            "review_text": "boy i cant wait to see all the weebs who bought this game just for bridget then drop it instantly because its a fighting game",
            "review_score": "1"
        },
        {
            "review_text": "If you notice the amount of time I spent playing this game you will notice it is zero. Windowed mode provides fixed tiny window with 640 x 420 resolution. Full screen mode results in Direct3d error and crash on launch. Tried all manner of tricks to solve this including disabling aero, running in compatability mode and forcing graphical settinhs through nvidia control panel and through windows.   I'm astounded at the steam community's positive reviews of the game as the software itself is basically shipped broken and unplayable - positive reviews of this game are from experiences with it that were NOT on stean.",
            "review_score": "-1"
        },
        {
            "review_text": "A pretty dreadful port. Maybe it works better if you're a hardcore fighting game fan and own a joystick but if you're trying to use a controller, good luck. The settings are pretty horrendous to navigate and the game runs at such a low resolution it really just does not hold up. You're basically paying for a PS2 emulator. I couldn't tolerate it for very long.",
            "review_score": "-1"
        },
        {
            "review_text": "Blazblue is cheaper and overall a better buy. Better versions of Guilty Gear are aren't avaiable on seam, so if you must this could get you your GG fix in a pinch.",
            "review_score": "-1"
        },
        {
            "review_text": "Generally speaking, this is a solid and workman like port of a classic 2d fighter that makes up for it's lack of enhancements and extras by being a genuinely good game in the first place.",
            "review_score": "1"
        },
        {
            "review_text": "Picked this up in the hopes that guilty gear Xrd and BBcp will come out, I'm not a fan of buying outdated games but if it helps them get the games I want out I'll buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Classic, Solid fighter. Wish it had the multiplayer intact without hacking it in...... A;; together not too bad, well worth the price. Easy to learn, hard to master.",
            "review_score": "1"
        },
        {
            "review_text": "Guilty Gear X2 is a 2d arcade fighting game.  I think this game has one of the best soundtracks. Easy to pick up and play video game and has great art work and think this is one of the best arcade fighting games on steam. I prefure a xbox controller or arcade controller style hardware to play it. Because keyboard is not a option for me. Config of all controlls can be a little bit a pain in the ♥♥♥ if you ask me.  Still this will not destroy your fun for the game. I give it a 7/10 score.  If on sale.. if cheap.. you should buy it. ",
            "review_score": "1"
        },
        {
            "review_text": "An excellent port of the classic Guilty Gear #Reload fight game, Arcade, MOM, Mission mode, Survival mode, Training mode are all there. Probably my favourite fighting game of all time, I only prefer the Slash version to this because it's the most balanced. The Muiltplayer is also good as long as you play with people above 140 Ping. There is a decent sized community, it's not huge but you can generally find a match if you're patient. Much better than the AC+R port, the netcode for that game at this moment is really bad; #Reload continues to remain the best on-line GGXX at the moment.",
            "review_score": "1"
        },
        {
            "review_text": "This game just brings back so many fond memories I highly reccomend it for the fans out there",
            "review_score": "1"
        },
        {
            "review_text": "Not only do you have pretty blonde men, but you also have robotic pretty blonde men. Whats not to like?",
            "review_score": "1"
        }
    ]
}