{
    "app_id": 314180,
    "name": "Deathsmiles",
    "release_date": "2016-03-10",
    "developer": [
        "CAVE Interactive CO.,LTD."
    ],
    "publisher": [
        "Degica"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Shoot 'Em Up",
        "Bullet Hell",
        "Arcade"
    ],
    "achievements": 48,
    "positive_ratings": 276,
    "negative_ratings": 7,
    "price": 14.99,
    "description": "Deathsmiles is CAVE's bullet-hell shoot-'em-up where you take the role of one of five Angels to defend the magical land of Gilverado from an invasion by Hell itself! Eradicate this devilish assault!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/314180/header.jpg?t=1550481015",
    "minimum_requirements": "OS: Windows 7/8/8.1/10 Processor: Intel Core i3 2GHz or higher Memory: 2 GB RAM Graphics: Intel HD Graphics 5000, Geforce 9500GT, Radeon HD 3650 or better DirectX: Version 9.0c Storage: 3 GB available space Sound Card: DirectSound-compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Have this on the 360 and just wanted a more reliable platform.  At any rate, Cave does not make bad shooters. While Deathsmiles is not their best and certainly one of the easiest danmaku games you can play, you gotta keep in mind that it was developed nearly 10 years ago and danmaku has come a long way since then. Still, this is a highly enjoyable experience and the characters have a well-indicated hitbox so you'll know exactly where you need to be.  If it wasn't good, I wouldn't have bought it twice.",
            "review_score": "1"
        },
        {
            "review_text": "The Steam version of Deathsmiles is finally here and for the most part is faithful to the Xbox360 port. This version also includes all of the updates and modes, including the Mega Black Lable DLC with Sakura as the 5th playable character and an extra additional level. Deathsmiles stands out as a Cave shmup title because they've committed to a horizontal side shooter which has been rarley seen with their titles. Each of the 5 playable characters have their own individual abilities with slightly different mechanices and their own familiars that also adds another layer to the gameplay can can be used in a number of situations.   Pros: -4 Playable characters with different attributes with a 5th playable character in the included MBL -Decent amount of variety in its mechanices with the characters and their familiars -Non linear levels with various difficulty levels ( Levels 1, 2, 3 and the dreaded 999) -For the purist out there, the arcade modes is mostly faithful to the original arcade's resolution while Normal and 1.1 modes has a much cleaner, updated higher resolution for those who want their old school games to look their best -Some of the dialogue has been improved -Gothic lolitas!  Cons: -Missing online co-op from the Xbox360 version, although there is local multiplayer -Found a minor bug where the game crashes when trying to switch from window to full screen. Luckily to fix this when the game does crash when switching to full screen, just restart the game and it will display on fullscreen. -This is considered one of the easier Cave titles to 1cc, which may turn off the most die-hard shmup fans    Verdict: Thumbs up! Despite the minor bug and the missing online feature, Cave and Degica has done this game justice bring it out to steam and for the right price with everything featured. This is another sleeper hit I think gamers should look into and give this one a go. It may not be quite as intense as Mushihimesama but its just as enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game design, characters and story with a gothic theme.  Very pleasant game to play, even if you're a beginner in the genre and die a lot. Through perseverance you can learn the game mechanics and improve the reflexes. While it offers achievements for skilled players to brag about, it doesn't mock unskilled players as they try to climb the skill ladder up.  Only thing this game lacks at the moment is a option to select the UI language on the Steam client settings.",
            "review_score": "1"
        },
        {
            "review_text": "Was so excited when they announced this game to steam, this is my favorite Cave game! Played the PCB, the 360 ver, the iphone ver (you can tell I love this game lol) and now here. Beautiful art, awesome soundtrack, replay value, and its Cave...enough said :)",
            "review_score": "1"
        },
        {
            "review_text": "Perfect port of the 360 version of the game  If you want an introduction to 'Bullet Hell' shmups this is probably your best bet - a ridiculous number of modes and a difficulty level you can choose to suit your tastes, from nice and gentle (for a BH game) right through to Level 999-You-Have-Got-To-Be-F'in-Kidding-Me. Multiple paths/endings, cute graphics and an off-the-wall soundtrack it really is a very complete package.  One of my favourite CAVE shooters - I really hope we get some of the others :)",
            "review_score": "1"
        },
        {
            "review_text": "Horizontal fantasy ecchi shoot 'em up by CAVE with lots of projectiles and pretty colors. Underaged lesbian bikni models. In short, Deathsmiles is bonafide pedo bait. I don't want to go to jail. Please, just let me play Progear or Raiden II instead. Or mod this so I don't have to justify why it's in my Steam library.",
            "review_score": "1"
        },
        {
            "review_text": "Another good realease from Cave, looking forward to the next one and hopefully more after that",
            "review_score": "1"
        },
        {
            "review_text": "its good",
            "review_score": "1"
        },
        {
            "review_text": "I've played this allot on the 360. It's a great game awsome music fantastic levels and it's hard as hell if you're into Danmaku games I'd highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Loved in on the 360, love it even more on Steam.",
            "review_score": "1"
        }
    ]
}