{
    "app_id": 314250,
    "name": "Jet Gunner",
    "release_date": "2014-08-04",
    "developer": [
        "Sinclair Strange"
    ],
    "publisher": [
        "Sinclair Strange"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Adventure"
    ],
    "achievements": 37,
    "positive_ratings": 464,
    "negative_ratings": 137,
    "price": 0.79,
    "description": "Jet Gunner is a 2D platform action indie game that's full of Nestalgia. Full of action, gunfights, bosses and explosions so if you're into the whole 8-Bit vibe you should love this. From the sound, to the graphics to the flicker, this should pay tribute to those classic hard as nails, run 'n' gun games.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/314250/header.jpg?t=1447362712",
    "minimum_requirements": "OS: Windows XP or later Processor: Pentium 4 or higher Memory: 256 MB RAM Graphics: 256MB or higher DirectX: Version 9.0 Storage: 35 MB available space Sound Card: Any",
    "recommended_requirements": "OS: Windows 7 or 8 Memory: 1 GB RAM DirectX: Version 10",
    "reviews": [
        {
            "review_text": "The person that made this doens't fully understand how to make a run-'n'-gun style of game but does seem to understand the components that WOULD make a good one. Honestly, it makes for a rather dull experience overall. Let's start from the beginning so we can get an idea of what's wrong with it:   1) Enemy placement - Enemies are often placed in areas that aren't well thought out (or perhaps they are, but for the wrong reasons). You'll find yourself tapping the controller or keyboard to move forward rather than have your character move at a constant rate for fear of an enemy popping up on the very edge of the screen and immediately firing. While this isn't terrible if you are into that sort of thing, I like to play my run-'n'-gun style of games where I'm actually RUNNING and GUNNING, not stutter stepping and jumping.   2) Weapons - Good lord are the things generally useless. A bullet spray that shoots in a random barrage of bullets? Why not just make it the ever classic spread from Contra? In this, the bullets might miss smaller targets generally, and require me to maneuver in bizarre fashions to maximize the damage from an enemy.   A misslie launcher? Sounds amazing, except it's not because the missiles generally have this nasty tendency to fly upwards after a few moments of being shot so they always seem to skirt *around* the enemies rather than at them! If that wasn't bad enough, the missiles are incredibly slow as well. Lame.   Boomerangs? Okay, these actually aren't that bad, but it WOULD be better if you could switch between them and your standard gun.   I could go on and on about them, but let's just say that most of them are a noticeable downgrade from your standard shot. This is absolutely not good at all. Sure, you can have weapons that are better at moments, but having them be worst in almost any conceivable situation is absolutely unacceptable.   I especially love how the drops are random, so until you actually remember the symbols for your power-ups, you'll never actually be able to know which ones are actually useful or not (just skip most of them). Even worse is that some of them are a 'partner' powerup, so there's no reason to not have those guys even if they have limited ammo and most aren't particularly helpful.   The Jet idea is pretty nifty but I feel like it's not utilized very well. Let's take the first mini-boss for instance, using your jet dodges every single attack it has, and even in hardcore mode, by the time it's actually ready to charge its next attack, your jet meter has already filled back up to the top again and can be used to dodge. I'm not saying remove the jet, but the enemies should have more attacks since the game knows that you will ALWAYS have the jetpack.   Lastly, I absolutely hate how the vast majority of the enemies are over your character's head but you cannot shoot up. That's not how you design something. Yes, I get that the jet pack is there to let you level out with the enemies, but it's excessive from as early as state 1, area 1-1. The helicopters should most definitely have a method of being shot at if you run underneath them outside of running backwards to shoot it (which causes enemies behind you to respawn), or running passed it; this makes it even more pointless to fight as it's no longer an obstacle.   All and all, it's not the most wretched game I've played-- it's not even really bad, it's just... Not good. In any real way.   Why was my review so long? I don't know, maybe it's a message to the developer so he can make a better game. I feel like if he made 'Jet Gunner 2' and got rid of the above problems, the game might be pretty good.",
            "review_score": "-1"
        },
        {
            "review_text": "Jet Gunner is a side-scrolling platformer with a late-era NES aesthetic that wildly succeeds in emulating the most frustrating and archaic elements of that era.   Enemies that fire immediately as they appear on screen, usually while you are mid-jump. Weapon powerups that have strange arcs that prevent them from hitting enemies directly in front of you. Massive knock-back. Vertical stages in which the bottom of the screen instantly kills you. Bullet-sponge enemies that necessitate a large life bar, resulting in a sloppy, inelegant play experience in which you can't finesse your way through a level but must rather brute-force your way through like a rabid speedrunner taking damage-- just to make it through a level, not to shave time.   These flaws could be overlooked or even appreciated as period-specific quirks if the visual and audio design of the game were more memorable, but they're just aren't. It succeeds at being a hard-as-nails NES game but that isn't really enough as unless you've played the entire NES library, there are probably dozens of better designed *actual NES* games that you could play and enjoy instead as well as better retro pastiche games on Steam.  That said, it still felt pretty ♥♥♥♥ing good to beat it.",
            "review_score": "-1"
        },
        {
            "review_text": "People keep saying that this game is trying to be like Contra, but personally, for some reason this feels more like megman to me. Except you can't charge up the buster, and you can get new weapons instead of having to defeat bosses to obtain them. Fun enemy designs, NES styled enviornments and gameplay, although with some artificial difficulty in the later levels, and a Rockin' soundtrack. Great job Sinclair! Oh, wait, it actually is a little like Contra. Contra themed stages, Contra themed bosses, and enemies. But if it was Contra, you'd be able to shoot in almost every direction. Still, Great Job Sinclair!",
            "review_score": "1"
        },
        {
            "review_text": "This game is cheap. And I'm not talking about the price.  The developer has resorted to adding all sorts of artifficial difficulty to the game, ranging from enemies that respawn and can shoot through walls to 1ups that don't actually add to your life count (although I think this is a glitch).  Do yourself a favor and avoid this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is   nice   and   2D  ...reminds me of Contra because its a little bit alike to Contra, this game is fun but its   difficult   for me...",
            "review_score": "1"
        },
        {
            "review_text": "I actually really like this game. I don't know what other reviewers are talking about... Controls are responsive, sound is great, and the gameplay feels exactly like a NES or Sega. It's really hard (but that's how old games were!!). It has a full screen option if you don't like playing in a window, and it just uses your monitor's native resolution and recreates the pixel graphics. Looks great, plays great... I would pay for this if it wasn't free in a giveaway!",
            "review_score": "1"
        },
        {
            "review_text": "When I first saw that game on Greenlight I just couldn't wait untill release. Then the game was released and so it bringed me a little bit of a dissapointment.  PROS  + Graphisc: These retro style graphics are just like taken from the best 90' games. Both the background and characters animations will make you feel like playing your old good NES once again. 9/10 + Soundtrack: Same for soundtrack. Perfectly suits the game, however it could contain a little bit more of tracks. Using same one for all 25 challenge stages was a bit annoying. 7/10  CONS  - Gameplay: The weakest aspect of a game. The thing that made 90's games special was their playability. This game have none. You can use only 2 buttons: fire and jump. Maybe it's same like in old NES games but when I launched it for a very first time I was suprised that I can't even aim my weapon up or down. You can only fire your weapon left or right - thats all, and with certain gun combinations it makes so hard to hit the enemies that are close to you. The physics are weak, main character is slow and the knockback is really annoying. 2/10 - Main story: The game has no story. Go to the space base, kill the Mother Brain -&gt; profit. In fact you don't need a story for an arcade game, but...  The levels (all 5 of theme, what makes game very short) are very unbalanced. You are dashing through very easy stage to face the hard boss. The further you are, the bosses are easier. Just like the devs run out of ideas for them. I was tryharding to beat first one but killed last 2 (including the final boss) for a very first try. The final 'F' level is nothing more than a boss rush when you just have to face all bosses again one by one without dying to reach the motherbrain. In fact, I had more fun playing extra challange mode levels than a main campaign. 3/10 - Level desing: As I said, the first stages are bit easy but still fun to play. There is almost no difference in difficulty between stages 1 and 4. However, the fifth one is hard as ****. But not in a challenging way. It rather reminded me IWBTG series, where everything was covered by spikes and traps and the only way to beat the level was repeating it again and again untill remebering locations of every single enemy and trap. 4/10  Summing up, if that game was released like 20 year ago, it would be just fine. But for now, it's definitely not worth its price and I would not recommend buying it. I hope it would change in a future as a game would be still develeoped.   But if you only want to bring some good, nestalgic memories back - go ahead and try it ;)",
            "review_score": "-1"
        },
        {
            "review_text": "It could be better but honestly right now I would recommend this game to anyone as there are better games of this type for a lower price",
            "review_score": "-1"
        },
        {
            "review_text": "It's Like Contra I remember my awesome childhood",
            "review_score": "1"
        },
        {
            "review_text": "This nails the late-80s NES games vibe very well. The limited color pallette matches; the indistinct enemies match; the brutal diffficulty matches; the controls are just as simple (move, jump, shoot ... you need more?). What it doesn't match is the tight level design and the compelling reason to keep playing that old NES games had.  It's definitely worth the low price for the nostalgia trip, if you ever played old NES games (think the original Ninja Gaiden), but it's far from perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, nice gameplay just like in Mega Man... I dont think is hard, is fun and the player can make infinite jumps is like a jetpack, oh wait is really a jetpack, awesome :)  9/10",
            "review_score": "1"
        },
        {
            "review_text": "As much as I'm a complete sucker for these throwback projects, Jet Gunner has some issues -- some quirks, some poor design -- that make it hard to recommend.  Some of the weapons are extremely specialized. A short-range flamethrower won't help if your target is far away. A gun that shoots two projectiles diagonally isn't much help when you're trying to hit a target across a gap. Specific-use weapons can be cool, but Jet Gunner seems to randomize which ones are placed in its levels. I would struggle against a boss with one weapon, and then completely murder him the next time around, because the game handed me a more effective gun at random.  You can get little robot buds that fight with you, like in Shatterhand. Man, I love Shatterhand. Again though, they're all over the place when it comes to usefulness, and the robot types available seem to be randomized. I know Shatterhand had a few dud robot designs, but at least you could plan ahead and choose the kind of robot you got.  Your character has a bit of acceleration/deceleration when moving. One recurring nitpick I have is that when you change direction, you don't  look the other way  until all of the momentum from the old direction is gone. It's hard to explain in text, but: running right, jump right, tap left to shoot at something in the air -- you haven't  turned  left. This can get pretty annoying during boss fights.  You have a jetpack that lets you float in the air for a short period, but you can't shoot while thrusting. A good number of enemies and bosses are placed high above the ground, and you need to stay in the air to actually hit them,  The 'old action sidescroller' is a simple formula, but it requires some attention to detail to make something that really clicks. I like the overall idea for this game, but I feel the execution falls a bit short.",
            "review_score": "-1"
        },
        {
            "review_text": "(⊙.⊙(☉̃ₒ☉)⊙.⊙)",
            "review_score": "-1"
        },
        {
            "review_text": "its similar to contra in sega i think but id prefer contra",
            "review_score": "-1"
        },
        {
            "review_text": "A wierd mix of Contra and Solbrain from the NES, but with a jetpack (!?) Not great nor bad. PS: Almost all weapons are useless",
            "review_score": "-1"
        },
        {
            "review_text": "cool game for 1 of the project company. I want to see more games from you Sinclair Strange",
            "review_score": "1"
        },
        {
            "review_text": "Jet Gunner is a game that I recommend because: - have a good price - is a method to banish boredom - is a indie game - have trading cards  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Muchos banter.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't quite get past the first level, but it still to keep me intreseting. I personally love the jetpack and the ability to fly in the game. Nice game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Muchos banter.",
            "review_score": "1"
        },
        {
            "review_text": "Good retro game.",
            "review_score": "1"
        },
        {
            "review_text": "It's classic. And its very good.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't quite get past the first level, but it still to keep me intreseting. I personally love the jetpack and the ability to fly in the game. Nice game!!!",
            "review_score": "1"
        },
        {
            "review_text": "contorls are quite confusing for starters... and I can't even customize my own control button(s) gameplay itself... feels like megaman or some sort... quite fun.. overall i rate 6/10",
            "review_score": "1"
        },
        {
            "review_text": "+ Nice 8-bit art style + Slightly above average soundtrack (with a few exceptions) + Challenging + Cheap  - Really buggy hitbox and hit detection - Above said exceptions   Overall this game has quite a few things going for it, and you're bound to enjoy it if you're only looking for a quick retro-fix. For anything deeper than that - I'd steer clear. The later challenges are nigh on unplayable, where you end up going through walls, and even getting stuck(!).",
            "review_score": "1"
        }
    ]
}