{
    "app_id": 314220,
    "name": "Bombing Bastards",
    "release_date": "2014-12-04",
    "developer": [
        "Sanuk Games"
    ],
    "publisher": [
        "Sanuk Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Arcade"
    ],
    "achievements": 17,
    "positive_ratings": 69,
    "negative_ratings": 43,
    "price": 6.99,
    "description": "Have a blast! Bomb oodles of nasty critters in a series of 30 wicked mazes! Defeat hellish bosses in heroic fights! Play solo or with friends in merciless battles! Embark on a hilarious journey with the witty Dr. Wallow to conquer the galaxy in this explosively fun arcade game!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/314220/header.jpg?t=1530865855",
    "minimum_requirements": "OS: Windows XP SP3 Processor: Intel Pentium Dual-Core E5200 (2.5GHz) or equivalent Memory: 1 GB RAM Graphics: DirectX 9.0c compatible graphics card DirectX: Version 9.0c Storage: 550 MB available space",
    "recommended_requirements": "OS: Windows 7 or higher Processor: Intel Core i5 or higher Memory: 4 GB RAM Graphics: Geforce GT 740 / Radeon R7 250 or above DirectX: Version 10 Network: Broadband Internet connection Storage: 550 MB available space",
    "reviews": [
        {
            "review_text": "All right. Lets get the big thing out of the way. This game blatantly copies the Bomberman series. Like REALLY blatantly. Even the icon designs look like they were taken directly from the titles. As such, you'll be seeing a lot of comparisons between this game and that series in this review.  The game is rather challenging and will be quick to ramp up the challenge from level to level, even early on. Unlike some games which will give you a small taste of a new trap or enemy before throwing them at you in full force, this game takes a trial by fire mentality. Those looking for a challenge will probably like what this game has to offer, just be prepared to adapt quick. Sadly, stages also tend to lack much variety from one another so the single player mode does get repetitive.  Aesthetically the game doesn't quite have the charm of the series that inspired it. The music is all taken from public domain and mostly seems rather understated. One problem that arises from the aesthetics is the playable character's design. Due to his bulkiness, it becomes difficult to tell if he is safely hidden from an explosion or still in the line of fire. Multiple self destructs have resulted from me trying to determine the character's hitbox.  Of course, given the inspiration, the game has a multiplayer battle mode. and if you liked it in Bomberman than you're in luck because it's literally an exact copy of everything from those games, from the level designs, to the power-ups to the stage gimmicks.   Overall it's a decent game. Not as good as the series it's clearly trying to be, but given the state of the Bomberman franchise ever since Konami bought it, this is probably the closest to a sequel we're getting for a long while.",
            "review_score": "1"
        },
        {
            "review_text": "Are you a fan of Bomberman ? Then you will probably like this game as well ! You don't know Bomberman ? Then you have to try Bombing ♥♥♥♥♥♥♥s if you are a fan of arcade games ! Warning : it can get pretty hard, especially against the bosses if you don't have a very good dexterity, and as there are no difficulty choice, prepare yourself to die several times.",
            "review_score": "1"
        },
        {
            "review_text": "Bombing ♥♥♥♥♥♥♥s is the modern arcade bombing game that we all needed. If you miss the online competition of Bomberman Blast and Bomberman Live, this game will make you happy.",
            "review_score": "1"
        },
        {
            "review_text": "I like especially the idea of having boss battles and some sense of progression. I would had liked that to be also in multiplayer.   However, after you play a little you start to see behind it. It is just a badly made clone of the bomberman game. I would had prefered the squares graphics from bomberman than this new graphics which is quite clumsy. There are often situations where you don't realize if you are correctly placed, you might be 1px to the right and that's the end of it. Game effects that happen on the map and covers the screen (character, bombs, enemies) and the actual difficulty for bosses is mostly just being so OP.  It's a nice game, I highly recommend to try it as a demo with the steam feature and if you like it go ahead and buy it. It iwll keep you busy some time. I don't recommend buying it for multiplayer at all.",
            "review_score": "-1"
        }
    ]
}