{
    "app_id": 314200,
    "name": "Bionic Heart",
    "release_date": "2014-08-13",
    "developer": [
        "Winter Wolves"
    ],
    "publisher": [
        "Winter Wolves"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Visual Novel",
        "Indie"
    ],
    "achievements": 24,
    "positive_ratings": 80,
    "negative_ratings": 27,
    "price": 6.99,
    "description": "London, 2099. The earth isn't what it used to be anymore. Incredible climate changes have corrupted the weather, causing a permanent rain on most of the Earth's surface. You play the role of Luke Black, a 36-year-old bio-informatic engineer. He is one of the lead programmers at Nanotech, a big nanotechnology research company.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/314200/header.jpg?t=1447362707",
    "minimum_requirements": "OS: Windows XP Processor: 1Ghz Graphics: DirectX or OpenGL compatible card Storage: 185 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Figuring I would check out Bionic Heart a bit while farming cards, I loaded up the game and started reading through the first chapter. Eight hours and 24 achievements later, I have to say I was pleasantly surprised.  Bionic Heart isn't the best visual novel I've ever played, there are certainly issues that prevent it from being more, but it has a charm that I wasn't expecting. The game's greatest strength is in the sheer number of choices you're given and the many branching narratives that result. Discovering them all and winding your way through different story paths is truly where the fun lies.  Our story takes place in the 22nd century, in a world that through some catastrophic event is perpetually shrouded in clouds and endless rain. The protagonist, Luke Black, works for a biogenetics company in London. It is this association that leads him to a fateful encounter with a bionic human, a meeting that will forever change his life.   OK, so it's sci-fi and a little hokey, but that's part of the charm. Some of the ideas are pretty interesting, such as the endless rain, foam meals (because real food is too rare and expensive) and Mars colony that I wish we could have seen more of. Other ideas are rather silly, but if you can shut off the part of your brain that scrutinizes everything for realism, the game is fun and easy to get into.  The artwork is polished and quite good compared to a lot of other English language visual novels. It's a bit refreshing to see a game that clearly isn't trying to pull off the manga/anime look and stands on its own. The character designs are detailed and interesting. And outside of a few backgrounds being a bit more sketchy than polished, the whole look comes together very nicely.  This visual novel has full voice acting, which is a big deal for a lot of people. I usually play with the voices on mute for this type of game, so I can't comment on it much other than what little I actually listened to before turning it off was pretty....bad. I know Winter Wolves doesn't have the development funds to pay for high profile voice actors, but the B-movie quality of voice work here really takes away from the game, and that's saying something as the game's premise is pretty much a B-movie.   My biggest gripe, though, is that the writing could have been a little more polished. Some of the endings had glaring typos, and the writing style was more casual in places than I felt it should be. I know this is probably a silly nitpick, but everyone calling each other by their first names, even people who have never met each other, drives me up the wall. Luke referring to his boss as Richard instead of Mr. Meier or just Richard Meier (and this is a guy who only met his boss maybe once before) just seemed so out of place and awkward, it kept pulling me out of the story.  Despite some of the issues, I really enjoyed Bionic Heart. I was lucky and picked it up in a bundle, but for what's here I feel the $10 price point is fair. Fortunately, there is a demo available if you want to try it out before taking the plunge. I'll definitely be purchasing Bionic Heart 2 when it's released. If it's anywhere as fun as this one, I'm definitely in.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice Sci-Fi VN playing in the 21st Century. You are a programmer. One day a female cyborg looks for hideout in your flat. You try to help her and are going to encounter a conspirancy and research in a hidden lab. They try to transfer human minds into cyborg bodies and keep them under control. A ruthless boss, a mad scientist and a suspicious reporter are your biggest opponents. Also nice to see your nice blonde GF Helen and some other naked surprises in this adventure. Just complaining about some useful walkthrough guides for this game. Then it would be much easier to enjoy the plot.",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  MOB Review: Bionic Heart&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "The story is good and the choices are fun. The voice acting isn't that great but it can be turned off. The game is short but there are 24 different endings that could be achieved based on your choices. Not the best game out there, but enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "We went in to this looking for some fun and adding our own 'unique' flare with our voice acting skills, but when the adventure was over I can safley say we were suprised. All your decisions and locations you visit will effect your final story outcome and with plenty of different endings there is a lot of replay value here. the story is engaging and if you are as despicable as us then you will try your heart out for the human / robot three way          YouTube™ Video:  Bionic Heart Play-through - Part 1&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I gently caressed a cat and slept with a robot all while voicing my actions, observations and thoughts out loud in great detail.   10/10 Would play again",
            "review_score": "1"
        },
        {
            "review_text": "At first I just got it for steam cards.  But then just to see how it looks I found the story compeling, good and that the Sci-Fi theme mix with Visual Novel works fine for me. Voice acting is not that good as on other games, although it is not completely bad; somewhere neutral I would say. Got some endings. Got the Happy Ending.  Also boobs, but always neatly packed.",
            "review_score": "1"
        },
        {
            "review_text": "It was an interesting visual novel, but the storyline was sub par, voice acting even worse, and I found myself skipping dialogue often after my first playthrough. The game and story was short and hopes to live through its large variety of endings. Overall, even for the sales price, I still wouldn't suggest this game to tohers, there are better visual novel games out there.",
            "review_score": "-1"
        },
        {
            "review_text": "story is interesting .. but stupiditly small .. waste of money bcoz of small story !",
            "review_score": "-1"
        }
    ]
}