{
    "app_id": 314380,
    "name": "Lantern Forge",
    "release_date": "2014-07-18",
    "developer": [
        "Hearthfire Studios"
    ],
    "publisher": [
        "Hearthfire Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Sandbox"
    ],
    "achievements": 0,
    "positive_ratings": 146,
    "negative_ratings": 120,
    "price": 6.99,
    "description": "Lantern Forge is a sandbox survival game with building, crafting, and RPG elements. Mine and forage for resources to build a home, plant crops, and craft weapons and armor. Then venture out to explore the wilderness, find hidden dungeons and temples, fight unique monsters, and collect the treasures they guard.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/314380/header.jpg?t=1447362717",
    "minimum_requirements": "OS: Win7/ Win8 Memory: 1 GB RAM Storage: 400 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Development has stopped - Been inactive for god knows how long now, was looking forward to seeing this game finished but unfortunately all I got from it was a lighter wallet and a lite RPG Hack N Slash.",
            "review_score": "-1"
        },
        {
            "review_text": "UPDATE: Since development on this game is no longer taking place (read the forum post from the Dev), I no longer have a need or desire to update this initial review.  ================================================  As long as development continues and they fix the major complaints people have, this review would probably change. Those issues include the very obviously clunky movement scheme(s), the lack of real content beyond cosmetic crafted items, the almost missing survival aspect, and many others.  My biggest gripe is probably with the 'Town Center' aspect - what is the purpose of having these vendors come and set up for only yourself. It is an obvious nod to Terreria, but with even more limitations. I would much prefer to have other NPCs as if I were actually creating a town - with houses, shops, people walking around, etc. I wish Terreria had this too...  The second major issue I have is that progression in this game just doesn't flow smoothly at all - too much work for too little payoff.  The game can be enjoyable, but after some serious playtime with it you will more than likely wonder why continue. Again, if they can fix or change these things, my review would also change.",
            "review_score": "-1"
        },
        {
            "review_text": "To counter some of the, IMO, unfair negative reviews, I'll add my two cents.  This is a $10 game. Yes, the devs sort of left us hanging and it hurts since the game is very fun and has a lot of potential to be something more, but the game you do get is very enjoyable and has a lot to do for that $10, and has replay value.  The devs have also been poking around and patching a bit lately and have improved performance (one of my biggest negatives since changing z-levels was painfully long) and added some content.  The characters are fun to play and build, there's several tiers of crafting, lots of gathering and building to do, lots of exploring of procedurelly generated open world/underground to do, several different types of biomes both above and below ground with a nice variety of mobs and content to experience.  For the whopping $10 I think this game is definitely worth it - you can easily play enough hours - and have fun doing so - to make it (more than) worth the cost. I feel some of the negative reviews are way, way, too over the top in criticizing what is a decently feature and content filled game for a low price.  I could definitely come up with a list of other early access games or even released games that cost more money and/or were far more disappointing. Some people just have too much time on their hands to troll and be negative and/or have ridiculous expectations for very low cost indie games.  PS - I have over 46 hours played, mostly before recent patching. The top negative review is by someone with 6 hours played and IMO it's kind of silly for someone to be complaining about a game being incomplete when they haven't played enough to complete what IS there.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed it starting out, but there was a lot wrong.  The over abundence of crafting mater was wrecked by everything having low durrability. The fact that you basicaly had to carry your base with you to last any length of time, but had to go back just to drop the loot you don't need. The fact that nothing you did felt like it mattered. And let's not forget that they have a memory leak that only let you play for five to ten minets at a time. Then I hear that the devs have abbandoned this promosing game. Leaving it to rot, incompleat! Those out there thinking to buy this should go to something else, this isn't worth it, unfortionatly. This is the dark side of buying an early releace game.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game base, Good crafting system, Very incomplete.... after about 5 or so hours of gameplay it becomes broken, AI Horrible (often destroy themselves),   Would probably be a great game when/if it is completed....  So... umm... what happened to the October update? Cancelled? Postponed?",
            "review_score": "-1"
        },
        {
            "review_text": "Would've been so good with co-op. Still fun, just wish I could play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "(Note) Seems to me like its turned into a dead end game thats never going to get future updates due to the fact that they've yet to relase any information on the pending updates in a very long time... sad really :|  Diablo 2 + minecraft. A Perfect adventure sandbox game for those out there that crave the combat sandbox types. I would recommend this game to anyone, its great.",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game. people that love minecraft will fall inlove with this game straight away. it has it all with a nice and easy crafting system that doesnt leave you wondering how do you make this. farming that is easy and never has a time limit before wilting , you can leave stuff planted for ever if you wanted and it would still be usable. you can hunt mobs on the surface scaled to your level or go underground and mine and fight mobs of that floor level if you find the surface mobs too hard for abit. make your farm and house the way you want, no limitations to how big or small you want to make things. exciting bio's to wander around and find. from dersert to graveyard to fairy to grasslands and more. build as many places as you want if you want 1 in each bio area :) as with any game there are some bugs/glitches but the dev's are always working hard to fix them as they pop up. you won't be disapointed with this game ever its the absolute best game of its type out there on the market these days.",
            "review_score": "1"
        },
        {
            "review_text": "Play it safe, stay out of the shadows. Get copper. Kill.",
            "review_score": "1"
        },
        {
            "review_text": "i really wish there was a tutorial... i,m starving and i have no idea what to do",
            "review_score": "1"
        },
        {
            "review_text": "short-&gt; it's entertaining but in beta state  This is your typical surviving and crafting game with elements from Don't Starve, Minecraft, Terraria and Towns. It's played in isometric view in a randomized world. As always you can collect and mine ingredients and cook or craft them at various tiered workstations into other stuff. There are not a lot of flavor items however and I hope more will be added so that my base looks less boring.  Monsters seem to spawn from the dark or monster dens.  You can craft vendors and have some kind of town. There is no story whatsoever - sandbox only. Don't know if there is some master boss like in Minecraft.  Issues with the game include: no pathfinding except between two open points straight, crashes to desktop sometimes, non-intuitive controlset and odd placement of walls and fences, also loading times on state-of-the-art machine. Stuff I like: randomized magic loot, rpg style experience levels, (somewhat) easy to get into the game.  Recommended because it's fun but needs a lot of polishing. I'd say it's like 'early access'. I will watch closely if more efforts are made by the dev and update the review accordingly.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a mix of minecraft and so much more, this game has all. I like this game and any one who like minecraft and better creatures and the AL is very good... 'UNLIKE' Terraria and Dig or Die that has a very difficult build system to much is not allways good and the placement of items need to do so are poor with unblanced boss guarding items... Lantern Forge has balanced this all out and the build system is easy to do with a lot of cool items to do this.  Giving this one of the best games built in 2015",
            "review_score": "1"
        },
        {
            "review_text": "Delightful game with endless exploring! I've enjoyed finding materials to build my house, and later town shops. Exploring underground for mining supplies and creatures to kill for gear has kept me entertained all weekend long. I absolutely recommend this game if you like sandbox Minecraft-type Survival games. With 3 different difficulty modes its perfect for all paces of gameplay. For the price, it is a phenomenol game!",
            "review_score": "1"
        },
        {
            "review_text": "VERY slow start, and no real objective to work towards (That I can see) outside of the ones you set for yourself - Considering the low cost and the fact that while you have to learn EVERYTHING on your own or with a steam guide, it helped me pass a few hours - It's alright - I can definitely see this game going places, but only with some sort of story to work towards, or perhaps a multiplayer option?   I was an adventurer/ranger in skills, focused right away on getting a grass bed and an apple orchard set up (Trees drop ~3 apples a day - 10 trees will give you more than enough food, and even some to sell when you get a couple stores set up) At the moment I'm working on building the town - so far I've got a pretty basic mine started and 2 shops open.  (Once you figure out you can hit 0 to place blocks and stairs into the ground you're usually set) - Especially since the dirt and sand blocks I ripped up let me make more apple trees XD  6/10",
            "review_score": "1"
        },
        {
            "review_text": "the game is buggy to say the least and it lacks alot of content. crashes on random intervals and refuses to load from time to time on top of the lacking controls and terrible building mechanics. frankly... they need to pay me to play this",
            "review_score": "-1"
        },
        {
            "review_text": "This game is early-access for a reason, it's not perfect. However, even without the polish, Lantern Forge still offers an immersive, satisfying gaming experience. It lacks a comprehensive tutorial for the newcomers, but the developers and community are chock-full of advice and posts for those struggling with the initial get-go. Although, with just a bit of experimentation, it doesn't take much to figure out the gameplay mechanics and come up with your own strategy for how to get going in the world.  Controls can occassionally frustrate with pathing problems during combat, but holding down SHIFT will lock your character into attack mode and prevent you from just walking off toward your pointer. Combat isn't possible without some kind of weapon (no running up and fist-fighting your friendly neighborhood goblin), which limits your options severely until you're able to gather the first tier of advanced materials for class specialization. Before then, it is possible to use your starter tools (stone whatever-you-make) as a form of defense. (Not recommended for mobs). There is also a lack of bosses in this world, but the developers have stated they are planning on implementing them.  Leveling up yields you points for stat calculation and skill tree building. The list of skills is not extensive and with only five points to cap out a skill, it doesn't take long to build your strength. Which leaves acquiring gear matched to your level to deal with enemies (also at your level) the basic challenge for combat. Which leads to trading.  The option to create shops for trade does seem to take some of the challenge out of the game. Copper (the in-game currency) is pretty easy to acquire, so trading with the shops can be almost too lucrative at times. It makes finding the gear you need just as easy as a visit to the merchant you've created, which unfortunately levels with you and allow you to acquire gear before you've reached the necessary underground level that would yield the same material.  This is a 2-dimensional isometric world, which limits your movements to a standard 2-dimensional format. But the graphics are engaging with a charm that has quite an appeal.  As a final product, I wouldn't recommend it. But as a work-in-progress with a dedicated development team who have stated that there is still work to do before the game can be considered final, I say the price is right.",
            "review_score": "1"
        },
        {
            "review_text": "Overall I quite enjoy the game, certainly plenty to do and freedom to roam. Ultimately however I found the durability particularly on tools to be extremely frustrating:  Craft a stone pickaxe: Mine about 6 blocks. Your tool is broken! Craft another stone pickaxe....  I got excited when I found copper ore, and I was like yeah! Better tools! Except I only found a few copper, after digging dozens of blocks and shredding stone pickaxes at an alarming rate...made myself a copper pickaxe and was disappointed that while it had more durability, I could now dig 16 blocks and it was junk, and then I had to dig another 100 blocks while shredding stone pickaxes to even FIND another copper cluster.   I'm not suggesting durability be removed completely, but as it is, half of my total game time was spent replacing tools, and even once I got to higher tier metals I found making tools out of them to be a waste due to their rarity and the degradation rate.   Aside from that little mini-rant, yes, I like the farming, the dungeoning, the searching for stuff, the building, its all great,",
            "review_score": "1"
        },
        {
            "review_text": "Not a fan, played for about an hour. The controls are confusing, the crafting system while extencive is over complicated. I'm sure theres a method to it all but after an hour and only having a stone oven, no weapons and being beaten on while i run for my life at night... This game still requires some fine tuning and more options for control schemes. Why cant i use WASD to move around? my only options are 'click to move here' or 'push the move button to move to wher your mouse cursor is' and you can look at your inventory while you move so if your 'weapon' breaks (and i use the term loosly because you'll be forced to use a stone axe or pick) you cant even try to craft one on the fly.",
            "review_score": "-1"
        },
        {
            "review_text": "Overall a interesting sandbox game with a decent amount of content. But the frequent crashes and frequent loading times make this game not really worth the price.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoy this game alot I am waiting for some new updates and the game runs kinda slow sometimes it will glich sometimes id love to be abile to build a house i think that would be cool and in the inventeory maybe a sell it now instead of just a delete button I love this game it still needs some updates thou ill still be playing and waiting for updates .",
            "review_score": "1"
        },
        {
            "review_text": "dont buy the game its a waste of money the dev are counting the money and left the game to rot",
            "review_score": "-1"
        }
    ]
}