{
    "app_id": 314320,
    "name": "GamersGoMakers",
    "release_date": "2014-08-08",
    "developer": [
        "gnifrebel Games UG"
    ],
    "publisher": [
        "gnifrebel Games UG"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Indie",
        "Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 302,
    "negative_ratings": 79,
    "price": 6.19,
    "description": "In GamersGoMakers, you found a little company creating the first video games in history. Create your first game with only basic sound and simple graphics available in the year 1980. You´re one of the pioneers entering the rising global market for computer games.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/314320/header.jpg?t=1447362716",
    "minimum_requirements": "OS: Windows XP SP3 Processor: 2 GHz dual core Memory: 1000 MB RAM Graphics: Hardware Accelerated Graphics with dedicated memory Storage: 150 MB available space Additional Notes: Min screen resolution: 1280x768",
    "recommended_requirements": "OS: Win 7 Memory: 2000 MB RAM Graphics: Hardware Accelerated Graphics Storage: 150 MB available space Additional Notes: Min screen resolution: 1280x768",
    "reviews": [
        {
            "review_text": "A lost of people are saying that it is a 'ripoff' of Game Dec Tycoon, and I have this to say first and foremost. I've played Game Dev Tycoon and yes, this is somewhat similer, but it is NOT a rip off of it. It has similer graphics, yes, and similer machanics, but it is different in a lot of ways. Before you criticize it, you should actually jump off your high horse and play it, or the demo. Grow up, you fan boys.   Now to the review.  This game is pretty entertaining, I've been playing it for a few hours, and it is addictive. You can take your company from being one of the first, to the best of the best. I started with 150K and after a few hours I am up to 80 Million, My company is the #1 company in the world inside the game, by simply following the 'Call of Duty' game plane of making the same game every time and just changing the name and the storyline. Overall, it's a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Yes it kinda looks like Game Dev Tycoon but GamersGoMakers has way more features and im sure that if u liked Game Dev Tycoon u would love GamersGoMakers",
            "review_score": "1"
        },
        {
            "review_text": "NOT A COPY OF GAME DEV TYCOON. Its way better. Yes i have both.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of feedback on this game is focussing on the fact that it is similar to GameDev Tycoon. Yes it does seem to be heavily influenced by GameDev Tycoon, but that is not necessarily a bad thing. GameDev Tycoon was a fun game, but the game never gave proper in-game feedback on why certain games were popular/unpopular, and players had to resort to the wiki page to figure this out. In GamersGoMakers you get useful feedback on games that you develop that allows you to alter and improve your strategy as you play.  The user interface is a bit clunky, especially once you have hired staff. There is also less animation than in GameDev Tycoon. The game could be a lot better if the developers improves and streamlines the user interface some more and includes a bit more animation to make the game feel more tactile.  Overall it is a fun game and probably worth the 10$, if you really like tycoon/management/simulation type games. If you are not really that into this genre, perhaps wait until the devs have improved the user interface.",
            "review_score": "1"
        },
        {
            "review_text": "So of course you are wondering... is this a GDT Clone? The answer is no.  GamersGoMakers starts out fairly similar to GDT, but it starts to feel very different once you start really playing the game. I really like the interface for designing games. The ability to compare previous games of the same type helped put out some very nice titles.   The devs seem very responsive to issues in the game (in my experience) which bodes well for any company and I have high hopes for them, and will definitely pay attention to future titles.",
            "review_score": "1"
        },
        {
            "review_text": "really nice game but game need some bug fixes and new features for example i was creating simulation sport game i dont know witch i need to master  sound content desing or what please fix it thanks  for this awsome game 8/10 whaiting for new updates ^^",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! It may not be pretty or have a great sound track but ithas the depth and bredth that Game Dev Tycoon lacked.This game does have a few minor issues but they are completely patchable and so minor it will take a while to notice them. One thing i like about this game is the abundance and usefulness of information you get when making and releasing games! Another thing to like is no sliders, just definitve icons bars, unlike in game dev tycoon! Also this games tutorial and tooltips are super helpful! The tooltips mean you don't have to check the wiki every five seconds like in GDT to figure out if the game is gonna bomb! Another things to love is competition. Unlike in GDT where you play against yourself, which gets progressively less appealing as time goes on. Another good thing is that you can only do training ONCE so that empoyee skills largely come from skill and experience, not infinite money and training. The technology branches in this game also make good sense but do not require pesky research points like in GDT. Also, when hiring staff you dont have to spend 200k looking for excellence. The employee pool can be seen and examined easily in the hire staff menu. Another thing i like is that employees can only work in one category so you don't have to deliberate over the proper roles of potential hires for 5min on the wiki. A nice feature is the competitive awards of the month/year etc which i feel are better implemented in GGM than in GDT. Another nice thing is that all the topic options are unlocked for the genre you slected so that one employee isn't always occupied researching new topics. Overall this game is an excellent competitor to GDT and represents a more competitive and player friendly approaoch than in GDT. I would definitely reccomend GamerGoMakers to anyone who loves industry sims or likes GameDecTycoon!",
            "review_score": "1"
        },
        {
            "review_text": "If Game Dev Story created the big bang of the genre, and Game Dev Tycoon set the standard, then this game would up the ante, right? To answer that question, yes, very yes.  Well for one thing the graphics look pretty good, however a select few console look a little unpleasant. The soundtrack is varied and sound great and the gameplay is sometimes challenging. There is some bugs, but that's fixable and only minor. Some of the features are confusing such as buying competiors (As of this writting I have no idea how to it). And the console amount is higher and more accurate than Game Dev Tycoon (Sega Saturn included).  The verdict is that this game is great and sorta pushed the limit of this genre a tad further. 7.6/10",
            "review_score": "1"
        },
        {
            "review_text": "Very, very similar to Game Dev Tycoon. I mean INCREDIBLY similar. Game Dev Tycoon had a very distinct quirkiness and feel and this imitates it entirely.  The content of the game is also very, very similar; making a good game is a clunky and unpredictable as it was in GDT and often makes little sense. I received feedback that my FIFA World Cup licensed game didn't have enough sex in it, for example. Most of the time you seem to be trying to guess whether the development team believes that a certain genre needs, for example, decent graphics. For reasons that make little sense to me, this is considered very important in casual games. And that kind of trend continues.  Did I enjoy it? I suppose so, but then it just feels like a minor update to GDT and nothing more really.  Being similar to GDT wouldn't be such an issue if they hadn't copied all of the flaws from that game in designing this one.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious game. Complex and entertaining. (Also the soundtrack is very well made! Kudos to the sound-department!)",
            "review_score": "1"
        },
        {
            "review_text": "Interesting Game...give it a try",
            "review_score": "1"
        },
        {
            "review_text": "This game is definitely undermined. If you want to reenact when Nintendo made Zelda, when Bioware made KOTOR, heck, reenact the making of THIS GAME, this simulation is for you. It's been really fun being apart of the making of this game. At first, this game didn't work on my computer, but thanks to a recent update and the help of the developer of this game, it started working again. I do think the price is a little bit high for a game like this, but I'm sure the GamersGoMaker makers (try saying that 5 times fast) will make it worth your coins.",
            "review_score": "1"
        },
        {
            "review_text": "I have an odd feel towards this game. Not so hot graphics, not so great menu, and a lack of workshop. Despite all of that though, it's superior to Gamedev in everyway. It takes the parts of gamedev that were unenjoyable and either made them fun or took away the hassle. Maybe an 8/10.  Though there is a flip side. I don't usually play it, but when I do, I log about 8 hours in a couple days time.",
            "review_score": "1"
        },
        {
            "review_text": "I used to enjoy this game when I bought it, now it's been about 3-4 months since I've played it. In about 6+ months there is NO patches to fix bugs, and these bugs can lead up to crash and game not saving.  As stated 6+ months ago and still no patch, I would not recommend buying this title. Current state, even though it is a full release, it is not even in a polished beta stage.  Project is dead.  DO NOT BUY!",
            "review_score": "-1"
        },
        {
            "review_text": "Game is very Buggy and has not been updated Since November 2014 (6 Months Ago). Get Game Dev Tycoon, Way Better.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring, repetitive. Buy Game Dev Tycoon instead.",
            "review_score": "-1"
        },
        {
            "review_text": "What was once a brilliant game was surely ruined by an egotistical developer who is just after 'free money'   Spend alot of time working on the game, creating PGF Expansion Pack. Most of my game time was simply due to testing the EP out.  Wonderful game but has major flaws. I would love to recommend this title to you, but sadly its just money wasted.  I've removed PGF Expansion Pack from the discussion page as well as the ability to download it after talks with the developer.  Sorry everyone who liked the 'addon'",
            "review_score": "-1"
        },
        {
            "review_text": "GamersGoMakers is in every way similar to Game Dev Tycoon.  It feels like the developers saw Game Dev Tycoon, copied it, went further and deeper in the content but didn’t do it very well and the result was a much more complex and not so easy-going game.  While it goes deeper in some aspects and gives much more feedback in the reviews, it also requires much attention and precision to come up with a good game. In fact, just early on as soon as you develop certain technologies like A.I and User Interface, it will be almost impossible to develop anything just above the average.  GamersGoMakers also feels a bit unfinished and rushed and there’s no sense of progress throughout the game.  The best is definitely the soundtrack – nice and cool soundtrack that fit the game perfectly.  I would say that Game Dev Tycoon is still better as the user interface is more interactive and simple and despite not going so deep, it is simple and ends up being a better experience. ",
            "review_score": "-1"
        }
    ]
}