{
    "app_id": 314410,
    "name": "Rampage Knights",
    "release_date": "2015-09-04",
    "developer": [
        "Rake in Grass"
    ],
    "publisher": [
        "Rake in Grass"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Co-op",
        "Online Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "Beat 'em up",
        "Co-op"
    ],
    "achievements": 84,
    "positive_ratings": 2301,
    "negative_ratings": 189,
    "price": 8.99,
    "description": "Rampage Knights is a cooperative beat 'em up game mixed up with randomized dungeon crawling and exploration, which you can play alone or with a friend online.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/314410/header.jpg?t=1527857602",
    "minimum_requirements": "OS: Windows XP/7/8 Processor: 1GHz Memory: 1 GB RAM Graphics: OpenGL 3.2 compatible Storage: 150 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " [Disclaimer]   Before I say anything about the game, I'd like to point out, that the developers are the coolest people I've ever met. Free updates, tons of content, superb communication.   The Game itself   Rampage Knights is a rougelike dungeon crawler. If I had to sum it up in one sentence, I'd say it's the love-child of Bindings of Isaac and Dark Souls. The game heavily focuses on Multiplayer (Both Local and Online are Co-Op are available), but it can be played alone aswell.  { Sidenote : This game has an amazing controller support, both DirectInput and XInput controllers are recognised in an instant }  The game has endless replay value. I've been trying to get all achivements for a while, but before I could finish the last 5, a free update arrived with  TONS  of new content. Every playthrough is a different experience, thanks to the random drops, random bosses, and the available classes, of which there are 6 at the moment.  I can't recommend this game enough. The fact that it's only 11€ is just another example how amazing the developers are. With this quantity and quality of content, I wouldn't mind paying even 50€ for Rampage Knights.   If I had to give a rating, it would obviously be 10/10",
            "review_score": "1"
        },
        {
            "review_text": "*HALLOWEEN UPDATE* ~~You know, I gotta hand it to the devs. I had stopped playing this game for a couple of weeks and the new update hit. Me and my friend jumped in to see what changed. There are a couple new enemies and alot of new items. Just that small halloween update made the game so fresh that we've almost beaten hard on every class now (from having only beaten it on one class). I'm amazed by how much life was breathed back into this game by just a small content update. These devs rock. You should buy this game on the spot.~ Stay spooky everyone ~   I love this game, it really scratches an itch that Castle Crashers left for me. But honestly, it plays alot better than Castle Crashers. It's got better combat, less 'stun lock the enemy by standing still and attacking' and a large number of item drops to customize your character. There's alot of different head styles that also change your skin color and hats to go on top of them. My personal favorite combo so far is to play a Troll Barbarian with a Skull helm.  So far each run has felt very unique to me.  The first run was me dying to silly mistakes like falling off a bridge. Second run was actually learning how to play well. Third run was unlocking the barbarian, I was also the ugliest face/hat combo I think I could have accidentally made. My barbarian run was me slaughtering everything with brute strength, finding a flaming greatsword and learning a fireball spell that carried my unskilled butt long enough for me to feel like i've gotten good at the game.  Game plays very well with a controller. I think it's very well worth it's price tag, good handfull of classes that play very differently to replay through the game with. A pretty good string of unlockable difficulty modes, ONLINE/LOCAL CO-OP I havent played but I know will be amazing.  If you like the action beat em up style game, this game IS for you. The two pack is worth it.  EDIT: My favorite part of playing this game with a friend: 'Bring them up here so I can knock them into the pit' *Instantly knocks me into the pit* 'Damnit Cory.'",
            "review_score": "1"
        },
        {
            "review_text": "  Demons asked their master 'But can we defeat the Alchemist with what we got?' Warlock answered ' Well I got rainbow arrmor, flaming mittens, ice boots and an axe. Well at least we gonna fail in style!'",
            "review_score": "1"
        },
        {
            "review_text": "This is what a good solid Indie game should be- fun, easy to pick up, well-executed, performs well, and it has great replay value.  It's a game that's drawing heavily from Double Dragon, the classic arcade series. Gameplay consists of smacking, kicking, throwing and generally causing mayhem in diverse levels that have all sorts of interesting obstacles and challenges.   While I feel that the game would benefit from having a more diverse cast of fundamental weapons (there isn't the difference in game mechanics of Double Dragon's nunchuku vs. a bat, for example) the combat mechanics are solid and fun.   What really makes it work, though, is the diversity of the special attacks. While some of these could use some balance tweaks here and there (for example, there is a power-punch attack that works great but takes too long to charge up to be practical in a big fight, whereas the Lightning Rod is easy crowd-control fun) these mechanics make everything click well.   I also wish there was a mechanic to return to the town and spend money on a new run; most times, a good run is pure RNG luck and there isn't much sense of long-term progression at the moment, other than unlocking Classes, which give a slightly different take on the core gameplay.  Replay value is excellent, and the short duration of the zones means that this is a great game for those of us with limited time budgets for video games.",
            "review_score": "1"
        },
        {
            "review_text": "Really super epic game. Played it local coop with two friends (two at a time, so we would switch seats) and had a blast. So I guess I recommend it for this type of gaming.  Game is easy to jump into for a quick round, but also keeps you interested if you want to spend many more hours on it at a time. New things kept appearing even after 20 hours of gameplay. It can be very challenging, sometimes even too difficult, but it is also really funny. Even dying soemtimes can be hillarious. So art style, gameplay-wise, sound-wise, it is an excellent game and I recommend it to everyone.",
            "review_score": "1"
        },
        {
            "review_text": "Co Op is fun but challenging because the items are split to each other  Solo can be fun but easier because you get all the items  ;maybe in a future update or expansion, solo can be more fun, just like Co Op   But other than that, I would get you and your friend this game and have a few laughs when you knock eachother off a chasm just like my friend always does to me.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game!  Feels like a combination of  Golden Axe  and  Binding of Isaac . A lot of achievements, challenges, difficulties and other unlockables!  AND you can play this with your friends!  Great game. If you enjoy  roguelikes  or  beat 'em ups , strongly consider buying  Rampage Knights  since this game has both genres equally well represented!",
            "review_score": "1"
        },
        {
            "review_text": "Well, its fun with blood and funny combos and moves. but a bit on the hard side. here are my issues (anything writin inside these is after 400+ hrs of play) 1] I mean Normal PermaDeath, unpassable deamon permascrew alters without scroll. Oh wait its ok there is a casual mode! Wait this is just as hard if not harder then normal.... Still unpassable deamon alters with permascrew curses! (You will soon find casual mode way way to easy)  2] I enjoy the variety of enemies the game has to offer. some easy to kill some very very hard. I DO NOT like the fact every enemy has every ability. archer kick me and swordsman throw daggers there is no escaping from anything! I dont think they should all have close and long range attacks. one or the other for god sakes. its just a Sh!t fest late game of stuff flying through the air. (this game is purely ment to kill you, though you will find yourself with an advantage in many runs. items have been added and the game is more complex now)  3] The maps are cool, but i find myself on the same ones alot with little variations to them.(rooms have been added and other modes as well, the RNG is better for rooms now)  4] Weapons and stuff are very cool! I like the different build possibilities. Dont seem to get many good items in Co-op also same amount from chests and stuff more people? (the game would be to easy in the long run of things otherwise, this adds alot of depending on your allie not to help kill you :P )  5] Potions, ok lol very creative and funny with friends... But now that i have played alot I...we all just avoid 75% of the potions because they are bad.... WHY? i mean they drop these potions on almost every map! They are use less and have no plus only neg affects?( I found many uses for potions late game, you will have to see for yourself but really fun stuff)  6] Hitting your team, this is awesome! I love that i can just rage out on my friends and they take no damage.. I would also like a way to turn this off. maybe idk CASUAL MODE!!!! that doesnt seem very casual right now. :P (again casual mode is a joke lol)  7] Combos, love the combos! Some are very funny, pick up\\throw is great! WANT MORE! i mean just a few more complex higher damage move combos would be nice. It would also be nice if i could say, Grab a Co-op player and combo throw him into enemies doing extra damage. (there is no way you will coordinate such attacks with the chaos style of the game)  8] Last one! and this is just a peeve, shields! where the F@*% are my shields! i see every other enemy with a shield that is a pain to break in small areas! Why the hell dont i get a shield? Yes yes they dont really have armour and we get to but. there are also 100's of them and 1 of meeee!!! (I still want a shield lmao but have found it would make the game to easy)  Guys over all this game is fun, just needs a little work I believe. I am sure there will be some changes good and bad as all games go now a days. I give it a 9-10 if they want the 10 or more they gotta some things :) (LIKE DLC's SO YOU CAN TAKE MY MONEY because this game is awesome!!)",
            "review_score": "1"
        },
        {
            "review_text": "Just got a 2-pack of this, played w a friend and alla sudden it was 9 hours later. this game is a good mix of golden axe, spelunky, and torchlight.... and a bit of card hunter in there with the sophomoric humor. gives you the same little endorphin rush that finding loot can generate, but without the time investment of a diablo or wow.   in particular i have to give a nod to the simple mechanics they implemented that make the game fun, like the trade-off items and the death mechanics in co-op between being able to knock around but not kill your friends with damage and the ghost mechanics when you die.  the one thing is that i can't say how fun it would be if i didn't have my friend to laugh at when he drank the wrong potions in there with me, and by this i mean him laughing at me when i drank the wrong potions because he'd nope out every time.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful mixture of multiple game elements! Think of the addictive yet chance/skill portion of gameplay and randomly generated maps (Each time) from The Binding of Isaac along with Castle Crashers (A gory beat em up game) and lastly a permadeath kind of game in which for the most part you lose the items you found (Unless you find a permanent upgrade, which is very rare) similar to crypt of the necrodancer  If you mix these aspects from these games, you got an addictive fun beat em up that will SURELY keep you going and offer PLENTY of replayability!",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game to play offline when you need to pass some time, and it doesn't actually get boring even if it seems like it's a repetitive game. Other than a pretty high price, it's a pretty good game.",
            "review_score": "1"
        },
        {
            "review_text": "What a harmonious game. Awesome 2d beat 'em up with roguelike elements that obeys all the laws of a quality co-op brawler. Tight, precise controls and a diverse set of equippable items. Great replay value with frequent updates and strong support.",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite good, simple mechanics but hard to master them, a lot of classes with their own quirks and skills a lot of variety on items and enemies, fun bosses, and its quite hard to find this mix of genre a good roguelike with brawler, if you are into either of both genres, you should give this game a shot",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game to play local co-op but it's amazing as singleplayer regardless (I haven't tried online co-op yet, but I am sure I will). The rogue-like Binding of Isaac feeling with the loot and effects along with the skill-based sidescrolling hack'n'slash is extremely enjoyable. I currently have a crab-clawed Barbarian hauling along two lightning orbs and a chicken. As eggs are layed, lightning bolts are shot and large swords swung I cackle madly.  For that alone please make sure to buy this game 1,000 times and give it to everyone you love.",
            "review_score": "1"
        },
        {
            "review_text": "its v good tight control gratifying gameplay gud with pals",
            "review_score": "1"
        },
        {
            "review_text": "Most fun ive had in months. Great value for money. So many laughs. Reccommend purchase even at full price.",
            "review_score": "1"
        },
        {
            "review_text": "Could do with longer playthrough but apart from that, it's pretty much a ♥♥♥♥ing amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "Watch out for ♥♥♥ disease.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game, its fune but only for a couple of days. It's short. really short. There are achievements for a sub 30min playthrough ok? It has replay value, you unlock classes, difficulties, and everytime there is different loot / enemies on the maps. The coop is great, we had some desync's but they don't really hurt much. For me, it was too short. After 9 hours I have unlocked all classes, played through it a couple of times in coop and got kinda bored of it already.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game but very randome game!",
            "review_score": "1"
        },
        {
            "review_text": "cool game, watch your step.",
            "review_score": "1"
        },
        {
            "review_text": "-Is it a good game? -Yes, it is. -Is it a great game? -Not even close. Still recomend it though, if you dont affraid of being frustrated by losing a run, because of the impossible to make jump.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most fun games with a friend. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Playing this with a friend for a while now  We both died from picklocking a chest 10/10 You can be a ♥♥♥ 10/10 You can be a f*cking ghost and can hit your friend and let him fall of the map 10/10   But seriously this game is so much fun, Playing solo is awesome too !:D",
            "review_score": "1"
        },
        {
            "review_text": "I didn't played it much but it looks like a nice game and also a bit expensive",
            "review_score": "1"
        },
        {
            "review_text": "Really Fun Game!",
            "review_score": "1"
        },
        {
            "review_text": "BEST game ever i play with my friend all the time the only problem is that we think the devs dont update much ",
            "review_score": "1"
        },
        {
            "review_text": "An interesting little beat 'em up that's hardly fair to you as a player. You'll often die and wonder 'Why couldn't I do anything about that?' , but there really isn't anything you could have done. Once surrounded, your only option is to do the same thing you do against one enemy. Hold down, spam X and pray.   The game ridicules you every chance it can, and that's not really fun, it just makes you feel like a sod for having to switch to casual when you want to play and not lose everything every hour.",
            "review_score": "1"
        },
        {
            "review_text": "  I LOVE THIS GAME! IT'S SUPER ADICTING! ",
            "review_score": "1"
        },
        {
            "review_text": "  Non stop fun anytime of the year, there's so much to do, and a lot to play and experiment with, the simplistic graphics makes it even a more fun experience to go by, I 100% recommend this to anyone who enjoy dungeon crawler games.",
            "review_score": "1"
        },
        {
            "review_text": "if ur friend a ♥♥♥ give them a potion  enemies keep throwing stuff at u throw there friends back  don't want them to have babys stomp on there balls feeling like Sparta kick that ♥♥♥♥♥ in the pit  throw candle holders ,posion explosice &amp; ice barrels for the sweet sould of there bloody screams =)",
            "review_score": "1"
        },
        {
            "review_text": "The game is alright. There isnt really much in terms of replayability from what I can tell. I was expecting more permanent unlocks and the like to help progress the games but the only things are really a few new classes and some cosmetic hats.",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth the price - combat's very shallow and the 'end boss' is a side scroller shooting mission which was really not well received. You spend the whole game (30 minutes - not kididng) collecting powerful items to defeat foes - only to end up not being able to use any of them on the end boss. In fact, the game takes all of the items away and throws non-stop healing potions at you while you play the side scroller. Really, really poor design.   Quick summary: - Short (once you spend about an hour getting the hang of the game - a successful run will take you under 30 minutes).   - Repetitive (the other classes aren't varied enough - so what if one can double jump? There's no platforming in the game...)  - Items are varied but get overshadowed by the primary weapon of just hitting X to attack.   - Rooms are sometimes completely empty and devoid of anything to do in them.  Not sure where all the hype came from for this game.  Better Rouge-likes to buy( All of which are at this same price range and are far superior.) -Enter the Gungeon -Nuclear Throne -Rogue Legacy -Binding of Isaac   Do not recommend this game at all.",
            "review_score": "-1"
        },
        {
            "review_text": "I played it for less than 2 hrs and requested a refund. The battle system is kinda boring. And the control is kinda poor , like the power attack is hard to apply in real fight. There is nothing especially bad in this game, but it is just boring. The monsters and levels are repetitive and no surprise at all. I have played much better games with this price. It doesn't worth it to me",
            "review_score": "-1"
        },
        {
            "review_text": "The money has no use, and you will get easily killed for nothing. Little grow and motivation to play more after a few death, and the artwork in this game is ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "IM SO ANGRY THAT I COULD FRY AN EGG!",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to like this game, I really did. But by the time I realized it wasn't quite as deep and Rogue-like as everything conspired to make it sound, I was already 4 hours in and Steam wouldn't refund me the money.   Taste my revenge.",
            "review_score": "-1"
        },
        {
            "review_text": "It's like an old-school brawler with a bit of Diablo. Levels and drops are randomized, so the game plays out differently every time. Combat is decently fast. It's fun.",
            "review_score": "1"
        },
        {
            "review_text": "I was playing Mad Max, then I got this game: deleted Mad Max (boring) and went to the Dark Castle :)   Highly recommended if you like rogue like games and old school beat em up (game has some mechanics similar to River City Ransom) :)   ",
            "review_score": "1"
        },
        {
            "review_text": "Not really rogue-like, but rather more spelunky-like. Very responsive controls, beautiful art direction and a nice variety of game mechanics. Lots of replayability at a great price.",
            "review_score": "1"
        },
        {
            "review_text": "Gotta love the ♥♥♥ potion lol",
            "review_score": "1"
        },
        {
            "review_text": "Rampage Knights is one of the best games i've played in a long time.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game when it was on sale out of sheer curiosity. And I'm having a blast. Play this game with a friend and have lots of fun for many hours.",
            "review_score": "1"
        },
        {
            "review_text": "This game provides incredible quality fun. It inherits many things from the Binding of Isaac, yet, what I truly like about this one is that it seems to rely a bit less on RNG, so that you can get all the achievements and get to the end of the game without too much difficulty (at least on normal). The other really good feature is the combat system with different moves which produce kind of strategic and intense battles. I haven't tried to play the game yet with a friend, but I bet it's even better than doing it solo.  In short: buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game pretty hard similar to The Binding of Isaac",
            "review_score": "1"
        },
        {
            "review_text": "This game is great fun. Lots of variety in levels and items. Each run is different, and of course, the game is always better with a buddy.   I'm 50 hours in right now and still not bored.",
            "review_score": "1"
        },
        {
            "review_text": "increadibly fun game, unfortunately the online co-op does seem to lag a little though that could just be connection problems with people in other parts of the world. otherwise good game lots of fun.  i found the Item pool to be a little small, after 3 hours or so I felt i had come across every item (not every weapon though) in the game. It could just be some are far far more rare than others however another 5 play throughs and I havent come across something new.   highly recommend and hoping for future updates as well!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game thinking, 'four hours and I'll beat the game, it'll become boring, and I'll never play it again.' But that's not what happened. I've spent 20+ hours on this game and still haven't gotten anywhere near beating it. That's not a bad thing, in fact, I think the point that it's a tough game really adds to it. Normally, I wouldn't play an indie game, let alone review one, but this one stood out to me, and that's what I love about this game. This game sucks up your free-time, and is even better co-op, so buy the two pack, and enjoy the fun of pushing each other into pits, purposely getting curses to annoy the other player, and laughing your head off.  Pros: - Amazing humor. Laughed my head off at that potion. - Tough but fun combat system, some awesome moves. - Beautiful graphics for an indie game. - Great random room generating, makes the game much funner as there's no strategy. - Perfect for speedrunning. - Cool customization features. - Co-Op feature that let's you enjoy the game a lot more. - Fair combat system. Not too hard, not too easy.  Cons: - A bit pricy. - One of those on-and-off games. Can't play it all at once, but will play again the next day. - Game crashes rarely on co-op, never seen it crash on single player. - Difficult to play with keyboard. Very easy with XBox controller though.  Overall, I rate it 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Must say that i am completly new to theese sort of games and I have been having a blast with this together with a friend 10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game if you dont have a spaz ♥♥♥♥ partner that stunlocks you like a smelter demon sword +10 With a dagger moveset!?!? cough cough ♥♥♥♥ off Jacob Palmer cough",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the graphics fool you! This is actually a very deep roguelike experience with a surprising sense of humor.  Be warned: You will struggle a lot before you get the hang of it, but even learning is very engaging and funny. Complete challenges along the way to unlock different classes and looks for your character. Everything else you need to get on your run. The dungeons are randomized, so there's a huge variety in exploration. And when you die, it's more often than not your own fault, not the game being unfair. It also controls great!   You like brawlers and action RPGs? You get both with this.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun but have no friends to play wit 10/10 ;c",
            "review_score": "1"
        },
        {
            "review_text": "The game is satisfyingly hard, but a few spells are too overpowered againist hordes of enemies and can make the highest difficulty settings less overwhelming (which may be a good or a bad thing on your point of view).  Co-op is very fun but some items, spells and moves may anger your co-op partner because of friendly knockdown. I must admit, half of the fun comes from this, knowing your partner is not a ghost that you can't interact with (  Your partner may become a ghost but can still kill you accidentally :)  ).  Variety of spells, items, diseases, curses and levels is very satisfying and random enough to make your every playthrough not feel like a grind. Also it woud be foolish to not mention devs are releasing new content occassionally with updates and making the game harder and more fun.  The game may be considered a bit short but the randomized nature makes up for it with high replay value and permadeath.  I should mention, some of the diseases and curses are too hilarious and you may accidentally start dying too often from laughing.  Oldschool gamers will find the difficulty satisfying and may feel nostalgic while playing. Highly recommended for players who love roguelike, rpg and brawler genres and want a good laugh.",
            "review_score": "1"
        },
        {
            "review_text": "Looks simple but dont be fooled , requires a lot of skill   Awesome co op arcade bash experience , if you enjoyed castle crashers , then this will be your cup of tea   Hats off to the Devs Well done",
            "review_score": "1"
        },
        {
            "review_text": "Rampage Knights is a game that I will buy for people so that they can play it co-op with me. It is assuredly a low budget, small-house kind of game but it takes those limitations and makes them charming in the kind of ways that we see from other developers that can manage a vision that fits their means.  Even at its most 'unfair', which has to be when both players get the big foot curse, the game doesn't feel frustrating and in spite of its simple controls and relatively easy to learn systems, there is a lot to be learned about approaching situations and dealing with mixed groups of enemies.  The layouts and items are randomized a la binding of isaac and you can run into one of ... six? seven? bosses on your way through the main campaign. Deep down i'm always hoping for the magical run that gives me all my favorite items but you make do with what the game gives you. Or die and start again. Whatever.  This game was worth my twelve dollars. Absolutely.",
            "review_score": "1"
        },
        {
            "review_text": "Love binding of isaac? Love castle crashers? Well they had a baby and this game came out.",
            "review_score": "1"
        },
        {
            "review_text": "I can't help but notice that I haven't left a review for this great game yet, so let me do that here. This review will contain minor spoilers about the enemies, weapons, and mechanics.   There are a few different class types, and all play differently, so variety seekers this is a treat for you.  Rampage Knights is a fantastic beat 'em up game that features procedural generation. Now, let me talk about the mechanics of the procedural generation and the game.  PG (procedural generation)- There is a set pool of weapons on each level, I believe, or every two levels. The starting level basically teaches you how to play the game, while the very first combat room of the second stage offers you a glimpse into the power ups and weapons. There are 3-5 weapons available on the second level, and they go from a slower club that stuns on critical hit, to a poisonous sword that poises enemies (not skeletons though, look out!), and my personal favorite in the form of a dagger. It's short, so your range is limited, but it's fast and does +50 critical damage on hit. And that's just a few weapons on that stage that CAN pop up.   At first, I said 'oh, so I'll either get A-D on this level, meh, I want it to be random.' After completing the game multiple times (look at my hours in the past week, insane mode is hard, man), I can safely say that the system is a wonderful one. If every weapon in the game was able to drop on the second floor, I'd be incredibly overpowered, and then later severely screwed.   This is because modifiers exist, such as curses. On Insane mode, you get a new curse every floor. On the other modes, you don't, unless you are forced to trigger a demonic statue. This can happen only once per run. What does a curse do? It varies! The most tragic one, to me, is 'Animated'. All the barrels that you've been smashing for gold pieces and health pick ups? Yeah, they are enemies now. And man, there are LOTS of boxes, statues, barrels and more in this game to smash.  Which brings us to the mechanics- Your standard attack is mashable to create as big of a combo as you want. You won't be doing that though, as in instead you'll hold the attack button and dash forward. Why? It breaks shields, and man do you want to break the shields of the enemies, trust me. If you press attack and up, you launch enemies in mid air. Follow it up with pressing attack, and you do a neat combo that ends with them on the ground. If you're close to an enemy, you do a punt, which also ends up with them on the ground. Once there, you can stomp them for a lot of damage, but be careful, you become very vulnerable to any attack while stomping an enemy. For defense, you have an excellent and easy to use doge roll that becomes incredibly difficult to master when ♥♥♥♥ hits the fan.   The variety of enemies is good. We've got knights, demons, goblins, undead, giants, trolls, crazy chickens, Halloween looking ♥♥♥♥ers with swords that throw pumpkins at you, and more.  There is one final boss who has a very cool final form (won't spoil that one), and a mid point boss. Actually, the midpoint boss draws from a pool of I believe 5, so it will be different each time you play. They are tough, but very fair after you learn what you need to do to defeat them.  Potions range from hilarious to useful, but not a single one feels pointless or tacked on. Diseases, such as being poisoned, can be cured with a variety of potions, but do you really want your character to be drunk, making movement difficult for a few rooms?  Overall, I really enjoyed my time with Rampage Knights, and I'm excited to go back to it. The developers put their own unique spin on a classic formula, threw in some humor, a doge roll and tons of love.   And I, for one, am very thankful that they did so.   ",
            "review_score": "1"
        },
        {
            "review_text": "&gt; Started off as a  Ninja  whom  casts fireballs .  &gt; Found  steroids  and  downed them like liqour shots .  &gt; Found gloves that gave me super strength, allowing me to throw enemies across the entire room for  no explainable reason .  &gt; Found a potion that turned me into a  Demon-Ninja-Spellcaster , and found boots that made me  LEAVE FIRE IN MY STEPS.   &gt; Turned into a  Cyborg-Demonic-Flying-Immortal-Steroid pumped-Battle Mage-Ninja , whom  EATS GOLD , and has a  GIANT BATTLE AXE .  Best Beat-Em-Up game...Ever",
            "review_score": "1"
        },
        {
            "review_text": "Game is fun, if not a little short. Needs a little more distinctiveness between levels, and more unique items!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game soooo much i can reply this game over and over and over again without really caring if i lose or beat the whole game. its my favorite game to play with friends to mess around with. if you got a friend whose willing to play this with you then believe me it wont be a regret",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game! The animations are cool and remind me of Gravity Falls for some reason but that's not a bad thing. Controls are simple enough to use and adds a good adrenaline rush into you when you have low health and are trying to finish the level so definitely well worth the price and time!",
            "review_score": "1"
        },
        {
            "review_text": "Hours of fun ahead.. :D",
            "review_score": "1"
        },
        {
            "review_text": "Addicted to this game. So fxxking good!",
            "review_score": "1"
        },
        {
            "review_text": "Rampage Knights is an excellent and polished game with plenty of humor, or references, to spare! The finest game from 'Rake in Grass' yet! It is an excellent blend of beat 'em up and RPG!  Here's a summary of the Positives (+) and Negatives (-):  + Tons of weapons, items, and abilities all on a randomized loot table. You'll never know what kind of combonation you'll get!  + Nearly infinite replay value. All levels are randomized, and feature other sorts of surprises you won't experience twice in a row.  + Fun and rewarding combat that is easy to get into, but hard to master.  + Very challenging!  + Colorful and detailed 2D visuals.  + Great soundtrack!  + Singleplayer or co-op, offline or on.  + Achievements that actually matter! Earn them to gain greater strenth and cool passive bonuses. It can even unlock classes to play as.  +/- Not enough boss encounters. There are only TWO bosses... however, one of these bosses is on a randomization table, and you'll sometimes get a completely different boss!  - Animations and sprites are often copy/paste across multiple enemies.  - Jump attacks are too overpowered... in true Golden Axe fashion!  - Friendly fire is annoying in co-op games!",
            "review_score": "1"
        },
        {
            "review_text": "This game was so insanely absolutely worth the purchase! It has a lot of replayability, and is a lot of fun. Rampage Knights has some silly humor that tends to surprise you, such as a potion that may have a shocking effect. These are the things that make you giggle and really enjoy the game. Plus, there is something fun about all the blood and just slashing things to death.",
            "review_score": "1"
        },
        {
            "review_text": "Things you can do to enemies in this game:  Decapitation Full dismemberment Curb stomping Kick their teeth in Swing em around like a bat  Also, the knife throwing enemy looks like Danny Trejo from machete  10/10 Would stomp on Danny Trejo again",
            "review_score": "1"
        },
        {
            "review_text": "2 player good hard cooperative platformer action. With some amusing potions and pickups and challenging generated landscapes for each play through this title will keep you and your mate pulling out your hair trying to defeat the waves of bad guys. We found it pretty hard to progress but a lot of fun dying and trying :)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game.   Really fun arcade style game that can be played over and over again with a friend for enormous amounts of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Fun hack and slash roguelike game. FUN. Love the comic style. Good sense of humor. Combat has some depth. There is a ton of variety as far as weapons, gear and levels. Would be a great arcade game. The game may seem difficult at first (e.g. only 2 lives) but as you start to learn it you start making much better progress. Interesting lock picking mechanic. Makes me laugh and yell at my own stupidity. I recommend using a controller/gamepad.",
            "review_score": "1"
        },
        {
            "review_text": "Played for 7hrs in one sitting and beat the normal campaign couch co-op, there is a learning curve like with all permadeath dungeon crawlers. It was a good time and I will probably come pack to finish it.",
            "review_score": "1"
        },
        {
            "review_text": "I have put 75 hours into this game, and still trying to get all the achievements. It is a fantastic game, except the Battlemage needs to be reviewed/revised. The battlemage is the hardest to use to complete the 'Complete Hard Mode with the Battlemage' achievement.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome co-op game. I love the mechanic for bringing your partner back to life, and how they get to remain active even while dead. Lots of replay value here. Kind of reminds me of a cross between Rogue Legacy and Binding of Isaac.  In short,  1) Bring beer 2) Get ready for heartbreak 3) Get ready for high fives      ",
            "review_score": "1"
        },
        {
            "review_text": "8/10  Pros 1. Unique graphic , smooth animations 2. Random Generated Levels, Surprise and replayability 3. Very challenging , Skill required .I find it quite hard even for the first level . 4. Online Multiplayer ",
            "review_score": "1"
        },
        {
            "review_text": "I barely played because non of my friends own the game except one but it's fun! It's cute- the artwork is super adorable and it's fun to run around and fight the monsters. It's simple, fun, and it's pretty much a solid game. It's interactive and super fun to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, great replay value",
            "review_score": "1"
        },
        {
            "review_text": "Very good! addictive !",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game on the premise that it's similar to Binding of Isaac and Castle Crashers. It has not disappointed in the least. The game is difficult, but not so much that it's unfair. It has procedurally generated levels so it's different all the time. There are a wealth of crazy upgrades that keep the game from getting stale as you're always getting new items and no two runs are ever the same. There are also a bunch of different classes that work differently enough as to make them feel unique from one another.  The best part is that it's co-op. I didn't know I wanted a co-op Binding of Isaac type game until now. Probably one of the most fun games I've played in a while. The core gameplay is a ton of fun. If you enjoy rogue-likes and brawlers with a good dose of comedy, you'll like this game.",
            "review_score": "1"
        }
    ]
}