{
    "app_id": 314510,
    "name": "Fall of the New Age Premium Edition",
    "release_date": "2014-07-25",
    "developer": [
        "Shaman Games Studio"
    ],
    "publisher": [
        "PlayRIX"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 75,
    "negative_ratings": 51,
    "price": 4.99,
    "description": "In the dark times of the Medieval a baleful society of the Cult and its adherers strived to seize the rule over the city, control its inhabitants and destroy all sources of knowledge and culture. Help Marla uncover the secret conspiracy, release her kidnapped brother and save the city!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/314510/header.jpg?t=1478082779",
    "minimum_requirements": "OS: XP, 7, 8, 8.1 Processor: 2,5 GHz Memory: 2048 MB RAM Graphics: Any DirectX: Version 9.0 Storage: 4 GB available space Sound Card: Any",
    "recommended_requirements": "Memory: 2048 MB RAM Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": " Fall of the New Age  is a neat little game coming from Shaman Games, a promising Ukrainian HOG developer team that we already know from titles like  Dreamscapes  series earlier last year. Originally developed for iOS systems, this game is a beautiful time kill for a tiresome after work evening when you'd prefer having some gaming time yet do not necessarily want to be heavy on the attention span.  Our story takes place in a fictional Late Medieval - Early Renaissance period, where people start to leave old superstitions aside for the sake of science, logical thinking and societal progress. The death of the kingdom's benevolent king marks an ill omen for the future though: mysterious disappearances among orphaned children; raids on libraries, ateliers, workshops and academies; assaults on scientists, alchemists and philosophers begin. An ominous cult with the motto 'ignorance is power' jeopardizes the promise and knowledge of the new age. Within all this chaos, Marla - a street urchin and a young thief - finds her young brother taken by the cult. With the aid of a swash-buckling mentor, Marla will try to stop conspiracies of the cult and find her brother by all means!  I know, I know... HOGs carry a tendency to reinterpret classical tales, movies or successful video games in their own paces. Here, we have a simplified version of the original  Thief  game, with a tense dynamic between enlightenment and ignorance, plus political power plays on the side. Nope, that sincerely doesn't make  Fall of the New Age  a bad game at all. There isn't much depth to it surely, but it’s a fun time kill. You just have to be aware of your expectations about it.  Artworks are alright, with suitably fitting medieval atmospheres and beautiful alchemical designs for puzzles. Character models and 3D animations work fine - even though characters themselves are nothing original. It was also a bonus that the game had somewhat decent voice acting. Esthetically, it is a decent game: not horrible, not spectacular either.  The gameplay is completely different than what we'd be accustomed to as a HOG. The game carries HOG dynamics - like puzzles, item collection, environment interaction etc. - yet without much HOG gameplay actually. There are 4-5 scenes where you'll be expected to find some random symbols from a list for a password or some items scattered around which can be used as a costume for Marla, in her various disguises. It was refreshing to see a dynamic explanation and use for HOG sequences for the story. A cute and welcoming change, indeed.  There are some reports for the Mac version not working properly - voice acting missing or item graphics not showing up properly - but I encountered no problems while playing this on Windows 7, so I cannot account for other systems. All in all, grab it on sale for a silent afternoon to have a decent time kill.  Please also check out Lady Storyteller's Curator page  here  - follow for regular updates on reviews for other games!",
            "review_score": "1"
        },
        {
            "review_text": "This is a Hidden Object Game that's light on hidden objects and works much better as an adventure-lite. You arrive on the scene as the terrible Cultists are taking over the kingdom, blowing up monuments and killing the wise. You might not ordinarily get involved, but your brother is snatched while he’s working as lookout for a burglary you’re busy committing, and now you want to get him back before he’s sacrificed in the terrible endgame Ritual.  There’s a swashbuckling feel to the game, though you won’t actually swashbuckle very much, and you’re helped by the dashing Herbert, a Musketeer type who rescues you from time to time and moves you through the chapters. Overall it keeps a good tone, with some English-as-a-second-language illuminations, a nice graphical feel, and an awkward bit of time dilation at the end - a calamitous event is about to take place, and you will take a break to make a tool and go retrieve an errant handle from someplace down the way before the event finally happens. Life during gametime.  An interesting but underplayed mechanic is the introduction of disguises. As you move through the world you’ll need to pretend to be people you aren’t in order to get past guards and infiltrate locations; while this looks at first like it’s going to be really interesting, ultimately it’s just a matter of clicking through hidden objects. There’s also a tendency to drop you into puzzles without explaining what the goals are, but this all works out in the end.  I enjoyed this. Main story beaten; extra-muros history and background comes via scrolls that are unlocked by jewels you collect in your travels, and somehow I managed to miss enough of those that I didn’t unlock the final set of notes. After 6+ hours saving the realm, I can live with that.",
            "review_score": "1"
        },
        {
            "review_text": "I really wish Steam had a 'meh' option. Fall of the New Age Premium Edition is a HOG-lite puzzle adventure game from a studio that shows a lot of potential. Having previously played Namariel Legends: Iron Lord Premium Edition also by Shaman Games, (which was excellent by the way,) I had high hopes for Fall of the New Age. Some were met, some weren't.  The Good. Great art style, graphics and cutscenes, as good if not better than the best offerings of the more established studios in the genre. The sound effects and soundtrack fit the story. The story for the first 66% of the game is very good, then it starts to get lazy. Lots of puzzles. Interesting game mechanics regarding the use of a slingshot, having to don various disguises, and a mix of both standard HO scenes and scenes that require you to find object outlines.  The Bad. Bugs. Two puzzles were impossible to complete because the objects I needed to drag got stuck. Restarting had the same problem. (Windows 7 64bit)  Two cut scenes were in the wrong order, with a soldier I discover in a stables asking where his money is, and when I get the money and try to give it to him a few minutes later, it then launches the correct scene, where I run into him for the first time and the cutscene shows I know him and he asks for money if I want his help. There are some jewels you pick up, you need 3 parts, I found 2, I never found the third, there's even a gate that requires all three parts. They are never used and you never need to open the gate. You end the game with 2/3 jewels in your inventory. While the story begins strongly you soon realise it's the usual rescue a friend/family member with supernatural elements .... why do HOGs rarely try something original? The game is too easy! The puzzles almost autosolve in a lot of cases, the lockpicking scenes are move a pin at random until a hole appears, and the point and click is incredibly simple with most objects required for progress found in the same scene or very near it. An experienced HOG player won't find much challenge in this game. The 'Premium Edition' adds a bonus chapter, in Namariel Legends, it was almost an hour long, original, and added to the story. I expected the same here .... nope, the 'bonus' chapter is simply the final chapter. It feels as though the developer simply cut the last chapter from the game, leaving it unfinished, just so they could add it back as a 'premium edition with bonus content.' If you don't play the bonus chapter, the game ends mid-story ... the bad guys get to carry out their evil plan, and almost everything you did up to that point is meaningless. Your inventory even carries over into the bonus chapter! It's not a bonus chapter, it's the final act!  The problem with Fall of the New Age is that it's all icing and no cake. It looks great, it sounds great, the cutscenes are awesome, the story begins well, and then you discover that there's very little substance behind it. The storyline is generic, the game/puzzles aren't challenging, The voice acting is terrible. The game places you in an urgent life or death situation on 3 occasions and then waits for you to tour the town, have a few conversations, solve a few puzzles, and then eventually get back to the point where an executioner still has his axe raised over your brother's head, the librarian is still lying in the burning building, or the chemist is still coughing out his last breath after being poisoned! It's not a terrible game, but it falls incredibly short of Namariel Legends.",
            "review_score": "1"
        },
        {
            "review_text": "Sound doesn't work, which makes the game completely unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is great! I don't know why it has mixed reviews. Although I do not have sophisticated needs for hidden objects games. I loved, and still love, Escape Rosecliff Island and other games from that company. Animations sucks, voice acting is terrible to say least, some textures are weird but all in all gameplay is nice. And do not mind the plot. It's poor. :P",
            "review_score": "1"
        }
    ]
}