{
    "app_id": 314540,
    "name": "Paper Monsters Recut",
    "release_date": "2014-10-23",
    "developer": [
        "Mobot Studios, Inc"
    ],
    "publisher": [
        "Crescent Moon Games, LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Platformer",
        "Family Friendly"
    ],
    "achievements": 0,
    "positive_ratings": 25,
    "negative_ratings": 11,
    "price": 5.59,
    "description": "Welcome to Paperland! Paper Monsters Recut mixes classic 2D platformer gameplay with gorgeous 3D graphics and brings it to life in a brand new title for PC.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/314540/header.jpg?t=1447362730",
    "minimum_requirements": "OS: Windows 7 SP 1 or higher (works with latest 8.1) Processor: Dual Core 2GHz CPU Intel or AMD Memory: 4 MB RAM Graphics: GeForce 400 Series or Radeon 6000 Series, 512MB graphics memory DirectX: Version 9.0c Storage: 1 GB available space Sound Card: DirectX Compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Paper Monsters Recut is a 2.5D platformer where the world has a charming paper Mache look to it. We play as an unnamed robot looking fellow on a quest to stop an evil dinosaur. To accomplish this we will jump on the heads of our enemies Mario style and make our way through an over-world full of levels as well as secrets. Unlocking new levels require us to collect golden paper clips which there are 3 of in each level. You can either walk all the way to the area you want or you can simply teleport there. It's a really pretty looking over-world but it can be a bit poorly designed on some spots making it difficult to go to your destination.  This is a friendly and simple game that feels like it is centered for children. It is an easy game, perfect for those just starting out with video games. It can be quite boring in fact if you have even a bit of experience with platformers though on the other hand it can also be relaxing. Along with the paper clips scattered around each level there is a golden button that unlocks a few mini-games if you collect enough. Most of the secrets are extremely easy to find so it wouldn't be abnormal if you finish the game with everything collected.  Controls feel a bit funky at first though it didn't take long to get used to them. For most of the levels the most you can do is simply jump and run your way through obstacles. Annoyingly enough the jumping sound effects are very out of place and sounds like you are playing as a squishy blob. You can double jump and take three hits from your enemies before biting the dust and being sent back to a checkpoint. It's not much of a punishment since you keep everything that you have collected and they give out extra lives like candy. Your enemies range from dinosaurs, cacti and sombrero wearing spiders.  They don't chase you or actively try to harm you, they just walk around a preset route and randomly attack at nothing. Jumping on enemies is not always a way to defeat them since as you may guess jumping right onto a cactus is not the best of ideas. At the end of each area there is a boss to fight that all require different methods to take down but are incredibly easy. Defeating one will get you a golden key which unlocks a new area for you to conquer. From time to time they throw in some neat gimmicks to spice things up such as sledding down a snowy mountain or commandeering a submarine. You'll also have access to a jetpack in one area which also gives you a laser gun to defend yourself with.  Defeating enemies is not satisfying since there is a ton of delay from the moment you jump on them to the moment they flatten that just made it feel glitchy in my opinion. The mini games you can unlock are an endless vehicle section and a Runner type of game. It is a very per the rules type of game and there is nothing you haven't seen before or any unique ideas other than the artstyle. But wow, is the game pretty to look at and there are quite a few themes to go through. Levels are usually only a few minutes long and you can blast through this game in just a few hours. There is no real replay value unless you missed a few things or simply want to play it again for the sake of it.  Story is paper thin (no pun intended) and barely something worth mentioning. There a few characters that are in the over-world but are just there to serve as breathing tutorials whose role could have easily been replaced by a sticky note. Music on the other hand is pretty stellar and a joy to listen to. There are “Super-Secret Levels” hidden around the over-world that have you collecting 20 pieces of candy though each one of the is mostly the same and are pretty boring. All in all Paper Monsters is a good game for children or those of us looking for a game to relax with but other than the artstyle there isn't anything else that separates it from the rest of the genre and as such may be less than stellar for those looking for a remarkable platformer.  ",
            "review_score": "1"
        },
        {
            "review_text": "this game is fun and there is more cardboard then paper 3.9/5",
            "review_score": "1"
        },
        {
            "review_text": "A nice casual platformer. The only controls for most of the game are run and jump so it's super simple but the varying environments, tight controls (I used a controller so I have no idea how good it is with a keyboard), and pleasant soundtrack kept me playing. It won't blow you away, but it's still quite good and very kid friendly.",
            "review_score": "1"
        }
    ]
}