{
    "app_id": 314810,
    "name": "Randal's Monday",
    "release_date": "2014-11-12",
    "developer": [
        "Nexus Game Studios"
    ],
    "publisher": [
        "Daedalic Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 21,
    "positive_ratings": 637,
    "negative_ratings": 199,
    "price": 14.99,
    "description": "A kleptomaniac, a sociopath and a horrible friend. Randal is potentially one of the most scurrile protagonists since the invention of the hoverboard. Randal's Monday is a crazy space-time odyssey in classic adventure design, spiced up with countless geek culture references of the last 30 years.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/314810/header.jpg?t=1524053269",
    "minimum_requirements": "OS: Windows Vista SP2/Windows 7 SP1 Processor: 2.2 GHz Dual Core Memory: 2 GB RAM Graphics: nVidia GeForce 7025, ATI Radeon HD 3400 DirectX: Version 9.0c Storage: 8500 MB available space Sound Card: DirectX 9.0c compatible",
    "recommended_requirements": "OS: Windows Vista SP2/Windows 7 SP1/Windows 8 (32/64 bit Version) Processor: 2.4 GHz Quad Core CPU Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 275, ATI Radeon 4 or higher DirectX: Version 9.0c Storage: 8500 MB available space Sound Card: DirectX 9.0c compatible",
    "reviews": [
        {
            "review_text": "Full Video Review -         YouTube™ Video:  Randal's Monday Review&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "You'll maybe need to watch the movie  Clerks.  (1994) to get this game better. WARNING: minor spoilers ahead. this review is looooooooong.   Randal太帥我靠簡直是我理想男友    This is now my favourite point-and-click game ever, and one of my favs of all games.  I'll start off by saying that I have read many reviews on this game and most of them say that the main character is not likeable at all,  IGN took one step further by calling Randal 'the bad guy'.   I fell for the main character, however, after he popped the joke about nuns and stole his drunk best freind's wallet.   I am now lamenting about the lack of slash fanart and fanfics of the main character and the antagonist they cleverily (lazily) left out of the epilogue of the game but anyway I decide to make some myself so    Many reviews also mentioned that, the puzzles are extravagant and gets in the way of the story.   But rather, I think the puzzles ARE the story.",
            "review_score": "1"
        },
        {
            "review_text": "I walked into this game hoping for some Clerks voice acting. Following Jeff Anderson and Jason Mewes, I was reallly hoping for more. I've come to find: +Grudgy style humor +-Extensive conversation (You don't make something funnier by pounding words) +Suprises around each corner +Slapbox comedy   I've clocked less than an hour in so far, clearly showing that I am fully knowledable.   In actuallity this is a point and click adventure, with personality. If you are into that sort of thing, you may enjoy this.   Yep.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest point and click adventure game I ever played and the funniest one.  Pros: - dark humour - story - dialogues - characters - references  Cons: - some bugs - sometimes disgusting",
            "review_score": "1"
        },
        {
            "review_text": "If i could give a 'sideways-thumb' for this I would. Randal's monday is an oldschool style point&amp;click comedy adventure. It has a very large amount of voice acting. It is a long game by adventure standards. Its a fun and epic story filled with countless geek references, and the story also stands on its own. It also has a great soundtrack, and the extras include a beautiful calendar pdf.  The problem with this game is one area: the puzzles. The puzzles just arent reasonable most of the time and have so-so logic. It makes it very frustrating when frequently its not clear what exactly your current objective is. And you could waste many hours trying to get on the right track to eventually discover the puzzle solution really doesnt make much sense. The game includes a hint system... but it really just tells you the answer.. its more of an in-game walkthrough.. which you will almost definitely need with this game unless you've got tons of hours to kill.  Still, despite that flaw, if you stick with this game you are rewarded with a large entertaining experience with plenty of twists and turns and laughs. The production values are high, the voice talent is good, the content is meaty, the game doesnt hold your hand. People who complain about 'modern adventures' not being oldschool enough: you should be buying this game... multiple times ;)",
            "review_score": "1"
        },
        {
            "review_text": "What can I say about Randal's Monday... A fresh air for Point and Click genre. If you enjoyed games like Monkey Island and you are a geek, you can't play.... YOU HAVE TO!!!!!  Thank you for doing these kind of games. 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, I enjoyed it a lot. Great humor and lots of nostalgic references made me laugh a lot.   The dialog I thought was great. Sometimes it became long, but you can skip most of it if you want.   Sometimes the 'puzzles' were kind of derpy to me, but they were nice enough to include a hint section if you need it.   The characters in the game I thought were awesome. Lots of different people to interact with. I had fun clicking on all the dialog options and listening to the banter. The main character sometimes got on my nerves, but overall it was great.  Minor bugginess did occur. One time I had a characters voice being portraid from another characters mouth, which was really funny, and little things like a mouth or eyes disappearing during dialog. Nothing major or game breaking.  The inventory was a little funky. If I could rearrange items that would have solved most of my issues. Trial and error of combining items on different pages was kind of a pain, but only mild to me.  Good music.  Interface was easy to use with the classic two click mode.   Overall I liked this game enough to type words and give it a thumbs up. If they made a sequel I would buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Meh. I think it is too hard for what it offers, maybe they could make a way to just enjoy the story without having to do a lot of effort to solve the puzzles",
            "review_score": "1"
        },
        {
            "review_text": "Well Worth Your Time And Money",
            "review_score": "1"
        },
        {
            "review_text": "I liked most of Daedalic's games, but I cannot recommend this one for a couple of reasons (minor spoilers ahead):  1. The characters are all a bunch of unlikable idiots. For some reason, the main character is an amoral jerk, but for some reason he feels a need to save his drunken idiot of a friend from repeatedly killing himself. Some people might find them funny, but I just found them a bunch of abrasive morons.  2. The game is repetative, with you going over the same locations repeatedly each timeloop, looking for whatever minor changes have happened in the world. Sometimes there are noew items hidden away, sometimes the characters hive different dialog, but it is annoying to have to go over every screen looking for the one new plot hook you need to progress.  3. The puzzles are often wildly illogical. A good chunk of the game is devoted to finding a single quarter to use in a vending machine. Of course, you cannot just look under the couch cushions or borrow one from someone. Instead you have a multi-stage puzzle involving repairing a radio and making a working lightsaber just to get a single coin.  4. The game is inconsistent with allowing you to do stuff ahead of time. Sometimes the game allows you to pick up or use items ahead of when you need to use them, and sometimes the game does not let you. This is annoying considering how you repeated visit the same areas each loop, so you are forced to try using everything with everything each loop to see if you are allowed to do something new.  5. The game does not seem to be very consistent with the rules of time-travel. Some things change each loop and some things stay the some, so the plot seems to progress at random with each time-loop.",
            "review_score": "-1"
        },
        {
            "review_text": "I love Kevin Smith, and the fact that Jay and Silent Bob would be in a game sounded like fun. I love the old Lucas arts point and click games. This game was supposed to be like that. It's not. Randal and everything in this game moves way to slow for me. The game is not really challenging. Silent Bob is not voiced by Kevin Smith. Randal is not Randal from clerks. His name is from both the main characters of clerks Randal Graves, and Dante Hicks = Randal Hicks. There is no replay value to this game unless you are just a fan of achievements. The only thing about this game that is any good is the pop culture references throughout the game itself. This alone is not worthy enough to shell out any more than $5 dollars for this game. I had to force myself through it just to finish it.",
            "review_score": "-1"
        },
        {
            "review_text": "Nonsense puzzles, slow pacing, and references passing off as humor. Don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "The references are fun, but the gameplay is not.  The puzzles are very illogical and tedious, The main character is very unlikable. The story streches out for too long and does not go anywhere. Thr game is unbeatable without a guide.  It seems like they wanted to create a game with lots of references in it, but they had never put any thought into the gameplay, characters, or story.    Pass.",
            "review_score": "-1"
        },
        {
            "review_text": "Randal's Monday is not the most playable of point-and-click adventures. Attempting to capitalize on nerd culture by overloading the game with every possible pop culture geek reference isn't enough to make up for poor game design, bad acting and terrible sound quality.  . The basic plot is interesting enough: jerkwad main character (named after the two main characters in Clerks, and voiced by one of the actors of those characters) steals his best friend's engagement ring during a night of drunken debauchery, then pawns it the next day to pay his rent. That's when things take a turn for the terrible - he loses his job, his best friend commits suicide, and the prophetic bum in the alley keeps telling him how cursed he is. Well, with a name like Randal Hicks, what'd you expect? Like any other point and click, most of this game is just a matter of matching the right inventory object to the scenario. Unfortunately, some of these connections are tenuous at best, and more often completely inconceivable. Relying on the hint system becomes practically a necessity to avoid insanity - and even THEN, the hint system misses some important steps, leading to frustration over missing one tiny item in a place you were sure you'd searched thoroughly before. From the very beginning of the game, it's obvious that the actors weren't even in the same room when recording the script: dialogue sounds stilted and volume and tone is often mismatched. Frequently, the responses don't even seem to follow what the original character was even saying, leading to a lot of confusion while trying to follow the story. While it makes sense for the characters to talk and act incoherently in the first scene (the 'let's get drunk at the bar' wedding shower), there's no real excuse for it after that. Sadly, their acting never lives up to the potential of the game, and certainly doesn't match up to the semi-star-caliber cast (Jeff Anderson ('Randal Hicks' who played Randal Graves in Clerks), Jason Mewes (Jay in both this game and Clerks), two voice actors from Thomas the Tank Engine, etc,)  Sound quality also suffered - often changing volume in mid scene, making it hard to hear the characters, or making it suddenly loud. Unacceptable in a game of this simplistic a design. Fire that sound guy immediately! The soundtrack is actually really good, and if you're just in it for the geek references, well, this is so full as to render the rest of the game irrelevant.  I'm normally a lot more forgiving about video games, but when there's this much wrong with it, it becomes a complete disappointment. I got it on sale for $5, but still wish I had waited. Save your money, or buy some TellTale games instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Not recommended, very boring story and jokes are of low quality.",
            "review_score": "-1"
        },
        {
            "review_text": "game sucks.  UHHHH OK! you want details, here they are. The game has way to much dialogue, and not only that its really bad and boring dialogue. You have to choose from a bunch of options of what to say and if its not the one the game wants you get to pick all the rest of the options and listen to more completely usless dialogue. The jokes are extremely lame and bad, the voice acting is even worse. the few times you get to actually play in the game are shorted lived, and the puzzles or situations you have to solve are terribly stupid. I played the game some more, it gets worse. Enjoy this crap sandwich of a game, waste $22.49 on it if you want. P.S. Jay and Silent Bob are homos with each other.",
            "review_score": "-1"
        }
    ]
}