{
    "app_id": 315060,
    "name": "Bloop Reloaded",
    "release_date": "2015-02-06",
    "developer": [
        "2SD"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Includes level editor"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Simulation"
    ],
    "achievements": 11,
    "positive_ratings": 205,
    "negative_ratings": 107,
    "price": 6.99,
    "description": "Your favourite chemistry potions puzzler is back in Bloop Reloaded and ready to test the brain cells like never before. Make sure you save as much of the potions as possible. How you do it is up to you!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/315060/header.jpg?t=1492343053",
    "minimum_requirements": "OS: Windows XP Processor: C2D E4500 / Athlon64 X2 5400+ Memory: 1 GB RAM Graphics: HD 5470 / GT 210 Storage: 300 MB available space Additional Notes: Mouse is not required but recommended for best experience",
    "recommended_requirements": "OS: Windows 7 Processor: C2D E8600 / Athlon II X3 455 Memory: 2 GB RAM Graphics: HD 4830 / GT 240 Storage: 300 MB available space Additional Notes: Mouse is not required but recommended for best experience",
    "reviews": [
        {
            "review_text": "It's really impressive that a game, which is relatively simple in design and mechanics, can have a playing time like a game from major game developers.  - great small puzzle game - nice game environment and music - main game time approx 11 hours  I like it, nice variety. :)    ",
            "review_score": "1"
        },
        {
            "review_text": "Its Midnight.  Decided to play a Puzzle game to wake myself up.  Its puzzles are like so majestic I nearly fell asleep.  From what I played of this game, I loved it. If any of you have played a Game called, 'World of Goo', then I assure you that any fans of that will be pleased with this, I bought it for like 10p in total, so overall I am happy with my purchase, as this is an alternative to sleeping pills!  Great stuff guys! :D",
            "review_score": "1"
        }
    ]
}