{
    "app_id": 315080,
    "name": "Foresight",
    "release_date": "2014-11-28",
    "developer": [
        "Strides Interactive"
    ],
    "publisher": [
        "mNosGaming"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Online Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "RTS"
    ],
    "achievements": 104,
    "positive_ratings": 36,
    "negative_ratings": 7,
    "price": 3.99,
    "description": "Redefining Strategy in RTS with Foresight.Win epic battles with wits, not dexterity. Foresight automates typical logistic chores for you reasonably so that you can focus on the battle instead. Create your armada and destroy your enemies with strategy!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/315080/header.jpg?t=1498243633",
    "minimum_requirements": "Минимальные: ОС: Windows XP Процессор: Intel Core 2 Duo E7500 (Wolfdale) or better Оперативная память: 2 GB ОЗУ Видеокарта: DirectX 9 compatible with Shader 2.0 support DirectX: Версии 9.0c Место на диске: 3 GB Звуковая карта: DirectAudio 9 compatible sound card Дополнительно: Video cards should always be updated with their latest drivers. A high-performance video card will make a difference.",
    "recommended_requirements": "Рекомендованные: ОС: Windows 7, Windows 8, Windows 8.1 or Windows 10 Процессор: Intel i5-2XXX (Sandy Bridge) or better Оперативная память: 4 GB ОЗУ Видеокарта: DirectX 9 compatible with Shader 3.0 support DirectX: Версии 9.0c Место на диске: 3 GB Звуковая карта: DirectAudio 9 compatible sound card Дополнительно: Video cards should always be updated with their latest drivers. A high-performance video card will make a difference.",
    "reviews": [
        {
            "review_text": "It's a very fun RTS, my friends and I have played around with this game a bit and I've talked a lot with the developer and he has seemed good about hearing his communities requests for bug fixes, updates etc... So I'm going to strongly recommend this game, not only is it very playable right now, but the developer is very active and has made the game something worth playing and will continue to improve it over time.",
            "review_score": "1"
        },
        {
            "review_text": "Well this game is a nice one, sure its not a graphical juggernaut, but its still a fairly interesting game. My main issue with it is that less than 3 hours in I had several bugs, my game crashed twice and at one point my main ship was frozen, couldn't move or anything during the 3rd mission when I tried to get it repaired at the allied shipyard before heading back to Earth, so yea its not perfect, the gameplay is nice enough, but the developers have to check out again for bugs, because its getting pretty annoying having issues and having to restart some missions all because it crashed or bugged. Still I'd recommend the game, in particular when nicely on sale, but otherwise I make a mention that saving often might be necessary until the issues it still have got corrected.",
            "review_score": "1"
        },
        {
            "review_text": "  At first, this game reminded me of Starcraft. But as I played more, I realized this game is rather different than what I've expected. Foresight have a ton of personalized options for those who doesn't have a powerful computer, mine could run soothly without a problem with medium settings.  The artwork for the cutscenes are very well polished. The lines have been cleaned up very well and they're very pleasing to look at. It is quite easy to tell that a lot of time have spent into developing the artwork within the game, considering the final product.  The tutorial started off fresh and was easy to understand. It's quite alright for those who are new to RTS to pick up on the basics with the given tutorial. I really enjoyed playing as the cadet with the spacecraft, even though it wasn't as tanky as I assumed it to be. My ship has been destroyed many times out of the tutorial. The general difficulty might not be easy for RTS newbies, but it is not impossible to beat.  The game relies on a ranked system, sort of like levels in RPG games. The more experience you've obtained by participating in battles, the higher rank you are. Which in my opinion, it's very neat, considering how the game encourages me to get better by playing more battles to sharpen up my skills.  Anyhow, I really enjoyed my experience in Foresight. I'll try to improve more in the coming days :D",
            "review_score": "1"
        },
        {
            "review_text": "Foresight is a excellent rts game that allmost reminds me of starcraft in a way it has a intrusting story and can be very fun when your bored or need something to do.  Pros: Excellent soundtrack, Great grapics, good storyline, nice artwork, can be very challangeing at times.  Cons: none to be found  9/10 really fun game :)",
            "review_score": "1"
        },
        {
            "review_text": "Very poor graphics Inconvenient operating menu Looks like this game is 4-5 years old ",
            "review_score": "-1"
        }
    ]
}