{
    "app_id": 315340,
    "name": "A.R.E.S. Extinction Agenda EX",
    "release_date": "2014-10-03",
    "developer": [
        "Extend Studio"
    ],
    "publisher": [
        "ORiGO GAMES"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 31,
    "positive_ratings": 131,
    "negative_ratings": 38,
    "price": 7.19,
    "description": "A 2.5D action-packed side-scrolling game, takes players on a thrilling sci-fi adventure! Take control of combat specialist Ares, or the new playable character, Tarus, to battle deadly machines with a variety of powerful weapons and armor. Your goal: Save Minos Space Station’s survivors and uncover the nefarious Zytron’s extinction agenda!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/315340/header.jpg?t=1448639170",
    "minimum_requirements": "OS: Windows Vista, Windows 7 and Windows 8 Processor: Intel Core™2 Duo Processor, AMD Athlon x2 Processor Memory: 2 GB RAM Graphics: NVIDIA GeForce 7600 series, ATI Radeon HD 2400 series DirectX: Version 9.0c Storage: 1 GB available space Sound Card: DirectSound compatible (DirectX 9.0c or higher)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A.R.E.S EX is an updated version of the original A.R.E.S Extinction Agenda. This game is highly polished and easy to recommend to fans of side scrolling shooters. My full review is here         YouTube™ Video:  A.R.E.S. Extinction Agenda EX Review&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Extinction Agenda EX a fun game that doesn't take too long to play. It feels a lot more fleshed out than the original, and they've improved a lot of mechanics. There's some new music and some old music, and although it's a small gripe, I was disappointed to find that they did away with one of my favorite tracks from the original (Stage 5's theme).  I'd definitely recommend the game to platformer fans. The art style is nice, the story is very similar to the original game's, and the music is great.",
            "review_score": "1"
        },
        {
            "review_text": "Where can I get the soundtrack?!",
            "review_score": "1"
        },
        {
            "review_text": "Bought it at 95% off sold the cards, made a profit. Hope you'll be able to do the same.",
            "review_score": "1"
        },
        {
            "review_text": "60% off until 10 october",
            "review_score": "1"
        },
        {
            "review_text": "As a 2D action platformer à la Mega Man, what's not to like. Nice 2.5D graphics with simple but descent enough effects. Shooting, acquiring new moves, levelling up through XP-gathering, score-attacking and hunting hidden collectibles.",
            "review_score": "1"
        },
        {
            "review_text": "I'll be honest, I wasnt a big megaman fan back in my youth but metroid always was fun when I was able to borrow it from a friend. that being said: I want to like this game. I really really do! it's been on my wishlist for what feels like forever. it's been on here for so long that I didnt even know that they made this 'EX' version of it until this very summer sale.  now that we have the intro out of the way:  +the visuals are really nice and pretty. the interface is clean, easy to understand and doesnt interfere or hinder gameplay in any way.  +the soundtrack is awesome and gets you pumped, wanting to keep charging in, dodging and weaving while dishing out your own punishment.  +it has that fun factor that you want in an arcade-style game in the vein of megaman, metroid, I'll even throw in contra and metal slug.  +the level up system is simple +the upgrade system is simple as well and clearly meant to foster replayability (and done right, I'd say) +enemies are cool looking and there's enough of them to present a challenge as well as allowing for satisfactory accumulation of your currency/resource. BUT!  and here's where we get to the cons: -the hitboxes seem off to me. maybe I'm crazy but there are times where I've gotten so frustrated when I analyze a bosses pattern, go to dodge and watch myself still get hit. -that also being said, the controls are definitely sluggish (using a mechanical keyboard). input lag is a very real and very deadly thing in this game, especially in boss fights and even more so when it comes to platforming puzzles where timing is key.  again, I really really really want to like this game. it's got that something that really helps scratch that arcadey-classic side-scrolling shooter itch and does a lot of things right that other similar games dont (level up, upgrades, interface, soundtrack, etc). but the fact that the controls are so slow and the hitboxes dont really seem to match the visuals sometimes just weighs so heavily upon this game since it's fairly fast paced. you're not sure why you didnt dodge that thing when it looked like you did on the screen, and you're pretty sure that you tried to 2xjump+air dash up, but instead you just headbutted the edge of the platform. I'll admit, I'll still keep playing this game and try to 'get gud' but as it stands now, I cant recommend this game on the grounds of its combat and controls. if one was spot on accurate, the other wouldnt matter as much. but the fact that both of these major issues are in the game just make it incredibly frustrating to make it past battles/platform areas. one last plus side though is that you dont really loose anything other than distance when you die",
            "review_score": "-1"
        },
        {
            "review_text": "Contols are clucky, Movements are delayed, Just another megaman wannabe without the better platforming.",
            "review_score": "-1"
        }
    ]
}