{
    "app_id": 315660,
    "name": "Trainz: A New Era",
    "release_date": "2015-05-14",
    "developer": [
        "N3V Games"
    ],
    "publisher": [
        "Deep Silver"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Trains",
        "Driving"
    ],
    "achievements": 23,
    "positive_ratings": 831,
    "negative_ratings": 423,
    "price": 29.99,
    "description": "Service Pack 3Update Released (Jul 2018)! The latest massive update for Trainz: A New Era delivers better stability, smoother performance and improved compatibility, along with plenty of bug fixes and enhancements across the board.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/315660/header.jpg?t=1531292768",
    "minimum_requirements": "OS: Windows 7 64bit Processor: Intel 'i' series/AMD K10 series introduced 2009 onwards. 2 physical cores, 2Ghz 64 bit Memory: 4 GB RAM Graphics: NVIDIA GT 430 or better/ AMD ATI 5550 or better DirectX: Version 11 Network: Broadband Internet connection Storage: 30 GB available space",
    "recommended_requirements": "OS: Windows 8.1 64bit Processor: Intel i5 3330/AMD FX 8350 or better, Quad physical core, 64 bit, 2.3Ghz or better Memory: 8 GB RAM Graphics: NVIDIA GTX 660 or better/ AMD HD 6950 or better DirectX: Version 11 Network: Broadband Internet connection Storage: 30 GB available space",
    "reviews": [
        {
            "review_text": "Like many others I bought this game for a few reasons:  First, I enjoyed Trainz 12, it was the best train simulator I had ever played. Second, Trainz: A New Era was tested by thousands of players for a full year. Third, I ignored all of the bad reviews about this game before I bought it.  The third was a huge mistake. I am not going to repeat the hundreds of bad comments people made about the game, but I will say that I agree with almost all of them. At the very least, to avoid wasting your money, wait until the game is fixed and optimizable.",
            "review_score": "-1"
        },
        {
            "review_text": "I too was a backer of the Kickstarter for this and I really hoped it would be better than it turned out. This review is based on the latest version as of 14-06-2015, and my list of gripes are:  * It looks nothing like the Kickstarter 'teaser' video we were shown. * Performance is terrible, I have to turn down all the settings and run at a resolution smaller than my default 1920x1080 desktop just to get 30FPS. I have a GeForce 760 and at max settings your lucky to get out of single digit frame rates and this is with basically nothing on screen. See my screenshot gallery for images. * Stuttering as the camera moves around the world due to resource loading. Which has got better with the latest version. * Culling of objects is bad, just rotating your view and things will pop in and out. * Varied object quality. Most objects seem as if they are pulled straight from previous versions of Trainz, and even the new ones are inconsistent with some rail cars allowing running numbers and some not. Texture resolutions are mixed ruining the look. * The supposed main improvment, that of 'real' switches, doesn't even work most of the time. * I dislike the UI they use, a lot of thumbnail images they use aren't even at the correct aspect ratio and are blurred, making it look unprofessional.  I could go on, but it's depressing to do so. On the bright side, shadows do actually work.  If only I had Doc Brown's time travelling train, I would pop back and tell myself to steer clear of the T:ANE Kickstarter.",
            "review_score": "-1"
        },
        {
            "review_text": "Looks like a joke. They raised a quarter million to redo the game and all they could do was add some shadows? This game sucks and will never improve.",
            "review_score": "-1"
        },
        {
            "review_text": "I had high hopes for this game but it looks like they took a step back with this one. The graphics got worse, the interface is awful, and the game seems overall low quality. Don't waste your time and money with this.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game just because of seeing the incredible graphics from the Trainz instagram account. It did not take a lot of time to download which is a nice thing but it all got ruined when I clicked the 'Start Trainz' Button.  My favorite Trainz was Trainz 2010. I played TS2010 ALOT because it was enjoyable for a rail enthusiast. It had a lot of content, They did not force you to pay more for DLC and there was a lot of freeware from the community.  But in TANE, All I found is there was a low amount of content and when I clicked on one of the routes,the most shocking thing I found was... YOU HAVE TO PAY FOR SESSIONS! Not even Railworks with expensive DLC has paid sessions. So I got on the ECML route and decided to drive a class 313. My god the cab view was cancerous. I also tried one of those powerful trains from the USA and a German DLC from the creators of the game.   The acceleration and driving on this game is unrealistic. It's like using a Hornby train set.  So overall, If you can't decide whether to choose Railworks or TANE. I recommend Railworks or Trainz 2010",
            "review_score": "-1"
        },
        {
            "review_text": "So I finally decided to give this game a chance, hoping that it'd be a better expereince than Train Simulator.... I am by far not impressed in the slightest. For someone who is new to the world of Trainz the entire setup to this game is terribly confusing, as well as misleading. How you may ask? Well those photos you see on this product's page ARE NOT in the game. Yes I saw it said that downloadable content was in the photos, but I can't even find where to get said DLC. One photo I refer to is the photo of th LIRR engine's pulling a freight. The route and rolling stock are not in the game, and when I look at the store they are nowhere to be found. If anyone can tell me where to find these specific items that'd help a lot. The game only comes with 4 routes and is incredibly hard to navigate through. The graphics in this game look like they just enhanced the mobile version's to fit the PC, the controls to the engines are also rather cumbersome in DCC, something they really don't need to be. Now I only spent $15 on this game because of the saleand I feel pretty ripped off, God only knows what i'd be feeling if i paid the full $40. I would really like a refund anhd DO NOT recvcommend this game to anyone until they make it absolutely clear on WHAT exactly you are paying for. Waste of my money, waste of time, waste of hope. I don't want to bash the developers so much as they probably worked extremely hard on this game as really all I ask is for a more clear and easy system that doesn't confuse people, and if a promo photo does contain DLC tell us where exactly where to FIND that DLC.",
            "review_score": "-1"
        },
        {
            "review_text": "It needs more trains. Too much DLC compared to their oldest game Trainz Railroad Simulator 2006.",
            "review_score": "1"
        },
        {
            "review_text": "Consider this a first impression, from someone who has easily spent well over 2000 hours in previous versions of the Trainz franchise (all the way back to 2004).  The usual load times seem to be getting longer and longer. With my previous version of Train I had the default content, plus about 20 custome routes and about 10,000 extra DLC items I had downloaded using a first class ticket a while back. I enjoy making my own routes, and so I had a lot of scenery items from which to play with. Yeah, back then all that extra content sure loaded down the start up of the game. But I understood it, as there was a lot of content. Loading up this new version, I thought for sure there would be a lot of content to play with. Sadly, however, the pickings seemed very slim once I did get in and see what I had available to me. So imagine if I imported all my old content, it would probably take 3 hours to load :)  So I load up the sessions, and notice that now you have to pay to access some sessions. $39.99? Really are they fooling anyone by deducting that one cent? $40 for a single play session? WTF. I would say about half of the sessions that come with the stock routes, you now have to pay extra for. Here is a question... If I published a route, could I set a price for sessions too? And will I get that money as the route publisher? I somehow doubt it, but damn... That would be nice.  Anyhow, I loaded up the editor. I have spent most of my time in the editor, so I can usually throw together something fairly quick. And alas, nothing has really changed that I noticed throwing together a quick route to test some trains on, in the editor. I saw that they has a FEC GP9 locomotive. Oh sweet.... I love GP9's I have been waiting for an official highly detailed GP9 model. So I plopped that down on the track. The outside skin was indeed very sweet. So I ran the session, and went to drive the GP9 around...  I get into the cab view of the GP9 and... I can't believe what I am seeing. No detail at all. This looks like the stock SD40 interior from 2004. Nothing has changed! Seriously? Very unhappy about this.  Luckily I have been working on a physical real world model railroad, in order to get my train fix as of late. If I had to rely on Trainz much longer, I imagine I would develop a real bad taste for train simulations.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok I'll be quick and to the point. On a GTX 1060 6 GB it runs fine (70FPS) with everything maxed out. However, it has many bugs. For instance in the tutorial mission with lights it black screens. Other than that the lack of routes sucks so ya. Dont bother spending $30 on it. Not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "great game better than any other version",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game for $ 10, to get 2-3 free route and the price tag on the other 3 times more than the cost of the game ... so I DO NOT advise you to buy it anyway for tomorrow in your wallet is 0$. And so if you are interested in playing with two scenarios please ...",
            "review_score": "-1"
        },
        {
            "review_text": "This game have different small problems, but in general it's good and I can recommend it for you!",
            "review_score": "1"
        },
        {
            "review_text": "Yet another train sim that is NOT for newbies. The guides are slightly better than TS2016 but not by much. Do not buy this thinking you can learn the ropes easily.   Also, be aware the hefty price tag is just for the initial game with a few routes. Most of the routes you would want will cost you a lot more.  This is strike 2 for me and train sims. UGH.",
            "review_score": "-1"
        },
        {
            "review_text": "Being unable to authorise the game I just can't recommend purchasing this title. This company can't get its goddam registration right and this has been going on for years. I purchased this AWHILE ago and just tried it expecting they'd have kinks worked out. Good work, arséhøles! You'll need a MyTrains account for this to wo—oh wait, it  still  won't work even after it successfully connects via the game client to the account—STILL CAN'T 'AUTHORISE.'",
            "review_score": "-1"
        },
        {
            "review_text": "Trainz offers so much to train fans that I really can’t call it simply a “game.” It can be a full-fledged hobby if that’s what you’re interested in, and I am.  Not only can you learn to drive realistically modeled rail vehicles on beautiful developer-created routes; additionally, choosing from a vast supply of built-in asset-content (and from a treasure-trove of free user-created downloadable content), you can design and literally build your own virtual 3D-world of colorful, seasonal, and environmental real-world sights and bring it all to life with railroad sound and motion. You can populate your world with interactive industries and task your rail creation to meet their needs. As engineer, you can yourself perform these tasks, or you may build and set AI Trains to handle the job, or—with multiple trains running simultaneously—you can schedule both AI’s and personal tasking. And, of course, with AI’s you can sit back and watch all the fun you’ve created in the world you’ve created. You can even become your own director and set cameras along the routes to capture the action from all angles.  The more I experience Trainz, the more I see it’s incredible range and potential. Driving detailed locomotives and rolling stock on working and lovingly created routes in simulation, learning all about railroad life and tasks is only the start. But it’s a great start that has obviously benefitted from it’s 15 years of evolution. When you watch the You Tube fan-based videos and tutorials of previous offerings and compare them with today’s T:ANE (“Trainz: A New Era”—the latest offering in that evolution), you can clearly see the continuous dedication involved. As the graphics and computer capabilities have improved, Trainz has taken advantage of that by improving the game’s qualities of realism. I find that growth exciting and something to continue looking forward to.  But Trainz is about more than a software developer’s product, their ongoing refinements, and your individual creativeness. Indeed, it’s about a worldwide community of enthusiastic players and knowledgeable hobbyists who are online and only a button-click away. Whether you’re ruling the single-player rails or playing in multiplayer, push that chat-button and you can interact with others from all over who have discovered and are enjoying Trainz. Also, from the help button, you have immediate access to n3v’s Internet Wiki. From there you’ll find all kinds of developer-information and can ask questions from other hobby/game enthusiasts who can and do respond with valuable information to help you. I have personally found the response to be really helpful, timely, and truly there from other train enthusiasts!  There is so much to talk about. If you think you’d like to rule the rails, become a Trainzer and watch a whole new world open up to you.  Best Wishes,  Froglegs ",
            "review_score": "1"
        },
        {
            "review_text": "If you've bought Trainz 12, have a grafics card from the past 2 years (Nividia 900 series/1000 Series) you should be good to buy TAN:E  The bigest learning curve is the new content management system, its works ok, but i still prefer the T2012 verstion of the content magager. my main issue is the removal of content creator plus. without it you have to go into config files and edit things like that. the great thing about the old content manager is that it was easy to use and understand. lets hope they find a new way to fix content without going into configs.  The lighting in this game! 2012 and older had really bland lighing but here its like the devs have given it it a new setting...ultra mega awesome!  basicly if you've got a good enough grafic card, previous experiance in Trainz then you'll like this new verstion of Trainz  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "great game love it this is the best trainz game ever thanks for making this game its sooooooo cool love your games guys keep up the good work",
            "review_score": "1"
        },
        {
            "review_text": "-One Year Review-  As of today (4/24/16), it has been one year since I have purchaed T:ANE. Within this time, I have logged 550 hours + and still adding more. When I had gotten T:ANE, it was in the later state of the Beta builds, when I had gotten it, I find it was pretty well set up, but could use more, or minor tweaks here and there. I forget exactly how I had the money at the point, but at that time I was looking for a good train sim to get for myself, it was a toss up between TS2016 at $30 and T:ANE Deluxe Edition at $70. I'm glad I chose to get T:ANE.  I have recently gotten a copy of TS2016, and I honestly feel a touch confused with it, to me it doesn't seem to be as user friendly as T:ANE. Maybe I need to do a bit more digging around on TS2016 to find out how it all works, it's editor is weird to me anyways, it doesn't have the nice tabs along the side of the screen for exactly what you want like T:ANE does, it won't let you place custom consists or make custom consists while in editor like T:ANE does. In my mind the only things TS2016 has going for it is graphics, steam workshop, and the amount of centralized DLC, which costs a fortune. T:ANE may not have a lot of routes, or locomotives, or content in general, but it has one of the biggest things any game can have, user friendliness.  I have seen this game rise and fall with the updates to it, I honestly don't understand the hate towards T:ANE. Granted yes, there are a few things they could do to improve the game. I have seen them starting to centralize the DLC a bit more, give to the public what they want, and doing what they can to keep the game series alive.  To sum it up in quick points of what I feel T:ANE is: Pros: - User Friendliness - Easy to understand route surveyor - Flexability in what you can do in the game - 'most' models are pretty outstanding in detail and fleshed out (e.g. the SP SD45) - Staff are helpful - Tons of free stuff (300,000+) on Download Station - A test track to test the limitations of your locomotives and see a readout of performance  Cons: - Some models need to be fleshed out a bit more (e.g Payware DLC TUME BN SD40-2) - Not a ton of base content - Needs more centralized DLC, easy to access.  Suggestions: - Keep centralizing the DLC for ease of access. - A separate DLC tab on the main screen, rather than going into a route to check it out. - Put a Visit Test Track button on the launch window. - Remove 'Connot Edit' lock on DLC routes, We bought the route, I think we should be able to edit it.  DLC Suggestions: - We need a Union Pacific Dash 9 44CW - We need Union Pacific's Moffat Tunnel Subdivision. *hint hint* ;)   Overall review 8/10. Thank you for the work and keeping this series alive. -BT",
            "review_score": "1"
        },
        {
            "review_text": "Great so far graphics are a step up route building is easy and includes TONS of american,british, and australian rolling stock. cant wait for the Full game. frame rate is amazing for my medium end PC though a bit laggy at times, completely fits my expectation!!! Get the deluxe version on sale while you can. -Merry christmas everyone!",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't look anywhere near as good as it does in the videos and screenshots and runs like ♥♥♥♥ even on fairly high end hardware (GTX 970, i7 2600k and 8GB of RAM). Don't waste your money on this, get TS12 instead. It looks very similar but runs MUCH better.",
            "review_score": "-1"
        },
        {
            "review_text": "Didnt buy this straight off after reading not so good reviews....it was worth the wait as now it looks really very good! Have only played for an hour and so far so good and enjoying it.  ",
            "review_score": "1"
        },
        {
            "review_text": "beautiful graphics,excellent gameplay,looking forward to many hours of gameplay to come",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this as a way to disconnect and unwind. Plus the part of me that always wanted to drive a train gets to enjoy the fantasy.",
            "review_score": "1"
        },
        {
            "review_text": "There's a few glitches and stuff, and not all of the levels work properly, but it's still fun.",
            "review_score": "1"
        },
        {
            "review_text": "It's better than TS2010",
            "review_score": "1"
        },
        {
            "review_text": "REally good and realistic",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would trainz again ",
            "review_score": "1"
        },
        {
            "review_text": "Several of the old annoyances have been streamlined. The graphical improvements are quite nice!",
            "review_score": "1"
        },
        {
            "review_text": "Much improved load times since I last played. Looking forward to building some custom content.",
            "review_score": "1"
        },
        {
            "review_text": "All seems good at the momment, still getting use to the game.",
            "review_score": "1"
        },
        {
            "review_text": "Recommended.  In short:  -the railsimulation game i have looked for  -good fun, much to explore, scalable difficulty and gameplay -some issues in performance, sound and game content -definitely better then the other big railsim (that punishes its players)  My hardware:  -4 year old gaming PC (no SSD drive) -Nvidia Geforce GTX560 (old) -16 GB Ram  Game performance: -purchased: End of November 2015 after HF2 Patch -time played to review: 20 hrs -program crashes so far: 0 (zero) -GFX settings: mostly low detail, visible range: 2500-3000, texture streaming on -Screenresolution: 1600x900 (performance tip!) -framerate: acceptable for me, moslty fluid, depends on Route (ofcourse) -loading times: the first runups took very long (felt like 5 minutes), directly after first launch more content was loaded down, but it was possible to play during that, currently it launches in about 1 minute, some more time to load when entering a session/route, loading times depend on route size (ofcourse).  -loading times are better than on the other big railsim.  Gameplay matchwinner for me: -easy and realistic driving mode, both fun -physics simulation very good -shunting and long hauls, both possible -Quickdrive Mode in 'Kickstarter county' -set complete trains onto looped main line and tell the AI driver to drive -add more trains, they will all follow the speedlimits and signals automatically -add even more trains, tell the driver to go to a specific point and he will drive there, including direction changing and junction setting, all other trains will wait if that train blocks the track. Awesome! -plenty of complete trains to set on tracks, my favourite: 'The blue planet' diesel train -click on a red signal in front of you and the focus jumps th the cause for that. -switching junctions is straightforward  Not so good details in gameplay: -questionable price for addon routes, better purchase at bundle with the main game (deluxe version) -3D-sound is somewhat awkward at some points. -very good content on one and somewhat old/messed up stuff on the other hand (locos, routes, assets) -only few missions(2-4) included in every route by default -some missions surprisingly long (2hrs) with lot risk to mess up on a goal -map mode feels a little bit chaotic  Documentation: -about 10 good driving tutorials, 5-20 mins each, good learning curve, good fun -250 pages manual in english with every topic handled   Building tracks and sessions (Surveyor): -just tried shortly -possible to set a track with a train within 20 minutes for basic operation -easy Interface -(to be honest:) not real fun because of vastness of possibilities, reading documentation mandatory  NOT tested so far: -login to developers online service/website -multiplayer -downloading free content from 'download station'  Remark: -everybody writing a Steam review will get free DLC, no matter if it is a good or bad review.",
            "review_score": "1"
        },
        {
            "review_text": "very good content also very good for addons recomened",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game it looks great, but the performance isnt all there yet. My game runs rathers smoother when traveling at higher speeds than when crawling through the rail yards.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game so much fun",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful upgrade, sceneries and graphics are awesome.",
            "review_score": "1"
        },
        {
            "review_text": "love everything about it",
            "review_score": "1"
        },
        {
            "review_text": "Seems pretty cool. I just bought it and initially it has been fun. I like the fact that it uses realistic names and logos which many games have avoided making up weird fake ones. Still exploring but happy so far.",
            "review_score": "1"
        },
        {
            "review_text": "Tutorial Helpful. Graphics not quite as sharp as I expected from DirecctX 11, Good simole out of Cab controls.",
            "review_score": "1"
        },
        {
            "review_text": "Defidently reccomend this game ",
            "review_score": "1"
        },
        {
            "review_text": "Great fun, dont hesitate in getting it - some others have reported performance issues, but I have had no issues at all and it runs great on my laptop",
            "review_score": "1"
        },
        {
            "review_text": "It's okay. Nice features and stuff. Runs laggy even though I have a power computer and even in low graphics mode. 2012 was better IMO.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst simulator ever. Loads of payware included cant remmeber resolution settings. 15 minutes of start",
            "review_score": "-1"
        },
        {
            "review_text": "I'll keep it, but only because it was 75% off. I donated to this, then changed my mind thinking they'd never deliever on the high sounding promises. I made the right choice. Load up C&amp;O and it looked quite nice, then a car drove right though my train like it was a ghost... Tried the Milwalkee route - looks like a cartoon (IE old assets NOT updated) Bad enough you can get old chunky cartoony assets on the Download Station, but as a PAYWARE ADDON!?!?! Come on...  At $18.74 this mixed bag of lovely and laughable is OK - it sure ain't worth no $71.99 (the full retail as of this writing)",
            "review_score": "-1"
        },
        {
            "review_text": "love this game , i had to trun down all setting but it runs and looks great now",
            "review_score": "1"
        },
        {
            "review_text": "Its recommended from my point of view.",
            "review_score": "1"
        },
        {
            "review_text": "i honestly havent had an issue with the game so far sometimes the train lags a bit but with service packs the game should run smoother it has potential to be good but at the moment its sub par.",
            "review_score": "1"
        },
        {
            "review_text": "Such a great game",
            "review_score": "1"
        },
        {
            "review_text": "first off i would like to say this is not train simulator 2015, if you came here looking for that type of sim, don't bother.trainz is a much more in depth train sim that has many more features than ts 2015 offers.i for one enjoy driving, creating and building my own model railroad setup.you can setup a whole train route very quickly once you get the hang of it.if you are after just driving, that is an option also, you will just need to download payware or freeware routes.there is 10 times more freeware for trainz than other sims.i would also suggest jointed rails that make great payware u.s locos and content.as far as performance, if you go in eeven with the highest computer on the market, you are unlikely to max all the sliders out.this train sim is 64 bit only now and much more future proof.if you have a low to mid range pc,expect to have sliders turned down to low.if you are running a high end pc, expect normal to high settings, and try a few different settings, before you come here and say the sim sucks.it may look alot like trainz 12, but its not trainz 12.content is gonna need a little time to mature before you will see large amounts of content on the download station.i hope this helps some of you that read so many negative reviews and put off buying because of comments on here. give this new trainz version a try and ignore what alot of people have said.obviously they haven't done there homework before buying.i put off from purchasing because of these very same bad reviews, and i would say 90 percent of the negatives are flat out wrong, good luck.i am really enjoying it so far.grab the delux version while its on sale, you get 8 routes.",
            "review_score": "1"
        },
        {
            "review_text": "At first it was laggy. It was my PC that i figured. I bought a 900 USD PC and it works 9/10 better.    I would recommend this game to anybody who has a very good PC.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly don't get why people dislike this game after having little playtime with it. I think this game is a positive step in the right direction with the new 'built in switches' used on the new track. However, I dislike the amount of content thie game lacks. I van assume that the game needs more work, and that the old content will eventually find its way into the game. The other interesting feature is when you zoom out all the way, and the camera mode changes to 'map' mode. If people want to think of this game as a load of garbage, then let them, but I am not going to give up hope just yet. I'm waiting on YOU, Developers, to fix what's wrong and add all the content that was in previous versions of the game! The only reason I gave this a thumbs up is so tha we can back a game that can improve instead of ditching a title that might actually have a chance at improvement.",
            "review_score": "1"
        },
        {
            "review_text": "  Great game. Lots of DLC i bought from JR. Its good when you dont have crappy freeware ;)",
            "review_score": "1"
        },
        {
            "review_text": "not rly anything new",
            "review_score": "-1"
        },
        {
            "review_text": "I love it so much ",
            "review_score": "1"
        },
        {
            "review_text": "Alright. Forget the rave reviews, the official trailer for this game was literally BREATHTAKING. That's all you need to know.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty Cool",
            "review_score": "1"
        },
        {
            "review_text": "cool train sim game",
            "review_score": "1"
        },
        {
            "review_text": "Great",
            "review_score": "1"
        },
        {
            "review_text": "A new era in costs, what was a good old game is now pants at a price, I mean £27 for a single map and I counted 6 for sale, are they mad!!!. They once stood out but now they are just like the normal greedy money printers, not only that but this game is a lot worse than train simulator but at least they have copied the DLC profit marketing idea from them.  2/10",
            "review_score": "-1"
        },
        {
            "review_text": "great game, my only complaint is i wish the quick drive feature already had a yard full of cars and such set up so you can free roam and switch cars out with out needed to be dedicated to a single single player seasion thats dedicated to just one mission.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, well thought out physics, and tons of great fun!!",
            "review_score": "1"
        },
        {
            "review_text": "Wow. After reading several horror stories about extreme poor performance I decided to give it a try for myself since it was on sale for 50% off and...  I'm so glad I did.   It's beautiful!!!! Not only does it look lovely, but it's running very smoothly for me on my 8 yr old PC (quad core/660Ti)!!!!  I'm now just diving into it, but from what I have played I am having a blast and the visuals are a feast for my eyes!!!  Lookinig forward to creating some nice artwork...gifs and vids with this Sim!!!",
            "review_score": "1"
        },
        {
            "review_text": "it is a highly enjoyable train sim. i love it soooooo much. im happy i bought this. so happy:)",
            "review_score": "1"
        },
        {
            "review_text": "Certainly not bad. Watch the system requirments, though. Be wary.",
            "review_score": "1"
        },
        {
            "review_text": "I play Trainz and Train Simulaotr. Train Simulator has better detail and graphics but I play Trainz more. I just like it better but I would still always want both. The Rail Driver is also another nice addition that works well and greatly enhances the overall experience.",
            "review_score": "1"
        },
        {
            "review_text": "  I love this its the best simulatar game ive ever played it have told how steam locomotive truely work. I Hope it may be improved in the future:)  I recommend this game for anyone who likes train!",
            "review_score": "1"
        }
    ]
}