{
    "app_id": 315830,
    "name": "Daedalus - No Escape",
    "release_date": "2014-10-28",
    "developer": [
        "Patrice Meneguzzi"
    ],
    "publisher": [
        "Patrice Meneguzzi"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Partial Controller Support",
        "Stats",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Multiplayer"
    ],
    "achievements": 44,
    "positive_ratings": 98,
    "negative_ratings": 18,
    "price": 3.99,
    "description": "If Quake 3 Arena and Alien Breed had a baby ... it would be named Daedalus - No Escape.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/315830/header.jpg?t=1447362837",
    "minimum_requirements": "OS: Windows 7 - Windows 8 Processor: dual core Memory: 2 GB RAM Graphics: OpenGL 3.0 compatible graphics card Storage: 300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Bad ♥♥♥, a mixture of Quake and Alien Breed. Get it cheap in Indie Gala Every Monday Bundle #72. Well worth it just for this hidden gem.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is Truly a fantastic, quick paced, action packed, Top-Down Shooter that many can enjoy  I grew up playing Top Down arena shooters which makes this even more of game I would be drawn to. this game is a fast paced action shooter where you can play with people from around the world or your  Bro that's 5ft away The game currently has a nice amount of guns and maps and the Bot A.I. are quite worthy if being played against   So my final verdict would have to be a 100% recommended Game   &amp; if you like top down shooters you should get it too!",
            "review_score": "1"
        },
        {
            "review_text": "PERFECT  This game is straight at it's best! I came across when it's on sale, I bought it, tried it out; It's excatly how I wanted it to be! Sadly however; this came out around the time Call of Duty came out, god-d^mn ^ss-bags ruin every good game, please, can there as much people as there is in Unreal Tournament 2004/GOTY/UT3? But overall, 10/10, absolutly should've been the best top-down game there is.",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced action top shooter and a great game for a lan and also casual while spending the weekend at home. This game made me laugh for a long period of time, which rarely happens in games nowadays.  Also the community isn't toxic and people enjoy killing each other on deathmatch servers.  No upgrade ♥♥♥♥ like cod etc. just pure carnage (:  Btw the map editor is easy to use and will make a perfect fit for steam workshop.",
            "review_score": "1"
        },
        {
            "review_text": "Daedalus isn't really worth your money right now. Unless you want to play with bots and/or rank up the leaderboards.  You should probably wait in the future. 6.7/10  [Edit] Also, even though Daedalus was based off two games 'making a baby' or becoming one, whatever you want to call it, Daedalus - No Escape isn't really the right title for this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a freaking ton of fun. The bots are too easy (and the hard bots don't get harder, they just get perma-quad-damage) but man, when you wanna chill for a few minutes, this game delivers. I'm reminded of my days playing CTF in UT and Q3 waaay back in the day. I haven't played online (there aren't many people playing = not many servers = ♥♥♥♥♥♥ ping) but I'll host a server soon.   Needs a dedicated server client!",
            "review_score": "1"
        }
    ]
}