{
    "app_id": 315920,
    "name": "Stonerid",
    "release_date": "2014-08-15",
    "developer": [
        "Enitvare"
    ],
    "publisher": [
        "Enitvare"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 37,
    "positive_ratings": 118,
    "negative_ratings": 55,
    "price": 3.99,
    "description": "Stonerid is a challenging 2D platformer, which the most important feature are two parallel, different worlds. Over 30 different levels to complete, unconventional game style and lots of dangerous traps and monsters make it extremely difficult to rise to the challenge.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/315920/header.jpg?t=1508681503",
    "minimum_requirements": "OS: Microsoft® Windows® XP / Vista / 7 / 8 Processor: 2.0 GHz Memory: 1 GB RAM Graphics: 512 MB,  Shader Model 2.0 (GeForce 9600GT or greater) DirectX: Version 9.0c Storage: 600 MB available space Sound Card: Compatible with DirectX®: 9.0c Additional Notes: keyboard and mouse required, optional Microsoft Xbox 360 Controller",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Stonerid is a pretty simple and classic platform game, the gameplay is based on a world with 2 parallel dimensions where you can switch from one to another to proceed in the level. While the idea is pretty good, there are a few bugs which can negatively influence the gameplay and overall experience, I still recommend this game since its really low price and few hours of nice gameplay that it offers...  Pros: + Really nice graphics + Decent sound effects/music + Enjoyable background story + Xbox360 controller support + Trading cards &amp; Achievements + Very low price  Cons: - The parallel dimensions feature is not original - Some bugs can be annoying (Checkpoints disappearing from a level, difficulty setting not keeping your choice...) - Movement mechanics could be improved - While in-game compatibility with controllers is great, menu navigation isn't well implemented   6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Great concept but in my opinion requires you to switch universes and die over and over to get just a tiny bit farther than you were. You spend most the game dying repeatedly to get a little bit further than the last time.",
            "review_score": "-1"
        },
        {
            "review_text": "This is an osome game.. Just buy it and enjooy every second of it.. I got the game fr $ 0.49. Its a steaal fr dis price",
            "review_score": "1"
        },
        {
            "review_text": "The game seems alright, it's enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "I bought a random steam key, and fortunately (sarcasm), i got this! It is a platform which i dont like, and yeah, did the tutorial, and at the third part of it uninstalled it. Dont think it is worth it for 4,99 euros, and i don't want to offend the devs of this game (if you have put effort in this game), but the graphics are just awful (and yes i know that graphics are not the main important thing in a game). But still would not buy the key again! ",
            "review_score": "-1"
        },
        {
            "review_text": "I finally decided to get my Stoner ID, and get my stoner discounts in head shops everywhere",
            "review_score": "1"
        }
    ]
}