{
    "app_id": 316600,
    "name": "QP Shooting - Dangerous!!",
    "release_date": "2014-11-14",
    "developer": [
        "Orange_Juice"
    ],
    "publisher": [
        "Fruitbat Factory"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Bullet Hell",
        "Shoot 'Em Up",
        "Anime"
    ],
    "achievements": 36,
    "positive_ratings": 349,
    "negative_ratings": 27,
    "price": 5.59,
    "description": "QP Shooting - Dangerous!! is a bullet hell type shoot’em’up starring the pudding-loving dog girl QP seen in 100% Orange Juice. Nothing can stand between QP and her pudding - not even difficulty options to reduce the experienced gamer to tears!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/316600/header.jpg?t=1500959850",
    "minimum_requirements": "OS: Windows XP/Vista/7/8 Processor: Intel CPU 2.0GHz or faster Memory: 1024 MB RAM Graphics: DirectX 9 or above compatible card with 256MB VRAM or more (Radeon or GeForce recommended) DirectX: Version 9.0 Storage: 1 GB available space Sound Card: DirectSound-compatible card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "2D shooters are one of those genres that I can't get enough of. While I love older games such as Life Force, XEXEX, and Twin Cobra, I tend to play danmaku titles. You know what I'm talking about right? Dodonpachi, Mushihime-sama Futari, Crimzon Clover, etc. These games are also known as pudding-hells.   QP Shooting is by the guys that put out 100% Orange Juice. How do you go from that to a 2D shooter? I thought this was some kinda joke. It seems like every doujin developer has a danmaku in their pocket. Still, curiousity got the better of me, so I bought this game.   As it turns out, this game is legit.  Hmm..Leaving ya'll in suspense doesn't quite work, when you can see the big fat thumbs-up. Oh well.  Correct me if I'm wrong but the nonsense plot goes sorta like this: In a world where the very existence of bullets is being threatened, one dog-girl can make a difference. QP must brave five stages of intense pudding-filled action. Like any other super-human or prototype-ship, QP has three lives and dies in a single hit. Also, unlike arcade games, you don't get any continues. Fans of credit-feeding? Too bad. I'm going to spoil the ending to this game right now.  SPOILER ALERT SPOILER ALERT SPOILER ALERT QP becomes the Guardian of Bullets and defeats the Sweet Breaker.  What a shame. I ruined the most riveting storyline of 2014 for everybody. Moving right along...  Since this is a danmaku game, expect to be overwhelmed by lots of pudding. QP Shooting isn't quite like all the other shmups.   Before you even start the game, you have to decide on your Rbit formations. You can have up to three, and you're obligated to switch between them when the situation calls for it. At the start you have some basic formations: a spread shot, a rear-shot, and a narrow power-shot. There's 27 formations in all, and they can include all sorts of wacky combinations. Right now I'm messing around with orbit, twin-shot, and niagara formations. Orbit is fairly decent for getting those weak enemies that like to get away, while the twin-shot provides power as well as flexibility. Niagara is just weird. There's a forward shot, but the Rbits float near the top of the screen and drench everything below with pudding. There isn't any best formation, since everyone has their own play-style and preference. So feel free to experiment, and find one that works for you.  Next up is your hyper mode. As you wreck havoc, a meter fills up. Once it hits 100-150% you can unleash the hyper. Aside from an increased amount of damage, baddies cough up more chain-building stars, and nearby pudding disappears. If you're not collecting stars, your combo-chain will break, and the score will suffer big-time. Death also breaks chains, so try to avoid that too (could be difficult!). One of the other benefits to using hyper is that while it's active your chain is safe (don't get hit by any porridge though!) So what are you? Orthodox, Aggressive, or Defensive? This affects the strength of your hyper as well as how long it lasts.   Each stage consists of the usual mix of weakies, toughies, and everything in-between. Weakies die to a light sneeze, while toughies require a bit of firepower to bring down. Toughies also tend to have armor. This is temporary but it severely limits how much damage you do to them. The thing is, while they can and will fill the screen with pudding, all you have to do is destroy them and all their wishes for your untimely death will turn into lovely stars. Yep, just like other shooters, QP Shooting has pudding-cancelling. You don't have to be in hyper mode either. This is where all that time spent figuring out the best Rbit formations pays off. Keep in mind though that you're going to WANT baddies to clutter your screen, just so you collect more stars when you destroy them.  Unlike most shooters, the bosses in this game aren't just some huge target with a ton of heavy weaponry. They move around, they summon help, and that's a major opportunity for pudding-cancelling. All of the bosses have between 3 and 5 phases, and they'll throw around all kinds of unique patterns and special tricks. This makes for boss-battles that can be really entertaining, since they require the player to approach them differently. QP Shooting isn't just another shmup, where you spend every boss-fight, holding down the laser button and making millimeter-tight dodges.  The overall difficulty of this game is on the lower side. There are four difficulty settings, but for the most part the difference is incremental and not dramatic (aside from a few surprises). It's best to start with normal, see how far that gets you, then drop down to easy for a little while. Once you get a handle on things, then you can work towards the harder difficulties. While you can't continue, the extra lives are surprisingly generous. There's also a conquest mode, where you can practice formations and stages. The setup is a little weird though. You have to beat a stage, then save the game. When you load your save, you can choose what stage to practice.  This is a really enjoyable shooter, but I have a couple issues with it. These can be fixed pretty easily I believe, since they involve the UI. When holding down the 'slow' button, a 'THIS IS YOUR HIT-POINT! SAY HELLO HIT-POINT!' message circles QP and her hitbox. Naturally QP only dies when her hitbox is touched by pudding. This game operates under the assumption that players know what a hitbox is, so why the message? It's just a distraction. This also applies to the hyper mode indicator. This larger circle surrounding QP lets the player know they have hyper, since their eyes can't always check the top of the screen. All this seems a bit much. Wouldn't a subtle aura suffice? Something noticeable but not distracting. Players aren't going to care if they have 124% or 109%. They'll active the hyper when they need it, whether its for scoring or survival. All I'm asking for is an option to remove this unnecessary info, so I can focus on not getting killed.  QP Shooting - Dangerous!! is well worth a look. As shmup-starved as Steam is, I'm willing to accept anything. However, I can assure you that this recommendation isn't a result of low-standards. The 2D shooter has been around for 30+ years, so I don't tolerate screw-ups. This game not only gets the fundamentals right, it also delivers some neat twists and a sufficient level of challenge.  Not bad for a video-board-game developer eh?",
            "review_score": "1"
        },
        {
            "review_text": "god bless fruitbat factory for bringing such joy to my heart.   this game is a BulletHell style game with characters from 100%OJ. need i say more?  well, if i do, here it is. the game plays well, the soundtrack is great, the art style is appeasing and easy to stare at without hurting your eyes. if you have 8 bucks, and like bullet hell games, get this.   ",
            "review_score": "1"
        },
        {
            "review_text": "One really cute, simple, yet fun game. And simple doesn't mean easy here. Classical bullet hell, but with lots of formations it can gift you hours and hours of stupid smile of enjoy on your face and a bit of swearing, while you're trying to get clean stages on higher difficulties.",
            "review_score": "1"
        },
        {
            "review_text": "Read some of the comments but didn't believe them. How could something soo adorably cute actually be that hard, right? They do not lie. Even playing on normal difficulty I'm having to take breaks to prevent rage overloads. By far one of the best shooters I've played in a very long time. Controls are spot on, no wonky hitboxes that may or may not tag a passing bullet, enemy and boss mechanics that will actually require a bit of planning and changing of combat styles. Even easy is no joke as the enemy numbers and attack speed are the same, they simply launch a few less projectiles each volley and bosses lose a couple of their moves. Storyline is hilarious, simply an inugirl in search of pudding. The settings and characters you meet along the way are some of the most cliche yet amazing ever. Probably my largest drive to progress is just to see what new boss they will throw at me next.  If you like shooters with incredibly tight controls, varied enemies, insane difficulty curves, and wide selection of attack types, you want this game. If you also have a love for cute anime girls, or a deep desire to fly around as a dog girl in search of pudding, you -need- this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun .",
            "review_score": "1"
        },
        {
            "review_text": "My favorite Bullethell on Steam. with the Gundemonium series Really feel like a bullethell. The bullet is not too fast and plenty some are shootable.   Excellent scoring system max your chain and collect the most stars in hyper mode. 4 different difficulty easy to super hard (even at easy, it can be a little hard) Excellent soundtrack.  Many shooting formation to pick to fit your style. I'm 99% umbrella. (your need unlock them)  Playable Qp dangerous on 100% orange juice another great game.  The story just silly but nice. Try beat my score i probably have some replay. check the forum or ask me",
            "review_score": "1"
        },
        {
            "review_text": "If you don't know what pudding is, then you better buy this right now.",
            "review_score": "1"
        },
        {
            "review_text": "Run around as a dog shouting 'PUDDING!!' at everyone and murdering them. From a nerdy school girl obsessed with chickens to demon worshipping lolis, you can murder them all to get your final goal of pudding.",
            "review_score": "1"
        },
        {
            "review_text": "Cute, difficult, nice scaling difficulty options and lots of weapon styles to unlock which can completely change up the way you play. Also pudding.",
            "review_score": "1"
        },
        {
            "review_text": "One of the closest things to Touhou you're gonna get.",
            "review_score": "1"
        },
        {
            "review_text": "Touhou with Pudding. Pudding/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "It's hard.",
            "review_score": "1"
        },
        {
            "review_text": "Absolute CRAP and not worth another word",
            "review_score": "-1"
        },
        {
            "review_text": "It's K",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic cutesy SHMUP starring characters you'd find in 100% Orange Juice. You play as QP and have to find out who took all the pudding from the world. You have a variety of options for your weapon patterns, some more useful than others, and can choose between three play styles, one with more offensive power but less time in 'hyper' mode, a defensive mode, with less power but longer time in hyper mode, and a normal mode.  The game is pretty neat in having a chaining system, which basically tries to have you kill enemies and keep collecting stars to get a high chain for more points and so on. It can get pretty challenging trying to keep your chain, and often might mess up because of that, but is a fantastic feature.   This game is HARD. Don't let the cute graphics fool you. You will end up restarting a lot, but the game never gets boring. the graphics are nice and crisp and the music is adorable. The characters are fun and overall it's an incredibly polished game.  There are two modes of play, arcade mode, which lets you just play through the game straight, or a mode which lets you save progress between levels.",
            "review_score": "1"
        },
        {
            "review_text": "This is game is so cute and fun!",
            "review_score": "1"
        },
        {
            "review_text": "10/10, contains waifus, bullets and pudding. Would save pudding again.",
            "review_score": "1"
        },
        {
            "review_text": "Simply neat danmuku game with ton of gimmicks.",
            "review_score": "1"
        },
        {
            "review_text": "All I'm gonna say is, Orange Juice has made another very very fun addictive game.   Its the kind of game you play where you either feel its meh, or its very special to you and for me it was the Latter. QP Shooting Dangerous is special to me.   Important to note out that Once Again, Orange Juice Have Nailed the soundtrack to this game. If your not interested in purchasing the game (Which I think you may be slightly mad in not doing so) Then I would urge you to check out the track list to QP Shooting Dangerous and Suguri as they have been the best track lists I've heard in a very long time.  The game on my system Runs at a Solid 60fps without fail and set up is very easy. I was expecting trauma as most of the games I buy require you to have to search out a way to get games running properly and to the correct screen measurements (Looking at you eXceed :( ) but with QP , No such problems and everything was ready to go within a matter of moments.  As for the game itself, Its very bright and colourful. its also very crisp and sharp which I love. Control of QP is very slick and smooth and as with most bullet hell games, the feeling of destruction is very warming to the heart. all for the quest of pudding I may add.  I say, Yes!! Definitely give this one ago as the price is extremely good value, And let the music psych you up as millions of projectiles hurl themselves at you without mercy.   I need to get this soundtrack. :)",
            "review_score": "1"
        },
        {
            "review_text": "QP Dangerous is an entertaining shooter with a surprising amount of depth. You start out choosing one of three different styles: Aggressive, Orthodox, or Defensive. Aggressive gives you more attack power but takes longer to charge up hyper mode, Orthodox is the middle ground, and Defensive charges your hyper mode faster but reduces your attack power.  The Hyper Mode is important because when activated you erase all bullets on screen and gain points based on how many you destroyed. This is important because in QP Dangerous you will be overwhelmed with way more bullets than you can dodge. Bullets disappear when you kill the enemy that created them so can't take too much time. Also in Hyper Mode your combo meter stops decreasing for the duration, allowing you to keep building your score through sections where you can't constantly eliminate enemies. Most importantly though, you're allowed to take one hit in hyper mode without losing a life. This resets your combo counter completely but is a very useful panic button. Hyper mode immediately ends but you can erase a difficult pattern's bullets and have insurance in case you happen to get hit in the next few seconds. Killing a boss while Hyper Mode is active nets you a huge bonus.  Aside from the Hyper Mode mechanics, we also have formations that affect how your own bullets work. The bullets you shoot spawn from the R-Bits flying alongside you, and the formations affect how they are positioned. There are over 20 in total, with all of them aside from the default available for purchase with points earned from playing the game. Some of them even increase the score you get in exchange for being more challenging to use well. Every time you start a new game you pick 3 separate formations out of the ones you've unlocked to use and can swap between them at any time during gameplay. I've had a lot of fun experimenting whenever I unlock a new one and quite a few of them have really interesting gimmicks that require completely different strategies to use effectively.  Last off the story is rather simple but the dialogue is entertaining and the whole concept of saving the world's pudding is taken to the comedic extreme. It takes a turn for the epic towards the end that's hard to take seriously, and I found myself laughing at the absurdity of it. The focus is definitely on the gameplay though, and they've built an extremely solid shooter out of it. Pick this one up if you enjoy the genre. It's one of my favorites.",
            "review_score": "1"
        }
    ]
}