{
    "app_id": 316840,
    "name": "The Sacred Tears TRUE",
    "release_date": "2014-09-25",
    "developer": [
        "AlphaNuts"
    ],
    "publisher": [
        "Nyu Media"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "JRPG"
    ],
    "achievements": 0,
    "positive_ratings": 45,
    "negative_ratings": 15,
    "price": 6.99,
    "description": "Sacred Tears TRUE brings both traditional JRPG elements and fresh and unique features such as a deceptively simple but deep card battle system, redistributable skill points, and graphics by Takashi KONNO, and music by Hiroyuki Ojima and Shimotsuki Haruka.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/316840/header.jpg?t=1447362957",
    "minimum_requirements": "OS: Windows XP/ Vista / 7 / 8* Processor: Intel Pentium 4 1.5GHz or better Graphics: Onboard graphics card will be plenty",
    "recommended_requirements": "Additional Notes: * Some Windows 8 environments may prevent the game from running in full screen mode. To enable full screen mode, right click the file ‘The Sacred Tears TRUE.exe’ located in the game folder, open Properties, select the Compatibility tab, and select the Compatibility Mode to Windows 7 or earlier.",
    "reviews": [
        {
            "review_text": "Pretty solid RPG Maker based game.  Story involves the event of a Thief Wannabe aiming to be the best thief in town. Game has a rater simply plot but it does a darn fine job at the character development. Though you will be reading a lot. Like any RPG  Combat is a game of Rock-paper-scizors mixed with RPG elements and card fights. Takes a while to get used to it but once you do its a breeze.    Downsides is that the game revolves entirely in the same town. Adding a new character here and there. This isn't something new on the JRPG world, but makes you wish the map was bigger.   Pretty solid game, if you are not buying this full price, give it a chance on a sale. It's worth the time.",
            "review_score": "1"
        },
        {
            "review_text": "I've played the game for 15 hours so far and I still haven't even finished the first row of missions. Maybe I'm just being thorough, but for a game that's less than 50 MB in size, I think it's surprisingly involved.",
            "review_score": "1"
        },
        {
            "review_text": " An Amazing Turn-base JRPG Card-based Game",
            "review_score": "1"
        },
        {
            "review_text": "Great character art, story and character development. Feels very much like a traditional JRPG, but with a very different battle system that involves a card system that will feel somewhat like rock-paper-scissors (there are ways to predict though, so it's not blind luck).  Overall I really enjoyed it, got attached to the characters as you learn about them throughout the game.",
            "review_score": "1"
        },
        {
            "review_text": "Gotta admit that I didn't finish the game. I got bored.  At first I liked the game, but the more I played it, the more I disliked it. The battle system was interesting, but player couldn't change or upgrade the deck and that was a downfall for me.  I also didn't like when you have to fight alone, yet the magic card still came. It was annoying.  The story and character development was ok though.",
            "review_score": "-1"
        }
    ]
}