{
    "app_id": 316970,
    "name": "The Waste Land",
    "release_date": "2014-09-16",
    "developer": [
        "Fledermaus"
    ],
    "publisher": [
        "Digital Tribe"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Action"
    ],
    "achievements": 30,
    "positive_ratings": 46,
    "negative_ratings": 44,
    "price": 7.19,
    "description": "The Waste Land, a &quot;metroidvania&quot; style side-scroller inspired by T.S. Eliot’s poem of the same name, puts players in the role of a fallen king who must find his way to right the wrongs caused by his own failings.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/316970/header.jpg?t=1447362984",
    "minimum_requirements": "OS: Windows XP/Vista 7/8 Processor: 1.2GHz processor Memory: 1 GB RAM Graphics: DirectX 9.0 compliant DirectX: Version 9.0c Storage: 50 MB available space Sound Card: DirectSound compliant",
    "recommended_requirements": "OS: Windows XP Processor: 1.4GHz processor or faster Memory: 2 GB RAM Graphics: DirectX 9.0 compliant DirectX: Version 9.0c Storage: 50 MB available space Sound Card: DirectSound compliant",
    "reviews": [
        {
            "review_text": "God-awful controls that can't be changed. Enough said.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun and moody metroidvania. Huge world and a deep sense of exploration and discovery and nintendo-hard gameplay. The most similar game I can think of is probably Castlevania 2 on the NES, only better and in a world that feels much bigger. Get it only if you are a true retrogamer and like that kind of gameplay, you aren't going to be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "First, i want to appologayse for the many english mistakes i am about to do in the writting of this rewiew, for english is not my first language.  There is really a lot in this game, good and bad. Even if I really enjoyed playing it, and would recomend it warmly, I understand lots of people would not. Indeed, this atmospheric matroidvanian game has lots of pros and cons, that i am going to summerize below.   First, the cons:",
            "review_score": "1"
        },
        {
            "review_text": "It has problems which have been discussed in other reviews, and those are certainly legitamate. I think it's worth it, though. It has a cool story and a really neat Metroidvania world puzzle. Get it on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Feels like wasted potential. Some sprite animations are very good while some are flat and lifeless. Some level designs are decent while some are flat and boring. Game input feels workable but not satisfying. Music starts promising but ends up a lifeless droning loop. Everything about it says 'good start and then rushed out' which is disappointing, especially for such a high price tag.",
            "review_score": "-1"
        },
        {
            "review_text": "Women Death Monsters Nudity 69/69 Am I right!?!      ...is this thing on?",
            "review_score": "1"
        }
    ]
}