{
    "app_id": 317040,
    "name": "The Original Strife: Veteran Edition",
    "release_date": "2014-12-12",
    "developer": [
        "Rogue Entertainment"
    ],
    "publisher": [
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "Action",
        "RPG",
        "Classic"
    ],
    "achievements": 20,
    "positive_ratings": 329,
    "negative_ratings": 28,
    "price": 6.99,
    "description": "Hailed as the original FPS-RPG game that spawned countless imitators, Strife: Veteran Edition is a love letter to the classic from 1996.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/317040/header.jpg?t=1466791165",
    "minimum_requirements": "Mínimo: SO: Windows XP / Vista / 7 Procesador: 1.0 GHz Processor Memoria: 256 MB de RAM Gráficos: 100% DirectX compatible graphics DirectX: Versión 9.0c Red: Conexión de banda ancha a Internet Almacenamiento: 500 MB de espacio disponible Tarjeta de sonido: 100% DirectX compatible onboard / dedicated device",
    "recommended_requirements": "Recomendado: SO: Windows 7 and later Procesador: 1.5 GHz Processor Memoria: 512 MB de RAM Gráficos: 100% DirectX compatible graphics DirectX: Versión 9.0c Red: Conexión de banda ancha a Internet Almacenamiento: 500 MB de espacio disponible Tarjeta de sonido: 100% DirectX compatible onboard / dedicated device",
    "reviews": [
        {
            "review_text": " One of  THE Best Doom Engine Game EVER!  Strife is incredible. It's EASILY the best game released using Doom Engine. It feels almost like an earlier version of Deus Ex with its post apocalyptic cyberpunk inspired setting that has you running around a city hub taking &amp; completeing jobs for various NPC in the game while finding, earning, &amp; buying upgrades for your character &amp; his arsenal. Its a damn shame it had to drop a month before the likes of Quake. Thanks to this almost no one has ever heard of it, and it was doomed (no pun intended) to launguish in relative obscurity never recieving the recognition it deserved. Believe it or not, this is the game that pioneered interactive AI allies &amp; ingame storytelling in an FPS, things Half-Life was later was credited for. This truly is not only the best Doom Engine Game but also one of the greats forgotten gems of all time.",
            "review_score": "1"
        },
        {
            "review_text": "  Long story short:  An extremely obscure gem, mixing shooter and pseudo-RPG mechanics into a perfect blend. Though very difficult, if you like games such as System Shock 2 or Deus Ex, Strife is an excellent example of the genre fusion well before anything else was done. And it's worth picking up if you like retro shooters in general.",
            "review_score": "1"
        },
        {
            "review_text": "Another beyond-great classic game that was shadowed by others. The problem is that not many people knew the game because it was released 3 months before Quake and was left behind because of the dated technology. But i tell ya, Strife is one of the best games ever made. And with this version, its even more awesome. Firstly, i love the aspect of the 'Story builds up on the choices you make', that means that if you got a choice the story will develope branches, and you will end up in other levels or meeting other people.  Secondly, the people you meet. Sometimes you will meet people who will betray you, sometime you will just meet ♥♥♥♥♥♥♥s, and sometimes you will meet people who are friendly and will help you. The weapons feel awesome, and all are useful, cant expand more on that. In this version the visuals in the game look really good, shaders, smooth textures and sprites lightning, and motion blur, looks real good. Music is great. Multiplayer has great potential and is overall fun but needs little fixes there and there but overally its fun and good, and I believe that its just about time till the workshop comes. In a conclusion, this is the must have. If not, you should at least try it. I rate it as one of my top favorited games.",
            "review_score": "1"
        },
        {
            "review_text": "WOW! this really is one of the best FPS/RPG games ever! The game controls like DOOM and has the questing system similar to RAGE and DIshonored. Go kill this guy to get this, free these prisoners, etc. etc. It really has a good system for its time which is basically: E to interact, read dialogue, choose what to say, accept quest and BOOM youre on your way to your quest. Yes, it was overshadowed by other classics that year but this game has aged well and is even a little remastered. As of now, buy it. Dont even question this purchase because if you are a old school fps player, this MUST be in your collection.  Performance wise, I cant run 60fps and controller works solid. Sure it will get patched though!",
            "review_score": "1"
        },
        {
            "review_text": "What year is this?!?! Why am I playing Strife in 2015?! Answer: because it is the best FPS game I've ever played, easily topping classics like Quake and Doom.  After a comet struck the Earth, a virus spread and those infected not only presented horrible mutations, but also started hearing the voice of a malignant god in their head. They established 'The Order' that took the power and oppressed and enslaved those which were not infected. Of course, that's where you come: you play as a newcomer member of The Resistance, seeking to overthrow the Order and its wickedness.  The game is your classic FPS with some basic RPG elements. You have a main city where you can peacefully shop for supplies, you have a bunch of quests and some decisions that will fork the final outcome of your efforts. MANY secret doors and stashes, hidden rooms and optional sections of maps that you'd explore just because. You lack of a character sheet, skills and the likes, but you will improve your Health and Accuracy along the game, that being the closest to 'level up system' you'll find in there. Just like in FPS games, you have a great variety of weapons, but in Strife, THEY ARE DIFFERENT far beyond the 'damage' factor, and you'll find yourself resorting to your first crossbow every now and then even at the end of the game.  The achievements are fun and natural, just encouraging the player to explore more the scenario and teasing with its highest difficulty: Bloodbath. You think you're good just until the enemies start respawning quicker than you can kill them. And THAT'S when you run out of ammo.   Linux port is flawless (thanks for supporting the Penguin!)  The whole concept is so great and well executed, the voice acting is SO GOOD (gotta love Blackbird! The Governor was also very well executed) I just can't stop asking myself 'What year was this game developed again?!?!' This is definitely a winner, NOT your 'retro indie' game. This is a true classic, resurrected here in Steam. I'll recommend this over and over and over!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. This professionally made port is truly a masterpiece. I'll just list what you get: 1. Original game data. Untouched. 2. VE game data in the same familiar WAD format. 3. Some bonus content: a PDF manual, town map and field guide, all in HD. 4. Not less important, (nearly) full source code! 5. Hours and hours of well-spent time.  Get it. &gt;10000 hours in Doom, tellin' ya.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most under rated, under appreciated, and unknown games of the 90's that you will be glad you play. Strife was so far ahead of it's time that it laid the framework for games like Deus Ex, Elders Scrolls, and Fallout. Up until this game, every FPS was a shooting gallery. Strife was the first FPS RPG ever. It was such a crucial part of the evolution of FPS games that it deserves to be alongside greats like Doom, Duke Nukem 3D, Quake, Deus Ex, and Half Life.  In Strife you get to choose your dialogue, and as such, choose your adventure.  Strife is one of the best FPS games of all time and shouldn't be missed by any fan of 90's FPS or anyone who likes RPG's. If you want an in depth story similar to that of Deus Ex, mixed with Doom style action sequences then this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Very good port of the original Strife, running on a new source port that adds in some pretty nice graphics with modern controls and great Windows 7 support. However there is a problem with it not allowing raw mouse input, making the mouse horrendous to use unless you can figure out how to set it up right. However this is being fixed in a future patch so you can possibly hold out until then if this is a breaker. Unless you're alright with the original controls, then go ahead.  Long overdue edit: It's fine now. You can use raw mouse input now. It's all good. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "  Had this game kindly gifted to me from a viewer and what can I say... Wow! I had a blast and beat it on stream in a single sitting. I'm a big fan and player of Doom and this game is like Doom (same engine) except it's also unique as well. It's not just 'another Doom clone'. It has RPG elements, is voice-acted too and the weapons are cool and fun. Plus it has a story and multiple endings!  I'd definitely recommend this for people who love doom, or doom clones, or any old-school shooters. Heck, even just old-school gamers should give it shot. Hell, I'd say everyone should play it! :P",
            "review_score": "1"
        },
        {
            "review_text": "Strife: Quest for the Sigil was released in 1996 just before Quake. As the Quake Engine rendered the Doom Engine wholly obselete, Strife was considered unappreciated. Except one thing to keep in mind: It was unappreciated for a REASON. The story kinda feels wierd and tacked on if you are unfamiliar. The stealth concepts are dated and strange. The two paths normally consist of 'Go on' and 'Bye!'. But that doesn't mean you can't get used to them. As you get familiar with this game it will definitely grow on you. But you may want to get it on sale, just in case...",
            "review_score": "1"
        },
        {
            "review_text": "Stop waving your ID in my face and go in.",
            "review_score": "1"
        },
        {
            "review_text": "this game needs co-op!",
            "review_score": "1"
        },
        {
            "review_text": "Best chalicestealing-simulator ever 11/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely incredible! Thanks to this improved edition a game that is basically running on the ORIGINAL Doom engine looks and plays brilliantly.  There is a huge amount of gameplay and great locations in the game, as well as some great decisions to make along the way.  I really can't recommend this enough!",
            "review_score": "1"
        },
        {
            "review_text": "This game is harder then my ♥♥♥♥ on a sunday night. This is the one game that makes me wanna beat my self off to death cause of how good it is and how i feel that i've been cheated out of a good gaming experience this few years. I whole heartedly recommend this game but bewary you will lose your anal virginity and your ♥♥♥♥ may get bigger then my if used properly. Also smack your ♥♥♥♥ at the computer screen that helps with everything",
            "review_score": "1"
        },
        {
            "review_text": "New version of Strife is very good, the story is interesting and gameplay too. Tons of action and one traitor - you will be surprised.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it because I never finished the original. The RPG part is kind of over stated- it's just a health/accuracy increase after each mission (more or less) and an ammo capacity upgrade if you have gold. Has voiced characters and an actual story which is something different for Doom style games.  There are a couple of engine limitations such as aiming vs. actual trajectory when trying to shoot at things close and high above and player hitbox is seemingly huge when explosions occur.  Some levels are a bit of a drag (i.e. the sewers...) and with only the occasional quest marker it can be a lengthy exercise to finish a level.  Ammo is scarce mid level which forces you to think about how to use weapons effectively. With a fun story and fairly unique levels, Strife manages to be an enjoyable look back at gaming in the early 90's.",
            "review_score": "1"
        },
        {
            "review_text": "cloud saves could work better especially between win/linux.",
            "review_score": "1"
        },
        {
            "review_text": "First shooter I ever saw with multiple endings.",
            "review_score": "1"
        },
        {
            "review_text": "A true gem this one.  Back in the days my first FPS with steath and RPG elements.  Everybody knows Doom and not many people knows his game based on the doom engine.  So nice we can play it again on steam :-)  ",
            "review_score": "1"
        },
        {
            "review_text": "When I was little, I played every action game I could get my hands on. However, there was one particular game that always stuck with me: Strife. The last commercial release to use the Doom engine, Strife mystified me with gameplay elements I had personally never seen before. Before Strife, everything had been a boomfest: Kiloblaster. Death Rally. Realms of Chaos. Doom, Heretic, Quake. All action, no ♥♥♥♥♥♥♥t. Not that that was ever a bad thing. Where doom set a space marine against demon hordes and Quake against lovecraftian horrors, Strife took a different route, blending a medieval world of tunics, crossbows and stone castles with an invading dark future of computers, killer cyborgs and energy rifles. You are a mercenary, just arrived to the small town of Tarnhill, caught in a struggle for power between the oppressive, fanatical Order and the resistance fighters of the Front- a recipe for violence, and to be sure, Strife does not shirk on big, tough fights against multiple foes, with the fast player movement and diverse range of weapons you'd expect from a 90s FPS. But Strife also had something different from other id tech games: Dialogue. It had characters with full voice-acting, a story of betrayal and ancient conspiracy, a sultry-voiced lady with a radio guiding you on your way, a hub-level system that let you revisit previous areas (I didn't play Hexen until years after the fact), hand-drawn portraits and cutscenes, an inventory system a la Heretic, shops, two branching story routes and three endings, and even a rudimentary leveling system. I did not know it at the time, and even then, I had only played the demo, but Strife was the beginning of a lifelong love of the FPS/RPG hybrid. It may have been the first RPG I ever played period- or least the first one I enjoyed (I'm looking at you, Lands of Lore.) Sadly, the studio that created Strife closed, the source code was lost, and game was entirely out of print for almost 20 years, an unjust fate for such a gem. However, late in 2014, this 'Veteran' edition of the game was released, and at last I was given a chance to experience Strife as it had been intended, and with yet more to offer. I would call this version the definitive edition- not only is the original game restored in its entirety, but the demo version is included as a seperate episode (with deferring dialogue and character placement from the final version), the multiplayer mode cut from the original release has been included, and there is an entire extra secret level, designed by a guy who created one of the reverse-engineered source ports and was instrumental in the release of this version. Also present are three 'talisman' items, cut from the original release, that if gathered grant the player beserker power comparable to the powerup in Doom, turning your feeble punch-dagger into a weapon capable of destroying Inquisitors, a rare, powerful enemy that serves as a miniboss, in one or two punches. Also mercifully included are objective indicators on your map, which will certainly be a mercy to any first-time Strife players, as some of the later areas of the game are as convuluted as any Doom level. If you ever thought Doom and its derivitves were lacking a certain something, that maybe you wanted a more cinematic exprience but with that same fast, frenetic combat, then Strife might be what you're looking for. Just remember... Trust No One.",
            "review_score": "1"
        },
        {
            "review_text": "HOLY ♥♥♥♥! this is the doom engine  I'm a huge fan of doom and this game dispite it's age still amazes me streaching what that engine can do  and the positives -free roam -doom engine (fun) -so far the storys good -not some ♥♥♥♥ dosbox port   this being a game from the 90's it's aged like a fine wine but this wine has a handful of creamy modenaztion ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome fps that somehow went under the radar back in the day, but still a great game, especially with a little help of tweaking and a few small updates.",
            "review_score": "1"
        },
        {
            "review_text": "WELL I tried to get this game to work WIN 7 but only got audio had to reboot every time still nothing ,shame because i like vintage games. i then appied for a refund, hope you have better luck than i did ...",
            "review_score": "-1"
        },
        {
            "review_text": "went into my 'crap' catagory.",
            "review_score": "-1"
        }
    ]
}