{
    "app_id": 3170,
    "name": "King's Bounty: Armored Princess",
    "release_date": "2009-11-19",
    "developer": [
        "Katauri Interactive"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Turn-Based Strategy",
        "Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 482,
    "negative_ratings": 53,
    "price": 7.99,
    "description": "King's Bounty: Armored Princess is a sequel to the critically acclaimed King’s Bounty: The Legend.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3170/header.jpg?t=1553189712",
    "minimum_requirements": "OS: Windows XP/Vista Processor: 2.6GHz Memory: 1GB Graphics: nVidia GeForce 6600 with 128 MB or equivalent ATI Hard Drive: 5.5 GB of free space Sound: DirectX-compatible soundcard",
    "recommended_requirements": "OS: Windows XP/Vista  Processor: 3 GHz Memory: 2 GB Graphics: nVidia GeForce 7950GT with 512 MB or equivalent ATI Hard Drive: 5.5 GB of free space Sound: DirectX-compatible soundcard",
    "reviews": [
        {
            "review_text": "DON´T BUY THIS GAME!!!  The official Expansion 'Crossworlds' has the original 'Armored Princess' Campaign plus extras (new Skills, Magic, Units,...) in the original campaign. Plus 2 new Campaigns and other things.  And that for the same price...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is really quite charming-- cute colorful graphics, nice animations-- but also fairly challenging. It's turn-based combat, more like Civ than any RPG. You can run five creatures at any time; you'll have your favorites, but as you have to buy replacements and the supply varies by region, you'll end up trying quite a few different fighters. (It might be overwhelming if you had to learn them all at once, but you get introduced to them region by region.) It's very satisfying to win a battle with no losses.   King's Bounty seems to be largely remaking the game every couple of years... the next game, Warriors of the North, is very very similar to this one. Given that, might as well go with Amelie who is more fun than the barbarian hero of the other game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game... a little to linier for my tastes though.... but its basicly heroes of might and magic like... only without castles, and only one hero... so hero of might and magic.... i take that back you can pick one or the other... so hero of might OR magic",
            "review_score": "1"
        },
        {
            "review_text": "Not a fan of this one, unfortunately. Perhaps it's the steepness of difficulty when you begin (especially as a mage) and the uselessness of your travel companion (you can only have one at a time). The pet dragon is ok, but the cost of rage for abilities against how effective they are in battle just doesn't add up. Overall, I found it unrewarding and unenjoyable. *",
            "review_score": "-1"
        },
        {
            "review_text": "A fun, fantastic blend of Heroes of Might and Magic spliced with Warcraft designs in some areas. Yet, this game will continue to surprise you as you find yourself enjoyingly sinking time into this wonderfully crafted story. This is well worth the money; I've been very impressed. My husband has also bought the game and has already been glued to it. A good game indeed!",
            "review_score": "1"
        },
        {
            "review_text": "Heroes Of Might And Magic, except more mental. And with a pet dragon.",
            "review_score": "1"
        },
        {
            "review_text": "IT'S LIKE AN EASY VERSION OF MIGHT AND MAGIC WITH ALMOST NAKED CHICKS",
            "review_score": "1"
        },
        {
            "review_text": "The King's Bounty series is a totally addictive mix of strategy and tactics with resource management thrown in. The Crossworlds expansion takes a long time to finish and is excellent value for money. The game is challenging throughout. Some battles seem impossible until you figure out the optimal approach. Definitely not for gaming wimps!",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly underrated game. I remember playing it back in the day, came up again during a bundle purchase. Do yourself a favour and play the series.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS NOT ABOUT GAMEPLAY. There needs to be a patch for windows 10. The game will not save. I've tried compatibily modes of XP through 7 and nothing worked. I'm trying to reinstall (for the 3rd time) and this time I'll change compatibility before running it the first time, we'll see if that works.  Until a patch comes out, I have to rate this poorly.",
            "review_score": "-1"
        },
        {
            "review_text": "The King's Bounty series is a series that fell under the radar but deserves some attention. It's a well-balanced series that is extremely fun and addicting, offering a blend of strategy and RPG that just falls together really well. If you like Heroes of Might and Magic III and you enjoy RPGs, you are very likely to enjoy this game. It falls in the category of games that are very niche but is quite beloved by those who are the target audience.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. One of the most underrated I have found. This game can be had in huge chunks or nibbles of time. The strategy/rpg mix is perfect for my tastes.",
            "review_score": "1"
        },
        {
            "review_text": "Great series. Must have if you like Strategy RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "It would be a VERY good game if not for the loading screen bug, it's just irritating as hell, and there is no fix since 2010? Are you f*cking serious? I loved Legend and I would love this one too if not for this IRRITATING BUG!",
            "review_score": "-1"
        },
        {
            "review_text": "The King's Bounty series is, in every way, a clone of the Heroes of Might and Magic line. Expect the same sort of gameplay, though the King's Bounty series is somewhat mechanistically inferior. Frankly, you'd be better off just sticking with the Heroes Series.",
            "review_score": "-1"
        },
        {
            "review_text": "A Great Single player game for fans of the Heroes of Might and Magic series.",
            "review_score": "1"
        },
        {
            "review_text": "The first good thing about this game is that, its so enjoyable to watch,  The music is great, never gets old. and the superb flawless performance in graphics(plays so well on older computer).  So the second good thing is that, You only need your mouse to play and controll everything.  Was looking for this combine in games like WoW, but guessing it will never happens.   Overall, A good and cozy game to watch, story is great i think,. And You controll it all, by just moving the mouse only.  10/10  Gonna purchase the story after Armored Princess for sure  ",
            "review_score": "1"
        },
        {
            "review_text": "the hours just kept adding up. I had to explore and conquer every inch. and when the ***** grew wings, wow! I love this series, probably more than Heroes of Might and Magic because they continue in an evolution of the gameplay, not movingit to new developres who do not understand what made it addictive",
            "review_score": "1"
        },
        {
            "review_text": "Amazing and fun, if you like turn based strategy, which I do, this is one of the best",
            "review_score": "1"
        },
        {
            "review_text": "Sigh.. I just can't quit you...  KBAP, otherwise known as, KBAP, is the long long overdue sequel to King's Bounty, and the predecessor for the Hero's line of games. I don't really feel like getting into depth here, so let's do a TLDR version.  Good, Constant challenge, fun 'mini' game of kiting strong enemies when exploring in order to get access to powerful stuff early on. Ways to cheese the early game if you are patient enough by grinding spells/rage use in the easier battles. Just overall a great meta game, no play through feels the same, since all the gear and available armies to recruit are randomized. You learn to work with what you got, or get pummeled. Or just restart. 3 different ways to play, so it seems. Mages sure to kill all the way up to the late game, then spell damage just won't keep up. Though it's still possible to dominate, you just need to focus more on status magic and summons first. Fighter is easy mode, except when facing bosses. Pally, I dunno, end game was just a weaker fighter. Seriously, that resurrection focus blows because the best troupes can't be resurrected, the spell may not even appear in game, and uses SO much mana.  Is this a proper game review? Probably not. Anyway, it's super addictive, goes on about ten hours longer than it should, and has quite a lot of depth to it. I was 200+ hours in and still learning stuff about the game mechanics. A must by for strategy buffs.   heh, forgot the cons: randomized game elements can Eff up a 30 hour game or so, and the mid game is hell, for around 5 fights or so.",
            "review_score": "1"
        }
    ]
}