{
    "app_id": 317250,
    "name": "Airscape - The Fall of Gravity",
    "release_date": "2015-08-11",
    "developer": [
        "Cross-Product"
    ],
    "publisher": [
        "EQGames"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Difficult",
        "Platformer"
    ],
    "achievements": 23,
    "positive_ratings": 2006,
    "negative_ratings": 425,
    "price": 1.59,
    "description": "Airscape is a fast-paced, ultra-challenging 60 level action platformer. You play a deep-sea octopus, kidnapped by a mechanical alien race. Jump, dodge, and swim through a skybound environment full of floating islands, water formations, and robotic terrors.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/317250/header.jpg?t=1513223397",
    "minimum_requirements": "Minimalne: System operacyjny: Windows XP, Vista, 7, 8, 10 Procesor: 1.4GHz processor or faster Pamięć: 2 GB RAM Karta graficzna: Integrated graphics should be fine Miejsce na dysku: 500 MB dostępnej przestrzeni",
    "recommended_requirements": "Zalecane: System operacyjny: Windows XP, Vista, 7, 8, 10 Procesor: 1.4GHz processor or faster Pamięć: 4 GB RAM Karta graficzna: NVIDIA or AMD dedicated graphics with 1GB VRAM Miejsce na dysku: 500 MB dostępnej przestrzeni",
    "reviews": [
        {
            "review_text": "Airscape is a playful gravity platformer that feels like an essential buy to any fan of challenging platformers, and is a joy both to play and watch.  A demo for Linux, Windows and Mac can be found  here .  The story starts when you and your group of octopuses are suddenly abducted from your peaceful home inside a water-filled asteroid. You're all lifted up through the sky by a massive tractor beam, but you alone happen to fall off and come crashing down on an unfamiliar planet. Dazed and confused, you have but one thought; to reunite with your friends.  Through the first few levels, Airscape is relatively standard platformer fare. You can walk, jump and run, and you have to avoid minor obstacles, like pits and moving enemies. In each level, you'll find a small amount of sea critters held captive in orbs, and your objective is to rescue as many as possible of these and make it to the goal pad. Some of these sea critters are timed challenges, and if you can't make it to them in time, a spacecraft will arrive to take them away. Their locations will still be marked though, so if you see an empty dotted circle, you'll know what you have to do.  After making it through the first zone, the space map opens up, and you'll see the next zone of levels, as well as a fortified containment level. From now on you're free to zip through space and select levels as you wish. There are four containment levels in total, and for every one of them you beat, you open up a few more zones on the map, until you've unlocked all 15 and the final boss. Here's where you also get a bit more freedom of choice: Each containment level holds one of your octopus kin captive, and when you release an octopus, it's added to your lineup to choose from at the start of each subsequent level. The different octopuses have their own unique skills, which facilitate different play styles, and it's likely that you'll find a favorite among them. Some can't run, but compensate for their lack of speed through other means. One octopus can slow down time in its near vicinity, and is thus a good choice for when things start getting hectic. There is also a teleporting octopus, which has the ability to zap straight past certain obstacles. It requires a bit of precision though, since it's easy to smash straight into the ground or an enemy, but this octopus seems like a good option once you start learning the ropes.  The way gravity works is that there's a pull perpendicular to whichever surface you're closest to. In effect this means that if you're going uphill, the surface will tilt towards you to keep you on a level plane, and if a jump brings you closer to the ground above you, you'll flip around and fall towards that surface. In water, there's no concept of gravity, and you're free to move whichever way you want. There are hotkeys to adjust the screen rotation rate while playing, so it's easy to adjust rotation to a level you find comfortable.  One of the game's main strengths, in my opinion, is that there's a ton of variation; not just in enemy types and obstacles, but also in game mechanics and design. The gravity mechanics enable a level design where the ground not only is functional, but also has a curved and visually appealing topography. There are both low and no gravity levels, and even a level with alternating gravity. Enemies range from robotic tanks and aggressive UFOs to sniper rifles, homing missiles, huge showers of meteors, and a bunch more.  Each zone have their own orchestral musical themes. I'm especially fond of Eclipse, which has sort of a gothic rock opera feel to it. At least that's what I'm imagining it to be, though I don't have anything to compare it with for reference. You'll find the soundtrack on  Bandcamp  [samulis.bandcamp.com] , where you can give it a free listen before deciding to pay-what-you-want for high-quality downloads. The visuals are colorful and clean, and though there isn't a ton of variation in textures, there's an attention to detail that makes the world feel alive. Like the leaves and cotton balls floating around in the foreground, and plants jiggling a bit when you walk past them. There are also some subtle changes in the expressions of the octopus protagonists, like when their eyes bulge slightly when an enemy is near. Another thing that I found adorable is how when you rescue sea animals, they bob about in a trail behind you throughout the rest of the level.  It took me slightly less than 12 hours to rescue enough sea critters to unlock the boss encounter and get through the game. That time also includes finding and completing two hidden levels and well over 2000 deaths and retries. There are more than enough sea creatures to rescue to complete the game, and since difficulty varies between levels and your choice of octopus and player skill, you might find that you'll get through the game faster. The hidden levels can be unlocked by finding a hidden exit in some of the levels, and levels with such exits are marked on the map once you've rescued every animal in them.  The game can be played with either a keyboard or a gamepad, and though I prefer keyboard controls, my wired Xbox 360 controller works well both in menus and in-game. Most input buttons can be remapped, and in addition to movement and screen rotation, there's also an input to quickly restart from the last checkpoint. There are a few graphical settings that can be tweaked, but I had no problems running the game at a stable 60FPS on my laptop with Linux Mint 17 KDE and GeForce GT 630M. I did eventually decide to turn a few settings to low, but only because the back- and foreground effects started to give me a hint of motion sickness. By default, the game will try to adjust settings to give you a stable performance, but this can be turned off if you prefer to tune things manually. There's also a timer that can be turned on and will be displayed in the upper left corner, which should be handy for speedrunners.  Airscape is unlike anything I've played, and though it looks like a Super Mario Galaxy in 2D, you should expect something closer to  Super Meat Boy  or  Dustforce DX  in terms of difficulty. The game has a fair share of checkpoints though, so less experienced players should still be able to get through it with some persistence. I finished the game a week ago, but I'm far from done with it, and have been picking it up for a bit every day since to try to rescue more sea creatures and uncover more secrets.   NOTE:  This review was originally published on  GamingOnLinux  [www.gamingonlinux.com] .",
            "review_score": "1"
        },
        {
            "review_text": "Beneath the cute visuals of  Super Calamari Boy Airscape lies a hard-as-nails platformer (the credits helpfully informed me I died 1663 times in the course of completing it) with interesting level design and a solid amount of diverse content, and it's definitely worth checking out.  You play as one of five octopi (unlocked through the course of the game), each with a special ability of sorts (one's faster, one's floatier, one can slow time, one can teleport a short distance, and Red... doesn't seem to do anything, as far as I can tell), fighting a mysterious mechanical menace to rescue sea critters. There are usually two or three critters per level, some in convenient locations and some out of the way or requiring a mad dash through the level to reach in time, and unlocks are based on these, which gives a good deal of freedom to pick your levels and avoid some particularly nefarious ones if you so choose (full disclosure: the levels featuring maneuvering in water almost made me give up on it early, but I'm quite glad I stuck it out).  As the title might indicate, there are some gravitational shenanigans involved - the levels usually take place on essentially tiny planetoids, and the direction that is 'down' will often shift several times over the course of a level (and as many levels have curved ground, often without even thinking about it). It's all part of the level itself, though - the controls are pretty elegantly minimal (up/right/left/shift-for-special-ability). This leaves the levels themselves to hold most of the complexity and they do that well - there are 15 areas in the main game, each with their own style and features, and you end up winding your way through an impressive array of platforms, lasers, cannons, robots, water, acid, homing missiles, mines, and of course the final boss, a force too menacing to be described.  It's a great game. If you're looking for a platformer that's reasonably challenging - but not unreasonably challenging - look no further.  (Side note: I got the 'complete the game in under an hour' achievement despite my playtime on the save file being around five hours, so don't be put off by that - it's probably summing the actual level completion times.)",
            "review_score": "1"
        },
        {
            "review_text": "Quite enjoyable. Seems straight forward at first but theres more depth and complexity here than what I was expecting. Great job!",
            "review_score": "1"
        },
        {
            "review_text": "Airscape - The Fall of Gravity is a   fast-paced, challenging action platformer  . You play as an octopus, who got kidnapped by a mechanical alien race. You need to jump, dodge to complete levels. It gets challenging later on.    Pros",
            "review_score": "1"
        },
        {
            "review_text": "Starting zone 3 this game gets insanely hard. Got it dirt cheap, enjoyed a bit, collected cards, fine with me. I'd like to tell the devs - if you think people would enjoy dying 2500 times to complete a game, you are quite wrong.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game. Cute and unique art style, catchy soundtrack, addictive and fun. But be prepared for a major challenge - you will die and/or rage quit many times.",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  Airscape Review: 20 Minutes of Game&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "  Its a Fun Game to burn time.",
            "review_score": "1"
        },
        {
            "review_text": "Holy crap. This game has so much content for $0.19. It's challenging, fun, and very cheap. Get it!",
            "review_score": "1"
        },
        {
            "review_text": "When a wonderful platformer like this goes unnoticed, it's a crime. For only $0.19 I got a game that is arguably on par if not better than Fez or the hundreds of other platformers out there. Its beautiful, the music is great, and the difficulty curve is perfect.  12/10, would ink again.",
            "review_score": "1"
        },
        {
            "review_text": "For 19 cents its a good game. Selling to steam trading cards is gonna make me more than 19 cents so it's a pretty chill deal.",
            "review_score": "1"
        },
        {
            "review_text": "  Fun casual platformer with relatively tight controls. Enjoyed it so far, haven't paid much attention to any story. If you're looking a quick platformer to jump into that's easier than Super Meat Boy, but harder than Limbo(minus any real inclusion of puzzles), this is a solid option.",
            "review_score": "1"
        },
        {
            "review_text": "I know the creater who made this game so ill say 10/10 because i want him to succeed *sorry for spelling",
            "review_score": "1"
        },
        {
            "review_text": "I love this game its soo good and its awesome its was made with construct 2 I started to learn how to use the free version right now I hope 1 day I can make a awesome game like this,",
            "review_score": "1"
        },
        {
            "review_text": "This is a lot of fun. It has a super mario galaxy feel, like it says, but its just a fun version. Same way I enjoy galaxy, I really enjoy the small amount of time I had with this. I cant wait to play more",
            "review_score": "1"
        },
        {
            "review_text": "Cool game, Bought it because it was on sale, worth it",
            "review_score": "1"
        },
        {
            "review_text": "This game has a lot of really good potential, like, a lot of it, but, I can barely play it, since this game gives me terrible motion sickness, the controlls need some serious work too. For 19 cents, you could do worse, just be careful, as this game swings the camera around like a flail...",
            "review_score": "1"
        },
        {
            "review_text": "I got it when it was on slae for 19 cents and that was the best 19 cents I have spent!! :D",
            "review_score": "1"
        },
        {
            "review_text": "Way to go for platfrotmers, Nice graphics and well used mechanics, perfect game.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played this game long, However I must get all squishies and I just can't stop playing. Very good for casual pick up put down gameplay",
            "review_score": "1"
        },
        {
            "review_text": "  Fun game with good graphics, overall a good game. Only negative is the screen rotation; makes you sorf of dizzy and the controls become awkward and annoying at times",
            "review_score": "1"
        },
        {
            "review_text": "Simple enough my 10 year old son can play challenging enough I find myself having flash back of the old Mario day. 'I jumped D@mn it. How in the hell does that thing keep killing me? hlvkjcgvkjvcckj kjplvyhkjlgv ljkviytfuiuvov.  ",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to enjoy this game.  Levels quickly ramp up in difficulty. Camera is zoomed in close on most levels so it was frustrating to know where to go (if there was way to zoom out, I couldn't figure it out). Throw in a large amounts of overlapping, player killing obstacles that the only way to learn the path through is to die, die, and die again while struggling with controls that feel sloppy. With progress being stopped cold a number of times, while trying to get past a hazard choke point 50+ times, I lost interest in continuing.  To sum up, it's not an easy game, and it isn't really any fun.",
            "review_score": "-1"
        },
        {
            "review_text": "A beautiful game with an interesting (albeit dizziness-inducing) concept and nice music. Not worth buying at full price, IMO.  The game's main problem is its high difficulty, which cannot be adjusted. I already prefer to play many (mainstream) games on hard mode, but in Airscape I sometimes have to attempt the same little part of the game dozens of times before I get through. Reaching the Blue Octopus at the end of Zone 5 was nearly impossible (I surely died over 100 times) and now I'm stuck on the next level afterward. Casual gamers, stay well away! As for me, I'm getting frustrated and am inclined to quit.  Nits: In my opinion, the camera is often zoomed in too far (not just in gameplay but also on the 'world map'). There should be a key or option to zoom out. Regarding the controls, my instinct is to use 'Up' to swim up but 'Space' to jump, and I'm not allowed to have it both ways. Also, it is strange that I can use W-A-S-D to move around on the world map but only the arrow keys work inside a level. Occasionally one encounters bugs (e.g. getting stuck in an object). Finally, occasionally I mistake background objects for foreground objects and vice versa.",
            "review_score": "-1"
        },
        {
            "review_text": "the gravicty mechnic is nice, but not much more. it's only jump &amp; run and no other fun mechanic. i think there are much better jump &amp; runs out there.",
            "review_score": "-1"
        },
        {
            "review_text": "Cute idea and cute graphics to match. The game has a neat feature where it will reduce the resolution in order to increase the FPS, so that gameplay can flow more easily. Sadly, this function works whether you want it to or not, and when put at a lower resolution the game is flat-out not attractive (particularly annoying since the graphics are simple, so it's an issue with programming). It left me with a game where ithe graphics were messed up enough that I couldn't really tell what was happening.   There's also no story. Some big drill hits the starting area and sucks everyone away, and then you get a 'some time later' thing that pops up and your avatar is on land with a helmet on. What happened? Maybe it's explained later, but I wouldn't be able to get that far with the graphics looking so bad.",
            "review_score": "-1"
        }
    ]
}