{
    "app_id": 317300,
    "name": "Roommates",
    "release_date": "2014-10-15",
    "developer": [
        "Winter Wolves"
    ],
    "publisher": [
        "Winter Wolves"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Visual Novel",
        "Dating Sim",
        "Anime"
    ],
    "achievements": 16,
    "positive_ratings": 135,
    "negative_ratings": 50,
    "price": 18.99,
    "description": "Welcome to the halls of Latin House! Either way, you're invited along with either Max or Anne as they make their way through the first year of their college experience. They'll share their dorm life with four other tenants as they pick their class load, pick their jobs, and maybe even pick someone to have a little extra curricular fun...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/317300/header.jpg?t=1552029793",
    "minimum_requirements": "OS: Windows XP Processor: 1Ghz Memory: 512 MB RAM Storage: 50 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Ok so here goes nothing. I bought this game mostly for some fun and nothing serious, but holy ♥♥♥♥ this game is actually good. So where to start, When i first started playing it i wasent taking choices serious but after a while u realize that the choices actually matter. There is also alot of choices which makes it feel like its your journey . I got drawn into the story and really enjoyed it. Another plus is that there are some funny jokes here and there. Ive gotten every ending with both of the characters and i love all the endings. I just hope another game like Roommates comes out.  I would say this game is a 9/10 if u like visual novels and dating sims.",
            "review_score": "1"
        },
        {
            "review_text": "Okay.... I've played this a bit. It's an okay game. It's nothing spectacular or awesome, in my opinion. Perhaps it's just me, but it feels a bit 'shallow' and the characters seem a bit flat too. I didn't see that I have to click on 'Stat' at first to see what kind of requirements each person has, so the first playthrough I just ended up alone :P It also feels a bit strange to not have a first-person view of things... One more gripe I have is that the 'Play Event' option was not clear! Sometimes it did the opposite of what I would expect. I would not recommend this game at the original price. Wait for a sale (I got it through Humble Bundle). It generally left something to be desired.",
            "review_score": "-1"
        },
        {
            "review_text": "So, 4 hours in, and I'm struggling to get my AnneXSally ending only to find out Anne can't get with Sally, which SUCKS. 4 hours wasted.  HOWEVER, It's not ♥♥♥♥, so I'll write a real review.   Pros: Well designed storyline, and a funny storyline at times.  Skills are able to be earned faster the more you do them. You get to manage your time like an actual college kid with infinite motivation.  Cons: Anne cannot date Sally. In a game where you have a stat page for all 5 of the characters, it doesn't plainly let you know NO, YOU CAN'T SHAG THIS ONE.  Car-Car is one of the best characters, and I'm super sad you can't date her.  Music is looped poorly, and there are a lot of points in the game where it's silent for no reason, and there are times where music meshes poorly.  You don't get a lot of interactions some weeks, which I guess is realistic, but c'mon, it's a dating sim where I can't date the hippy s the farm girl. I gues I expected too much.   I'm being overly critical. I have a bad taste in my mouth because I feel like I wasted 5 hoursd. Be that as it may, I still have to recommend this! Side note,  IZZY'S FACE LOOKS SO MANLY, AND HER ARMS ARE ALWAYS ABOVE HER HEAD, AND I DON'T KNOW WHY.",
            "review_score": "1"
        },
        {
            "review_text": "Another title and visual novel by WinterWolves. I love this game it gives you a real look and experience at to what College life can be. Especially if you haven't gone to college... yet. You take the role of either Max or Anne and can explore your sexuality and also discover things about yourself and the people you share a house with. It’s really fun, comical, and smart, the script for this game is very spot-on. I'd give it a try again if you love Visual Novels and Romance. Lol.",
            "review_score": "1"
        },
        {
            "review_text": "Great dating sim many choices and paths. Worth getting when its on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Roommates follows the wacky adventures of a college warband under one roof. You take the roll of either Max, or Anne catering their entire semester experience to what you see fit. Max takes the roll of the rocker scumbag who couldn't give a ♥♥♥♥ about how he performs in his classes. He self indulges in psychoactive drugs to pass his down time while sleeping with his guitar. Anne is the typical bookworm nerdy type, almost never leaving her room so she can read her kawaii desu fan fiction. Upon start of the game you become indoctrinated into your first college warband in preperation for the X games.   Stare into the dark abyss known as Dominc, the supreme commander of the dorm, and all around ♥♥♥♥♥♥♥. His favorite past times include kicking dogs, MMO RPG's, and refusing to remove the stick in his anal cavity.  Soon after you meet Isabella, the not at all sexual innuendo laced character in the whole damn game. This expertly crafted character who wears very little clothing will slowly sneak right into your heart. She barely holds down her job at the campus coffee shop, because no matter what you order you'll get ♥♥♥♥ing candy.   And who could forget Sally, a devote follower to the Vegan lifestyle. Events around this character include: Discussing the benefits of eating that one cow Why Five Guys is a gift to all human kind Experimenting on baby rabbits is for the betterment of mankind Why am I still doing this  And the final boss, Rakesh. He is the right hand of darkness, and should be both feared and respected. You will be under his influence the moment you start the game. You will be convinced that every event played within the game should be catered to Rakesh. This is a noob trap. His end goals include getting you into an extremely erotic bunny suit, giving him a mayo sponge bath, and force feeding him paper. Rakesh is an evil in this game you must try to avoid at all costs  The game also includes many forgetable side characters such as Spinny Glasses guy, Roxanne the anti Anne character, kinda chubby girl who you can decide to bully if you so choose (If you do, you're kind of a ♥♥♥♥), and last but not least, Chad the hunk cake. He is the secret mini boss you must face if you decide to romance Isabella, and lets face it, you're all going to.  The core gameplay revolves around reading text while looking at still images in the background. The characters have a wide range of animation such as smiling, blushing, and opening and closing their mouth. If you're lucky you'll be treated with some amazing sound effects to go with the scenario. More gameplay mechanics include Lock Picking, Bunny Hopping, and an RPG inspired spreadsheet level up system. The game has three difficulties: Easy, Standard, and Nightmare. Upon extensive playtime, I have no idea what the difference between Easy and Normal is. Nightmare mode adds elements such as not being able to heal unless you drink a potion, and the only way to repair broken limbs is with a doctors bag, or visting a doctor.   The one major event in this game is Vladimir's gambit. You must complete some ridiculous class project with a chosen partner. You can either actually do the work, or betray your partner so you both get a guaranteed C. Vladimir will tempt you with promises of wealth and a seat of power. This is a trick, and you must give in to unlock the bonus artwork. The game will have one of two endings at this point: You and Anne will pass Vladimir's gambit, and you'll recieve the 'Not Bronze Anymore' lovers ending. The other ending has you sacrificing Anne to solidify your rise to power. Rakesh will enter at this point, stating there can be only two, a master and apprentice. This nets you the 'Whose Side Are You On?' achievement right as he slides the cerimonial dagger into your chest.  I would not recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Okay so, this is the most addicting and challenging experience I've had. I have not been able to stop playing for freaking DAYS. Needless to say; you a guy that likes cute girls? Girl that likes cute guys? Guy that likes cute guys? Girl that likes cute girls? It doesn't even matter cuz there's something for you. It keeps you invested because even after the fourth playthrough there are still things you haven't seen yet. Just be wary it's really easy to get into but a challenge to master... On. Easy. Mode. Then again I might just suck at stat building, but I don't even dare go to the higher difficulties because I can't even get enough stats on EASY to get the best endings! However I highly recommend this, it will keep you busy that I can promise.",
            "review_score": "1"
        },
        {
            "review_text": "great game loved it wish I could play it more but it took to long to play it once",
            "review_score": "1"
        },
        {
            "review_text": "This game is way more fun than it should be. The stats are honeslty challenging to raise as well, it took be a few playthroughs to do it right. I love the characters and the options. First time I did Anne x Domonic and I just finished Anne x Max.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to become a weeb. If you do, buy this dating sim. I have been living on the internet for 10 years now and i have to say isabella is my waifu and i love her deeply. my mum has said i should go to the doctors because i use to many tissues but i tell her 'I promise its only a cold ;)'. last night i tryed to marry isabella however she said my meme weren't good enough.",
            "review_score": "1"
        },
        {
            "review_text": "PROS: you get to experiance the life of a collage delinquant  it has homosexuality (if you like that)  good price  CONS: Bad art  Bad music  Bad character disighn  Horrid gameplay",
            "review_score": "-1"
        },
        {
            "review_text": "I love the weekly scheduling, and the characters are great.",
            "review_score": "1"
        },
        {
            "review_text": "Always love coming back and playing!",
            "review_score": "1"
        },
        {
            "review_text": "This is such a fun game that people should add more DLC characters you can date and have fun with thoe would be so hard o-o amazing fun game! worth playing",
            "review_score": "1"
        },
        {
            "review_text": "Lighthearted, funny, short, and not too complex once you figure out the weekly setup system. I replayed mutiple times trying to get the perfect ending. (Still barely missed but enjoyed every moment of it.)",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game becomes really easy once you realize what you're doing, but it's fun nevertheless. Every character is different and the fact that you can choose which gender you want to play as douples the amount of content.",
            "review_score": "1"
        }
    ]
}