{
    "app_id": 317410,
    "name": "Color Symphony",
    "release_date": "2014-09-15",
    "developer": [
        "REMIMORY"
    ],
    "publisher": [
        "REMIMORY"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Indie",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 960,
    "negative_ratings": 337,
    "price": 0.0,
    "description": "Color Symphony is a game program utilizing the human recognition ability and visual senses, and various colors are used to play the game by changing colors to disrupt the cognition or to strengthen the cognition. The player can control the enemy, eliminate obstacles or build new roads with different colors.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/317410/header.jpg?t=1516059290",
    "minimum_requirements": "OS: Windows XP Processor: 2.0 GHz or higher Memory: 512 MB RAM Graphics: DirectX 9.0c compatible video card with shader model 1.1 support DirectX: Version 9.0c Storage: 180 MB available space Sound Card: DirectX compatible sound card Additional Notes: Microsoft Xbox 360 Controller support",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This puzzle/platformer game looks more like a prototype in early development stage because of its graphics, sounds and music. (I actually liked the music itself but I don't think it's a really good choice for a game like this. And also, at some level, it can get a bit annoying to hear it over and over again.) Also, the controls are not very smooth. It gets frustrating to move the character sometimes.  Even though, I can not really say that it is aesthetically appealing and easy to use the controls, the game's mechanics design is interesting. You have to pick the right color, at the right time to make things appear/disappear. It can be a little bit tricky sometimes but it surely is brain teasing.  Worth giving it a try.  Pros - Free ;) - Nice game mechanics design  Cons - Everything visual - Everything audial - Slight usability issues",
            "review_score": "1"
        },
        {
            "review_text": "I honestly found this game just mind boggling. I find such platformers stressful as I get very determined. Saying that I raged quite due to terrible hitboxes. I wouldn't be standing anywhere near the dangerous object- yet get killed or loose health by it &gt;.&lt;  It's worth a try. Cool concept. Just dont exspect much my dears. :)",
            "review_score": "-1"
        },
        {
            "review_text": "I really don't like this game. At first, it's a little interesting, it talks about how you were betrayed by your friends,going back to get revenge, then it starts you on some tutorial levels, that basically show you that you can change the background by pressing z/x/c, and if the background matches the color of an object, the object disappears. For me, it just got worse from there. The double jump is much similar to if you had rocket boots - unlike most game where its the same height as the normal jump or less, this one is about 5 times bigger, and can kill you because you can reach off-screen areas with it (like spikes that you didn't know were there). The worst part for me was how if you get hurt in any way, there's about a 15 second long animation just for you getting back up, and its really bad, too, because you're flashing the entire time so it looks really chopped up. And when every other object can hurt you, it makes this game really boring. Another thing I found annoying was how bad the controls are. The controls in this game are insanely clunky, the color buttons can't be spammed the way they SHOULD BE, and the movement buttons just don't give you the feeling of truely being able to sontrol your character, which, imo, should be top priority in any platformer, because in platformers, death is very frustrating, but whats much, much more frustrating is when the player dies because the controls were poorly done. On top of that, this game fails to keep me interested. It gives you the same 5 problems over and over, just in a different order. Honestly, I'm really disappointed, this is the kind of game I would've expected from a Game Boy Color, not Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "harder then me when i watch anime   11/10",
            "review_score": "1"
        },
        {
            "review_text": "I want to like this game. It's an interesting idea playing with the different colors to reveal different aspects. I played this the day it came out and was having some issues with the mechanics but the concept had intrigued me enough and I enjoy the artwork enough to come back a few days later to try again and the mechanic issues I had are gone now thankfully. One thing that does stand out as a con, for me at least, is that grunting noise the character makes when he jumps, and he's always jumping but just doesn't seem to mesh stylistically with the rest of the game. It takes a little bit to get the buttons for each color down so you can correctly respond fast enough to deal with the current situtation so starting out can get frustrating until you get the colors down. Those are the only cons I see right now with the game, but like I said, I want to like this game. I just can't put my finger on why I can't say I like it though... might have to let this sit for a bit and revisit again.",
            "review_score": "-1"
        },
        {
            "review_text": "Very good game , requires some reflexes !!",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why so many people that giving this game thumb down than thumb up.  At least i can say they noob to play this puzzle things, so don't think to fault developer's map designer. But he/she want us to beat his own puzzle game!  Sekian :)",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a cool concept, but the controls can be unresponsive at times, and the amount of time the character is down after being hit is ridiculous. Still fun though, I'd give it a 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has potential to be a good game, but it lacks a visual markers in some places making it nearly impossible to estimate how high or far you've gone because the screen ends up a solid colour between colour swaps. Id suggest adding some black sawblades in these spots, so that players can keep their barings and not have to get frustrated. For a free game its pretty good and has the potential to be really good.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has the idea of changing the color of the background to get through and is not something i have seen before. Great game, especially since its free.",
            "review_score": "1"
        },
        {
            "review_text": "Okay yeah everyone knows it's a puzzle game.. It's fairly simple. I just don't get why it's mostly positive.. This is a easy game I must say but, at times it can get complex. (No this isn't why it's negative). There are a few problems with this. Pros: 1) Easy to play. 2) Easy to finish. 3) A simple game. Mids: 1) Not that creative. 2) Needs more complex levels. 3) Not much of a challenge. 4) Mildly fun to play. Cons: 1) Gameplay is main issue. 2) There is no story. 3) The point of the game is...? 4) I don't know why people like this. 5) Maybe add colors that don't seem bland. This is based somewhat on opinion but mostly on the gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game to play and abit challenging 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A platformer meets Simon. An interesting game that's almost criminally simple.",
            "review_score": "1"
        },
        {
            "review_text": "Very buggy. Trying to walk around the character would stutter. It was awful.",
            "review_score": "-1"
        },
        {
            "review_text": "good game, but the control worst i ever see it",
            "review_score": "1"
        },
        {
            "review_text": "Good god, this gets unforgiving quickly. I wish there was a variation to the music, as one song can get pretty stale after it loops the 20th time. I also wish they explained what button 'MAX!' was binded to so I didn't have to damage my character to get through a few puzzles.  I would recommend it, but the main character tips his hat every time he jumps, making this the most fedorable game I ever played. I rate this a potentially good anime turned into a flawed platformer out of 10 m'ladies.",
            "review_score": "-1"
        },
        {
            "review_text": "the jumping is incredibly floaty and it makes it practically unplayable",
            "review_score": "-1"
        },
        {
            "review_text": "Some good ideas, but later stages rely a lot on twitch reactions and leap of faith game play. Still it's free, so give it a try if you're interested. Just be prepared for some serious frustration later on.",
            "review_score": "-1"
        },
        {
            "review_text": "Very Good the colors and textures of the game are amazing",
            "review_score": "1"
        },
        {
            "review_text": "This game is a relatively simple platformer, with a twist. The twist is that you have to change the color of the screen to avoid obstacles and reveal some platforms. It's a neat concept; it's one I haven't seen before. The main issue I'm having is that this game can get repetitive rather quickly. It is, however, a good game to play when killing time before leaving for work or whatever.  7/10 would recommend, will likely play again",
            "review_score": "1"
        },
        {
            "review_text": "It's free for a reason...  This game just was boring. Not much else to say about it. It's a used concept turned into a free game that can only be described as--boring. You just hit Z X and C to change color, which affects which obstacles affect you. At the same time, you move very slowly and everything about it was just so boring I gave up and quit not because it was hard, but because I didn't want to play it.  Aside from that, it feels like a kongregate game in its one sound effect, two anim files, no sort of feeling of an actual character (press a to glide left slowly, press d to glide right slowly), really just an empty and incomplete game.  Also, the music is repetitive as hell and it didn't take long for me to want to turn it off and activate Steam Music beta in its place.  Overall, it's a big waste of time trying to play this game; the replay value comes from deleting the game and watching the little lines appear in a circle as a sign that the files are being deleted. It's quite fun to watch.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is extreamly hard i know games are suppose to be hard but this is like over the roof hard and i also found it boring i couldnt bear to play another second of it nice idea though however that idea had bad excution 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "Neat concept. Easy controls. Gameplay is a challenge. Artwork is nice. Story is almost interesting but still more of a story than any COD game. Recommend. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Too be honest, it's been a while senced i played a game, and i never know why. Until i played this:  I've been missing this sort of a challenge.  I love this game :)",
            "review_score": "1"
        },
        {
            "review_text": "Very Cool and Interesting, its different and seem adicting to play. I certainly kepped coming back to it.",
            "review_score": "1"
        },
        {
            "review_text": "I would like to recommend this game, the game is challenging which is goo...but i didn't finish the game due to some annoying feat that hinder me to continue...hint should be always turned on, &amp; just put the key tooltip at the bottom left of the screen which they put the color box indicator...hitbox can be better, and the momentum should be minimum, how come you can get off so far after hit by a bird?",
            "review_score": "-1"
        },
        {
            "review_text": "I am a puzzler by nature. I'm constantly trying to keep my brain sharp and this game is challenging in the most unique way imaginable! There are hidden obstacles and paths, revealed by simply changing the color of the background of the game (blue, green, or off-white) . It sounds easy, right? Admittedly, some stages are. Don't worry, they grow in difficulty. There are stages in which you must quickly alternate between colors in order to not get chomped up by a cerberus-esque monster, or pecked by crows...You must alternate to make a barrier disappear, jump, only to alternate again to make it re-appear so you can land on it to progress. I haven't yet finished the game, so I cannot attest to its length in comparison to other games.  It is a fantastic cognition-strengthening game and great at testing your reflexes!",
            "review_score": "1"
        },
        {
            "review_text": "I am no reviewer. However with my time playing the game i found it fun at first then tediously hurtful later on. It told a story every level through words you pass by. That is until they started moving it from every level to every other level then to every third level. The puzzles are definitely in variety. Although you will probably angery with some of the mechanics suddenly making you die a few times just to see where a certain color is. The issue is they require you to die or have incredible memory for a photonic few seconds. Otherwise its a lack luster game with little story depth.",
            "review_score": "-1"
        },
        {
            "review_text": "itd fun and chalnging just the way a platformer is suposed to be",
            "review_score": "1"
        },
        {
            "review_text": "Very Good Game And Very Challenging I Would Reccomend It For AnyBody.",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't even get past the first few platforms. Despite everything I tried I just could not move past a certain region, making me think the issue had more to do with an animation issue than a user error.",
            "review_score": "-1"
        },
        {
            "review_text": "YHAT GAME WAS REALY AWSEOM AND YOU JUST CNHANGING THE COLOUERS WHEN THE BIRD ATTAK TOU YOU YOU GOING TO CAHNGE THE COLOUER THATS GOOD",
            "review_score": "1"
        },
        {
            "review_text": "Its funn a bit confusing but its fun.",
            "review_score": "1"
        },
        {
            "review_text": "It's an okay game. It becomes frustrating quite quickly though, and I think the amount of time you have to wait when you get knocked down is too long. But it's free so can't complain really.",
            "review_score": "1"
        },
        {
            "review_text": "its pretty good, i like the idea of swithing the colours to remove enemies and find platforms.  i feel it just needs something more but for a free game for a few hours, why not. its one that makes you think without having to sit down and play it for ages.   a fairly simple flash game wth a interesting idea 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Interesting, good quality for a free to play. Whiles away a bit of time and presents a good challenge, love the premise of the changing colours. Some of the grammar in the narrative good do with a bit of a check, mind.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very interesting little platformer. I am quite enamoured with the color mechanic - so simple, but you quickly learn that there's a LOT you can do with only 3 colors. Requires some quick reactions and a little bit of planning, with new combinations and dilemas arriving at a good pace. Did I mention that this color mechanic is really neat? I would love to see more of it. I can see a game like this (color-based platforming) working really well on a DS. It would be mind blowing to be able to make your own levels, or to have a Portal2-esque co-op (colors split between players) - but those are far in the future. For now, this game is fun and refreshing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a total Time ♥♥♥♥ rip-off. Check the real game it is 10000 times better. It's by Edmund McMillen (the creator of the binding of isaac and super meat boy)",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 would rage quit again.",
            "review_score": "1"
        },
        {
            "review_text": "The concept is cool but the controls are floaty and the amount of time that the character needs to recover from getting hit is just horrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring, plain and simple.",
            "review_score": "-1"
        },
        {
            "review_text": "I played this game for my YouTube channel and its really good. Even though I suck ♥♥♥ at this game, it was still fun to play even when I was mad at myself for sucking. (My motor skills arent the best so thats why I sucked at this game, so I was pressing the wrong buttons. lol)",
            "review_score": "1"
        },
        {
            "review_text": "Sadly, I got very bored of this game very fast, and was immensely dissapointed, because I saw it on my friends laptop and it looked really good at the time. HOWEVER, for the 10 minutes I DID play it for, it was an interesting concept, and the story wasn't that bad. It wasn't fantastic,. but it wasn't terrible either. The Animation needs SERIOUS work. Some of the physics make no sense at all. Also, the soundtrack annoyed me. The constant guitar solo in the background really disrupted me. (by the way, dev, if you want some music made specifically for your game, PM me and I'll see what we can work out)  Overall, I'm not sure if I could reccomend it or not... I suppose I would because it DID interest me a lot initially, and hey, I'll probably go play it again some other time, and give it a second chance.",
            "review_score": "-1"
        },
        {
            "review_text": "I couldn't even play 10 minutes of this game, I got 5 minutes in hoping it would get less boring but it really doesn't. The whole color thing is a cool idea but it was poorly executed. The cliche and nonsensical plot is also another big flaw of this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is only fun for a few minutes, until i found some problems with the game. Although the game has a quick download.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is soooo interesting, that's what i can say...",
            "review_score": "1"
        },
        {
            "review_text": "This might have been interesting if the production values were higher than a high school project. I don't know how I acquired this, I hope I didn't pay more than a few cents for it. I wanted to stop playing after 2 minutes, but had to play for at least 5 in order to write this review. Buggy and boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game, hard, but fun. I DEFINITLEY reccomend this game  &gt;:D ",
            "review_score": "1"
        },
        {
            "review_text": "8/10",
            "review_score": "1"
        },
        {
            "review_text": "It looks like a draft, but the concept is good.",
            "review_score": "1"
        },
        {
            "review_text": "Color Symphony is a game where you make enemies and platforms appear and disappear simply by switching the background colour. It would be an otherwise simple game if it wasn't for the level design flaws that make it frustrating:   Many platforms and enemies are off-screen and can only be seen while mid-jump, which makes them even harder to find if they have the same colour as the background and can only be seen once the player switches colours; the scarce number of objects that act as reference points also have an impact on this.   Navigating a level can be described as trial and error, many platforms requiring precise jumps or quick colour switching to reach them otherwise the player falls to their death or gets caught inside a platform, resulting in instant death.   The level design seems very specific, players having to navigate them exactly as imagined by the developer otherwise risking the same fate mentioned above.   Some enemies and objects seem to have different hitboxes than their actual shape, sometimes causing the player to clip into a platform without being able to jump out of it, only to walk out and fall, or getting hurt by an enemy that should have just disappeared when the colour is switched. Also worth mentioning is that when the player is hurt, they are thrown in the opposite direction and can't move for a moment, which can lead to the player being thrown off a platform and falling to their death.   The game has a very creative concept and would otherwise be OK if more effort would've been put into its development. 5/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "Very relaxing game the music and the sounds are good enought to play the game, wish i could download it apart (too lazy to check files)",
            "review_score": "1"
        },
        {
            "review_text": "Funny and free!",
            "review_score": "1"
        },
        {
            "review_text": "Really like this game not only for the idea of the gameplay but because it keeps you trying, testing yourself, the next time you play the level you think you know what's next but your reflexes can betray you.",
            "review_score": "1"
        },
        {
            "review_text": "For free it is a fun game with a twist on the usual platform styled games. Check it out one evening when you find yourself bored it will be worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This definitely looked like an interesting concept, but it doesn't seem like it was excecuted well. There's a meter at the bottom that probably has something to do with color switching, but I never really had any idea, and the collision detection is so wacky that enemies hit me from six feet away and touching a vertical edge rocketed me straight downwards. Not to mention that the 'recovering' animation takes forever. It's so slow that I thought my computer was slowing down, but no, it just takes fifteen seconds to get up from a hit.   And then there's the level design. Not really anything creative about it, especially for a puzzle platforming game. If the jumping just took skill, that'd be fine, but it's so easy to switch colors and have a wall pop into you, instantly killing yourself. Even though the same thing could happen in, say, Mighty Switch Force, at least then you knew ahead of time where things would appear, and the dumb mistake was on you, not the designer. Eventually the point I gave up at was where it started requiring me to make blind leaps of faith, the majority of which ended with me falling to my death, switching in a wall and being squished to death, or colliding with a bird or angry plant that knocked me away with no means of recovery, again to fall to my death. It doesn't help that the jumping is so... floaty. And even when I knew where I had to make something appear, the simpleness of the scenery meant I didn't have any reference point for where that was after I jumped.",
            "review_score": "-1"
        },
        {
            "review_text": "This game feels far too much liked an under-developed flash game. The controls are sticky and often a little unresponsive and the game mechanic feels more like a concept than a finished product. Fair enough, it's free. Get it, see what you think for yourself. But I'm not impressed.",
            "review_score": "-1"
        },
        {
            "review_text": "Not bad for a free game.",
            "review_score": "1"
        },
        {
            "review_text": "Its a great inde game to play (if you like failing). It is rage induceing (but i like to rage). Its one of the hardest inde game i played.",
            "review_score": "1"
        },
        {
            "review_text": "I was bored one day and looking for something new to play. I began my browsing in the Free-To-Play section and found this game, saw that the download was tiny and helped myself. I was not expecting much from what is on the game page, however I really liked the concept that this game possessed. You have 4 different colors and must strategically switch to a different color to make foes disappear on new pathaways appear. Yes, it is quite underdeveloped, but it has a cool concept that is fun to master.",
            "review_score": "1"
        },
        {
            "review_text": "2016 Platformer Game of the Year  mkay bye      you can go now...",
            "review_score": "1"
        },
        {
            "review_text": "Since people tend to only read the short versions on here, I will sum it up first with a 7/10. Buggy, but still fairly good.  The game is simple enough - avoid the traps by using a button to filter out a colour. Blue trap? Blue filter. Green trap? Green filter. Multiple traps in quick succession? Press the buttons fast and hope it responds. There seemed to be a cooldown mechanic in place, which was a little offputting in a high-speed puzzle. Then again, you have certain puzzles that have green red AND yellow traps in the same area. This is where you have to use a special bar to use all the filters at once, thereby leaving only black ink. Why not do that all the time? Simple - it has a recharge timer, takes away your HP. and you actually need to land on a specific colour most of the time... Or you can fall through a platform and randomly hit the end of a level. Yeah I did that on quite a few of the levels on accident. (and three times on purpose!)  The bugs. Oh, the bugs... I fell through platforms, instead of walking through (they were literally closer together than one of the characters' legs, but apparently that doesn't matter) and I clipped through more than half the buildings I walked towards. This became to such an extent that in the three times I mentioned above, I actually exploited the clipping mechanic to skip a puzzle simply because I couldn't walk to the next platform. I couldn't jump either, as there was a trap within the minimum jump height. So... I don't quite know what else to do in that situation, as I tried repeatedly to walk past it and failed. Oh and it was black ink - no failure of mechanics, just hitbox error. Again, for the sake of fairness it has to be said that the entire game was beatable. It wasn't gamebreakingly bad, just unintentionally frustrating to traverse.  On top of the platform bug, there was a more annoying issue with persistency. Some coloured traps remained in certain situations (Such as walking to a new level) on same coloured filters. (ie. Yellow spike, yellow filter) This was mostly avoidable as far as i'm concerned, as the game should have checked the filter in use upon loading the level. Although it was able to be fixed in relative safety, it was slightly redundant to have to swap colours to fix this. Maybe if you could have pressed the same filter button to refresh itself that would have been better? Something for the Dev to look into for the sequel, if they haven't done that already.  This game had its fair share of ups and downs, and to be honest if it wasn't free I probably wouldn't have finished it. As daft as it sounds, I figured since the dev had the decency to post this game then I might as well finish it. I don't know if it is because I played the game in stages, but the end seemed to hit me faster than I expected. I finished the game in 1.9 Hours. That includes standing there annoyed at my character for clipping through a platform one time too many, going from my computer and making a cup of tea, getting a phone call, having said phone call, going back to the computer, realising the game was still on, and turning it off for about a month. I actually only managed to play the 1.9 hours over about three or four sittings, but that was mostly because I had other things to do. But, in the games defence I picked the game up and carried right on where I left off each time. It wasn't the fact it was frustrating, I simply forgot about it...   And speaking of forgetting, I don't quite know if the narrative was supposed to be an actual story, but it seemed very bland. White text on a yellow background (to avoid yellow trap) was hard to read, it didn't seem like it was there for any particular reason. It felt a little vague, as if lost in translation somehow. Not saying it was a bad thing, it just didn't seem to serve any purpose. It didn't move me, it didn't leave any lasting impression... It was just... there? *shrugs*  So, to cut a long story short i'll put a basic pro-con style thing here randomly for the heck of it, eh?  PRO: The game was FREE. Can't get fairer than that in my opinion. It was a playable game - even went as far as having an ending. The mechanics are extremely easy to pick up, highly understandable. The intentional frustration is very real, but not overly so. Challenge, not trials.  Balanced: The artwork was great, but the animation made it feel cheap. Kinda evens out.  CON: The buggy platforms The buggy filters Some parts felt improperly paced",
            "review_score": "1"
        },
        {
            "review_text": "A weird puzzle personally i need more games with action",
            "review_score": "-1"
        },
        {
            "review_text": "+ original concept + artstyle + hard dificulity + PRICE  ///////////////////////////  - a bit lame programmed - repetitive music",
            "review_score": "1"
        },
        {
            "review_text": "Let's get this out of the way first; for a 'free' game, this is absolutely worth the download. Here's why:  - it's a unique idea that combines platforming with some sort of Quick Time Event type of gameplay mechanic.  - The soundtrack is cool, (yes, it's short and loops over &amp; over again, but it still fits the game's world and general feel of the narrative.) - It's fun having to think in new ways of playing a platformer.  - This is obvious, but duh! it's free! you won't be losing anything for downloading it and trying it out for yourself.  Now, on to the bad stuff:  - For a game that relies heavily on precision, the controls are pretty stiff and irresponsive in many parts of the game. - You'll be doing many leaps of faith where no clear path will show until you've jumped and it's too late to change into the corresponding color of the platform you're supposed to land on. - There are areas in the game where you have to follow a very specific, very linear path to get to the exit; this feels both restrictive and frustrating. - Questionable level design in some levels where the enemy is placed somewhere which will be very difficult trying to get by it. I'm not talking about regular difficulty here, but pretty bad placement for enemies where it could still be challenging putting them elsewhere that made more sense.   Overall, this has a unique concept that wasn't executed very well thanks to bad controls and a somewhat random level design at times. I'd still recommend it for the unique concept alone.  ",
            "review_score": "1"
        },
        {
            "review_text": "Need Brain xD",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, the core mechanic of switching colors to change what you can interact with was surprisingly fun, but i have a few issues. -The fact that you can only double jump at the height of a first jump feels very clunky, as most games will allow you to jump in the air if you walk off the edge. Found this double jump someward akward -When you switch colors, it is very frustering to be forced to interact with a platform that was previously offscreen. -I don't understand why the game asks if i want to continue after i die. Feels like something you leave in after a student project. Why would i need a prompt to keep playing, especially in a linear platformer where you're going to die a lot. -While the color switching makes platforming more interesting, i can't help but feel a puzzle element is missing. Feels like the color mechanic isn't being used to it's fullest potential.  Maybe next time, just get rid of the double jump and focus on the color switching mechanic? Ultimately nitpicks, still pretty fun.",
            "review_score": "1"
        }
    ]
}