{
    "app_id": 317510,
    "name": "Beyond Gravity",
    "release_date": "2014-09-23",
    "developer": [
        "Qwiboo Ltd"
    ],
    "publisher": [
        "Qwiboo Ltd"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual"
    ],
    "tags": [
        "Casual",
        "Action",
        "Indie"
    ],
    "achievements": 40,
    "positive_ratings": 787,
    "negative_ratings": 101,
    "price": 1.59,
    "description": "Beyond Gravity is procedurally generated &quot;platformer&quot; where you jump in-between planets and try to collect as many pickups as you can. This gets progressively harder the further you jump. No need to worry tho as you can upgrade your character with loads of upgrades and power-ups!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/317510/header.jpg?t=1447363054",
    "minimum_requirements": "OS: Windows 7 or higher Processor: 2.0 GHz Dual Core Memory: 1 GB RAM Graphics: Intel HD3000 or higher with OpenGL 2.1 support Storage: 150 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This sums up how I feel about this game:         YouTube™ Video:  It Was 99 Cents&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Alright. So I will keep this short, just like the game, which is not a bad thing!  This is an decent port to say the least. If you have some time to kill, then I surely reccommend buying this petite game. Although it is, as I mentioned, rather short, I have found this game quite enjoyable. Once you upgraded and equipped everything the game is just over.   It was fun as long as it lasted, but I wouldn't buy this game for the full price. Just buy it when it is in sale. Then it'll be worth your money, kind of. For me it was fun, because at times I had time to kill, so why not.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun for 1 hour and then gets old real quick but it's a great time killer.   Pros:",
            "review_score": "1"
        },
        {
            "review_text": "Amazing gem. Found it in my library while looking for games with trading cards, found out the game itself is amusing. Its a combination of single-button runner-style game (where you run and jump) with a physics engine, which simulates gravity. In short, you jump from planet to planet, collecting... bolts? And golden ones? It may not sound very amusing, but graphics are made in a cute (nice, interesting, fun) way, it looks good. Sound is also good, so overall the game is fun to play. There is no 'end-game', no boss and the game is infinite (as far as I can tell), but its well made and gives off a good feel.   Loving it. Recommended if you're into one-button time-killers.  The only drawback: its kind of short, took me around 5 hours to complete. But it was quite fun!",
            "review_score": "1"
        },
        {
            "review_text": "A stupidly addictive casual one-button game. The achievements are far too easy to get through though, I managed all of them in just under 3 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome fun! Simple to play hard to master. If your looking for a simple game that only requires the click of a mouse, this is your game!",
            "review_score": "1"
        },
        {
            "review_text": "Beyond Gravity is very simple, but it grabs you for a time pretty easily.. Awesome Game!!!  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Beyond Gravity is an interesting number, a find courtesy of steams lovely little coupons.  I honestly have to say this is one of the simplest, sometimes infuriating and yet most enteraining little games I've played in a long time. The controls are literally just one button; Either your space bar or left click, that is it. You use these simple controls to guide your crashed astronaut (Jeff) through a series of different planets, by literally planet hopping, trying to avoid the occasional fire balls hitting you in the face and squishing you and collecting screws to repair your spacecraft, (I'm assuming anyway).   Among that, it offers some quaint little upgrades, visual ones included, stereotypical system for a ported pad game, but in all, it's an addicting little thing that is brilliant if you enjoy the 100% of achievements and such.  The system of only being able to work on 3 achievements at a time was one I've not seen before but came to enjoy quite a bit as it didn't have you trying to do about 20 different ones at any given time, it also actually felt rewarding with having to collect them at the end of a round that you had just earnt certain ones within.  The graphic style is another thing I have to give it credit for as it's one I'm particularly partial to personally. However..  There is one background throughout the entirety of the game along with one soundtrack which is all nice and dandy for a short while, but you soon find yourself diving into the options to turn it off and play some music of your own just to numb out the sound from the game as it really does grate on your nerves after a while. Along those lines, it also doesn't offer much if any replay value once you've unlocked all the goals, aside from fully upgrading everything and occasionally opening it up to just play something fun that doesn't require much brain power at all. Other than that, it's fantastic and gives a good 4ish hours of play.",
            "review_score": "1"
        },
        {
            "review_text": "Beyond Gravity is very fun for those you wish to play casually and revatively easy for those who can picture simple trajectories. Game is well worth the price.  For achievement hunters, can easily 100% for easy stats. Only issue being there is no way to track your current goals, so keep them noted somewhere.",
            "review_score": "1"
        },
        {
            "review_text": "Nice little game. Think Angry Birds minus the anger and birds.",
            "review_score": "1"
        },
        {
            "review_text": "Beyond Gravity does a very beautiful thing. It takes a simple gameplay mechanic and makes it fun. The game doesn't attempt to redefine anything, or even give the illusion that something would be revolutionary about it. Instead, it just is some happy fun to have.   Absolutely worth the money spent on it. And it comes with 40 little challenges, which aren't ridiculously hard to achieve, but still take a while and some patience to complete.",
            "review_score": "1"
        },
        {
            "review_text": "This game is more like an app for tablet/phone than a game for PC. If you are looking for quick achievements then this is the game for you.   For achievements: Total game play time: 4hours approx Secret Achievements: No All achievable in one playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "Fun pass-time game that's incredibly easy to play and fun to see. The artistic nature makes it a cool and pleasant game to come back to again and again. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "very fun and addictive simple little game, if you want to have a rest! :)",
            "review_score": "1"
        },
        {
            "review_text": "I loved the art! It is pretty simple and easy to get into, maybe it could get a little repetitive at times but it´s good to play in short intervals so you won´t get totally bored. Also, the achievements are a great way to keep you going and the difficult ones give sweet rewards. The only thing i didn´t like was that you had only access to 3 achievements at the time and you have to complete them for more to appear so... it´s kind of frustrating when you get to the 'land on 1000 planets' at the end when previously you probably already did that but you didnt have access to it so it is from 0 in the moment you access.  Aside from that little detail, it was pretty fun and I´m gonna keep at it until i have all the upgrades.",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome game",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun, simple, and relaxing game. The goal is pretty much to pick up parts by jumping from planet to planet to upgrade your character. There's no story really and even to get all of the achievements won't take too long but while doing that it can be pretty damn fun. Overall I think it's worth the price by far and it's a great game just to waste some time on.",
            "review_score": "1"
        },
        {
            "review_text": "*Gnome Seal of Approval* Two hours of simplistic and addictive gameplay. Just one button to jump from planet to planet collecting cogs and screws. Once you have unlocked every achievement, the fun stops and you uninstall the game. Simple.",
            "review_score": "1"
        },
        {
            "review_text": "Nice little Addictive Arcade Game: Don't know if I would buy it on my phone because it is basicly in a nutshell, Doodle Jump and JetPack Joyride put together in a spaceman theme... It is also quite tough to get all the upgrades... Still, I recommend this game, No Stress, Simple, and Fun! :D P.S If you have a patience level of a 2 year old I do not recommend this game, unless you're bored... then go ahead!",
            "review_score": "1"
        },
        {
            "review_text": "~7/10  A simply tablet game where you click-and-hold if you want to time a jump around a hazard or tap to jump anyway.  2 hours will see you complete most of the achievements, most are readily achieveable which is totally awesome.",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful.  You find yourself, a lonely spaceman traversing the open galaxy, beautiful HD graphics, amazing scenery and art direction.  You decide to take a nap and BOOM... your crashing towards a strange planet and your spaceship is broken into millions of cogs and screws! You have to collect them all and jump from planet to planet trying to colect them all while fulfilling missions on the way! Hours upon hours of fun enjoyable gameplay all for a low price?!?!? Can't be true. BUT IT IS.  11/10 Your spaceman has a sick ♥♥♥ beard.",
            "review_score": "1"
        },
        {
            "review_text": "Nice little game",
            "review_score": "1"
        },
        {
            "review_text": "Cute, simple, and fun. As long as your expectations are in line with what to expect from a $2 smartphone port, you'll get a lot of enjoyment out of this game. I intended to try it out quickly before bed, and ended up playing almost three hours. Highly recommended if you just want an adorable game to relax with. Not recommended if you need complexity and challenge.",
            "review_score": "1"
        },
        {
            "review_text": "A neat little one-button platformer in space. It's an obviously a mobile port but the price makes it acceptable. Great to play when listening to podcasts or TV and all achievements are easy to get in around 4 hours.",
            "review_score": "1"
        },
        {
            "review_text": "nice cute little game .. must try with this low price tag .. good pass time from regular gaming",
            "review_score": "1"
        },
        {
            "review_text": "10/10  best casual game ever",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game only because this was on sale for 9 sents! Then I tried this game and noticed that this is really fun! Actually one of the best indie, chill games that I have! 4/5",
            "review_score": "1"
        },
        {
            "review_text": "Beyond Gravity is a short game : ~3 hours should be enough to complete it and get an easy 100% achievements.  You have to jump from a planet to an other one (only one button is needed to play) and get as much junk as possible. This allows you to unlock upgrades to improve your character. There are also some specific missions to do : they are the achievements. You have to unlock them by completing the missions.  Timing is the only significant thing to focus on : then, you can enjoy this cute game which is addictive (well, at least for 2-3 hours, then it is over !).",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes, a game doesn't need much to be fun.   Beyond Gravity, is a simple, yet addictive little game, in which you jump between rotating planets. While jumping, you collect screws, try not to fall and avoid incoming fireballs (or comets?). You can use the collected screws to upgrade your skills/spaceship.   The game looks cute, the graphics are pretty compared to other casual games. The only thing that will probably annoy you is the game's soundtrack.  Overall, Beyond Gravity is a must-have for anyone who likes casual games and 'quick to play' games.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, joyfull 3.8hrs of playing. Really easy and value for money is ++",
            "review_score": "1"
        },
        {
            "review_text": "Perfect little game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Completely ruined my life 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a simple yet very fun and addictive game. If you like Angry Birds like games, you'll probably like this one too.",
            "review_score": "1"
        },
        {
            "review_text": "5/10 Its fun at the first 30 min such as a little bit adictive but then its kinda boring",
            "review_score": "1"
        },
        {
            "review_text": "One day I asked Jeff what is the meaning of life, I saw his twinkle on his face and I felt ecstatic. He grabbed me into his spaceship with confidence and we took off. Throughout on our adventure we discovered the hidden unique beauty of unknown universe.   We finally arrived on uncertain planet, ambiance became shady, we felt deafening silence and I started to freeze. Shockingly 7feet green gross creatures leaped on our way, they spoke english fluently   (WTF?!..... dude just go with it, its hard to construct ♥♥♥♥ story)   . They called themselves 'Junktians' they collect junks and sold them into space junkshops.  Junktians caught me, luckily Jeff manage to escape and ran away, one of junktians shouted If he will not bring 1 million nuts they will eat me alive, With courage Jeff showed himself and agreed on junktians offer, then He shouted He will come back with 1 million nuts and to get me. I saw him took off with his teary eyes looking to me on window of spaceship.  Can jeff save me? Do junktians really eat humans? Why the hell there are junkshops on space? Where will jeff get nuts? as if there are nuts scattered on space.   Best Jumping game ever 10/10 would jump again",
            "review_score": "1"
        },
        {
            "review_text": "It is more like a well ported mobile game... I enjoyed it though.",
            "review_score": "1"
        },
        {
            "review_text": "I really like the art style for this game. It's simple to play too, which is awesome for if you just want something laid-back to play with half a brain and one hand. It's cheap. It's easy to get 100% achievements. And you can choose from different heads and bodies for your character. Instead of the astronaut, you can play as a steampunk zombie or a skeleton bike baron. So that's a bonus. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a game where you can essentially turn your brain off and just kill time. It is simple and easy to 100% in just under 3 hours. Perfect for achievement hunters. The only goal of the game is to complete the objectives by jumping from planet to planet collecting screws while dodging fireballs.",
            "review_score": "1"
        },
        {
            "review_text": "Died beacuse a fireball hit me when reached 960M  Raguequit simulator 2015 Would ragequit again 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Very simple but fascinating.",
            "review_score": "1"
        },
        {
            "review_text": "I would recomend this game anyday. good time killer, and challanging at first. enjoyed earning everything the game had to offer.",
            "review_score": "1"
        },
        {
            "review_text": "Very simple and basic game with a simple task collect as many screws and bolts as you can and buy upgrades.",
            "review_score": "1"
        },
        {
            "review_text": "Not that bad to be honest, Pretty fun and It was noice",
            "review_score": "1"
        },
        {
            "review_text": "PROS: *Good art  CONS: *Completely insubstantial as a game: gameplay consists of clicking the mouse at the right time to jump,  nothing  more *Upgrades are too expensive for their minimal effects, with the exception of one that makes the game a joke *Achievements are universally 'grindy' in nature  GAME LENGTH: Achievement hunters can expect to take around 3 hours. Those who just want to complete the game should be aware that the game  is  the achievement hunting.  SCORE: 2 out of 10  This game is a waste of time.  There is literally no gameplay beyond clicking the mouse to jump. The only obstacles are the occasional comets that move up and down between planets, but they are easily avoided. The few upgrades (and skins) that the player can buy with the money that he earns are useless, with the exception of an upgrade that shows where to jump on each planet to maximize profit. But since the player has no decisions to make  besides  where to jump, this upgrade reduces the game to nothing.   Achievement hunters should be aware that some of these involve a great deal of grinding. The most tedious to complete is 'Land on 1000 Planets,' which might not have been so bad if the game tracked it from the beginning. Unfortunately, the in-game goal, and thus the achievement, only becomes available near the end of the game, when there is nothing to do. At the time of writing this, there is nothing left for me but to land on another 500 planets, which seems like torture at this point.  The positive reviews here make no sense to me. I understand that the game is only $2, but I was bored within minutes of starting because nothing changes. I have played free games that do a much better job of keeping me interested.  I give this a 2 out of 10.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't recommend this game for three reasons. One, not enough variety; two, the shop prices feel too high; three, there's little sense of risk.  The gameplay involves jumping from planet to planet while collecting screws and dodging fireballs that travel up and down. That's a nice foundation, but it's all there is. If you can line yourself up and time your jumps properly, you can go on for dozens of minutes in a single run and not see anything new besides planets, screws, and the occasional group of fireballs. It would have been nice to see different types of obstacles, planets, or powerups, especially once you survive past the first few minutes.  My first run lasted around twenty minutes, and I managed to collect around 10,000 screws. Not bad, right? Actually, that was barely enough to buy the cheapest item at the shop, and all it did was increase my jump speed slightly. Most items cost at least 40,000 screws, which equates to over an hour of playtime at my speed. When you consider how repetitive the gameplay can be, that feels way too long.  There are optional challenges you can complete, but I've gone through around 50% of them, and so far the payouts don't seem to exceed 1,000 - 2,000 screws. Maybe the later ones are better, but some of them are rather tedious (play 30 games), and you can only pursue three at a time. Keep in mind that most of the shop items themselves- jump faster, attract screws from father away, increase your score multiplier- aren't anything exciting, in my opinion.  You press the left mouse button to set your angle, then release to jump. You can cancel a jump by holding down the left mouse button long enough, so there's no sense of commitment when you pick an angle. As the speed of the planets and fireballs increases, you can repeatedly cancel angles that look bad without any apparent penalty (unless I'm missing something). It makes me wonder what will kill patient, precise players first: the fireballs, or boredom?  Now, I bought this for $1, so you could argue I'm being awfully nitpicky at that price point, and I don't entirely disagree. Still, I think Beyond Gravity really lacks a sense of longevity. If more gameplay elements- planet types, obstacle types, powerups- were added, I'd consider changing my stance, but as of this writing I don't recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Only a dollar but I was bored in under an hour. My 4 year old likes it so far; it could still be money well spent.",
            "review_score": "-1"
        },
        {
            "review_text": "This was meant for the mobile; no one should have to sit through this on the PC/Mac.",
            "review_score": "-1"
        },
        {
            "review_text": "There are a few things to say about this game. This game is fun, I had a good time with it. It's not a bad game, at it's core the game is simple yet fun. The graphics are nice, kind of cute. But still there are a lot of bad things about this game. First, no options for fullscreen which is bad.   Second, it just feels like a mobile game ported to pc. Which is a shameful display. It is essentially a one button game. It imagine it working flawlessy on mobile devices. But on a pc, it just feels like it's lacking depth.   In 90 minutes I got 85% of the achievements.This game is not suited for longer play sessions than 5 or 10 minutes, because after 10 minutes or so it just becomes boring and repitive. Which is fine for mobile, but than again not suiting as a PC game.  So should you pickup this game? I'll be honest , in my opinion you shouldn't. The facts are that it is a good game, but it isn't made for PC. If you want to play this game   buy this game on your mobile device  . It's cheaper there anyway.",
            "review_score": "-1"
        },
        {
            "review_text": "The biggest mistake you can make with a recursive casual game is to make a player work too hard to feel like progress is being made and GUESS WHAT THIS GAME DOES, THAT'S RIGHT BUDDY  At least it's pretty",
            "review_score": "-1"
        },
        {
            "review_text": "Girlfriend walks in... 'Is that a cellphone game?'",
            "review_score": "-1"
        },
        {
            "review_text": "It would be more at home ona mobile device than a computer.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a bad game but it is not worth your time on pc",
            "review_score": "-1"
        }
    ]
}