{
    "app_id": 317620,
    "name": "Space Hulk: Ascension",
    "release_date": "2014-11-12",
    "developer": [
        "Full Control Studios"
    ],
    "publisher": [
        "Full Control"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Warhammer 40K",
        "Turn-Based Tactics"
    ],
    "achievements": 163,
    "positive_ratings": 508,
    "negative_ratings": 212,
    "price": 22.99,
    "description": "Space Hulk: Ascension is a 3D, digital, turn based, strategy game, which re-interprets the classic board game experience, and adds new RPG style mechanics, new weapons and missions, new enemy types, 3 playable chapters and loads of other new features to the single player experience.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/317620/header.jpg?t=1539673657",
    "minimum_requirements": "OS: Windows 7 Processor: 2 GHz Dual Core Memory: 2 GB RAM Graphics: GeForce 400+, AMD Radeon 4000+ DirectX: Version 9.0 Storage: 15 GB available space Additional Notes: Dedicated graphics highly recommended",
    "recommended_requirements": "OS: Windows 7 Processor: 2.0 GHz Quad Core Memory: 4 GB RAM Graphics: GeForce 500+, AMD Radeon 5000+ DirectX: Version 11 Storage: 15 GB available space Additional Notes: Dedicated graphics highly recommended",
    "reviews": [
        {
            "review_text": "The original was a direct port of the board game to PC - with all the problems that entails. You can have perfectly good tactics in the board game ruined by a run of shonky dice rolls that results in a 'GG - you win' (or throwing a strop and chucking the board/pieces in the air and finding Genestealer limbs scattered around the living room for the next six months) - and in the board game, that's fine. However, that doesn't translate well to a computer game, especially in the campaign where outright failure isn't really an option and it just results in frustrating reloads.  This is a much more computer-friendly version of Space Hulk - yes the graphics and sounds are better than the previous version but far more importantly it's taken away almost all of the annoyances I had with the previous version; random command points are gone, random Storm Bolter jams on rolling a double are gone (they still jam but in a much more predicatable manner which gets rid of those irritating turns where everybody seems to jam, all the time), they've put a 'Load Game' option into the quick-menu accessible during the game (previously you'd have to quit to the main menu to reload which was an unecessary pain in the a***)... hell, even Lightning Claws aren't necessarily a complete death sentence now.  Also added are some RPG-lite elements - hits work on a percentile based system rather than dice rolls so as your marines gain experience you can train up their Ballistic skill (for example, there are six skills in all) so they have a better chance of hitting.  In basically every way, this is a better game than the previous version (I don't even mind the removal of the tactical map).  Is it perfect? No.  While there are 3 parts to the campaign (3 hulks, one for each Chapter available basically) the campaigns are not significantly different. The missions are pretty samey and it doesn't take full advantage of the fact that it's not constrained by being a board game - for example, they removed the tactical map so you don't know the exact layout of the level... OK, fine. However one set of missions revolves around retreiving a C.A.T. unit, which is a little droid that potters around mapping the hulk - they could have used that to activate a tactical map once you'd retrieved it. There are a few missed opportunities like that.  Other than that the voices are repetitive and some of the graphics (especially the character cards) lack polish, but this isn't a Triple-A title so I can forgive that.  Like the previous version, this isn't going to be a game for everyone. It's still Space Hulk; a fairly slow paced, tactical take on one aspect of the Warhammer 40K universe. However, if you like Space Hulk this is a really good computer translation of the game and well worth the ~ £20 shelled out for.",
            "review_score": "1"
        },
        {
            "review_text": "While I dont have THAT many hours in the game, I have played the 'original' (recent) spacehulk (and for that matter the 1993 PC game and the tabletop game) and think its fair that I be able to offer a comparison. So I will :D.   First off, the 2013 Space Hulk was a digital version of the tabletop game. Die rolls, bad luck ruining everything, the whole nine yards. This was known, this was intended. The game was a bit boring, unfair, and it didnt receive much acclaim. So the Devs, much to their credit, took it to the fans and asked: 'well if you didnt like it, what would you like?' Gamers being gamers, they answered and the devs actually listened.  Space Hulk: Ascension is what we wanted and its what they finally gave us. The game is much more in line with other tactical strategy games. The entire rule system has been reworked for a more immersive RPG tactical experience. Less games ruined due to bad 'rolls', character progression, more enemy types, more weapons, more chapters, more storylines, more missions, character customiztion, etc. THIS IS NOT A MOD LIKE, SLIGHT TWEAKING OF THE GAME. Even the lighting has been improved. Yes some of the missions and story have been carried from the 2013 release but you are now playing them with a squad that you built, customized and care about; fighting new enemy types with your new weapons. This is Space Hulk as it 'should' have been (my humble opinion of course). In conclusion, if you like Warhammer 40k and/or Space Hulk but werent impressed by the 2013 release, then you really owe it to yourself to let this game redeem the franchise.",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely stellar game, and a fine update from the previous edition! I'll admit, I wasn't terribly enthused about the first iteration of Space Hulk, even with all the DLC. But with Ascension, we have everything the original was crying out for--and more! The character progression is very well done--rather than simply gaining hit points and killing power like in nearly every other game, upgrading your terminators makes them more versatile--faster, more accurate, and most importantly, more options for equipment. One solid hit from a Genestealer still kills, making you have to use your newfound abilities to plan better, rather than simply muscling your way through. And by making the Genestealers more varied, it adds a new level of tension to the game. I'll never forget the first time I got cocky and blew apart a nearby alien, only to find myself minus one teammate when the creature unexpectedly exploded into a pool of acid. You know you've made a tactical strategy game right when 'mage' type characters are used for more than firepower. I love blowing apart swarms of monsters just as much as anyone, but nine times out of ten, I found myself having my Librarian put up a barrier rather than kill several enemies, as it was the sounder tactical move. Doling this of my own volition in a game like this speaks volumes of its quality. All in all, this is one of the finest games I have ever put my fingers to. I can find no fault in its execution, no issue with its mechanics, and other than screaming at my own stupidity when one of my teammates is butchered before my eyes, I have never found myself becoming angry at the game or any aspect of it. 11 out of 10!!!",
            "review_score": "1"
        },
        {
            "review_text": "Tutorial mission 2, 5 minutes into the game, has a bug at the end of the mission and cannot be completed. Given that the studio is shutting down, I don't feel like delving into this game with little hope that it will be maintained... and clearly it's got a lot of maintaining to do.",
            "review_score": "-1"
        },
        {
            "review_text": "Solid game, needs better mission briefs. Lack of the Terminators speaking can leave an empty atmosphere. So much history with WH40K not being used here",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! Thank you for making this game. Space Hulk one is fantastic but Space Hulk Ascension this is beyond amazing. Buy this and support Full Control. I see great 40k games from them in the future. Don't pass this up!",
            "review_score": "1"
        },
        {
            "review_text": "Significantly better than Space Hulk, main addition (for me) - metagame with level-ups etc. Still, I wouldn't suggest Ascension over star turn-based strategies of this year: Divinity and Wasteland.",
            "review_score": "1"
        },
        {
            "review_text": "This game has been completely broken since the last patch (months ago) and the dev is AWOL. Sadly this game is clearly not going to be fixed. Again...GAME IS TOTALLY BROKEN...DO NOT BUY!!!  EDIT 1: Ok, there have been a couple of patches since I posted this review and it would seem that most of the biggest problems have finally been fixed. As soon as the last couple of issues I have read about are patched, I will be changing this review to a thumbs up.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game. Highly recommend it. Worth the money now that the bugs have (nearly) all been fixed (ongoing).",
            "review_score": "1"
        },
        {
            "review_text": "This game is broken, don't buy it. You can complete missions perfectly and it will still say you failed.  Do not buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Highly recommended for fans of Warhammer 40k, and Table-top or Turn-based Strategy games. Also recommended for people, who don't know anything about WH40k, but are interested in sci-fi's like Aliens (second move with Marines fighting off hordes of aliens), or anything of the sort.   Leading squads of elite inter-galactic marines, with the finest weapons and armor armor in the galaxy, and hunting down hordes of the most deadly biological predators, is incredibly satisfying to watch. This is a dark, tense, and unforgiving game, and I love it for that.   + Each chapter feels pretty unique in look and gameplay, and it's worth replaying a campaign with another Marine Chapter.  + Campaigns are lengthy and offer a variety of challenging scenarios to overcome. + Lots of tactical depth with the squad customization of skills, gear, and weapon combos, which allows you to build up your squads how you want. + Armor and Decorative customization is a nice addition. + AI is solid and challenging to face.  + Sound and FX are perfect - the dark, horrific atmosphere is enhanced by stellar ambient sounds. Comparably awesome to the well done Dawn of War series in this respect. + Extremely satisfying death animations and weapon effects.    I love a good soundtrack, and this game doesn't offer much in that regard, as music is used sparringly (what - which in this game's case, is not a bad thing - as the mood of the game is set not by instruments, but by the atmospheric sounds of the Space Hulks; the screams of vicious biological terrors; and the blasts of bolters shredding apart bodies and the clanging against metal - which is perfect for a horror setting.   It is worth supporting this developer, as they treat the Warhammer 40k IP with great respect, and there's a lot of potential for bigger better WH40k games in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Such an improvement on the original. I own the phisical game and its great as a board game but turning it word for word into a human vs pc video game wasnt great. But this!! man this is perfect. all the changes that move it away from a virtual board game turn it into a really fun game. Love the customizability and level system. really adds something to the game. along with all the extra weapons ofcourse.",
            "review_score": "1"
        },
        {
            "review_text": "As a fan of turn based tactical strategy games (My all time favorite being Silent Storm 2), I have to say, this game is utterly wicked as f#$k. And if your a Warhammer fan, it becomes twice the amount of f#$king awesome in one game. Its beautiful and very deep, has tons of missions (100+ missions across 3 campaigns in the base game and more missions in the expansions they will release) is very faithful to the original material and is difficult but not unfairly so. Such as a game like dark souls, understanding the way all moves, attacks and enemies function will lead you to victory and the tense moments such as trying to escape with all your marines alive as the genestealers rush to your position en mass truly make the game exciting for me as a turn based tactical strategy guy. Hop on it fellas :D",
            "review_score": "1"
        },
        {
            "review_text": "Very pleased with this game.  The graphics are good, the dark fog of war enviroment makes the game more challenging and enjoyable, you have to slightly explore the maps, there are workarounds to this, so people are free to use them if they want.  Speed of the game on my pc is fast, some people have reported problems with slowness but this has not affected me.  The 4 chapters they use are great and I would like to see more added., and the level cap, number of skills slots and item slots increased.  There are a couple of bugs the main one being that acid resistance does not work yet, but we are awaiting an update to fix this. Doors sometimes appear as closed when destroyed.  The save game feature could be more intelligent, at this time to start a new save game for another chapter you have to delete the autosave, then create a new manual save, they could do with tidying this up.  If you want a simple to play space game that is turn based and requires some tactical thinking then this is the one you might want to try. ",
            "review_score": "1"
        },
        {
            "review_text": "I'm liking it so far after ~6 hours of play. I see some people comparing X-Com Enemy Unknown to this game, but aside from both being turn based games where you kill aliens, they really don't have much else in common.  X-Com: EU has more simulation type things to it like base building, research, resource management, etc. Space Hulk seems more about just killing aliens and completing missions, though there are some RPG elements like troops gaining experience, skills, weapons, etc.",
            "review_score": "1"
        },
        {
            "review_text": "S!   As a fan of Warhammer 40k and missing out the original Space Hulk aeons ago, was very pleased to spot the new Space Hulk and Space Hulk : Ascension to emerge. While the first is a straight 'board game to PC' conversion, it offers tough gameplay. Ascension, even a bit more 'streamlined', is like a gateway to Warhammer 40k to newer players. It is a tough one, but also modernized making gameplay more fun. Graphics are nice as well and with tweaking options for sure will run on your rig.   TL;DR Want death and claustrophobia around every corner? Welcome to Space Hulk!",
            "review_score": "1"
        },
        {
            "review_text": "Overall, 40K fans aren't desperate for amazing games, and while this game isn't really newsworthy, it's still a solid game and reccomendatio for all 40k fans. Having played the board game, I enjoyed this adaptaion immensely.  This game had a bit of an XCOM feel to it, which is a great sign IMO.  Ascenion can essentially be described as a turn based grid tactical rpg survival horror in space with Space Knights/Vampire/Werewolves fighting xenmorphs. Derp. It's still pretty good.  Pros: Solid combat. Really makes you think with your tactics. A great adaptation that catches the feel of the board game, while also being its own distinct game. RPG mechanics work well, you can grow attached to your squads. Good atmosphere. Music. Gameplay length is awesome for the price.  Cons: Limited Space Marine dialogue that kinda gets old and bland quickly. Visuals are meh and murky. Some cheap deaths. Some game breaks where you can literally camp and just wait until Genestealers are dead.  Overall, this is a reccomendation for 40K fans and everyone who likes turn based combat. Normal gamers won't find anything too special, but the price is low enough with good replay value.  Overall score: 7.8/10",
            "review_score": "1"
        },
        {
            "review_text": "I personally love this game. It has good graphics and is a great strategy game. I still have a couple problems.  #1 In some missions you have to kill a tech marine/ iron priest who was abducted by tyranids and is on hte ground. One hour of gameplay and over 70+ Xenos slain in melee alone, i get to the room with my heavy terminator equipped with an assault cannon. The reason is that the objective CLEARLY states that you can shoot OR burn the marine. The game appears to be either bugged or the objective is wrong because none of my marines would shoot it.  #2 The creators of this game cant calculate properly. My Space Wolf seargent with a pair of wolf claws has a 90% chance of hitting a genestealer. THIS DOES NOT CALCULATE THAT 9 OUT OF 10 BATTLES WILL RESULT IN A TYRANID KILLING A SPACE MARINE. THIS SHOULD MEAN THAT 9 OUT OF 10 BATTLES WILL RESULT WITH A TERMINATOR KILLING THE TYRANID.   other wise this a good game but be warned of its bugs",
            "review_score": "1"
        },
        {
            "review_text": "Just played the tutorial and 1 campaign mission. This game is generally better than Space Hulk.  Specialisation, level increase are good enhancements, able to bring the units to subsequent missions make me feel for the squads and care for them. But the more obvious issues here are the lack of map and rather dark environment. These 2 issues added together stresses my eyes. Although gamma setting can be tuned to help, but it will help greatly with a map (for those who played the previous space hulk, it is the tab key to see the map).",
            "review_score": "1"
        },
        {
            "review_text": "Solid game that was a lot of fun the first 50%... got boring towards the end as you leveled out your guys and just wanted to finish out the game",
            "review_score": "1"
        },
        {
            "review_text": "Love this game .. very slow paced but with lots of tension .. the next move could be your last ...",
            "review_score": "1"
        },
        {
            "review_text": "Yes I know it's not a major update to the franchise but get it. It's awesome and adds new elements to your strategy.  Works flawlessly under linux. A major thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "Ignore the nay sayers, this game is really good. I love turn based strategy and this game delivers. I love how when trying to escape an area it feels as if you are just about to be overrun, every time, might just be because Im not good at the game yet. This game feels really intensive and I regret not buying earlier due to the bad reviews.  Obligatory For the Emperor",
            "review_score": "1"
        },
        {
            "review_text": "Good strategy game, with enjoyable graphics and really nice mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Have not come across any bugs so far, the game seems to run great for me. I really enjoy the tactical turn base gameplay. Missions are fun and are mostly challenging. The environment does not change, which creates bad repetition in atmosphere and setting. Overal a blast to play if this genre is for you.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy the game a lot and I think anyone who has played the board game will too. I do take issue with the sometimes clumsy controls. The ai also doesn't always take the most efficient path when moving costing more action points if you don't do it yourself one tile at a time. However having said that I don't think it ruins the game. The game also has a fair amount of content to play. It could keep you busy for dozens of hours if you play all the campaigns available to you. The squads keep their stats at the end of a campaign so you can make it progressively harder.",
            "review_score": "1"
        },
        {
            "review_text": "Update 31/01/2016 : Since patch 1.4.1, most of the bugs are corrected. One of the best turn based strategic game. Epic and long campains, various ennemis, terminators leveling very addictive. Do not hesitate if you like Space Hulk or W40k universe and turn based games.  Notes : Dark environnement with death at nearly each corner. Lots of weapon at your disposal to eradicate the infestation or just increase your life time. Flash missions to find relic weapons. And a lot of chapters to try different gameplays, from longe range to close combat passing by plasma, flames, rocket and turret. Form your squad, choose your weapons and skills, then survive!  Comment about DLC : Imperial Fist =&gt; my favorite chapter, with the best close combat survivability (A must have). Salamanders =&gt; campain very laggy with low fps . Dark Angel =&gt; very complex and challenging mission (A must have). Chapters DLC =&gt; only armour colour changes (mainly useless).   (French) 20/12/2014 :  En un mot Excellent. J'avais apprécié les précédents opus sur le même thème (Space Hulk), mais celui-ci les surpasse dans tous les domaines. Beaucoup plus de contenu sans DLC, campagne plus longue, ennemis variés et le leveling des terminators ajoute une nouvelle dimension. Petit bémol pour les personnages au Corps à Corps qui sont fortement désavantagés en terme d'expérience. Si vous aimez, Space Hulk, ou les jeux de stratégie en tour par tour, n'hésitez pas.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive upgrade to the board game. Introducing the RPG elements just adds a whole new level.",
            "review_score": "1"
        },
        {
            "review_text": "I just played a few of the tutorial missions and I have to say I am hooked!   I heard about Space Hulk via the company Battle Foam whe I was buying cases for my Star Wars X-wing fleets. After hearing about it and doing some research I decided I really wanted to get into Space Hulk as well... But as most people know table top games can get REALLY expsensive REALLY fast.   So when I found this, I had to try it out! I love what I have played and I cannot wait to play more!",
            "review_score": "1"
        },
        {
            "review_text": "Game is VERy fun when it works. Unfortunately the game is also riddled with game breaking/halting bugs that you can not even advance the missions. Can NOT recommend this game to anyone till these issues are fixed (if ever as it looks like the studio responsibile for this product is now one person working on stuff in his spare time.)  Stay away from what could have been a great game. If they fix the game breaking issues then will remove this review as the game is very fun, when you can play it.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game to pick up, do a mission and then set down. I also happen to love Warhammer 40K, so if you are a fan I highly suggest it.",
            "review_score": "1"
        },
        {
            "review_text": "This is the space hulk I've been waiting for. It has a touch of X-Com while retaining the feel of the boardgame.",
            "review_score": "1"
        },
        {
            "review_text": "Anyone who's read any of my previous reviews may have sussed by now that I'm not an overly big fan of where gaming is going, in specific regard to 'open world'-y and overly complicated 'RPG'-style elements. Don't get me wrong...the weapon/personal upgrading system in the first two Dead Space games, for example, was fantastic. But did we really need the 'unique customisation' of Dead Space 3's alleged 'crafting' system? Well I for one certainly didn't, as clearly evidenced by the fact that I simply settled on a couple of guns which seemed to work okay for me, before unceremoniously breaking down the other ones I'd made for spare parts. Which brings us to the rather ambivalent business of comparing the first Space Hulk to the 'new 'n' improved' Space Hulk: Ascension. Is it really all it would crack itself up to be?    Well, to put it simply: That depends on who you are. If you're a Skyrim kinda person, who feels that buying houses and finding wives to move into them adds 'depth' to your hack-'n'-slay fantasy gaming experience, then Ascension is probably the turn-based game for you. And even as a big fan of the first Space Hulk game from Full Control Studios, I'll happily concede that there's some definite improvements in evidence here. Not having to put your space marines on 'overwatch' round after round, if you're choosing to just keep them that way, is a welcome relief. Being able to perform other actions such as reloading or cooling down your weapon AFTER putting yourself on said 'overwatch' is a further relief. But what happened to the 'undo' button from the earlier game, for those innumerable occasions when you 'accidentally' turn a marine around 180 degrees, wasting all your Action Points in so doing, and effectively turning your back on the enemy and thereby all but ensuring said marine's certain death? And sure, the graphics are definitely 'nicer' and 'moodier'...but for all that newfound darkness, how the ♥♥♥♥ are we supposed to see the vent from which the genestealers are about to start spilling onto us, swiftly followed by the spilling of our pure space-crusader blood?     In short, for almost every improvement this game arguably makes over the original, it seems to balance that out by taking something away. I won't bother going into each and every pro and con in this regard...that would be pointless and pedantic. So what is, in my opinion, the MAIN thing which this new game giveth, versus the MAIN thing it taketh away? Ironically, for a rabid 'horror' fan like myself, my number one criticism is that what this game undeniably adds in ATMOSPHERE, it takes away from in STRATEGY. And given that this is, first and foremost, supposed to be a 'turn-based strategy game', that's a minor problem, don'tcha think? Let me put it another way...Ascension is arguably the more 'suspenseful' of the two games - you literally DON'T know what's coming around the corner, and it's arguably 'scarier' for all that - but gone are the days when you can feel the satisfaction of a hard-won victory based on careful trial-and-error and/or strategic forethought alone. The first Space Hulk, in my opinion, struck a (mostly) excellent balance between strategy and just-plain-dumb-luck, while Ascension seems to have tipped the balance slightly in favour of the latter.     One of the things that impressed me most about the earlier game was the fact that there were some missions where you basically had to pre-plan almost every move, from the meticulous deployment of your troops onwards, in order to succeed. How did you accomplish this feat? Well, with a MAP! A map which showed you every single square of the area your mission takes place in, and every possible place that the dreaded genestealers could pop out from. So you would plan your route THROUGH said map accordingly (and then, to some degree, still hope for the best)! Ascension dispenses with this entirely, in preference of only being able to see a handful of feet in front of you. More SUSPENSE, yes, but LESS STRATEGY. And more 'cheap deaths', to use the modern gaming vernacular.     Whatever you do, don't take this as an indication that I don't LIKE this new Space Hulk game. I do. A LOT. But I'm not sure I like it quite as much as the first one, and if I was to recommend one of them and one of them alone...well, like I say above, that probably depends on what 'kind' of gamer you are. I honestly would never have thought of myself as being a strategy-biased gamer - hell, I like a lot of 'dumb' ♥♥♥♥ - but in this particular case, my money's on the earlier game, if only just. But if you've got money to burn, or know of the existence of a thing called 'Steam sales'...why not try BOTH?! Then you can tell me what a ♥♥♥♥wit and a philistine I am for not seeing the obvious superiority of Ascension over its predecessor. You can tell me how board games and video games AREN'T the same thing, and shouldn't be treated as such, and how endless choices for individual customisation of games are not only the way of the future, but indeed should be how we invariably play games RIGHT NOW. Maybe I still won't BELIEVE you...but it'll hurt a hell of a lot less than bashing your head against a brick wall.   Verdict: 9/10.   (PS One definite NON-improvement is how HARD the tutorial in this game is to get your head around. It took me THREE attempts to get through the ♥♥♥♥ing thing. Sigh...maybe I just wanted an 'improved' version of the original, and not so much of a 'new' one...if it ain't that broke, don't fix it, etc etc...)",
            "review_score": "1"
        },
        {
            "review_text": "Faithful recreation of the board game",
            "review_score": "1"
        },
        {
            "review_text": "Finally a good warhammer 40k game that isn't DoW, this is a massive step up from the first space hulk which was basically just a direct copy of the board game to PC if thats your thing then by all means play the first game. However, do you want character customisation and levelling up? That actually makes your guys stand a chance against genestealers in cqb do you want to play more than one chapter ? do you want to play more than one campaign? Then this is definitely the space hulk game for you.  Now to talk about the disadvantages of this game it is a bit pricey I should know I paid for all the DLC as well anyway apart from this you may encounter some significant frame rate issues, Ive heard of people with ridiculously powerful PC's even have these problems and the game is not shy of glitches either, they arent really prominent and they patched over alot of them however Im still finding in game bugs (no pun intended) and glitches.  All in all a solid title for 40k definitely the space hulk game we have been waiting for.",
            "review_score": "1"
        },
        {
            "review_text": "Could not complete tutorial(!) mission #2 (Cut Off) due to bug. Went to Steam forum. Found out there are at least 18 unfixed bugs (Release Date: Nov 12, 2014; it is now 2016), many mission critical. Very disappointed!",
            "review_score": "-1"
        },
        {
            "review_text": "where the dark angels...",
            "review_score": "1"
        },
        {
            "review_text": "this is good and a huge improvement over the previous space hulk game so buy it i guess or don't i don't give a ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Tutorial is bugged - seems like a known problem that hasn't been fixed. Also seems like a rather average turn based streategy game - glad I bought it in the sale, I'd be furious if I paid full price! Since it was cheaper, I'm just disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "i loved this game great buy for a strategy. However it would be nice of it wasn't so buggy as i can no longer play it as it black scenes it after the opening cinematic.",
            "review_score": "-1"
        },
        {
            "review_text": "Not multiplayer. That was the best part of space hulk. Other than that good.",
            "review_score": "-1"
        },
        {
            "review_text": "Many things are broken in this game: - No matter the graphics settings, it runs at max. 25-30 fps. Using flamers make it even worst (with i7 @ 3.4Ghz, HD radeon 7900 series, latest drivers); - Couple of spelling mistakes here and there in the text - feels like the game has been rushed to release on time; - The sales speech talks about 3 chapters available when you actually have only 1 option: ultramarines. Blood Angles have nothing specific (boring) and don't even try to play Space Wolves, you would just get smashed on hand to hand combat (where they are supposed to excel...) and will spend countless hours reloading your game (even more boring); - A few bugs: overwatch fire not working when supposed to, terminator not 'seeing' the stealers when they are just in front of them, etc.  It's a pity, adding a RPG component to Space Hulk was actually promising.  A good advise, just save yourself a few bucks by not getting this game...  Cheers T.",
            "review_score": "-1"
        },
        {
            "review_text": "Outdated graphics, clunky interface. Buy the board game...it is amazing. This is a cheap knockoff that doesn't even look very good.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is worse than XCom in every possible way so I don't know who I'd recommend it to. And then even a die-hard GW fan wouldn't play it because of the desperately bad UI. Can't adjust the scroll speed and camera doesn't snap to someone being attacked. No indication of why you sometimes pay to turn a corner and sometimes don't. 80% of the screen is black and the rest is unreadable. Spawn points aren't marked, leading to immediate gruesome (well-animated) deaths. Even with the animation speed turned up (and you know they know the UI sucks when a popup appears in game with 'We know the UI sucks, can we turn up the animation speed for you?') the whole game is a pain to play. Go play XCom - Long War and actually have fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Highly recommended for anyone has been hooked on the board game as a teen and now is unable to defend spending hunderds of pounds to buy more xpacks in front of his wife. (much less convice her that stinking up the the house with revel colors and airbrush means 'quality family time' at weekends)  Gameplay wise this is quite reminiscent of Space Crusade (Milton Bradley) game released on PC and Amiga in 1990.  Controls are somewhat unnecesarily tedious, but if you are willing to chew thru the first couple of missions, you will be rewarded by challenging (although not as difficult as deathwing campaign in space hulk) but overally satisfying experience",
            "review_score": "1"
        },
        {
            "review_text": "I recommend the game mainly because I think that it delivers on what it is supposed to be. It brings back memories of earlier strategy games and can be difficult. Not be very familiar with the warhammer games, here is what I think could have been improved as a video game when compared to other stratey games.  1. Squad make up - you can't do much customization on the squad. You get a sargent or templar, a heavy and 3 soldiers. It would be nice to have a little more customization and flexibility. 2. Squad equipment - each squad member has set equipment. Coupled with the fixed squad make up, it lacks the ability to allow you to customize the individuals in the group. You get more options as you advance, but not enough to really differentiate the characters. 3. Maps - all of the maps take place on the space hulk ships. So they are all cooridoors with small rooms. It lacks a little variety. It would be nice to have high / low areas, open areas, cover, etc. 4. Grid - the map is built as squares so there are only 4 directions. This works because of the map layouts, but lack some of the flexibility that hex based map systems provide.",
            "review_score": "1"
        }
    ]
}