{
    "app_id": 318130,
    "name": "Doom & Destiny",
    "release_date": "2015-03-18",
    "developer": [
        "Heartbit Interactive"
    ],
    "publisher": [
        "Heartbit Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "RPGMaker"
    ],
    "achievements": 44,
    "positive_ratings": 1580,
    "negative_ratings": 54,
    "price": 6.99,
    "description": "Be ready for the nerdiest adventure of your life! Journey with four everyday friends into this turn based hilarious jrpg filled with parodies and cameos! Explore a huge fantasy world full of secrets, monsters, dungeons and preposterous villains! Nerds are storming fantasy and it's awesome!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/318130/header.jpg?t=1530711566",
    "minimum_requirements": "OS: Windows 7 Processor: 2.3 GHz Intel Core 2 Duo or better Memory: 1000 MB RAM Graphics: DirectX10 compatible GPU with at least 256MB of VRAM DirectX: Version 10 Storage: 200 MB available space",
    "recommended_requirements": "OS: Windows 8.1 Processor: 2.8 GHz Intel Core 2 Duo or better Memory: 1000 MB RAM Graphics: DirectX10 compatible GPU with at least 256MB of VRAM DirectX: Version 10 Storage: 1000 MB available space Additional Notes: Xbox 360 Controller",
    "reviews": [
        {
            "review_text": "You owe it to yourself to play this game. If you were ever into JRPGs and have a lot of appreciation for nerd/geek culture, you'll laugh your ♥♥♥ off while falling in love with Doom &amp; Destiny. It's one of the most enjoyable and entertaining games that I've played in the last few years.",
            "review_score": "1"
        },
        {
            "review_text": "Well worth the 3$ i payed for it",
            "review_score": "1"
        },
        {
            "review_text": "Fun and funny. Tongue in cheek humor. Great take on a classic genre",
            "review_score": "1"
        },
        {
            "review_text": "Hilariously awesome!",
            "review_score": "1"
        },
        {
            "review_text": "my gf loves this :)",
            "review_score": "1"
        },
        {
            "review_text": "It takes me back to a time of classic RPGs and reminds me of old DnD sessions with my buddies.",
            "review_score": "1"
        },
        {
            "review_text": "Really well made game, it's a solid jrpg filled with humour.  You get to play with 4 characters that have fixed classes, but with the power system you can go for different builds. So the Warrior can decide to go 'Paladin' by taking magical damage attacks (Smite Evil, Fire Sword,...), the Ninja can decide to go 'Monk' by taking fist attacks (Stunning Fist, Fist of the South Star,...) and so on. This allows for a bit of replayability if someone wants to try different builds.  The story (which is very good IMHO) isn't really hard to finish, but after the end you get the choice to keep playing for some late game challenges. This last part is a bit grindy (you need a lot of gold to buy the ultimate equipment and powers) but it's still still enjoyable. And you get to fight the Flying Spaghetti Monster.  The authors of this game are italians, so italian players might get one joke or two more than the others (loved the Rat-Man reference :D )  Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "great old school feel",
            "review_score": "1"
        },
        {
            "review_text": "Have you been starved for a rewarding RPg experience? This is it. Exploration is always a reward, to the point that you can 'grind' for better point *while searching for better things*. It's sad that such an idea needs to be revolutionary, but you'll always be interested in any task you're doing. The world will let you know when you've gone too far, but there are stackable rewards for your grinding when you decide to stay.  If hiliarious story, interactive combat, and depth of gameplay options appeal to you, then I honestly can't think of a better RPG on the market.  If you're not looking for those things, then, umm... what are you doing here?",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing on soooo many levels",
            "review_score": "1"
        },
        {
            "review_text": "eight year old me endorses the hell out of this game.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the old-school turn-base games like Final Fantasy or Dragon Quest but don't wish to pay the prices or want a new stpry this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "7/10",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't suck.",
            "review_score": "1"
        },
        {
            "review_text": "BUY THIS GAME! THIS IS ONE OF THE FUNNIEST GAMES I HAVE EVER PLAYED! EVEN MY NON GAMER WIFE LIKES IT!",
            "review_score": "1"
        },
        {
            "review_text": "This is my first JRPG ever and I am in love, it is so charming with humor, amazing art styla and great music. Tottaly worth buing",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played too much into it, but I find it to be something different to the norm for RPGs (what? You're playing as guys who play RPGS, in an RPG). I like it so far.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first time I play this kind of rpg and it suddendly captured my attention. The story, the dialogues and the characters are so immersive and funny that you can't stop playing it.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Short and simple, a charmingly written RPG that plays like a joyous little breeze. Recommended? Definitely.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great for all the people like me who don't need all the flashy flash of new games. This brings me back to all the great 8-bit greatness I grew up on.",
            "review_score": "1"
        },
        {
            "review_text": "Behind the humor and old-school graphics is a very enjoyable turn-based RPG that captures the fun combat of games like Final Fantasy and Dragon Warrior.",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive!",
            "review_score": "1"
        },
        {
            "review_text": "Really good game with fun character interaction, best RPG i've played in a while ",
            "review_score": "1"
        },
        {
            "review_text": "fun if a biut short rpg parody with dnd mechanics. Very fun",
            "review_score": "1"
        },
        {
            "review_text": "Great JRPG. Much better and funnier than i thought it would be.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting with the retro feel and inside jokes.",
            "review_score": "1"
        },
        {
            "review_text": "LOVE THIS GAME PLAY IT WHEN YOU CAN SRL JUST DO IT MF JUST DO IT it is really really really good and it is fun to so join in =3",
            "review_score": "1"
        },
        {
            "review_text": "10/10   would blow up all the chickens again",
            "review_score": "1"
        },
        {
            "review_text": "i ♥♥♥♥ing love this game  ",
            "review_score": "1"
        },
        {
            "review_text": "Entertaining game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! having a great time!",
            "review_score": "1"
        },
        {
            "review_text": "What happens if you took Final Fantasy and made it purposely made the most cliche plot ever AND was hilarious while still being super fun? This game.",
            "review_score": "1"
        },
        {
            "review_text": "Humorous turn-based RPG in the vein of the FF serie.",
            "review_score": "1"
        },
        {
            "review_text": "Was honestly not expecting a silly comedy game to have a surprisingly well done story with strong classical rpg mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgic fun and funny!",
            "review_score": "1"
        },
        {
            "review_text": "i do the witty humor is amusing the story is decent enough to keep you interested and the old school RPG feel is great",
            "review_score": "1"
        },
        {
            "review_text": "Fun old school RPG with lots of pop culture fun",
            "review_score": "1"
        },
        {
            "review_text": "i ♥♥♥♥ing love this game  ",
            "review_score": "1"
        },
        {
            "review_text": "Fun Game! Lots of laughs.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best tongue-in-cheek RPG I've played since Random Story. It's very aware of its origins, and constantly cracking jokes at itself and the genre as a whole. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Great JRPG. Much better and funnier than i thought it would be.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, solidly awesome",
            "review_score": "1"
        },
        {
            "review_text": "Totally recommend. Solid RPG with hilarious puns and extras. Good price for quite a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "The nostalgia is strong with this one.",
            "review_score": "1"
        },
        {
            "review_text": "You should select someone more apt to review it. I don't know, someone like Chuck Norris.  Nice game btw",
            "review_score": "1"
        },
        {
            "review_text": "Ignore my hours played, (I have this for Android)  I love this game. only issue is the graphics do not scale up to 1080 very well.",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilarious! And of course that means the story isn't boring at all.  Other than the story though this is a classic Party RPG. Because of the comedy value I would recommend it over something like Final Fantasy, but it doesn't really add anything game play wise.  The UI took a while to get used to, but that's my only complaint.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a hoot. Many people have tried to capture the fun of old school JRPG's and lots of people have tried to infuse such efforts with tongue-in-cheek humor, but Doom and Destiny actually does both. If you enjoy old school Final Fantasy or Dragon Warrior games, then you owe it to yourself to try this one.",
            "review_score": "1"
        },
        {
            "review_text": "I took a chance on it because it was on sale. I'm super glad I did, because It's just as much fun as the old school classics it resembles.   Great story, funny dialogue, huge world to explore at your leisure, tons of tricky secrets and side quests, customizable builds -- it's got everything. And it's at least part parody, so there are a lot of funny cameos, tropes, and music that sounds vaguely familiar... Haha. I love the self-referential humour and breaking of the fourth wall.  I was sad when I beat the 'final' boss because I didn't want the game to end, BUT IT DIDN'T! There are all kinds of brand new areas that become accessible in endgame. It's the gift that just keeps on giving.",
            "review_score": "1"
        },
        {
            "review_text": "Parodies &amp; jokes about pretty much everything, and is a lot of fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely wonderful and hilarious. I have spent many hours playing this on my computer and tablet. i keep coming back because it is relaxing and entertaining. i highly recommend getting this game if you can because you will definitely get your money's worth and then some.",
            "review_score": "1"
        },
        {
            "review_text": "nice old school action RPG",
            "review_score": "1"
        },
        {
            "review_text": "very nice game",
            "review_score": "1"
        },
        {
            "review_text": "Fun and funny. This game is a good old rpg with modern day humor.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game!",
            "review_score": "1"
        },
        {
            "review_text": "its pretty fun",
            "review_score": "1"
        },
        {
            "review_text": "A fun and very relatable turn-based RPG. Definitely recommend it to anyone who is a fan of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Cool RPG",
            "review_score": "1"
        },
        {
            "review_text": "Super good old school RPG and so much fun!",
            "review_score": "1"
        },
        {
            "review_text": "I played it. It was OK.",
            "review_score": "-1"
        }
    ]
}