{
    "app_id": 318230,
    "name": "Convoy",
    "release_date": "2015-04-21",
    "developer": [
        "Convoy Games"
    ],
    "publisher": [
        "Indietopia Games "
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Pixel Graphics",
        "Indie"
    ],
    "achievements": 29,
    "positive_ratings": 813,
    "negative_ratings": 212,
    "price": 9.99,
    "description": "Convoy is a tactical roguelike-like inspired by Mad Max and FTL in which you cross a wasteland in search of parts for your broken ship. Presented in pixel art and set in a future post-apocalyptic setting, Convoy is a squad based tactical combat roguelike-like in its core.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/318230/header.jpg?t=1545404123",
    "minimum_requirements": "OS: Windows XP+ Processor: Intel Pentium Dual Core T4400 2.2 GHz Memory: 2 GB RAM Graphics: DX9 (shader model 2.0) capabilities DirectX: Version 9.0 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a lot like FTL. You experience most of the same rogue-like antics, and it's really challenging. If you like FTl or just like Mad Max or even post-apocalyptic games, you will love this.",
            "review_score": "1"
        },
        {
            "review_text": " FTL's idiot cousin",
            "review_score": "-1"
        },
        {
            "review_text": "-Start game -Play on hard #Yolo -Get annihilated -Play on normal -Get annihilated -Play on easy -Get annihilated -Decide to flee from everyone -Gotta go fast -Too slow -Get annihilated -Get angry -Yolo across map to all main objectives -Out of fuel -Mechanic asks me if he can make bio-fuel out of the crew -No ♥♥♥♥ing way mechanic -Wait -Sees dust cloud -Army of Raiders with artillery incoming -Oh. Still had fuel left. Let's engage them -Get annihilated -69th try -Found car wreck. Got 230 bolts -Sees casino -Wins car, 130 bolts left -Doing well -Some guys ask me to transport their cargo -Kill everyone -Steal cargo -Cargo contains giant mega battle robot of death -Get annihilated -Quits game  10/10 would get annihilated again.",
            "review_score": "1"
        },
        {
            "review_text": "A really great game!   +Very nice pixel art +Cool story +Roguelike 2D mad max + FTL mix +Nice soundtrack +Challenging +YOU CAN SHOOT EVERYONE IN THE HEAD IF YOU DON'T WANT TO TALK WITH THEM!",
            "review_score": "1"
        },
        {
            "review_text": "After playing for some time and finish the game several times, i think it is time to write a review. The game itself is a rogue-like done well. Lots of random encounters, side missions and events. Various MCVs(your main vehicle), escort/combat cars to start with - which are unlocked by achievements or tasks in the game; weapons and utilities. Combat system is a Real-time with tactical pause, which feels simple and intuitive. Also, it has a couple of movie references, which i found real fun and entertaining.  Now, some details about basic mechanics(i won`t write about story or specific cars, so expect no spoilers).  All objectives and events starts as a text mini-game with several options, which affects gameplay directly. For example, you`ve met a crowd of people.  You can choose to:  - engage them in combat;  - just pass by; - persuade them to do what you need(in different situations), etc.  As i write above, combat is simple, but in a good way. Your MCV can`t move or attack, it only can use abilities(defensive/offensive/support). And if MCV is destroyed, you guessed it - game over. So you will depend on the escort cars to protect MCV most of the time. If you just shoot everything on sight, you will not succeed(unless you`ve got the best weapons and upgrades). Even then, you will need some tactics to achieve victory(blocking enemy shots with escort cars, using abilities depending on situation, etc.). As the game progresses enemies will be harder and better equipped, so you need to adapt your strategy. I don`t like to compare Convoy to FTL like many people do, because there`s nothing to compare, even if it 'inspired by Mad Max and FTL'. FTL have a lot MORE content and variety than Convoy and advanced mechanics if you ask me, but Convoy has its unique and beautiful charm. So if you enjoyed FTL or any other rogue-likes, you will enjoy Convoy. Thanks for attention and have a good day!  P.S. If you think that Convoy don`t have much content and you feel enthusiastic, you can create your own! Game has a ConvoyEditor(based on Unity) that can be used to create new units, scenarios and even voicelines!",
            "review_score": "1"
        },
        {
            "review_text": "The theme really takes it for this game! If you like Mad Max then it's a done deal! The gameplay is a lot of fun with pretty well fleshed out factions and story lines. Playing to the steam acheivements helps to provide extra replay value.  The combat system works really well imo, Protecting your MCV without losing your support is challenging and the limited units prevents a perfect defense, making it a race against time. It's fun pushing enemies off of a bridge and devestating when one of your precious cars slams into a pole when you were not looking. The overmap isn't the most aestetically pleasing but that wasn't really an issue.  It's a fun, arcady game!",
            "review_score": "1"
        },
        {
            "review_text": "Well Im posting this review after ive defeated the unbeatable boss. Turns out it was a lie!!! It all started with me winning a ship from a game show. His name monty and he was a keeper just like my 2 starting veichles. Next i get totally lucky and find 1111 scrap. Used some heavy beam lasers won from a kjl convoy that gave me 400 scrap and 3 of the buggers and there is still more game to play. Best Game ever! Fanboy 4 Lyfe.  10/10 ~ Lord Gaben  P.S. If you like this youll love ftl.",
            "review_score": "1"
        },
        {
            "review_text": "Take FTL. Make it non-linear. Now give it a Mad Max setting. Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "I was one of the alpha backers for the kick starter (I have a lot more offline hours than it shows) and I've loved this game since I first played it. I recommend this for anyone that loves strategy games, FTL and destroying your keyboard in a fit of rage when your newly kitted out vehicle drives right over the edge of a cliff because you weren't paying attention. ",
            "review_score": "1"
        },
        {
            "review_text": "Great game.  The core madmax inspired, combat gameplay is very satisfying. The strategy map, multiple choice story elements and the car customization layers are not as satisfying. The difficulty progression triggers feel odd too. However, everything works well together and focuses toward the game's strength: the tactical combat. Very much an FTL-like game.",
            "review_score": "1"
        },
        {
            "review_text": "Ugh too many game breaking bugs.   Had the main quest line permantely break on me twice, which sucks as its a fun game. Let this one cook a bit and maybe they will fix it. For now avoid this or just get it only on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Far too easy, you climb to overpower until you complete the quests and the cheato final boss with cheap doomsday weapons you've never seen in the whole game appears. Blow all his weapons without really much problems and you'll face the laser that 1-hits your maxed vehicles.  Pfff...  Could do with some additional work in the world map and minor details, but it's ok if you bought it on sale. Don't see myself coming back, anyway. It's a pity, I love vehicular combat.",
            "review_score": "1"
        },
        {
            "review_text": "Convoy is very profoundly OK. It's not great. There's a point where you're 'working things out' and a point where you feel like 'things should have been explained better'.  If you think that FTL should have been based in the Mad Max desert, and that there wasn't enough variety of weapon and explosion noises, then you'll probably enjoy Convoy. It's different, and with a ton more polish, it could be great. I played it for a few hours while suffering from insomnia, and I knew what I was in for. I got what I was expecting. If you're good at games, save it for when you've got a severe hangover, and you're looking for something that's highly repetitive, but not completely repetitive.",
            "review_score": "1"
        },
        {
            "review_text": "A very interesting concept. Difficulty is really hard, but easer than FTL. A must have in your library.  Ign rates 10/10 would run out of fuel again.",
            "review_score": "1"
        },
        {
            "review_text": "Initially, I ended up with a Not Recommended for this game. The devs have addressed some of the issues since then, and since that did affect some of my grievances, I am confortable with recommending this now.  When you hear this is similar to FTL, think 'vaguely similar'. It has equipment management, it has general storyline, it has bosses, it has unlocks. What is different: * This game is significantly different in 'easy to learn, hard to master' area, because it's harder to learn, and, being open-world and all that, is somewhat easier to master... on Easy difficulty at least. * Time pressing isn't really pressing, so you can farm. The game does gets tougher the tougher you are, but you can still hang around the camp and repair after each combat. * Backtracking. You will do a lot, but that's rogue-like open world to you.  What will ♥♥♥♥ you off early on: * UI and controls. Especially vehicle behaviour early on. Hint: invest in vehicle handling. * Different outcomes for the same decisions. Hint: deal with it, it's the designer having fun with you. * Boss difficulty. Hint: try to drop your starter cars for something tougher. * Endless cultural references with next to no original writing. No remedy for that, guys.  What you should look forward to: * Multiple 'Hell, Yeah's as you build up, one-shot enemies, hit everyone with a single missile or push a foe into a rock face. * Flexible difficulty * Unlocks that actually matter * Solid replayability.",
            "review_score": "1"
        },
        {
            "review_text": "*insert reviewing cliche here*  But seriously, I love this game for its excellent RTS combat, perfect difficulty balancing, good humor, and ridiculous number of just obscure enough references.  *another cliche, for good measure*  P.S. There is a steep learning curve at the beginning, but it doesn't last that long.",
            "review_score": "1"
        },
        {
            "review_text": "For years now I've been looking for a game that somewhat related to FTL, and if this game doesnt surpass FTL for you, it'll atleast compare equally. This game is quite strategic and has some brutal punishments if you make even the slightest mistake XD. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "It's all about protecting the Convoy so you can get the necessaries pieces of the ship and GTFO.  This is game ♥♥♥♥in amazing, i had a lot of fun with it, i already beated it on Easy, Medium and Hard.  The game might seem like hard at first but once you understand the game patterns it gets fairly easy.  The only downside is that the number of events are so small, and after u played it like 3~5 times it gets pretty easy to know what is the best decision for each scenario, which means the game should have been made with many more situations, i say 3x times more, other than that is a pretty fun game and worth the money, looking forward for the next products of these developers.  Music is 8/10 Gameplay 9/10 Replayability 0/5 Story is 7/10   Overall i say 8\\10.",
            "review_score": "1"
        },
        {
            "review_text": "Convoy is basically a retro strategy version of Madmax. When I saw the kickstarter I was a little intimidated by the seeming complexity of interface, but I found it simple to jump in and start playing. Most of what needed to be figured out I was able to get a handle on in the first 20 minutes. While the game starts off being mostly resource management, it quickly switches gears to exploration and powering up your convoy about midway through your first playthrough.  The graphics are a bit lackluster and they don’t really get across the wild atmosphere the rest of the game is striving for. The grayscale hex based landscape feels more like you are exploring a desolate moon rather than the psycho-punk desert wasteland described in the text.  Speaking of which, while I hate reading walls of text, they weren’t a problem here. Most of the text is short and to the point.  Total playtime will run you maybe 6 hours to beating it on easy, and 30 hours to completing most of the challenges. No bugs to speak of.   Final Grade: B+  Similar games: Pirates!, FTL, Weird Worlds, Wasteland ",
            "review_score": "1"
        },
        {
            "review_text": "It's missing the depth, polish, difficulty, variety and excitement of FTL. It's repetitive and small. It's neither tactical nor a rogue-like. Dialogue choices exist that are insta-lose. Combat quickly becomes a repetitive slog, and equipment progresses linearly: you simply buy the better item.  It feels like there are so many missed opportunities. Why does my convoy begin every fight in the formation I ended the last one in? I've driven forty kilometres--we couldn't have gotten back into a formation of my choosing? Why can't I control my mcv's movement? It's a car with a driver, so how about letting me drive the thing? How do you develop a vehicular combat game and not include manoeuvrability-reducing effects?  But it's still a lot of fun. If you're told 'it's an FTL clone with cars and a tenth of the content' and still want to play that? You'll get exactly what you expected.",
            "review_score": "1"
        },
        {
            "review_text": "It's really good  Pros: Intense &amp; strategic combat Freedom of exploration with classic-Fallout style overworld A roguelike game that doesn't screw you over as much as other roguelikes (I consider this a plus, dunno about you) Great for fans of FTL  Cons: Massive difficulty spike (you will know what I'm talking about) UI sometimes a little clunky  8/10  TL;DR: It's good.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like FTL? You'll love this game. Do you like explosions? You'll love this game. Do you love big guns? You'll love this game.  Your ship explodes and you need to repair it by finding certain parts scattered around the planet. It's up to your convoy to transport those parts back to your ship!  You'll find yourself surrounded by bloodthirsty pirates, a technology hungry company, and a money grubbing band of thieves. Random encounters and sidequests galore, you'll find yourself laughing, and cursing up a storm at what happens.  I played a game of chess with some pirates and gained 700 bolts! I rescued a turkey and got a car! The fun is endless.  Highly recommend so far.",
            "review_score": "1"
        },
        {
            "review_text": "A must have for FTL fans!  (I personally believe this game is better than FTL)",
            "review_score": "1"
        },
        {
            "review_text": "Yes it is ftl meets mad max at that is AMAZING",
            "review_score": "1"
        },
        {
            "review_text": "this game in a whole like gamplay is a smige like ftl but alot of things are different there are 3 factions priveteers (yaah me hearty)the raiders whe seem alot like emos on my part as they enjoy death and such and T.O.R.V.A.K(fallouts brotherhood of steel but alot less ♥♥♥♥♥♥♥ed freindly) there like that quiet guy who dosent talk much. the actual gameplay is unlike ftl you get a some cars and must upgrade them and buy new ones ( hence the name convoy) youve got to aim guns and move the vheicles in to range and ram the into some rock evrey now and then just for good mesure i sandwiched a guy beteen two cars once they were beating him up so much fun and random events like you are ambushed or there is an ambush so ambush the guys at the ambush so much logick or you find some slavers who say what the **** you want all in all a good game and i reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun another instant classic.",
            "review_score": "1"
        },
        {
            "review_text": "When beating the game on normal, the MCV didn't unlock for the achievement for beating it on mdeium mode.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Shipbreakers at all, you should be playing this right now.",
            "review_score": "1"
        },
        {
            "review_text": "FTL meets Mad Max. Absolutely incredible.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and brutal! FTL all over again in all the right ways, with a great tactical battle-system to boot.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games ever.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for a great price. Fans of FTL, Mad Max, or indie games in general should check it out.",
            "review_score": "1"
        },
        {
            "review_text": "I love it.  Story is great Gameplay is new Full car nudity",
            "review_score": "1"
        },
        {
            "review_text": "For those looking for a spiritual successor to FTL, this isn't quite it. It has a very similar feel, but is in the end, it's own beast.  Where in FTL, you had little control over what you find, system to system, sector to sector, while actual combat was very precise, Convoy is almost the inverse. You'll find travelling around the map, you have clear destinations for main and side quests. You'll also be able to stall the big fight at the end and build up a stronger convoy for it (with a moderate amount of focus so that you dont &gt;lose&lt; strength in that time. Individual combats, however, are a bit more chaotic. Instead of managing power and fire, you'll be managing targets, positioning, and LoS.  If you enjoyed FTL, but are looking for something a little more PEW heavy, and a little lighter on the text, convoy will suite nicely",
            "review_score": "1"
        },
        {
            "review_text": "The description of 'Mad Max meets FTL' is accurate - this game felt very much like the awesome FTL but with more freedom to choose my path as my convoy trundled along the desert wastes. There are a bazillion pop-culture references which add a sense of humour but also detract slightly from the consistency of the world, and the randomness can work both for and against you - I died very quickly on my first attempt but on my second I managed to win a drone in a 'guess what's behind the door' puzzle which allowed me to destroy everything I met for the rest of the game... but I doubt I'll be so lucky if I have a third attempt. For now, I'm going to move onto the other zillion games in my Steam library and if I feel the urge for a sci-fi tactical rogue-like... then I'll play FTL instead. Also, some of the language and scenes in the game made it very unsuitable for small children (which wasn't immediately obvious) - shame, because if those weren't in it the playing audience would be much bigger.",
            "review_score": "-1"
        },
        {
            "review_text": "The description of FTL meets Mad Max is fairly accurate. It's very light-weight, and controls are a bit finicky, but still is a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "FTL and Mad Max's beautiful love child",
            "review_score": "1"
        },
        {
            "review_text": "great game, ive wished for a ftl 2 for years, and here it is ",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to Convoy, where even the Easy difficulty doesn't save you! Seriously, when they said FTL and Mad Max they were wrong. There are random events both marked on map and while driving called, 'Scenarios.' These things can make your day or even destroy it. Thankfully, the frustration you go through can eventually pay off with the numerous things to unlock. Your main convoy vehicle (MCV) can be changed if you unlock the others. There are also many escort vehicles to unlock as well.   Like FTL it is imperative that you spend your money wisely. You may need it for certain encounters. That being said, it's a good game. I personally could do without the stale pop culture references, but I can't be bothered to whine about 9♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "A lot like FTL, I can see myself playing this a lot even though the game is pretty brutal in the early stages.",
            "review_score": "1"
        },
        {
            "review_text": "i dont understand it. I love FTL, i played so mutch either i cant see it. And now? no other games like FTL are alife?  Hell yes! i found one which is made like FTL. and this is ♥♥♥♥ing awesome!! i dont understand that peopel that always hate games like these cause they 'copyed' from FTL. So ♥♥♥♥ing stupid to give a great game a negativ rating! be happy that other developers do games , like this genre for players to have more games to choose!!!  And why are peopel cant be happy about sutch things?  Im happy i find convoy. Convoy is the Brother of FTL but not in space, its on earth. you travel with youre 'truck' and youre buddys. Many upgrades. New gameplay like crashing /bumping enemy cars into objects to destroy them. In my opinion a great game.  Peopel that like MAD MAX Fury road and FTL, They will love this game to, maybe as mutch as FTL.",
            "review_score": "1"
        },
        {
            "review_text": "I really thought I'd like Convoy. It looked, as it says, like 'FTL except with armored trucks.' I found it perplexing, though. I was almost never sure what I was doing, the tutorial was quite minimal, and there's no in-game help. The basic starter gameplay isn't fun enough to keep me playing repeatedly to figure things out. I'm moving on.",
            "review_score": "-1"
        },
        {
            "review_text": "Game was fun till the last boss. At least in FTL you usually have a chance. In Convoy if you don't have the perfect group, which is random what you can find in the game, then you have zero chance of winning.",
            "review_score": "-1"
        },
        {
            "review_text": "I could have liked this game if it had a normal save load game option. After 2 hours it's kind of a drag to have the caravan slaughtered...",
            "review_score": "-1"
        },
        {
            "review_text": "'FTL is difficult'. Heh... thats cute.",
            "review_score": "1"
        },
        {
            "review_text": "This game looked a lot cooler and then I played it. Imagine a bad straight forward and boring FTL.",
            "review_score": "-1"
        },
        {
            "review_text": "  'It's like FTL!'   - Every promotional description and review of this game   'It's not like FTL.'   - Me when I filled out my refund request with Steam Support",
            "review_score": "-1"
        },
        {
            "review_text": "My impressions after the first hour: 1. 2D graphics retro-style, not dated-style. 2. Nice music and sound. 3. The game does a good job at telling you where to go. 4. You will have to invest a bunch of hours into learning the game.  I don't know why people compare it to FTL; the gameplay is somewhat similar but I never had the feeling I'm playing anything like FTL. That does not make the game less enjoyable on its own merit.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game! It's got nothing on FTL but still worth the money... I think...",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, it is replayable and you unlock new stuff. I'd recommend it if you wanna play a text based and attack based combo, I would recommend you buy it",
            "review_score": "1"
        },
        {
            "review_text": "If you liked FTL this is a great game. Your spaceship crashed and you need to travel around and battle bad guys to get parts to fix it. You even have a lil' convoy of warvehicles to protect your mobile base as you look for parts. Fun game with lots of nerdy references and hell, the voices for the vehicles come from Command and Conquer.   However, nothing makes me want to rage quit and uninstall faster than spending an entire evening failing and starting over then finally getting all four major parts- having the final boss show up and ♥♥♥♥ up your convoy like they're paper mache and then you've got to wait five minutes while it blows up your mobile base.",
            "review_score": "1"
        },
        {
            "review_text": "Good and fun game. Would love to have more content though. After a few playthroughs I've seen most of the scenarios and can clearly identify conversation patterns.",
            "review_score": "1"
        },
        {
            "review_text": "Dirty little mad max for indie lovers",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, it's like it saids. ftl mixed with whatever. not mad max however but something where you're in a car that shoots itself. the FTL part is where you just pause and decide where they go.   Favorite part about that is trapping their ♥♥♥♥♥ ♥♥♥ in a corner to hit a wall and die in a horrible explosion so that way I have a huge chance of winning, even know that causes (hype) damage but so worth it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun title with a fair amount of replay value, and it gives you exactly what the package says. I've enjoyed it a lot, and I hope to see more similarly nice products in the future from these guys.",
            "review_score": "1"
        },
        {
            "review_text": "Nice little Rouge-Like. Very much reminds me of FTL, which isn't a bad thing. If you liked FTL, pick this up!",
            "review_score": "1"
        },
        {
            "review_text": "Addicted GG",
            "review_score": "1"
        }
    ]
}