{
    "app_id": 318350,
    "name": "Disney Fairies: Tinker Bell's Adventure",
    "release_date": "2014-10-06",
    "developer": [
        "Gamestar"
    ],
    "publisher": [
        "Disney Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Family Friendly"
    ],
    "achievements": 0,
    "positive_ratings": 16,
    "negative_ratings": 15,
    "price": 15.49,
    "description": "Play as Tinker Bell, Iridessa, Silvermist, Fawn and Rosetta as you take on this exciting adventure. Fans will be able to enter a world inhabited by these magical characters and discover the secrets of Pixie Hollow.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/318350/header.jpg?t=1542761863",
    "minimum_requirements": "OS: Microsoft Windows Vista SP2/ XP SP3/ Windows 7 Processor: 2000 MHz Memory: 1 GB RAM Graphics: 128MB Nvidia GeForce 6600/ATI Radeon X1300 Video Card DirectX: Version 9.0c Storage: 512 MB available space Sound Card: DirectX 9.0c Compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "My 5 year old loves this game, i sit with her, narate what they say and we have a good father daughter time. But it does kill me a little inside when i tell her 'Watch out for the Thorns' she just goes right into it. .. !!!! ...",
            "review_score": "1"
        },
        {
            "review_text": "I loved Tinkerbell as a kid and even as a child molester I still do. This game was created more-so for children, however any adult with a pulse in there pants, that's a Disney fan and loves Tinkerbell as much as I do in her skimpy little cute green dress I'd highly recommend this title.   It might be simplistic, but playing a game with your favorite characters from Disney movies and/or TV shows can be very relaxing and enjoyable I personally have only went on Rule34 as an adult when looking at Disney characters but this game does just as good if not better.",
            "review_score": "1"
        }
    ]
}