{
    "app_id": 318480,
    "name": "Burnstar",
    "release_date": "2015-03-18",
    "developer": [
        "Nerve Software LLC"
    ],
    "publisher": [
        "Nerve Software LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Action",
        "Indie",
        "Local Co-Op"
    ],
    "achievements": 24,
    "positive_ratings": 41,
    "negative_ratings": 3,
    "price": 3.99,
    "description": "Burnstar is a challenging, fast paced action-puzzle game that puts both your brains and your finger-brains to the test! Use explosives to incinerate the worksites and installations of Evil Inc. Blaze your own trail, or play Co-op for some friendly fire!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/318480/header.jpg?t=1447363174",
    "minimum_requirements": "OS: Microsoft® Windows® Vista / 7 / 8 Processor: 1.4 GHz or faster Memory: 2 GB RAM DirectX: Version 9.0c Storage: 1100 MB available space Additional Notes: Microsoft Xbox 360 Controller or XInput compatible controller",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I normally don't like puzzle games, but I sat down with Burnstar and really got into it.  It does have a slight Bomber man thing going, but aside from placing bombs and being more or less gridlike it's very different than the classic game.  Your goal is to spread fire throughout a level as thoroughly as possible while using the least amount of the explosives that each level gives for your disposal. But fire spreads in a very distinct way. Big objects spread fire further and light smaller objects on fire. Smaller boxes have a harder time lighting bigger boxes but there are exceptions that you have to learn and be aware of. This isn't the exact best explanation but that's part of the 'puzzle' so I'll let you figure the rest out.  But while you walk around the level you're trying to assess the best way to spread fires throughout because the number of tools you have to start fires are limited. As you get further into the game you're going to have to do the above without dying from various level hazards, and that's when I really think it pulled me in. Light all this stuff on fire in the most controllled and fast way possible, but also don't die. (There's a really quick level restart button so failure feels like failure, but you're back in it before you've really gotten down on yourself.)  Other stuff....There are four characters to choose from and each one has a unique ability, but honestly I just end up playing Burnstar because well...he's really fast and I like to go fast even if it means I die a lot.  Oh, there's actually a surprising amount of content here. The whole game has the like...I just bought an old N64 game feel where there's actually a ton of content shipped with the game..I guess what I'm trying to say is it feels complete. I've put quite a few hours in and I haven't even beat it yet. You have to work your way through all these worlds Mario style and I can't really remember how many more I have to go.",
            "review_score": "1"
        },
        {
            "review_text": "As a long time Bomberman fan, and lover of puzzle games alike, I absolutely loved this game! Especially with the new updated music. This is my favorite game on Steam right now. This is the perfect evolution for the Bomberman franchise and as far as I'm concerned, this game takes place in the same world of Bomberman, just in the distant future, and Burnstar is a decendent of Bomberman himself! (I'm a dreamer)  Good work Nerve Soft! You've garnered the respect of a starving community.  PLAY THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "  It was a very nice game overall. I was interested by the different challenges that were created to make a unique complex game in one. The little story seemed like there was a certain objective I had to complete in order to finish this game.  So it was a very nice game!",
            "review_score": "1"
        },
        {
            "review_text": ".          YouTube™ Video:  Burnstar - Gameplay&nbsp;",
            "review_score": "1"
        }
    ]
}