{
    "app_id": 318530,
    "name": "Wings of Vi",
    "release_date": "2014-11-28",
    "developer": [
        "Grynsoft"
    ],
    "publisher": [
        "Grynsoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Stats"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Difficult",
        "Platformer",
        "Female Protagonist"
    ],
    "achievements": 40,
    "positive_ratings": 826,
    "negative_ratings": 156,
    "price": 10.99,
    "description": "Wings of Vi is a challenging 2D platformer in which the player controls the angel Vi, tasked with defeating the Demon Lord Jeh’oul after he is freed from captivity. While inspired by masochistic retro platformers, Wings of Vi aims to cut out arbitrary difficulty in favor of skill based gameplay.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/318530/header.jpg?t=1447363183",
    "minimum_requirements": "最低配備: 作業系統: Windows XP or later 處理器: Pentium 4 or higher 記憶體: 256 MB 記憶體 顯示卡: 256 MB or higher DirectX: 版本：9.0 儲存空間: 80 MB 可用空間 音效卡: Any",
    "recommended_requirements": "建議配備: 作業系統: Windows 7 or later 記憶體: 1 GB 記憶體 DirectX: 版本：10",
    "reviews": [
        {
            "review_text": "After 20 hours of playtime I finally beat the game on mortal mode and I've gotta say, it's easily one of my favorite platformers to this day.  Difficult platforming and awesome bosses, just the way I like it. If you're looking for an even bigger challenge there's also demon mode for your masochistic needs. I'll definitely be doing a second playthrough on demon mode aswell as speedrun the entirety of it on mortal mode.  There's about twenty and a half billion secrets in the game for character customisation. You can make your angel look like a demon, cat, bunny etc.  Can't stop playing this great game, and for such a low price? Why would you not buy it.",
            "review_score": "1"
        },
        {
            "review_text": " I Wanna Be The Megaman: Cave Storyvania ",
            "review_score": "1"
        },
        {
            "review_text": "Great platforming with well designed challenging bosses. If you want something tough to beat, this is your game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game for old-style platformer lovers who enjoy a challenge, one of my best Steam purchases. This game is definitely not for quitters, it offers a very good challenge (i.e. you will die often, but restarting is fast and save points are frequent). Graphics are good, controls are excellent, replay value is absolutely outstanding thanks to the various difficulty levels and modifiers (and leaderboard). Became totally obsessed with this game, simply love it!!",
            "review_score": "1"
        },
        {
            "review_text": "I think it is my new favorite game! &lt;3 The best spent 15€ in my life so far :P  Pros: +pleasent pixel graphics +beautiful characters' desing +hilarious OST +awesome and difficult challenge +great mechanics +lots of secrets to find +character's customization +tons of rages - good rages of course +A little and cute Boshy can follow me ^3^ ('It's Boshy Time!' all the way) +Rubi's so hot ( ͡° ͜ʖ ͡°)  Cons: -I guess this game has no cons actually, really, everyting is so best! -Maybe the price is a bit too high, but it was TOTALLY worth it!  I can easily give 10/10, super recommended!  ",
            "review_score": "1"
        },
        {
            "review_text": "If you consider yourself a hardcore gamer, you're obligated to play this. If you can't beat it on at least Mortal before giving up in frustration, your 'hardcore' card is officially revoked.  Don't let the angel boobs, gorgeous retro graphics, or lighthearted-yet-awesome soundtrack fool you. This is easily the most difficult game I've ever played, and yet it manages to still be fair while being ridiculously hard. I've seen piles of angry rants about how stupidly unfair this game is and how Solgryn needs to die in a fire or something for being a terrible developer... and yet there are plenty of speedrunners out there who can beat it with double-digit deaths or fewer.  No, this game isn't 'cheap' or 'unfair'. You're just BAD. And you're going to stay bad until you bite the bullet and pick up that controller (trust me, you want a controller) and start grinding away at the cursed castle in the sky until you figure out how to navigate all the flying demons and mounted chompers that seem to exist solely to make your gaming life miserable, then manage to execute the precise series of jumps and flutters that will get you from point A to point B without being devoured.  The first thing you'll notice is that this isn't one of those games that's nice to people who mess up. Sure, you can take a few hits from the enemies (even fewer on Demon mode), but fall into a chomper pit or black hole or even just jump-flutter instead of flutter-jump and you're instantly dead.  (Unless you're playing on Angel mode. You wimp.)  You're probably used to games that only kill you if you do something seriously wrong. This isn't one of those games. Even the simplest of platforming errors will get you sent back to the nearest checkpoint, which become scarcer and scarcer the higher you crank the difficulty. Speaking of checkpoints, they do fully heal you, but only if you aren't tagging the same one you just tagged. No 'move forward, kill an enemy, go back to heal, repeat' nonsense here.  If you can survive the dastardly gauntlet of jumps and flutters and flying demons long enough, you'll get to try your hand at one of the several boss battles this game has to offer. Bosses in this game are incredibly well-done. You'll employ the same grinding away until you learn the pattern, then grinding again until you manage to execute the moves you need to execute in order to survive the varied attacks and whittle the bosses' health down... and then you hit the 40% health mark and the boss gets angry and the next attack wrecks you. Back to square one!  Some bosses are more focused on this repetitive grinding to defeat, whereas others are more RNG-based. The RNG ones are probably my least favorite, mainly because the sense of progress you get from learning the grindy bosses' patterns and seeing their health bars get lower and lower with each successive attempt isn't there when your progress on a boss is mainly determined by how long it takes for the boss to hit you with an unavoidable attack pattern... even though you'll quickly find that most unavoidable attack patterns stop being unavoidable as soon as you stop being BAD. Only a few truly unavoidable patterns exist in this game, and they're rare enough that if they do screw you over, you'll get another 10 tries or so at least before they happen again. Hopefully you'll beat the boss by then.  There isn't much of a story, but then again, this isn't exactly the kind of game you play for the story. It's the kind of story where you'll watch the cutscenes the first time through, go 'oh, cool', then skip on every playthrough after the first.  The graphics are great. If you're a fan of the 16-bit style, you'll love Wings of Vi, and even if you aren't, you'll probably still be able to admit that its graphical presentation is of pretty good quality.  The soundtrack is done in the same 16-bit style as the graphics, and is equally impressive. You can buy the whole thing on the developer's website if you want, and IMO it's worth the purchase as far as video game OSTs go.  Overall score: 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Oh wow it is hard. But when you finally beat that part that killed you 100 times it is the best moment in the world. I love this game so much.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games. Love the customization and with lots of practice, the results are satisfying. I can beat the game in about 1H40M",
            "review_score": "1"
        },
        {
            "review_text": "What's that? You say Dark Souls is hard? That's adorable.",
            "review_score": "1"
        },
        {
            "review_text": "Play the demo to know what to be prepared for, the game is mostly skill based but a few bosses require a minor, yet relevant amount of luck to defeat in a timely manner (Death is inevitable). When I purchased this game the demo did not exist, but I was still excited for the 'Cheesy' puzzles that quite simply require speed and observation.  Really, its a great game, but from my experience, which of course is the most relevant part, the great amount of deaths definatly outweigh the few successes so far. I say far, because I have yet to complete the game for as long as I have owned the product.  All in all, none of my words matter, just be sure to play the demo if you want to buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing and anyone who things otherwise can be eated by satan",
            "review_score": "1"
        },
        {
            "review_text": "Alright. Let's try this.  Review of Wings of Vi",
            "review_score": "1"
        },
        {
            "review_text": "I honeslty feel I have stolkholm syndrome towards this game. I'm 80% done and nearing the end. I've restarted this game a few times whenever I took a long break so I wouldn't feel my skills fading and when my file corrupted, that felt crushing. However, I went back to it and I made more progress and beyond from that point and i've taken steps to prevent that from happening again. However, knowing that i'm nearing the end.... I feel a bit sad. Not at the game, but that i'm finally going to beat it and never touch this gem of a game afterwards. I've had this game in my library since around the day it came out and it's been on hell of a ride with it. If you like masochistic games, then this is the one. The platforming is very difficult, but if that's what you like, this game is for you. The music is quite soothing, the voice acting is good where it is, and the mechanics are fun. The animations are very good and the secrets you unlock while not so helpful, are cute. I think this is a fine game and even casual gamers should give a go at this game.",
            "review_score": "1"
        },
        {
            "review_text": "I discovered this developer because of my interest in IWBTB at AGDQ. Plain and simple this is an AMAZING game. It is extremely difficult but it is extremely well made. You will die, thousands of times but when you finally beat that boss, the feeling of satisfaction is unparalled. The platforming is very challenging- but fun and (mostly) fair.  The SNES style graphics are flawless, I would have spent significantly more on this game (Solgryn is a true artist in many aspects). I actually enjoyed it so much I purchased copies for a number of people who I wanted to spread my love of this game with. I highly advise anybody who enjoys video games buy and play this. You owe it to yourself as a gamer.  I have beat the game twice (so far) and completed the boss rush recently. I will be coming back for more. I've never enjoyed any boss fights in any game ever and I've been a gamer for almost 20 years  I was watching YouTube reviews for this game and I heard something that I feel explains it perfectly: 'This game was clearly made by someone who loves video games.'  Solgryn/Grynsoft is an extremely talented video game developer and very involved with the community and his fans. I'm on the edge of my seat waiting for his next game to be revealed.  I played it with the Steam controller and 'Flutter' mapped to the Right Trigger, I'd recommend the same, or use a keyboard. Some people live the Xbox One controller but I think it's a bit wrong for this particular game.  Buy this, you (probably) won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "A challenge indeed and if it's not enough it's diffrent difficulties and challenges. Art is beautiful. The game will make you rip your hair off a few times, worth picking up!",
            "review_score": "1"
        },
        {
            "review_text": "This game takes the idea of a hard 2D side-scroller to the next level. It was inspired by Cave Story and Castlevania, and if you like either of those games you will surely like this, that is if you can handle the difficulty. Wings of Vi has a stellar sound track that really sets the tone for the game.  In the game you must face many twisted demonic beings. There are some very difficult bosses as well as brutal platforming sections. The controls are tight and it is satisfying when you complete a difficult platforming section. There are a ton of unlockable cosmetic items to be found and earned as you play through the game, this includes companions that mirror your actions one step behind you (such as Boshy!). There are also several different weapons to be discovered along the way. If you are a fan of action based 2D side-scrollers and can handle the difficulty then   --this is a great game to pick up.",
            "review_score": "1"
        },
        {
            "review_text": "One word AMAZING. The challegne in this game is unreal which may seem like a negative but believe me it's not. Even though I have lost saves and had to restart on 2 occassions (Due to my computer not the game) I have always come back to it due to the insane amount of enjoyment that comes from it.  At $15 US I would suggest buying it now, don't worry about waiting for the price to drop further this price is worth it.",
            "review_score": "1"
        },
        {
            "review_text": "A charming little masochistic platformer. Seemingly simple controls and mechanics are manipulated in such a way so that each section proves to be a new challenge. You'll be confused, you'll be frustrated, you'll wonder why you even decided to put yourself through this, but the sense of accomplishment is ever so strong at the end. Definitely an enjoyable game, but certainly not an easy one.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful Game. Beautiful Soundtrack. Beautiful Gameplay. Beautiful Boobs.  Seriously, this game is awesome",
            "review_score": "1"
        },
        {
            "review_text": "Gave up after the first level. 10/10 would rage again.",
            "review_score": "1"
        },
        {
            "review_text": "Really well made and fun game !",
            "review_score": "1"
        },
        {
            "review_text": "It's punishing, but fair. Built in the same spirit of those old 'nintendo-hard' games but without the cheap tactics and unfair/random kills this game really improves on a style of game that we all simultaneously loved and hated.  Things of note:  - The visuals are incredibly appealing. - The story is simple but cheeky and fun. - The difficulty is high, but surmountable with practice (and/or luck). - There's plenty of secrets for folks to search around for. - A bit of customization to the character's appearance for those who like to look fabulous. - It will probably make more people sport the same fabulous hairstyle as myself out of frustration. - My thumbs were sore for hours after each play session.",
            "review_score": "1"
        },
        {
            "review_text": "i smashed me keyboard. 0/10 had to get new keyboard",
            "review_score": "1"
        },
        {
            "review_text": "Makes me want to kill myself with how hard the difficulty is, but I play it for the tiddies. 10/10 would tell people to play it. There are easier difficulties, but I refuse for pride's sake.",
            "review_score": "1"
        },
        {
            "review_text": "A waifu dress up simulator where you will kill your waifu over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over, and over again. Good game.",
            "review_score": "1"
        },
        {
            "review_text": "tremely difficult. But also just as fun.  Wings of Vi contains the concentrated essence of what a platformer is.  Precision platforming: pixel-perfect, frame-perfect.  And before you get convinced of the 'I Wanna Be The Guy' or 'I Wanna Be The Boshy' comparisions, Wings of Vi is nothing like them.  I cannot stress this enough, while Wings of Vi is difficult, most importantly it is also FAIR. No gravity-defying insta-death apples or weird off-screen screaming traps, every obstacle is shown in advance, nothing comes off from nowhere. Even better, in certain screens there are many hazards ahead that you will encounter mid-jumps, the game has a special mechanic that allows you to look/spectate them ahead of time, as many times as you want until you successfuly plot a mental path.  If you die, it's on you.  If you're looking for a challenge in platforming, this game is the best one for you.  ",
            "review_score": "1"
        },
        {
            "review_text": "I got ♥♥♥♥ed less in prison.",
            "review_score": "1"
        },
        {
            "review_text": "I cry everytime",
            "review_score": "1"
        },
        {
            "review_text": "This game will ♥♥♥♥ing destroy you. even on the easiet dificulty you will get obliterated again and again and again. if you want a challenge get this game.",
            "review_score": "1"
        },
        {
            "review_text": "I found an item that turns my weapon into a ponytail.",
            "review_score": "1"
        },
        {
            "review_text": "375+ deaths and I've only beaten the second boss. 375/10",
            "review_score": "1"
        },
        {
            "review_text": "You pushed your luck way too far with the underwater minecart. Officially done playing this game. It is a really fun game and I recommend it for anyone to try but that minecart? No. I'm not finishing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Okay.. U win game.. Ragequitted",
            "review_score": "1"
        },
        {
            "review_text": "Hard as balls, but worths every penny. We are all waiting for a sequel, master Solgryn.",
            "review_score": "1"
        },
        {
            "review_text": "Controller works now after a couple weeks of waiting for updates. Now I just have to play fullscreen windowed so the game doesn't go black screen when I die.",
            "review_score": "1"
        },
        {
            "review_text": "Its a good Metroidvania game and it doesn't hold back on difficulty!",
            "review_score": "1"
        },
        {
            "review_text": "Havent played a platformer this good for a long time",
            "review_score": "1"
        },
        {
            "review_text": "After playing up to the first boss I can safely say that I am going to thoroughly enjoy the game. Of course, I am a complete masochist and perfectionist in these type of games and love it. This game is for lovers of the platformer genre that want something of extreme difficulty but without the extreme cheapness that tends to go hand in hand with that kind of difficulty.  I have not experienced the whole game yet, so my opinion might change. But for now I recommend this to anyone who wants this kind of extreme difficulty.",
            "review_score": "1"
        },
        {
            "review_text": "This game is freaking awesome!  Main Feature &gt;Boobs",
            "review_score": "1"
        },
        {
            "review_text": "Its a good platform game overall on the same style of I wana be the guy (trial and error metodology). This game is in noway recomended for those who lack patience or the will to fail constantly wich is the only way to learn this great game by solgryn designer of such titles as 'I wana be the boshy'.",
            "review_score": "1"
        },
        {
            "review_text": "It may look like fun watching twitch streamers speedrun it, but it is really just a pain in the ♥♥♥ game that you most likely will not enjoy. Although that doesn't mean it's bad.",
            "review_score": "1"
        },
        {
            "review_text": "It has pretty angels and boobs and is also hard 10/10 would purchase again.",
            "review_score": "1"
        },
        {
            "review_text": "Solgryn did it again. Another platformer masterpiece.  It is a hard platformer with very challenging but fun bosses. You will die a lot, but this only makes the feeling, when you finally beat a section or boss, even better. I couldn't recommend it more. Fore beginners there is also easier modes, which helps by adding some platforms and more saves. Did I mention the secrets? Ton of fun finding them.",
            "review_score": "1"
        },
        {
            "review_text": "I had a working Computer and controller when i bought this game, now i have half popisicle stick, 10/10 would rage again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is phenomenal. The only bugs I have encountered so far is the menu screen when trying to set up a controller, but other than that, this game runs very smoothly. As others have said, your movement has to be tight and precise. I only wish that this game covered additional expenses such as 3 new controllers and complaints from my neighbors. This game is about trial and error. You will die.. a lot. But regardless, Wings of Vi gets a thumbs up, share on facebook and eharmony from me.",
            "review_score": "1"
        },
        {
            "review_text": "Painfully difficult level and enemy design that make the successes you manage even more rewarding. Lovable art style, tight controls, and a fantastic soundtrack. Best action-platformer I've ever played on PC.",
            "review_score": "1"
        },
        {
            "review_text": "Wings of Vi is a deliciously difficult platformer. Despite that, it's quite fair to the player. The rules, i.e. the hitbox, enemy types and so on remain consistent throughout the game, making your personal skill the only thing that matters. Most of the difficulty lies in the platforming sections, often requiring quick reflexes, precise movement and occasionally creativity. The platforming is broken up with a variety of colourful bosses, requiring sound strategy and endurance to outlast them. Wings of Vi is a good pick for platforming enthusiasts, because its brutal difficulty will likely deter all but the most persistent of players.",
            "review_score": "1"
        },
        {
            "review_text": "Literally gave me terminal 7 cancer. 11/boobs",
            "review_score": "1"
        },
        {
            "review_text": "Takes the best of Dark Souls boss fights and the platforming difficulty of Super Meat Boy.",
            "review_score": "1"
        },
        {
            "review_text": "It is realy REALY REALY F**** hard. I wouldnt believe it reading all these other reviews from people saying it is much harder than Dark Souls. Well, it is. But it is a hell of fun and it somehow doesnt push my patience like other difficult games do. I realy like the music and it is nice to look at.  Would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Like Skyrim with wings  11/10 - IGN",
            "review_score": "1"
        },
        {
            "review_text": "If you like games that require you to be made out of twitch reflexes on caffine like Super Meat Boy, then 'Wings of Vi' is right up your alley; that said, if you raged in Super Meat Boy there is rage to be had here as well. Also the boss fights are pretty cool once you get the boss' attack patterns figured out.  P.S.- Like the game forums say: BACK UP YOUR SAVES! Put a copy of the Data folder from the game directory somewhere, it's no fun losing all your unlocked items, especialy the ones you have to 'flawless victory' the bosses for. :(",
            "review_score": "1"
        },
        {
            "review_text": "Awesome but frustrating game!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, hard but fun",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me want to kill a man, But it has a cute MC and great music, so I give it a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Cute art style, catchy soundtrack and tons of great platforming &amp; bosses. Can recommend this to anyone who enjoys challenging platformers like Super Meat Boy, Boshy, etc.  I also really liked the customization aspect. Made finding all the secret chests a lot more exciting. :)",
            "review_score": "1"
        },
        {
            "review_text": "Hardcore Game. Great graphics and challenging gameplay.  But not recommend to every hardcore game player. You must have a Very Very Very Very precisely controlling ability. I'm Not Joking.  En...If you have an intimate knowledge of a series game: I Wanna  You must buy this one ;  If you never heard about it.  Then find some information of I Wanna series and make a decision.  硬核向游戏，很棒的2d画面和有挑战的游戏性 但不推荐给所有爱好核心向游戏的玩家。这游戏需要非常非常非常非常细致的操作，这可不是开玩笑的！ 嗯....如果你多少对I wanna 系列游戏有所了解 那一定可以搞这个！  但如果从来没听说过什么i wanna, 建议了解下，再决定搞还是不搞",
            "review_score": "1"
        },
        {
            "review_text": "Wings of Vi was a game on my wishlist for some time. Masochistic titles like Darks Souls have always been a favorite of mine. The art and gameplay of this game had me hooked from the beginning, and the varied flavor of enemies and worlds is purely on point. The only thing about this game that I need say; it contains a few glitchy things, as seems to be common among anything meant to enrage. If purely coincidental, these bugs will often find you getting jipped on otherwise good gameplay. If you have the mental fortitude, it is an essetial for those whom love to overcome a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "challenging platforming fun bosses, and a killer soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "It took me one hour and 80 tries to kill the first boss   10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "My new and revised review.  I have now beat half of the game on normal and I can say it just feels very lazy. Much of the hit detection is very noticabley off and seeing how this game forces you to be pixel perfect most of the time that is a major flaw. Being pixel perfect isn't good game design, its the lazy way to make your game diffacult.  Thier are still some bugs in the game that needs some fixing but nothing major though that needs to be done. The creator of this seems to be done with this game now.   As I said you have to be pixel perfect and with that comes a lot of trial and error. I managed to beat many diffacult games like the first ninja gaiden for NES, many of the touhou series and still had fun with it. I only beat half of this game and hating every bit shows thats something is wrong with this game.   Lazy game design all around. If you want it just for the cute angel girl you can find better games with cute characters. If you want to boost your ego by beating a game thats only diffaculty is poor game design then this is it.",
            "review_score": "-1"
        },
        {
            "review_text": "Think Super Meat Boy, but without the refined controls or level design.  - Level layout lacks direction. It's unclear where you should be going at times and not in that 'Cool, I'm exploring' kind of way. An early boss fight is revealed after falling into what seems like a bottomless pit. After another encounter, you have to backtrack without direction.  - Controls are not refined. If you've played a number of platformers you know what a good jump feels like. Vi's jump feels like it falls short, even after you eventually unlock the double jump and float.  - Levels are set up to do very precise and very specific moves. It's common to run into a scenario where if you fail to fall, then jump, and then float on pit X, you'll die. This is ok but it makes the game more about memorization than reaction.  - Making the above complaint 10 times worse, the art is poor enough that it's not clear what you can and cannot pass through. This means trial and error because you thought something was in the background instead of blocking you as a wall (or falling to your death because you thought you could stand on something you could not).  - Check points feel poorly placed. It's not fun to redo the same 12 jumps I had no problem with just to redo the jump I died on because I thought I could stand on something that turned out to be in the background.  - Level design in general is poor. In one area, you literally Donkey Kong your way up the screen left, right, and then left again without any good reason other than clumbsily taking up screen space. As a result, the world is not engaging.  - Combat is incredibly poor. Enemies do nothing to reflect that they've taken damage except pop out numbers and eventually die. In many places, it's ignorable altogether and others it's just a time waster. Worse, when you hit an invincible enemy a series of 0's and 1's pop out (suggesting that at least a little damage is taken) when in fact none is.  - There's no back button for menus. You have to cycle through all the options until you hit the end of the list and select previous menu.  - Progression is strictly linear. There's no level select or replaying levels to get a better score (there are a couple of secrets, but they are poor at best). If you don't like an area, you are stuck with it. If you do like an area, you can't really get anything for spending more time on it.  Skip this game. Play Super Meat Boy if you want challenge. Play Rayman Legend if you want a good platforming experience.",
            "review_score": "-1"
        },
        {
            "review_text": "I have lots of technical issues with this game, making it impossible to play. The main issues I have are lag spikes/drops in frame rate and the screen going completely black whenver I respawn. Sounds can be heard, but no video is available. Numerous updates have come and gone since I first got this game, and none of them have fixed the issue.",
            "review_score": "-1"
        },
        {
            "review_text": "Do you like getting frustrated, stuck in one little area for sometimes up to an hour? Do you like dieing over and over again? Making you feel like an incompatent gamer? Come play Wings of VI!!!    I've been playing this game steady for a day, I do not recommend buying it, due it not being the least bit fun. Why? People don't play games to be stuck in tight-knit situations in which there is not even a way out A lot of the game is jumping platform to platform trying to get through a little area, there is 99% of the time only ONE way through the stage. On normal difficulty I am at 450 deaths at about 30% way done the game....    I've played my fair share of hard games, but this game is just ♥♥♥♥in' stupid.   Spoiler: One boss the dark machine (Can't remember the name) Is a boss which walks towards you, bombarding you with barrages of attacks, a razor blade, rockets, lazors, lazors x2, more rockets, and an undodgeable at times, 'floor fire.' (Some times the floor is covered with fire, with NO escape. No you can't fly over it, you must take the damage, mind i add, the boss seems to bug, IMO, flooding the floor with fire than it is supposed to, I say this because there is no ♥♥♥♥ing way a person can beat this boss without cheats and not take a single hit, the ONLY way, would be if you didn't get fire on the floor, ♥♥♥♥ ya RNG.)   Hell. One part of the game, you have to hit a button, which initiates about a 3 second countdown and then race from point A to B before the timer goes out, or the door will shut, and you will die. you are left with no less than a split millisecond to be able to get through the door. I feel the creators of this platformer actually had taken the fun out of a possibly good game, but in the end created a peice of ♥♥♥♥ poorly programmed bad game.  Take some time to put a little work in to your ♥♥♥♥ project, maybe people will actually ENJOY playing it and not frustrated with every room. you come across  Wings of vi in particular, a bad investment, you will buy it and not beat it, I'm going to continue playing it and beat it for the simple fact people actually believe this game is impossible Which is partially true,  So yeah, if you really do enjoy dieing and doing the same room over and over and over again untill you 'skillfully' pass it, good job, you got 400 more rooms that are harder coming up.",
            "review_score": "-1"
        },
        {
            "review_text": "Wings of Vi is a bug-laden mess.  I had such high expectations for Wings of Vi and really wanted to like it. But Solgryn has evidently released something not yet ready for the public. Corrupted saves. Frequent crashes. Zero responsiveness to bugs reported weeks ago.  If you buy this game, expect your game to crash when you're 5% HP from defeating a boss you've spent hours on. Expect to have all your progress lost when a malfunctioning item sends your character to an unescapable area. And expect minimal developer accountability and responsiveness.  Wings of Vi has the potential to be a great game, but sadly it's just not ready for release.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried the Tutorial. Im not good at trying.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of those joke games that you buy for someone you hate.",
            "review_score": "-1"
        },
        {
            "review_text": "I'll be honest and I think I say this for some of you out there that I bought this game partly cuz of boobs but I also enjoy playing these old school looking indie games. I must admit that it's my fault for not looking into the game or playing the demo (which I highly suggest you should do before considering this game) more by doing research and stuff but I don't like doing so because I feel that doing research on a game will ruin the surprises and plot that lie ahead.  But anyways, I saw a lot of negative reviews about this game being hard as hell but I was kinda okay with that if it's gonna be hard but rewarding I would definitely go for it. Bottom line: Fun? Kinda. Rewarding? No. For some reason I was actually expecting a Binding of Isaac kinda gamestyle. As in, random power-ups which made BoI such a kickass game. But keep in mind that this is not an arcade style game but rather a story-based. Imagine playing Binding of Isaac with maps that won't change everytime you die (which of course is what most story-based games do) [And trust me you WILL die A LOT] only a few fixed (fixed meaning the power-ups are always the same ones at the same place) power-ups. This creates a zero or minuscule replay value. I could play BoI over and over again but Wings of Vi? Not a chance.   That's basically what I thought would make the game much more fun and exciting. Power-ups and change of environment. But of course it's just my opinion and maybe you would like these types of games.  In conclusion, the:  Good side of this game: 1. Nice retro looking graphics and music. 2. Smoothish controls. 3. BOOOOOOOOOBS.  Bad side of this game: 1. Hard as ♥♥♥♥. (even on the easiest mode) 2. A story-based game. (the story which is rather meh so in my opinion should've been focused more on putting in more fun elements) 3. Lots of repetition due to dying a lot. 4. Has pretty much zero replay value due to lack of variation each time it's played.  As I've said this is just my opinion and you might like the game so I'd say give the demo a try and if you're some kinda masochist for death, enjoy replaying the same and exact mediocre stories over again then this is your game ;) Peace",
            "review_score": "-1"
        },
        {
            "review_text": "This game fails to follow good game design on many aspecs. Reducing what could be a great game to a frustrating experience.   The bosses do not follow a definite pattern that would let the player learn, instead attacks are chosen randomly.  In the bullet hell mini section the enemies also spawn randomly which again prevents mastering this section through trial an error and instead just frustrate. The collision boxes in this section are also too large and you get damaged way before you actually get hit graphically with still 8 pixels of emptiness between you and the missile.  But the most amazing part is this is probably the only game featuring a pause menu that DOES NOT PAUSE THE GAME. Trying to use the pause menu in the bullet hell section is nearly impossible as the game keeps going in the background and every hit closes the menu.  The designers have confused [difficult to master] with [I will randomly kill you unpredictably without hope of dodging. You'll just have to keep hitting respawn until you're *LUCKY* enough, your skills don't really matter.]",
            "review_score": "-1"
        },
        {
            "review_text": " This is a great game, but why do I not recommend this?  Actually I do reccomend this game",
            "review_score": "-1"
        },
        {
            "review_text": "I have some considerations i learned playing this game.  1 - i'm old; 2 - in this game you play as an angel, but it requires ya ninja skills tbh; 3 - playing this game is like someone asking ya if you like sex and then put you to play BDSM with a nazi torturer; 4 - from now on, i'll check closely on tags on steam games. If there is even a mention of 'hard' or 'hardcore' tag, I'm out.  Even the concept of a game is twisted in this game. Every game should bring entertainement to players. This one gives entertainement to ppl that watch your rage and your disgrace. Sadly i didnt experiment the game the moment i bought it... should ask refunds if so, coz mental harassing is not a funny thing.",
            "review_score": "-1"
        },
        {
            "review_text": "Hard always = Hard Core +10",
            "review_score": "-1"
        }
    ]
}