{
    "app_id": 318570,
    "name": "Hunters Of The Dead",
    "release_date": "2014-09-04",
    "developer": [
        "Traptics"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Tower Defense"
    ],
    "achievements": 0,
    "positive_ratings": 86,
    "negative_ratings": 48,
    "price": 3.99,
    "description": "Rescue your fellow Hunters, and with their help locate and destroy Dracula!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/318570/header.jpg?t=1447363184",
    "minimum_requirements": "OS: Windows XP / Vista / 7 Processor: 2 GHz Memory: 1 GB RAM Graphics: 960x720 minimum resolution, graphics card with 128 MB of RAM Storage: 250 MB available space Additional Notes: Will not display correctly on 5:4 screen ratios",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Hunters of the Dead is a lane defense game featuring an overhead map in which you decide which buildings to capture. No idea why its tagged as a tower defense game. It is set in a steampunk universe in which you are tasked with destroying Dracula and various undead creatures. You will need to build a squad of Hunters to accomplish this and you acquire them by rescuing them from their homes. They can not continue fighting indefinitely, they will need to rest after too many battles. It is a neat feature but also a double edged sword. It keeps the game from being too easy but it is also frustrating when you lose the game because half of your troops couldn't be bothered to fight the undead that are about to destroy humanity because they have one more day off work. It doesn't help that each day only goes by once you occupy a building but there is no way of knowing the chances of a random encounter so a lot of the times you will end up having to futilely throw your inexperienced rookies to the slaughter. You are expected to lose time and time again since this game doesn't really have balancing, requiring you to gather up money and upgrade your units and troops for the next play-through.   Gameplay consists of trying to keep your Hunters rested and healthy while capturing buildings surrounding your base. Not even sure why they bothered with a base, it doesn't matter if you are fighting on the far edge of the map, if a enemy reaches the end of a lane your base will somehow take damage so it may as well just be called a health bar. The actual fighting is rather simple you defend 5 lanes with the very small variety of Hunter with certain weapons including a Sniper, Machinegun, Shotgun, Sword and the basic handgun unit. Those are all the units in this game excluding a certain powerful Swordsman you unlock by gathering enough gold through consecutive deaths. You can use abilities during battles like healing units or destroying enemies but these cost gold you use to be stronger in future playthroughs. Each unit has its own use on the battlefield and none felt useless and they will level up after killing enough enemies gaining extra life and AP points. Action Points are used every time you send a unit to battle and every time you move them between lanes.   The town is randomly generated every time you play but it doesn't matter much since there are only 6 buildings and the bland gray background never changes. It also only has one very dull map for all the battles which further worsen the feeling of repetition and tedium. Dracula himself shows up randomly and is a very powerful foe but will not take to great a chunk of health if he reaches the end of a lane so it may be wiser to build up your forces more instead of confronting him right away. You should also keep a very close eye on your units AP or you may run into a situation where most of your units are resting and lose the game from a random encounter. Healing a unit doesn't rest his fatigue and resting doesn't heal the unit so if a unit is out of AP and heavily injured he will be out of action for quite some time. Other than that there is not much strategy and mostly consists of dumb luck and how much you have upgraded stuff through previous attempts.   Visuals are not awful or good, they simply do the job and do nothing to stand out. Though all that gray is rather unappealing to look at after a time. Same with music and sound effects, they are just there. User Interface is pretty decent and makes it easy to see how your units are doing and simply clicking on a portfolio of a character lets you make him rest, heal him or equip him all on the same screen. There is one nasty thing about the UI that the devs overlooked, you can't see a section of the health and AP of your unit on the bottom lane due to the healing ability button covering the bottom part of your unit's bar. That means you don't know how close he is the death and if he has any AP to move before he dies. Animations are all right but if an enemy dies mid attack he continues attacking but does no damage to your unit thankfully, it is a small nitpick but I found it fairly annoying since it can distract you from enemies that are still a threat.  Yes, even after all that I still had some fun with it. It is not a bad game but it is seriously lacking in content and quickly grows tedious. Play it for 5 minutes and you will see all it has to offer. All that is left then is to lose time and time again in an effort to upgrade and get a bit further each playthrough. So pretty much the whole game is one huge grindfest to finally have a chance at winning. That in itself wouldn't be so bad if it wasn't so bare-bone and repetitive. I would not recommend this game to anybody unless it receives a significant content update in the future or those that got it as a gift and don't want to seem rude by not playing it.",
            "review_score": "-1"
        },
        {
            "review_text": "A rather difficult rogue-like game, which can be a big time sink if you want to beat it. In essence, you need to find and defeat Dracula in a randomly generated map with various buildings that provide your stronghold with soldiers, various bonuses, buffs or weapons. Your soldiers can equip a weapon that has various range, power and limitations, and also need to rest, meaning that some strategic thinking must still be used. Battles take place in a rectangle 5-lane grid Plants vs Zombies style, and just like in PvZ, you need to face off against opponents of various difficulty (with their own range, power, HP and limitations), and eventually defeat Dracula, the final boss.  The Good: 1. The artwork. 2. The replayability. 3. The price. 4. The gameplay. 5. The strategic battles.  The Bad: 1. The game can be downright unfair. 2. The game can be really infuriating. 3. The game expects you to grind for a while and get some upgrades in roder to ease your path to victory.  The conclusion: Based on the pleasant artwork, it's price (1,25 on sale now) and decent gameplay as well as challenge, I am willing to give the thumbs up to this game. Being a rogue-like, the bad things I mentioned are completely forgivable, because, let's face it, that's exactly what you should expect from a rogue-like game.",
            "review_score": "1"
        },
        {
            "review_text": "well worth the five dollar price tag for this plants vs. zombies rougelike rpg game.",
            "review_score": "1"
        },
        {
            "review_text": "a very uninspired game overall. i mean you will get your 5 bucks worth but dont expect it to go the extra mile at any point.  the game is quite random as to what you get as far as layout which is fine overall. unless i missed something huge you dont have the tools to beat the game right off the bat requiring grinding. classes are based upon weapons but their are only 5 one of which is the base weapon for all the units. the enemys tend to all be very predicatble with only 2 units just not charging across the feild in a straight line into your units. one of the others is the boss so really only 1 basic unit that changes stregy at all.  again for the price esp on a sale the game is worth it. but dont expect any curve balls or anything more then a few hour time sink.",
            "review_score": "1"
        },
        {
            "review_text": "It's been a long time since an indie game made me want to play it over and over again. Most titles feel like they've given all they had to you in mere minutes into the game. So, to my welcome surprise, this is a first one that has kept me coming back.  Its gameplay is simple. Discover, expand and fight off waves after waves of the undead horde. And though it sounds simplistic, there are many a cases where you will feel overwhelmed by the number of choices you are going to make. To this, the randomly generated map and encounters contribute immensely. You could start off fine only to find your options getting limited or work it the other way around. Each and every press of the 'New Game' button is guaranteed to give you a new, refreshing experience. It may frustrate you before you manage to get some upgrades running, but as you build up with upgrades you will get the hang of it leading you to make progress into it.  The graphics as well as the sound effects compliment it completely. They are not the technology of today's finest edge, but you don't expect that from an indie title. Instead, they are colourful, pretty and just enough to get you immersed into the game. The soundtracks don't feel loopy and the voice-acting on the characters is simply sweet!  All in all, this is my humble opinion but at the price you're getting this, it's a bargain. It's a very nice title. sure to pay off many hours of immersion and the way I see it, it's also a form of investment. I can't wait to see what the people who brought us HotD are capable of if this is a mere glimpse into their talent.  See you around, Hunters!",
            "review_score": "1"
        },
        {
            "review_text": "I find this game really interestin and worth of money! It seems simple and easy game but it isnt it is so addictive and enjoyable together,i suggest you to buy it it worths! :)",
            "review_score": "1"
        },
        {
            "review_text": "lots of fun",
            "review_score": "1"
        },
        {
            "review_text": "It is a fun and cheap game so why not try it?",
            "review_score": "1"
        },
        {
            "review_text": "5 euros? for this? No..",
            "review_score": "-1"
        },
        {
            "review_text": "What? What am I supposed to do? I click on a house and then what?  I have people on the left and then what? I keep clicking buildings and they are supposed to give me something but what? Why am I fighting zombies on six lanes when I only have 1 hunter? Why are the zombies not dying? Why is that my first battle? Why are they dead?  Where do I find the control or option or feature or command to send hunters to training, or hospital. Why are the Tips saying something that does not mean anything? Who created this game? I wish I had played this game immediately after I bought it. Why? Cause then after 10 minutes I can ask for my money back.",
            "review_score": "-1"
        }
    ]
}