{
    "app_id": 318650,
    "name": "SunAge: Battle for Elysium",
    "release_date": "2014-12-15",
    "developer": [
        "vertex4 entertainment ltd."
    ],
    "publisher": [
        "vertex4 entertainment ltd."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Achievements"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "RTS"
    ],
    "achievements": 15,
    "positive_ratings": 68,
    "negative_ratings": 40,
    "price": 10.99,
    "description": "A return to the roots of real-time strategy, providing beautiful 2D visuals combined with all the features that we came to expect from old school classics. This remastered version is a culmination of all the improvements and new features based upon suggestions from the community.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/318650/header.jpg?t=1447363188",
    "minimum_requirements": "OS: Windows 7 Processor: 1,2 Ghz Intel Processor Memory: 512 MB RAM DirectX: Version 11 Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Good RTS reminicent of RA2 and the tiberium series, would really like to see two things implimented to make this perfect  1. A zoom function. 2. A difficulty setting in skirmish to make the A.I harder",
            "review_score": "1"
        },
        {
            "review_text": "Best retro Sci-fi RTS on Steam - hands down - Awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Good game (RTS) but please REPAIR FEW THINGS. Bugging troops and picking squads and please add multi squad movement",
            "review_score": "1"
        },
        {
            "review_text": "Really strange plot. I really like the Raak-zuun. I only played the campaign.   I liked it but the control system is kinda clunky. You don't drag to select you have to shift drag.  Seems like infantry dominate this game. Just spam them to win the campaigns.  The graphics are nice. They're not really trying to be good but they try to be stylized meaning it probably won't make your eyes bleed in 5 years when you replay it.  ",
            "review_score": "1"
        },
        {
            "review_text": "I gave this game a fair chance, and it started off good: the isometric graphics are obviously glorious, the story is simple but engaging enough, voice acting is okay, I even liked the the half-baked comic cutscenes where the main character looks like a different person in every panel.   But the game itself is almost unplayable: the first thing I noticed is the strange unit selection scheme. Drawing a rectangle across the screen should select all units inside the rectangle, right? No, that is for putting units into squads, but only units of the same type, except for commander units. It doesn't add anything to the gameplay, it just makes things more complicated.  Then I noticed the units horrible pathfinding. If there is any obstacle between them and their destination, or a tight corridor, they'll go somewhere completely different, or take a step back, or refuse to move at all. This is especially awful if you take into account that in this game, bases are tightly built clusters of buildings, literally touching each other, or they don't have power. My units also ignored attack commands regularly and didn't pursue enemies. Sometimes they stop just ahead of their target and take fire until they are dispatched.   I had reasonably high hopes for this game, but it's a complete disappointment. The most amazing thing is that even though it came out in 2008, there are still patches coming out for it. The devs apparently care about their game, so why haven't they fixed these glaring issues yet, or given up entirely?  TLDR: Don't buy this!",
            "review_score": "-1"
        },
        {
            "review_text": "A terrible game trying to be a RTS old-school but it's just a relatively recent program with the same limitations of those 15 years ago. It doesn't add nothing new to the genre and whatever it tries to copy, it's sloppy and poorly done.  If you're looking for a classic RTS, you'd better get any classic Command &amp; Conquer games instead of this garbage hyped by pseudo-retro gamers.",
            "review_score": "-1"
        }
    ]
}