{
    "app_id": 319050,
    "name": "Chaos Reborn",
    "release_date": "2015-10-26",
    "developer": [
        "Snapshot Games Inc."
    ],
    "publisher": [
        "Snapshot Games Inc."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RPG",
        "Turn-Based"
    ],
    "achievements": 34,
    "positive_ratings": 745,
    "negative_ratings": 218,
    "price": 6.99,
    "description": "Turn-based wizard combat with the tactical positioning of chess and the bluff of poker. Features wizard customization, 100s of gear items, single player realm adventures, online leagues and co-op play.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/319050/header.jpg?t=1549886177",
    "minimum_requirements": "Минимальные: ОС: Windows XP or later Процессор: SSE2 instruction set support, or better Оперативная память: 2 GB ОЗУ Видеокарта: DX9 (shader model 3) or later DirectX: Версии 9.0 Сеть: Широкополосное подключение к интернету Место на диске: 2 GB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Note: I deleted my old review because with so many updates since last Octobers release, it was simply too out of date to warrant an edit. So here is a new one, reviewing the game as of V1.10, released today!  Chaos Reborn is a hex based, turn based, card based strategy game where you are a wizard and you have to kill the other wizards. This is done by casting spells which can either summon creatures to attack other creatures and wizards, cast magic attack spells to kill almost anything, or create growth spells that hinders mobility. You'll soon learn that different creatures have different strengths and weaknesses, far too many to list here but you'll learn them.  You have a choice of what kind of game you want to play - if you love managing risk and playing with lots of RNG, there is Chaos Mode. This is the mode that was not only the only way to play the original, but was the only mode when the game was in development, so it has a strong following from many of the core players. It's also my favourite. Basically, every spell has a % chance of being cast, and there are many factors that can affect what that % is going to be. Stronger spells have a lower chance of being cast than the weaker ones. Killing creatures also has % chance, based again on many factors but the main one being attack + defence of the creatures in combat.   In v1.8, a new mode was introduced called Law Mode. Law Mode is a more standard affair, a lot of the RNG is stripped away for players who are not comfortable with playing with a lot of RNG. So, instead of % chance of being cast, spells have a mana cost to being cast. The more powerful ones are more expensive than the less powerful ones. Combat is also very different - everything now has Health Points, and the amount of damage dealt is influenced by attack + defence of the creatures in combat.   In amongst Law and Chaos Mode, you have two ways of playing (so much choice!) - Classic or Equipped. Classic gives all wizards the same bodygear and staff with equal stats for a truly level playing field. Equipped mode however gives you the chance to be creative, allows for customisation and creates far more exciting games - you get staffs and bodygears that have special features and particular alignments to certain spells, and so allows you to customise your wizard based on your play style.    But wait, there's more! There is an Offline Mode where you can play offline games and a single player campaign. There are also some tutorials. Use these to familiarise yourself with the game first before jumping into Multiplayer.  Multiplayer offers up to 4 different ways of playing - PvP Matchmaker (Friendlies and Ranked), PvP Private Games with your mates, Online Realms (with ally and invading options, where you can help your friends or fight them), and the all new Duels mode - jump into a 1v1 match to win Forge crystals so you can build your own staffs and bodygear.  But wait, there is EVEN MORE. There are social ranks - so at the end of each month, if you've met certain criteria, you level up to a new rank. Apprentice is your base rank - which goes up to Lord, where you can offer yourself up as a Lord defender for a King and his realm - which goes up to King, where you can make your own Realm, and then up to Demi God and God, which I understand that in the future, you can create guilds and tournaments, but no details on this as of yet, which has disappointed some, certainly those who participated in the Kickstarter, but hasn't bothered most (at least, that is the impression I get).  So is the game any good? In a word, yes absolutely. It looks gorgeous, it sounds good - it's easy to play but difficult to master. Lots of stats to learn, lots of spells to choose from, great community, and above all a lot of fun. I highly recommend Chaos Mode as that is the most exciting, but if you don't like its outcome dependancy on RNG, there is Law mode that may be more to your taste.   However, the game does suffer from minor balance issues here and there. Also, the tutorials don't do a fantastic job in selling the game as well as it could. Plus, personally, I think the offline campaign is boring as hell. However, Julian and the Snapshot team do their best to address the most serious issues with regular updates, which now and again come with new features. And yes, there are still issues.  But overall, yes I sing the praises much of this game, but 900+ hours and still enjoying it everytime I login, I have much to praise. Great game, highly recommended.  24/11/2016 - I put Chaos Reborn forward for the custom category 'The RNGesus' Award. I thnk it's fair to say it should win that one :)",
            "review_score": "1"
        },
        {
            "review_text": " Updated for version 1.00! A turn-based battle of wizards! Slay dragons! Summon the hydra! This is Chaos Reborn.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it 30 years ago on the mighty ZX Specturm. It was awesome multiplayer action that was addictive as hell and paved the way for so many games that followed it .  30 years on, its back for a new generation to fall in love with it all over again.   Life, death, gooey blob and bolts to the face. It is all there and then some.   Anything can happen in Chaos Reborn and frequently does.  So grab your staff and get ready to battle.  It is still the dogs dangly bits.  Class never dies.",
            "review_score": "1"
        },
        {
            "review_text": "I was a big fan of the origional on the Spectrum, so I had no hesitation in backing this when it placed on Kickstarter. Over one year now, and this is my most played game in my Steam Collection.   For me, it's the perfect game - although randomness makes up a large part of the game, what you have to bear in mind is you are managing risk/probability. Once you realise that, and develop a playstyle accordingly (such as being a defensive player who plans for the worst - such as the enemy wizard having a bolt, or a blob if you get to close to him) then you'll really appreciate how deep the game is. Which is best summed up as a mixture of chess and poker, and I think this is why it works so well. The Realms are interesting, however for me the best part of this game is that the community as it's really friendly and unlike any other game I've played online before.  In summary, 10/10. I would recommend.  ",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite game in my library... I didn't think much of it when I first saw it on sale, or when I read the mixed reviews (at the time), but after each session I still yearn for more. Everyone I have chatted with in the community (which is the nicest one I have came across) all said the same thing more or less- that this game is enjoyeable enough to keep you continually interested in the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game oozes maturity, class and strategy. You can tell it was designed by oldschool seasoned developers. I took the next day off work after i bought it, so thats the review in itself i guess.   The online play is seamless and sports a very helpful community. It begins with a tough fun tutorial training session to get you summoning, zapping, and using your sneaky wizard brain, then you jump straight into your online character, duels, RPG mode, co-op, xp and LOOT. Did i mention loot?  The game feels fully polished already, rare for a newish steam game. Its a bit of a hidden gem right now, get on it.    ",
            "review_score": "1"
        },
        {
            "review_text": "I've been waiting for a game like this to come along for a long time now. It's a game of tactics and chance mixed together in perfect synergy. The chance element keeps the play fresh and exciting whilst tactically you need to constantly re-evaluate your next move as the arena can change in a blink. This game is my game of the year for 2015, a late comer that has really taken me by suprise.  Don't just take my word for it though, there is a demo available, so try it out there's nothing to lose.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and fun turn-based strategy game with an interesting, but at first kind of weird 'everything's chance' system, that requires quite different tactics. Plays very well despite being Early Access and gets one big update per month. Very much recommending that you check it out!  [Update 1] Quite a few updates later (with release just around the corner), the game now also offers a very interesting singleplayer (with multiplayer elements) mode that has quite a few RPG elements to it. If you weren't all that interested in the competetive mp part of the game, this is the time to take another look!  [Update 2] And it's been officially released. Lots of polish, a nice intro, lore, challenges etc. have been introduced into the game and probably most important: It now has a fleshed out tutorial, so getting the hang of things should be a lot easier for all the new players. The game has come a long way since I bought it on Early Access and hasn't disappointed. The updates came as promised, the release came in good time, the game itself is great. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Really great tactical wargame. I have never been into wizards and dragons but this is such a wonderful little gem of a game. The battles are thrilling and immediate - you go straight into the action and can summon up all sorts of spirits and demons. It is a very straightforward system, and you are battling the hordes and in the midst of it straight away. Battles typically take 5-20 minutes so you can play a lot of games in a short space of time. The graphics are very nicely done with beautiful character depiction, and lots of fun stuff like meteor showers and ice glaciers burst forth from the tip of your wizard's staff onto your screen.  I can highly recommend this game and I really hope it builds up a decent following because the developers are bringing out improvements all the time with extra monsters and spells, and you have 1v1, 2v2, 3v3 and co-op battles now. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Chaos Reborn is quite simply my favorite game in the past few years. Not only does it have nail-biting 1v1 battles (most nail-biting comes thanks to RNG) but it also has a nicely developing PvE mode. I look forward to the implementation of a proper Co-op mode, but even right now, PvE is quite fun. If you're a fan of RPG or Strategy games, you should definitely give this a shot. The developers are extremely involved and responsive to the community (check out the forums) and have many updates lined up for the foreseeable future.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the product of Hearthstone, Final Fantasy Tactics, XCOM and Poker rolled into one. It's quite possibly the most fun I've had with Strategy Games in since the launch of XCOM: Enemy Unknown. If you love strategy games and love to think tactically this is the game for you. Amazing community. This game is not nearly as popular as it should be. I'll be playing it for a long time to come. Hope it continues to grow.",
            "review_score": "1"
        },
        {
            "review_text": "Though I had never played the original game on which this was based, I purchased it during Early Access, as it seemed a very unique blend of turn-based strategy incorporating a card-based system. Now that I am actually putting a little time into it post-release, I am extremely pleased with the outcome. I highly recommend it for fans of turn-based strategy looking for something a little different.",
            "review_score": "1"
        },
        {
            "review_text": "I'm glad there is people who make this kind of games.  The game is great! its a rpg game, a fantasy game, a strategy game, a card game, a mental game, a game of tricks and lies. It's like playing magic on a board and with living monsters. I hope they keep adding content such as more creatures, spells, gear, maps. etc.",
            "review_score": "1"
        },
        {
            "review_text": "I bought Chaos reborn in early access and have recently come back to play it again now that features are fully implemented.  Pros:  (1) you can play a game in 10 minutes and still feel like there's a lot of tactical depth (2) the artwork, character models/animations and landscapes are beautiful (3) the setting and tone of the game is really good (I would play a tabletop RPG set there!)  Mixed:   (1) The levelling up/RPGish side of things could put people off (at the moment there doesn't seem to be anything to stop brand new player ending up in a game with someone who has all their equipment slots filled) but at least it doesn't seem to be pay to win.  Single player: I can't comment on SP at the moment as I haven't tried it. Will update this when I do. ",
            "review_score": "1"
        },
        {
            "review_text": "tldr: it's pretty good  =====Positives:  -Fun turn-based gameplay with interesting and varied mechanics: rune abilities, burning cards, mana boosting, height levels and lines of sight, pillars with passive effects, summoned obstacles and stationary creatures, law/chaos bar... the list goes on  -Fluid to play, good controls including camera zoom and rotation (important for this kind of game!)  -Multi-part tutorial explaining most mechanics (but not all, especially specific creature mechanics sometimes aren't straightforward and are learned with experience) with additional challenge levels  -Supports battles of up to 4 players, plus offline with the option of vs cpu  -Endless Legend-esque realms* are fairly interesting and give you permanent progress (levels, equipment and runes) for your character  *Realms are small missions or campaigns that feel a little like Endless Legend, with various points where you buy and sell equipment, hire mercenaries, and recruit or subjugate native camps. As of now it definitely feels like a huge part of the game and what most people would spend time in; even competitive players not interested in realms would likely play here for the rewards. Nothing as large and complex as endless legend games though  =====Negatives:  -Portals cost gold and are often the only way to reach different areas, which can slow progress down or leave people stuck  -Fee for joining realms in certain cases such as after abandoning the realm: if someone gets stuck and they are forced to abandon the realm or wait for a long time for a random volunteer match, they are further punished by this... abandoning forfeits all rewards aside from xp anyway, don't think we need this  -Equipment doesn't tell you exactly what they do, for example does a 'creature' staff give you different cards from a different type of staff? Which cards specifically?  -There seems to be no way to truly customise your deck to what you like if you can only choose from 'types', especially when you don't know exactly what's different about them apart from the small stuff they do tell you (deck/hand size, etc)  =====Meh stuff (stuff that's not that bad but could be better):  -Might not have enough variety for some people, with only a handful of units spread out over three categories (neutral, law, chaos)... we'll see how much content is added in the future and at what rate, right now it's still serviceable  -RNG CAN be an annoyance, but just like endless legend you can make your RNG better by playing tactically, checking enemy movement and attack ranges, using the terrain and manipulating lines of sight  -There are only a handful of realms as of now and it seems like there are little ways to get more realms... we'll have to see about this in the future  -Volunteer system lets you play in other players' realms, but only for one battle... nice but turn-based realms supporting multiple players would have been better  -fighters from villages can only reach a short distance from where they are based. not a huge problem but there should be some sort of indication as to how far they can reach as this is important when deciding whether you need control of the village or not to help attack an area  -ordering your villages around feels clunky, and the bubbles representing them on the map don't accurately let you know where they are. This becomes important if you're moving around while a marauder's chasing you, as they could be just out of your reach to join the fight  =====ALL IN ALL   there's a lot of annoyances and stuff that isn't explained well, but the gameplay has fantastic mechanics and plays well. Not something I would would spend a lot of time on per day, but still a good game!  === if i made any mistakes, message or pm me or something",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, deep and varied tactics, interesting campaigns, and beautiful animations. A bit of an excellent surprise found through the discovery queue.",
            "review_score": "1"
        },
        {
            "review_text": "Great atmosphere, music, graphics and story. If you have an ounce of love for strategy and tactics, and like the emotions that Lady Luck brings, you will enjoy this one.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun - brilliant if you are looking for some quick (yet skillfull &amp; deep thought) multiplayer action.",
            "review_score": "1"
        },
        {
            "review_text": "best game for playing with buddies. a modern chess, much better than card games.",
            "review_score": "1"
        },
        {
            "review_text": "A turn based tactical game that features Wizards, spells and magical creatures. Single and multiplayer game modes, nice clear graphics and UI, nice music. Check out my video on this game for more..         Chaos Reborn - Let's Play&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I love this game...I love this game....I love this game...No now really..I love this game :)  First i know many people complain about its RNG side. Yes RNG has very big influence on gameplay(wizard battles) but on other hand it gives to game all that tension and fun since very beggining of match to very end. Yes it is ennoying to die in match and not able to succesfully cast anything(sometimes happens even but very rarely) but then...Sometimes when you think you have lost and then game change in favour of you after you have made some clever moves to defend yourself and turn it around...There is not better feeling of satisfaction after such game if you win or draw!  Game itself can be played just as wizard battles mode, where you have to kill opponnent wizards.You kill it with summoned creatures or lovely magic bolt just right into his face! Right if you manage to get close enough and if he didn't kill you previous turns :).  There are avaiable 1vs1, 3way, 4way, 2vs2. These can be played for fun as friendly matches or as ranked for rank in league. There are two main types of play in battles. You can play classic mode which will be playing with pure randomn spells without any boost or adjustability to your gear/stats/creatures.  Or you can play Equipped mode. There you can equip gear, staffs and talismans which give a boost to you or your creatures or bind spells you want most to have in deck to be there for battle. There is also singleplayer with lots of realms made by players, where you should defeat king of the realm you entered. You lure in realm search for his lords, battle them and buy equipment(in story mode wizard battles are in Equiped mode) from towns, hire creatures and so on. The best fun of Story mode is that it can be played as multiplayer too!(not if you don't want to). There is option that you can let other players invade your realm and they will take control of king or lords to fight you. Even better is that you can aid other wizards or being aided by them.Like that you together will fight lords and king once you approach actuall battle mode screen! So basicly you can get 1vs1 or 2vs2 in storymode too! Really fun! I prefer to play mainly classic mode and story mode and I still have not enough despite of hundreds of battles! There are also tournament sites(link is in game) where you can arrange matches with cool people! Either friendly modes or for monthly tournaments in 1vs1, 3way and even Tournament of Gods!(search for it if you really intrested!).  Who I would recomend this game to? If you are player for turnbase strategies, card player like Magic the gathering, you love a tension(like poker player) in gameplay, you love fun - same time challenge, and great community then this game is for you! If you have friends you can play together this game, is more than recommended as it has multiplayer mode over interent or just on one computer!  Who I would not recomend this game to? To players who doesn't like loosing(specially if you have personality which tends to like under control everything, no offence but RNG can't be controled), because you will loose in this game even if you are very smart. People who doesn't like intensive thinking, doesn't like to risk without clear outcome.  Now brrb gonna do some quick games in classic!",
            "review_score": "1"
        },
        {
            "review_text": "Best game since Laser Squad Nemesis.",
            "review_score": "1"
        },
        {
            "review_text": "Good in bersts.  7/10 would get one shot again.  P.S. thanks RNG!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty niche game  Nice strategy setup but i felt RNG was playing too much into the actual gameplay... failing a 90% fundamental spell is just rubbish.  Online worlds with storyline (sort of) is a nice feature, but the plot is just some written screens with barely a choice, at times it felt really contrived and repetitive.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game! Thanks for Linux/SteamOS support!",
            "review_score": "1"
        },
        {
            "review_text": "Its goin to detach even my favorite WC3 and i was never believing that day would come :) Whatever, its just awesome. Try it, enjoy it and hope for friendly dices. Review should change to overwhelming good soon.  Greetings  ",
            "review_score": "1"
        },
        {
            "review_text": "I loved the origional Chaos game in 1985, it was, and is, genuinely one of the best strategy games ever made, wih huge re-playability. The fact that it spawned the excelent 'Lords of Chaos' and 'Magic and Mayhem' plus several fan made versions of Chaos for Palm Pilot to PC, is a testiment to how good the origional Chaos game is. But how can you take a game like Chaos and re-invent it 30 years later and still keep it true to its origional greatness? We'll this game's managed it. It's Chaos, with an additonal sprinkling of magic. A huge well done to the development team, you have me hooked, thank you for making this game!",
            "review_score": "1"
        },
        {
            "review_text": "This Game needs more players... Fun Strategy game that you will rage quit ALOT. Takes a little while to not die in instantly though.",
            "review_score": "1"
        },
        {
            "review_text": "The battles are fun and there are some very good spells and creatures, but unfortunately the RNG aspect is a bit of a let down. You can easily get 3 rats, and it's much harder to get 1 hydra, but 1 rat can get lucky and kill your hydra, and it happens quite regulary.   It's a fun game but needs a more balance passes, as currently there is no skill involved you may as well roll a dice to decide if you win.   Everyting from your cards to the enemy is RNG.  In the quest mode there is a time limit. I personally hate things with an arbitrary limit, which is why I mention it. Some might like it, but I do not.   ",
            "review_score": "1"
        },
        {
            "review_text": "It's almost like a Magic the Gathering tactical RPG. I find it quite enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "wanna game where you can question how you failed a summon with a 90% succues rate 4 times in a row to only be killed by a bird with a 25% succues chance one it 1st game then thsiis the game for you",
            "review_score": "1"
        },
        {
            "review_text": "  I am happy that this game has Law mode, and the Equipment side as they make the shineing moments happend. I realy didnt like the gambling part of the game in Chaos mode and the card verity is not high for a card game. the Law mode give a stratigic bas tothis game and the Law/Chaos meter is a niche gimic. he games flow in a good pace and the game never felt unfair, and i think its qite easy to pick up on and i am still exporing so i dont know how hard it is to master last but not least is the equipents with the talisman cherrie on top with near endless ways to change how the game works.  I do recommend this game and hope for more content in the future",
            "review_score": "1"
        },
        {
            "review_text": "RNG jesus literally wants to ♥♥♥♥ me 24/7. Rats can murder me while I throw 50 snipers at the enemy and they all die due to zeus' ult type spell and im sitting there just like ♥♥♥♥ my life  10/10",
            "review_score": "1"
        },
        {
            "review_text": "With the addition of the Law mode, the game is a really nice tactical game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great concept for a game; but if you're buying for multiplayer, I can't recommend with the current peak player count of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Chaos Reborn is an awesome round-based strategic card game with magic creatures summoned by wizards. You fight yourself through many enemy wizards to stop a powerful mage who is preparing a spell to banish you out of this world. On your way you will sometimes encounter story parts where you have to choose your decision, ending in different effects. Also you can find and buy new equipment for your wizard or recruit creatures to help you on your journey. It's a war against time, if you are not fast enough, you will get booted out!  While fighting you use random cards you can summon in two ways:  Real - There will be a success rate for your summoning. The normal way to bring a creature to life.  Illusion - To trick your enemy you can summon your creature with a 100% success rate as an illusion. This will look for the enemy wizard like every other creature on the battlefield. But if your enemy doesn't trust your recent summoning, he is able to cast 'Disbelieve', if he cast it on your illusion it will vanish instantly. If he is wrong and your creature was real, he will not be able to cast another spell this turn, if he is right, he can cast 'Disbelieve' again. Your illusions can fight like every normal creature on the map.  There are 3 types of monsters: Law, Neutral and Chaos. Every monster has his own special abilites like flying, paralyze and more. While casting law or chaos summonings you will push the battlefield percentage a little bit more in this direction, causing summonings to have a higher success rate while its side is in favour / lower success rate while the world is in its disadvantage.  The bottom line is that you have a lot of strategic options while fighting: Illusions, abilities and more, making the game a solid strategy and fantasy game. You can also join up with your friends, playing in multiplayer / co-op mode. But the point why I can't recommend this game is the extreme focus on luck via impacting success rates (not only summonings - there are also rates on attacks, giving luck a very important role), destroying every strategy part. You will very often fail (even with 90%) only because of these success rates and not be able to summon anything will determine your fate in many situations. This is turning this game in a very luck based game, leaving strategy behind. Yeah, it's right. Luck is part of life, but it never should take over, it will just kill the gameplay and fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Possibly one of the most poorly balanced games I've ever played (singleplayer campaign). Once you lose a battle, you can never again hire the mercenaries to fight with you, even though the AI gets all it's fighters back, putting you at a permenant (at frankly, staggering) disadvantage. To add insult to injury, you LOSE score as you have to backtrack to return to where you were before you died?! WTF?! I didn't manage to beat the first realm in over 8 hours of play, and my score was almost always in the negative numbers. This game is absurd!  I loved the artwork, and the background seemed pretty cool, so it's a shame I can't get past the frustration of playing this game and probably will not ever play it again...",
            "review_score": "-1"
        },
        {
            "review_text": "The RNG in this game was tolerable to a certain degree you could curb the chances with stratagy to soften the blow if your attack failed but the final straw for me was when i had the CPU completely surrounded by 3 dragons and they could not kill him 4 turns later he meleed all of my dragons to death and then walked over and killed me. The RNG in this game makes it to where in the end it doesnt matter what you do if you win you just got lucky.",
            "review_score": "-1"
        },
        {
            "review_text": "Chaos reborn is a fun game... if probability is on your side. Depending on your luck the first few times you play it it can be enjoyable or be so rage enducing that you want to delete the game. I have had bad experiences with this game and probability is being downright sadistic. If your luck is terrible dont play this game. I personaly don't like the game very much right now. I don't think a game should rely on luck this much. There is not a lot of skill involved. My opinion on the game may change if the game is improved.  First, the positives. The spells are fun and unique, playing against other players is fun (it takes far too long to matchmake though) and when things go your way it is very satisfying.  Why does everything die in one hit. Its unrealistic. (And before people post comments like 'the game is a dystopian fantasy game so of course it wont be realistic' i mean realistic in terms of if this game was real.) How is a 'giant' rat supposed to kill a wizard or a dragon in one bite then getting blowtorched by a dragon and surviving. Also the A.I has far better luck than the player. I dont know weather this is just a coincidence but I rarely ever win against A.I as they summon powerful units with a low sucess rate as the real things. You're usually better off fighting players as it is fairer. A HP system needs to be added in so that rediculosly unrealistic things don't happen.  One of the most frustrating things is failing a cast that you put a lot of mana into to boost its chances or sucessfuly casting a magic attack 3 judgment or the other one (the fillter will probably filter it out if i say its name) and then it doesn't actualy hit any of the targets.  A request to the developers if they see this review. Put in a system that makes it so that if a player fails high sucess chance spells or attacks too much in one battle, give them a tempory buff that stops them from failing these spells for one or two turns. I've only had this game two days playing for a couple of hours each time and I have had more than 10 draws so could the turn limit be longer by defalt.",
            "review_score": "-1"
        },
        {
            "review_text": "With respect ot my tastes: too random for a strategy game and too slow for anything else. Granted I only spent time in the tutorial (about 2 hours :). It has neat ideas and is straight forward enough, but even a good chance of casting a key spell can fail with great regularity (e.g. 1/5 of the time).  The importance of casts relative to their unreliability means there can be huge swings in power that can't be cleanly buffered against.  Interesting idea, but not to my taste.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is entirely restricted by the RNG. Good tactics always beaten by random bad rolls and bad tactics always succeed with good rolls. Might as well play poker machines if you want to try your luck.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow, dont know what to say about this game. I dont mind the randomness, it looks to be quite woven into the game at a core so theres ways to make it work for you. The difficulty is somewhat weird... on my 9th or 10th attempt at the game and I cant seem to go past the 3rd battle?! Ive lost couple games on the first battle. No save option, no undo option, just lose and start again....and again and again till your score is in the negatives (never had a game where my average score was in the negative... consistently....).   Bottom line is if you like getting your teeth kicked into the curb and feeling frustrated at the steeeeeep learning curve then this game is perfect for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't believe i kickstarted this. Nothing like xcom. Game moves very slow. paywall. graphics are subpar. strategy is pretty lame. Can't finish a game it puts me to sleep.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting game with great art and some neat combat, Chaos Reborn ultimately suffers from a lack of variety, a well-written but bland story, and a combat design that focuses too heavily on RNG. Its multiplayer may be entertaining, however, the population of the game is already too few to easily or regualrly find matches.  After a short time of playing you burn through the content of both factions and see the futility of trying to implement so many robes, staves, and runes when only two factions are available to add variety... leaving you asking yourself why you continue to play. While the story has some interesting events and story elements, the gameplay does not change throughout and little persistence exists.  The combat, the obvious mainstay of the game, suffers from the large crutch of RNG (a true spiritual successor to XCOM), leaving a frequent salty taste in your mouth. The overall array of options and effects from your cards is decent and fun, but you swiftly go through all the game has to offer with nothing more in sight.  Single-player features hot-joining of random players to play as your ally or enemy, however, you will find yourself waiting as the population has significantly shrunk after release.  Overall, I would not rate Chaos Reborn poorly - it does what it has well, but ultimately lacks enough content to keep you going. Personally, I would not pay 20$ for the current content. However, if you're itching for a tactically-interesting, turn-based single-player game I would recommend it for less.  Edit: I have not played the game since RNG has been removed. The entire design is focused around that, so I hope it has not taken all the life out of the game with it.  If you feel the need to continually find my review 'unhelpful' for that single reason, I cannot help you.",
            "review_score": "-1"
        },
        {
            "review_text": "Chaos Reborn isn't worth. It's a bad miniture game with a summoning system that let too much to RNG. The overworld is dull and mostly server to bring you from 1 encounter to the next.",
            "review_score": "-1"
        },
        {
            "review_text": "I spent 3 hours or so on the campaign and keep losing to the AI but that a big deal becuase you get a little money for losing right? WRONG! You get nothing. Also if you lose time seems to progress so that second fight you get stuck on get reinforcements to make it even harder. I admit i likely chose bad starting gear but you CAN NEVER repick it so grind till you get lucky or UNISTALL like I am about to do!!!",
            "review_score": "-1"
        }
    ]
}