{
    "app_id": 319080,
    "name": "Disney Princess: My Fairytale Adventure",
    "release_date": "2014-10-06",
    "developer": [
        "High Impact Games"
    ],
    "publisher": [
        "Disney Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Female Protagonist",
        "Family Friendly"
    ],
    "achievements": 0,
    "positive_ratings": 71,
    "negative_ratings": 12,
    "price": 15.49,
    "description": "Young gamers travel to the worlds of Cinderella, Rapunzel, Ariel, Belle, and Tiana on a quest to transform evil imps back into friendly sprites in Disney Princess: My Fairytale Adventure.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/319080/header.jpg?t=1542762090",
    "minimum_requirements": "OS: Windows XP/7 Processor: 2.0GHz Intel Pentium 4 Class or AMD Athlon 64 3500+ Processor Memory: 2 GB RAM Graphics: 256MB 3D Video Card Supporting Shaders 3.0 DirectX: Version 9.0c Storage: 2560 MB available space Sound Card: 16-bit DirectX 9.0c-compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Spaghetti dropping waifu Simulator  9/11",
            "review_score": "1"
        },
        {
            "review_text": "  As a man who spent many sleepless nights questioning his own mortality, I can say with certainty, Disney Princess: My Fairtytale Adventure is more than meets the eye. It is not a game for an average gamer who will not see its deeper philosophical meaning nor he will ever be able to understand it. The name alone suggests we're living an adventurous fairytale. We go on with our silly little lives, hoping for a brighter future, just like the main character does. When in reality, everything we have accomplished will only lead us to unavoidable death. The main quest heavily implies that we're not truly living, our bodies are decaying while our mind is locked in a cage. Also, I would like to point out a few religious metaphors that slightly annoyed me as an Atheist. Your first objective in the game is to create a character in your own image (God creating Adam and Eve) that you will send on a mission through the garden collecting fruit (Eve eating the forbidden fruit), and later on being sent away to a different, darker world (Exile from Eden as punishment). This was very unnecessary and I took it as an insult to my intelligence. However, I do believe this game is a masterpiece that deserves a spot in my library among other classics such as Go! Go! Nippon! ~My first trip to Japan~ and Call of Duty: Modern Warfare 2.",
            "review_score": "1"
        },
        {
            "review_text": "overall the game is extremely cute. However i will admit this is definitely a game for little kids. It is fun though, theres a fairly good amount of variety in the games. The difficulty is very easy, making it a really casual game. The character designs aren't the prettiest, though they did a great job animating each of the princesses worlds.   Pros: - if you love disney, you'll love the cuteness of this game -simple games with a bit of variety -difficulty increases each level  - get to decorate your own room, take care of a garden, and explore the different worlds -customize your character with different hair, hair colors, eyes, eye color, and lips -can choose your favortite dress style and customize the colors -lots of different accessories to choose from -so absolutely adorable that I just want to hug it -Any little kid, or disney fan, would absolutely love this game.  - there's different flowers to grow in the garden and you can water, weed, sing to, fertilize and just take care of them. (singing to them is a small mini game where you hit arrow keys to match them).   Cons: -there's only two levels - there's four worlds, so there's only 8 levels, or 'chapters' and then you unlock princess tiana's world, and get one more chapter. -the games all involve the same kind of goal, you use your magic to stun the imps , or you use twirl magic to get rid of webs after you defeat the imps, and then there's only a few other games (shooting bubbles at other bubbles to pop them, putting puzzles together, and then some other games) -the instructions get really repetitive and annoying after awhile, each time you have to do something/play a game. and i didn't find any way to turn them off.  -after you beat the game there isnt too much to do  overall I'd give it a 7/10 , very cute, but all the instructions get a little annoying, and I got to make my own princess and see my favorite princess. I helped Rapunzel, and that made the game awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Obvioulsy I bought this for my daughter. She's 4 and has grown up in a world with ipads and media on demand and wireless internet isn't a luxury but rather almost a legal right. This game is atrocious on every aspect. Even though I bought it on a deeply discounted Steam sale, I still feel ripped off. My 4 year old immediately complained about the low quality of graphics. There is no resolution settings. At all. It's defaulot resolution will essentially just scale to your native. My native resolution is 7860x1600 (triple 30' lcds). Reducing the resolution down to 2560x1600, the game still looks like crap. Secondary, the controls are some ♥♥♥♥♥♥♥♥ arrow key and spacebar combo with M and N as action keys. There is no default recognition of the Microsoft Xbox/PC remote controller, and I was unable to reprogram it ato the game, since the game seems to override controller recognition upon start. Your kids are stuck with the keyboard and mouse. Just learn like I've learned...when you see the 'Disney' logo, it always means 'FAMILY FOCUSED (soccer mom minivan, stepford wives, corporate ♥♥♥♥♥d out ♥♥♥♥ show applications and movies and themeparks.'",
            "review_score": "-1"
        },
        {
            "review_text": "Worth. Every. Penny. (father-to-daughter)   MicroProse shines as always.  Use Padstarr to make it work with a gamepad.",
            "review_score": "1"
        }
    ]
}