{
    "app_id": 319180,
    "name": "Platypus II",
    "release_date": "2014-08-15",
    "developer": [
        "Idigicon"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Shoot 'Em Up"
    ],
    "achievements": 0,
    "positive_ratings": 319,
    "negative_ratings": 203,
    "price": 4.99,
    "description": "Fly the famed Platypus fighter through a fantastic landscape of carefully molded clay to protect inhabitants of Mungola from the Collosatropolians! Collect power-ups and bonus stars to give your Platypus the boost you need. Every level of this gorgeous arcade challenge bursts with original fun that's perfect for gamers of all ages.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/319180/header.jpg?t=1447363264",
    "minimum_requirements": "OS: Windows XP/Vista/7/8 Processor: Pentium® or AMD® 1.3 GHz Memory: 128 MB RAM Graphics: 32MB 3D Video Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "What a putrid sequel to a legendary game, this is awfull. The last stage was an advertisement to the developpers other game NUX from the level itself down to the enemies everthing was a ctrlC ♥♥♥♥♥ from NUX. Screaming eyeballs alien uclers to pop under horror music inside an alien. This was nothing that the Original Platypus' dev wanted Athony Flack the developer of the original game was discusted by the sequel. Even the final boss was copied from NUX. Not to mention the constant anoying references to NUX ie protagonist ship in the background, that laughing ♥♥♥♥♥♥♥ from the nux logo on stage one.   The ENDING IS A BLATANT NAG SCREEN TO BUY NUX, this is not worth your time.  AS much as i loved the original i hate the sequel on the same level  Go and get Platypus 1 THe ORIGINAL if you want a good game.  Stay away from this sh*t",
            "review_score": "-1"
        },
        {
            "review_text": "Cute graphics, local coop works, gamapads too. Good game to relax shooting.",
            "review_score": "1"
        },
        {
            "review_text": "The third installment in the critically aclaimed saga, wide varieties of ships and difficulty options result in near limitless replay potential. The phenomenal music brings my score to a solid 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Trading card Steamulator.",
            "review_score": "-1"
        },
        {
            "review_text": "as a fan of playpus yes , its good , but its horrid , the steam release is horrid very very horrid , its playing on weird resolution aspect &amp; left side audio (even the music files were actually stereo) , im sure this is a major flaw , but with ext speaker it doesnt matter anyway , is is good in any way ? short answer : yes , long answer : yes , with game engine issues 6/10 : good :nostalgic reasons &amp; cheaper than the 1st one , bad : audio bug , resolution&amp; no one at the dev team cares  try to find platypus 2 out of steam it should act normally",
            "review_score": "1"
        },
        {
            "review_text": "Key giveaways, why?",
            "review_score": "-1"
        },
        {
            "review_text": "Buy the cheapest game with Steam Trading Cards Install the game Get the cards Sell the cards Make profit Uninstall the game ",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun cheap game.I was bored and i playd this.It can be playd with a friend if u have a controler and its very fun",
            "review_score": "1"
        },
        {
            "review_text": "  It was better 10 years ago, on Nokia 3310, under other name. Now it's boring.",
            "review_score": "-1"
        },
        {
            "review_text": "I do not recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "has nothing to do with platyuses 0/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is published by KISS ltd.  If you did not know, KISS stands for Keep It Simple Stupid.   Not exaclty an inspiring name for a game publisher.",
            "review_score": "1"
        },
        {
            "review_text": "the game is solid and fun despite the negative reviews.  Yes - if you are using headphones sound will come out only out of one speaker  Yes - there is an annoying advetisement for Nux at the end of a chapter.  however, it does little to diminish from the game's fun.   there are plenty of different enemies. the music is carchy, albeit worse than the original. and of course, the lovely clay animation is still there. and the controls are still tight and responsive to boot.  so if you are not someone who's game experience is ruined by a few minor flaws. get this game. its a fun schmup  ",
            "review_score": "1"
        },
        {
            "review_text": "sick brother",
            "review_score": "1"
        },
        {
            "review_text": "Stay away from this game. Seriously. It will it your brain and PC.",
            "review_score": "-1"
        },
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "Unplayable for me (possibly Windows 10 issue?) Firstly it temporarily changes your display resolution to 800x600 or something, which I could tolerate. But what really makes it unplayable for me is that the game seems to run at 20x speed. Yeah, I can hardly do anything, even if I do manage to enter a game by randomly pressing enter and stuff, its Game Over for me within 3 seconds tops.  UPDATE: Uninstall and reinstall fixed that...game now runs at normal speed and can be played.",
            "review_score": "-1"
        },
        {
            "review_text": "This game sooooo killer",
            "review_score": "1"
        }
    ]
}