{
    "app_id": 319170,
    "name": "Disney G-Force",
    "release_date": "2014-10-06",
    "developer": [
        "Eurocom"
    ],
    "publisher": [
        "Disney Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Family Friendly",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 92,
    "negative_ratings": 10,
    "price": 15.49,
    "description": "G-Force draws you into the adventures of an elite team of trained guinea pigs on a mission to thwart a sinister plot to destroy the world. Take control of both G-Force commander Darwin and his sidekick, Mooch, as they apply their talents to defeat an evil army of altered household appliances.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/319170/header.jpg?t=1542762189",
    "minimum_requirements": "OS: Windows Vista/XP Processor: Intel Pentium 4 or AMD Athlon 2400 2.0GHz Processor Memory: 512 MB RAM Graphics: 128MB Nvidia GeForce 6600/ATI Radeon X1300 Video Card DirectX: Version 9.0c Storage: 3 GB available space Sound Card: DirectX 9.0c Compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Its actually not bad, a fun combination of Third person shooting and platforming. Its an especially good game for kids or teens who want play shoothers but arent allowed or dont want to play M-rated games, but i can also recommend it to just about anybody. the difficulty is quite scalable making it challenging enough for pro`s yet can be simple enough for kids and you can also challenge yourself as a player by speedrunning, ignoring ammo-upgrades, etc.   I have to commend this game for how it handles its license, it doesnt follow the original storyline, you dont get any awkward zoo scene or other unnecessarily cheesy scenes(maybe a few, but not nearly as many as the movie had). the game cuts right to the good part, fighting deadly robotic appliances and you get some neat guns and an electro whip to do it with. the people who made this game knows that film is different from video games and there`s a really healthy dose of fast, fluid gameplay. mouse control works as you`d expect it too from a TPS, gamepad integration is decent. i dont think the controls are the best they can be and you do notice that PC was not the target platform, but its completely playable.  graphically, it looks decent enough. textures are kind of small, environments are sterile and fairly basic. appliances lok decent though and special effects are pretty good. it also supports 4K resolution through downsampling or Nvidia`s Dynamic Super Resolution and the game is fairly easy to run 4K@60fps. there`s no graphics options for PC other than resolution so shame about that.   the price is a little high, but if you can get behind that and want to play a fun, fresh shooter-platformer hybrid with high focus on gameplay. G-force doesnt dissapoint, its fairly long too at about 10 hours or so",
            "review_score": "1"
        },
        {
            "review_text": "it's a godly meme game I give it a 10/10",
            "review_score": "1"
        }
    ]
}