{
    "app_id": 319470,
    "name": "Ninja Pizza Girl",
    "release_date": "2015-09-30",
    "developer": [
        "Disparity Games"
    ],
    "publisher": [
        "Disparity Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Female Protagonist"
    ],
    "achievements": 28,
    "positive_ratings": 212,
    "negative_ratings": 50,
    "price": 4.99,
    "description": "Ninja Pizza Girl is a serious game about bullying, emotional resilience – and pizza delivering ninjas! It’s a fast, flow-based game about Gemma, a sixteen-year-old girl trying to keep her dreams alive in face of the most merciless enemies known to any teenage girl – other teenagers.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/319470/header.jpg?t=1505020752",
    "minimum_requirements": "最低配備: 作業系統: Windows XP+ 處理器: Core 2 Duo 記憶體: 2 GB 記憶體 顯示卡: DX9 compatible. Anything made since 2004 should work. DirectX: 版本：9.0 儲存空間: 1800 MB 可用空間",
    "recommended_requirements": "建議配備: 作業系統: Windows XP+ 處理器: Core i5 記憶體: 4 GB 記憶體 顯示卡: Nvidia Geforce GTX 460 or AMD Radeon HD6850 DirectX: 版本：9.0 儲存空間: 1800 MB 可用空間",
    "reviews": [
        {
            "review_text": "Too many bugs. The character always gets stuck on a jumping mode or a crouching mode when it arrives at the corner of something (e.g. wall) and there is no way to get up again. Sometimes the spacebar just doesn't work. So many things are happening when the character was running, it ruins the feeling.  When I sent out this comment I have already played for 2.1 hours so it is too late to return, so I keep finishing the story. During the time, there are more bugs:  1) When I do the speed run and finish the running, and I hit ESC after the score pops up and than I hit ESC again to close the menu, than the 'Home / Rerun' menu pops up, and it cannot be clicked or highlighted! 2) I don't understand why but the game frequently goes into a strange situation, than the screen begin to shake. 3) Sometimes the game doesn't react to my key if I am pressing too fast (I play Starcraft!). For example, when I am landing and hit shift, the character crash into the ground.  I don't need to comment on the game play or design. Only talking about the the technical part, it is enough to make me don't believe that those developers really want to make a game.",
            "review_score": "-1"
        },
        {
            "review_text": "This was a pretty good game. I didn't play it until after the big patch they released, so I didn't really have any bug problems. The game ran great. Teenagers, ninja's, and pizza, what's not to like? The bully stuff isn't to overhanded, so it doens't interupt the game play. The game is a 2D runner. The maps are challanging, and the reply value is there in different modes for you continue doing once you complete the main game. The soundtrack was nice too. It doesn't take too long and was a good value for the price.",
            "review_score": "1"
        },
        {
            "review_text": " Me : Ninjas and Pizza? This is basically every mans dream combination.  Distant voice : What about the girl?  Me : Gemma? Oh she's cool,  BUT THE PIZZA!  *mouthwater intensifies*  Ninja Pizza Girl is a game about a girl named Gemma, who helps her dad deliver pizza... the cool way, by jumping over roof tops like a true ninja. But Megaco, a big company who monopolises the industry in the game, hired ninjas to stop Gemma from delivering pizzas (ps: the ninjas are jerks).   What I like:",
            "review_score": "1"
        },
        {
            "review_text": "This game is good and the controls are simple. It's short, but it has alot of replayablity...to me anyway!",
            "review_score": "1"
        },
        {
            "review_text": "Great game to know kick back with silly but fun game play don't care for the cut scene pictures.",
            "review_score": "1"
        },
        {
            "review_text": "Have followed this game since its beta and it has really come along! While I think a couple of the themes the game raises (there are a lot of them!) could be fleshed out a little more, the gameplay and story are very enjoyable!",
            "review_score": "1"
        },
        {
            "review_text": "A short-but-sweet platformer with likable characters, some good mechanics and a strong message.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, fluid platformer! Enjoying it greatly.",
            "review_score": "1"
        }
    ]
}