{
    "app_id": 319560,
    "name": "Reprisal Universe",
    "release_date": "2014-09-15",
    "developer": [
        "electrolyte"
    ],
    "publisher": [
        "electrolyte"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Strategy",
        "God Game"
    ],
    "achievements": 0,
    "positive_ratings": 286,
    "negative_ratings": 75,
    "price": 4.99,
    "description": "Reprisal Universe places you in charge of the very elements themselves. Raise and lower land to expand your tribes, harness the power of fire and water. Explore the hidden mysteries of the Universe and gather your people together once again.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/319560/header.jpg?t=1478094276",
    "minimum_requirements": "OS: Windows XP (sp2) or later Processor: 2.66 GHz Dual Core Processor or equivalent Memory: 2 GB RAM Storage: 180 MB available space",
    "recommended_requirements": "Memory: 4 GB RAM Network: Broadband Internet connection",
    "reviews": [
        {
            "review_text": "Lightweight, but dangerously absorbing.   The really long tutorial might be a turn-off for some, but past that you'll find a rather neat universe exploration mode that allows you to leave a mark for the next generations of players to discover.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic successor to Populous! Recalls much of what made those games so much fun but adds some nifty new ways of going about your Godly activities. However, gameplay feels a bit manic and repetitive. Overall, a wonderful remake and the art style does a lot to make the gameplay seem fresh yet retro but never boring.",
            "review_score": "1"
        },
        {
            "review_text": "Only an hour in and I can already say I feel like I got my money's worth and then some.  Its the same kind of feel I had with Godus, but much, much more refined. The system and upgrades feel natural and its a simple and easy mechanic to get, rewarding the gameplay well.  A good god-game I could say you'll enjoy despite its simpler graphics, and well worth the cost.",
            "review_score": "1"
        },
        {
            "review_text": "Main 30 Mission Campaign) complete # About 5 hours # thumb middle (not up or down)  Reprisal Universe is a populus game, basically. A 'god' game, like Black and White (*Sigh). You do not directly control your population, but rather build terrain, summon spells, and influence population and movement.   Pros: - Art style is awesome.  - Interface is sleek and clean - Map/world is almost exactly like populus.  Cons: - Scrolling the map is unecessarily slow. There also doesnt appear to be an option to just drag (like a right click/drag). You use WASD, which is tedious. - The actual playable space on the screen is a fraction of the screen. I can see why they did this, as an ode to populous, but it doesnt really make a lot of sense and the space you COULD have used to see more of the map is not used for no real reason. - Kinda shallow. You spend time either evicting people from their homes to force them to create new ones, which expands terriotory and overall army strengthm or you use powers. The powers look cool, but there isnt really any situation, at least IMO, that any power is particularly useful in a specific situation.  Neutral: I have never failed a mission and i use basically the same techniques each time. The levels dont seem to force you to adjust like most well designed games do. This is a bit of a bummer.",
            "review_score": "1"
        },
        {
            "review_text": "Build your civ, disrupt the others, be a vengeful god.  Great casual game.",
            "review_score": "1"
        },
        {
            "review_text": "it's not bad, if you're a heavy RTS/god-sim person then you might enjoy it and I did enjoy it for a good amount of time but I found myself pretty much repeating the same tactic every map (god help you if it's 4v4)  if the devs read this I will say I did like the idea of expanding out the universe in a competitive mulitiplayer way that was a nice idea",
            "review_score": "-1"
        },
        {
            "review_text": "Pros:  - Graphics Look Good From Far Away  Cons:  - Graphics Look Horrible From Close Up  - Boring  - Writer Can't Write Correctly  - Bad Controls  - Stupid AIs  - Way Overpriced For What It Is",
            "review_score": "-1"
        },
        {
            "review_text": "super fun and super addicting, nice and cheap- could play this forever!!!!... now thats an idea.... P.s. Tell my wife i love her...",
            "review_score": "1"
        },
        {
            "review_text": "I dont know what I just did but I got an island just for me 10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "After playing for 5min (30) I already find the game worth buying. Basically you make terrian flat to make your house bigger (the bigger the more powerful) and then you build up a friendly colony...and then you SLUAGHTER YOUR ENEMIES!!!...yeah. ",
            "review_score": "1"
        },
        {
            "review_text": "A lot of people call this game a Populace clone, but I don't know what populace is and so I'll have to give you an assesment based on its own merits. Reprisal Universe is a fun, fast paced, god simulator title that pits you and your tribe against other tribes. As the god figure for your own little band, it's your job to lead them to victory through manipulation of the terrain and use of your godly powers (conjuring lightning storms, creating volcanos, summoning heroes, ect.). As I said it's fast paced with a typical match lasting from anywhere between seven to fifteen minutes, making it a nice little game to play while taking a break from something else or whenever you're looking to kill a few minutes. That said, I find that it gets a bit repetative and can get old fast. As I said, it's a game you play for short stints not hours on end. It's got a nice pixelated asthetic going on for it as well. I also have to point out that Reprisal Universe doesn't do anywhere nearly enough to explain some of its mechanics, such as what exactly legacy points are (they're points you get for 'Reprising' worlds but beyond that the game gives no hint of what they actually do or mean and good luck trying to find an answer online, I don't think anyone else has a clue either) and what exactly happens when you level up one of your abilities. You can clearly see a progress bar advance, but I haven't noticed leveling up actually effect gameplay at all and I have no idea what stats, if any, have been improved because the game doesn't tell you.  The AI, both of your units and your opponents, is painfully slow on the uptake at times, but can still a moderate degree of challange. If you're looking for a real hardcore experience, however, you'll be disappointed. There is no difficulty adjuster and you can usual beat any mission the game throws at you by you second try if not your first. None have been so difficult that I have had to attempt anything a third time.  I personally recommend this game but please keep in mind everything that I have said above. This game is not without flaws, and although I can look past them because I find this a fun game to play while I wait for something else, I image that not everyone else might be able to.",
            "review_score": "1"
        },
        {
            "review_text": "It's too repetitive once you get into some kind of groove.  - Wake everyone up.  - Flatten all the land around your settlement(s).   - Spam fire and lightning on enemies. Repeat.  You do a lot of flattening. Tons. I tried to get creative and hinder the enemy with mountains or sea. I don't think it was worth the time. Maybe encouraging enemy tribes to fight each other instead of you would work.  I won't bash it hard for $7 and only 2 hours of playtime. It's stylish and fun. It might be great for you. So far, it isn't great for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Could be fun but the UI and controls really stopped me from getting pulled in.",
            "review_score": "-1"
        },
        {
            "review_text": "This is quite a decent game, I picked this up for £0.49 and I haven't put it down! This game is a great way to kill time and have some fun.",
            "review_score": "1"
        },
        {
            "review_text": "needs more Cars 2 references but still pretty fun",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why everyone thinks the controls are bad or the tutorial's bad, it was fine with me.   BUY THIS GAME. NOW. It has beautiful graphics and is a great break from instense games like CS:GO or TF2.  Don't get me wrong, thinking that this game isnt intense and a walk in the park. IT. IS. NOT. This game is a strategy game, and at the start, you will lose, but don't ragequit. If you're stuck, you can: Isolate your base into an Island. Break all the bridges that the enemy make when they're walking on them (I don't know why but it's really satisfying). Smoke, then throw the molly through tuns (Ok, maybe this isnt accurate but meh). And last but not least: KAMIKAZE EVERYTHIIIIING!!!  PROS: Addicting game. Great experience. Great Break from FPS games. So much content.  Cons: Rage-Inducing. Hard to start off. (Just like my... math homework). Controls a bit difficult at first.  All in all, great game. Shibby rate 0/10 I rate 2/1  I can't math.",
            "review_score": "1"
        },
        {
            "review_text": "Hell yea I'm gonna flatten those mountains and burn my enemies!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing little indie game. Essentially you're an all-powerful sentient being, with a tribe on an island that also houses other opposing tribes. Using your elemental powers, you're meant to terraform your surroundings so that your people can build bigger buildings and produce stronger villagers. Being RTS, it's up to you to decide when to set your opponents on fire, start a flash-storm, turn their village into swampland, etcetera, and when to direct your tribe to focus on expanding, or on taking over utilising manpower, among other strategic options. Lovely pixel visuals, great accompanying soundtrack and all-in-all very well put together, making for a wonderful experience.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game Reminds of Populatus &amp; Godus &amp; Dungeon Keeper, Quick Game plays For fast learners, Pros: +Pixel Shader Graphics +Neat GUI +Game Play Feels Simple +Not Much, Not Less. To do.  Cons: -Not 3D Hard to shape the land. -Fps 30, Doesnt matter what pc you got. _____________________________ Everything else Just Fine. Great Game worth buying!  Recommending This game!",
            "review_score": "1"
        },
        {
            "review_text": "Very well formed little god game. My only regret is not having discovered it sooner!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game! If you like games where you try take over 'factories' that produce soldiers, and you try to capture all the points, then you will probably like this.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and interesting strategy game with some unique mechanics. There is something fun about having the little minions running towards their expansion or attacking objectives that is fun when combined with the art style.   Great graphics and art style. Really nice UI and UX flow smooth and thoughtful. Worth checking out for strategy fans.",
            "review_score": "1"
        },
        {
            "review_text": "I recommended this game, reasons : The game is cheap, not only that, the game is more like to get into a new feeling, the game is a real time strategy, where you need to big an empire as big as possible, the hardest part is that the game is harder and harder and you need to make a really hard decision weather you need to expand now, or not, the game is easy at first because, y'know tutorial. but, the truth is that the game is not fun to play by hardcore player like Warcraft 3, Starcraft 2 but more likely to people that has less money or people that wants to find a new mechanic to the game, the graphics are good for a cheap game, but still, what I believe in my suggestion is that the game needs what I called something new, Like tf2, it's slowly boring because the weapons are like that, you used them like that no more than that(Just example) what I mean is add something new, like a new powerup or something *Just Saying* thx for reading this, and have a nice day",
            "review_score": "1"
        },
        {
            "review_text": "If you want to play populus get this. My only issue is its sometimes difficult to see terrain levels if theyre partly behind objects.",
            "review_score": "1"
        }
    ]
}