{
    "app_id": 319740,
    "name": "There Came an Echo",
    "release_date": "2015-02-24",
    "developer": [
        "Iridium Studios"
    ],
    "publisher": [
        "Iridium Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Sci-fi"
    ],
    "achievements": 16,
    "positive_ratings": 248,
    "negative_ratings": 87,
    "price": 10.99,
    "description": "There Came an Echo is a real-time strategy game in which the player assumes command of a small squadron, using an advanced voice recognition system to issue orders. It features a character-driven sci-fi narrative that stars Wil Wheaton, Ashly Burch, Laura Bailey, Yuri Lowenthal, and more!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/319740/header.jpg?t=1478078195",
    "minimum_requirements": "Минимальные: ОС: Windows Vista 64-bit Процессор: 2 GHz Dual Core Оперативная память: 4 GB ОЗУ Видеокарта: NVIDIA GeForce 8600 GT / ATI Radeon HD 2600 XT or greater DirectX: Версии 9.0 Место на диске: 8 GB",
    "recommended_requirements": "Рекомендованные: ОС: Windows 7 64-bit Процессор: 2 GHz Dual Core (Intel Core 2 Duo 2.4 GHz or Athlon X2 2.7 GHz) Оперативная память: 8 GB ОЗУ Видеокарта: NVIDIA GeForce 9000 series / ATI Radeon HD 3000 series or greater DirectX: Версии 9.0 Место на диске: 8 GB",
    "reviews": [
        {
            "review_text": "In a digitally-aware world encryption is everything. In light of recent revelations involving the NSA and GCHQ spying on much of the world’s internet traffic, encryption has become a hot button issue. Whether you know how it works or not, it’s there securing your online presence against unwanted intruders. And yet, how often do you stop and think about the people who make your communications and data secure? Not often, I’ll wager. In There Came An Echo, Corrin is one of those people, one of those geniuses, you might say. He’s your typical computer whizz and he is about to become embroiled in something larger than himself, or anything the physical world has to offer.  Corrin anonymously released an open source encryption software into the public domain, called Radial Lock. Its claim to fame is that it cannot be broken in any way, and its open source code is testament to that, but there’s one problem: the hardware to support it does not exist yet. Or so Corrin thinks. Unbeknownst to him, Radial Lock has been put into use by a shadowy organisation and it is securing some highly coveted data. He quickly finds himself backed into his office whilst armed troopers search for him, and that’s where Val and Sam come in.  Val acts as Corrin’s assistant and overseer, while Sam takes on the role of commander and provides the orders that will keep him safe. You will assume control of Sam and direct Corrin, and his comrades, through dicey situations to find out who is searching for him, and for what cause. You won’t be using traditional control methods to guide Corrin though, granted they are there if you want to, instead you are encouraged to use nothing more than the power of your voice to guide him on his dangerous mission.  “Voice controls?”, I hear you moan dubiously. “Yes, voice controls”, I retort in a confident manner. There Came An Echo‘s main draw, aside from sporting Wil Wheaton as the voice of Corrin, is that you can control the game almost entirely with your voice. Past games have attempted this to some degree of success, but never in a way that felt essential, or anything other than an afterthought. There Came An Echo brings this control scheme front and centre,, with Val gently guiding you through the game’s various systems, such as movement, weapon swapping and attacking. The system is quite robust, allowing you to order multiple units around at the same time, or dish out commands to all but one unit. Within a few minutes of getting to grips with the voice commands I began to feel distinctly like I was gaming in the future. This is what a gaming evolution should feel like.  Ordering Corrin and his accomplices around is so smooth and intuitive that it becomes second nature almost immediately, but there are some caveats that you will need to understand fully before beginning. While the voice command system is incredibly in-depth, and works with many different dialects and accents, even my Scottish accent, it relies on you being clear and enunciating each and every word. If you mumble or shout Val will pop up on-screen to let you know that no one can understand what you are saying. Be it through necessity, or just my wish to stop having Val pop up on my screen, I quickly learned the ins and outs of the system.  Controlling Corrrin using nothing other than my voice was an absolute blast. Aside from the few times where the voice recognition system refused to play ball, everything played out so cleanly that I couldn’t believe what I was seeing. And that is no understatement. Telling units, calmly and clearly, to switch guns and travel to new defensive points on the map, and seeing them do exactly as I said is something of a watershed moment in gaming for me. You don’t have complete control over your units though, and they do not have the ability to freely roam each level, instead there are zones dotted throughout each area which you will guide Corrin to using the phonetic alphabet. So, if you want Corrin to go to Alpha One, you would simply say “Corrin go to alpha 1″. Or, if you are lazy like me you can simply say “Corrin, Alpha 1″, and he will run towards that location. In the heat of battle you will be dishing out orders at a brisk pace, so remember to be calm and clear, you’ll have a much more fun if you do. You’ll also get to feel like an awesome tactician!  All missions in There Came An Echo play out very similarly, first starting out with a load out screen where you can choose each party member’s guns and perks. As well as the bog-standard pistol you can choose a secondary weapon which drains your energy bar as you use it. Energy is important because it powers your shields, so you’ll want to use your sidearm carefully and effectively. Although it is possible to use your pistol for most of the combat, you will probably struggle to proceed in some of the tougher parts of the game.  Finding yourself under heavy fire from enemies wielding charge guns is a common occurrence, but you can turn the tables on them by laying down suppressive fire with the screw gun. When your opponents are on the backfoot you can then attempt to flank them with a unit or two, and hit them with a taste of their own medicine. Let me tell you, there are few more exhilirating feelings than successfully outwitting your enemies in There Came An Echo. Each level is dotted with these tactical opportunities which highlight wonderfully just how responsive and fun the voice recognition system can be. Admittedly, the action is formulaic but Iridium throw a few curveballs in there to keep you on your toes, too.  As a spoiler-free review I won’t delve too much into There Came An Echo’s story, but it is filled with deceit, mistrust, love and greed. You may even come away questioning the nature of your very existence. With multiple agencies out to find him, Corrin is torn in multiple different directions by people who want to use him for their own gain. Over the course of the game he transforms from a nerdy, bookish type into a man who is able to take the initiative and do what needs to be done to ensure his survival. The highest of praise should be lavished upon the entire voice cast for bringing a touch of emotion and realism to what can otherwise be a sterile genre. Wheaton, in particular, shines with a solid performance throughout.  There Came An Echo could be the title that takes voice controlled games into the mainstream. Voice recognition should no longer be a selling point to be cynically emblazoned upon a game’s box, in the hopes that consumers who don’t know any better will buy it. It should be here to stay, and the hard work that Iridium have put in should be refined and incremented upon for future titles. Quite simply, it sets a standard by which all future games with voice controls should be judged.  More please.  ---------------------------------------------------------------------------------------------------------------------- Disclosure: review copy provided by Iridium. Original review can be found at  criticalindiegamer.com/2015/02/there-came-an-echo-review-pc/ ",
            "review_score": "1"
        },
        {
            "review_text": "I'll start by saying this game is awesome. Awesome means to inspire awe, and the fact that I did 95% of the control with my voice was just that. It's good. You get pretty fast at it, which is good, because combat ramps up fairly quickly.  There Came an Echo has a fantastic voice cast. Wil Wheaton was good and hammed up up a little, but that's okay. Dramatic scenes call for a little melodrama. Laura Bailey is one of my favorite voice actresses. Period. And she kills it in this. The combat never loses track of the story, and if your crew seems a bit willing to go along with questionable activities... just remember people are trying to kill them.  Finally, a big kudos to Iridium for being responsive during launch. There were some bugs with microphone volume and the system forgetting to listen to you. Those got fixed (for me) the first night. You guys are great and you deserve all the support in the world.  Pros Voice input system! Enjoyable voice acting. Great soundtrack. Clever level design with mechanics that aren't just 'kill everyone'. Developers were actively involved and interested in making sure everyone has a good play experience.  Cons I had to wait one night for a patch. Oh lordy. ;) I could have played another 40 hours of this game but beat it in a little under 5 hours.",
            "review_score": "1"
        },
        {
            "review_text": "It has Ashly Burch. 10/10. Seriously, this game is amazing, assuming you can actually get the voice commands to work. I had to fiddle with it for a while, but they seem to be working now. Good story, great concept, awesome voice acting.",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't unique, but it is interesting. SOCOM did something similar previously, but this takes to another level. The voice recognition requires some tweaking on your part, but also on teh devs part as many people are having hiccups. I found setting the mic vol to 50% and choosing low sensitivity allows you to speak more naturally without shouting, and if you shout the commands still register.  The soundtrack is absolutely brilliant and Big Giant Circles and Ronald Jenkess have come up trumps again. A mix of orchestral music, indie, and electronica. It really is out of this world. Seek out their other works.  Now to the game itself. It's a fun ride, and your aim is to gradually gather 4 units under your control. The progression is gradual so you don't become too over whelemed by having too many units. You start with one, then two, then three and so on till you reach four units. The first few levels serve as training missions of sorts. It's the mid interval in the game that becomes more tactical and interesting.  To stop the player from getting lost, there are predefined routes that the units can follow. So a spot called Alpha 1 or a spot called Bravo 2. Shouting out Move to Bravo 2 suffices, though you can be longer in your command by combining with other commands. Such as 'Corrin (the character you control) move to Alpha 1, Miranda (another unit) move to Bravo 2, on my mark. MARK'. This sequence allows you to send two units simultaneously waiting for your say so to move.  Combat is very much an automated affair, you do have some control, but you will always get hit. You can out flank the opponents by moving around the predefined spots, moving and grouping the enemy together so you can nade them. It's really clever and well executed. I like it beacuse even a casual can play this game and like an RTS and delve further, but it makes the whole process more engaging. I don't like RTS typically, but if there' smore like this, then I'll be hooked and find a new genre favourite.  Now the bad bits. it's relatively short. This may matter but if time is your key to game fun, then this will flop for you. I dont care about these things, but your mileage may vary. The graphics are average at best, the 2d stylized work is great, but the 3d models leave a lot to be desired. I forgot the game was at final release, and assumed it was Early Access. Not so. It's great to see a complete game from time to time. Anyway, graphics are subpar at least. Sound wise it's great, the voice recognition can be hit or miss, but hit the sweet spot with the config and it's a winner.  The writing is also cheap and clumsy. It feels lazily written, but maybe story isn't important to the game. The only parts of the story I liked were at the mid interval stage again, the plot thickens, up until that point its a predestraian affair.  I also didnt like the names under the characters in such big writing. It makes it look cheap and unpolished compared to the rest of the game.  Again none of these things matter to me, because the core gameplay is really sound. I would love to see a sequel with some online play, where only units you control are recognised by your voice, and vice versa.  Voice commanding troops is a treat, I thought it would become tiresome, but it doesn't it engages you and encourages you to become more involved. The fact that you can add an alias to most commands, is great too. I changed the alias of the 4 units from their names to whiskey, scotch, bourbon and vodka.  Good solid game, and fun, a bit on the rails I guess to some extent, but still enjoyable. And certainly not a failure.",
            "review_score": "1"
        },
        {
            "review_text": "*edit* hotfix came through and the game appears to run fine now. Haven't had much of a chance to actually play, but it works and seems fun for the short time I played it.    *old stuff* played sequence some years ago and enjoyed it a lot. I had faith in the studio so I bought this game without doing any research/reading reviews. Game crashes on the intro screen ~80% of the time and crashed after hitting play the other time I got through.   Hoping for some stability fixes asap so I can actually play  uninstalled and re-installed. Made it past the loading screen 2/3 times. Then the game crashed after I finished the first mission",
            "review_score": "1"
        },
        {
            "review_text": "(Summary at the bottem)  This game is amazing. Although I cannot fully recommend it because I personaly have sonme issues with it but i´ll explain later. This is an RTS in which you command a squad of 4 soldiers through a few missions using voice commands, yeah that´s right, you can play the entire game using only your voice (and mouse to move the camera) and it's just as awesome as it sounds, at least if the game responds to your commands and that's why I cannot recommend it to everyone, the game has a difficult time responding to accents, and although you can choose from different accents (Brittish, American, Canedian, Australian and Indian) in the menu to help the game reconising those commands better it does a poor job reconising commands I yel through the mic with my Dutch accent. From what I've read the devellopers will add support for other languages but in most cases Dutch isn't going to be one of them but they will probably add spanish, german and french and maybe a few other european languages. And even if they add Dutch the game probably still won't reconise English with a Dutch accent (Dutch sounds pretty cheesy in those kinds of games so I rather stick to english) after quite a long moment of calibrating the voice reconition system (or whatever it's called) i set the language to 'English-Indian' because that one seems to work for the most part and after a bit of practice I did get the game to respond to most of my commands untill Syll becomes part of my team. I cannot command him to do anything AT ALL, unless i change the language to 'English-United States' but when i do that the game doesn't respond when i use the word Alpha or the number 3 making it practicly impossible for me to go on. You can add custom commands and names so I tried giving Syll a custom name but so far no name I've tried seems to do the trick. furthermore I've had a lot of trouble commanding Corrin as he doesn't always respond to my commands and the game has difficulties reconising the word 'mark' even though the command 'Miranda, move to Alpha 2 on my mark' works perfectly fine. I've seen totalbiscuits video about this game and he doesn't have that much trouble at all so the game has problems with my accent and not with the commands themselfs. It is possible to play the game with mouse and keyboard but the game is too restricted to make it worth your while as you can only move your soldiers to pre selected points on the map, I don't think that's a big deal if you play using voice commands but if you can't the game is mediocre at best.   I would reccomend the game if you have an Brittish, American, Canadian, Australian or Indian accent and if you have a microphone. If you're not a native English speaker there's no guarantee the game will work for you and since the game is pretty boring to play with mouse and keyboard you might want to stay away. If you are a native English speaker (and speak with one of the accents I listed above) then you should definitly give this game a shot. I won't give this game a rating because I don't feel like I've seen enough to give it a honest rating. ",
            "review_score": "1"
        },
        {
            "review_text": "There came an echo is very good its a short story game that is about 5-6 hours and what makes it specai lis the voice actavatied features of this game . I would avoid this if you dont like voice actavatio nor dont have a mic the voice part works very well and i had a lot of fun and would recommand it.",
            "review_score": "1"
        },
        {
            "review_text": "This game has an interesting story, and can be fun. I didn't mind how short the game was, but then a little bit of me wanted it to last longer; for it felt like I didn't really get to mess with the games mechanics a lot. I didn't mind it being short though, because it was fresh to play something that didn't last forever. But it could have at least been a seven or eight hour game, not around four hours. Its very story driven, so most of the time you are just watching the cutscenes. Luckily I liked the story, and the voice acting. The music is good, as well as the art design. Using voice commands in this game surprisingly works well, and the gameplay can be fun. There is cool gameplay in this game, but the length of this game made it where you don't really get to play the mechanics more. I did say I recommend it, but just make sure to read other reviews to see if you would like this game. I definitely recommend this game when it goes on sale to experience the game at least.",
            "review_score": "1"
        },
        {
            "review_text": "The game does a great job making you feel like you are the level-headed commander giving carefully mesured orders to people who are preocupied and afraid. The time it takes to give commands so that the units understand you adds some tactical depth. You can make and excute pretty much any plan you can come up with and setting it up feels like you are talking your units though your plan. If you panic then the commands you give might not be understood by your units. You must be calm durring the real-time combat. The need to be calm and the real-time combat are a combination I've never seen before and lends a unqure feeling to the game.",
            "review_score": "1"
        },
        {
            "review_text": "The voice interface is so much fun. Understood me 80-90% of the time and I'm Australian.  You can make you own custom voice commands which has potential to get quite silly.   My inner teenage nerd really wants a Star Trek game with this voice command system :D",
            "review_score": "1"
        },
        {
            "review_text": "I backed There Came an Echo when it was on Kickstarter a couple years ago, and finally got my hands on it this past weekend. I've backed quite a few games, and this easily sits up there among my favorites.  The main appeal of the game is to use voice controls, and it really delivers. It's amazing how responsive it is to commands, and how liberating it was to be able to just look at the battlefield, sit back, and tell my people to move to positions, switch weapons, target specific people, etc. This really shines on some later missions when you have to split your team up around the map, instead of the typical micro-managing of looking at each unit, issuing commands by clicks/keys. It's a little tough to describe, but it's quite satisfying when you position your people, plan a coordinated attack, and execute it on your voice command, making you feel much more like a commander/coordinator than more traditional strategy games.  You can also customize the voice commands, so yes, you can say 'Shut up Wesley!' (if you set the command)  There's also non-vocal controls, should you choose to go that route, or if you're unable to speak, but I didn't really try them out.  Moving away from the voice stuff, here's some notes on the other aspects of the game: -great writing/story -excellent voice acting (I especially loved Val, voiced by Ashly Burch) -awesome music (I've listened to Big Giant Circles for a few years now) -nice art  note: it is pretty much a 'one and done' experience, as there's not much incentive to replay the story, but I have no problem with that, given my experience in the game, and the price point.  I finished the game in a little under 4 hours, and I feel that's completely fair at the price (I technically paid more as a backer). I did express a desire for more content to the developers, but not because I didn't feel it was long enough, rather because I was really enjoying and getting into being the strategist for these people, especially in the last 2 or 3 missions. It's fun.  I'll end it with this...I think the most telling thing to say about my experience with There Came and Echo is the following anecdote:  At the risk of an obscure end-game spoiler, you're basically prompted to say a command to end the game. Before saying the command, I sat in silence, looking at the characters, and then said 'Goodbye' to my people. I really wish they had responded, and I honestly think I felt a tear start to well up. I didn't want to end it, but I begrudgingly said the command, and the game was over.",
            "review_score": "1"
        },
        {
            "review_text": "switched voice comms of 'open fire' to 'f##k her right in the pu##y!'. It worked.  10/10 will shout at grace again.",
            "review_score": "1"
        },
        {
            "review_text": " Go here to see a full video review on YouTube   There Came An Echo is a beautiful story-driven game that has you using voice commands to control your units and defeat your foes. You follow a man named Corrin, a computer programmer who is thrust into an exciting adventure upon learning an evil organization is after his code. The story takes many twists and turns and will usually be cohesive though at times it seems like some of the plot didn't make sense in light of later developments and unveilings in the story.  There is no multiplayer and the single player only took me 3 hours to complete. I'd say this game offers very low replayability so you are banking on the idea that the quality and experience from the game is worth the money regardless of it's brevity, and in my opinion it is worth it.   Go here to see a full video review on YouTube ",
            "review_score": "1"
        },
        {
            "review_text": "TCAE has genuinely been one of those games that has come along and demanded attention - despite the occasional annoyance when a voice command doesn't register, discovering the flow of combat + issuing commands while sitting back is an ultimately rewarding experience.  Warning: If you have an odd accent sometimes it can be frustrating when a command doesn't register but ultimately the voice recognition software does an amazing job.",
            "review_score": "1"
        },
        {
            "review_text": "Very short game. finished it in under 4 hours. wish there was a sequel to this game.",
            "review_score": "1"
        },
        {
            "review_text": "Where is Korean subtitle??  How I apply to korean subtitle? I had played game with korean subtitle before I changed language setting...   How to change subtitle language..",
            "review_score": "1"
        },
        {
            "review_text": "This is a great Indie game!",
            "review_score": "1"
        },
        {
            "review_text": "Hoooly cow, where to start. This game... really starting to get into the future gaming situation. The unique concept of controlling everything with your voice and gestures is really well-made, especially now, when not many people know it's already possible. So for this reason, I recommend the game to all the people who don't believe in gaming tech advances.  That being said, it could still use some tech polish. It's a bit tough to get your voice recognized when you don't have the ability to speak really loud... guess that's supposed to be a flaw on the user's side, but you'd be surprised how many people are restricted in noise in such a way. Thus, that area could get an improvement, better voice detection.  Now for people who don't enjoy this new concept quite as much, don't worry! You can play this game XCOM The Bureau-style. Just right-click and you'll get a lot of commands... be aware though, that this would restrict your reaction time so it does make the game a bit harder.  TL,DR: The game has some troubles and some fixes... as does any other one. However, the uniqueness of the concept outweighs all possible flaws, so at least for a few years this game should meet only further success!",
            "review_score": "1"
        },
        {
            "review_text": "The main feature of the game is voice command of soldiers in a real time futuristic combat setting. I've always loved this idea, and this game does a great job of implementing it. It's not just a gimmick, it really feels like something new and fresh. I really can't wait to see more games use this feature (starship command, anyone?).  Pros: The voice command is phenomenal (I had &gt;95% command issuance success). I can't stress how amazing an experience this is Other than Wil Wheaton, had a blast with the voice acting End Credits are among the best of any game I've ever played  Neutral: Wil Wheaton voices the main character. I personally don't care for him, but others might consider this a plus.  Cons: Campaign is short War Room completable in a few tries",
            "review_score": "1"
        },
        {
            "review_text": "I loved the story, the voice acting, the art, everything was great. When the voice recognition works, it makes you feel in control in a different sort of way that a regular strategy game would.",
            "review_score": "1"
        },
        {
            "review_text": "not much 'stratergy' but it's a cool expirence for what it is, not the first game to do something like this but a pretty cool one.",
            "review_score": "1"
        },
        {
            "review_text": "“Wow, it actually works!”  My first experience with There Came An Echo was filled with careful hesitation followed by eager disbelief and curiosity. It might not be the first game to attempt voice commands, but it’s definitely the most successful at making it feel seamless and authentic. It’s such a brilliant hook that it almost feels like enough to carry the game, until you step back and look at how hollow the experience actually is.  The idea behind There Came An Echo is that it’s a game played almost entirely with your voice (there are mouse controls but I can’t imagine wanting to use them). Viewed from a tactical, isometric perspective you issue orders to characters, telling them where to go, who to shoot, when to reload; the sort of commands that have become instinctual to me over so many years of playing games, but here required I relearn how I interact with this sort of game down to the most basic function. By requiring I put previously silent button presses into words, There Came An Echo felt intensely engaging. I couldn’t rely on muscle memory and doze off, I had to constantly be aware of what was happening and find the words to convey that to my troops if I wanted to make it through a mission.  Where There Came An Echo rises above other voice activated games is in how much freedom you have in creating these commands, and how well the game interprets them. Rather than a strict list of possible orders I could give, I’d often find myself just naturally forming sentences and being shocked at how often they came out the way I wanted to. There were some instances where I attempted more complex commands than the game could comprehend and needed to break them down, but when There Came An Echo is working as intended it feels like something revolutionary, which thankfully is far more often than not.  But what are you actually doing with all these commands? That’s sort of the problem. While There Came An Echo incorporates some impressive tech, its other systems are comparatively very shallow. My first thought when realizing that the voice commands worked as intended was to wonder how far I could take them, but most scenarios I was placed in gave me little room for dynamic play. Maps are narrow and linear, and different weapon loadouts offer only very slight alterations to how you play. In a sense it feels like the game is directing you as much as you are your units, putting restrictions on what you can and can’t do while pretending to be more strategically deep than it ever becomes.  I’d have likely accepted this though if what There Came An Echo cares about most, its narrative, was worth the immense amount of time spent on it. Far from being merely drawn out and overbearing though, the writing here is positively painful. It’s also very, very weird, in its plot, its tone, its character motives; everything, really. Each line is full of earnest attempts at self-awareness, baffling plot twists, and unending amounts of technical mumbo jumbo.  It isn’t even that There Came An Echo is written so poorly, but that it gives off such a strong impression that it thinks otherwise. It tries so hard that I sort of just feel sorry for it, wondering if there was some way it could be salvaged but always coming up empty. But when it takes up more of the game than anything else, it’s difficult to write it off as just regrettable. The narrative is always there, pushing its one-dimensional characters, overreaching plot, and shallow questions as to what it means to be alive in your face and forcing you to humor them. And then it fridges one of its female characters and reminds you yet again that “♥♥♥♥♥” is its favorite word and any sympathy quickly disperses.  I’m not exaggerating when I say There Came An Echo’s use of voice commands is one of the coolest ways I’ve played a game in years. It never stops being cool either and I hope other developers will look at this and start experimenting with their own games. There Came An Echo succeeds at proving an idea works and can add a lot to a game, but when that’s all it does while bringing along with so much fluff it’s difficult for me to recommend playing it on that basis alone. I don’t consider voice commands a gimmick, but them being the sole draw here has effectively reduced them to one.   You can read more of my writing on  Kritiqal  [kritiqal.com] . ",
            "review_score": "-1"
        },
        {
            "review_text": "There are a few glaring issues with 'There Came An Echo'.  First and foremost the voice recognition is *very* hit or miss; I couldn't even control Syll until I made him 'Sam' because apparently saying 'sill' in a non-regional American accent is unintelligible. There were times I would tell Syll to do something and Miranda (or 'My' as I named her) would swap weapons or run to hard points.  Secondly, the in-game cutscenes aren't just unskippable, they take the camera hostage and throw you into the action without notice. This would be fine if it were simply added for dramatic effect, but your team is taking damage and it doesn't zoom back out or tell you that you're *actually* in a battle. Even ignoring the game's bland art assets and scene settings this was poor design.  Thirdly, the story and voices are duller than a Playdoh spoon. I'm not saying the script writers and voice actors *literally* phoned it in, but they sure as ♥♥♥♥ did metaphorically speaking. The only characters that have any actual 'character' are Val and Miranda, but even then it's glaringly obvious there was direction or inspiration given to their respective voice actors.  Lastly, while I was playing the game in English I came to a point where a countdown might compromise the mission unless I said 'Anular'. After saying a combination of 'anular/Grace go to anular/team anular' etc. a few dozen times I figured I must be pronouncing it incorrectly. No, it turns out 'anular' is the game's Spanish equivalent of 'Activate Override'. Is it a nitpicky point? Yup. Was it also an incredibly irritating and stupid oversight? You betcha.  I'd love to see more voice-controlled games in the future, but this simply falls short in every regard apart from the novelty are attempting it.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought the idea of this was cool, but unfortunately the voice recognition thing is incredibly spotty. At the best of times, it's working 80% of the time, which maybe sounds good on paper. But think about it: If you were playing any other game and the keyboard commands or control buttons only worked 80% of the time, would that be acceptable? Of course not.  The story is also complete junk. If you've ever seen Wil Wheaton do his ♥♥♥♥♥♥ roleplaying on Tabletop before, then this will seem quite familiar. I can't believe these people gave that guy money and actually billed him as a point of sale. There's a reason why his career didn't go anywhere after TNG guys.   Anyhow, don't buy this.",
            "review_score": "-1"
        },
        {
            "review_text": "The voice commands are neat but when the novelty wears off you're stuck with an ok animated simplistic squad based RTT that takes control from the player far too frequently. I played it with my GF (who is not a gamer) and she was very frustrated with how often you sit and listen to the exposition.",
            "review_score": "-1"
        },
        {
            "review_text": "Decent story and gameplay but ultimately let down by the fact that the voice controls, i.e. the main selling point, just aren't reliable. When it works it's great, but when you repeat the same command a dozen times and nothing is recognised... it's time to turn off and go play something that actually works.",
            "review_score": "-1"
        },
        {
            "review_text": "The voice commands are kind of cool, and work about 90% of the time, but the remaining 10% is a non-negligible detriment to the enjoyment of the game (and often results in game over). Although cool, the voice commands only restrict the amount of actual control you have, making the gameplay and strategy fairly shallow. At the default difficulty level, gameplay was limited to equipping the right weapons, charging in, and waiting for the fight to end. More complicated or dynamic strategy as fights progress could have been interesting, but simply isn't feasible with the voice command's reliability. Furthermore, there simply is not enough time, nor motivation, to become adept at strategy and rapidly issuing commands within the duration of the game. Needless to say, there is also little to no replay value.  It's pretty, the music and voice are phenomenal, and I applaud the exploration of unconventional approaches to user input... but as a game, it simply wasn't a whole lot of fun.",
            "review_score": "-1"
        }
    ]
}