{
    "app_id": 320,
    "name": "Half-Life 2: Deathmatch",
    "release_date": "2004-11-01",
    "developer": [
        "Valve"
    ],
    "publisher": [
        "Valve"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Valve Anti-Cheat enabled",
        "Includes Source SDK"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 6020,
    "negative_ratings": 787,
    "price": 3.99,
    "description": "Fast multiplayer action set in the Half-Life 2 universe! HL2's physics adds a new dimension to deathmatch play. Play straight deathmatch or try Combine vs. Resistance teamplay. Toss a toilet at your friend today!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/320/header.jpg?t=1512752170",
    "minimum_requirements": "1.2 GHz Processor, 256MB RAM, DirectX 7 level graphics card, Windows XP, Mouse, Keyboard, Internet Connection Recommended: 2.4 GHz Processor, 512MB RAM, DirectX 9 level graphics card, Windows XP, Mouse, Keyboard, Internet Connection",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is a hidden gem among the deep heart of steam's heart. Half Life 2 Deathmatch throws all the HL2 weapons and throws you in an amazing selection of maps to fight in. This game is the lovely old deathmatch styled games. You either kill, or be killed! No hiding like games nowdays. You are the man, the badass, the ♥♥♥♥. Skill is everything, not some weapon you need to buy for 5 dollars. Half Life 2 Deathmatch takes the badassness to the next level. You get to throw toilet bowls at each other with the gravity gun and get to time frags like a boss. Sadly, the fans of deathmatches aren't as popular as the past. So recommend this piece of badassery to your friends. 10/10 Can shoot toilet bowls",
            "review_score": "1"
        },
        {
            "review_text": "we want VAC work well and ban all cheaters here",
            "review_score": "1"
        },
        {
            "review_text": "Great game, definitely one of the better games of my childhood and still the best around. Has Fps action + the ability to 'sprint' with the games physics allows it to be a fast-er point and click shooter if not the fastest and the props/objects effecting it even more make it unique requiring good senses, reflex, smart reactions, coordination with just about everything to play at a decent potential. Where else can you Yoyo a grenade to keep it from 'cooking' it's fuse out before propelling it on it's last fuse reset that you can time for distance and height in coordination with how fast you are moving and your target's speed and the force of the 'gravity gun' you use to propel it with, no where else but hl2dm. Has different kinds of unique weapons like the gravity gun propelling a object to a person to kill them with, or propelling that object against another object to move that away from a distance. And to block a path with many objects or stack objects to reach a platform. Also the crossbow is an example of unique weapons with how it fires in a arch and hard to aim with even with it's scope but can kill a player instantly and with correct positioning can bounce of the floor walls ceiling terrian etc. and with enough practice can be well aimed to kill a player half the map away behind 2 corridors and a room. That is a taste of the Uniqueness of this game, after overlooking it's default multiplayer team vs team worth, there is it's booming in vast unique options to how to play the game with it's community's modded creations, there is co-op themed maps where you can fight with teammates against hordes of aliens, zombies, monsters and cyborgs getting points with the ability to use them to unlock server abilities to costumize your character with a deferent apearence, both in model skin and size, lights that glow on your model, lights that follow your model and more, then there is puzzle maps where you may enter 1 of 12 parts of the map at a time with your team or individualy and complete tasks like finding the exit in a labyrinth or placing and freezing a pile of crates to build a terrian leading to a exit floating high above in the sky or surfing on long slides without falling into abyss to reach a exit or jumping over ditches, climbing and avoiding obstacles in a temple like area to reach another exit to collect all exits and unlock the last portion of the map to complete it. Then there is Roleplay... a blend of multiplayer fps combat with gta style like the need to Purchase weapons or health or armor. Earning money by the minute with the wage given by your level or killing others for their pocket money, then saving that money to invest in a faster method of earning money like growing drugs to sell or printing money both to us on getting more guns or to purchase a home to hide in and to keep your drugs or printer safe, from other players or other players playing as Cops... who may not only steal your illegal possessions but will also place you in jail for some time so that they too may earn the points they need to progress faster and easier in that server. You may also invest in a home to hide from all players and keep your possessions safe, and to meet with your group of friends to prepare for a war against another gang, or to meet with your gang to prepare for a war against the police in alliance with other gangs for fun or for an event to earn more $. Also events are constant and include situations where a monster is spawned in the map similar to the any/many of the ones found in co-op maps that drop money on death. Another situation would be looking all over the map to find an object or player hiden with more $ $ $ that is given to the winner that finds it first. Or when admins just decide the server is full enough for a mass money drop in the middle of the map including weapons and item drops. There are also many more mods but I just thought to name a few of the ones that have me so adicted to this game. This game is worth the very low ticket price for all the fun is has to offer and is very much Alive, if not so is still rich with creativity you never know what's next. I rate it 5 out of 5 stars * * * * *.",
            "review_score": "1"
        },
        {
            "review_text": "Lotsa fun for any type of thing you lke to do deathruns rps deathmatch etc. (-Mar 17, 2012)   (old review just putting this new scoring card in) Story: X Gameplay: 8/10 (It is limited.) Presentation: 7/10 (Source. old. meh. works though.) Soundtrack: 8/10 (I don't remember any BGM, however the SE are superb and recognizable) Replayability: 7/10 (If you have garry's mod this will replace it.)",
            "review_score": "1"
        },
        {
            "review_text": "Valve has a history of making famous Deathmatch games, and thats beacuse they don't bother over complicating the concept of Deathmatch. Tihs game along with Day of Deafeat Source and Counter Strike Source are simple and yet have raked in players by the thousands upon millions. It's a simple Deathmatch experience but it's not anything new. 2 Teams pitted againnst each other with your usuall Team Deathmatch action, nothin to complicated but it is still fun.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever!  Update 17/August/2015:  Waiting for HL3DM",
            "review_score": "1"
        },
        {
            "review_text": "Never gets old love this game!!",
            "review_score": "1"
        },
        {
            "review_text": "  Eh, I played a little of this game.... Its alright :D",
            "review_score": "1"
        },
        {
            "review_text": "somewhat dead community but still a great game if you can find players",
            "review_score": "1"
        },
        {
            "review_text": "Such a shame no one plays this game, as it's a lot of fun, that is if you can actually find a server.",
            "review_score": "1"
        },
        {
            "review_text": "Really Really good, Boried of Half-life 2 or any game? This is the perfect game to come to and have a battle.  also you might rage because rpgs are to O.P.  But anyways it's good  9/10",
            "review_score": "1"
        },
        {
            "review_text": "  Greeeeat game. Idk why people dont play it anymore but you can always find servers that contain lots of different gamemodes. This is a great game if you want a break from cs:go or etc because of the fast gameplay and the maps included or downloaded from comunitty servers. Also for some unknown reason i got it for free so meh...",
            "review_score": "1"
        },
        {
            "review_text": "This game taught me that toilets are a way more dangerous than guns.",
            "review_score": "1"
        },
        {
            "review_text": "Love HL2:DM.. Just wish more people played..",
            "review_score": "1"
        },
        {
            "review_text": "if you havnt played this, its a must!",
            "review_score": "1"
        },
        {
            "review_text": "I wish more people played this back in the days over a decade ago.",
            "review_score": "1"
        },
        {
            "review_text": "The game itself can be a lot of fun and feel familiar for fans of classic deathmatch games like Half Life: Deathmatch or Unreal Tournament, and if played as such this game can be greatly enjoyed.",
            "review_score": "1"
        },
        {
            "review_text": "good game agent blows",
            "review_score": "1"
        },
        {
            "review_text": "Old times :)",
            "review_score": "1"
        },
        {
            "review_text": "It's free if you have a Radeon or Nividia video card, and you basically fight people with HL2 wepons.  Does it get better?  Yes.   Does it get better for free?  No.  And free gets pretty damn good.",
            "review_score": "1"
        },
        {
            "review_text": "this game just brings a tear to my eye ;_;",
            "review_score": "1"
        },
        {
            "review_text": "Very nice multiplayer game... NEED MORE PLAYERS ",
            "review_score": "1"
        },
        {
            "review_text": "the game is the reason why i broke my hard drive",
            "review_score": "1"
        },
        {
            "review_text": "tons of fun, grams of lag",
            "review_score": "1"
        },
        {
            "review_text": "May sound very strange, but the first game I bought on Steam. It's pretty much Half Life 2 multiplayer, it's okay, though a little (very) outdated this day in age.",
            "review_score": "1"
        },
        {
            "review_text": "Its half life 2 but deathmatch",
            "review_score": "1"
        },
        {
            "review_text": "I love half life 2 dm is because it is fun",
            "review_score": "1"
        },
        {
            "review_text": "10/10 10 years later",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ the deathmatch part of it, play the coop maps.  Тсарь бы адобрил.",
            "review_score": "1"
        },
        {
            "review_text": "It is a very very funny game! Great for playing with friends when you are bored!   So go ahead and buy it if you don't have it yet! Great experrience!",
            "review_score": "1"
        },
        {
            "review_text": "So many ways to kill people. Never fails to impress.",
            "review_score": "1"
        },
        {
            "review_text": "Nice, now you can play with the pros.",
            "review_score": "1"
        },
        {
            "review_text": "Best multiplayer shooter ever made.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game to play with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "Still the most fun you can have without having to crowbar a jakey",
            "review_score": "1"
        },
        {
            "review_text": "cool game :)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game but there are these servers with low gravity and insta kill like if your in the air it takes 20 seconds to get on the ground PAST THAT how can you change teams im always on rebels PAS PAS THAT pretty good game it looks fun and it is fun it is worth your money buy it i bought super hexagon and this with my 10 US dollars pretty good",
            "review_score": "1"
        },
        {
            "review_text": "A great multiplayer game for Half Life 2.",
            "review_score": "1"
        },
        {
            "review_text": "Great!! The Game play is Fantastic The Maps are Good.It Lacks on maps i wish they would put more maps but still a really great game it's Multiplayer so it is gonna be super rasticlly fun.  G  E T  T H I S  G A M E  B R O S !",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "sweet spaghetti ♥♥♥♥ batman this game is fun",
            "review_score": "1"
        },
        {
            "review_text": "Fun multiplayer game. As with all multiplayers the level of enjoyment depends on who you play with. Play with friends and joke around and you'll have a great time. ;-)",
            "review_score": "1"
        },
        {
            "review_text": "The greatest chair-throwing simulator of all time.",
            "review_score": "1"
        },
        {
            "review_text": "This game was my best part, Combines, Rebels Funny moments, like dm_lockdown and Maps were my best game ever thanks for valve for making this.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "  AKA Half Life 2: WHAT IS HAPPENING AHMHMSHHGDHASA...Fun Game Though! Adding Physics To Half Life: Deathmatch Is Like Adding Peanut Butter To A Jam Sandwich.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun shooter in the HL2 engine (Source).  Great graphics and has held up well Fun gameplay Great maps",
            "review_score": "1"
        },
        {
            "review_text": "Basicly dayz 10/10 best game probaly",
            "review_score": "1"
        },
        {
            "review_text": "This game was the game that started it all for me. I met some of the best people playing this and also met my husband!!!",
            "review_score": "1"
        },
        {
            "review_text": "A timeless classic, one of the original FPS games that inspired all modern shooters. Must buy 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's the best game ever, easy to modify. But I don't recommend buying this. Many cheaters, no competitive scene, empty servers.  This is the game, which should have the biggest community!",
            "review_score": "-1"
        },
        {
            "review_text": "I beat jebu at this game so it is good game.",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game to play, and just for $5.00.WOW! I want to play this with my sis.",
            "review_score": "1"
        },
        {
            "review_text": "some guys are too pro with the toilets its hard 2 play",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game to play, and just for $5.00.WOW! I want to play this with my sis.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game, bare bones and with few maps, but the abilty to play with bots in servers is good and it's a good game to just pick up and play.",
            "review_score": "1"
        },
        {
            "review_text": "i think i quit this game because of scripters but i forgot. i may have gotten banned from this one too. good one valve",
            "review_score": "1"
        },
        {
            "review_text": "Man I love the Half-Life series. I bought this game because: 1) It was on an off sale week. 2) I wanted to play some type of 'Half-Life 2 Shooter/Free play/Deathmatch' kind of game and I haven't found that in Garry's Mod. And oh boy how I'm disappointed.  I wanted to play Half-Life 2 Deathmatch Vanilla, and i failed to find one with good connection (which is hard as i live in Brazil). Almost ALL of the servers are flooded with these annoying mods like explosive crossbow, intense weapon reskins, annoying kill sounds. I would accept at maximum that gravity mod and other really simple mods. Even though this game has a little quantity of weapons, they are INSANELY unbalanced. Rarely you will spawn without getting killed in 3 seconds with rocket launchers or one shot kill crossbows. Or you join a server expecting to kill some people, or more probably get killed, and you end up in a roleplay server. I thought a paid for a shooter.  So I had enough of multiplayer, and I went try singleplayer with bots. And guess what? There was no singleplayer bots, and I had to download an addon. The mod was annoying as hell to use, as I needed to write a line of code to spawn only 1 bot (meaning i had to spam that line to max up). Also, the bots were constantly getting stuck and flooding my console with errors. But in the end, I had more fun playing with these broken bots then in multiplayer. The game also feels abandoned. Servers usually had 3 dudes playing on it and there was no dedicated servers.  Though many of these problems are not the game's fault. It's more the people who use it, and the terrible country I live in. I had an awful experience with this game, though you should still try it out.",
            "review_score": "-1"
        },
        {
            "review_text": "all the snipers in this game are using bazookas 9/11",
            "review_score": "1"
        },
        {
            "review_text": "all the snipers in this game are using bazookas 9/11",
            "review_score": "1"
        },
        {
            "review_text": "Cheap game for few rounds of fun.  I don't think that you will be playing this a lot. Mainly because of the small amount of servers and nothing else to do. No spawn protection, no official servers, gets boring very quickly. This should be a part of Half-life 2.",
            "review_score": "-1"
        },
        {
            "review_text": "TOO MANY WTF MOMENTS IN THIS GAME!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1!!!!!!!!!!!!!!!!!!!!!!!!!!!!!ONE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Deathmatch. With Half-Life 2 equipment. (!?!) Nothing much else to say. Game appears completely abandoned by devs.  first impression: 3/10",
            "review_score": "1"
        },
        {
            "review_text": "very bland deathmatch. it's as fun as running around on a Garry's Mod server shooting people",
            "review_score": "-1"
        },
        {
            "review_text": "this game is great!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very challenging at fun. If you like TF2 or CSGO and want more of a bit of challenge then this game is for you :)  ",
            "review_score": "1"
        },
        {
            "review_text": "'I win, I always win. I never lose.' :)",
            "review_score": "1"
        },
        {
            "review_text": "It would be rude to say no to this game. Poor Lord Gaben. Everybody hates his deathmatches.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2: Deathmatch is the multiplayer version of Half-Life 2 and is a fast-paced First-Person Shooter.  You are provided a lot of ways to kill your opponents, such as shooting SMG's, Shotguns and pistols, throwing grenades or using the gravity gun to launch props at enemies. The game doesn't have a big community and there are a lot of empty servers, but there will always be enough players to fill at least 9-10. As a new player you will die a lot, the skill ceiling of the game is big and people with thousands of hours still play and wreck newcomers. The psysics engine is good and the players have made many maps. Also, there are a couple of servers with mods.  Whichever prop you launch, the kill icon will always display a toilet. Cause, why not?  ",
            "review_score": "1"
        },
        {
            "review_text": "baffling that theres no players pretty damn fun",
            "review_score": "1"
        },
        {
            "review_text": "HAHA,realy good game!!",
            "review_score": "1"
        },
        {
            "review_text": "The multiplayer is almost dead because of unbalanced SF stuff. it`s something else when you play campaign and it`s totally different when you play MP. It`s good, but for me it`s not my style.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "  Fishing/grapple servers for days.",
            "review_score": "1"
        },
        {
            "review_text": "This game is nothing dull or not-fun. It's really fun actually. This game is a DeathMatch that uses hl2 models and weapons only, it means no counter strike weapons, only half life2. It uses some maps that I haven't seen in half life, still it makes it even better. This game is really fun. 8/10, would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2: Deathmatch is the multiplayer version of Half-Life 2 and is a fast-paced First-Person Shooter.  You are provided a lot of ways to kill your opponents, such as shooting SMG's, Shotguns and pistols, throwing grenades or using the gravity gun to launch props at enemies. The game doesn't have a big community and there are a lot of empty servers, but there will always be enough players to fill at least 9-10. As a new player you will die a lot, the skill ceiling of the game is big and people with thousands of hours still play and wreck newcomers. The psysics engine is good and the players have made many maps. Also, there are a couple of servers with mods.  Whichever prop you launch, the kill icon will always display a toilet. Cause, why not?  ",
            "review_score": "1"
        },
        {
            "review_text": "Worth The Money, Gr8 Fur LOLZ",
            "review_score": "1"
        },
        {
            "review_text": "I adore this game, about 57 hours of this game were spent on a 'killbox low gravity server' which kinda made it emphisise timings with bunny hopping, strafing in air and reactions with gravity guns. Game servers are kinda dieing, check on steamcharts before buying.",
            "review_score": "1"
        },
        {
            "review_text": "this game is really fun I used to play this game like all the time because of coop. coop is the best thing ever made. so I will suggesd this game to you (sorry for my ♥♥♥♥♥♥ spelling) ",
            "review_score": "1"
        },
        {
            "review_text": "Heres the thing. Its not that great BUT some of the modded games can be interesting like if they involve user made physic puzzles.   If you just want a shooter get Counter-Strike:Source or just play the actual Half Life 2",
            "review_score": "1"
        },
        {
            "review_text": "Guy threw a radiator at me but I dodged and smashed a toilet into his face but also he rolled a grenade under the toilet so then I *HUGE BREATH* flew back and my head landed in the same toilet I killed him with. Whew. That was a lo- oh right.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Half Life 2: Deathmatch is definitely my favourite source for a fun multiplayer experience to waste many hours, get some gibs, and probably be gibbed much more.  I find the simplistic nature of it, similar to Quake days, but with the unique flavour of Half-Life with the Gravity Gun, to be a much funner experience than that of what Team Fortress 2 brings. Less can be more, and HL2:DM excels in what it tries to do.  Before TF2, there was HL2:DM for me, and 9 years later, it still feels great logging into a server, hearing the screams of all of those around me that endlessly kill one another, and try to survive in it all, so that just maybe I can make it on the top of the scoreboard by the end of the round.  Rating: 5 Thrown Toilets / 5",
            "review_score": "1"
        },
        {
            "review_text": "i am not able to start it. im running it on a windows xp, 512 Mb ram, 2.80 Ghz processor, intel platnium 4 proccesor and is crashing on start up. can someone help me please?",
            "review_score": "-1"
        },
        {
            "review_text": "4/5",
            "review_score": "1"
        },
        {
            "review_text": "A very simple Deathmatch version of HL2. Simple, but very fun. Extra fun for people who love tossing toilets at people.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, the multiplayer is dead. It is hard to find a normal server. If you like 1 shot kills, pretty lame RPs, or just servers that you mess around on, this is for you. If you have a large group to play it with, I do recommend it. Other wise, it is pretty dead.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly, the multiplayer is dead. It is hard to find a normal server. If you like 1 shot kills, pretty lame RPs, or just servers that you mess around on, this is for you. If you have a large group to play it with, I do recommend it. Other wise, it is pretty dead.",
            "review_score": "-1"
        },
        {
            "review_text": "  Sorry for short review: it's ok.",
            "review_score": "1"
        },
        {
            "review_text": "Alot of people on this game know their ♥♥♥♥ and will do the thing where they lob a nade and switch to graf gun and ♥♥♥♥ your ♥♥♥♥ up soon after. ♥♥♥♥s with my brain but damn i get ♥♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "The Very Best.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ THIS ",
            "review_score": "-1"
        },
        {
            "review_text": "I loved HF2 and really wanted to like this game, but I was very dissapointed. Very few servers had players and the two I did try were dominated by pros who decimated new players. WIthin 5 minutes, I was so fustrated by the one-sided battles that it stopped being fun. Honestly, if you dont mind dying a lot and rarely making a kill, the guns and maps are fun&gt; however, for most players, it will be aggrevating. Trust me, go TF2 instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Just an Endless cycle of killing, not exciting.",
            "review_score": "-1"
        },
        {
            "review_text": "HL2? Check. Multiplayer? Check. Daddy's Credit Card? Check.",
            "review_score": "1"
        },
        {
            "review_text": "dont spend ur game on this if u buy it, you will be experiencing servers with 300 ping+ and if u try to make your own server, its only local, ur friends cant join and also theres no options to add bots! PLS REFUND!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Not the most fun multiplayer experience for me.",
            "review_score": "-1"
        },
        {
            "review_text": "It was a very good game during its time, but the community has died down a lot now.",
            "review_score": "-1"
        },
        {
            "review_text": "Deathmatch port of Half-Life 2 from 2004. Very dated FPS mechanics (obviously) and empty servers - avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "  4 out of 5",
            "review_score": "-1"
        },
        {
            "review_text": "Here's something better. Start up Garry's Mod. Set up sandbox server. Choose map. Run around with HL2 weapons and kill each other. There.",
            "review_score": "-1"
        },
        {
            "review_text": "why is this cancer on my steam library",
            "review_score": "-1"
        },
        {
            "review_text": "Why do they call it deathmatch when I didn't turn into a giant flaming match'",
            "review_score": "-1"
        },
        {
            "review_text": "Good Deathmatch =)",
            "review_score": "1"
        },
        {
            "review_text": "BY GOD why would something with the word DEATHMATCH in its name have its own game? why would anyone want to buy an online multiplayer fps game that only has deathmatch? WHY? and its not even a good game. if your new to the game like i was you just get owned by everyone espesually when its in a map that hase so many openings. once you spawn YOU DIE. all u ever need is the revolver and crossbow and THATS it. there arent even any cool weapons other than the ar2(wich is useless btw) unlike the first hld (wich shouldnt have its own game either) wich had a ton of cool weapons (but thats probably because hl1 had cooler weapons then hl2) plus using the grav gun isnt gunna help u. sometimes there are servers that dont even give u the grav gun(btw good luck on trying to find a server that dosnt have crazy plugins)(just like in tf2 wich is definitely better than this game) this game shouldnt cost money its just deathmatch. it seems like it would be like a gmod special game mode. (cant say the same about the first hld). the only reason you should buy this game is A if your buying hl comeplete wich for some reason has tf1 in it or B so you can have all the gmod mounts wich is both the reasons why i have this game but its just MY OP",
            "review_score": "-1"
        },
        {
            "review_text": "The same as Half-Life Deathmatch: Source but HL2... with HL2 guns and stuff...  6/15 - 'Half-Life Arena Again! Gets boring!'",
            "review_score": "-1"
        },
        {
            "review_text": "They just gave me this and I don't really know why. I wouldn't call it a 'game'",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a low quality game filled with low quality people. Enjoy!",
            "review_score": "-1"
        },
        {
            "review_text": "Whether you like the Half-Life story or not this game would pick you up instantly. This game has the fast-paced gameplay that surpassess Team Fortress 2 and is up there with Counter Strike: Source. This title offers all of the weapons, locales, and characters that Half-Life 2 had. While you may begin to think it is only just killing with Half-Life weapons, you're wrong. The Source engine's hyper-realistic physics adds one of the most immense and chaotic settings to a multiplayer game I have ever experienced. The gravity gun is equipped to all players and there are tons of physics objects that can be used as weapons. With the Source engine and its endless possiblities, this game is a must-try, especially for non-Half Life fans. The price is inarguable how much this should have more players on the servers. Try Half-Life 2: Deathmatch today!",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite multiplayer games. I've spent over two hundred hours playing it, and playing mostly user-made maps. It was a lot of fun, though I'm sure not much is happening in servers now; it's been a long time. One things for sure, the days of custom maps are over, and if you missed them, you'll never know how much you missed. Still, give this game a shot. I'm sure you just got it with a bundle, and yeah, mostly hardcore fans will be playing. That just shows their dedication to a game worth reviving, though even I got a little frustrated the last time I played. Maybe HL3 deathmatch...too bad that will never happen.",
            "review_score": "1"
        },
        {
            "review_text": "Despite how it may look, this game is probably one of the best games to mess around in with your friends. If you are a loner, i would not recommend this game to you. However, if you have 3 or 4 friends and nothing to do for 2+ hours, than this is your game.  'Like Skyrim with Half-Life 2' - IGN  10/10",
            "review_score": "1"
        },
        {
            "review_text": "fun game but gmod is better",
            "review_score": "1"
        },
        {
            "review_text": "Everyone else is really good at this game. Im not at all. But it is satifying to kill someone with a chair.",
            "review_score": "1"
        },
        {
            "review_text": "Great, simple and fast game.. Kill or be killed, nothing more. There are two types of gameplay - deathmatch and team deathmatch, whitch I really enjoyed (Combine vs. Rebels). The game includes almost all the weapons from HL2, excepting Strider Buster.. 89/100",
            "review_score": "1"
        },
        {
            "review_text": "catch this toilet",
            "review_score": "1"
        },
        {
            "review_text": "Really fun especially on the CO-OP servers",
            "review_score": "1"
        },
        {
            "review_text": "Thi game is really fun. Highly underrated.",
            "review_score": "1"
        },
        {
            "review_text": "Fun.   5/10 - Would Deatmatch",
            "review_score": "1"
        },
        {
            "review_text": "10/6",
            "review_score": "1"
        },
        {
            "review_text": "This game is a semi-ghosttown, but when you get a well populated server (I recommend saigns.de servers, in this and other games too, because you also play with bots) , but it has many fun gamemodes and this game is worth it. It now is 0.99 until 1st October, so it IS worth your cash and time ",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game yes",
            "review_score": "1"
        },
        {
            "review_text": "You wanna know whats make this multiplayer uniqe and much more fun than unreal, quake or other old school fastpaced games?  Gravity gun !  This element makes game much more unperdictible and fun. If you have skills and some balls you will like it too =D",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game to play if you like free for all FPS's, lots of great servers and most of the people on them just want to have fun! You get an occasional ♥♥♥♥♥ but I haven't had much issue with that. Lots of fun!",
            "review_score": "1"
        },
        {
            "review_text": "tired of shooting bullets? well you can kill people with toilets here",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty fun. My fav. server that I reccomend for all of you guys isthe Pow Mia server. It has bunny hop, low health and more, this was my first multiplayer shooter so i really think it's cool!",
            "review_score": "1"
        },
        {
            "review_text": "I like this game,it has a lot of action,with a lot of different places to go to,you can always find an exciting game going on some where.",
            "review_score": "1"
        },
        {
            "review_text": "fast paced and verry fun. keep up with bug proble,s and i will play for life.",
            "review_score": "1"
        },
        {
            "review_text": "This was another game I enjoyed playing. Haven't played in a long time though.",
            "review_score": "1"
        },
        {
            "review_text": "A majority of servers are dead, but theres still some kicking. I recommend it because i had fun and its still playable and as long as i find it amusing then i dont see the problem. Give this a try when you get the chance and if you are in a mood to try it.",
            "review_score": "1"
        },
        {
            "review_text": "Used it as a benchmark. Just for the lolz, I tried it on my Windows 8.1 tablet (which has Intel Atom Z3470 1.3 GHz, 2GB RAM, 32GB storage) and it managed to get 50-60 FPS at 1368x768 with all settings maxxed except for AA and AF, with no framerate drops. I checked Task Manager and it was only using about 200MB memory. My anti-virus was using more than that! Uninstalled McAfee.  DAT OPTIMISATION!!",
            "review_score": "1"
        },
        {
            "review_text": "Basically GMOD with no spawnability.",
            "review_score": "1"
        },
        {
            "review_text": "this is a good game, its fast paced and addictive.",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite fun, especially on Killbox, my fav. map so far. I play this game when I am bored and own dem n00bs with the crossbow. The crossbow was my fav. weapon in the original half-Life, but I feel that the HL2 crossbow has a slower projectile, just me? Good game, good game",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥, I went in thinking this would be your usual free-for-all game, but it felt like more than that. I can't explain it. The players are nice and supportive when you're newer, there aren't children playing, and it just feels like a solid genre-defining FPS experience.  10/10 better than CoD",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing if you like HL2 or HL then you should definitely get this! It is a very addicting balanced game and it's not p2w either. In the beginning you will get destroyed but as you keep playing the better you get until you're finally really good. Very alive and active community.",
            "review_score": "1"
        },
        {
            "review_text": "is gud game u buy now and max out u r credit card trying to git gud",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed it alot. Thanks Valve for this game in 2004.  100/100",
            "review_score": "1"
        },
        {
            "review_text": "its very fun to play and i enjoy the gameplay so much! theres not alot of servers though that have people.",
            "review_score": "1"
        },
        {
            "review_text": "Will never tire of this game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Gravity Gun Grenades &amp; Empty Servers: The Game",
            "review_score": "1"
        },
        {
            "review_text": ". ",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend this game to any one who likes fps,i cant believe im saying this but this game is waaay better than team fortress 2 because there is so much havoc in this game and chaos its so much fun i couldnt stop playing it for awhile and this game is both fun and funny and its also great with friends too",
            "review_score": "1"
        },
        {
            "review_text": "Never thought it would come to this, on my first game, I became the top player on my team, got a killing spree, and dominated. I am very used to the weapons of the HL2 universe so I was able to become good pretty quickly, all I can say is, I hope you guys have the same experience as me!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. 100% more awesome when playing with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Used to play this game so much... think it's time to get back into it. Great time killer :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun,I Like the physics,I Like the guns",
            "review_score": "1"
        },
        {
            "review_text": "HL2 Deathmatch is a very addictive FPS and is very cheap and a pick-up you will not regret buying!",
            "review_score": "1"
        },
        {
            "review_text": "WHAT THE ♥♥♥♥ IS GOING OOOOOOOOOOOOOOOOOOOONN!??!!?!?",
            "review_score": "1"
        },
        {
            "review_text": "Perhaps The greatest Fps of all time. Excellent game system. Grav gun and nade catch will be something you will rmemeber fondly well into old age.",
            "review_score": "1"
        },
        {
            "review_text": "if you ever wanna play a game without stunned ♥♥♥ little kids trying to ruin it this is ur game",
            "review_score": "1"
        },
        {
            "review_text": "Imagine you're a yung T-DANKS waiting for the school bus to arrive on a cold monday morning. Birds are chirping and the cold Michigan air is making your breath visible (jk he's just exhaling his dank herb you dweeb' Anyways, the bus is late and you, T-DANKS, are getting impatient with waiting. All of the sudden a massive portal appears on the baron street outside of your country home and Gordon Freeman comes driving up to you in a red convertible. 'Sup T-DANKS, wanna smoke the meanest strain and ride with the grimiest?' He says. You reply....  'Hell yeah G-Freeman lets get ripped.'  2 weeks of unindentifiable drugs and women l8r, G-Freeman hands me a copy of Half-Life 2: Deathmatch.  'Bruh, just cause call of duty is a hit dont mean you can ride the dragon yanno what im saying??'   'But dude, screw hl3. Competitive fps games are the future.' he says.  You take his word for it and start the game up....  As you enter the server you can hear children arguing over how they had intercourse with eachothers mothers. You giggle and go three hunda on they ♥♥♥'s and they rage quit and you feel the positive vibes flow through your loins.   Good job Freeman.  10/10 super dank vibes from this one fellas.",
            "review_score": "1"
        },
        {
            "review_text": "  Came with Ep1, needs reviving, someone get together a group, we need a FaZe HL:DM group now!",
            "review_score": "1"
        },
        {
            "review_text": ". ",
            "review_score": "1"
        },
        {
            "review_text": "Oldschool Fun For Everyone!",
            "review_score": "1"
        },
        {
            "review_text": "This game is ok.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it just 30 minutes ago, And im in love already. Typical Valve, The best games for a good price.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "&gt;half-life 2 multiplayer edition &gt;custom mod support &gt;almost dead community (dont blame me) &gt;roleplay servers (not like gmod) &gt;cant change fov (I like it so why not) 8/10 would bang",
            "review_score": "1"
        },
        {
            "review_text": "One of the most unique PvP games i have ever played. The gravity gun makes the whole gameplay different to any other game! I hope to see HL3 soon and hopefully with HL3 - Deathmatch.  The graphics have now aged and not many people still playing on the servers like there ware when i played this everyday. Its been a few years, but still a fun game!",
            "review_score": "1"
        },
        {
            "review_text": "It's like CS:S but you kill with gravity guns and toilets. 6/10 It's okay",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2: Deathmatch is a game that takes the weapons, environments, and game mechanics from Half-Life 2 and puts them into a PvP multiplayer game. If you couldn't tell by the title of the name, Half-Life 2: Deathmatch puts you into the boots of either a Rebel or a Combine soldier and you fight the opposing team to the death. All of the weapons from Half-Life 2 are in this game, including the Gravity Gun. So, yes, you can pick up a toilet and launch it at your enemy to kill them. You will start with a set of weapons usually consisting of a pistol, SMG, stunstick, and Gravity Gun. You will have to go searching for your other weapons including the shotgun, crossbow, magnum, and AR 2. You can also pick up the weapon that your dead foe was using when they died. If they dropped a weapon you already have, it will be given as ammo for that weapon. Ammo, health, and suit chargers will also be scattered throughout the map. Be sure pick up those as you go. (Using health and suit chargers may leave you out in the open, so be careful of enemies.) The core character mechanics from Half-Life 2 also make a return, the only difference being that your character moves a little faster. That means that shooting while sprinting is still a thing. While it may be a bit cheap, it's still a game mechanic to be exploited. That also means that the game is a lot more fast-paced and frantic then most multiplayer FPS games on the market such as Call of Duty or Battlefield. (Note: I don't hate these two game series. So, shut up.) The maps in this game are based off of areas in Half-Life 2. While most aren't ripped straight from the game, I feel like maps like Lockdown is ripped right from Nova Prospekt, a level in Half-Life 2. There's also tons of people still playing this game. Though most servers may have bots, that shouldn't stop you from enjoying this game. Overall, Half-Life 2: Deathmatch is a really fun multiplayer game. It's currently only $14.99 on Steam. You also don't need a very powerful computer to run it. So, go check it out.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Super good gunplay, gravity gun is awesome, maps are good, gameplay is addictive, power weapons are nicely balanced, physics are superb  Cons: mostly dead (play with friends)   only a few servers running",
            "review_score": "1"
        },
        {
            "review_text": "Half Life 2: Deathmatch is a fantastic Game. The Gameplay is really good, the Graphics is good (Yet Simple), The Maps are great. The only thing about Half Life 2: Deathmatch that disappointed me was the fact few play it. And it's hard to find a Server with Players. But when you do find a Server with Players, you'll love it. A fantastic Multiplayer Experience. If only there were more People to play it Collapse.",
            "review_score": "1"
        },
        {
            "review_text": "its very fun to play and i enjoy the gameplay so much! theres not alot of servers though that have people.",
            "review_score": "1"
        },
        {
            "review_text": "A really fun game to play with your friends",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ING HILARIOUS great to play with mates",
            "review_score": "1"
        },
        {
            "review_text": "This game, after you've played counter strike for example, it is easier. Being an easier game is funner for an hour straight of gaming. Love it.",
            "review_score": "1"
        },
        {
            "review_text": "great. simply great. must have for every shooter-lover.",
            "review_score": "1"
        },
        {
            "review_text": "Whole lot of YUP!",
            "review_score": "1"
        },
        {
            "review_text": "The game is best to kill some times. It's kinda old now so yeah, not so many people still play this. I would recommend Counter Strike Source and Day of Defeat Source for your pleasure. Anyway, there are some uniques modded modes by the community worthed trying out.",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely amazing game if your playing dm, coop or puzzle maps. Such a shame that more people dont play this game...",
            "review_score": "1"
        },
        {
            "review_text": "This was the first game I turned on when buying the Half-Life series on sale (just 1, 2, and this). As soon as I got onto a server (minus the painstaking wait of downloading the effects), I wet my pants from laughter.    The gravity gun is all it takes to make this game a gem. If you want to have a gut-busting deathmatch by chucking explosive barrels and toilets at enemies for kills (don;t worry, there are guns, too), this is your type of game.",
            "review_score": "1"
        },
        {
            "review_text": "Aww man! Get to shoot stuff at people play surf deathrun. all that good stuff :D",
            "review_score": "1"
        },
        {
            "review_text": "This game used to be free, but its gone to £2.99 now. Still an excllent price and there is so much in the game to do.  I go on it with 4 of my friends usually, and come off the game in a better mood than in-which i came on.  Defonatly worth the buy, even though it used to be free.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game modes, adorable gravity gun and other cool weapons :D",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2: Deathmatch,  Written by : ISayonI ------------------------- Gameplay: 6/10 Puzzles: 9/10 Action:8/10 Atmosphere: 5/10 ------------------------- This game is worth the money, pretty much shooting. And lots of team work. If you wanna play on Team Deathmatch. For the puzzles, yeah its pretty cool to play 'Puzzle Maps'.  Have fun!",
            "review_score": "1"
        },
        {
            "review_text": "Do you like to paint things ? Do you need dark red ?   Well this game lets you pain with dark red paint( BLOOD ifyou don't understand sarcasm )  Long stupid review short You'll have fun with this game if you have one or two friends but by yourself it's mostly pointless  Definitally recommend getting it",
            "review_score": "1"
        },
        {
            "review_text": "One of the best multiplayer games out there! If you like Half-Life 2 and fast-action multiplayer, it's for you! And you can throw toilets! 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "This Deathmatch is as usual the ♥♥♥♥! Its halflife come one people whats not to love about a gravity gun! LOL",
            "review_score": "1"
        },
        {
            "review_text": "You should get this if you have a nVidia graphics card. (It's free, anyways.) Gameplay's not exactly excellent compared to Battlefield Bad Company 2 and the Call of Duty series, but free's free, and it's a refreshing break from the traditional war-based shooters.",
            "review_score": "1"
        },
        {
            "review_text": "Just buy the stupid game and play it. You won't be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "Apparently every thrown item in this game is a toilet. Useful information for real life. 10/10 Would throw cabinet toilet again.",
            "review_score": "1"
        },
        {
            "review_text": "AWSOME TF2 STYLE SHOOTER I LIKE IT BUY IT :D",
            "review_score": "1"
        },
        {
            "review_text": "Gravity gun = GOAT",
            "review_score": "1"
        },
        {
            "review_text": "So I got Half Life 2 Deathmatch on the steam sales partnered with the Games CSSOURCE and Day of Defeat, I didn't buy the back for this game at all but it provided an added bonus and so I played my games, I played a tiny bit of Half Life 2 deathmatch and to me it felt like a gmod gamemode But recently I revisted it, I found it really fun It quite crazy but its good fun just running around getting kills, I especially like the gravity gun in it. However it isn't exactly the largest game you get what you pay for, theres 1 mode on about 7 maps, but its a good casual game! and with some tweeking maybe even the addition of classes this could be an excellent standlone multiplayer shooter, Its good fun and you should get it its only 3.99!",
            "review_score": "1"
        },
        {
            "review_text": "Great lan party game",
            "review_score": "1"
        },
        {
            "review_text": "Better engine and new (different) weapons.  The title says it all: Fun 2.0",
            "review_score": "1"
        },
        {
            "review_text": "this game is very buggy but  very fun to play and i love how you can  just move stuff around and hit people with it",
            "review_score": "1"
        },
        {
            "review_text": "Half Life 3 Confirmed!",
            "review_score": "1"
        },
        {
            "review_text": "This was another game I enjoyed playing. Haven't played in a long time though.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game. Just am not good at deathmatch style games. (Guess it's because I get killed off almost at once!)",
            "review_score": "1"
        },
        {
            "review_text": "This game os awesome and coming back the servers are finnally full and the Roleplay is the best. (BETTER THEN GMOD) Check out KA-RP server iy is the best",
            "review_score": "1"
        },
        {
            "review_text": "I would honestly recommend downloading Half Life 2: Deathmatch because it is great fun. The servers are fantastic giving varieties of different game mode servers such as co-op zombie killing servers, deathmatch servers, TDM servers, build puzzle servers, roleplay servers and many more. If you're looking for a game that has these modes, then HL2 Deathmatch is just for you!",
            "review_score": "1"
        },
        {
            "review_text": "This game is the ultimate toilet flinging simulator",
            "review_score": "1"
        },
        {
            "review_text": "'You killed me!' 'You shot me in the face with a Toilet Seat!'  'No the Lazer-mine that killed me - sent that toilet seat into your face'  'oh, good times'  'Yo I just killed somone with a milk Carton!'",
            "review_score": "1"
        },
        {
            "review_text": "best deathmatch game ever",
            "review_score": "1"
        },
        {
            "review_text": "Needs more players. So buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Fastpaced and entertaining!! A must have!",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "awsome!!! ",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2 Deathmatch is a FPS / First Person Shooter.  This is the online part of the game. Keep in mind this is only multiplayer so no story mode. There are many servers to play still after all these years it's out. Normal...... as many custom servers so allways you can find something new.  You can buy this with a packeds with HF2 or seperately for sale.  One of the best fun multiplayer FPS game still to play. Score 10/10 !!",
            "review_score": "1"
        },
        {
            "review_text": "10% of deaths in HL2:DM are legit. The other 90% is BS and your weapon changing when you acciendently walk over one... But 100% awesome! ",
            "review_score": "1"
        },
        {
            "review_text": "The multiplayer portion to an amazing game. Pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly challenging deathmatch game, excellent for LANs with its extremely rapid and lethal gameplay, reminiscent of single player but rewarding careful observation and quick thinking.  Great fun, especially with friends around. Suprisingly suited for duels.",
            "review_score": "1"
        },
        {
            "review_text": "HAHAHA Joseph is so ♥♥♥♥ at this game",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game but to be honest needed more dogs  ",
            "review_score": "1"
        },
        {
            "review_text": "Ultra hardcore game mode from HL2, really funny, recomended",
            "review_score": "1"
        },
        {
            "review_text": "Hi Community,  HL2DM was the first game you have to have Internet to create an account, the game ans so on. Only for this game i got an it connection. I have plyed the game almost for TEN years and in my opinion it is one of the best Multiplayer online Deathmatch/Team Deathmatch game, if you have learned the advanced techniques like fast orb, fast nades etc. it will bring you alot of fun, believe me. Alone with the Gravity Gun was a great thing to have in the game. I am pretty sad about, that this game seems to be dead! But hey, maybe a new DM version comes along with HL3, that would be awesome, when the game comes out at all. Summa Summarum it`s to say that this 'mod' of the genuine Half Life2 game is the best i have played so long. I personally give this game a 8.5 from 10.  I wish you all the best and god may bless you.  Greetings  ﮎмąçқ",
            "review_score": "1"
        },
        {
            "review_text": "Die by the toilet!",
            "review_score": "1"
        },
        {
            "review_text": "I think Half-Life 2: Deathmatch is a pretty cool guy. eh kills friends and doesn't afraid of gravity gun.",
            "review_score": "1"
        },
        {
            "review_text": "Ah this game oh the fun I use to have with this well now its very empty which I expected I mean it can only last for so long but does it hold up and should I buy well no sadly and thats not because its bad its just empty I would stay away until its free.",
            "review_score": "1"
        },
        {
            "review_text": "Half life universe (y)",
            "review_score": "1"
        },
        {
            "review_text": "I don't even remember playing this.",
            "review_score": "-1"
        },
        {
            "review_text": "Ever wanted to kill your allies in Singleplayer on Half-Life 2 but never finding your heart to/ able to? Now you can and with good reason too. 'cause everyone else wants to crush you duuuuuh",
            "review_score": "1"
        },
        {
            "review_text": "HL2DM is a great game with far better hit detection than say CSS. However, with that said the game is nearly dead. I booted it up today to find 4 servers one of which was empty, another had 2 players, a third was password protected, and the 4th had six players playing a varient with one shot 9mm kills. If it was free I would would without a doubt reccomend this game, but with a five dollar price tag and the game having such a small playerbase(almost to the point of unplayabilty) I cannot reccomend it.",
            "review_score": "-1"
        },
        {
            "review_text": "its half-life. and deathmatch. whats not to love. just get it",
            "review_score": "1"
        },
        {
            "review_text": "I dumped over 400 hours into Phoneburnia, Zombies @ Phoneburnia, and Killbox Maps and a lot of other great servers. My Gateway to PC Gaming.  RIP 05/26/2010",
            "review_score": "1"
        },
        {
            "review_text": "It is a good game! Great to spend your time when you are bored.",
            "review_score": "1"
        },
        {
            "review_text": "I love the weapons of hl2 but its too bad I can't kill my friends with them...but wait! What's that over the horizon could it be...? It is. Half life 2 deathmatch a fun and kind of silly add on to hl2 but this can get competitive with a group of friends and an empty server, this game is like, for lack of a better term, cod,tf2,and hl2 together-tf2s zaniness, hl2s weapons and character models, and cods competitive fps side. I really enjoy this game, its not needed for the story of hl2 but for the gameplay.  ",
            "review_score": "1"
        },
        {
            "review_text": "Best game 10/10 if you havn't played it you don't know how much fun you''re missing. I have played this game for about 6 hours, and i can confirm it's awsome as hell!",
            "review_score": "1"
        },
        {
            "review_text": "Shark_Elite has an aimbot",
            "review_score": "-1"
        },
        {
            "review_text": "you can throw explosive barrels at people......enogh said",
            "review_score": "1"
        },
        {
            "review_text": "I dumped over 400 hours into Phoneburnia, Zombies @ Phoneburnia, and Killbox Maps and a lot of other great servers. My Gateway to PC Gaming.  RIP 05/26/2010",
            "review_score": "1"
        },
        {
            "review_text": "First game I got on Steam....those dank times",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike and Half-Life had a baby. A horribly deformed baby.",
            "review_score": "-1"
        },
        {
            "review_text": "Best game 10/10 if you havn't played it you don't know how much fun you''re missing. I have played this game for about 6 hours, and i can confirm it's awsome as hell!",
            "review_score": "1"
        },
        {
            "review_text": "Best fun with props and bolts. Set traps all day . ",
            "review_score": "1"
        },
        {
            "review_text": "Pros: It's a exciting cluster♥♥♥♥.  Cons: RPG and magnums rule the warzone.",
            "review_score": "1"
        },
        {
            "review_text": "gordon freeman socializes",
            "review_score": "1"
        },
        {
            "review_text": "Great game for killing eachother in.",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually pretty fun if you find the right servers. I recommend the Saigns servers since they are non stop run and gun. Especially their RUNOFF and LOCKDOWN maps!",
            "review_score": "1"
        },
        {
            "review_text": "Smoke drugs to deal with the bugs.",
            "review_score": "1"
        },
        {
            "review_text": "Its a sad dying fast paced arena shooter, with custom maps and derpy physics. That said its still fun, except for that overpowered magnum.",
            "review_score": "1"
        },
        {
            "review_text": "Good f***ing game",
            "review_score": "1"
        },
        {
            "review_text": "Coolest Deathmatch Game Ever i Played",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It is so much fun.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 IGN childhood memories ",
            "review_score": "1"
        },
        {
            "review_text": "I can't see how this was even good back in the day, nearly everyone is using the crossbow, zero teamwork and all the mic is used for in this game is to blow raspberries down and insult eachother.  only reason you should ever play this game is because you're trapped at your nans with a netbook and don't own Counterstrike 1.6.  Personally I'm going to stick to HL2 for it's single player and remember it as that.",
            "review_score": "-1"
        },
        {
            "review_text": "AMAZING for 1v1s or playing with friends. Some people still play, but it is mostly dead now",
            "review_score": "1"
        },
        {
            "review_text": "Funny and fast gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "&lt;3 old times are the best",
            "review_score": "1"
        },
        {
            "review_text": "Got it for 79p on sale. It's absolute chaos but it's so much fun. Definetly worth purchasing if you've got the money.",
            "review_score": "1"
        },
        {
            "review_text": "As good as it was on the 1st day. There are still servers for both new ones and pro ones. This game will never die.  P.S.: 'HL3 confirmed' will come brothers and sisters. The hope will never die. Aie!",
            "review_score": "1"
        },
        {
            "review_text": "Classic Deathmatch! But the game is kinda dead.",
            "review_score": "1"
        },
        {
            "review_text": "Still waiting for Half-Life: 3",
            "review_score": "1"
        },
        {
            "review_text": "5/5 ",
            "review_score": "1"
        },
        {
            "review_text": "the crossbow is the greater god",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2 but you shoot other players. It's pretty cool, I guess.",
            "review_score": "1"
        }
    ]
}