{
    "app_id": 320090,
    "name": "This Starry Midnight We Make",
    "release_date": "2015-06-01",
    "developer": [
        "CAVYHOUSE"
    ],
    "publisher": [
        "Carpe Fulgur LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Simulation",
        "Puzzle"
    ],
    "achievements": 21,
    "positive_ratings": 40,
    "negative_ratings": 4,
    "price": 6.49,
    "description": "This Starry Midnight We Make is a celestial growth simulation game where you create celestial objects using the mysterious Star-seeing Basin.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/320090/header.jpg?t=1447363354",
    "minimum_requirements": "最低: OS: Windows XP/Vista/7/8 プロセッサー: Pentium 4 2ghz メモリー: 1 GB RAM グラフィック: DirectX 9-compatible video card required DirectX: Version 9.0 ストレージ: 500 MB 利用可能 サウンドカード: DirectX 9-compatible sound solution required",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This comes with a bare recommendation with a caveat. The game is simple. Much of the puzzle gameplay falls down to trial and error while you learn how to create various celestial objects. So if you like simple, relaxing games than you will like this. If you don't like trial and error though, this game will be INCREDIBLY frustrating.  A delightful little puzzle game with visual novel elements. Basically the crux of the game falls down to: you are asked to create specific celestial bodies (stars, nebula, planets etc) in the 'Star Seeing Basin'. The basin contains gases of five elements, and placing various 'seeds' at different locations within the basin affects what celestial object will form. So trial and error. You are given hints as to how specific things will form – which not only includes where a seed is placed in the basin, but its proximity to other placed objects – but essentially it comes down to experimentation. This basin affects the flow of energy within Kyoto. As you form new celestial bodies in the basin through experimentation and thus complete requests, you then travel to each of the five locations in Kyoto within the game which will give a progression of the story. Each location has a character to meet, and basically you affect their lives as you manipulate the basin.  One of the first things you notice is how animated characters are. Usually even with higher budget VN games it is static images talking to each other. Here there is lip-flapping, clothes and hair moving to wind etc. The drawings can be a little on the crude side occasionally, but it still fits within the distinct artstyle. The music likewise is very good and matches the mood and style of the game very nicely. The localisation is solid and has a flair and finesse to the translation that Carpe Fulgur have become known for. It is something a little different from them and adds nicely to their catalog of interesting titles. Basically this game is something good to chill and relax with.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting simulation/VN hybrid that challenges you to intuit how to develop a galaxy via alchemy. The writing's charming and the game itself is fun, even if you may brick wall in places as you try to figure out what you need to do just right. If it clicks, you'll blaze through it, and even if it doesn't, it's still a fun world to dive into briefly.",
            "review_score": "1"
        },
        {
            "review_text": "Another unique and meditative game from Cavyhouse. This is a strange game about running experiments by placing points at varying distances from each other, and learning how they grow and change over time. Certainly not for everyone, but there's nothing quite like it anywhere.",
            "review_score": "1"
        }
    ]
}