{
    "app_id": 320140,
    "name": "Absolute Drift",
    "release_date": "2015-07-29",
    "developer": [
        "Funselektor Labs Inc.",
        "FlippFly"
    ],
    "publisher": [
        "Funselektor Labs Inc."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Driving",
        "Indie"
    ],
    "achievements": 20,
    "positive_ratings": 1673,
    "negative_ratings": 225,
    "price": 8.99,
    "description": "Absolute Drift is a racing game about becoming a master at the art of drifting.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/320140/header.jpg?t=1496364654",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 / 10 Processor: 2.2GHz Dual Core Memory: 2 GB RAM Graphics: 512 MB RAM Storage: 350 MB available space Additional Notes: Best played with controller.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "CONS: -Not enough eurobeat -Not enough tofu PROS: -Inertia dorifto -Eight-Six I rate Keisuke Takahashi out of Bunta Fujiwara",
            "review_score": "1"
        },
        {
            "review_text": "Oh my. Three hours later and I'm still having a blast. Not much to it but it's an awesome title. Hope to see more!",
            "review_score": "1"
        },
        {
            "review_text": "nice music, nice drifting feel for cars and has an ae86, recommended for drifting fans :D",
            "review_score": "1"
        },
        {
            "review_text": "Post Modern Minimalism had a baby with Gymkhana and Absolute Drift is the resulting love child of the 2.  If you are a fan of drifting or motorsports in general then this game is for you. Plus the 120 bpm soundtrack will get you ready for the asphalt in no time.",
            "review_score": "1"
        },
        {
            "review_text": "Visually minimalist, simple and fun. Reminds me Micro Machines, also...",
            "review_score": "1"
        },
        {
            "review_text": "I think its best drift game in this time.",
            "review_score": "1"
        },
        {
            "review_text": "If your into drifting for high scores and testing your skill on a global scoreboard, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "i hope they add more content to this game or a map editor, other then that a very fun game. very nice sounds",
            "review_score": "1"
        },
        {
            "review_text": "Its a short game but really fun to play. When i finished the game i just tried to beat my high scores on the drift tracks. I finished the game in about 3 hours but it just maters on how u play. I really loved this game and I recommend this game a lot",
            "review_score": "1"
        },
        {
            "review_text": "This game shows how I would imagine drifting in Heaven looks like.  I bought it for 7€ and it was absolutly worth it (even the full price). Very relaxing to just slide around on the wide areas. The art style is probably not everybodys favorite... still gives a good contrast between floor and skid marks.    Pros:     + Very nice drifting feel/good physics + easy enough to learn, but still a challenge to master + sounds are perfect (great Turbo whistle and blow-offs) + the map has a great selection of places, from a harbour to a mountain lake + the music fits the game perfectly (in my mind) + has 3 modes: Drift Courses, Driftkhana, Mountain Drifts + Leaderboard for the events (weirdly Takumi Fujiwara is on first place)    Cons:     - a bit short - can be very precise with some tricks (wall tap)   !!Dont forget that it was made by only 2 Persons!!    Update Zen Edition:   (16th of August 2016)  The Zen Edition was an Update that brought in a considerable amount of new things to do including:  * A new tutorial mode to help YOU be a better and more skilled driver * Drift Lines, which are a new way to get drift points -&gt; clip them completely for a big point gain * New 'Midnight Challenges' which are mountain drift tracks at night * You can now watch yourself drifting with the new replays * An overhaul of the controls * 'Event Challenges' give you 5 tasks per track, from easy to very hard, to do -&gt; more gameplay * New achievements for the challenges  With the Zen Edition the game gets much more content and some goals you can achieve. And the Midnight challenges give experienced drivers/drifters a real challenge. And dont forget that it still costs the same as before. Also dont forget to...    Keep   Drifting   Fun ",
            "review_score": "1"
        },
        {
            "review_text": "This game must be one of the hidden gems around these parts. I loved the Drift 'Races' in the NFS Underground games, which is why I decided to check this game out and I actually got all the achievements without too much trouble. The physics of drifting are very well executed and the soundtrack gives the game a really nice atmosphere. It doesn't have that much content, but definitely has replay value, if you enjoy the art of drifting. If you want a challenge, you can always try getting 5 million points, which is what the Insane Skills achievement was in the past. Or try getting top 5% on all tracks, it's up to you.",
            "review_score": "1"
        },
        {
            "review_text": "Why is Absolute Drift a GOOD Game for you... -------------------------------------------------------------- PRO : - Great drifting handling - Awesome soundtracks - Vehicles sound's are awesome - Manuel gearbox - Car models based of real cars - Paint options -------------------------------------------------------------- CON :  - No multiplayer - Can't make custom maps -------------------------------------------------------------- I really like Absolute Drift, but it need a multiplayer.  Like a game of Initial D :)  10/10",
            "review_score": "1"
        },
        {
            "review_text": "great game if you want a short indie game to take up a few hours and there is lots of replayabillity (i can't spell) as there are a lot of different tracks. All round good game!",
            "review_score": "1"
        },
        {
            "review_text": "Can't say a single bad thing about this game. Anxious for Absolute Rally..... unless that was a lie",
            "review_score": "1"
        },
        {
            "review_text": "Nice game with great artwork and a super soundtrack. Controlling the cars can be quite challenging, especially at the beginning, I'd recommend using a controller. There are some problems with controlling the car in the normal version of the game, but after chosing the beta-version everthing's fine.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;browsing through steam &gt;sees 'Absolute Drift' &gt;initiald.jpg &gt;buy game &gt;tfw no eurobeat &gt;FeelsBadMan &gt;puts on eurobeat &gt;plays game &gt;attempts to drift &gt;itsuki.mpeg  Jokes aside, great game in general. A must for Drifting/Racing fans.",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually pretty fun to play, I like it, even knowing I'm pretty bad, even after fixing my problems, still fun.  Pros: It's has some nice gameplay and a great soundtrack, really fun to play when bored or when you're in the mood for some fun smashing into things, drifting long distances, or topping those leaderboards.  Cons: This might just be for me, but I plug in any controller, and I'm always turning left, so a few control bugs for controllers (I have restarted my computer after I noticed this problem and it was not fixed, I used both a 360 and XBone controller), very little customization, which shouldn't really be a con because it just came out, so I can understand that.  Overall, I'd recommend this game to my friends, aside from the problem I had, that can easily be avoided by disconnecting the controller(s).  (Review will change as game is updated)",
            "review_score": "1"
        },
        {
            "review_text": "No, I don't have that much time spent in the game so far. But so far I've loved every minute of playing it, whether it's on the track or just messing around in free roam trying to find the best lines. If you are interested in drifting this game is a must for you.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliantly zen game. Arcade conrols that feel simple but hide incredable depth, style for dayz and a fitting soundtrack. If you want a gamer that can make you want to fly down a japanese mountain sideways in a vintage corolla boy have a got good news",
            "review_score": "1"
        },
        {
            "review_text": "fun addicting and great :) love formula d in real life or initial d and youll love this retro feel with new school smoothness 10/10 most excited ive been by a game in a long time :)",
            "review_score": "1"
        },
        {
            "review_text": "My 9th most played game on steam and one of the most entertaining games I've played in a long time.   Pros  +++ Steep learning curve. Modern games tend to be way too simplified in terms of mechanical skill required to play in order to appeal much casual audience as possible. Absolute drift is fairly hard to learn, harder to master while keeping it fun doing that.  + Driving is really damn fun. Pulling out that perfect drift is reward in itself.  + Leaderboards. The main reason of my game time.  + Minimalistic Graphics. Result is a game that is not power hungry and looks nice and clean.  + Soundtrack. Awesome and chill.  + Initial D references and AE86. Love it.   Cons  -If you are looking for story, better go looking at other direction. There isn't one aside being told to become 'Drifting master' at the beginning.  -Short campaign mode of 30-120 minutes depending how you play it.  -Even though having minimalistic graphics i'd really like seeing some scenery around the maps.  -Performance issues in couple of maps.  -For casual play the price point might not be justified for the reasons addressed above.    Overall: Really nice drifting game that hooks you in with it's mechanical play. ",
            "review_score": "1"
        },
        {
            "review_text": "Easy to learn, insanely hard to master.  I had a blast with this, its really fun. It looks fantastic with its minimalist graphics and the soundtrack is also incredible and suits the game perfectly.  If you like competing on leaderboards and stuff then this is easily worth full price, but if you are only gonna do a single run through, you wont get that much time out of this but its still worth it if its on sale.  ",
            "review_score": "1"
        },
        {
            "review_text": "All i can say is #TOFU  Very nice drifting game At the beginning you will find the controls hard because its pretty slippery but you will get the hang of it recommended for everyone who likes drifting",
            "review_score": "1"
        },
        {
            "review_text": "Fun little game that is surprisingly hard to master.  Though 100%'ing the game and achievements can be done in a single few hour sitting the quick climb to becoming a 'drift master' is a good challenge. Cars are loose and easy to drift but hard to control. But controllable they are! This results in it feeling quite satisfying when you string together some tricks and turns and get your combo score flying high. But it can be quite frustrating when, more often than not, you don't keep control. The art and music combo is almost hypnotizing as you get mesmerized. But losing control and crashing your vehicle keeps you grounded in reality.  It really could have used a bit more depth. Overall suffers from that feeling of input lag just by it's style of driving. But this bogged feeling, whether my imagination or not, extends to the menus as well. Things could've been more crisp in that respect. And it is quite short. 2.3hrs to 100% for me. Not even enough time to 'farm' all the Steam Cards. I don't feel the need to beat my scores so I don't really see any replayability here. It could've used some sort of racing mode with NPCs or local versus. Would've been a great callback to a MicroMachines or OffRoad feel. Spoiler warning; The ending dialogue hint towards a rally themed sequel gets my nerd senses tingling and I hope to see that realized one day as the base here is exceptional.  There's definitely something here. Maybe not a ton, but something. Fun to be had for an afternoon. A perfect bundle game but might have trouble standing up to scrutiny as a lone purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Fun quick game to let your mind rest and let your fingers do the work. Such a rewarding experience to hit that perfect drift combo and slide past a cone millimeters from hitting it! And the music is great.  Only downside is the game is a bit short :/   I recommend to play with controller for best precision and feedback.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games to drift.  +Nice scoring system +Possibility to switch between assists on and off +Epic soundtrack +Car models based of real world cars +Beatiful minimalistic graphics +I like how leaderboards give you statistics about what percentile you rank in compared to the public at large  -Its a little short -No multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "Bought this because I own a drift car. Was NOT disappointed.  9/10  + High skill cap + Beautiful/Simple Vector graphics + Great progressive campaign-style mode called 'Free Roam' + No annoying crash animations, you can easily recover (truly Zen) + Price point is 'on point' for this game, got it half off + Leaderboards and World Record 'ghosts' make for a stress-free way of testing your skill + Good physics from what I can tell, not annoying like some games. Compares to GTAV physics  - No multiplayer option other than leaderboards",
            "review_score": "1"
        },
        {
            "review_text": "Pros+ Awesome Soundtrack  Great Handling Simple &amp; Stunning Design Player-Friendly Scoreboard/Leaderboard Various Level Designs  Cons- Some Tracks are Similiar to Others By Customization I Thought it was a Full Modification to Your Car Lacks Variety of Both Cars and Colors    // Good for killing time. An addicting indie game where you can spend a lot of time in.",
            "review_score": "1"
        },
        {
            "review_text": "I think I can safely call this game the Mirror's Edge of racers/drifters.",
            "review_score": "1"
        },
        {
            "review_text": "Very artful interpretation of drifting. Though, I can't remember the last game I was cursing as much, as when failing in this one :D Mostly playing it on the TV, from the sofa with a controller. Great game, something differnt!",
            "review_score": "1"
        },
        {
            "review_text": "'Absolute drift is a game about drifing' I say. ' HEY STUPID. NO DUR ITS ABOUT DRIFING!!!!' another person says. Absolute drift is a game were you drift around in worlds. You have to do certain challanges to get to new worlds. You also have to do the drifting events in order to unlock other things. This game sadly has no wheel support.( If it does it dosen't work well) This game is also very cheep and affordable. For the money that you pay I find that this game is worth it. But!!! This game does have one draw back. It kinda gets boring after doing it for more than a few hours. Other than that this game is well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is Fun but it feels like a Phone game. I Sometimes get frame drops randomly (like if I hit a wall). It has decent challanges in game and a good selection of Cars. For $12 this isn't bad but i would wait for a sale. I would recommend this game for people that like drifting and have played other drifting games before. 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": " 5/10 - Absolute Drift goes round and round and round and round...",
            "review_score": "-1"
        },
        {
            "review_text": "Cheap, Fun, Easy to learn and Drift, Whats not to Love 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Slam into a wall, combo still going   Tap a wall, lose combo  10/10",
            "review_score": "1"
        },
        {
            "review_text": "very hard",
            "review_score": "1"
        },
        {
            "review_text": "Highly addictive 'multiple try' perfectionist type of game. Nice clean and minimalistic artstyle. No night/dark mode. Runs perfectly, other than the occasional smoke caused performance drop. Locked at 60fps by default, no option to change it in the settings menu.   Sometimes I feel like the point registering system isn't quite accurate, as you can slide at quite an angle without it ever counting as a drift. Same goes for the point system in the end of a combo - when your combo ends, and you hit another drift just after, it can take quite a while for it to start registering it and giving you points.   I had the infamous Xbox One controller bug on Windows 10 and trying to fix this issue by the standard troubleshooting guide yielded no results, neither did any of the publicly available beta options help. Got in contact the developer and they were kind enough to give the beta code for the Zen edition. After that, no problems. Props for the quick answer.",
            "review_score": "1"
        },
        {
            "review_text": "5/7",
            "review_score": "1"
        },
        {
            "review_text": "  This game is the best drifiting game I have played so far, mainly because Need for Speed was always a bit too crowded and it hasn't given me an artstyle close to Mirror's Edge simplicity. For the price of the game you can get easily multiple hours of fun just from the campaign part. After finishing that one you can always tackle the highscore lists and try get all achievements.  I certainly enjoyed the ride and hope for more from the dev. Good job!",
            "review_score": "1"
        },
        {
            "review_text": "NOT NEGATIVE BUT NOT POSTIVE EITHER Got it with the humble bundle (wanted death trap and hand of fate). I really like the concept, design and the atmosphere. For me personally though it is unplayable with keyboard. Better suited to controller, where you can adjust the sensitivity of your turns. If you have controller and like drift games then ye, when it is on sale or if you want the humble bundle, not a bad little game. If not i wouldn't unless its going cheap.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game but never got it to consistently work with my xbox 360 controller. Issue hasnt been fixed in forever so Can't recommend",
            "review_score": "-1"
        },
        {
            "review_text": "I thought this game would be fun, drifting is fun, this game is not fun. The controls are terrible if they work properly at all. Dont waste your time with this, go play Dirt 3 or better yet RC PRO-AM.",
            "review_score": "-1"
        },
        {
            "review_text": "    Gameplay   A game dedicated to drifting - The only style to play is to go side-to-the-front. You have an exploration mode where you can do tricks around an open environment to unlock the next one. Each environment features different race tracks which break down into circuit tracks, Gymkhana tracks and mountain tracks. I was amused by the system but I typically failed even the simplest of turns. There are also around 6 different cars you can pick as you complete environments with each having their own advantages (Though, sometimes the difference isn't really easy to spot     Graphics   Probably my favourite part of the games was its simplistic, smooth and bright-coloured design. A weird thing is that your car  always  leaves behind trails of drift when driving, even in the air. It's very amusing to watch.     Performance   Can run on almost any current and last decade PC. Graphics options aren't available, but I doubt you will need them.     Longevity   I spent around 4 hours completing environments, but I saw little interest in the racing tracks. They felt unrewarding. So after I completed all the environments I closed the game permanently.     Summary   With eyecandy graphics and an okay gameplay system with not many features, I give it  5/10     ",
            "review_score": "-1"
        },
        {
            "review_text": "You can't rearrange the controls. You are getting a thumbs down.",
            "review_score": "-1"
        },
        {
            "review_text": "Hard and unrewarding gameplay, have fun trying to not hit walls with a terribly handling car. The open worlds just have objectives that you can complete by just doing terrible drifts and most likely ramming into walls with your cars afterwards. Tracks are just extremely frustrating, hitting walls will or will not stop your combo randomly, sometimes the game will consider your drift was not drifty enough so it will also interrupt the combo, and yet again you just hit walls over and over again  Minimalistic look that has nothing special to it, soundtrack that wanted to be 'chill' but is just bland and repetitive. Apparently there are 3 hours of music but it just sounded like I was listening to the two same songs constantly.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to play this game with my Saitek Cyborg 3D Gold joystick controller. The controlls got all messed up, the game didn't let me quit and there was no way to make the joystick work. Without thinking, every PC game, which is about cars, should support either a joystick or steering wheel input. Sticking to the X Box or Sony PS controllers is a product of a sick mind. This is the PC platform, if I wanted to play with a toy, I would have bought a Nintendo.",
            "review_score": "-1"
        },
        {
            "review_text": "Definetly NOT realistic. Its like driving on ice. You cant make a normal left or right turn without the car breaking out.",
            "review_score": "-1"
        },
        {
            "review_text": "I dont enjoy playing this",
            "review_score": "-1"
        },
        {
            "review_text": "Doesn't work with my xbox 360 controller (Win 10). Pretty crap without analogue control.",
            "review_score": "-1"
        },
        {
            "review_text": "No reason to exist. Worst 10.79 USD I've ever spent. Destiny was better than this.",
            "review_score": "-1"
        },
        {
            "review_text": "too hard to be fun, not engaging enough to make you want to get better.  'you get better by playing it!' hmm yeah, sucking at a game for many hours sounds like a good use of my time  actually you know what I'll play my other 1000 games that don't require a big time investment  bundle trash/10",
            "review_score": "-1"
        },
        {
            "review_text": "Simple, elegent, shamelessly stolen art style from mirror's edge, great soundtrack. gameplay is pretty decent too, just don't expect more than a simple platformer's worth",
            "review_score": "1"
        },
        {
            "review_text": "Only good with controller. Beat under 4 hours",
            "review_score": "1"
        },
        {
            "review_text": "So I pirated this game at first and got to world 4. That's when I bought it, and they were kind enough to keep my progress from the pirated version which I promptly reset. This is an amazing game once you get the hang of it and the visuals/music combo is to die for. and of course its just the most on point drifting you've ever experienced.",
            "review_score": "1"
        },
        {
            "review_text": "Absolute Drift - A game that actually makes me smile out of pure bliss. Awesome music and an addictive learning curve",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite fun being able to drift like a badass around five corners smoothly until you slam into a wall head on and ruins your moment. I personally like the free roam maps and I kind of rushed the game just to get to the end and I did it in 2 hours!! 10/10 will do again",
            "review_score": "1"
        },
        {
            "review_text": "1000/100 very fun game, use a controller, and plz add more worlds and missions, beat in 2 hours very fun, very addicting ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best drifting games out there. I think it's underrated. One should really consider it on a sale.   Graphics:  Interesting simplistic concept.  Vehicle control:  Sim-like controls but yet, somewhat arcady. Not very easy to control the car. Which is a good thing for this kind of game.  Music:  Not my kind of music. Weird techno-pop-trance ♥♥♥♥ going on.  Cars:  Several vehicles to choose from. They differ in speed and handling. You can paint cars and/or put stickers on them!  Level design:  Absolutely perfect. In the main story (kind of) area, there are buildings, roads and objects scattered around for your pleasure. A lot of different objects to drift around, through, under and between. Then there are also drift tracks.  There are 3 kinds of drift tracks:  *Mountain drift: No laps, you just go downwards while drifting as much as you can. *Driftkhana: No laps. A closed off area where you perform drift moves (donuts, jumps, slaloms, drifts) until the timer runs out. *Drift curcuit: Run 3 laps around while performing drift moves.  Drifting:  Collect points for each drift move. More angle and more speed mean more points. You can chain drifts. Careful for if you lose control, you crash. When you crash, you bank your current points but lose your streak.  Single player:  There 6 areas, each requiring you to complete a number of tasks before unlocking the gate to the next area. Tasks vary between collecting things, completing certain drift moves, jumping over obstacles and some other stuff.  Multiplayer:  There are online leaderboards for all tracks. Try to go higher on each track and see how you fare compared to the general Steam population.  For the lack of good drifting games out there, and my love for drifting games, I give this game a solid 8/10. The reason for the 8 is, the lack of a proper story/mission/campaign thing, and ♥♥♥♥♥♥ music.   Warning, the game is very short. like I went through the whole thing in just under 2 hours, got all the achievements and all that ♥♥♥♥. So it's very, very short. But it's nice. It's a 'casual' game.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing, best soundtrack I've heard for a while. Definately a challenge even if the 'story' is somewhat short.",
            "review_score": "1"
        },
        {
            "review_text": "Fun but frustrating for a perfectionist.  Simple game and an enjoyable challenge. If you fuss and fume about every inch you could improve on or mistake that you've made, this game might be a little frustration. There's clearly room for skill levels beyond belief, but for a quick 30 minutes of game, this fits the bill.",
            "review_score": "1"
        },
        {
            "review_text": "If you've ever played a game with any kind of drifting and enjoyed it this will be a good time. Cool minimalistic art, chill electronic soundtrack, and sliding all over the place for hours.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game with a GREAT soundtrack and a cool minimalist style.  The free-roam mode (the 'story'-like mode) is about 90 minutes of play depending on how much you suck. Could probably be speedrun much faster. There's a bunch of drift and driftkhana tracks each with their own leaderboards, so the competitive leaderboard types of players will probably get much more than 90 minutes out of this game. The drift mechanics seem mildly accurate, for a really low-grip world.  Unfortunately the goal detection is kinda dodgy. Where you have to do donuts around an object, you actually just have to be drifting a certain angle, not even in the correct direction, within some radius of the object. You'll accidentally half-complete some objectives driving past it. Drifts to complete objectives don't have to be successful, you can slide past, tick off an objective, and then slam into the wall (the exception to this is that actually hitting clipping points doesn't give points, and donking donut objects sometimes resets them). The result of all this is that you can basically fumble your way through the whole game (you do gotta git gud for the leaderboard modes though).  Also there's a difficulty setting that seems to do nothing. I don't even know.  All up - it's a fun little toy, but it's not really a complete product.",
            "review_score": "-1"
        },
        {
            "review_text": "the game can make a man moist.  Not a huge fan of the electronic music. Would be cool if you could simply input your own music tracks.  either way the music is a very minor flaw (personal opinion) for such a good game to waste some time.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly smooth, great soundtrack. Super fun game, definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "A nice looking modern take on slicks'n'slides singleplayer. At first, unlocking all cars through the different worlds, is quite boring, but you will get the hang of how to play. The free-roam mode is quite repetitive and does not give anny real challenge, but the fun starts afterwards. Trying to get a better score on different tracks gets addictive. Its easy enough to do a good drift anywhere on any map, but to get a successfull run through a whole track? Thats a whole different story. It helps that restarting a race takes just seconds so you can perfect that first corner drift many times. Rinse and repeat for the next corners too.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Beautiful aesthetic. Nice audio and a simple-to-lear, difficult-to-master core gameplay. Highly reccomended to anyone with even a fleeting interest in drift racing.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and chill game.",
            "review_score": "1"
        },
        {
            "review_text": "An true gem, and a great example of low-key development in the ever expanding steam library.  As a casual racing fan with an enourmous love for drifting, powersliding, getting sideways etc. this title instantly hooked me with it's appeal to minimalism in favour of gameplay and SFX. At first glance it's easy to dismiss as a 'one and done' kind of game from the newgrounds flashMX era, but before the first song has even finished you'll be stoked to try and push that score a little higher, or make that turn a little smoother.  From initial launch to the ZEN edition update, the dev has been recieving (and responding to!) feedback about the game, and it's clear that fans' interests/concerns have been addressed at a steady pace. This is very encouraging, and likewise i think the creator/s know how much we love them &lt;3  If you're interested in drifting, racing, smooth electronic+techno, or something to put time into on a rainy day -  Look no further. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is ART by capital A, R and T. Simply pleasure to play, listen to and look at. Simplistic yet deep. Magnificent!",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the most fun drifting has ever been in a game. The granular adjustments that can be made adapt the handling to your preferences makes it more accessible then I would have ever thought!",
            "review_score": "1"
        },
        {
            "review_text": "I expected this to be a kiddy emo need for speed drift game with annoying music.... Boy was i wrong..   This has to be the most challenging and relaxing game I've played yet.   ",
            "review_score": "1"
        },
        {
            "review_text": "  Strikethrough text  ",
            "review_score": "1"
        },
        {
            "review_text": "If you like getting buff and staying tan there really isnt a better way than while drifting.",
            "review_score": "1"
        },
        {
            "review_text": "- realistic drift physics - backgroud music is good - simple and easy-to-use interface - addictive - various tracks and modes for selection - manual gear box is provided - fun but suitably challenging if u are a car/ drift fan, just buy it ",
            "review_score": "1"
        },
        {
            "review_text": "Fun, short but great value, will keep playing and improving my top down drifting techniques, only point I would like to make is that the additional cars section was not very clear, I mastered the game before figuring that out (my bad).",
            "review_score": "1"
        },
        {
            "review_text": "my car is stuck in reverse help me",
            "review_score": "1"
        },
        {
            "review_text": "Already I can tell this is a great game, even though I have had little time playing it. The reason being that I want to warn you that playing with keyboard is very challenging and that I don't recommend playing without a controller. I would if I could but I am a Mac user, and connecting controllers is a task from hell. I hope to see this game come out in the near future on both Playstation and Xbox platforms in the near future, as I don't have money to buy a gaming PC, and it wouldn't be worth it for how little I game on computers.",
            "review_score": "1"
        },
        {
            "review_text": "Why I can't use xbox contorller?",
            "review_score": "1"
        },
        {
            "review_text": "Great game. My only issue is that I can't use my PS4 controller because the R2 button is acting like the pause button, which it isn't supposed to do.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic little game. I had been following this for a couple months leading up to release anxiously awaiting. And it has not disappointed. First off; the drift physics are exactly what you'd want. Throttle is pressure sensitive, allowing you to be very precise with how hard/soft you push the car in a drift. Car sounds are crisp and vary from car-to-car. Handbrake is applied JUST right; some arcade driving games have handbrake engage WAY too strong and sling shot you around. I really dug the Mirror's Edge-like minimalist graphics theme, with red colored items being important against a white backdrop. The game is a bit short w/ 5 'worlds' each with 20 or so challenges to complete that don't take long at all to run through. I am hoping this will maybe receive Workshop support to add things like custom car skins &amp; Events for extended replayability.  All in all, for ~$10 I highly recommend if you are a fan of drift car culture at all.",
            "review_score": "1"
        },
        {
            "review_text": "watched jacksepticeye play it then immeaditely bought it played until 4:00",
            "review_score": "1"
        },
        {
            "review_text": "Very minimalistic drifting game. Hours of fun. Worth $12? Unless there's a free car pack or world expansion coming, I would wait for this game to go on sale. Hope the devs build on this game. Multiplayer aspect would be amazing.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Do you like drifting? Initial D? then this game is for you. Super fun and provides a nice level of challenge. Something to play when your bored. Easy to learn difficult to master.",
            "review_score": "1"
        },
        {
            "review_text": "Once I had the controller working this game has been nothing but fun. Awesome control and amazing DNB to drift to.",
            "review_score": "1"
        },
        {
            "review_text": "Haven't had much time to play this game but from what I have play I would highly recommend this game to anyone who loves cars and drifting. It is a simplistic yet very effective drifting simulator. The art style may not to be to everyones tste but personally I love it. Overall, just get it :P   The only criticism I have is that apart from the online leaderboards, theres nothing in the way of multiplayer. I feel having a free roam multiplayer would add massivly to this game.",
            "review_score": "1"
        },
        {
            "review_text": "Maaaaaaaaaaad!  The game is great, its a good time waster as it starts up quick and you can get playing in seconds, its got a minimalistic art style sort of like the game Mirrors Edge.  Pros -Fun -Features iconic drift cars -Easy to pick up - hard to master -Satisfying to play (Great feeling while playing, like when you pull of an awesome line) -Soundtrack is pretty killer  Cons -Physics (It's physics are great, but I would have prefered a more realistic approach personally) -Almost impossible to play with a keyboard (Playing with a controller is almost a must) -Lack of a level editor (This game would be perfect with a level editor/track creator)  The game is alright, and I recommened it to anyone who loves cars and the art of drifting.",
            "review_score": "1"
        },
        {
            "review_text": "Great drifting game. I beated the 'story' if you can call it that, in 2-3 hours. After that i have been trying to get new highscores on the tracks! But you need controller, keyboard controlling is way too hard atleast for me. And great music!",
            "review_score": "1"
        },
        {
            "review_text": "Chilled out drifing game with a great soundtrack.   The handling takes a bit of getting used to but pulling off perfect combos of drifts is immensely satisfying.  The game is a bit short, but replaying the levels to improve your score is where the longevity comes from.  Great game for a very reasonable price!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Multi monitor support on linux is not all there, but running under windows it works. Very fun game to sit back and relax.",
            "review_score": "1"
        },
        {
            "review_text": "This game is something that I have never seen/played. It has a total different and same drifting style at the same time. Few things that I would have loved to see in this game:  *More Levels - I completed in two hours, and I wanted to go on and on.  *Online play - it would be an awesome update/feature/sequel to the game. *More of everything: more cars, more maps, more things to do - I would love to drive a more custom car or perhaps a mustang/dodge and seeing more maps. *Too easy - once you beat it, you go back like that *click*, but it was just to damn easy, though maybe its my fault that I did not went with hard, so maybe an even harder mode.  These are just things I wish I could see in the game or sequel. But, hey, it's still a game worth of purchase comparing that there are not that many games that leave your mouth open and wanting more.  This game should have a ten outta ten for its first part! This is something everyone has to play!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome  Driving is fun yet challenging +1 The world is beautiful +1 Music is legendary +1 The stater car is a Toyota AE86 other wise known as a 'hachi roku' for to the Initial D fans +1 Casual time killer game +1  No multiplayer (feels like at least co-op should be included) -1 Only top down view, (the novielty is nice but a in car view would be cool since its supports a steering wheel) -1 ",
            "review_score": "1"
        },
        {
            "review_text": "A fun arcade-style driving game whose tight controls reward practice. This isn't about racing -- it's all about style. You'll find yourself chaining together long, satisfying drift turns while letting the techno soundtrack clear your mind of anything else.  This a small game, whose exploration mode can be cleared in under two hours. However, that mode is really a side-show. This game is about high scores. Pick this up if you enjoy arcade style games where you battle the leaderboard and your own personal bests.",
            "review_score": "1"
        },
        {
            "review_text": "So, it's a game about drifting. If you know how drifting works, just forget what you know for this game. It has such a huge learning curve. With that being said, I love it. It's so much fun to just go in and drive around. I finally completed it along with all the achievements and it's still fun to play. My only complaint is at times you lose the car behind a building or wall which makes it difficult at times to tell what is going on. Other than that, I would say get it if you are interested. I can only see the game getting better from here on.",
            "review_score": "1"
        },
        {
            "review_text": "BUY IT BUY IT BUY IT, got this because it looked like a sick rc drifter  was not dissapoint 'dem skids doe boi' ma gawd just grab this ish before its over 10$ welllllllllllllll worth!!!!! Buddha+ Drifts +Chill hours of endless fun when im not playing assetto corsa",
            "review_score": "1"
        },
        {
            "review_text": "A fun and simple game all about the art of drifting and how to master it.   Graphics: 8/10  Very simple visuals, yet it wouldn’t be defined as ‘lacking’ in my opinion. It’s got everything you look for with nothing really missing. Although, it might be too simple looking for some people as there is only a few colours in the game.    Storyline: 3/10  Become a Master Drifter. That’s it, nothing more.   Sound: 10/10  The soundtrack is great and it goes perfectly well with the game. It’s the BEST soundtrack for an indie game I have ever heard.    Gameplay: 10/10  Very fun indeed. You start off by learning how to drift straightaway. You get a total of 5 worlds in the free roam section in which you can do missions that unlock a new world and a new car. You can also complete the events which puts you in the world leaderboard.    Price: 8/10  Its priced at £8.99 and for a game you can complete in less than 3 hours, its priced decently compared to other games out there.  ",
            "review_score": "1"
        },
        {
            "review_text": "Takes some practice to get into but once you get the hang of it, Absolute Drive is absolutely fantastic. Quite refreshing to have a game that looks so simple on the surface but that actually requires some real skill to master.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely stunning, its simple and really fun. It took me about 2 hours to complete because i was focusing on having the maximum amount of fun, but if you speed run it it could take you around 30-60 minutes. 8/10 go get this game.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game i have had so much fun playing this game   PROS it has amazing artwork  6 playable cars steam achivements  full controller support with great handling  very original  ~CONS (not many) A bit easy  bit to short   over all its a great game would tell everyone to buy",
            "review_score": "1"
        },
        {
            "review_text": "This is a gem you can get for a relatively low price.  The graphics are smooth minimal and just the thing you would call eye candy.  The soundtracks are amazing, mostly drumm and bass but it is absolutely amazing.  The controls are easy to learn and within a short period of time you can make moves that look even better and smoother. Note: I haven't tried controller controls, but keyboard input has no delay and feels good to play in general.  The gameplay gives you freedom in how and what way you do your tasks, what is in my opinion a huge plus. The challenges are not hard and you can even aim for higher ranks in global leader boards with a minimum effort.  Overall this game is definietly worth a try if you want to try a driving game based around drifting.",
            "review_score": "1"
        },
        {
            "review_text": "It's a blast to play! I love the drift culture and I drifted my way around simulators since I could handle a wheel or a gamepad. It's a quite tricky to get the hang of it, but then is all gnarly skidding, drifting and hooning all over the place. I like the asthetics of the game, it's very clean and modern, I get Mirror's Edge (ME1) vibe from it. It's not even that short for this indie type of game, you have a giant world to play with, bunch of distinctive cars (drifting classics), cool mechanics, solid physics. Your typical gaming session can be pretty short, which might be a good thing for someone. It might last for a week or two, or even longer based on your skill and desire to be the best.  tl;dr €12 tokyo drift simulator gut gaem me want",
            "review_score": "1"
        },
        {
            "review_text": "What a charming little game. Drift your hot wheels car around and make the numbers go up.",
            "review_score": "1"
        },
        {
            "review_text": "OLD: FIX xBox One Controller - constantly accelerating and turning... UNPLAYABLE!!!  NEW: UPDATE!!! Developer contacted me telling that 'The game has undergone a major update with a new input system'. Now all of 'xBox One Controller' issues are GONE! Thank you for finally fixing this. Now we can totally enjoy and recomment this game to others, as of now the game became really fun instead of annoying and provides enjoyable, fun and relaxing experience.",
            "review_score": "1"
        },
        {
            "review_text": "Soo good, after playing only 2.5 hours it is already my #2 all time favourite game.",
            "review_score": "1"
        },
        {
            "review_text": "Super simple, hard to be good at but easy to pick up and play. The game basically loads right in, and you can pick it up, play for 5 minutes (or 3 hours) and just quit when you want. It's an awesome casual game!  Also, it was $1 in a humblebundle, which helped.",
            "review_score": "1"
        },
        {
            "review_text": "This looks like a fun little game! Unfortunately, the controls are not configurable. The pre-defined keys are the arrow keys to control the car. This is very awkward on my laptop keyboard, and causes my fingers to cramp. I much prefer the traditional QAOP layout - but it is not possible to change the mappings.   I'll happily come back and give this game a second go if they put in that basic functionality. But until they do, it's unplayable for me.  **EDIT** as MOW points out, thi IS available - with a little leg-work! I shall amend the keys and play on.",
            "review_score": "-1"
        },
        {
            "review_text": "The good: Stunning visuals Strong soundtrack Smooth, challenging but still relaxing gameplay.   The bad: Little hard to get into, tutorials could explain couple more things Bit short Controller is necessary   The game can be split into two parts, free roam and the events.  In free roam you can explore open areas and you can complete challenges here(drift in a selected area, jump this gap etc), this part is apealing for newer players and you can get the hang of the game here, it is extremely fun to complete these challenges but it is a bit short, you can complete everything in 1.5-2 hours.  The events are available from the menu or you can acces them from free roam, there are lap based racetracks, linear tracks and semi-open drift tracks, the goal is the same on all of them, drift, do combos and get high scores. This is aimed towards the hardcore crowd, as it takes some time to get good in this game and place well on the global leaderboards.",
            "review_score": "1"
        },
        {
            "review_text": "I genuinely wish I could give a neutral review for this one. The game is not bad. In fact, it is very good at what it does.  Absolute Drift is a minimalist drifting game, in which you're a white (can change) car, in a white world, with white objects everywhere. Except for a few things. Orange colored objects are destroyable and/or important. Each 'world' also seems to have another flavor color splashed in periodically. (i.e. Yellow in world 2, Blue in world 3, etc.) And each 'world' you unlock by completing various 'missions' (such as doing donuts, spins, drifting between obstacles, etc.). There are no time limits as far as I can tell, and it's just a very open-world (on a table top), relaxed, easy going drifting game with no rules, no conflict, and no consequences.  All of that, it does EXTREMELY well.   However, it is not FUN. At least not to me. I'm playing on an XBox controller, and I also tried it out on my keyboard. There's five controls. Gas/Accelerate, Brake/Reverse, Steering, and E-Brake. You can also remove automatic transmission and have another shift up/down pair of buttons available. But I found the shifting on this tedious, and without shifting the game is repetitive. You can learn to do all you can do within the first ten seconds of playing. Spinning only works in reverse as far as I can tell, and 'donuts' are just, basically, a slow lazy drift. When you are told to donut something, you can get 10%, crash, and get 10% more, crash, and repeat until complete. I've played plenty of other racing games with drifting components, and a few other drifting-centered games. This one, you have significantly less control over your vehicle. And the way the game calculates a 'drift' you can literally drive straight up to your obstacle and slam on your brakes and succeed in just about any of the 'missions'. There is no incentive I can tell to do well (other than placing higher in the global rankings), and no punishments if you just crash into a wall over and over until you succeed.  To feel successful, one must suceed. To succeed, there must be a chance of failure. To avoid failure, one must learn. Learning is caused by either positive or negative reinforcement, or some combination. This game has none. Perhaps I just suck at this game, but I didn't find it fun.  TL;DR: If you want a laid-back drifting game with no clear rules, where you can just drive around a pristine environment to your hearts content, this is for you. Otherwise, look elsewhere.   #TOFU #JDM #HOON EDIT: It doesn't seem to be recording my time correctly. Anyone who's played it knows it takes longer than '0.1 hours' to get that far.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolute Drift is a challenging racing game that is all about sliding, drifting, and hitting walls. Do you have what it takes to become the so-called drifting master?   Gameplay",
            "review_score": "1"
        },
        {
            "review_text": "A good game with great physics and terrific soundtrack. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "good racing game!",
            "review_score": "1"
        },
        {
            "review_text": "Really nice, takes a while to get used to the physics but after you do it, you can pull off some pretty cool drifts, i wish it had more tracks tho.  Worked flawlessly for me.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a good for only being £9 or $13, This game deserves recommendations. For having a free roam in the game also having great physics, selection of cars if you like drifting then this is the game for you! Great game",
            "review_score": "1"
        },
        {
            "review_text": "Easy to pick up, hard to master. Plenty of variety of handling between cars and area's. Art and graphics that are simplistic but stylish and a sound track that defines the genre of going sideways. Downhills are prolly the best part. 4/5",
            "review_score": "1"
        },
        {
            "review_text": "Looked like a silly little arcade drifter at first. Now its 4:38 and I cant stop.  Perfect sound design/music and graphics. Goes great with the zen aesthetic and I dont rage when I fail so YAY! Needs an eurobeat soundtrack as well though. ",
            "review_score": "1"
        },
        {
            "review_text": "Simple game with an awesome driving mechanics and very cool minimal visuals.",
            "review_score": "1"
        },
        {
            "review_text": "This game goes like a dream, gets your keyboard used and in the end you just wanna jump right into the game before you realise its 6 in the morning already and you havent slept at all for school.",
            "review_score": "1"
        },
        {
            "review_text": "a fub drifting game with a clean presentation and upbeat sound track",
            "review_score": "1"
        }
    ]
}