{
    "app_id": 320110,
    "name": "Train Town",
    "release_date": "2014-08-26",
    "developer": [
        "N3V Games"
    ],
    "publisher": [
        "N3V Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Trains",
        "Family Friendly"
    ],
    "achievements": 0,
    "positive_ratings": 41,
    "negative_ratings": 26,
    "price": 1.99,
    "description": "Train Town is traintastic fun for everyone. Build your world, choose your train, go on exciting adventures through cityscapes, jungles and deserts...and even crash and blow things up!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/320110/header.jpg?t=1447363354",
    "minimum_requirements": "OS: windows 7 Processor: 2GHz Core 2 Duo Memory: 2 GB RAM Graphics: Nvidia Geforce 440 or higher DirectX: Version 10 Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "All aboard! Bought this for my 4 year old. He had a great time, we'll play more I'm sure.  You build train tracks, put down buildings, rocks, trees, people, and more. Lots of objects to choose from so you can be creative. The building controls are dead simple. Just a few menus that let you place objects, change their size and rotation, change the weather, all basic stuff that works well.   Then you choose a train and drive it around the track. When the train hits anything it explodes, so there is lots of fun to be had creating some big destruction. The train controls are almost nonexistent - just pick your train and it starts to move, all you can do is change the speed. But that’s enough, it’s not as much of a game as it is a playset.   You can download tracks that others have made, and that’s a good way to get into some instant action. You can share your tracks too.  The visuals are nice. Bright and colourful, music and sound aren’t annoying. All in all a nice package. For $3, totally worth it if you have a kiddo who likes trains.",
            "review_score": "1"
        },
        {
            "review_text": "This is certainly one for the young ones. Just put some tracks down, add some objects or build a small village, add some trains and watch it go around. Add more trains, cross some tracks and wait for the toy carnage. Or download some layouts and just relax.  The colours, the music, the general cheerfulness of this very simple game put a happy smile on this old gamer's face. So, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "really fun game buy it",
            "review_score": "1"
        },
        {
            "review_text": "It's a virtual train set.  I like trains. I liked the concept and the graphics.  I didn't like the controls for placing track or other objects.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy it it is a very bad deal NOT WORTH IT.",
            "review_score": "-1"
        }
    ]
}