{
    "app_id": 320340,
    "name": "Cosmonautica",
    "release_date": "2015-07-31",
    "developer": [
        "Chasing Carrots"
    ],
    "publisher": [
        "Chasing Carrots"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Space",
        "Simulation",
        "Indie"
    ],
    "achievements": 31,
    "positive_ratings": 503,
    "negative_ratings": 498,
    "price": 6.99,
    "description": "Cosmonautica is a fresh take on space trading in a procedurally generated universe, paired with quirky humor for your intergalactic enjoyment.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/320340/header.jpg?t=1487598680",
    "minimum_requirements": "OS: Windows Vista / 7 / 8 Processor: 2,0 GHz Dual-Core or better Memory: 3 GB RAM Graphics: DirectX 9.0c compatible with 768 MB or better DirectX: Version 9.0c Storage: 800 MB available space Sound Card: Windows compatible",
    "recommended_requirements": "OS: Windows 7 / 8 / 10 (64-bit) Processor: 3,0 GHz Dual-Core or better Memory: 4 GB RAM Graphics: DirectX 9.0c compatible with 1024 MB or better DirectX: Version 9.0c Storage: 800 MB available space Sound Card: Windows compatible",
    "reviews": [
        {
            "review_text": "really nice game that makes a lot of fun in the beginning. after a steep learning curve the game clearly lacks content for longer gameplay. and there are still a lot of bugs and game crashes.   pros: - nice graphics - good soundtrack - funny   contras: - regular bugs - regular game crashes - lack of content in the mid and later game - needs better balancing for exp and research  i would recommend it to anyone who likes games like this on a casual basis",
            "review_score": "1"
        },
        {
            "review_text": "OK so there's plenty of bad and good for this game. Let me lay my opinion on the line here from a couple of hours of initial gameplay (Which I have no doubt will grow to a few more [albeit modest] hours in the future)  This is a casual game by far. In that sense I've personally found it rather zen. You've no doubt gotten a fair idea of what the gameplay is. You manage a crew in a basic sense aboard your vessel. You travel around, first, one solar system trading, smuggling and fighting to accrue money. This cash goes towards bigger vessels and more capability to extend your activities further abroad. Beyond that overall premise, you have to manage the crew you use to staff said craft and their relationships and needs. As they become more skilled they require more effort to keep them satisfied (A feature which, thanks to a recent addition of bonuses, you can come close to bypassing to an extent early on if the money is flowing),  If you are someone like me that's happy to provide a narrative (Other Dwarf Fortress and Paradox Grand Strategy players will understand) for the game you'll enjoy this, but superficially. There's plenty of capacity to do so but it is provided with a quite limited depth.  There's a comedic element to the game which works quite well, but I personally don't take that in too much as (as mentioned above) I enjoy supplying my own narrative to the game. That being said it provides a level of enjoyment to the game even if it can be found to reduce the 'immersion' factor.  To give a TL;DR overview though, if you are looking for a relaxing game set around Captaining a ship and crew while jaunting around getting into whatever adventures you see fit, this is a great game to destress to. If you want more complexity in your zero-G adventuring, check out the X series or EVE online.  All being said and done, with the above caveats, I will recommend this title as a simple, enjoyable and satisfying experience. Additionally, the devs seem to be taking comments on board and working to adjust gameplay in an ongoing fashion.  PS. A couple of things that I think this game requires: - The ability to speed up time to a greater extent - More intricate and involved crew requirements and procedural command events (There are some, I hope there will be more as I go on)  Overall, once again, I've found this a relaxing and satisfying game. It will likely get repetative in the future (And I will update my review accordingly) however that's the lot of a ship captain in reality isn't it? Haul cargo, wash rinse and repeat with a dash of combat and smuggling to make it interesting. If the devs continue to update accordingly, it will continue to satisfy unless you're looking for an ultra-deep and complex experience. In that case, look elsewhere.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. It's getting better and better, now it just needs something to grind for /play for other than achievements. Slowly but surely!",
            "review_score": "1"
        },
        {
            "review_text": "So far it's alright. It has crashed roughly once a day, and a combat tutorial would really be helpful. I built a turret, a weapon storage, and purchased both types of available ammo and still in combat I can't see an option to fire anything.  But it's quirky, and entertaining, and I imagine the kinks will be worked out (although I'd have expected they would have been before release). Wish I could rate from 1-5 rather than just recommend vs not, but have to recommend at this point despite the flaws.",
            "review_score": "1"
        },
        {
            "review_text": "The game is really fun, surprisingly tricky at first, but overall a very fun simulation. The only problem I have with it is that I can't play for very long before it crashes to desktop. Before it happens, it starts to mess up little things here and there, but it always crashes. For such a small resource using game, this seems odd to me.  Now that being said, the trading is simple and elegant, space travel and combat seem competent (don't fight until you have either shields or a hacker). I'm throughly enjoying it. Just please work the bugs out.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game straight through to completion. I had about 10 crashes in 42 hours. Not a big deal, the game autosaves at every station, you might lose a minute or 2 if it crashes. I thought about playing it a second time through, don't think I'm going to though, the story was good, it was fun to get the hang of everything. Once you figure out how it works you can just make unlimited money.   I bought it on sale, and for the 42 hours I can't beat the value. It was a very enjoyable 42 hours. I had one question on the forums, the DEV answered it within a few hours.   I'd play another game from this company, and reccomend this for 40 hours of fun!",
            "review_score": "1"
        },
        {
            "review_text": "Thank you Icey. That cleared my problem right up. It's a fun and addicting game and now that I can play it, I can say it was worth every penny. GG guys",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, Sims in space.",
            "review_score": "1"
        },
        {
            "review_text": "Highly fun game! If you like management games this is an absolute gem. An interesting setting and mechanics and great to build a crew and ship and fly around. Lots of lovingly made small details everywhere, like the idle animations of folks at the space stations. And the soundtrack is great.",
            "review_score": "1"
        },
        {
            "review_text": " Still rough around the edges, but oh so much potential!",
            "review_score": "1"
        },
        {
            "review_text": "I personally love the art style of this game, and find it fun!!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game !! Worth game,, but i hope the crash issue can get fix soon :)",
            "review_score": "1"
        },
        {
            "review_text": "Not sure what all the negative reviews are about. Wasn't really buggy for me at all and I had fun with the game.",
            "review_score": "1"
        },
        {
            "review_text": "When I bought it, there were less errors then. It constantily shuts down, and lags.   However, IF they choose to fix it, I reccomend this game, it has interesting missions, characters, and overall worlds.   At this current state, it's terrible.  Edit: It's okay.",
            "review_score": "1"
        },
        {
            "review_text": "I was interested in this game when it was in Early Access and because of the review by Splattercat Gaming on Youtube. Sadly the end results of the game when I picked it up on sale did not meet my expectations. Constant bug and game crashes combined with an unbalance in vital game mechanics makes this game an unpleasant experience.  Lastly, the game has been abandoned by the developer and no further attempts to fix the issues of the game are being made. There are games in this genre available. Play those instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Very much excited to play this game and loved it to start. I soon realized that once you had some money you didnt need anything. There quicky became nothing to do. 8 Hours is all i got out of it.  Great early game. Decent mid game. Non-exsistant late game.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to love this game, everything seemed so perfect that I decided to help the devs even tho the critics weren't so good. I totally regret this. The devs made this game what it is even with all the potential it had. I promise you this, I would never buy anything from these devs, the resolution of abandoning this game and not fixing it just killed everything good from it. ♥♥♥♥ you devs.",
            "review_score": "-1"
        },
        {
            "review_text": "No no no no. Don't waste your money. Game still is incomplete and the developer already stated they won't be finishing/fixing remaining issues and is moving on to another title. Don't touch anything made by these developers now or in the future.  Example: Ship combat that can often end in a never ending cycle where neither side wins and you are stuck. Great testing there guys,  Game looks nice at first but man.. no depth.",
            "review_score": "-1"
        },
        {
            "review_text": "I really tried to like this game, but it really would not let me.  Pro: nice concept  con: pretty much anything else  space fights are boring as hell (sloooow), also the rest of the game is quite dull. And when you think it might be okay, the game just crashes. Often. Like very often and just randomly.  Also some parts of the game just don't work how they are supposed to. Example: When you are low on money, the game suggests you should make the switch to a smaller space ship. BUT: you can not sell your old ship. Instead you have to pay the smaller ship, lose your bigger old ship but don't get any refund for it. The result would then be, you have a smaller ship and less money then before. I don't really think that's how it's meant to work. Taking all that into consideration, the game seems very unfinished.   Also the devs pretty much just told that they won't update the game anymore, because they are busy with their new game.   So you get an unfinished game, that will never be more than it is now.   Would not buy again. And would not buy any other games from this dev.",
            "review_score": "-1"
        },
        {
            "review_text": "I liked the mechanics of the game except for there's nothing much deeper than the surface which was wildly disappointing, combine that with the fact that a game I spent hours on was ruined by bugs and there's no way to resolve it. I Ignored the bad reviews and bought the game anyway. I completely regret that decision, I could have spent it on a more deserving game.",
            "review_score": "-1"
        },
        {
            "review_text": "I would like to recommend this game as a cute time passer in a genre that hasn't had a really good contender I'm aware of since Space Lanes in the late mid-90s. It seems to have all the right pieces for making a fun game, but at it's current, no longer early access, stage, I cannot recommend it for 1 reason.  It lacks any form of instruction manual, documentation on how to play or tutorial... So, it simply does not tell you how to play it, and though 80% of it is pretty intuitive, that leaves about 20% of the game that leaves even a veteran gamer like myself going WTF?  (Added: I keep seeing claims in the forums that there is a tutorial that makes perfect sense, though even some that say that say they needed to read every message from your ship's robo-bird at least twice to catch it... The supposed tutorial is imbedded in the rest of the chatter in the game and I found it hard to follow, and sorely lacking in anything but the most basic instructions.)",
            "review_score": "-1"
        },
        {
            "review_text": "This game has so much potential, but it gets under my skin at the path finding ability and a few other things.    Many times I've lost missions, profits, and time because for some reason this game will chart a path to loop around the ENTIRE solar system before landing on a planet that is RIGHT NEXT TO YOU. So what should have taken maybe 2 cycles becomes a 7-8 cycle trip.   This game is not enjoyable in it's current state. Might visit again later when this whole path finding issue is resolved.",
            "review_score": "-1"
        },
        {
            "review_text": "I want my MONEY BACK!!! This looked promising way back when I bought it... now I've come back hoping to find the finished product, instead... ' we aren't worknig on this anymore'... fine  MONEY BACK PLEASE!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Game is barely playable for all the crashing it does.  Good concept, I'm sure I'll enjoy playing it once it's actually finished.",
            "review_score": "-1"
        },
        {
            "review_text": "Until they make leaving the first system worthwhile, it's way too boring. No high tier stuff in late game.",
            "review_score": "-1"
        },
        {
            "review_text": "First time I changed the options it froze. I checked the forums, the developer says: delete the config file. Great fix there or maybe you could actually fix the problem? If you change the audio levels during the game, no confirm button appears, so the levels revert to max. Do it on the main menu only.  Game crashes frequently. As far as I can see, making money is a painfully slow grind. Doesn't seem worth the effort of overcoming the CTD to see what else there is. I feel embarassed that I bought this.  Don't make the mistake I did and follow the disengenuous discount link in the forum, since that will make it much harder to return the game for a refund when you quickly realize that is what you want to do.",
            "review_score": "-1"
        },
        {
            "review_text": "In theory it's great fun. In practice it's a pain in the ♥♥♥.  Gameplay is simple enough to get used to, but some aspects are a bit lacking. My biggest problem was getting my crew to stop being a bunch of whining babies, nothing was ever good enough for them, in or out of battle they would always have something to complain about despite the ship being fully out-fitted for everyone's needs. There's also the problem of making anything like a decent profit without simply grinding cargo missions, you could wait for the necessary weapon skills to then become a pirate, but it'll take a while and in the meantime your crew of morons will slowly drain what little income you have.  This would've been tolerable and I might bother continuing to play, but the game crashed 10~ times in the 9 hours I played and once I researched a couple more systems to visit it quickly became clear that repetition is deeply embedded in this game.  I would say give it a try, I know there are people out there who can't get enough of repetition/grinding in games, but it simply isn't good enough for me.",
            "review_score": "-1"
        },
        {
            "review_text": "On the face of it, it sems right up my alley. Goofy humor mixed with some random acts of oddities. Yet even though I've fought to love this game I simply cannot recommend it due to the BUGS. Fail missions and your stuck with items and the obtuse trading information etc. Combat appears to be a wasted effort at this point. It lacks all the charm that FTL had, and brings nothing to the table.",
            "review_score": "-1"
        },
        {
            "review_text": "Game crashes like a highway on holiday season.   Large world but lacking in content.   Zero end goal.   Combat appear to be tactical at first, but ends up being too simplistic (hint: just use torpedoes).   Trade is simplistic and repetitive.   Controls exclusively with a mouse, which makes the game feels a LOT like a mobile game.  Additionally, there IS a 'Crosssave' function, which apparently syncs the game with a mobile version.  For a mobile game, this thing is $10 more than it's actually worth.   Do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "never buy this game bc if you change the screen ratio it is un aligned to the buttons on the screen and you cant change it back so the game is basicly unplayable if you mess with the video ratio so ifyou do get this game dont change the setting just deal with it's size",
            "review_score": "-1"
        },
        {
            "review_text": "This game looks like my ideal game. I always dreamd the game like this, but.....................  User Interface is very bad. Do you know how do I move the screen to right of left or up or down in this game?  First, I zoom out to see entire my ship.  Second, I move the mouse surcer to relervent coordinate. Last, I zoom in. Finally, I moved the screen.  I can't move the screen with arrow keys or W,A,S,D keys or moving the cursor to the boundary. There are no short cut keys. I have to click all the buttons. Mouse wheel works badly. It is very weird. Sometime it does not work.  This game is pulsing. It has the lag ragularly all the time. (My labtop specification : i74700MQ, GTX780M, 32GB RAM with Windows 7 x64)  I can't rotate my ship. I watched that the reviewer rotates the ship on YouTube video, but I can't. How to rotate the ship?  I would like to refund it. If I wait, can I expect the improvement?",
            "review_score": "-1"
        },
        {
            "review_text": "I am quite disappointed due to the short gameplay-life so to speak. Let me just say I love trading and economics games in general, thats why I bought this game. So if you are like me, you should probably heed my words as you probably are as stingy with the quality as I am when it comes to these genres.  The game had/have some potential but due to following cons, its a no-go: 1. The game gets repetitive quite fast. (No, Im sorry, REALLY FAST) 2. The combat is slow, uninspiring and contentless. Or at least the content is both boring and slow. 3. The trading is simple, though easy, and lacks any kind of immersion. (kinda important as this is a trading game?) 4. Bugs, they are everywhere and you never know when, who, what or how they will crawl up across your screen to destroy your gameplay, immersion or even your ability to play the game at all. 5. Content... roughly 10 ships or something to choose from. Tradingships, battleships and some ships in somewhere in the middle. Now that may seem enough to some, to me it was just a couple of hours of gameplay.  6. The game world is extremly simple, boring and random without any clue of logic.  So what about the pros?  Are they really necessary when I dont even consider them enough to recommend someone to play this game? Come on... ",
            "review_score": "-1"
        },
        {
            "review_text": "Game starts out fun then turns in to major micro management trade guessing sim.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Good Visuals, but shallow gameplay without any real challenge",
            "review_score": "-1"
        },
        {
            "review_text": "every one says its broken . go look at the forum . every one cant be wrong dont buy it",
            "review_score": "-1"
        },
        {
            "review_text": "Sounds like more fun than it is. Buggy, confusing and in reality dull.",
            "review_score": "-1"
        },
        {
            "review_text": "terrific game. one of the worst i ever played. to many bugs",
            "review_score": "-1"
        }
    ]
}