{
    "app_id": 320400,
    "name": "Magnifico",
    "release_date": "2014-12-02",
    "developer": [
        "Mixel"
    ],
    "publisher": [
        "Slitherine Ltd. "
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Casual",
        "Board Game"
    ],
    "achievements": 0,
    "positive_ratings": 64,
    "negative_ratings": 47,
    "price": 3.99,
    "description": "Magnifico is a popular region-based board game where the ultimate goal is to dominate 16th century Europe and is now available for PC! Play hard or play clever, Europe’s dominance is just one Victory Point away.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/320400/header.jpg?t=1478103898",
    "minimum_requirements": "Mínimo: SO: Windows XP or later Procesador: Core 2 Duo Memoria: 2 GB de RAM Gráficos: 256 MB graphics memory and directx 9.0c DirectX: Versión 9.0c Red: Conexión de banda ancha a Internet Almacenamiento: 2 GB de espacio disponible",
    "recommended_requirements": "Recomendado: SO: Windows XP or later Procesador: Core i3 Memoria: 4 GB de RAM Gráficos: Discrete GPU capable of directx 9.0c DirectX: Versión 9.0c Red: Conexión de banda ancha a Internet Almacenamiento: 2 GB de espacio disponible",
    "reviews": [
        {
            "review_text": "At $5, this is a steal, and one the company website, you can get the real board game for $14.99.  Magnifico is a clever mixture of artistic and tactical warfare. It's roots are in the Axis and Allies mold, but it plays dramatically different, with the inclusion of cards that make for asymmetrical opponents of varying qualities.   It's an elegant translation of the original board game, and a worthy addition to your library. One can only hope other games, like Dust, will be made into digital format(s) as well.",
            "review_score": "1"
        },
        {
            "review_text": "Overall 6/10  Fully worth the two bucks I've paid for it. It's the electronic version of the same boardgame (think of Risk, with simplified rules and bidding on Da Vinci's inventions gives you an edge).  PROS + Good tutorial, you are up and running in 5 minutes. + Some mild strategic thinking is required here and there. + Solid replayability (different maps, multiplayer). + A game can take anywhere between 15 to 30 minutes.  CONS - The AI is meh. - Lacks any sort of depth. ",
            "review_score": "1"
        },
        {
            "review_text": "More frustrating than fun. I'm not sure what they were going for with the concept of this game, but I suspect that perhaps as a board game it would work.",
            "review_score": "-1"
        },
        {
            "review_text": "Very original mix of Risk with Renaissance Steampunk and some randomized land bonuses to boot. Although I would love a 'skip animations' button, it is well recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Not the best tabletop game turned video game out there, but still pretty enjoyable. The available pool of inventions will change each game, and with it, your strategy, but ultimately this game does follow a predictable recipe of race to expand, bunker along a line, then spend to become Magnifico and win. The various maps do little to prevent this stagnation, although Europe (with its many coastlines) prevents bunkering to some extent. I'll still go back and play it periodically, but probably quickly remember why I stopped the last time.",
            "review_score": "1"
        },
        {
            "review_text": "Quite an interesting game - kinda like Risk but a lot more varied and balanced. Three major improvements over Risk:  A massive army won't win you the game. Your infantry spawns in specific places, and trying to get them to your front lines takes time. Also, you can't attack with more than 6 infantry anyway (though you can add up to 6 tanks/planes to that army if you can afford it, for a maximum of 12 attacking units).   Upgrades! Each turn Leonardo Da Vinci offers a certain number of upgrades to the players, and the highest bid gets first pick. This can make your units more powerful, give you extra VPs per turn, and so on.   Victory points are cumulative. If, for example, you have a perfect city, it doesn't give you 1 VP. It gives you 1 VP per turn that you own it. This means that the game doesn't go on forever!{/olist}  There are two negatives to the game, however. Firstly, the rules aren't as clear as they could be. For example, I don't know how to make a perfect city - it was never explained in the tutorial and a quick skim through the help docs didn't give me an explanation. I'm sure it's in there somewhere, but it should have been clearer. Secondly, there's no multiplayer at the moment! This really sucks, as I'm sure this game would be so much better with multiplayer, even local hotseat. There's so much wasted potential just by not including multiplayer, and it's a real shame.  In summary: If you like area control games like Risk, but wish it was a bit more varied and interesting, give this game a look. If no multiplayer is a dealbreaker for you, look elsewhere.  ",
            "review_score": "1"
        },
        {
            "review_text": "Very entertaining game. I liked this online version so much I bought the real board game to play. It's a great game night addition.  David",
            "review_score": "1"
        }
    ]
}