{
    "app_id": 320540,
    "name": "Coffin Dodgers",
    "release_date": "2015-07-08",
    "developer": [
        "Milky Tea Studios"
    ],
    "publisher": [
        "Milky Tea Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Racing"
    ],
    "tags": [
        "Racing",
        "Action",
        "Indie"
    ],
    "achievements": 37,
    "positive_ratings": 408,
    "negative_ratings": 178,
    "price": 8.99,
    "description": "Pimp up your mobility scooter and take on the Grim Reaper and his Zombie army in a race for your soul. Armed with a variety of homemade weapons and gadgets, battle your way through 13 unique &amp; exhilarating tracks. Can you survive the retirement village?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/320540/header.jpg?t=1532687308",
    "minimum_requirements": "OS: Windows XP Processor: 2.2 dual core Memory: 4 GB RAM Graphics: Graphics card with around 256mb memory (ATI Mobility Radeon HD 4570, Nvidia Quadro fx 3450) DirectX: Version 9.0c Storage: 1500 MB available space Additional Notes: Spec will be revised continually during Early Access. Don't currently support Intel Onboard graphics",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Core i5 2.5 GHz or AMD FX 4.0 GHz Memory: 4 GB RAM Graphics: NVIDIA® GeForce® GTX GPU 2GB GDDR5 DirectX: Version 9.0c Storage: 1500 MB available space Additional Notes: Spec will be revised continually during Early Access. Don't currently support Intel Onboard graphics",
    "reviews": [
        {
            "review_text": "I've eyed this game for a while as I've seen it on sale once or twice, but finally decided to give it a go when I felt the price was right. Felt like it was worth the purchase, but even so, it bugs me that there is no one online to play with after beating a mid-ranged story mode.  Coffin Dodgers feels like Mario Kart met up with Road Redemption while introducing it all with an interesting story line to say the least. The game is good, but it feels like it could have been a lot better with a few tweaks. Death one day decides to show up to the little town where there are numerous old folks. One by one, they will be taken away if they do not succeed in placing first in the race.   The game itself is enjoyable. In fact, the game feels quite right as no shortcuts or glitches seem to prop up. When I first started playing, the driving scheme didn't sit too well. It felt like Mario Kart turning initially but ended up as Sonic All Star Racing drift feel. I was slightly confused in knowing how much was too much going into a turn when it came to smashing the gas. After a bit of time, I familiarized myself with their control scheme and actually find it enjoyable. You can get through a track without using the brake by letting off on the gas to make sharp turns. There are times you will need to quickly let go, tap the brake, and hit the gas quickly to keep your head out in first. The carts you drive in themselves were also up for question before I bought this game. I figured how fast could one really go and make a scooter fun to drive. They, however, made it so. Besides the driving feeling right, they added power-ups within the game. Upgrading your scooter can allow you to hold two power-ups simultaneously as well change it's color and engine specification.   Power-ups come in many forms such as rockets, boosters, mac-10 automated pistol, and even oil slicks. My power of choice in this game is the ability to whack your opponents with your cane at any given moment. This is one of the great features in this game that many other games as Mario Kart lacks. I like games that consistently keep you on your toes, engaged, and force you to pay attention at all times. At any point of a race, you are able to charge up how hard you want to hit someone and are able to release that charge right through your cane into another racers face. Just because you don't have a power-up, doesn't mean you won't get knocked off your scooter/kart. In this sense, it follows Road Redemption but adds the extra umph once a power-up is picked up. This feature alone can make it worth while, and as seen in RR, can make the whole game. After each race, you are rewarded with coins and experience. There was an excellent balance between grinding for cash and earning rewards. Throughout the race, there may be random obstacles within the way or ways to get more XP or coins. A cop car or a regular car may come driving through, a pedestrian may be crossing, or zombies might be in the way. I also have to give the game huge props for doing multi/local player battle race extremely enjoyable and simple to access.  Graphics are absolutely appropriate for what they did. It feels like N64 graphics but with a 2015 update/mod/patch/fix to it. I love the sounds and the ambiance provided within the game. You will see your old timer as they are cruising through the map looking around and observing what's going on. It's small details like this that make games noticeable (but it's the big details like game play that make up a game)!  Though albeit the game for the most part is good, it could have been a lot better. Besides having one melee attack, why not add two? Or a variation to the swing? Small things like this take the game from simply having an ability, to extending the power of this ability that effects the entire game. It also gives me a different method of attack. I would have also liked to see different game modes. Sumo, battle, or maybe a mode to see who could blow up or whack the most zombies.  Because it is missing a little, but because it does have local, I think it's a well rounded score deserving a   Indie RATING : 7.8/10  Standalone RATING : 7.0/10  I would highly recommend playing this with friends as it's difficult to find people online. Also, for any future updates or DLC's to the game I would recommend a longer storyline with a bit more whackyness to the tracks. Towards the end (and especially the final track), things finally got overly creative that it was starting to become really fun to play. Playing a bit of local co-op I've noticed some players spend a lot of time on the floor. I noticed myself on story mode that I'd be licking pavement. I would make it slightly more of a challenge to knock someone off their scooter.       Gameplay   B     Story / Campaign   B-     Visuals / User Interface   C+     Sounds / Music   B-     Replay-ability   C+     Overall    C+       ScreenShots :",
            "review_score": "1"
        },
        {
            "review_text": " Coffin Dodgers  is a fun and little cartoonish kart racing game, running around with old people in mobility scooters where the last runners are being caught by Reaper and then they run like zombies. During the game, you have the challenge of improving your vehicle with very funny visual upgrades.  The controls are simple, gameplay is simple, fun and addictive. It has lot's of playable mods from single to multiplayer, which allows a wide range of choice. Open-world explore is a good and interesting mode to play. Short game but very fun. While I played, I had fun a lot.  A note for the tutorial, simple and useful. New players will not have problems to start playing.   Do not understand the negative reviews that I read on the game page on Steam about this game. Seriously.",
            "review_score": "1"
        },
        {
            "review_text": "I never thought I'd se a kart racer that has worse RNG than mario kart but here it is. Like the last stage either you are first or last. Also the bounding boxes are hillarious. Sometimes you'll bounce of a wall no problem, sometimes you'll fall of your kart and sometimes you'll be bumped back into the air for a few seconds. Also you'll be cursing the guy that invented lamp posts after beating it. The weapon variety is really bad as well. You got a boost, a double homing rocket, a shield, a oil slick and the uzi which is the most useless thing ever. It's a punishment if you pick one up. But nothing can compare how bad game runs compared how it looks. Like I can run allstars racing transformed on max with no issues yet this stutters all over the place? Inexcusable.",
            "review_score": "-1"
        },
        {
            "review_text": "Funny to play with friends in local split screen but... this game has only one map (3 different races) playable from the beginning. I think you have to go for the campaign first to unlock all maps but this is not gonna happen as single player is not fun. Terrible design choice!",
            "review_score": "1"
        },
        {
            "review_text": "Don't expect Mario Kart, it's much more simplistic. Nice to see a game with split screen, much better gameplay with friends. Game could still use a few more things like more customization and more variety in weaponry.  Overall: If you could use a cheap split screen game for when friends are over, it may be worth a buy if you can get it under five bucks.",
            "review_score": "1"
        },
        {
            "review_text": "in this game you get to choose wich person you are going to save and you race as the person you choose and you have to beat death in the races or you will die in the races there are boxes you can collect with special bonus power ups and also if you get close enough you can hit them with your can! this game is very fun and addicting I can easily recommend it.    Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "Simple racing game, yet so entertaining. Got stuck on last race in the campaign for ages! Multiplayer works great, best played with friends. Love the idea, love the dark humour. I am sure, you'll like it too!",
            "review_score": "1"
        },
        {
            "review_text": "Had a kick playing it! Works great with SteamOS and the wireless 360 controller. Suggestion would be maybe to make an option so that it's more kids friendly - e.g.: so a young child can read something a little friendlier if they finish in 8th place. Maybe have the ability to name your characters and possible have a character maker ... Other than that, very fun and on my favs list.",
            "review_score": "1"
        },
        {
            "review_text": "I run a gaming Youtube channel and purchased this game for that fact that it offered four player local game play, but after downloading it twice, the same issue occurs. All four windows for each individual player display the same one players screen in each of them, making it completely unplayable. It's as if you copied the same gameplay and pasted it three more times on the screen. I'd really like some help with this because we've been interested in this game for quite some time now.",
            "review_score": "-1"
        },
        {
            "review_text": "A kart game with old people trying to avoid death. What could go wrong? Everything:   - The graphics are horrible  - The music is repetitive  - The maps boring and look all the same  - The powerups are uninterresting and there aren't many  - Stutering is very noticeable  - If you lose and want to retry you have to wait until the next stage screen appears  - By default the next stage screen is set to continue, not try again, whether you lose or not  - Some obstacles do nothing while others make you stop or even bounce back  - Everyone is there to get you but are rather peaceful if you're not among them  - Pray not get hit because if you do you'll probably be in last place  - You cannot restart in the middle of a race  - You cannot drop a power up you don't need  - You cannot fire your power ups backwards  - If someone hits with anything at all you lose all your power ups  - The ending sucks  Good points about the game:   - Multiplayer  - Has upgrades  - Playstation Dualshock 3 works flawlessly  - The game is playable  - The game is short  The idea behind the game is begging for failure. Old guys racing? Really? At least the game could be fun but its not much fun. It is just a boring and annoying kart game.",
            "review_score": "-1"
        },
        {
            "review_text": "Platform of use: SteamOS 1.0  Great little game, and worth the 8 dollars I paid for it. I like the upgrade system, and when you get hit and taken down by other players, there is an addicting sense to it. The only weapon I felt was a bit unfair was the Uzi, you can't escape that thing! The story mode was ok, and had a bit of humor to it. A challenging story mode that made me always want to continue and upgrade my cart. If you find it for cheap, pick it up! A good kart racer for Linux / SteamOS users  Plus, split screen support!!!",
            "review_score": "1"
        },
        {
            "review_text": "Why would you play that if you already have Mario Kart or Crash Team Racing ?  You wouldn't, exactly.  Got that game for free so I tried it, but really, don't waste money for this.",
            "review_score": "-1"
        },
        {
            "review_text": "(Got the game for free, forgot how)  Too short and easy, mulitplayer is dead.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game EVER!!!! This is total mother♥♥♥♥ing ♥♥♥♥♥♥♥t taked from homeless ♥♥♥ which was in canal where flow biggest ♥♥♥♥♥ of world!!!!    !!!!!!!!!!!!!!!THIS IS CANCER OF STEAM!!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Coffin Dodgers is a quality kart racing game with a unique storyline: a group of senior citizens soup up their mobility scooters to take on the Grim Reaper in a series of races to the death. Coffin Dodgers gets the most important aspects of the genre right: good controls, appealing graphics, a decent variety of pickups strewn throughout each track, and a garage to upgrade your kart. It also has a morbid sense of humor that hits all the right notes.  As with any kart racing game, winning is a combination of skill and luck. Yes, there will be times when you're in first place, five feet from winning the race, and you get scattered to the wind by an opposing racer's rocket. The result? Sixth place. If that bothers you, you probably shouldn't be playing a kart racing game in the first place. It's just part of the genre.   Overall, I thought the skill vs luck aspect of the racing to be well balanced. If I raced well, I usually had a chance to win and generally finished in the top three. If I finished toward the bottom of the leaderboard, I usually felt I made too many mistakes.   I do have some minor quibbles with Coffin Dodgers however. Projectile weapons can't be fired backwards. If you get a rocket or a machine gun while in first place, it's basically useless. The ability to fire backwards, even if doing so would give you less chance of a direct hit, would be a welcome addition.  Another minor disappointment is that there doesn't seem to be any shortcuts or alternative routes on the tracks, at least not that I found. Also, while you can choose from seven different characters to race as, they don't seem to have unique attributes that make racing with one character a different experience than racing as another.   Despite these issues, I enjoyed my time with Coffin Dodgers. I beat the game in about three hours, and I definitely wasn't rushing. I replayed many of the tracks several times, not because I needed to improve my standing, but because I enjoyed the track and wanted to race it again before moving on.   Is Coffin Dodgers the best kart racer on Steam? Nope. That woud be Sonic All-Stars Racing Transformed. If you want the second best, get F1 Race Stars. But as a kart racing fan, I consider Coffin Dodgers to be a solid addition to my library.  Coffin Dodgers is easy to recommend to kart racing fans, especially if it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Date: 2/8/16 Review Number: 12  Game: Coffin Dodgers From (Creator Publisher): Milky Tea Studios Played On: Steambox with Steam Controller Steam Price as of Review: $10.99 Total Time played: 40 minutes Review:  Having some free time earlier in the afternoon, I decided to switch on the Steambox to play the next randomized review, which I don’t often get to do when I play in the evenings, since the Steambox is hooked up to the TV, and my wife is not fond of me taking all the TV space up with video games. I have decided that one of the upcoming reviews will instead be a review of her playing the game instead of me reviewing it. That aside, I will say that I was pleased that this game was the one I got to play on the steambox today, as it lends itself perfectly into large screen play.   Coffin Dodgers by Milky Tea Studios is, at its essence, a simple Mario Kart clone Now, originality aside, this is not really a bad thing. I love playing Mario Kart like games, I think they are often the most enjoyable racing games on the market, though admittedly this may have to with my long-standing inability to play most realistic racing games, but really I feel like that is beside the point, as the Kart Klones really belong in a category all their own. The racing, instead of trying to get as close to realistic as they can possibly get with your other games, instead only skirts along the edge of vehicle physics, instead opting to give you exciting races by adding new and interesting things into the playfield such as landmines in various disguises. In Coffin Dodgers, the characters are all geriatrics, so in addition to the typical red shell (rocket) and banana peel (oil slick) you also get to whack other old people (along with the personification of death) with your old person cane as you race around cartoonish tracks on your seriously tricked out rascal. Now, a lot of Kart Klones tend to fall off the wagon here, making the balance of racing and items either too much to one side or the other, so it becomes either a poor racer, or a cheap way to annoy your friends with the equivalent of a blue shell disguised as a mile long left turn only lane. Coffin Dodgers does neither, balancing out easy to use weaponry with a solid racing platform and tight controls, making a game that I actually felt invested in playing, at least as far as the gameplay is concerned. The story is, of course one of those yadda-yadda race faster than everyone else or death takes your soul blah blah stories, which is fine but really stories like that aren't why you play these.  I will say that though this does have multiplayer, I didn't get the time to find someone else to play with, though if it’s as tight as the multiplayer, I’ll definitely be couch-elbowing my way to victory at least a few times in the coming days.  Game’s Fate: Kept, and will probably be played, maybe even later tonight. See if I can get my wife to pick up the second controller for this one. Buy/No Buy: Absolutely, even at full price this game packs a lot of fun into a clean game, and is totally worth the investment. Buy!",
            "review_score": "1"
        }
    ]
}