{
    "app_id": 321080,
    "name": "Pirate Hell",
    "release_date": "2014-11-07",
    "developer": [
        "Sascha Hartleb"
    ],
    "publisher": [
        "Sascha Hartleb"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Pirates"
    ],
    "achievements": 0,
    "positive_ratings": 8,
    "negative_ratings": 7,
    "price": 4.79,
    "description": "PirateHell is a fast arcade shooter set in golden age of piracy. Take command of a sturdy vessel and fight your way to gold, loot and all the pretty things a pirate likes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/321080/header.jpg?t=1447363460",
    "minimum_requirements": "Processor: 2 Ghz Dual Core Memory: 800 MB RAM Graphics: Graphic Card with 512Mb Memory and at least OpenGL 3 Support. Onboard chips (like NVidia m-Series or Intel 4000) could work but you should check first by running the demo. Storage: 130 MB available space Additional Notes: Java 7 or higher required",
    "recommended_requirements": "Processor: 2 Ghz Dual Core Memory: 1 GB RAM Graphics: Graphic Card with 512Mb Memory and at least OpenGL 3 Support. Onboard chips (like NVidia m-Series or Intel 4000) could work but you should check first by running the demo. Storage: 130 MB available space Additional Notes: Java 7 or higher required",
    "reviews": [
        {
            "review_text": "I do not recommend this game at its current price for what is in the game. If this game gets a few more updates that add some more content to the game then I believe that this could become a pretty decent little pirate game.  Mainly my issue with this game is there is only 3 ships you can unlock, and 2 unlocks per building at your pirate island, it doesn't take very long to build up money in this game if you pay attention to its mechanics which in turn makes it even easier and faster to unlock all of the stuff you can and then you just have the story mode to complete. (Buy Brothels and the Taverns to get extra gold, then go to a port town and grab one of the treasure hunt tasks, don't finish the task and gold farm off the ships that come to attack you. Use gold magnets for increase pick up) Another negative point is all the ports that are around in the game only offer the same 3 mission ever so that gets very repetive.  Outside being able to unlock everything extremely quickly it also comes with some pretty ♥♥♥♥♥♥♥t bugs, a few that I've run in to are: ~On exit the game will crash throwing up an error code, which when you relaunch the game later you'll find out it deletes your game saves.. (Kind of a ♥♥♥♥ off to have to start all over) ~Controls of WAD can sometimes stop working if you pause your ship while picking up gold, you'll have to hope that it recovers before you get blown out of the water...  All in all it's not a bad game I just wouldn't recommend it without some new content being put in, I think a few more ships and upgrades for the island, and prehapes a few minigames would make it a better/easier buy.",
            "review_score": "-1"
        }
    ]
}