{
    "app_id": 321030,
    "name": "One Day For Ched",
    "release_date": "2014-09-12",
    "developer": [
        "BS1 & BSL Team"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "FPS",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 118,
    "negative_ratings": 141,
    "price": 2.79,
    "description": "DIVE INTO THE WORLD OF OLD SCHOOL SHOOTERS!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/321030/header.jpg?t=1502293274",
    "minimum_requirements": "OS: Windows XP SP2+, Windows Vista, Win 7, Windows 8 Processor: 1.8 GHz Memory: 1 GB RAM Graphics: 128 mb video Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows XP SP2+, Windows Vista, Win 7, Windows 8 Processor: 2.8 GHz Memory: 2 GB RAM Graphics: 256 mb video Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "'I am very crap... very very crap.'   This game",
            "review_score": "-1"
        },
        {
            "review_text": "Within the first 20 seconds of the game, you can die from an enemy that can kill you in one shot. The graphics are all over the place in terms of quality with some of the weapons looking cool (but not animating great) and the textures in the environment looking crap.  If you buy this game, you will probably repeat what the protagonist says in a hilariously bad way (almost like Elmer Fudd) 'I'm drunk, I'm very very drunk'. I also somehow managed to get the text in-game to swap from English to Russian...",
            "review_score": "-1"
        },
        {
            "review_text": "The first thing i did before launch was look at the setup, 3 monitor resolutions, no option for V sync, no graphics options. so that was worrying.  Launching the game shows this mess of a menu that looks like a child messing with image settings in photoshop its just a visual culsterf*ck The game presents its story as images and text, the images have some strange filter on them, it looks very odd. ched is drunk and he wants to kill someone who is dead or something. its a little nonsensical.  the first bit of ingame introduces you to cheds 'voice actor' i use this term loosely i assume its one of the developers. Ched sounds like a less interested tommy Wiseau and the quality of the recordings is horrible. I swear one clip sounds like you can hear the mouse being clicked to end the recording.  the game play is an fps, i guess it wants to be like a shooter of old with health packs fast movement and giving you lots of guns at the start (they are just thrown on the floor and one says new bonus???)  the problem is you die in like 2 hits so instead of getting close, you need to stay back and just fire, its very dull. getting hit if you dont die in one hit has little to no feedback or way of you knowing. the guns have no recoil or any kind of feel to them. the random muddy mess of strange creatures that spawn in have no real outstanding features. murky and brown. also form a distance it is hard to tell what is alive or dead as bodys kind fail around and clip into the floor. the crosshair flashes red whenever you shoot not when you hit things which is odd too.  Anyhow i got to the first boss which just shoots you instantly. you are meant to wait out a certain time, which would just require you to fall back and wait. cant really see any reason to carry on ive seen enough already. This should not be sold for money and how it got on steam at all AS a full price game not even early access is amazing. I hear it its free on desura also which really shows how ♥♥♥♥♥♥ this being sold for a price really is.  horrible",
            "review_score": "-1"
        },
        {
            "review_text": "This 'game' is really bad, and not in a funny way. All I can say is you have to avoid this one,",
            "review_score": "-1"
        },
        {
            "review_text": "So it turns out I got this game a while back from a Groupees bundle. Yea, it's ♥♥♥♥♥♥ game, avoid at all cost. To be honest, graphics are pretty neat looking for a 1 man dev team. Heck, I really like how I get to shoot with a STG-44!!  The creatures are cool and creepy looking, but that's about it for compliments.  It's a bummer the Developer abandoned this game. This game is impossible to play without God Mode on. If this game comes bundled from a bundle, then sure, get it and play it. But otherwise, don't even bother getting it at full price or on sale. You'll be really disappointed.   Final verdict:    DON'T GET THE GAME AT ALL COST!!",
            "review_score": "-1"
        },
        {
            "review_text": "In all honesty, I have never ever ever ever played such a bad game.  You spawn with a monster in front of you (which ran just around the few times I tried to play this so I didn't even think it would be a threat) can pick up weapons before a door opens to reveal an enemy horde. Kill them, advance to the next room, horde... You get instadeath when hit by a blast but I could resist one bullet (*yeah*) and have sto start over the whole level once you fail to dodge the enemies. I couldn't find any clues for the controls so I can't use the First Aid Kit before going down. The weapons have no impact. A Shotgun fires like the pistol fires like the machinegun and so on. I got launched in the air and thrown back even though I didn't press a single key or had any enemies nearby. Also got caught once in a deathglitch and had to start over.  For graphics: The game runs at 720p max and looks like it's from 2005. At least I hadn't any problems with the performance. The sound: Wow, these assets are bad, and so is the main voice actor, they could have tried just a little.  All in all I'm really happy that I didn't pay more than 50ct for this game (It came in a surprice bundle 10keys 5€) and wouldn't recommend it to ANYONE - wait, recommended if you want to make someone suffer.  Cheers",
            "review_score": "-1"
        },
        {
            "review_text": "The game comes with an installation wizard for UDK. Yeah, that was worth the money.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game that I played. The complex gameplay, a great variety of weapons, powerful NPCs to create a stunning, dark atmosphere! I advise everyone!",
            "review_score": "1"
        },
        {
            "review_text": "It looks like oldscool games, that I played in my childhood. But this game have nice textures and interesting gameplay. Of course, I recommend One Day For Ched.",
            "review_score": "1"
        },
        {
            "review_text": "Very atmospheric game, such feeling as though I visited a rec*um at a hippopotamus. Thx!",
            "review_score": "1"
        },
        {
            "review_text": "lol this game reminds me of Doom 3 xD Hopefully in the future the game will be popular, it is very funny) Thank you!) GL HF",
            "review_score": "1"
        },
        {
            "review_text": "Kind of a strange game, but any way I liked it. Help me to have some fun after long work day. It's a little bit vintage, but people of my age will understand it!",
            "review_score": "1"
        },
        {
            "review_text": "such a nice game. love that gameplay and atmosphere. recommended !",
            "review_score": "1"
        }
    ]
}