{
    "app_id": 321190,
    "name": "Cho Dengeki Stryker All Ages Version",
    "release_date": "2014-09-19",
    "developer": [
        "OVERDRIVE"
    ],
    "publisher": [
        "MangaGamer"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Visual Novel",
        "Adventure",
        "Anime"
    ],
    "achievements": 0,
    "positive_ratings": 85,
    "negative_ratings": 7,
    "price": 26.99,
    "description": "A boy, helpless to protect that which he cherished... A girl, hopeless in the face of a promise unkept... A man, desperate to escape his finite destiny... A child, forgetting what must not be forgotten... OVERDRIVE presents a brand new super hero epic!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/321190/header.jpg?t=1479808502",
    "minimum_requirements": "OS: Windows XP, Vista, 7 ,8 Processor: PentiumIII 1GHz Memory: 1 GB RAM Graphics: 32MB DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectSound",
    "recommended_requirements": "Memory: 2 GB RAM",
    "reviews": [
        {
            "review_text": "Having put more than 30 hours in this Visual Novel and played it to utter completion (all routes + all of Jack's Diary pieces), it's time that I give my full opinion regarding the VN in its entirety. I personally, whole-heartedly, recommend this VN to anyone, especially those who are familiar with superheroes and the desires of heroism and fighting for justice. If I had to compare it to another anime or story out there, it would be Samurai Flamenco in terms of the whole wish fulfilment topic and desire to be a hero - however, unlike Samurai Flamenco, Cho Dengeki Stryker had enough time and resources (plus being a VN makes it more convenient) to explore the entire topic of what it means to become a hero, its struggles, its victories, its desires, how it can clash with reality.  =STORY=  The first route you'll (likely to) experience is the Zero Saga, and while I consider it one of the weakest routes of the story, it's a solid introduction to the story of the VN. You get a global view of all the characters surrounding you, and the main character comes to terms with the results of the wish he made 10 years ago. It also has a sweet love story that doesn't form an obstacle to the flow of the general story.  The second route is Heaven's Saga. It's somewhat less dramatic compared to Zero Route and is more focused on being epic and all-around action-packed. Its side characters are way better treated compared to in Zero Route. However, when it comes to the love interest I'm not all too enthusiastic. It's basically your average tsundere girl that has some competence going on. While I like her moments of attitude and quirkiness, the relationship between her and the protagonist feels somewhat forced. I think that's the case because little has been done to show what the protagonist feels for the love interest and why, whereas Zero Route was more open to describe the feelings of the protagonist towards the love interest and what they should strive for. The third route, Sky Saga, is a continuation of Heaven Route which focuses on a different character, whom in my opinion is the true protagonist of Cho Dengeki Stryker. It's a short story that carries quite the dramatic weight similar to Zero Route yet carries the action-packed badassery of Heaven Route but on a smaller scale. The fourth route, Love Saga, is a story on its own with an emphasis of being a dramatic yet touching love story. It did its job superbly, making me appreciate a female character I somewhat ignored in the previous routes and turning me into a gigantic cry-baby when the credits rolled. The fifth route, Steel Saga, is a continuation of Zero Saga and one of the routes exclusively available on the Cho Dengeki Stryker version (the original version is the Dengeki Stryker version which only contains Zero, Heaven's and Sky Saga). It's starts off being a slice of life story dealing with the aftermath of Zero Saga, but it escalates into a fusion between Zero Saga and Heaven's Saga in terms of characters, drama and action. Certain characters obtain a sense of complexity throughout the route (going beyond their initial role and position in the previous routes) and the newest leading lady is just a badass. While she might be a love-or-hate case, I really adore her because she isn't as waifu-ish compared to previous girls, is similar to the protagonist in various ways, including badassery and competence. The sixth and final route, Light Saga, is a continuation of the Steel Saga and the conclusion of the entire Cho Dengeki Stryker VN. You will only be able to access this route after clearing Steel Saga twice, unlocking of both two leading girls (thank god there's a SKIP button). It's all-around the most satisfying route since it's the closest to an happy ending Cho Dengeki Stryker has. It's action-packed as well, but I find Sky Saga having the most epic battle while Steel Saga has the action-scenes which come across as very grand-scale.  =CHARACTES AND MESSAGES=  It's still hard for me to decide whether Cho Dengeki Stryker is a plot-driven story or a character-driven story. While it's generally a slice of life story centring on the life of Yuuki Yamato (Dengeki Stryker Zero) and to an extend the misadventures of the Balbora Vanguard, it doesn't shy away from having extensive commentary on wish fulfilment and the various facets of being a (super)hero. Yuuki Yamato / Stryker Zero is your average no-nonsense character, straight-faced and focused on his primary goals. What's initially charming about him is how he's out of touch with reality (being a manga character from an alternate history Japan that takes place in the 1930s that got transferred to 201X) and has to deal managing his daily school life with being a superhuman crime fighter. To prevent from spoiling way too much, I can only say that Steel and Light saga manage to flesh out Yamato's character even more, struggling with self-doubt and the consequences of his actions. Texas Ninja Jack, Yamato's sidekick, might lack any complexity, but is an all-around crouching-moron-hidden-badass type of character that's all around memorable and hilarious whenever he's caught in his silly antics. There are various female characters in the story and they all have their important role in the story depending on the route you've chosen. You've got your childhood friend, your tsundere, your maid girl, your insecure girl, et cetera. Most of them are quite enjoyable and interesting whether your leading girl / love interest or not. The enemies are for the most part forgettable and underdeveloped with the exceptions of Mirror, Curtis, Roches, Hilko -- and to a lesser extend Murray and Phoenix. To me, the messages regarding heroism and wish fulfilment that are evoked through the story's plot and the struggles of the main heroes stand out the most. It goes beyond the mere 'fighting for the girl you love' shtick and it actually deals with loss and not always being the big glorious hero out there. Light Saga, Steel Saga and to a lesser extent, Heaven's Saga and Sky Saga show that a hero is more than one lone guy with fancy weaponry. That it takes more than one person to save the day, that heroes are just people with their own misfortunes and flaws yet fighting for a better future, that you won't always manage to tip the scales, that you won't always get the people's favour on your side and that even being there for someone and brightening his or her life makes you an hero as well -- those are several messages Cho Dengeki Stryker evokes throughout the story. It can be a bit cheesy at times but to me it was dealt with in a more mature yet passionate way (compared to other Shonen or Shonen-styled stories), hitting it close to home.  =OVERALL=  Due to character limits, I can't go all too much in lengths but the music and graphics are all-around a pleasure to see and listen to, especially in regards to the CGs, anime scenes and vocal tracks. While it's my very first VN, I still stand by the claim that this is so far one of the best stories I've ever experienced regardless of medium and that I really hope that the future might offer a story similar to Cho Dengeki Stryker. Hopefully, this time with more warriors dressed up in colourful spandex and karate-fighting bugmen riding on motorcycles. It's obviously far from perfect, being riddled with various plotholes and confusing moments, but it makes it up with the themes and messages it presents and the enchanted mixture of decent character development, well-detailed action scenes, drama, comedy, visual presentation and soundtrack. What are you waiting for? Give it a read, enjoy the ride and be charmed by its action-packed narrative with its moments of laughter, tears and inspirational messages that are a necessity for your inner justice-loving hero-worshipper/wannabe.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly I first played this game back at 2011 so I'm familiar with the story and what will happen in the end (Im not going to spoil some detalis here it will ruin your enjoyment and the thrill it gave ^_^). Back then, the game has only 2 heroines so for me the game can be finished for only an hour or half a day and the story is not well refurbished in a way there's a lot of 'plot holes' so I think it will have a sequel and that's the Cho Dengeki Stryker ^_^  Everything in the first game has doubled in the sequel it's new added scenes, sprites, heroines and the true ending of the game. Plus I enjoy the part animation of the characters so I hope this will be popular and have a full-fledged anime sometime this year or for the next years ^_^  Being a Hero is is not an easy task... I recommend this game to all if you like to see a high quality visual novel and a great plot ^_^.",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to start by apologizing for my language in this review, but there's no better way to articulate the way I feel about Dengeki Stryker.  It's harder to connect to the characters than in OVERDRIVE's other major titles. It won't make you cry like a ♥♥♥♥♥♥♥ child like KIRA KIRA. It won't make you laugh (and cringe) like EDELWEISS. It won't get you worked up like DEARDROPS. It will make up for it in pure ♥♥♥♥ing badassery.  It just tells a really good story, over the course of the entire thing. You really have to play the three original Sagas in game to get the entire story. They're not really separate.  I had originally kind of 'meh' impressions with the Zero Saga (the first one), but I jumped right back into the game for the Heavan and Sky Sagas and was not disappointed.   So, why the lackluster first impressions? It's a superhero visual novel. That's not a bad thing in itself, but it's very focused on that. It's split up into chapters like a half-series length anime with a lot of action. You don't get a whole lot of time just bonding with the characters, and because of that, you don't fall absolutely in love with them like you would in other visual novels. That's just not what this is about. That said, this also means that when bad things happen to the characters, you don't feel quite as strong about it (or at least I didn't feel as strongly about it).  Nonetheless, that's just at the start. The later sagas very much assume knowledge of previous ones and build upon them. This allows you to get the characters over time over multiple 'playthroughs', so to speak. Still, I'm not as attached to the characters as other OVERDRIVE titles. I'm not absolutely in love with some of the lead characters the way I am in some other OVERDRIVE titles. I do truly admire the characters the same way I admire the characters of DEARDROPS though. I suppose the whole '♥♥♥♥ this ♥♥♥♥; never give up!' attitude shared between the characters of both titles is something I'm drawn to.   I feel like I haven't really said anything good, but seriously. Dengeki Stryker is fantastic. Maybe I shouldn't have said I don't 'love' the characters. I do love them. I love the characters, but in the same way that I would love a hero, not a peer, and I suppose that's how it should be.  ... okay nevermind. I lied. At least two of the three newer sagas focus much more on particular characters and really let you get to know them better. It takes a little bit of time before you can access the new sagas though. It's completely worth it however. I thought the original storyline was good, the new ones are even better in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious. Nostalgic. and somewhat addicting.  You, as the reader, will know so much more than the characters so there is this level of frustration that builds the longer the characters are oblivious, but that only adds to the addicting factor and quite often the humor as well.   visual novel fans should love this no matter what",
            "review_score": "1"
        },
        {
            "review_text": "It is the law of the bath house... No towels allowed.",
            "review_score": "1"
        },
        {
            "review_text": "This is a visual novel.  Literally  a visual novel. This is not a game. It's essentially a digital comic with voice acting, and zero interaction and gameplay.  I don't have anything against visual novels per se, especially when they are actual games. For example  9 hours - 9 persons - 9 doors  is an excellent visual novel that takes great advantage of the medium to make an interesting, story-heavy game, but which has some actual gameplay in it.  But this isn't a game. This is  literally  a visual novel. There is no interactivity, there are no branching narratives to speak of, no puzzles to be solved, no gameplay, nothing. It's just that: A novel. Text with pictures. Like a comic, but more limited, with some animations here and there.  I understand that a distinction is made, especially in Japan, between actual visual novels and so-called adventure games (which use the same idea as visual novels, but incorporate interactive elements, such as eg. puzzles to be solved, and branching storylines.) But I wasn't expecting this  game program to be  this  non-interactive.  The art is excellent (probably the best that can be found on Steam currently) and the voice acting is ok (especially if you are a fan of japanese). However, with no gameplay at all... I just can't recommend this personally.",
            "review_score": "-1"
        }
    ]
}