{
    "app_id": 321480,
    "name": "Sigils of Elohim",
    "release_date": "2014-10-13",
    "developer": [
        "Croteam"
    ],
    "publisher": [
        "Devolver Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Casual",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 828,
    "negative_ratings": 71,
    "price": 0.0,
    "description": "Sigils of Elohim is a free mini-game prelude to Croteam’s upcoming first-person puzzler The Talos Principle that challenges players to solve dozens of challenging sigil puzzles under the watchful eye of Elohim.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/321480/header.jpg?t=1447363491",
    "minimum_requirements": "OS: Windows XP/ Vista/ 7/ 8 Memory: 1 GB RAM DirectX: Version 9.0 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Sigils of Elohim is a puzzle game based on the upcoming 'Talos Principle' game by Croteam which engages users to think to the best of their problem solving abilities. You're given a number of shapes to work with and an overall spectrum to insert them in, just like a puzzle. In fact, Sigils of Elohim is basically like a physical puzzle that you place items in to make fit.  Is Sigils of Elohim better than a physical puzzle? The short answer; yes. The long answer? Sigils of Elohim is all that you could ever want a puzzle to be. It's simple, easy, and at the same time challenging beyond belief. Best of all; It's free.  Sigils of Elohim takes an approach like a typical iOS/Android title (as it's also free to play for those platforms) and works well as a PC game as it engages simple fun into a very complex situation. Making all the pieces fit the puzzle box may look easy but you're taken for a wild ride once you've tried every possible solution that you feel your brain can handle, and still can't manage to solve it. The only limitation is your mind, and your imagination.  You can also use codes in this game to get promo items for 'The Talos Principle' coming soon.",
            "review_score": "1"
        },
        {
            "review_text": "Sigils of Elohim managed to entertain me for the (short) duration I played it, and since it's free that's all I asked for. The screenshots on the store page give a perfectly clear picture of what sort of game this is and the game gives you precisely what you'll expect seeing those screenshots in gameplay. Music is fairly short and you will most likely notice the looping but as the game doesn't take too long to clear it's not too much of an annoyance.",
            "review_score": "1"
        },
        {
            "review_text": "A review for a free game! You can spend much more time by reading this all than trying the game yourself !  Okay I will try to be concise. Do you like tetris? No? Is it because it is rushing you towards putting blocks one after another while not allowing to enjoy the feeling of perfectly fitting corners, rotating the little weight of each block?  Oh, so you do like tetris. But were you ever curious about what would be the gameplay like if there is no additional blocks, just a limited number of them, no possibility of erasing lines, just you, your monochrome blocks, and gameplay area?  If so, this is your game. If you are as cultured as me, then you might see the resemblance between this game and Tangram, supposedly a Chinese game about making shapes from triangle blocks with different sizes. You can use your intuition, your basic understanding of geometry... OR... time to endlessly trying every possibility between 6-8 blocks to fill the table in each level. That is the only bad side of the game, it frequently needs mindless rotating and this dumb strategy is a pretty valid one even for a speedrun.  Other than my this little complaint, this is a pretty good game especially if you consider 1. it is free. 2. it is actually a promotional material. (I heard that the same concept is used in Talos Principle a few times, so a good way of promoting as well) The most thing I like about this game is, it is not trying to be more than what it is, it is a simple puzzle game with few rules and that is that. It does not give any other way of playing it, options do not allow much tweaking etc, and I think this minimal approach helps it. The atmosphere is a relaxing one, and whole design helps this feeling.  What else? Blocks feel good it is as if you are playing with some wooden legos. Music is especially good, getting near masterpiece quality but a bit depressive if you ask me. It made me cry once, since I spent 10+ minutes in a chapter!  To summarize, buy it if you find it less than 0.01. Oh Wait.",
            "review_score": "1"
        },
        {
            "review_text": "Sigils of Elohim is a simple puzzle game, and prequel to The Talos Principle. Sigils of Elohim, plays alot like puzzle Tetris, where your objective is to place the different shaped blocks on a board and fit them all in with no overlap. Overall the concept is simple, but can be challenging. There are, at least in my opinion a decent amount of puzzles in game, currently there are 32, but I hear there may be more added later on. completing each group of 8 puzzles unlocks a code to be used in The Talos Principle. I have got to say the game is worth it though, its free, its simple, and while it has no achievements or leaderboards or anything like that, it is still a worthwhile game. And I have got to say, I really like the soundtrack. There may be only a few songs but they are pretty darn good!",
            "review_score": "1"
        },
        {
            "review_text": " PROS:  + simple but challenging puzzles + relaxing menu/game sound + unlockable rewards for The Talos Principle + FREE!   CONS:  - rather short - no menu options to change settings - some reward codes are already used   Comment:  It's clear that Sigils of Elohim should just motivate you into getting The Talos Principle but it’s actually good if you are into puzzle solving and tetris blocks. Three puzzle packs (A, B, C) have 4 color areas each and every area has 8 levels. So that's 96 FREE levels to test your puzzle skills in. The game isn't casual or very hard, you can find it somewhere in the middle. It even contains a reward for each color area passed but as I read the rewards do not always work in TTP. Because of generators that some people use to generate reward keys without playing this game (apparently contacting the devs could get you new codes). Overall a good game that is short and nothing really special ... but it's free and fun to bend your mind for a while.",
            "review_score": "1"
        },
        {
            "review_text": "A good companion to The Talos Principle. Don't be afraid to play it if you don't own TPP: it's enjoyable as a standalone game and will keep you busy for a few hours with its tetris-esque puzzles. However, if you do own the original game, Sigils of Elohim is also nice because it gives you codes to redeem in TTP to get short messages related to the story. A nice bonus, but nothing too big.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty good puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Great little puzzler!!  Not easy, you think you're getting the hang then get a doofus of a level, but it's rewarding. Soundtracking is good, relevant but not distracting and I'm really looking forwards to The Talos Principle as a result!",
            "review_score": "1"
        },
        {
            "review_text": "Stationary Tetris.. on crack. The music is VERY soothing, beautiful and peaceful...  (to the point I think it made my brain slow down)  It's a nice primer to the Talos Principle. I went to play this after I discovered it unlocked stuff in Talos. Was a nice gem to discover and you cannot beat the price. LOL.  Good, relaxing puzzles to play, whether or not you have Talos Principle.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This little game give you code which you can use in the main game ' the talos principle'. The puzzles are fun and really interessting.  Nice to play even if you don't want to buy the tales principle.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome music and simple gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Suprisingly fun and challenging puzzle game, its free and you get special codes that unlock mysterious things in the upcoming Croteam game 'Talos Principle' go play this game now!",
            "review_score": "1"
        },
        {
            "review_text": "Great game for time pass xD But Its too hard .-.",
            "review_score": "1"
        },
        {
            "review_text": "Its free and its fun. The ties with The Talos Principle through the free code you unlock after completing a number of puzzles are neat but aren't really needed. This is what a companion game should be, a neat game that stands on its own and brings a bit of an added value to the main game while not being something you miss if you play the main game as is.",
            "review_score": "1"
        },
        {
            "review_text": "A simple puzzle game that also gives you codes for Talos Principle.",
            "review_score": "1"
        },
        {
            "review_text": "guys your codes is not working all time says sb already used code you need new one",
            "review_score": "-1"
        },
        {
            "review_text": "great and challenging puzzle game and also alohim is hebrew for god",
            "review_score": "1"
        },
        {
            "review_text": "Relatively easy going game if you're into this sort of thing though a bit of a bugger if you're not good at them - little variation as all the puzzles were putting tetrominoes into a rectangular space. A good control system and (most of the time) things stayed where you left them except to snap into place along the grid lines (would have been nice if that applied to the right side fo the screen too). Overall a passable game for those into the genre but an avoid if you're not into tetris puzzle like games.",
            "review_score": "-1"
        },
        {
            "review_text": "GET the Sigils! DESTROY Elohim! WHERE is the cat? 'Triple-A Tetromino Terror!'",
            "review_score": "1"
        },
        {
            "review_text": "This Mini-Game it's a test 4 your skill in prepare of the Real Game! Magicolo Game testing 2014",
            "review_score": "1"
        },
        {
            "review_text": "Tihs gmae mdae me tpye tihs way. Atefr a palynig a cuolpe of hrous.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "'Wait,hold on,is this puzzle beatable without flipping these pieces?'  10/10 Best puzzle game yet.",
            "review_score": "1"
        },
        {
            "review_text": "i love a well designed and relaxing puzzle game, and 'Sigils' certainly fits the task. Another one i loved was Da Vinci's Last Conundrum, which was also extremely fun and hard.  I guess this game is still in a sort of 'early stage' due to its connection to the Talos Principle Game, but i'd like to enquiry about the A - B - C kind of letter signs which can be seen in the level choice screen and when clicked only make a sound. (Only the letter A is always lit...) I was wondering if the rest of the letters will be available later in the game... because i have finished ALL tests in under 1 minute hoping that would unlock the letter B but no...  please get back",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game!! At 1st, struggled with the really small puzzles, but then, as they got bigger I got better!! I'm always going back to play this game to keep my mind sharp!! This game really calms me down and helps me sleep better and function during the day. I'm writing this review after completing the Alpha series of puzzles, It took me 3 hours to complete the current series. During my Alpha playthrough, I'd go back and improve past puzzle times, rather than 3 hours, I cut my past record down to 28 minutes. For a free game, you really can't go wrong, good music, pleansant visuals and excercise for the mind...It's a winner in my book! Download it!!",
            "review_score": "1"
        },
        {
            "review_text": "Matching a couple of blocks, sounds easy doesn't it? Well maybe it is but it sure is hard for me!",
            "review_score": "1"
        },
        {
            "review_text": "After about 30 minutes of playing this, I have concluded... I suck at puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "For a free game this is excellent. No babysitting here. Your brain will hurt. Hardcore puzzle solving required. After a while it's almost like you are in the matrix - you start to see shapes in 3-dimensions and plan 12 moves ahead.",
            "review_score": "1"
        },
        {
            "review_text": "good little pass time game to play while you're waiting on a queue or just trying to burn time",
            "review_score": "1"
        },
        {
            "review_text": "A fun mini-game... but it lacks the adictive quality of Tetris.   Interesting puzzler but it soon got dull",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic puzzle game which is both enjoyable and challenging.  After a few of the more difficult puzzles you begin to learn certain combinations of pieces which tend to work well. Completed section A in little over 50 minutes, so the game is not long - but it needn't be. If you've got some spare time and are unsure of what to play and don't really want to commit to anything big then this is the game for you.  Nice work by the devs to provide unlocks for their main game (Talos Principle) as well.",
            "review_score": "1"
        },
        {
            "review_text": "I never know that Croteam can make such an excellent game without a gun in it.  10/10 will re-examine my stupidity again",
            "review_score": "1"
        },
        {
            "review_text": "Sigils of Elohim is 72 tetramino puzzles - that is to say, trying to form a solid block (a square or a rectangle) using nothing but a set of tetraminos (basically, four squares stuck together - think tetris) given to you for each puzzle, with a different shape and a different assortment for tetraminos for each one.  It is free, and if you're really dying to solve tetramino puzzles, it has 72 of them... but there's absolutely nothing else to it whatsoever. So, uh, yeah.",
            "review_score": "-1"
        },
        {
            "review_text": "Puzzle game yay xD and nice music to concentrate :D",
            "review_score": "1"
        },
        {
            "review_text": "Very repetitive and time consuming, but also extremelly perplexing... where does the difficulty come from? Adding pieces can also add solutions, too few pieces and the possibilities are very limited... Are there strategies you can use or is this just fuzzy logic, gut feeling and random luck? Very odd little time waster.",
            "review_score": "1"
        },
        {
            "review_text": "this game is good ill give it a 9/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Not bad at all...Not too hard either, as mentioned before didn't really notice any difference between red and yellow etc. But one might think the reds were harder possibly. I'm assuming this is a sort of demo as well because it felt like the B and C in the main screen would unlock after completing A but alas, they don't.  Overall 4.5/5 for having nice simple graphix, a soothing tune (bit churchy though :)) and some decent thinking effort for me to solve. That -0.5 is for lack of B and C :P If this turns out to be a small bug and I can play those after a patch or something then you'll get that too..",
            "review_score": "1"
        },
        {
            "review_text": "Download it if bored. Pretty fun puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Mini-game the Game! In all seriousness if you want to get good at Tetriminos style puzzles and prepare for the Talos Principle, have fun!",
            "review_score": "1"
        },
        {
            "review_text": "It's free. It's fun. It's like Tetris. 96 mini-puzzles.   More fun if you are also playing Talos Principle (which you should). ",
            "review_score": "1"
        },
        {
            "review_text": "The only reason I can recommend this game is because it is free.",
            "review_score": "1"
        },
        {
            "review_text": "I am so stupid I couldn't discover a mistake in Einstein's theory.",
            "review_score": "1"
        },
        {
            "review_text": "A nice simple puzzle game where you try to fit tetris shapes into a fixed area.  Easily worth a download if you like puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little puzzle game. I wish it would remember my progress, however.",
            "review_score": "1"
        }
    ]
}