{
    "app_id": 32150,
    "name": "Everyday Genius: SquareLogic",
    "release_date": "2009-10-21",
    "developer": [
        "TrueThought"
    ],
    "publisher": [
        "TrueThought"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Puzzle",
        "Indie"
    ],
    "achievements": 24,
    "positive_ratings": 303,
    "negative_ratings": 6,
    "price": 3.99,
    "description": "The next generation of puzzle games is here! Combining simple arithmetic with colorful cages and logical problem solving, this new puzzle game makes sure you never have to guess—and you don’t have to be a math wiz!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/32150/header.jpg?t=1447352629",
    "minimum_requirements": "OS: Windows Vista/XP Processor: Processor Speed: 1.0GHz Memory: 256MB RAM Graphics: 32 MB Video Card DirectX®: DirectX 8.1 or higher Hard Drive: 30MB Free HD Space Sound: Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "(10/10) - Masterpiece  Well i don´t know what to say to this other than 'just buy it!'. Perfect level design, no guessing... never, always only one solution, good categories of puzzles and an awesome learning curve starting from 4 numbers and very easy levels for the quick run and going to 8 numbers that crack your hat.  Buy it, it´s worth it. For that price you get roughly 17,000 puzzles. .....what else can i say....",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played",
            "review_score": "1"
        },
        {
            "review_text": "As avid suduko fan and lover of math this game is everything I could ask for. Even if you're neither of those things, if you enjoy puzzles I'd still give this a shot, it is an A+ puzzle game with an incredibly long shelf life. Almost 120 hours in and I still haven't gotten that final region achievement. Really glad to see this back in the store, I remember it being taken out not too long after I first bought it.   It does crash for me alot though? On both my old windows 7 laptop and my new windows 10 one. So I find myself exiting puzzles every once in a while just to save my progress. But I still can't recommend it enough.",
            "review_score": "1"
        },
        {
            "review_text": "I'm normally not one to write a recommendation for a particular game in my library; my tastes are quite diverse and everyone else's tastes are different. However, Square Logic is a unique game with a unique place in my gaming heart. It is a puzzle game in its purest form: no animated characters, no falling objects, no globs of goo, no skeletons in the closet, and no laws of physics... but most definitely rules of math. If you don't know how to add, subtract, multiply or divide, you will have trouble with this game. (If you can't count to 9, you'll have even more trouble, but for that you can watch Sesame Street.) Square Logic is a perfect game to give your brain a daily dose of exercise, a mental twice-around-the-block if you will. Some people will argue such a workout will help you think better in all aspects of your life. To me, it's just fun.    The game forum will provide more feedback from those who have already joined the Square Logic addiction. See you in the Beyond!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game on Steam",
            "review_score": "1"
        },
        {
            "review_text": "Way too many puzzles...",
            "review_score": "1"
        },
        {
            "review_text": "My playtime is not accurate for this game, FYI. First play the  HexCells  series before you invest in this. They are very similiar, yet much better. This game is more focused on numbers, and mathematical operations. Graphics are real meh - almost subpar. Music is meh.  Game play is fun, in a casual coffee-break kind of way.  Somewhat addicting.  I would almost add that there seem to be  too many  levels, as well. For example, for each challenge I finished, I unlocked nearly 800 levels. Ain't nobody got time for that. Thankfully you can just 'skip to the main boss challenge thing'. Once again,  HexCells  gets around this with random levels (hence, infinite).  I wish there was a 'maybe' option, but for this title I will give it a thumbs up with the caveat that you know what you are getting into. Its fairly cut-and-dried.",
            "review_score": "1"
        },
        {
            "review_text": "This game is GREAT! Sudoku on steroids would be an understatement. If you enjoy exercising your logic skills and want to pass some casual time during lunch break, on a flight, in the back seat of a car, or just on a rainy afternoon, this game is for you. There are literally thousands of puzzles, so you'll be able to keep returning again and again without unintentionally retreading old ground. The price is definitely right for all of the gameplay you can get out of it.  It's always good to give the brain a little work out now and again, and this game is the perfect way to do so. So, get it, pass the time, and sharpen your thinking. :D  (only con is that there is no Mac version (yet), which is a shame for us Mac users who have to reboot into windows to play)",
            "review_score": "1"
        },
        {
            "review_text": "Significantly less boring than sudoku! Plus it'll make you smart and junk.",
            "review_score": "1"
        },
        {
            "review_text": "Highly addictive game! I've always said that I 'hate math' but this game makes it entertaining and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive. Great if you like sudoku and kakuro games.",
            "review_score": "1"
        },
        {
            "review_text": "Not very good at math? Hate it even? Fear not! This game will make you feel very smart! With hundreds of puzzles to solve, this game will keep you busy for a while!",
            "review_score": "1"
        },
        {
            "review_text": "good game while watching tv",
            "review_score": "1"
        },
        {
            "review_text": "Thousands of sudoku-like puzzles if you somehow find yourself with plenty of extra time.  Puzzles range in difficulty from 4x4 with odds, evens, addition and subtraction to 2, side by side overlapping 9x9 puzzles with greater/less than, straights, division, multiplication, and blind squares.  Comes with plenty of tools to make solving easier, or if you want a challange, you can turn off all assistance for a hardcore experience.  Recommended for number puzzle lovers!",
            "review_score": "1"
        },
        {
            "review_text": "If you like Sudoku or logic games, this is the game for you. It's like an upgraded version of Sudoku, making it more fun and challenging than your average number puzzle. There are more than enough puzzles, all with interesting mechanics and twists. The soothing music goes well with the overall theme, which really polishes a well-made game. It even has achievements and Steam-cloud so you could have your profile on multiple computers. If they ever make a sequel I would instantly preorder it. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "The main quest has tons of variety as the difficulty ramps up. There are literally hundreds of bonus puzzles beyond the main quest. The game blends sudoku, kakuro, ken ken, and that one with the '&gt;' and '&lt;' signs.",
            "review_score": "1"
        },
        {
            "review_text": "WHY DON'T YOU OWN THIS YET",
            "review_score": "1"
        },
        {
            "review_text": "It's a cross between Sudoku and math puzzles, making it better than both of them. Worth it if you liked either, otherwise not worth it at all.",
            "review_score": "1"
        },
        {
            "review_text": "Sudoku with a Math twist. I'm not a huge fan of Sudoku, but when each box is mathematically tied to a group, it suddenly becomes a fun puzzle. I recommend this to anyone who likes number puzzles based on simple math concepts (addition, multiplication, even, odd, etc.)",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant time-wasting puzzle game, that promotes logic thinking. It also has literally thousands of hours of content.",
            "review_score": "1"
        },
        {
            "review_text": "sudoku with extra conditionals and it has more puzzles than there are atoms in the observable universe",
            "review_score": "1"
        },
        {
            "review_text": "This is the only game in my library that I've been addicted to long enough to complete all of the Steam achievements.",
            "review_score": "1"
        }
    ]
}