{
    "app_id": 321800,
    "name": "Icewind Dale: Enhanced Edition",
    "release_date": "2014-10-30",
    "developer": [
        "Beamdog"
    ],
    "publisher": [
        "Beamdog"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Fantasy",
        "Adventure"
    ],
    "achievements": 50,
    "positive_ratings": 710,
    "negative_ratings": 123,
    "price": 14.99,
    "description": "Evil stirs beneath the Spine of the World. In the northernmost reaches of the Forgotten Realms lies the region of icy tundra known as Icewind Dale. Confront an evil that schemes beneath the carven glaciers and mountainsides to wreak destruction upon the face of Faerûn.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/321800/header.jpg?t=1531520175",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8, or Windows 10 Processor: Intel Core 2 Duo or equivalent Memory: 1 GB RAM DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The first thing you need to know about Icewind Dale: Enhanced Edition is that it's Icewind Dale. Beamdog's update of Black Isle's 2000 classic Dungeons and Dragons high fantasy adventure is still as deep and tricky as it ever was. This version is a patched up and polished joint package of Icewind Dale and both of its expansions, Heart of Winter and Trials of the Luremaster. If that means something to you, odds are you've already decided whether or not to buy it. If it doesn't (or if it does but you're still unsure), then read on.  Icewind Dale is based on 2nd edition Dungeons and Dragons, and if you've played any of the other infinity engine games, you know exactly what to expect mechanics wise. This time, however, you'll be building your own party from scratch. While veterans have a good idea of where to go, you absolutely can gimp your party during character creation and wind up headbutting your way through a playthrough that is more difficulty than it needed to be, so if you're a complete novice I'd recommend you look for a guide on the internet. A little hand holding might have been nice here, and it feels like a missed opportunity by beamdog, but its still no great object.   The main game, Icewind Dale (as opposed to its two expansions) is more fast paced than your average swords and sorcery campaign, and you'll do relatively little carousing with the villagers or solving problems with tools other than axes and fireballs. Battles feel very large, and you'll often breathe a sigh of relief when one floor of a dungeon turns out to contain friendly faces (something the game does fairly often owing to its long dungeon crawls). The game also basically throws you to the wolves, and early on you might find yourself doing a little bit of rope-a-dope by luring one or two enemies at a time - that's bad enough, but it feels as if the developers intended it, which is worse. There are relatively few sidequests to boot, and Kuldahar, the town that serves as a hub of sorts, feels a little too small at times. Still, the story whisks along and actually manages to get pretty interesting at times, and although your characters will be more or less mute for the duration of the game, the voice acting from the game's NPCs ranges from good to excellent.   Overall, the game runs pretty nicely. It's a testament to both how good the original game looked and how nicely Beamdog has cleaned it up that it is still pretty aesthetically pleasing today, and it ran natively on my laptop's bizarro universe 1366x768 monitor. I never experienced a crash to desktop and experienced only one bug that required a reload (to an autosave taken about 60 seconds prior to the bug) during my entire 32 hour playthrough. By the standards of high concept fantasy games, this just about represents a mirror sheen. My one complaint is that fire effects (which are literally low resolution sprites) would often cause the framerate to inexplicably collapse, and more than any other Infinity Engine game, the beautiful painted backgrounds in Icewind Dale often do a lousy job of differentiating between places your characters can go and territory that is unpathable like deep chasms or walls.  The expansion, Heart of Winter, was criticized at launch for feeling too short (leading to the subsequent release of the downloadable Trials of the Luremaster, which is included here), but after reflecting on my playthrough I disagree pretty strongly here. Instead, the expansion has two entirely different problems that made it feel too long!  The first of these two issues is that by the time you wrap up Icewind Dale you're dealing with a seriously powerful party of adventures using some major endgame equipment. Save for a few items that actually get upgraded by doing certain (insubstantial) questlines, by the end of both expansions I'd replaced almost none of the equipment that my party was using at the end of Icewind Dale. While the game isn't meant to be a loot treadmill, it's a real bummer everytime you identify a new shield only to think 'ah, well I'll be selling this.' The only area where I felt any improvement was in my spellcasters, and by that time managing so many spells becomes so difficult that its effectively impossible, so I just relied on my big high level bangers every fight.   Additionally, while the battles in Icewind Dale sometimes felt a little exhausting, by the time you're through Heart of Winter and Trials of the Luremaster, you might well be bored of fighting, and since that's basically 100% of what you'll be doing, that will put a damper on your enjoyment. On Core difficulty (the default difficulty, which can really be quite tricky) all battles devolved into the same slog of sending my fighters to hack away at enemies while I used my casters to cast as many area of effect spells as possible. The contrast here between the expansions and the base game could not be stronger, as in Icewind Dale you constantly have access to new and interesting options as your characters get more powerful. You probably wont spend more than a cumulative 12 hours on the two expansions, but they feel like a really long 12 hours, and not always in a good way.  Fans of Baldur's Gate: Enhanced Edition and Baldur's Gate II: Enhanced Edition should take note that there is no extra game content whatsoever, nor any mini-expansions equivalent to the Trials of the Black Pits, so once you've finished Heart of Winter, you're done. Still, even though the base game is much better than its expansions, and it feels like Beamdog went a little light on the feature inclusion, I thoroughly enjoyed my time with Icewind Dale: Enchanced Edition, even if it ran a little longer than it maybe should have. The game is a ton of value for money to boot (at a paltry $20USD), so if you're feeling like a rollicking good time in the wind blasted north of Faerun, then you owe it to yourself to give IWD a go.",
            "review_score": "1"
        },
        {
            "review_text": "I love RPG games, and i missed this one when it originally came out because i use Linux exclusively. When the EE came out on Steam with Linux support, it was my chance to finally play this classic. After spending 2 hours on carefully building a team, setting the skills points, selecting classes/races; i die on the first battle. Obviously this game is hard and shows you how much games have changed. Even modern games which try to capture the spirit of the old RPG games (for example, the excellent 'Legend Of Grimrock') don't come close in difficulty level compared to Icewind Dale. If you're looking for an easy game, you're not going to find it here. But it doesn't matter, it's a good game and soon enough you'll get the hang of it and slay monsters and solve puzzles as if there is no tomorrow (hang in there and keep trying). But you need to get into it for sure, after i came out vacation i had to get into it again, because i got defeated at the first battle. Modern games would be much more forgiven. Somethings could be better, for example pathfinding is not always optimal, this causes a character to choose a really weird way to get to the marked destination, sometimes with undesirable effects. And don't be fooled with the word 'Enhanced' in the title. It is still very much the same game as it was originally released, no rerendering of the gfx/movies for example, doesn't make the game look that great at certain points.  There are no issues with the game on SteamOS, not once did it crash, slow down or give problems. It is a massive, great game and you should check it out if you are a RPG fanatic or a retro game player.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this first time around. I know I'm in the minority but I preferred it to the baldurs gate games.  The EE is largely the same as the old one but tweaked, naturally. the graphics look slightly better then playig the old version. slightly.  The modify party element is missing which is a bit of a problem, but there are work arounds.",
            "review_score": "1"
        },
        {
            "review_text": "Dude, I've bought this game 4 times now... Original CD, here, DRM-free, and DRM-free vanilla.  I've got issues; Will probably buy again",
            "review_score": "1"
        },
        {
            "review_text": "It's the same game you may (or may not) remember, there doesn't seem to be a huge amount of difference to the original but it still kicks bottom.  If you have the patience, to play through a slow moving old school CRPG then give it a go............",
            "review_score": "1"
        },
        {
            "review_text": "A seriously awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "Good work as with BG1 &amp; BG2 enhanced editions.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of people say nostalgia isn't always as good as it seems, but in the case of Icewind Dale it's just as good if not even more enjoyable as when I played it as a kid. All of the enhanced edition features are great and the game is well worth the buy.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, can't wait for IWD2 Enhanced Edition.  If you were born in the 90's and still haven't bought this game then what are you doing?! :D  I will give this a 9/10. The reason it is not 10/10 is because of the AI pathing, sometimes it is a bit annoying but otherwise a masterpiece!",
            "review_score": "1"
        },
        {
            "review_text": "One of the great RPG's. It has an intriguing story that promises a lot of late nights.",
            "review_score": "1"
        },
        {
            "review_text": "One simple word: OUTSTANDING!!!",
            "review_score": "1"
        },
        {
            "review_text": "Personal rating: 10/10 Replayability: High Budget: If you already own the original, buy on sale only.  Lenght: ... It took me years to finally complete it. I'd wager an experienced player can get it done in a week or more. No less.   If you haven't played Baldur's Gate, acquire the enhanced edition of Baldur's Gate and play that first. If you like it, play Baldur's Gate II Enhanced edition after that, and THEN try your luck with Icewind Dale.   Icewind Dale is almost exactly the same game as Baldur's Gate, but it's a new story and a new location. Icewind Dale has an awesome story, that unlike Baldur's Gate, puts nearly no stock on the protagonist story wise, but it's also tactically speaking a much more challenging game.   ",
            "review_score": "1"
        },
        {
            "review_text": "excellent game! Very challenging. it takes me back to happier days and when played with friends feels even more dndish",
            "review_score": "1"
        },
        {
            "review_text": "Classic RPG. Best of the beamdog Enhanced Editions. For BG1&amp;2 it's still better playing BG Tutu rather than their enhanced counterparts (look it up) but this one will do nicely.  Adding custom soundsets is a bit tricky though so beware.",
            "review_score": "1"
        },
        {
            "review_text": "Really loved going back to Icewind Dale with this new Enhanced Edition. Definitely enjoyed the mouse wheel zoom, scaling resolution display, and the multiple tweaks to the user interface &amp; player options. Having played through this numerous times before but not in many years, I really liked the Story Mode (invulnerable, +100% xp).",
            "review_score": "1"
        },
        {
            "review_text": "What a great game! Anyone who is a fan of D&amp;D style RPG will love this game. Also check out Baldur's Gate, and Neverwinter Nights.",
            "review_score": "1"
        },
        {
            "review_text": "Every bit as good as the old game. Would recommend for any RPG fans out there, even if you've never played any of the original games.",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as Baldurs Gate, but a nice intermezzo. Some fights are very hard to do, with a steep learning curve.  Would buy again!",
            "review_score": "1"
        },
        {
            "review_text": "Dice Rolling Simulator  10/10 Still making my chracters",
            "review_score": "1"
        },
        {
            "review_text": "I concur with other positive reviews about nostalgia, a wealth of things to explore and a difficulty that makes you take this game serious from the start or goblins will kill you.  I heartily recommand this game to any DND fan, especially if you know the second edition (whose character creation rules are entirely differant from 3e and onwards, for exemple most stats don't matter at all (or very little) between scores of 8 and 14.)  The only source of frusteration in this game to me is the pathing. If you have a game with a wealth of dungeons and caves and crypts full of small tunnels and rooms it's decidedly not amusing to see the group split up when you send them the same way, when characters who are supposed to stay in the back of the formation run ahead and subsequently get blocked by the melee characters when an enemy strikes because they can't get past them. It's also not amusing when goblins kill the paladin while the cleric, who is told to go and heal the paladin, gets stuck behind the rogue while there is plenty of room to go besides him left and right and instead of going around just stands there humping the rogue while the paladin dies. It's hard to control six characters when things like this happen.  But that, while aggrevating, is the only real thing I find really frusterating about the game so I'd still recommand it, though not as heartily as I would if the pathing was a little better.",
            "review_score": "1"
        },
        {
            "review_text": "One of favorite games from years ago. Lots of combat and still plays great. I would love to see IWD 2 but i think Beamdog has done a great service for those of us that want to relive a great game.",
            "review_score": "1"
        },
        {
            "review_text": "This game will make you angry. It will ♥♥♥♥ you off.  Then you'll be so very happy when you complete each quest.",
            "review_score": "1"
        },
        {
            "review_text": "My priest got hurt and started yelling for a priest.  10/10 would make a party made of only bards/priests again.",
            "review_score": "1"
        },
        {
            "review_text": "very good say is i am think of thank         YouTube™ Video:  How To Icewind Dale Enhanced Edition!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "One of the best isometric games ever",
            "review_score": "1"
        },
        {
            "review_text": "Really good game that is a must play for every RPG fan.",
            "review_score": "1"
        },
        {
            "review_text": "This game is good. I play a lot of Baldur's Gate. I enjoy the characters and the journey of creating one focus main character that has a history and is deeply involved in the central plot. This game is a little lacking in that department. It actually doesn't even deal with it at all. It's very beautiful and it's full of Dungeons &amp; Dragons lore which I love, but it's basically a little lazy from a player's perspective. You're an androgynous party that just happens upon the most epic time ever in the history of ♥♥♥♥ all Spine of the World. It's pretty intense. You just happen to be the most brutal kick ♥♥♥ party this territory has seen. They do their work. The actors and the writers make the events exciting and interesting, but it doesn't suck you into the storyline quite as easy as the 'Gorion's Ward' does.   On the plus side, if you really want to lick your chops and get into Dungeon's &amp; Dragons awesomeness, this is your game my friend. But who has time for that ♥♥♥♥, in this darned and dirty time ♥♥♥♥ed world? Baldur's Gate still trumps the storytelling, but this is a wonderful addition. The added feature to export characters and try out quick level builds is a nice touch, and a personal chakarazer thank you for that goes out right there.  Overall, I can't recommend this to the general consumer. A+++ from me personally, and that's a lot of proficiency points, but a big fat downy thumb for ol, jonny browse.  Also, when constructing a party for this game. Also a counter argument-to the afformentioned idea of how you can still get sucked into the game world mechanics, this game encourages developing the strongest six person party one can take to tackle the frozen tundras. I would recommend a bard in your party. Personally, I'm a 'bard in every party,' as a standard rule of thumb anyway. It doesn't hurt to always hang out with hot cheerleaders, you know what I'm saying brother? But yes, in the game the bard is extremely useful. Later on, a standard bard can learn the March of the Sith song, it has regenerative powers, AC bonuses, and overall use's the ♥♥♥♥ing word Sith in it's name, so.   No bard would make an advisable alternative for those seeking a challenge.  Also, excellent character classes to have in your party:  Undead Hunter Paladin Avenger Druid Sorcerer (Dragon kind is a good option)  Any good tank is usually a cleric of some kind. I personally leveled up a fighter with high wisdom until I liked it and dual classed a cleric then exported it and started over. He is quite powerful.  At the time of this edit, I've found no discernable use for a thief in the party. It's possible to go without.",
            "review_score": "-1"
        },
        {
            "review_text": "Firstly, Icewind Dale is a great game and if you haven't played it and enjoy the slightly slower paced games of yesteryear then I'd suggest giving it a go.  However, if you have played the game before and are buying IWD:EE to enjoy the new multiplayer support then give it a miss. The best we have managed is ten minutes in game before it crashes out. We're hosting on OS X and connecting with both windows and OS X if that helps anyone. Really disapointed as a I talked multiple people into buying a copy for gaming night.",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent game from a quite different era. The age doesn't show as it's still amazing piece of art.  However as I would only play this kind of game on tablet these days and there isn't touch screen support I can't recommended it. If/When touchscreen is supported I would recommended it with all my heart.",
            "review_score": "-1"
        }
    ]
}