{
    "app_id": 321960,
    "name": "Might & Magic® Heroes® VII",
    "release_date": "2015-09-29",
    "developer": [
        "Limbic Entertainment"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Turn-Based Strategy",
        "RPG"
    ],
    "achievements": 33,
    "positive_ratings": 1438,
    "negative_ratings": 1665,
    "price": 33.99,
    "description": "Might &amp; Magic® Heroes® VII makes a triumphant return bringing you the essence of turn based strategy gaming. Set in a fantasy universe with RPG progression with a strong story narrative, you will embark on a journey that you will never forget!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/321960/header.jpg?t=1527102679",
    "minimum_requirements": "Минимальные: ОС: Windows 7 SP1 or Windows 8/8.1 (64bit only) Процессор: Intel Core i5 660  3.3 GHz  or AMD Phenom II X4 955 @ 3.2 GHz Оперативная память: 4 GB ОЗУ Видеокарта: nVidia GeForce GTX460 or AMD Radeon HD5850 (1024 MB VRAM) Дополнительно: Game contains Denuvo <a href=\"https://steamcommunity.com/linkfilter/?url=http://(https://www.denuvo.com/)\" target=\"_blank\" rel=\"noopener\"  >(https://www.denuvo.com/) anti-tamper technology.",
    "recommended_requirements": "Рекомендованные: ОС: Windows 7 SP1 or Windows 8/8.1 (64bit only) Процессор: Intel Core i5 2400 @  3.1 GHz  or AMD FX-6100 @ 3.3 GHz Оперативная память: 6 GB ОЗУ Видеокарта: nVidia GeForce GTX670 or AMD Radeon HD7870 (2048 MB VRAM) Дополнительно: Game contains Denuvo <a href=\"https://steamcommunity.com/linkfilter/?url=http://(https://www.denuvo.com/)\" target=\"_blank\" rel=\"noopener\"  >(https://www.denuvo.com/) anti-tamper technology.",
    "reviews": [
        {
            "review_text": "'Things sure aint what they used to be' After 66 hours of gameplay, thats the conclusion I have come to.  If you never played heroes III or heroes V, you wouldnt know what you are missing... Wait yes you would. How about any semblence of a finished game?  This game is so glitchy I am consdering putting my law degree to work and starting a class action lawsuit... seriously.  Hero stat boosting items dont work, patch 1.5 made it so any skills you progress somehow are forgotten and you cant reselect them. to bad level 30 hero...  Remember the tears of Asha? It used to be avalaible on all maps in heroes V. Now only 1 or two maps have it in this game and you win as soon as you build it. What is the point of having boons attached to building it if you automatically win when you do???  I hate paying $60 for a game that doesnt even work. Frankly I am astonished that Ubisoft put this game out. Never again. No matter how much a game is hyped or seems like it will suck me back into my gaming of yesteryear, if it has an UBIsoft logo on it. I will not purchase it.",
            "review_score": "-1"
        },
        {
            "review_text": "**Edit below**  Tried to play this game multiplayer with a friend over both LAN and internet multi. Game reliably desyncs after approximately 3 - 10 turns or 'days', and crashes to menu the following turn.   This is exactly the same issue that presented when we tried to play throughout the beta. That this game is now fully released with identical bugs is a disgrace for a high tier publisher. The same issues presenting is unacceptable, particularly given the cash grab that was 'pre-order for beta access'. One would have hoped the beta would serve to raise issues, that would be addressed prior to full release. Unfortunately not.   Meanwhile, this game is being retailed as a multiplayer game. In its current state, this game should not have been released.   It's such a shame. I would love to recommend this game - if multiplayer reliably worked.  I really like the M&amp;M games, and I am really disappointed in the current offering. Multiplayer is currently so broken as to be unplayable.  Sadly, given the current state of the game, this is a strong 'DO NOT BUY' from me.   Disgraceful.  Chester  **Edit: My god, the frozen character models in the campaign cutscenes are atrocious? What year is this? I feel like this is a throwback to the '90s. Oh dear.**",
            "review_score": "-1"
        },
        {
            "review_text": "This game still has so many little problems and bugs that all add up to a frustrating time trying to play it  If you're dead set on buying it, I would wait until the expansion comes out in early august. It is supposed to include a lot of fixes and changes for the better.  The AI is dumb as a brick as well. Even the combat AI for neutral enemies...  Once you've spent about 4 hours chasing down enemy heroes with no armies in them on a large map, you'll appreciate how frustrating the AI tactics can be at times as well.  The animations and animation timing - despite going through multiple major revisions - are still barely acceptable.  There are multiple issues tied to adjusting the gameplay speed settings..  For some reason it forces you to stare at a blank screen while enemies fight combats in multiplayer.. (in previous versions you could still look around at the world and examine things, etc.)  The music is uninspired  The sound effects are decent  There are multiple balance issues with certain skills and units which still need to be worked out  The map editor is a disaster. A resource hog, unoptimized even in the least, and crashes frequently  Basically Ubisoft WAYYYY underbid the project costs on this game and didn't give the company who got it even half enough time to properly finish it, before forcing them to shove it out the door to meet some arbitrary marketing date.",
            "review_score": "-1"
        },
        {
            "review_text": "Typical of the garbage we get through Uplay. So many issues at release, multiplayer unable to connect. Unable to set a multiplayer game as friends only.. list goes on. Should get a refund for this..",
            "review_score": "-1"
        },
        {
            "review_text": "Soooo... dispite all the negitve stuff I've heard about this game, I bought it because I enjoyed Heroes V alot and I wanted another hot seat game to play. BIG mistake, With a i5-4690 16GB of RAM and a GeForce 970 (in simple terms more tham the recommemded requirements) and the game can't load a 'huge' map from thr RMG. I can create it in the Editor, but as soon as I try to play it *crash* kicks me out back to windows , no error code nothing! And then there are single player missions...Honestly, I couldn't care less about the single player, but I figured it would be how you unlock more heroes for hot seat. After 20+ hours playing the Haven set, mostly on Blessings of Freedom, I had to stop playing or I would do something drastic... All said, hot seat is still sort of fun but 'big maps' aren't big enough and single player sucks...F*** you Ubisoft... now back to playing Fallout,pretending every Raider, Super Mutant, and Deathclaw is a MMH7 developer! (Seriously, I can play FO4 on ULTRA and I can't play a huge map on the LOWEST setting! WTF)",
            "review_score": "-1"
        },
        {
            "review_text": "First time I have written a review about anything. I am going to keep it sweet and simple just to stop others falling into the same trap I did.  After reading many negative reviews, I decided to give the game a go any way as most of the reviews seemed to revolve around issues with multiplayer. I wanted to play the campaign or single player vs AI so I gave it a go. After about 20 hours of playing the extremely EASY and lacklustre campaigns.. I was still actually have fun as some of the game mechanics are really good. The campaigns dont really progress however and so 1 map you might start of with a level 5 hero, the next you are playing a different hero who is already level 20. This didn't really gel with me    and I began to see that rather than take my time to explore each map the best thing to do was simply beeline straight towards the finish line    and the campaigns really are easy. I found no real difference between playing on normal or playing on heroic - so I just jacked it right up to heroic just to try and give myself the illusion of progression on each map.  So then I decided to try single player vs AI. No simultaneous turns and the time between your turns really is ridiculous. I found myself reading a book or applying for jobs in between my turns - which hey actually I didn't mind but really shouldn't be necessary. AND THE BUGS. Oh my gosh there are a lot of them, bugs ranging from some of your building not working, your strategic spells not working, things which are only meant to let you cast a spell once per combat seem to increase this spell count each combat you are in until you can cast said spell an unlimitted amount of times (and your spellbook is fullup with multiple copies of the same spell. Let's say you are defending in a seige and someone flies over your wall and you decide to shoot them with a crossbow, well because they are now on your side of the wall they get a cover bonus even though they are standing about 1m away from you with no wall inbetween.  A lot of the bugs I could forgive as many of them cancel each other out - 1 bug hinders you and (although I felt like I was cheating) another bug will aid you. But I can not forgive game-breaking bugs that pop up many hours into a game and just render the game a complete waste of time. An example of this is when I defeated an enemy hero inside their city. I gained control of the city and the game informed me that player had been defeated. However his hero still took up the hero slot inside the city. This meant that I could not enter or exit any units or heros from this city what-so-ever.  This is turning out not as short and nowhere near as sweet as I was hoping.  TL;DR: game is fun at first until you realize the abundance of bugs and lack of polish and care. Combine that with game breaking bugs that will waste hours at a time this game really is not worth it in its current state. Once the bugs are dealt with multiplayer may be fun but single player will surely still be lacking.",
            "review_score": "-1"
        },
        {
            "review_text": "I started playing the HoMM series since HoMM 2, but fell in love with the series at HoMM 3.  An amazing concept:   -Build up your town and visually see its progression. -Building up your army of epic creatures and eventually upgrade them to be even more epic. -Leveling up your hero (without a lvl cap) to become an unstoppable force, with spells, hero stats that boost your army and skills that boost your hero/army. -A wide selection of races to play with ( the lesser known conflux and fortress for exmple), each with unique creatures (thunderbirds, the mighty gorgons, dragon flies, pit lords never forget!) and buildings. -I can keep going but most people get the idea by now ;)  But with every sequal coming after HoMM 3 they kept ruining the experience in some way or another..  -Heroes 4 was horrible. The creatures, the buildings, the spells, the heroes, the whole map, basically everything looked bland, pale and washed out (the music was ok).   -Heroes 5 (or in my view the true Heroes 4) was enjoyable. the style was a bit cartoony but overall it was a decent game and thank god the didnt follow up on homm4's system of spells, creatures and buildings.  -Heroes 6.. well all i can say is that heroes 6 was from another planet. They changed so much that it felt like a complete different game (in a bad way). I didnt recognize anything and couldnt relate to the games of old (ill call it the HoMM3 feeling). It was too smooth, too sci-fi... IMO..  -Now the review of the version that matters here: HoMM7 !! (108 hours played so far)  The game has a lot of positive and a bit of negative.  -Looks: heroes on minimap and in combat look amazing, creatures, spells (great effects. Spells feel like your doing something big now), environment (Focus!! your in combat but damn that little streamlet oozing gently throught the landscape looks legit. Or the volcanic landscape where your screen actually shakes because of nearby eruptions.. SICK), basically everything! No negatives there.  -Bugs: to my knowledge and experience non-existent (anymore perhaps?! I didnt play it at release date).   -gameplay: smooth. Perhaps a little too much, because when i wanted to dig up the grail i was looking for the dig option for a good 10 minutes before i found out its an option in your spellbook... So not a 10/10 here.  -Music and sounds: Maybe a little more soundtracks would make it perfect but overall it sounds nice. 8/10 in my book.  -Towns: you actually have a town view again!! ty! and FU heroes 6.. When you add a building you can actually see it in your town view. ther is a clear section where you have your hall of heroes (tavern), marketplace, warmachines (blacksmith), caravan overview etc. etc. I like it 8/10  -Multiplayer/hotseat: Very disappointing really. Im talking about the amount of maps available. 10 in total with like only 2-3 large maps. Its just way Way WAY to few maps to choose from. Given theres a map editor but who has the time or will or more importantly the skill to make well thought out maps of his own. I dont have a lot of free time and i just want to play a map instead of create one. I want a map to be a surprise , so that i dont know where everything is located etc.  -Factions/Races whatever..: Too few. This has been an issue with all of the HoMM versions past HoMM3. But this time we dont even have the 'Inferno/Devil/Demon' faction... WTF I really hope that there will be some new races being added in future patches.  So to conclude my rantings:  Heroes of Might and Magic 7 is a good game. It again gave me a bit of that feeling i had when i first started playing the HoMM series. If Ubisoft finetunes this game with future patches and additions in terms of maps, campaigns and factions (maybe 2-3 more) this will be a great game instead of a good one.",
            "review_score": "1"
        },
        {
            "review_text": "As of patch 1.6, the game runs with only *minor issues*, but does not crash or bother. The story is interesting, although a bit incoherent in some places, the gameplay is similar to Heroes 6, the visuals are nice and vivid, although some refinements could be used to highlight important stuff in reference to the background. It takes a bit to get used to the way the skill tree is made, but it's easily understood.  The only real downsides at the moment are a minor bug in the way you can share artefacts between heroes (a know bug which should be treated soon) and the fact that the campaign videos start with 'statue like' heroes, which have no lip movement, no expression, it's like stone. I guess I can live with that, the hero and unit variation is nice.  If these issues will be treated, it'll be 100% a solid continuation. For now, it's a 75-80% for me.",
            "review_score": "1"
        },
        {
            "review_text": "As a fan who's been playing the HoMM series since the 1st installment, I gotta say 'MMH' 7 is the absolute worst one to date. I lost count of how many times I fired this up, played (tolerated) for 10-15 mins each time, and then quit to desktop. I tried once more today after they released the 1.2 patch, and I'm sorry to say it still feels like ♥♥♥♥ trying to play this mess. My honest opinion is that this particular game in the once-glorious series will NEVER be good. HoMM 6 wasnt great either, but at least became something half-decent after 6+ months. MMH7 however, will stay as a disgrace in every fan's memories.    Pros:   * Caravans are back   Cons:   * The color palette is non-existent. It's like playing a ♥♥♥♥♥♥ game called 423789421 shades of grey. Everything is washed out. I can't remember how many times I missed resources on the map.  * Animations (unit/hero) are exremely clunky. I played this crap on a high-end Alienware laptop, and even on lowest settings you can plainly see the the clunkiness. It's not your rig's power, but the optimization that sucks. * combat : OMFG!! Worst ♥♥♥♥ing part. Sounds are terrible, half the units are recycled from HoMM 6, animations are ♥♥♥♥, spells are buggy, heroes look bland, etc etc * AI: a ♥♥♥♥ing mongoloid is smarter. after patch 1.2, they stated 'it's a work in progress' lol.  * Multiplayer: even after patch 1.2, the games still desync after a few turns. what a failure.  * voice-acting: a russian ♥♥♥♥ could do a better job * Campaigns: meaningless stories that arent even connected * character models : on par with Quake 1 (well, ok, Quake 2) * Uplay * UBILOL  I sincerely hope UBILOL goes out of business. EA is a damn god compared to these incompetent ♥♥♥♥♥♥♥. Let me put it like this: If my wife worked for UBILOL, I'd burn her alive.   ------ As of patch 1.3.1, multiplayer is STILL not working. THAT'S A WHOLE MONTH AFTER THE RELEASE. UBISHIT",
            "review_score": "-1"
        },
        {
            "review_text": "Very sad!!! This game could be great, but for the multitude of bugs... crashes randomly, someimes your heroes can just move around without using movement points, the farter you are in a scenario, the longe the load times and animations start to stutter, and the list goes on...",
            "review_score": "-1"
        },
        {
            "review_text": "After waited half a year for the developer to fix up some bugs and improve AI, I am surprised to see a few of old ones persist; even from just 10 mins of starting a game... gameplay wises... it is all the same, only level cap is rised...   They are now doing things we suggested in shadow council, while they disapproved of our suggestion back then, with acticles like 'we do our game our way' and 'you will get what you are given to'... who are these VIP tester giving them the brillant sugestions and high hopes that they did a great job... Made a huge fancinating game into a endless bug generator... now they put effort into it....finally a ingame random map generator... but will it work properly? I have no doubt, it wont  ... sad... oh well... back to study  Edited: New features (AI always wait, even ranaged units) you can easily knock down half of them before they attack,  AI still miss alot of resources,  opposing AI just move pass each other and aiming for the castle; AI sending useless armies to attack you during week one (easily killed),  No specific built for contruction (ie secure the ore/wood mine first and aim to building a elite production on wk 1 and champion on wk 2) Ai dont use buildings to increase movement/ adventure spells to reduce enermies/ enhance production No specific 'tactics' differentiate between class; also with 'supporting/ development' with 'offending' and 'defendsive' Heroes,   Better put, AI dont know how to aim high and deliver the most plain, they don't have a global vision nor inter-team cooperation  I really dont understand how anyone with a decent brain can be beaten by AI even on Heroic level  Apart from weak AI, restristed and limited rpg~ Hero development, little events (boring weekly events or scripted buildings ie treasure dwellings [rewards/ challenges do not grow parallel to gametime]), overcomplicated and non-user friendly editor, you cannot easily incorporate something you need/ like (ie a well designed articfact/ creature/ faction/ spell/ hero/ portrait/ landscape object) into the main game.... whats left is hell alot of unfulfilled potentials and possiblities",
            "review_score": "-1"
        },
        {
            "review_text": "I have been faithful to M&amp;M and HoM&amp;M Legacy since their initial release. Then came HoM&amp;M VI, and I felt both sad and betrayed. But I was sooo hopeful about HoM&amp;M VII. In short, the game is OK, the story arc is good, but the skill system just plain sucks. If you are new to HoM&amp;M, I suggest that you go to GoG and buy HoM&amp;M III, IV and V. Don't waste your money on VI and VII. If you are a hardcore fan like myself, then you likely already purchased the game and are equally as disappointed as I am. Sigh, I guess I will just wait patiently for UBIsoft to stop ruining the HoM&amp;M franchise.",
            "review_score": "-1"
        },
        {
            "review_text": "Other than the resource management and city development, I've got to rate tyhis game as borderline-awful.  I'm running a pretty high end laptop, plenty of RAM and HDD space, optimised for performance and it is ...slow. No instantantaneous move option and even at the max 400% my troops move slowly.  The AI? Well I remember a game called Galactic Civilisations where their idea of 'AI' was to give the computer around 2 times as many ships as you had and even though their tech level was the 'same' you'd be killing them at a rate of 5 of yours to one of theirs, so to beat one enemy fleet meant throwing around six of yours at it one after another. This one is the same.  Easy difficulty, built the army up quite nicely and went over the bridge with around 200 tier 1, 170 tier 2, 120 tier 3, 80 tier 4, 40 tier 5 and 22 tier 6, hero was as high as I could get at the time, level 11.  Ran into the computer...roughly three times as many troops at each tier and the hero was level 25.  Was not exactly a fair fight.  Tried 4 different scenarios and never got more than 2 hours play out of each one before being thrashed and subsequently I've a game that, even on easy difficulty, I've no hope of beating  Graphics - pretty Speed - slow Gameplay - poor Content - average  Back to Fallout Shelter on my phone I guess. Glad I waited till it was 50% off before I bought it.",
            "review_score": "-1"
        },
        {
            "review_text": "- Tons of annoying bugs and glitches  - I do enjoy flat cities, the building tree and overall UI  - I do not enjoy new hero skill 'circle' it is completely forced to look different than anything else, why? Old games were wonderful.  - Graphics/map is just V + VI, I find it annoying and I wonder if any 3D game will ever reflect the wonder HOM&amp;M3 was.  - The same, wonky, annoying battlefield with squares that offers no strategy  - Absolutely torn off the wonderful feeling first 3 games had, this is something completely different and no longer feels like HOM&amp;M, it even has different lore. Maybe that's why they even changed the title.  - Why do you have to forcefully shove dark (violet D&amp;D) elves down my throat, am I playing any other fantasy game?  - Campaign is incredibly confusing and weird, there's no joy in the classic game type of building up and exploring anymore, everything HAS TO BE ROLEPLAY AND NEW SCRIPTS AND ADVENTURE OH BOY! Where is my turn based strategy game?  - Where the hell is infernal city? Another DLC I have to buy in order to enjoy Heroes 3 had to offer in basic game?  Dissappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "This will be my first review, but I have to warn the fans of HoM series. Do not buy this game, if you can help it. As a big fan of the series from HM 3 to HM 6 I was excited that the new HM game is coming. But I feel now that this is a big let down. Well lets just summarize it.  Pros - nice 3D models and particle effects - dungeon and sylvan factions are back in the game (not DLC this time)  Cons - a lot of bugs/crashes, it crashes for me during the start - mission objectives are randomly not working (preventing player from finishing the campaign mission) - very cheap cinematic - cheap sounds - no feel of progression, you have all missions except one unlocked from the beginning - no progression in the missions - you can build every building and unit from the beginning - a lot of models are re-used from HM 6 - Uplay is forced upon player again - AI is dumb during combats  There is nothing that previous titles in the series have not done better already. Also shortage of new, fresh good ideas and overall feeling of laziness stems from the game on every corner. Do your wallet a favour and stay away. If you still want to buy it wait for discount, this game is surely not worth 40 euro.",
            "review_score": "-1"
        },
        {
            "review_text": "Is this a good game? Yes, once you can get it to run. There's lots of fun to be had here as others have noted. I did hit a snag after installing though...  'Uplaypc not found' issue fixed in Windows 10  1. After installing the game go to the Uplay folder in File Explorer: 'C:\\Program Files (x86)\\Ubisoft\\Ubisoft Game Launcher\\Uplay.exe' and run it. It will update the launcher.  2. Start the game in your Steam library and you should be able to create/login to your Uplay account and load everything up.  I hope this helps someone.",
            "review_score": "1"
        },
        {
            "review_text": "As a long time fan of HoMM, I have watched the game go through many changes. As the technology improves, the games also improve in many aspects but it still takes a good story teller and someone familiar with the 'lore' or history of the game. The strategy RPG category of games has a huge competitive field and keeping fans becomes a challenge. When HoMM VI first came out it too was full of 'bugs' but eventually they were fixed ( some never got fixed but that is another story). I am hopeful that the bugs in this latest install ment of HoMM will be fixed eventually also. For a first time player of HoMM, they may find the game a bit of a bore. This version is sadly lacking in the beautiful art work that I found in version VI. The art work here in VII looks like preliminary sketches.   Badly disappointed in this version but still hoping it will get better. Wait until next year to buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "I have never played a more broken game in my life. It is so buggy that I can't even complete the 2nd campaign mission because for some reason completing more than one quest on the same day breaks the game. I want my money back. Steam I hope you take note of this and stop companies from robbing the people that use your service.",
            "review_score": "-1"
        },
        {
            "review_text": "So full of bugs I cant consider playing it any longer.",
            "review_score": "-1"
        },
        {
            "review_text": "dont BUY that ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I felt like I was paying to test a game on its way to being released into production. I asked for my money back. 50ish hours where the majority of it was waiting for the computer to do its turns. Now I can't go a few mins without the game freezing. And I couldn't even get a refund. Horrible. Stay away from this game. Look for a cheap/used copy Heroes MM 3 if you don't already own it and play that instead.",
            "review_score": "-1"
        },
        {
            "review_text": "I played Heroes 3, 4 (...), 5,6,7 and honestly I am not sure why I keep buying the game of this franchise. I think I just hope to have as fun as I did with some of the previous title. But the game is filled with so many bug.... Ubisoft you should just stop making HOMM if you can't invest enough money to create a game that has the minimum of bugs....  If there were not so many bugs I believe I could go over any other sort of issue I have with this game like the lack of map, the poor design for evolved creature and obviously your expansion at 40$.  I hope I will see this evaluation in the future as a reminder to not buy Heroes 8...    ",
            "review_score": "-1"
        },
        {
            "review_text": "This game has crashed every time I have played a multiplayer match. With luck you can actually join a multiplayer game because you are required to open a port on your computer before even hosting a game but after you enter the chances of desyncing for no reason or just straight crashing are too much. Also upon trying to reload the multiplayer game which we were 3 hours into, we discovered that you have to both have the save file you are trying to load, without multiplayer autosaves this is an impossible task to accomplish. Finally I just want to say I have been a fan since HOMM3 and this game, while improving on HOMM6 is still very far from anything that could be called the 'best in the series'.",
            "review_score": "-1"
        },
        {
            "review_text": "A childish game. This game isn't for you If you value the complexity of games like Endless Legends. One positive is the combat system, I guess. I wish endless legends implemented a system where you could put a character into defense for a turn.",
            "review_score": "-1"
        },
        {
            "review_text": "What's the need of Beta testers, Ubisoft?  Well it's ether.  a) You haven't listened to the consumers who've had the chance to throw you feedback concerning the game.  b) Or it's like the Beta version was working flawlessly, yet you apparently forgot to double check the full version, because it's loaded with crashes.   There's no doubt about it, the game has been improved since previous installment in all aspects, but the amount of crashes and bugs just doesn't add up to the prices you charge for something unchecked, is ridiculous. Do you even care for the consumers? Or is it's just that huge amount of $ in your eyes.  Fix this, or I wish someone else, who actually cares for us gamers, take up the stick for this franchise and actually do a proper Heroes game once again.",
            "review_score": "-1"
        },
        {
            "review_text": "Its so hard to grade this game...on one hand I love it because its an upgraded version of the games I loved as a kid. On the other hand I hate it because I feel like they rushed it out and its full of bugs. Would I recommend the game right now? How can I in good conscience recommend a game that I can't even play because it crashes when I try and load a saved game...i can't, even though I want to.",
            "review_score": "-1"
        },
        {
            "review_text": "Officialy the ♥♥♥♥♥iest game I have ever played. ♥♥♥♥ you ubisoft.",
            "review_score": "-1"
        },
        {
            "review_text": "I really, REALLY hope that Ubisoft changes the team before the next version. This one, well, this one is a nightmare.",
            "review_score": "-1"
        },
        {
            "review_text": "OPEN GAME. PEOPLE WHO DO NOT MOVE BUT CAN TALK. CLOSE GAME. REFUNDED",
            "review_score": "-1"
        },
        {
            "review_text": "(This review only covers the single player campaign. I haven't played any skirmish maps or even multiplayer maps.)  Generally you will like this game if you like its predecessors. The main concepts stay the same with very little changes. As I like these concepts and as I think everybody who's interested in this game knows them as well, I just point out what I didn't like about the game:    All in all it was a little too easy. While I have played most of the HoMM games and other TBS (e. g. Age of Wonders), I wouldn't claim myself to be an expert. I played on normal difficulty and just followed the general strategy of focussing on leveling up a single hero on each map fighting with him only, until the level cap is reached. Then I would level up the next hero. And before finishing a map, I always tried to visit every building that increases stats with each hero. During all of the campaign, I had 2-3 tough battles. The rest was quite easy.    Somehow the battles got repetitive quickly. I don't know if there are more neutral enemy armies in this game than in its predecessors or if the tactial possibilities are more limited but I often had a couple of battles in a row that played completely the same. That most likely is connected to the game being too easy.    That may as well be connected to the spell 'Summon Elementals' being too powerful. If you have this spell with a decent mage, you'll blast all enemy armies especially in the beginning of a map when they're still small.     The wizards campaign starts with a beautiful map with two memorable heroes. Unfortunatley the next two maps are played with different heroes that are only loosely conncted. While the stories where nice as well (Arabian Nights atmosphere) I would have liked it much better if you more or less played with the same heroes through the campaign.    When one of your buildings gets attacked with no hero defending it, you can't do a quick battle or surrender in the tactical combat map. You're forced to (auto)play the battle. That's unnerving when you'll loose the battle anyway.    I played through the campaign with version 1.6. While there were some minor bugs, there was only one really unnerving one: artefact exchang on heroes is totally bugged, making it impossible to distribute artefacts as you wish. You may even loose items permanently. That a bug like this slipped QA is pathetic. I more than once considered stopping and uninstalling the game because of this.   On my personal fun scale, I gave it a 7,5/10, so for me it wasn't as good as Age of Wonders III (8/10).",
            "review_score": "1"
        },
        {
            "review_text": "one of worst game ever played",
            "review_score": "-1"
        },
        {
            "review_text": "First of all, i have to say i installed this game for the first time after patch 1,6 was out. cant tell how it was before BUT:  Guys, if i read the reviews i would normally think this game must be T.R.A.S.H but let me tell you:  THIS IS BEST PART WITH PART 3 TOGETHER!! THIS GAME DID NOT CRASH ONCE AFTER 50+ HOURS OF PLAYING!!  (yes it does have a small bug here and there but nothing gamebreaking at all) Everything summed up-this game is MUST HAVE FOR ALL FANS!!",
            "review_score": "1"
        },
        {
            "review_text": "Having played since HOMM1, I have high expectations. They are not met.  Don't misunderstand me, the game isn't that bad, but it's not that good either. First of all, this is not Heroes of Might &amp; Magic. It is Heroes of MIGHT &amp; magic. Magic is not very useful, except at the game beginning where it decides the battle. Once you reach mid-game, your best spells are these that alter inititiave or movement, the spell that conjures elemental and a few troop enhancing spells. Anything else is mostly useless. And unlike other editions (I did not play 6 however), I have never been mana starved.   Combat is too deadly, and hardly lasts more than 3 rounds. Usually, it is over at the end of the first or somewhere during the second round. This explains in part why magic is no that important: you cast one, at most two spells in one combat!  The game is unstable and may crash. I have identified an artifact that causes the game to crash as soon as I enter combat. Too bad, it was a good one! Since you have autosave at the end of every turn, you can live with such bugs.   Much can also be said about heroes skills. Some are very poor, such as the exploration tree (1 skill point for 1 movement point is a poor trade off!), and some are just too good to pass over (the parangon tree if you get it.) Since you have only 30 levels, you will very often end up with the same skills. Too bad.  I've yet to finish the campaign. It was not too bad, until I got stuck in the land of dreams (mage campaign); I'm possibly too dumb, but moving around doesn't open the next passage at some point. So that finishes this campaign. But it looks like a bug. (Edit: I restarted from before entering the land of dreams and it did work.)  Also, I'm still missing Heroes 3 graphics. They were clear and looked like fairy land. These graphics are 3D (yeah, that's trendy!), but the game doesn't need that and it tends to obscure places in the land; you don't know if you can pass through or if there is a treasure etc... until you try. And in many cases, you have a hard time distinguishing a pile of material or an important land marker from the surroundings.  Overall the game is not unpleasant. It's just not great, with many little things that should have been seen and corrected.  Edit: One more reason to be warry; today, I discovered that my most recent saves are bugged, and loading the last uncorrupted one makes me lose 2h of game. Or so I thought. This happened again after this, so I'll have to end the campaign crippled or run around the map losing time to recover my spells. Amusingly, my skills are scrambled too: some are lost... nothing to do about that! This latest discovery doesn't plead in favor of the game!  Edit2: This last bug is getting more and more ennoying and it cripples about one game out of three. I'd recommend not to buy the game as long as it is not solved: regularly having to reload old saves, having to make check points (which you load to know if the save is correct) is just plain unacceptable and removes much of the game fun. Many other less apparent bugs spoil the game; for example, I noticed that mage's towers don't shoot when sieged; necromancers get so many skelettons from the middle of the game that it looks like a bug; I could name others... Clearly, even though the game will let you get some good time if you like the genre, the editor definitely doesn't respect the customer. And aout the editor, I did not mention that you will have Uplay running in the background, and unlike Steam, it is a pile of s..t; it may send you pop ups every thirty seconds should you lose your internet connection, and it may even crash your game...",
            "review_score": "-1"
        },
        {
            "review_text": "Very disappointing...  Game is very buggy e.g. Alt-tab crashes the game; switching video to windowed mode crashes the game; changing resolution crashes the game etc.  Performance is abysmally slow, game takes ages to start, AI turns take ages to execute even on small maps. You need to esc through 6 or 7 screens when starting the game just to get to the main menu.  Cut-scene graphics are antiquated and static - is the best Ubisoft can do really having a static image of a character with his/her mouth open whilst the pathetic voice actor talks???   Game sound track is repetitive, irritating and laughable sh*t! Voice actors and dialog are similarly irritating. I have no idea whether the story line is any good as I can’t click past the voice dialogs &amp; cut scenes quick enough.  This game is utter rubbish and a huge let down after the other games in this franchise - I wouldn’t recommend playing it even if it was free. ",
            "review_score": "-1"
        },
        {
            "review_text": "Well, the skills finally carry over from one chapter to the next so the single player portion of the game is finally playable for me and the new patch seems to have polished up some really bad cosmetic bugs (neutral dwellings would say they were owned by 'mName' or something like that).  Bugs aside, I think the game certainly falls short of what it could have been in regards to adding anything new to the franchise. I've been playing Heroes since the very first one and have played every version except for 6 and this game definitely has the feel of Heroes 5. But it also doesn't have much else except superior visuals.  I'm going to recommend the game as of today because it is finally playable for me. I would not have recommended the game before this latest patch, however, so the game deserves the terrible reviews it has received.",
            "review_score": "1"
        },
        {
            "review_text": "To be honest there are a lot of things, I didn't like about Heroes VII at first glance, but after playing for some hours the game got me hooked. A lot of the elements, menu and gameplay, feel a bit archaic. When starting the campaign I was really sceptical because of the menu and the presentation of the story, but after meeting my first hero, improving my first city and fighting my first enemies, it felt like playing good old Heroes II again. The story in the campaign is well told and makes it very addictive. On the downside without the story the game mechanics doesn't feel that up-to-date, I remember Heroes III very fondly and like that Heroes VII feels a lot alike, but it inherited as well a lot of it's flaws: the fight feel a bit too simplistic and while exploring the map and fighting your way through hordes of monsters is fun to some extend, it's a bit too repetitive for my taste etc. And the multiplayer experience seems to not have evolved since I played in hotseat mode in Heroes III. However, if it comes to the question whether I enjoyed playing Heroes, the answer is a clear 'yes'. :) PS: I have read a lot about bugs. Luckily my experience is a completely different one. There has been some patches and I never encountered a single bug.",
            "review_score": "1"
        },
        {
            "review_text": "I have spent a lot of time with this game and I'm going to spend even more but please don't mistake my madness for a true and objective enthusiasm. I'm a self defined so called Heroes series psycho-fan so I will 'enjoy' this game even through tears of suffering. Or maybe I have just masochistic nature... Even after all those patches this game still have its problems. It has ridiculous hardware requirements for like absolutely no reason - graphic is just simply said... ugly. I've enjoyed Heroes 5 graphics much more. Also artifacts are disappearing. AI is just dumb. I'm writing this review to list one more thing that not many reviewers address. This game is extremely EASY! I chose 'heroic' difficulty hoping for some challenging fun. Unfortunately I didn't get what I was hoping for. I finished two campaigns already literally sweeping the map of any neutral monsters. Not a single time I had this nice feeling of accomplishing something difficult nor had I this pleasant anxiety that something may not go as I planned and that I might be surprised. I feel more like a clown now than a heroic hero... I know that games are getting dumber and dumber because they are part of the pop culture now and not like many years ago - an entertainment for intellectuals. But come on Ubisoft! You just reached the next level in the process of the word's dumbification. And yes - you are partially responsible for creating the Idiocracy! And yes - you are partially responsible for the future collapse of the human civilization due to the Idiocracy! I have a strong feeling that I could complete your game even having half of the brain. Maybe then I would feel challenged by you creation... There is one thing that I can be really thankful to the Ubisoft - maybe thanks to this game I will finally cure myself of this heroes addiction.",
            "review_score": "-1"
        },
        {
            "review_text": "I waited long to get the game because of the negative reviews but finally decided to get it anyways because I was tired of replaying HoMM3. 1- Yes I got a few crashes here and there but nothing reloading an autosave couldn't fix. 2- Yes there are issues with getting HUGE random maps to work in game, they work fine if you choose a smaller map and the only huge map I did get working was too big and too long anyways (48 hours in and we hadn't met any CPUs or each other yet) 3- People complain about not having Inferno in the game, make it sound like there's no villain anymore but that's because Inferno were banished according to the story -&gt; There's still random inferno Units here and there. 4- Also made it sound like there were only 3 factions left without inferno but there are 6. 5- Factions are really well balanced and have interesting differences that make them play differently rather than undead being the only one that plays differently. 6- I personally didn't like 5, I found that the map view was clogged with too much obstructions and you have to constantly move the camera to see where you're going; this made games a lot longer than they should be -&gt; HoMM7 manages to make really nice maps while keeping the view unobstructed. 7- The random map generator kinda sucks but that's part of being random; you won't see really nice maps if all you play are random ones. 8- Another big complaint is the AI, I'll concede, no the AI isn't all that bright but the game is focused more on the classic gameplay of HoMM1, 2 and 3 where the greatest threat for a good part of the game is simply surviving and successfully defeating random mobs to level-up and grow your army... The AI had always been made kinda meh because it allows for assigning the CPU much more powerful heroes and armies right off the bat so they become a mountain you must climb instead of a constant race like any other Strategy game.   TL;DR Overall I'm actually happy with this game, which is something I haven't said in many years when it comes to UBIsoft... Yes the game needs work, yes there's still a lot of improvements to be done but I feel that in as far as the direction they are taking for game design, it's a step in the right direction.",
            "review_score": "1"
        },
        {
            "review_text": "I can see why a lot of folks hate this version, and I do have some qalms with those problems as well, the game moves a little laggy, and some of the art are a bit lazy (stillframe cut scene, meh town icon etc.)   But I actually like the overall game quite a bit, it merges a lot of positives from 5 and 6, the story is probably the best one written of the entire series. the diversity and improvement on the combat system (flanking? FINALLY.)   I am really annoyed that ubisoft almost always release their games so buggy and incomplete though . I know modern games are more complex and all but seriously, games use to be released as complete products you know.",
            "review_score": "1"
        },
        {
            "review_text": "Whoever is responsible for this ♥♥♥♥ing piece of ♥♥♥♥. I wish that in this life still, im granted the pleasure to punch them right in the middle of their moronic faces!",
            "review_score": "-1"
        },
        {
            "review_text": "I am utterly appaled! I cant even join any online games, i keep getting unable to connect to server! gg give me my money back please. The only reason i bought this game was to face people online. If I cant do that wtf is the point? Cant you learn from endless legend and have some sort of dedicated server?! like seriously poor!",
            "review_score": "-1"
        },
        {
            "review_text": "Buggy mess, keeps crashing all the ♥♥♥♥ing time",
            "review_score": "-1"
        },
        {
            "review_text": "I have played many hours in Heroes II, V, &amp; VI and enjoyed them all. Then when I started up Heroes VII I was already worried. The opening scene with lifeless, emotionless character models was the first sign of what a failure of a game this turned out to be. The campaign was made up of 6 random dissconnected stories, that I did not not about whatsoever. The combat and gameplay was dull and not up to heroes standards. And the life and soul of the game was dead, therefore I couldn't enjoy this game at all. If you have had a bad experience with this game I insist you try one of the other Heroes games if you haven't already.",
            "review_score": "-1"
        },
        {
            "review_text": "2/10. EXTREMELY buggy. Horrible multiplayer experience. When i tried adressing the ubisoft support they answered only after a week and their solutions didn't help at all. A game with so many bugs shouldn't have been released, It's unplayable &amp; frustrating.  DO NOT buy this game!",
            "review_score": "-1"
        },
        {
            "review_text": "I've loved every Heroes of Might and Magic game. except this one. The intro is great, but the game itself is awful. On the one hand the graphics are so hard on my laptop that it takes forever to even load up the main menu. To so much as get one hero to move once takes half a dozen attempts due to some pathfinding problem.  On the other the graphics don't even look good. They look like an attempt at a painting by someone who has only ever done technical drawing. When you clicked on a town or city in any other HOMM game you got an impressive, atmospheric feel like you were actually inside a fantastical settlement. The music, the individual buildings, in each different type of settlement added to the atmosphere, which was very different for each faction. Heroes VII could be any other computer game out there. Just a set of flow charts and boxes with some half-hearted graphics added. The campaign map and the battle map heroes and terrain may be 3-D, but they look hollow and empty - and downright weird.  It's like whoever made the game had a Heroes of Might and Magic game described to them but had never actually seen one - kind of like a medieval European drawing of an elephant by someone who'd never seen one but only heard one described. I get the feeling the designers were given a contract to make a Might and Magic game and then were whispering to one another 'but what is a Heroes of Might and Magic?'.  I thought maybe it was just the campaign that was the problem, so i went back to it and started it up again and tried a scenario. No, it's the entire game. I'd love to be able to love this game. I don't mind changes when they're improvements - despite some people panning Heroes VI i loved it. Yes, having to sign up to uplay to install and play it was a bit annoying at first, but it was still a great game that kept the best of the series and added improvements. And you can actually set Heroes VI and uplay to run in offline mode. But Heroes VII? I can barely even look at the thing.  Heroes VII does (eventually, and very slowly) run on my laptop- the patches seem to have sorted a lot of the initial problems - but it's just unbearable to even look at it,",
            "review_score": "-1"
        },
        {
            "review_text": "A lack of inspiration, Art direction at his lowest, bugs, gameplay very simplified, animations are not an option (in cutscene and in battle). Oh, and the city screens are the ugliest I've ever seen, looks like an intern's concept art base. Very disapointing, this game's too expensive for what it is. Ubisoft definetly ruin the saga. Miss you, Heroes III. May you rest in peace.",
            "review_score": "-1"
        },
        {
            "review_text": "Wait until the game is able to boot up correctly... Still won't start on my end...  Edit:  Finally got the game to work... after putting uplay offline, setting the .exe into win8 compatibility mode and running the .exe as admin... yay...  So far... the game doesnt look that great compared to its elder HoM&amp;M3... Textures are bad (and they should feel bad), I feel as if im playing at the 6th heroes at some moments... The cities look 'ok', but they should have used that artstyle for all the game, and forget about all the 3d crap, as it tends to mess a lot with the space appreciation, in a game where movement is key.   Gameplaywise... It's unfortunatly closer to HoM&amp;M6, TTHE GAMEBREAKING TOWNPORTAL IS STILL HERE, FLEE, YOU FOOL! Seriously. No. No. No. We all know how that thing ends up The new flanking mechanic is 'insteresting', but end up resulting in akward running around as there is no 'tacle' stat... And its no big news the game is still using squares instead of hexagones for their combat phases.  At least they brought back the 7 ressources aspect in the game... I've got to give props for the new building system (though the building menu is really awkward to look at and would probably appreciate some tweaking and polishing): some buildings require you to chose between one choice or another (ex: for the 7th tier creatures).  That aside, the number of available maps is incredibly low, and I have found no random map generator...so...   As much as I would love to give a HoM&amp;M game a good review, they all pale in comparaison with the third, which is a true masterpiece (go gog and grab it, not the HD bs :) ).  Oh... and good luck with the overall UI... it's terrible ^^'  Expect DLCs though charged full price.  This game has nothing worthy of a 2015 game...",
            "review_score": "-1"
        },
        {
            "review_text": "After looking through so many reviews and noticing that there is a lot of happy and unhappy people I really debated on whether I really wanted to buy this game. I have played roughly about 20+ hours thus far. I have noticed that there are still a few bugs, but they all have been rather negligible. Now onto the actual gameplay, if you have ever played any of the earlier versions of Heroes then you'll have to readjust from the past few releases of Heroes. This one is an attempt to return to the idea that you have to out wit or focus on the objective of the scenario. Otherwise it will be rather hard to get started on trying to get a large army up and steam roll your computer opponent. I say this because most of the CPU heroes are OP to start of each scenario. Meaning that they can easily wipe your entire army out in a matter of a few short turns. Now there is a draw back on the how the CPU player was set up and that is the computer does not really do much once you defeat the first few OP oppenents because it builds in its town, but alas it does not ever seem to do much with actually buying a building an army afterwards.  Overall the game is a huge resource hog just as Heroes VI was so I would be wary if you don't have a decent computer to handle the game. Also it is challenging at first and can come with a bit of trial and error (aka aggrivation for some), but once you figure out what to do you can easily overpower the computer and walk around as the army of annihilation over an ignorant CPU player. This is not a game meant for everyone so be warned.",
            "review_score": "1"
        },
        {
            "review_text": "Not worth a full retail price at the moment. Crashes constantly, feels like a downgrade from VI. Still picture cutscenes with voice overs. Hardly any animations in the game at all. Feels like an indie game on a budget... Ubisoft should just sell the game series off to another company that can make better quality than this crap. Feels too damn rushed, a quick cashgrab.  Avoid it for now until the game goes on sale and patches are made.  Very dissapointed... The quality of the game is really bad, even IV had better quality, more animations and was more immersive than this...  Most of the sounds feels like they are missing, compared to the older games were you had sound for all those things in the world you could pickup.   Ubisoft have butchered this game series, unless they sell the franschise to another company, this series is most likely doomed.",
            "review_score": "-1"
        },
        {
            "review_text": "So far I really like the direction this game design is going. I feel they really made some good choices with a 3 style combat/hero system combined with caravans. The only reason this game is not doing well seems to be failures on the technical side which is a shame... The tech side is suppose to be the easy part. I really think they over did the graphics for a turn based game. Just make them crisp and fast. Would like a new caravan graphic that actually looks like a caravan and not just a hero's horse. The ledges don't have to be so steep with such crazy camera angles. Also story line seems to be lacking originality, everytime I read a different factions storyline I'm reminded of some mainstream movie or book series from the last 20 years. Still think the creatures and towns in 3 are cooler; really not a fan of the sylvan theme. They should think about marketing this series towards tablets. I can't think of any reason why this wouldn't make a great tablet game if done correctly. Plus the graphics level and player expectations would be more on point for the series.  + Hero's act seperate from creature stacks as in H3. + Siege and other support devices like in H3 but more unique; better than H3. + Castles have towers and more; better than H3. + Creatures need hero to travel but hero no longer needs at least 1 creature; better than H3. + Graphics are the best of any Heros. + Long campain with depth. + Retained Hotseat. + Caravans and Forts included.  - Graphics, battle scense, and inventory are glitchy. - Caravans look like a horse; could be more unique. - Campain characters faces don't move when talking (little creepy). - Story is not original. - Faction names and creature choices are a little lame. Factions not as cool as Hero's 3 or even 2 for that matter.   I'm still feeling out the talents and magic tree. Verdicts still out.",
            "review_score": "1"
        },
        {
            "review_text": "Verdict: Is Heroes VII perfect? No - Is it an enjoyable &amp; 'fun-to-play' game? yes, very much!  Foreword: I started with Heroes II and loved III. Later on, I was appalled by the graphics of Heroes V and thought I have grown out of the franchise. Heroes VI had too many bad reviews, but VII looked interesting enough to try.  During the first weeks I encountered bugs, game stoppers and had even savegames that were unusable. That was truly not what I had expected and I paused to play, waiting for patches. And they came! At the moment the version is 1.5 and has improved a lot. Of course, there are still points like combat sounds or the council scene that are not appealing, but for me those are not the essential factors for a fun Heroes experience.  I skip a more detailed review about pros and cons of the actual gameplay or the graphics (which are not AAA but good enough) simply summarize my opinion about Heroes VII:  During the campaign I had this good old 'one more turn' feeling that I have had in Heroes III and easily forgot that already 2 hours had passed since I started, what more can I say? That makes it a good game for me, even though it has flaws.",
            "review_score": "1"
        },
        {
            "review_text": "Not too bad in a nutshell... but there are some BUGs which could be annoying. Quick combat could save plenty of time, however, it just ruined the spirit of this game franchise. I like those artworks, though.",
            "review_score": "-1"
        },
        {
            "review_text": "What a great game!! I've been a big fan of the franchise since the first one was released. I would rate this one up there with Heroes 3 &amp; 5. I would love to see a couple of expansions with the addition of some new factions. This game is way better than the reviews show.The new patches seemed to work. I'm using an AMD a10 5700 processor at 3.4ghz and an r9 280 video card and I have 14 hours in this game and with all the settings maxed I haven't had any issues with it.",
            "review_score": "1"
        },
        {
            "review_text": "I actually enjoy this game, is a smooth and clear engine the cutscenes are not animated but the lore and story is good( for people that enjoy it ) It's true this game is a copy of the best two Heroes of might and magic, the 3rd and the 5th but im enjoying this game , yes i've had problems with some bugs here and there, but i cant say im not having fun. Also I miss the Inferno faction and the Griffins in the Haven army",
            "review_score": "1"
        },
        {
            "review_text": "I got this game in August of 2016 so I may have missed what I believe was a maelstrom of bugs at the initial launch; but I've had no problems with the game. The game itself is Heroes of Might and Magic; and if you like previous games in the series you should have find yourself happily at home here. My favourite additions here over HOMM6 are the way heroes level up, prepresented by a 'Skill wheel', which allows heroes to only specialist in certain areas, and again only some of these to 'Master' level. This creates unique feeling heroes; with only some being able to truly master fire magic for example, or ballistics. The wife and I have already had an enjoyable 60 hours+ on the hotseat mode, though sadly I can't say anythging for the campaign mode; as I don't play it!",
            "review_score": "1"
        },
        {
            "review_text": "Long term Fan of Might &amp; Magic Heroes. Heard of the issues reported on this forum but everything seems to be fixed now as I have not had any troubles. Happy with the purchase :)",
            "review_score": "1"
        },
        {
            "review_text": "I've heard this game is getting a lot of flak on steam but i disagree with those reviews. I've encountered no bugs or crashes since I've started playing and the game is on sale right now so that right there is great. Some people care about the cutscenes and the lack of animation when it comes to the people at the table talking or the fact that you cant play the demon race but i couldnt care less about that. Most important thing to me is gameplay is it fun or is it not? is the game worth the money?  Absolutely the game is fun, I've only played one story campaign thus far but I've enjoyed it I especially like the fact then when i go to build my last unit building for the Elite i get to choose between two types each with their own benefits  Right now the game is worth the money since its on sale, i myself wouldnt pay full price for the game but since its on sale i easily decided to buy the game and I've enjoyed every moment I've spent playing it",
            "review_score": "1"
        },
        {
            "review_text": "This game is a pathetic, bad product. No balance. No interesting gameplay.  1. 90% of units just use atoattacks (not INTERESTING skills or some strategic stuff)  2. Pure, bad art design. As example, Dungeon creatures are not like Manticore, Harpy, other different monsters like in HoMM3. No. Just a boring elfs with diff weapons, same for forest elfs - no Unicorn, no real dragon, Pegasi, Satyr, no other creatures - just diff boring elfs with generic weapons.  3. Fire walls? Battle dive from air? SINERGY? Any INTERESTING stuff? MOST of units have skills like more strong punch or resist. Units are just a bags of HP who can use the same auto attacks. All the races are plays pretty same - go to battle and units start use same attacks again and again, and like one of the units can use something like a 'skill' which is like more strong attack or splash damage.   Just remember cool and hard HoMM5 duels.    No strategy. Play HoMM 5/3/2 to see a real skills and DIFFERENT gameplay for units, races, etc.",
            "review_score": "-1"
        },
        {
            "review_text": "I give this game 9 out of 10.  First off, I don't mind uPlay, it's required to launch the game and that's it, doesn't impact gameplay. Second, even if the lauch had issues, devs quickly fixed the issues and more updates to come. Third, it's the gameplay that mathers, GUI and little graphic artifacts are minor and can/will be fixed.  I have played Heroes III, IV, V, VI and VII and so far this game is up there in the best in the series. Ok so first release was not perfect, but patch 1.2 fixed a lot of bugs and I am very hopeful for the next couple of releases.   Campaign is actually pretty fun, every heroes had crappy campaigns and actully this one is one of the best. Yes cutscenes suck, but we don't really care, as long as story is good and gameplay is fun, which it is.  Gameplay is really great, it's on par and even better than Heroes V, magic wheel is good and you also have the choice to get the 4 random choices like older versions. So far played with 2 factions and have enjoyed them, can't way to try the other ones.  Town screen is great, simple and to the point, spells are great, a lot of variety there. Units variety is pretty good so far, haven't played every faction but enjoying the variety thus far.  I am actually playing with laptop (i7, integrated HD 4400 and SSD) and can play with medium graphics settings (1200 x 720). I am sure the game would perform a lot better with better GPU, but am still impressed with the result.   Things to improve: -Graphics and design should be improved, it's ok, but could be a lot better, the only place where Heroes VI is better than VII is in graphics. -Sounds and music should be improved, it's kind of generic, especially in battles. -GUI is ok, could be better.  So far great game and will be enjoying next updates and hopefully new content!",
            "review_score": "1"
        },
        {
            "review_text": "Worth $10 max. Don't buy it until a very good sale.",
            "review_score": "-1"
        },
        {
            "review_text": "As with any Ubisoft game it bombed its launch date give them time to iron out the bugs and in a few months it will be playable. From a long time player of this series Heros M&amp;M was my very first strategy game so I have a huge investment with this series hence the pre-order on a Ubisoft title. That being said a game that is slow paced and strategy base relies heavily on its story plot and cinematics. What concerns me is the lack of animation made clear at the start of the campaign before ever choosing your hero. You can hear the sound and if u look close enough tell the tongue is moving beyond that there is no facial animation in the opening cinematic or subsequent. I am hoping details like this are bugs like issues with the animations so they were frozen as to allow release on time. Remember devs have no true final say on a products release date they give an estimated date and marketing takes it and sets the release date. However if they are not bug related and they actually didnt rig or animate those sections of bones I for one would be highly disappointed in the production pipeline of their studio.   Even indie devs manage to release with the animations. Ark Survival evolved) is an un optimized game that always has bugs being worked on or not, but the Dinosaurs were there on release walking and dying properly.   Now more to the point the animations of the characters during battle sequence wasnt bad. However it leaves much to be desired when every cinematic breaks your immersion. Compounded by desyncing multiplayer games. I do not recommend this game in its current state wll update this review as patches are launched.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game, thinking that Ubisoft had learned their mistakes. I was never so wrong. The game is full of bug's! Can't complete missions and during combat phases, the game slow's down, not to mention a couple crashes during gameplay.   Yes, the game looks great, but graphics aren't everything. I feel sad and depressed for buying this piece of ♥♥♥♥.  I HOPE UBISOFT BURNS TO THE GROUND!!!  Never buying anything from Ubishit again.",
            "review_score": "-1"
        },
        {
            "review_text": "Get ready to crash yourself back into Heroes VI, because that's basically what you're getting yourself into here.",
            "review_score": "-1"
        },
        {
            "review_text": "A wild positive review appears. SO far i had 1-2 bugs. Other than that i have better time with this than h6 :P. Cool thing: 7 is easier to mod and you can find some stuff in heroes community.",
            "review_score": "1"
        },
        {
            "review_text": "I am regret to buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "dont buy this crap....",
            "review_score": "-1"
        },
        {
            "review_text": "Out of all the HOMM series thats out there, this is the only series that has ♥♥♥♥ soundtrack in it.   I mean who the hell thought it was a good idea to replace Rob King &amp; Paul Romero with Rob Chen?  It hurts my ears playing this game.   But then again, I would still play this game just to listen to few of the tracks composed by Rob King &amp; Paul Romero such as the town themes.  8 tracks were composed by Rob King &amp; Paul Romero 9 tracks were composed by Roc Chen   a 4/10 game, it is.",
            "review_score": "-1"
        },
        {
            "review_text": "The AI is clearly for children not even comparable to the previous heroes",
            "review_score": "-1"
        },
        {
            "review_text": "Wait for them to fix all the damn bug before buying the game, don't make my mistake",
            "review_score": "-1"
        },
        {
            "review_text": "I like it. Good old heroes style with new creatures in the look of Duel of Champions.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game if you are a HOMM addict, but not if you are new to the Genre. Buy it only if it is on sale.  But...read below:  1) Great in game graphics 2) Great Audio,. 3) Although the cutscenes are static, i.e. you hear the NPCs talking but their mouths are not moving...who cares? I dont play games for the cut scenes. 4) Something bugged with castles, for example I cannot enter my main castle. 5) I enjoyed HoMM V and VI much more, as for whatever reason this version does not seem as much fun. 6) I stopped playing after only an hour...just got bored with it. 7) Oh, and Uplay in addition to Steam is just a pain, not a game breaker, just senseless, not needed, and silly.....just kind of annoying  I realize many of the things I have stated are already known, but please taek note...I loved V and VI and even the online game they came out with. Despite the fact that I still feel the AI cheats in V and VI.  I only purchased this game (VII) because it was on sale and I say again: Unless it is on sale do not buy, as you are not missing anything. Wait for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game is trapped into an old design mindset...can't complain too much tho since the heroes community has chosen that (see the shadow council stuff).  Yes, there are truly several gamebreaker bugs and yes, the campaign is way too easy.  Still it's still heroes, and I like it",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely awdul. I am a HOMM fan and loved VI but this is four steps back. Terrible interface, awful graphics, the opening dialogue the characters dont even move it just shows a shot fot heir faces and their voices. I want a refund!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I love the M&amp;M series and own every game that has been made. I liked the direction that they were taking starting with M&amp;M V and thought M&amp;M VI was a step in the right direction. But this version feels like a step back to M&amp;M 1 &amp; 2 with the small icons representing structures in the environment ruining the immursion. In early games these short cuts made sense as the graphics of the time could not handle that much more. But they have had the ability to build better environments for some time as can be seen in M&amp;M V and M&amp;M VI so I simply don't get the vast departure from a formula that worked in this version.   I purchased the game when it first came out but so hated the current direction with the artwork on the maps that I asked for and was granted a Steam refund. I hope others provide this developer with similar feedback as I still love the series but will not purchase another game until they do something to improve the main map.",
            "review_score": "-1"
        },
        {
            "review_text": "Does lower then catfish crap come to mind any one? Go back to Heroes of might and magic 2 threw 5 and you will actualy enjoy it... this is just.... ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "it works well now.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, the game has bugs. Some are really serious, as in missions not being able to be finnished. And some are just annoying.  But if you are able to cope with those (patches are getting out on a regular base) you get a really enjoyable game. The cutscenes are ... not anything you really talk about in regards of state of the art, but they still tell the story that is the background for the game in a way where you just want to continue to see what the next map will bring.  Now to the actual gameplay:  - the missions offer a high variety of goals (not just capture all towns etc.), - scripted events actually surprise you, sometimes in a positive way sometimes with a groan - the combats run smoothly, the units are balanced and with the skillwheel you don't just go the old heroes VI cookie cutter builds  So if you can look past all the naysayers and give the actual game a try you will soon find yourself facing the old problems heroes always had. Just another turn till I go to sleep...  Oh and I didn't have a single crash so far (Been playing since release).",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best heroes game since HOMM3. Depth of strategy available is good and the game avoids the repetitiveness that was HOMM6. Most immersive, as with many games in the series; Just one more turn..  Yes there were some early bugs, for example initial loading took half a minute longer than it should and the occasional crash. These were hardly game breaking and in any case they have been fixed now.",
            "review_score": "1"
        },
        {
            "review_text": "I played all Heroes' since part 3 and so far, this is the best one to me (I have exclusively played the Campaign so far!).   The game is still almost as buggy as during the last Beta. Most of the bugs I encountered were of the game breaking nature and forced me to restart the respective mission. But I never had problems loading into the game and it didn't crash on me even once. Therefore, I am not overly affected by the bugs since having to restart a mission might be a big annoying but at the same time it is nothing horrible and allows you to optimize your farming pattern and readjust skillbuilds of the heroes.   Publishing a game with so many problems shouldn't be done and can be considered an insult to the customers. Yet, I am still recommending the game because the campaign is beautifully crafted, the mission design is pretty awesome and you instantly get sucked in by the typical Heroes of Might and Magic charme that makes it so hard to stop playing.   If you liked the other Heroes of Might and Magic games and if you do not care too much about missing animations during what 'could' be called cut-scenes if there were animations, you will enjoy this. If all you want to do is ride around, collect stuff, build huge armies and strong heroes, then you WILL enjoy this game. The pace during the campaign is quite high, which is why this game clearly is NOT RECOMMENDABLE for beginners. There is no tutorial whatsoever, no introduction to mechanics, if you never played a game of this genre, you might be overwhelmed and pretty helpless. As a HOMM veteran, I think that is awesome, since you are just thrown right into the big epic fights!  One downside that has to be mentioned is the quite horrible AI. The fights are far from 'hard' and even playing on heroic, you can easily defeat 'deadly' enemies if you know how to play. The AI moves around confusedly, suicide attacks sometimes (without doing too much damage) and generally just isn't a real challenge. But then again, since HOMM3: AB no Heroes was really challenging and I still liked them, simply because the story is interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, how hard is it to make Heroes 3, with unreal 3 software?  Keep it simple:  1. Nine factions, 3 good, 3 neutral, 3 Evil.  2. Six schools of magic, Light, Dark, Air, Water, Earth, Fire.  3. Upgrading your Castle, Make it Simple to see and easy to understand.   Why use Heroes 3 as the example? Beacuse Most of you customers Play the seires Because of Heroes 3.   I am picking Recommend so people will try it, and maybe one day you will figure it out. ",
            "review_score": "1"
        },
        {
            "review_text": "Ok after reading all the Negative reviews I was very worried however, I remember when HoMM VI came out. It was full of bugs and it took them MONTHS to get that game working right. I'd say at least 6 months? Now is this how games should be realeased? NO! but, it is what it is. This game does have some bugs but it has far fewer then HoMM VI had when it came out.   This game feels like HoMM VI.5 which I am ok with. I loved that game and this one feels like a prettier version with some nice updates to mechanics etc. I haven't gotten far enough to comment on the total game but so far I like what I've played so far.   My computer is about 3 or 4 years old now? It was pretty top end then but this game does try it at some times. I am rebuilding after christmas.   I am happy with my purchase I think you will be too.",
            "review_score": "1"
        },
        {
            "review_text": "Im playing Heroes for more than 15 years and i think Heroes VII is one of the best ones.",
            "review_score": "1"
        },
        {
            "review_text": "First off let me begin by saying, Ubisoft, If you really want to screw us that much can we at least ask that you use a little lube... We are starting to get sore :(  The community knows what the 7 core factions are: Humans, Elves, Dark Elves, Demons, Wizards, Undead and Orcs so can you please, PLEASE stop releasing piecemeal games. I for one am tired of it. If you want to add others, like Naga glorifying the flowing grace of Shalassa or a return of the dwarves as worshippers of Arkath or even some mysterious new faction who turn to the impetuousness of Ylath in the abscence of the humans then go right ahead. We only ask that you add them as extras, hell even as DLC, I know I'd jump on that like a bunny with hiccups.  HAVING SAID ALL THAT... Credit where it is due, in its current state Heroes VII is a vast improvement over its predecessor and pretty close to to it's far superior ancestors: Heroes III and V (I haven't played IV so apologies to all the fans. Personally my favourite of all time was II)  So all in all, its perfectly fine, and quite a nice bastion of safety for those disillusioned with Heroes VI. However, Ubisoft, if you are going to make an VIIIth installment (and lets face it, you will) could you at least heed my words and the words of a great number of the community, and do it right!",
            "review_score": "1"
        },
        {
            "review_text": "I loved HMM2, was CRAZY about HMM3, wasn't impressed for HMM4, Didn't like HMM5, absolutly hated HMM6, and today i'm playing HMM7 with a lot of fear and doubts. First of all I played the campain for 5 min and i got a really bad feeling about it.  They didn't even get the character animated during the cinematic... WTF?! So it ♥♥♥♥♥♥ me off and after about 15 min of campain i was like 'nononononononono i'm just gonna try a normal game' So i tried.. and it was not too bad! -Graphism are not the greatest but it do the job (honestly i don't care about that for a HMM) -The good old system for the castles is back with the 7 different types of ressources (which is pretty cool) -the heroes upgrade is intuitive but i don't really like the wheel  -I found the IA a bit slow, I played a 4 players map and I sometimes have to wait a bit for my turn (even if i put the IA speed at 400%) -castles upgrade is nice and with a bit of tactics (but really not much) -good nostalgic feeling building up my 1000 skeletons before roaming on the map :D -auto combat available against neutral army i like it (and it sometimes play better than me haha) So overall it's not too bad. Not the greatest HMM and i will most probably not touch the campaign before i got nothing left to do but definitly better than the crazy system from HMM6 and good enough for me to spend a lot of hours on it. I would still recommand it, and if i could give it a grade, I would say 6/10 maybe more if the campaign is good (but again i got a really bad impression of it)",
            "review_score": "1"
        },
        {
            "review_text": "As a huge fan of the series since Homm2, I actually really like this game and how it has flourished. The single player campaign and the quick matches work fine to be expected and the Uplay doesn't really need to be messed with except the first time you run it. The problem is within the multiplayer online / LAN , my buddy and I got it to work ONCE flawlessly until my client crashed hard.  with a few patches this game will be more than worth it guys, give it a little more time!  9/10",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand why people hate this game so much. Yeah, it's not Heroes 3, but why should be it? We already have H3. I like how the game explains it's mechanic. It's was very easy for my girlfriend to learn how to play. Just hover cursor over 'Defense' icon and You know that it means 2.5% less damage (clamped to 70%).   I like diversity of units and skills. Almost every unit in game have some perk.  Bonus damage when attacking from behind makes fight more tactical.  Game in actual version is not so buggy, and those bugs i saw don't affect gameplay.  Game of course is not perfect. AI should be better. I didn't play campaign so I cannot tell anything about it.",
            "review_score": "1"
        },
        {
            "review_text": "I can't compare it to previous Heroes games because it's been a long since I've played one, but I enjoyed it, aside from the evil that is Uplay.",
            "review_score": "1"
        },
        {
            "review_text": "Very slow to load up and the options continuously reset themselves so if you like everything fast pace, you have to keep setting it up between campaigns. Good game otherwise.",
            "review_score": "1"
        },
        {
            "review_text": "Got the game today and I haven't noticed any problems for the last 6 hours straight I've been playing. I really like the art style and gameplay and so far the campaign has been a blast!  I don't know if they patched the game after all the negative reviews have been given but I personaly didn't seem to spot any issues so far.  My specs:  Intel I-5 2600k AMD 7870 1GB GHZ Edition 8GB Ram Z-77 Motherboard  Not a big fan of Ubisoft after the Unity fiasco but this is one game they got right.",
            "review_score": "1"
        },
        {
            "review_text": "so far only played a few hours game run 100% fine, didint encounter a single bug yet, can t wait to play more tonight",
            "review_score": "1"
        },
        {
            "review_text": "Great gameplay, nice graphics, makes me sit up all night.",
            "review_score": "1"
        },
        {
            "review_text": "Changing my review after they fixed the start up bug. The mechanics and gameplay are great and really challenge you to think strategically, but this game really lets down with the lack of full motion campaign video and a general lack of polish. I would recommend this game if you really love the series or if its on sale. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "After many ifs and buts I eventually bought the game despite the negative feedback and I can honestly say I was pleasantly surprised. The artwork of the game is perfect in my opinion and I feel like this is the spiritual succesor of HoMM 3.   Pros +  +Unit variation +Artwork +Town management +Governors(Actually makes every hero usable, even if their not fighting) +Warfare units +Ambient music!!!! :D +New one use scroll system +Hero skill wheel +Balanced range units +Short AI turns  Cons -  -Campaign seems very unbalanced at the moment (would wait for fix) -Some combat sound effects are a bit off -A bit bright in my opinion even if bloom is not on  -Multiplayer problems from what I have heard  I can't say too much about AI strength, I'm playing on hard atm and I haven't fought the AI yet. Monsters however seem to fight better. Some ranged units don't attack in close combat so they don't die for example.  Judging from previous games and this on it is definetly a 9/10 for me :)  ",
            "review_score": "1"
        },
        {
            "review_text": "I haven't really played much (the first map of the campaign) but I'm already in love. The presentation (cutscenes and the like) is better than any other Might and Magic game (which doesn't says much honestly, the games were never know for that) but even just the atmospheric still images with the excellent voice over manage to make you really feel for the characters and their stories.  Gameplay-wise it's exactly like Heroes of Might and Magiv 5 and 3. If you liked these installements of the game, you surely will like this.  Only cons: starting Uplay because of this is kinda annoying. Also the loading screens are sometimes really long for some reason (although that could be part of my computer not beeing up-to-date).",
            "review_score": "1"
        },
        {
            "review_text": "I like this game.There are many good ideas in it.Unfortunatelly it`s buggy as hell.I don`t like this 'new' business modell of the game maker companies.They just want quick cash in,and sell crap for us.Don`t worry,they will fix it,I mean they MUST fix it,they don`t have any other choice.They won`t risk their good reputation.We can`t do anything but wait for it. Maybe you remember to Rome 2 after a terrible start it finally become a game worthy for the total war name,I hope,I wont be dissapointed with Heroes 7 after it`s really release.Just be patient...",
            "review_score": "1"
        },
        {
            "review_text": "Aside from a few crashes at load up, and some alt+tab crashes, i havent run into nearly as many 'game breaking bugs' as people are stating. There are balance issues that need to be addressed, and the cut scenes are just well awful. So far I am fairly happy with this game and my purchase. If you are on the fence about it, then i would probably wait for some patches and fixes before purchase.  side note: Stop bashing on the devs, it takes a lot to make a game and if we the consumer were not so focused on the release date being exactly that, maybe they would have had more time to fix these bugs. Its no like the last heroes didnt have bug a plenty when it was launched but for the most part they got addressed and fixed. So lay off, on wrong line of code in a string of thousands can cause a bug.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable. Could definetely be better, but I'm positive it will with future patches.",
            "review_score": "1"
        },
        {
            "review_text": "Some improvements from the previous title: - When you attack you can use auto-combat first, and IF your are not satisfied with the outcome you may do it over again manually. - Each faction has choices to make when building their town. You must choose between unit types that may be available, which to boost populations for, and which utility buildsings you prefer. - Neutral armies no longer consist of only 1 unit type.",
            "review_score": "1"
        },
        {
            "review_text": "Based on the first 2 hours of the game i would give it a 7.5/10 good game but I feel like the polish/time needed for this game to be great just wasnt there the very first cutscene for the campaign is very poorly done and looks rushed after that though the gameplay was actually quite fun.",
            "review_score": "1"
        },
        {
            "review_text": "I played HoMM since the first edition and finaly I get the same feeling again with this version as with HoMM 1, 2 and 3.  And I read here a lot about bugs and crashes, but I just got only one crash, the first time I want to start this game, directly after installation. So I restarted my PC and since that moment, no crashes at all anymore.  Maybe this is, because I only play offline and not play multiplayer games. (because it would take to much time) The graphics a pretty fine, only when you suspect the character to see talk, their mouths are not moving. That is a little bit strange nowadays. :) So, my conclusion is, that I am very happy with this game. And I guess, I will spend a lot more hours on this game.  ",
            "review_score": "1"
        },
        {
            "review_text": "So the franchise dies.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a classic Might and magic.  The game design is good. heroes, castles, skill wheel, map sizes are what you can expect if you played the other games of the serie.  The game performances are terrible. If this is not an issue for you, I'm recommanding this game.",
            "review_score": "1"
        },
        {
            "review_text": "where the hell os the map editor??",
            "review_score": "1"
        },
        {
            "review_text": "Dull game. Cut scenes are not animated - this is all 1999 crap. 1/10",
            "review_score": "-1"
        },
        {
            "review_text": "I would give this game a 10/10. This is by far the best game in the series.",
            "review_score": "1"
        },
        {
            "review_text": "so sad this is the wrost Hero of might and magic I ever play  my English not good but I will try to review this 1. Graphic look color full this is ok for me but the game reduce many classic thing in the game from the hero 3 5 6   ex. the castle screen greatly reduce from the pass it reasonable if they improve other part of the game but I did't see the improve part in the game 2. Battlefield cut scene greatly reduce from the Hero 5. in my opinion the classic game like this series and the turn base dynamic of this game it is Good enough by it self the improvement about cut scene or battle mechanic from the unit will improve the fun  about multiplayer session I really love the Duel Mode from the Hero of might and magic 5 online DEMO and hope fully they will put this mode in the game and it happen in Hero 7 just a little problem it can not play for some reason  Thank",
            "review_score": "-1"
        },
        {
            "review_text": "Game play have vastly improved with the release of the first 3 patches, still not perfect but is headed in the right direction, given time, it could live up to it's potential  As of 23 of Feb I can now recommend this game to peeps interested in single player game, it is a lot different than when it was released and playes whole lot better and is more balanced.. the only downside is the lack of a lot of skirmish maps, but the fan base may well make up for that in the workshop mods that they create for the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Dont normally write reviews, but been playing Heroes of Might &amp; Magic franchise since the 1st one. From my perspective that somehow this game has gone backwards. Here is why i rated not recommend - outdated Town Visual, either inside or outside (this was epic back then, when you visit your town with epic background music, I love it. But I think they fail hard on this one) - outdated GUI (I can't believe my eyes by looking at the GUI. doesn't matter where you are, hero screen inside town, main interface. That kind of art and brownish color..aie..even Heroes of Might &amp; Magic 3 feels better than this or Diablo 2) - Personlly I think their visual department fail big time. It will be better if they copy 'guild wars 2 or street fighter 5 that kind of artistic feel with all their GUI. Did i mention that this game's whole interface looks like it's from 1995?",
            "review_score": "-1"
        }
    ]
}