{
    "app_id": 321920,
    "name": "Schein",
    "release_date": "2014-10-09",
    "developer": [
        "Zeppelin Studio"
    ],
    "publisher": [
        "Meridian4"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 21,
    "positive_ratings": 198,
    "negative_ratings": 61,
    "price": 5.49,
    "description": "Use the magic of light to explore hidden worlds, solve challenging puzzles and defeat deadly beasts in award-winning Schein, possibly the trickiest platformer you’ll play all year.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/321920/header.jpg?t=1510169321",
    "minimum_requirements": "OS: Windows Vista, 7, 8, 8.1 Processor: 1.6 GHz Memory: 768 MB RAM Graphics: 256 MB SM3 DirectX 9.0c DirectX: Version 9.0c Storage: 1126 MB available space Additional Notes: Full controller support",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Schein: what a ride this has been. Right away it strikes you with its gloomy protagonist and – excuse the clichéd comparison – Limbo-like, drab, backdrop. With it comes the mirror image reflected in the murky swamp, that for the duration of this game, we are an inhabitant of. The game switches between different colors that all signify their own version of the swamp, we have the rugged, gray and old normative state, where our character has a bleak expression, signifying the hopeless situation we are in, losing our son and all. Then we are quickly introduced to the green light, which turned our character into a young man, perhaps a boy, golden hair and smiling, perhaps the former self of the main character. Then we have what according to the achievements is: despair and insanity, with the colors red and blue, respectively. I would imagine it should have been the other way around considering the expression of the “blue” characters face seem like that of one who is in despair, and the “red” with fiery brimstone and an angry expression seems more like that of an insane person. But I digress. This is the basis of Schein's gameplay, and if I may say so myself, it's great.  This game go from one minute being a slow-paced put-your-thinking-cap-on kind of game to a fast-paced rush through so-called “boats” requiring intense maneuvers that feel absolutely amazing to pull off, and as a bonus, don't make you frustrated when you fail, because it's so much fun to actually learn these patterns and perform elaborate patterns of jumps in accordance with color-switching. There is one level in particular that stands out in this fast-paced regard, with a somewhat fitting name, called “Speed of Life”. The way the level gradually integrated every aspect of your skill set to crescendo you into to some rather impressing stunts, really felt like amazing game-design, and was a lot of fun, to be honest. There were levels or puzzles that could have used some type of hint that you were doing the right thing, especially if you needed to bring a lantern or not. It was ambiguous and subsequently forced some backtracking, albeit minor and not really damaging to the overall experience. Boss fights appear in this game, which is interesting for a puzzle/platformer, and for the most part it paid off and worked within the games structure, as they were the means of which to gain more power. The last fight did become rather confusing as to when you were actually doing damage to this unnamed (to not spoil) thing, but ultimately felt as difficult as a “last boss” should be.   Visual design is not particularly special in any way, but still enjoyable in a reminiscent sense, like the gloomy gray looking like Limbo; the hellish world and green forest-lushness reminding me a lot of Dust: An Elysian Trail, these games use similar textures and models for a lot of the levels, and kind of copy-paste it, but in the process make what's actually there look presentable. The changes, as touched on previously, that our character goes through in every color was a neat feature. In a way it connected to the story of the frustration of not finding his son along with this hellish rage-inducing red, or the coldness of realizing that he may not find his son with the blue, cold – to me distraught and acquiescent – expression. Design-wise things were thought out and seemed to have a purpose, and even though they weren't too awe-inspiring or interesting for any longer period of time, things felt worth looking at.   Schein's story probably has something to offer, but it's delivered in a not so ideal way. The voice-actors sound either uninspired or far too whimsical, and the discrepancy between the two leads can at points be very distracting, at least for that moment, until the game hits you with another brain-hemorrhaging puzzle. In a way it seems mostly metaphorical, perhaps just thrown in to give the game some purpose, and sort of plays on how easily forgotten the story is in the context of the swamp and its hardships it throws at us. “Forgetting” and “moving forward” are keywords, along with perhaps “purpose” if you can be so bold to exchange the word “son” in every dialog with “purpose”, there are some interesting insights to gain from this story, but entirely speculative, but that's where all the fun is to be had, no?   A cacophony of orchestral music littered with piano strings crescendoing into something larger was part of the in parts great musical aspect of Schein. The music stemmed from a scatterbrained person throwing epic orchestras in between slow piano pieces and acoustic guitars, silently plucking away. Was there a general tone, trying to match visuals with audio? Not to my knowledge, but the individual pieces were fine, the quality was high and when the loop was right it actually gelled well with what was happening on the screen. Scatterbrained, but well executed, well enough, I should say.  It's a clear recommendation to me, but mostly for the gameplay, if puzzle-games are your thing, this will be your thing as well. Schein is unique in how these color-systems interact with each other and can often be very satisfying, once you clear a level or an especially difficult puzzle. Although the aesthetics were not ideally pleasing to me, they were not without novelty and worthy of at least some appreciation. It's a good game, you'll enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Schein takes the platform genre and adds a neat unique twist.         YouTube™ Video:  ➜ A Quick Look @ 'Schein' +5 Steam Keys to Giveaway! (ENDED)&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "The word 'Schein' means (among other things) 'a glow' in German.  Schein  is a challenging puzzle platformer that tells the story of a desperate man, who ventures forth into the mystical swamp in search of his missing son. As he gets lost in the darkness, a wisp appears that offers him help, guidance, and its magical power: a light that changes the world. Use this mighty power and your wits to unveil new dimensions, defeat deadly beasts, solve tricky puzzles and uncover hidden paths through the murky swamp.   The game consists in solve puzzles while jumping platforms. It's insane in some parts of the game. Creatively uses the game's light mechanics to blend the hand-drawn assets of the four worlds, as well as somehow incorporating a 3D model without it looking really out of place.  The game has a good level of difficulty in some parts. Hard sometimes. But it's a good difficulty. I really liked this game.  +brilliant game mechanics +good level design +progressive difficulty on levels (except one or two parts, but it's ok) +puzzles are never repeated -no multiplayer  A charming and entertaining game.",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent game! Long time i haven't seen such a good and intelligent game!",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Schein basically is a puzzle platformer where the element is born out of you being able to change the world by activating buttons,platforms with the help of an orb which colours the workd in either red,green or blue.the mechanics work around theis part where platforms become visible with the right orb and also there are certains places with inbuilt color orbs. The puzzles are fairly simple with few reachicng an higher diffculty. There are few fast and utterly frustratng platforming segments in between which have no puzzle elements but require you to switch quicky and correctly between orbs so that you could jump across. this part is infuriating. There seem to be various hit detection and jumping bugs which make it a pain. these are few and far between but will make you scream expletives. Overall it is a good game with good puzzles. Recommended if you can bear the infuriating platforming segments.",
            "review_score": "1"
        },
        {
            "review_text": "  Nice Game, Nice Puzzle, Nice Graphics 8/10",
            "review_score": "1"
        },
        {
            "review_text": "great platform game",
            "review_score": "1"
        },
        {
            "review_text": "Vanilla side scrolling platformer. When I altered the key bindings to do WASD and green light with Numpad enter key I encountered fatal bug where I couldn't progress. Have 'green light on' shows green plank but game interprets as though a green wall in the way so can't jump onto platform and can't go back - quite literally nowhere to go.   Why would default key bindings have people crossing over their hands at such awkward position and then upon changing it to a standard form (WASD) it doesn't work?   Unless you're a contortionist the game is effectively only playable with a gamepad.",
            "review_score": "-1"
        },
        {
            "review_text": "An otherwise fun game, marred by the fact that you can't backtrack to pick up a collectible at the last checkpoint. Seriously detracts the game from a 9/10 to a 4/10.",
            "review_score": "-1"
        }
    ]
}