{
    "app_id": 322210,
    "name": "Guns, Gore & Cannoli",
    "release_date": "2015-04-30",
    "developer": [
        "Crazy Monkey Studios",
        "Claeysbrothers"
    ],
    "publisher": [
        "Crazy Monkey Studios"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Multi-Player",
        "Local Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Side Scroller",
        "2D"
    ],
    "achievements": 21,
    "positive_ratings": 1650,
    "negative_ratings": 125,
    "price": 6.99,
    "description": "Guns, Gore &amp; Cannoli - An over-the-top, comical and fast-paced action game with hand-drawn graphics set in the Roaring Twenties. An all-you-can-shoot fest where you embody Vinnie, a mobster with a mission in a city controlled by gangsters and plagued by zombies. Featuring up to 4-man local co-op.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/322210/header.jpg?t=1555346619",
    "minimum_requirements": "OS: Windows XP, Vista, Windows 7 , Windows 8, Windows 10 Processor: Intel i3 or AMD equivalent Memory: 4 GB RAM Graphics: ATI or Nvidia Videocard with at least 256MB, or Intel GMA 950 or newer DirectX: Version 9.0 Storage: 5 GB available space",
    "recommended_requirements": "OS: Windows XP, Vista, Windows 7 or Windows 8, Windows 10 Processor: Intel i5 or AMD equivalent Memory: 8 GB RAM Graphics: GeForce GTX 550 Ti or Radeon HD 6770 DirectX: Version 11 Storage: 5 GB available space",
    "reviews": [
        {
            "review_text": "Guns, Gore and Cannoli is a 2D side scrolling action platformer in the style of Metal Slug. You play Vinnie Cannoli, a mobster working for a large family, traveling to a town plagued by zombies and rival gangsters. The story is pretty basic, but fun. You could totally enjoy the game by skipping the cutscenes, but I don't regret watching them, they ended up being pretty funny and the voice acting is pretty good.  The gameplay is simple, your shooting zombies/people. I was very happy when I realized I'd be fighting more than just zombies, I feel that would have gotten old pretty quickly. The game does shine in variety, however. By the end of the game, you have a total of 10 different guns, ranging from a pistol with infinite ammo to a Tesla gun, used to electrify your opponents. Weapons are more viable against certain enemies, which makes it a lot harder to just run through the game with the pistol(although I'm sure its possible). The game also has a nice variety of enemies. There are several types of zombies, including ones that will chase you down the map, big exploding zombies, and more average zombies that are only aggressive when you're next to them. You also fight soldiers and other mobsters, each with their own variety of enemy types. As you can see, the game shakes it up throughout  I enjoy the game greatly, but obviously its not perfect. The biggest issue I have is with the AI. While its competent most of the time, and I do like that zombies won't avoid grenades but regular people will(nice touch), I've found the AI killed themselves more times than I'd like. There are stages that should probably be hard that you can exploit to get the enemies to kill themselves. I'm not talking about the Zombies here, I'm talking about the regular people, and they should be smarter than that. But, the AI overall is pretty competent but its not perfect. The last complaint I'd make is the length. I get the game is meant to be replayed, so its short to warrant other playthroughs, but for people like me that want to play through different games, and only replay a handful of games more than once, it makes it hard to recommend at full price. I still would, but its harder.  Overall Guns, Gore &amp; Cannoli is a well done 2D action platformer, that has great gameplay with a strong mix of enemy types. If you worry about things like $1/hr of enjoyment, maybe wait for a sale. Otherwise, I recommend it, Especially if you have someone locally to play with.     Buy At Full Price    ",
            "review_score": "1"
        },
        {
            "review_text": "  &lt; Disclaimer!! I got this game for free for reviewing purposes &gt;    Mafia meets zombies and infected rats in a 2d shooting adventure!  Guns, Gore &amp; Cannoli is a very weird name for a game but it basically explains some of it An interesting 2d platformer that combines comedy and yet stays serious     About the game",
            "review_score": "1"
        },
        {
            "review_text": "I don't want to write a long review about this game, because the less is more, so I just say, this game should be the standard for all the side scroller shoot 'em up games.",
            "review_score": "1"
        },
        {
            "review_text": "Now that is some good cannoli",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best side scrolling shooters I have ever played and to top it off the couch co-op experience was fantastic. There are a myriad of guns to choose from while the combat is satisfying and not janky at all like some side-scrollers can be. I highly recommend this game if you are looking for a sweet couch co-op game to play with your friends. Highly worth the asking price. The only downside is that there is no more once you have beat the main campaign. I would love to see an expansion sized DLC as my friend and I really want to play more.",
            "review_score": "1"
        },
        {
            "review_text": "Its (more or less) Metal Slug transferred into a 20's mafia theme with well made cutscenes, witty dialogues and an entertaining small frame story that doesn't force itself upon the players with annoying goals or other crap.   Most of the time you, and up to 3 of your friends, will be armed to the teeth and run and shoot through hordes of zombies, gangsters, giant rats and other unholy creatures - and you will like it!",
            "review_score": "1"
        },
        {
            "review_text": "This game would offend Italians, Zombies, and Irishmen. I bought it for my Italian friend. It's a good side scroller, the art is beautiful, and the punch lines made me chuckle. It spreads the weapons out good and it's pretty challenging, even on easy mode.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game i really love it",
            "review_score": "1"
        },
        {
            "review_text": "nice HD sidescroller, plays very good and looks fantastic!",
            "review_score": "1"
        },
        {
            "review_text": "Guns, Gore &amp; Cannoli was a game I didn't expect to be so FRIGGIN AMAZING! , The game features a great story, loads of fighting, Plenty of Guns *as the title says*, and yes i'd say Cannoli. Gameplay is great as for a platform shooter, It's satisfying as hell to blow the head off your enemies as you blast your way through levels. Graphics are pretty good even for Hand-drawn. The music is amazing and represents the Golden age of the roaring 20's. I find this game very addictive and fun to play. At first, it might get frustrating to get through the game, but after a couple of times it gets better for you. I really wish the game featured a online co-op mode but it'll pass as the game is already amazing. I give it a 10/10 and my quality seal of approval *Plus a Snickers bar innit too*. I highly recommend this game for everyone to try and see what they liked about it, as it is a perfect platformer shooter. -CANNOLI CAN BE GOOD FOR YOU!.",
            "review_score": "1"
        },
        {
            "review_text": "Guns, Gore &amp; Cannoli Is an absolutely great platform shooter gem. The game and its story is basically that you play as the mafia enforcer Vinnie Cannoli in the prohibtion time who is up against both rival gangs and hordes of different zombies aswell. The different enemies you are up against has different weapons and skills like some are fast runners and others are slow, some can be killed with one shot and others are more resistant and demands either more shots or with more heavy weaponry.  The gameplay is pretty much to get from point A to point B while blowing enemies and a few bosses to kingdom come. In the gameplay sense this game isnt very original but where the game really exceeds itself towards other platformers is in the graphics,soundtrack and comedic departments. The graphics is like taken out from a cartoon and eventhough some usable platforms sometimes blends into the surroundings it all works very well together as a live cartoon. The soundtrack is also very fitting to the game with its jazzy toons that is like taken from the time period of the prohibition. The comedy of this game is really funny as it is as stereotypical as it comes in regard of italian american mafia flicks and mr cannoli often comes with a kliche' one liners about the guy/zombie whom he just blew to smotherines.   This game had my attention from the first time i saw it but i wasnt sure it would live up to my expectations so i just bought it in the summer sale eventhough it wasnt really much reduced in prize and im really happy that i did that as this is a really great fun. Ive played platformers since sega master card system and on the amiga aswell so i have played my share of these types of games and this one is really great even at full prize. The only thing i can complaint a little about is the length of the game but still in my opinion its an acceptable one.   Ill rate this game 8.5 out of 10 and its very recommendable for all platform and cartoon and gangster fans with a love for over the top comedic violence and funny one liners. Yes thats some good cannoli !!!",
            "review_score": "1"
        },
        {
            "review_text": "This game have a name like a british pub and sounds like italian cultural concerto. The story in this game is pretty cheap and characters not catchy. But the gameplay is great. Playing on insane difficulty can be really challenging. There is a good set of various enemies and an appropriate set of weapons and tricks.  So it's a solid good looking and good sounding game. You can spend a couple of evenings on it and have some fun. I recommend to wait untill it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I have to say...this is a pretty sweet shoot 'em up!  The graphics and animation are consistent and well animated (though if you were expecting Skullgirls quality, it's not there but the animation's still impressive nonetheless), the guns are meaty and fun to use, there's lots of blood and gore (for a 2D game) and the controls and sound are fluid.   Only major problems I have is that a glitch won't let me get past through the last level (the game crashes and freezes, though I'm not sure if anyone else had this problem), and the versus mode is a little barebones.   Overall, great game! I'd pick it up at a sale, though.",
            "review_score": "1"
        },
        {
            "review_text": "I have to say...this is a pretty sweet shoot 'em up!  The graphics and animation are consistent and well animated (though if you were expecting Skullgirls quality, it's not there but the animation's still impressive nonetheless), the guns are meaty and fun to use, there's lots of blood and gore (for a 2D game) and the controls and sound are fluid.   Only major problems I have is that a glitch won't let me get past through the last level (the game crashes and freezes, though I'm not sure if anyone else had this problem), and the versus mode is a little barebones.   Overall, great game! I'd pick it up at a sale, though.",
            "review_score": "1"
        },
        {
            "review_text": "What would happen if you took Metal Slug, put it in the prohibition era, and gave it a mobster story? You probably would get Guns, Gore &amp; Cannoli. While it isn't a long game, and only took me about two hours to beat, it was two hours of fun zombie and gangster fun. Probably best played in co-op I however spent it on single player and still had a fun go of it. It's a fun little gem that I suggest picking up...just maybe on a sale. Still, even at full price I don't regret the buy.",
            "review_score": "1"
        },
        {
            "review_text": "the game is so simple it is better then others the fast pace shooting game with zombies is a perfect mix",
            "review_score": "1"
        },
        {
            "review_text": "it's awesome",
            "review_score": "1"
        },
        {
            "review_text": "The art style and setting of this game are outstanding. It's not just another side scrolling shooter. The mechanics are awesome. You will want to come back to it time and time again.",
            "review_score": "1"
        },
        {
            "review_text": "love the game play great relaxing game .always a good time",
            "review_score": "1"
        },
        {
            "review_text": "10 out of 10  the graphics are on point  controls with a controller are good (not sure about keyboard) the way people who are not infected have to worry about zombies and kill eachother in the proccess 4 player   DEFINETLY WORTH $10",
            "review_score": "1"
        },
        {
            "review_text": "I like 2d platformers/shooters. I like the godfather and the makers are from belgium just like me. This game is a great stress reliever !  Thanks claeys brothers and crazy monkey studios for this beautifull and attractive (in dutch 'Sfeervolle') game !!",
            "review_score": "1"
        },
        {
            "review_text": "Simply great game!",
            "review_score": "1"
        },
        {
            "review_text": "Funny arcade game. Pretty nice visual art.   If you want an easy game, just to have fun this is perfect.  ",
            "review_score": "1"
        },
        {
            "review_text": "Just pure fun. Hard and humorous.",
            "review_score": "1"
        },
        {
            "review_text": "Local co-op fun pure! Comes with an awesome campaign and a fun versus mode with addable AI (total 4 players in versus).",
            "review_score": "1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°) its a good game! its after ww1 and the goal is: -go to thugtown -kill -die -find cheats -kill bonnio -find frankie -he betrays you -kill him -end your trip to thugtown -play the game again 100000000000000000/10",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, similar to metal slug but ten times more hilarious!",
            "review_score": "1"
        },
        {
            "review_text": "Basically Metal Slug in the 1920's prohibition era, with zombies and buckets upon buckets of blood.   Pretty decent voice acting, huge variety in the levels (despite the game itself being short), but above all: The incredibly awesome art style! Controls good and can be pretty challenging.",
            "review_score": "1"
        },
        {
            "review_text": "A fun couch Co Op game with your friends!",
            "review_score": "1"
        },
        {
            "review_text": "The rat boss makes me want to break my controller",
            "review_score": "1"
        },
        {
            "review_text": "A really fun, short, and challenging arcade game with a unique backdrop. Solid controls and interesting design will make you want more.",
            "review_score": "1"
        },
        {
            "review_text": "Although it is kinda short, really worth picking up if you want to sit back and slaughter hordes of zombies in a groovy cartoonish style with some really refreshing 1920's setting.",
            "review_score": "1"
        },
        {
            "review_text": "A little short.. but if you find it on sale it's worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Come to think about it, this game is basically RE: ORC in 2D.",
            "review_score": "1"
        },
        {
            "review_text": " in this game we see how important is to support little studios",
            "review_score": "1"
        },
        {
            "review_text": "Its normal asking price of $10 is hilarious. Catch this for a dollar in a humble bundle someday or something, otherwise don't worry about it because you aren't missing anything since there is barely anything at all to miss. In fact if you blink you might miss the whole game because it's so short. If anything, it taught me to always check  www.howlongtobeat.com  from now on before buying games to make sure I'm not wasting my money on something that is so short. I got it on sale for $5 but it is only 2 hours long with no reason to play through it more than once in a lifetime. I mean okay that's cool if the gameplay is amazing then fk yea buy it for $5 but it's about a 7 or 7.5/10 decent-at-best indie game is really all it is.  7/10 gameplay 2/10 length",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ LOCAL CO-OP #DonaldTrump #WastedHis$10",
            "review_score": "-1"
        },
        {
            "review_text": "One of the worst things I happened to stumble here on steam Really really bad  1/10",
            "review_score": "-1"
        }
    ]
}