{
    "app_id": 322500,
    "name": "SUPERHOT",
    "release_date": "2016-02-25",
    "developer": [
        "SUPERHOT Team"
    ],
    "publisher": [
        "SUPERHOT Team"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "FPS",
        "Action",
        "Bullet Time"
    ],
    "achievements": 26,
    "positive_ratings": 14847,
    "negative_ratings": 2202,
    "price": 17.99,
    "description": "SUPERHOT is the first person shooter where time moves only when you move. No regenerating health bars. No conveniently placed ammo drops. It's just you, outnumbered and outgunned, grabbing weapons off fallen enemies to shoot, slice, and maneuver through a hurricane of slow-motion bullets.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/322500/header.jpg?t=1550065067",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core2Quad Q6600 2,40 GHz Memory: 4 GB RAM Graphics: GeForce GTX 650 (1024 MB Ram) Storage: 4 GB available space",
    "recommended_requirements": "Processor: Intel Core I5-4440 3,10 GHz Memory: 8 GB RAM Graphics: GeForce GTX 660 (2048 MB Ram) Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, not worth $25",
            "review_score": "-1"
        },
        {
            "review_text": "Summary: In short, get it if it's on 60% discount or lower. It's a game that is fun for a few hours, but is *vastly* overpriced. They recently announced they will make a SEPARATE game with VR support, despite the original basically being predicated on there being VR support in the future.  Pros: Fun action Interesting concept of time (moves when you do) Some replayability in challenge modes Interesting style  Cons: Story is short and unfulfilling Very expensive for what you get Buggy at times Developers charge an extra $25 for VR support version unless you bought the game BEFORE it was launched, which in my opinion is a total scum move. Developers also promised a 'major update' to the game which never came, instead they launched the 'pay $25 for VR'-version. Massive letdown.  Get it if it's cheap on a sale, otherwise don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "Ehh. For 25 bucks, you get a handful of levels and then another handful to unlock and play in endless mode.  I'm writing this at 2.4 hours played. I would estimate that 2 hours were spent on the 'story' mode, and the other ~30 minutes were spent messing around with the first few 'endless' levels.  By the end of that play session, I was pretty much done with SuperHot. The novelty had worn off, the story mode was complete, and none of the extras or replays were going to keep me around.  If you see this game on sale, or get a coupon, I'd say go for it. It's an interesting mechanic to play with. At full price, I'd tell you to save your money. In the meantime, try and track down the original Superhot. It's about the same length, it's free, and I actually preferred the story in that one over this one.  It's not a bad game, and it's a game I can honestly say I enjoyed both times I played it, but it's right on the borderline of things I'd recommend. I don't regret my purchase at full price, but I don't think the average user is going to feel the same way.",
            "review_score": "-1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing mix of an FPS with a Puzzle game. . Graphics are very minimalstic so you can concetre on what you are doing. The story is intresting and also a bit creepy. A lot of things to do after story too! It's really a must-play for anyone  EDIT: The game gets even better AFTER finishing the main campaing. You get the Endless mode, many chalenges that REALLY change how the game is played. Also you get a Timberman clone inside.And to finish this PLEASE tell me in what game can you throw a Katana at somebody switch into the guy you were throwing the Katana too pick the Katana MID-AIR slice two head throw at some other guy and then pick up shotgun that is passing in the air by conisidens and shot some other red guys heads off. If you LOVE the core of the game you will play it on and on and on and on. Also the dev's sad that they are going to support the game. Still I have to agree that 23 euro CAN be a bit of problem to get it BUT you still do that. Also in what game can you slice a bullet in half using katana?!",
            "review_score": "1"
        },
        {
            "review_text": "Wait for the price to go down... worth 10$, not 25",
            "review_score": "-1"
        },
        {
            "review_text": "Lots of fun but lacks content to be worth $25. It only ends up being around 2-3 hours of gameplay to finish the story, challenges and mess around in the other modes.",
            "review_score": "-1"
        },
        {
            "review_text": "Hi [FRIEND_NAME_HERE], you have to check out this game. It's the most innovative shooter I've played in years.   But in all seriousness, this ♥♥♥♥ is fun, but WAYYYYY too short for $24.99, which is why I bought it for $9.00 lol. Worth $14.99 or less. Completed in less than 4 hours, but has fun aftermath games.",
            "review_score": "1"
        },
        {
            "review_text": "I think that 'very positive' is a sign that we as a community have ♥♥♥♥ed up. I'm sorry, but innovation is not the key to a good game. Did I have fun playing this? Yes. Would I reccomend parts of this? Yes. But for both the price tag and the content in the game I can't endorse it. I'm not saying that the length is a problem because it isn't; one of the best games ever made is the original Portal and that was barely 2 hours. However, Portal was priced correctly, and while it had a story it simply informed the gameplay and wasn't obtrusive. The character felt well fleshed out and comical, while the narrator in SuperHot is just obnoxious. Every time I was pulled away from the radically fun gameplay, I was annoyed. The 'story' to this game is it's greatest downfall and I genuinely wish that it was simply a collection of mission with a fun gameplay gimick.",
            "review_score": "-1"
        },
        {
            "review_text": "Superhot is possibly the most disappointing game I’ve played so far this year. It’s got a great premise with it’s time bending matrix style mechanics, but to be perfectly honest with you that’s all it’s got going for it.  Now for those of you unfamiliar with the title, Superhot is a first person shooter where time moves only as you do… remember those fight sequences in 300… now imagine them with guns and you’ve got superhot – a never before seen melting pot of both strategic and twitch based shooting.   Now of course bullet time isn’t really a new thing and over the years we’ve been inundated with enough Max Payne and F.E.A.R clones to be sick of the concept. However, it’s never really had any use beyond doing John Woo’esque dives to look cool and break up the otherwise monotonous game loop. Heck if you’re name’s Dereck and you enjoy filing tax returns you could probably get through Max Payne without using bullet time once.   The difference with superhot is that the games mechanics actually force you to choreograph some really impressive stunts just to stay alive. It’s a bit like hotline Miami where getting hit once causes instant death forcing the player to make split second decisions to stand a chance in a firefight. Infact it’s a lot like hotline Miami with throwable objects used to stun enemies and block bullets, and very similar melee and projectile weapons.   The only real difference in terms of gameplay is hotline’s top down all-seeing perspective compared with Superhot’s much more limited first person view, a limitation in theory meant to balance out the bullet time… In practice I’ve been shot in the back countless times by enemies behind me. It feels cheap and annoying and it’s one of the major problems I have with the gameplay.   It also feels like the dev’s either didn’t know or didn’t care about this problem when they created their replay system, kilstagram. The idea behind it is that, after you’ve cleared each level, you get to watch a replay of you dispatching your enemies in real time which you get the option to upload to various social media sites. You know because all those nightclub photographs you got tagged in weren’t enough to show people how much fun you were having without them.  Anyway on paper it sounds like a pretty cool idea – the chance for you to show off your Wachowskii’esque bullet time skills but in reality the played back footage looks more like that of a twitchy counterstrike player as you keep glancing behind you to make sure you don’t get flanked causing the camera to spin back and forth making it headache inducing to watch… actually that does sound a lot like a wachowskii film.   Aaaand that’s it… well at least in terms of mechanics… and to be honest with you it all feels very lackluster. For all it borrows from Hotline Miami, I kinda wish they’d taken more. At the moment there simply isn’t any reward for combos or difficult kills like headshots, there isn’t even any music in the background which makes it feel more like an early access title than anything else. But I guess that’s the kind of aesthetic they were going for – everything in the game is made up of plain textures with a really minimalist color scheme. And it also ties in with the story the dev’s wanted to tell… that’s right the dev’s actually managed to come up with a story to tie all of this together, though as you’ll see it’s so phoned in and half-arsed it feels more like it’s there for the sake of having a story.   Remember Pony island? Good Neither does the guy that wrote this drivel. Instead of being a story within Superhot’s universe, it’s a story about playing superhot. You start off the game looking at a dos style operating system when suddenly you get an instant message from a friend sending you a file titled “superhot.exe”. After playing a few levels, the system detects you and it pans out exactly as you’d expect it to be with the system trying to stop the player and the player finding loopholes and backdoor routes to evade the system. The problem with the narrative is that it does not compliment the gameplay – you could replace the shooting segments with Tetris and the story would still work.  It’s a prime example of what people who like to use big words to sound clever call Ludonarative Dissonance, where the gameplay and story don’t match and the exposition just feels like a hindrance to the actual meat of the game.  Whilst I can kind of get over the mediocre storyline, the thing I find unforgivable is the 2-hour campaign length. That’s right, you can beat the game in a single sitting! Now I’m not saying all short games are bad, in fact titles like Portal have been praised for not overstaying their welcome with their shot length. The problem with Superhot being so short is that instead of leaving me wanting more, I just feel unsatisfied by the finished product.   To rub it in, the dev’s have had a working prototype since 2013 which featured quite a few of the levels that ended up in the full game, most of which was made in a few days at a game jam. It can’t be so hard to make a level that the team could only pump out 20 or so short levels in 3 years! Especially with backing and e3 coverage by both Sony and Microsoft. To have the balls to demand 17 quid (that’s the equivalent of 3 copies of Undertale) for a game that can be beaten in an afternoon is a little bit insulting. Granted there’s more to it than just the campaign, there’s also the arena mode where you have to fend off endless waves of enemies which gets boring after about an hour and there’s the challenge mode where you’ll have to play the campaign meeting certain conditions (for example only using the katana). Like the story, both these additional modes feel last minute and tacked on.   The best analogy I have for the game as a whole is to imagine the first chapter of id software’s doom being sold full price. Back in its heyday in the 90’s nobody had ever seen anything like DOOM and I can safely say the gameplay of superhot is just as innovative. However, whilst the game that’s there is relatively enjoyable, albeit flawed, it just ends before the more interesting experimental stages (like in the 3rd act of doom) get to be shown. Ultimately I can’t really recommend picking up the game unless it’s heavily discounted and, to go with the analogy, the game receives a John Romero out of 10. It showed a lot of promise in it’s early days as a prototype, started getting full of itself at e3 and then ultimately ♥♥♥♥ the bed with one fell daikatanaesque swoop. ",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth the amount of money they are asking",
            "review_score": "-1"
        },
        {
            "review_text": "Shame on these devs for making the VR version exclusive to the Occulus. Don't give these guys any more of your money. Avoid this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I highly recommend this game. It's quite expensive but it has quite a bit of replay value. The story seems kind of tacked on but the challenges/endless mode make it seem reminiscent of ye olden games where story/multiplayer didn't dictate the game and gameplay was valued more than other facets. I completed all the achievements in the game and I still am playing it. It's very unique in its gameplay and that's where the game really shines for me.  If you really only care about the story in a game, then this game is probably not ideal, due to its hefty price tag and short campaign but if you play video games for gameplay, I suggest trying this game. You won't be disappointed. It's especially good if you are looking for a game to speedrun and test your mettle in a rather fast paced (ironic, really) puzzle shooter.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT is a pretty neat game. It has interesting mechanics and a story that does a lot of things no other game I've played has done. Seriously, it's bonkers and also really compelling. The gameplay is awesome as well.  'So why are you not recommending this, Seko, you fiendish fiend?!' I hear you ask.  Well, my friend... The game is high quality and interesting, but the amount of content you get for the price you pay doesn't seem justified. If this game goes on sale, which it will considering all the 'No' reviews are carbon copies of this one, then sure, grab the game, it's neat, but two hours or less is not worth £18. A game where you can play through the entire thing start to finish and still be within the refund time warrants doing just that, I think.",
            "review_score": "-1"
        },
        {
            "review_text": "It's an amazing game (Much better than the original Matix game!), but it is short and gets a little repetitive. A player with experience playing any shooter will be able to clear the story line, which is about 25 missions long, in an hour or less.   After you finish the story line challenges and endless mode game-types will be unlocked. The challenges are simply redoing the main story line with additional constraints (time attack etc). The endless arenas are interesting, but are ultimately undersized.  On a brighter side, the game's existing content is bloody fantastic! You get to fight out the missions in slow-mostion and then view them in real-time (which makes you look like a total badass!).   I'm going to have to give it a thumbs down b/c it simply wasn't worth the price tag. If it is on sale, grab it!  EDIT: so there is a Matrix game, but this game plays better &gt;:D",
            "review_score": "-1"
        },
        {
            "review_text": "this is the most in... in, uh... a robot told me to say a phrase or something. uh,  superhot is the most invented videogame by my peers?  no. um... hold on.  superhot. it's the most... inundated? inventoried?  superhot has the biggest inventory i've ever seen in a videogame.  no, that's not it. one second.  superhot. it's a videogame with one hell of an intestinal tract!  yeah sure that was it",
            "review_score": "1"
        },
        {
            "review_text": "1,5 hours of main gameplay. For real?",
            "review_score": "-1"
        },
        {
            "review_text": "This game competely made me tear my hair out! It\\'s addicting but some things are just to difficult it\\'s insane. I dont understand how anyone can find enjoyment out of this piece of ♥♥♥♥♥ game.",
            "review_score": "-1"
        },
        {
            "review_text": "Oculus exclusivity is not okay.",
            "review_score": "-1"
        },
        {
            "review_text": "SUPER HOT  Superhot is a first person shooter, where time only moves when you move. This game offers you 3 gamemodes: the main story, endless mode and challenge mode. They all have one thing in common, you have to kill red dudes. To kill red dudes you can use your fists, pistol, katana, shotgun, rifle and you can also throw stuff at them to kill them. Main story is pretty short, took me about 4 hours to complete. Even though main story is pretty short it offers you really well made story and some nice plots. In endless mode you can play in different levels and you have to kill red dudes as long as you can survive. In challenge mode you are given a mission, for example kill 2 red dudes with katana. This time moves only when you move is really nice concept and it works well in this case.  My rating for this game 9,5/10",
            "review_score": "1"
        },
        {
            "review_text": "Imagine if you will: Wait, what was I talking about?   SUPER HOT SUPER  HOT SUPER... HOT....  Imagine, if you will, a simulator where everything is in slow motion. Then imagine that when you move, the rest of the world moves. Granted, if you don't move at all things are still moving, but very slowly. So slow, in fact, that you can potentially dodge bullets, cut enemies to shreds before they can move, toss guns into the face of oncoming attackers and pick up their weapon in mid-air and shoot them with it... all before the guy behind them even has a chance to aim at you. But, take a step without being aware or look around too much, and you'll likely end up getting clobbered from a direction you didn't even know was a threat.  This game is great on so many different levels that it's really hard to cover everything. I was a kickstarter backer and have played the game on various levels of completion and none of it was ever enough to quench my curiousity about the plot and, of course, the gameplay.   You basically have hundreds of ways to play through each level. Choose to go at it fisticuffs for some additional challenge or destroy everyone with headshots. Just about any way you can figure it out, that's going to work. Except, of course, the ways it won't. Which, you'll find out later in the game, become pretty linear... brutally so. However, keeping your wits about you can get you through most levels without even a retry.  And... visit the chatroom (GGchat). There is more going on there that there appears to be at first... including some hints for different levels.  I definitely recommend this game for anyone that has a computer!  And, don't forget... SUPER HOT SUPER HOT SUPER HOT!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game that I can't get enough of. Although it has many problems, it's still a very entertaining and fun game. I'm a bit dissappointed with the length of the actual game as it lasted me around 2 hours, however it has lots of challenges to complete the story with different rules, this is very lazy but still entertaining. For an £18 game there is not much effort put into it (because of 90% of it being copy-pasted).  + Innovative shooter  + Takes a long time to 100% complete  + Addicting and entertaining  + Pleasing minimalistic style  - Extremely overpriced!  - Lazy extra content  - Common sound bugs  - Common physics bugs  - Pretentious indie game story",
            "review_score": "1"
        },
        {
            "review_text": "Show the developers we don't like it when they make a deal with the devil. Devs, say NO to oculus.",
            "review_score": "-1"
        },
        {
            "review_text": "  To sum everything you need to know about this game up: It's way to short, half of the game is cut scenes and although the concept is pretty cool, you'll probably already find yourself bored of it before the 2 hour(only one hour of which is gameplay) game is over.",
            "review_score": "-1"
        },
        {
            "review_text": "Okay first things first: What an amazing idea is this. The most innovative shooter in years!  BUT, 22 euros for a 2 hour main story ...... No, dont buy this game. I really enjoyed it, but it is not worth your money. 2 hours main story. For 22 euros. Still cant believe the believe.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is fun, and I'm almost glad it's short. Because holy ♥♥♥♥ the story is annoying.  Tries to have a meta irl story like pony island, but all it does is succeed in making me go through boring ♥♥♥♥♥♥♥t when I want to shoot things. The gameplay also gets a bit dull at times even with the neat concept. I just feel like there could be more to it.  Got it for 9 bucks off nuuvem. That's about what I'd say it's worth. Do not pay full price for this.",
            "review_score": "-1"
        },
        {
            "review_text": "Way too short. Not worth $25, not worth $20 on sale. Though on the bright side, you can probably finish the game within the two hour window and then return it.  Oh, and making SUPERHOT Oculus exclusive was another reason I decided to return this game. I don't support anti-consumer practices like that.",
            "review_score": "-1"
        },
        {
            "review_text": " SUPERHOT Review    PLOT   Basically you're a dude on his computer talking to one of his online friends who sends him a cracked file for 'superhot.exe' which is described as 'a tool' by a company the game is being controlled by. Matrix-Inception ♥♥♥♥ happens and you get brainwashed. I would add extra info but I don't want to spoil it.   GAMEPLAY   Not inculding the massive ammounts of secrets and extra stuff to look at in the menus (including 'the game of life' and other retro computer things), the game basically focuses on the player who is trying to eliminate all of the 'red dudes' in each level using a variety of melee and ranged weapons. The main gimmick is that the level (including enemies and flying objects) only move at the same speed the player is moving at. The game is actually extremely fast-paced, which can be seen in the replays after a level, but what would be extreme difficulty and a need for inhuman reflexes is solved by the slowing mechanic, making you seem like a ♥♥♥♥ing ninja at the normal speed (so much so that they have a website just for uploading replays).   PROS    -Smooth mechanics -Insane visuals (especially in cinematics) -Developer support  -(limited) VR support -Full controller support -Nice arsenal of weapons -Hard but fair (mostly) -4th wall breaks that play in with the story -Fun overall   CONS   -Minimal enemy noise for footsteps and other motions (expect to be screwed over quite a bit) -Story could be a little less cryptic -Short (I have no issues with the length due to the tons of extra tidbits and gamemodes to do, but it is a major problem with some people) [See 'OUTDATED ISSUES'] -You have to be looking directly at an enemy to melee  -Minimum distance to body switch is tricky -Can get repetitive -Overpriced at the moment   OUTDATED ISSUES   -Lots of people have been talking about the fact that you can't see your replay without 'SUPER HOT' flashing in your screen, but pressing f5 gets rid of it, and there are lots of playback options to use with a numpad. If this has been here the whole time I don't understand what people are whining about. (BTW fn+f5 or fn+alt+f5 to do it on Mac)  -Everyone has been talking about the length of the game, but the developers have recently announced a free DLC which includes extra levels, procedural generation, skill-based powerups, and other goodies which are being said to drastically increase the playtime of the game.",
            "review_score": "1"
        },
        {
            "review_text": "I played like several hours to complete this game. ITs a good Concept and all that, but its not worth 20€, atleast in my opinion. Save your 20€ until the next Summer sale and then buy it for like 10-12€.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, but as a VR supporter I will no longer be supporting these devs.",
            "review_score": "-1"
        },
        {
            "review_text": "So this is it. SUPER HOT. Could have been a super hot game.   Sadly I cannot recommend the game in its current state due to awful lags (I got a NVIDIA GTX 970 and Intel core i5 + 8GB RAM PC, all drivers are up-to-date) and the reeeally bad pricing. Seriously. You can't just ask for a price that high for a game that doesn't have to offer much. Or are you guys planning an update that doubles the Content?  Well, I really enjoy myself while playing but it would be much better if the lags weren't there, this needs to be fixed. And also the developers should really think about lowering the pricetag (17 dollars would be fitting for a game/content like this).",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a great concept.. but a waste of money. And now they want to add vr support and call it 'a completely new game' and ask full price again? well f*** you too, super hot devs.",
            "review_score": "-1"
        },
        {
            "review_text": "I have been waiting for this game since I first saw and played the online tech demo. I loved the chance it gave you to analyze your situation and to act accordingly. Reaction time is not needed to play well, the mechanics are simple. Time moves only when you move. Pickup guns, shoot red guys, repeat. I love the gameplay and puzzles. However I cannot reccomned this game at it's current price. The amount of content within the game is sparse. The story is only a thought experiment and is short. Really short. I finished the game within the 2 hours that steam allows for refunds and I got my money back. The game is great and the concept is fresh and well executed. But the lack of content or the ability to create custom levels makes it lacking. It is not worth even the $22.49 I paid for it on sale. Either more content is needed or a lower price must be charged to make the game worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "SUPERHOT is the most innovative shooter I've played in years",
            "review_score": "1"
        },
        {
            "review_text": "Too short. Not worth 25 dollars buy it on a Steam sale or get it for 13 bucks on  {LINK REMOVED}  ♥♥♥.com . The overarching storyline detrachs from the overall experince as it rips you out of the game like when you are pulled out of the animus in Assassin's creed to do some stupid thing. For example after like one or two missions you are pulled from the simulation and forced to have a scripted text message conversation with someone or whattever.   Some other minor gripes is that the name has nothing to do with the game, just an annoying voiceover that they repeat for no ♥♥♥♥ing reason. It gets kinda stale after a few levels and the hoarde mode has only 4 of the like 20 campaign mode maps that would be really fun to play on.  I guess what I'm saying is that you should spend more than 13 bucks on this game because it has barely enough content to be considered a game. I am giving this a negative reccomendation until the day that the price is lowered by about 15 dollars because this is a fun little indie game at best.",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "good game, too short for $24",
            "review_score": "-1"
        },
        {
            "review_text": "Exclusives are bad for consumers AND developers. Don't buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "You cut a bullet and the enemy who shot at you with the katana. Than throw said katana and make a kebab of the two enemies turning at the corner. Than transport yourself into the 4th enemy at the back of the room and catch the katana you just thrown mid-air. #averageday   A big yes for this game! Yes it has a short campaign, but the mechanics are so great I come back and play the endless levels and chalenges a lot! Play with katana only, barehands, master all the levels, beat the game in all the modes and have fun tearing all the reds apart!",
            "review_score": "1"
        },
        {
            "review_text": "As others have already mentioned, the game is way too short to warrant its current price point. The mechanic is incredible and the gameplay, while it lasts, is ridiculously fun. However, the storyline for me just served to interfere with the fun of Matrix-ing through random action scenarios, and it's conclusion was somewhat lacklustre considering the build-up.  Definitely a game to pick up on sale, but currently not worth its price at all.",
            "review_score": "-1"
        },
        {
            "review_text": "This is actually the first review I've ever written on Steam, I'm THAT disappointed  Bought it for 9 bucks elsewhere, regret it because I can't get a refund. It's less than two hours.   Yes there's endless mode and challenges, but guess what? Those are boring. The Story levels are interesting because each level is essentially a well designed puzzle. Challenge mode and endless mode completely ruin that aspect of the game and all you're left with is a very basic game mechanic that's no longer interesting or engaging  Instead of going with that super pretentious meta story that every other indie game does, they should've just invested that budget in more levels / assets",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely short, the story makes no sense and dodging is kinda frusturating. It is in no way worth $25, just go and buy something else. Please.",
            "review_score": "-1"
        },
        {
            "review_text": "[Encourage Memes]  I HAVE MIXED FEELINGS ABOUT SUPER HOT.  It's an intro in TO cyberpunk. It gives players of any skill level a unique action-puzzle experience that ends up being a blend of The Matrix meets MKultra if M.K. stood for Manchurian Killer.  It's better as an arcade game, and you'll unlock that mode following the completion of the short story campaign. I thought it was a tensionless, droll experience up until about the point where the story began to end, when the levels become much more difficult (when it became fun).  There's a lot to get into in too many words, so here was my experience.   Spoilers will not be tagged, but I'll try to avoid blatantly spelling it out.  Super Hot is all about glamour and if you're a playful gamer, you'll have plenty to do. The campaign is presented very well, but I always felt three steps ahead of the cyberpunk story. It ended at about the point where I thought it should've continued on, but damn it was it ever presented in a visually exciting way. I went on to discover all the game's secrets and that's where the story started to really lose me.  'You aren't actually going to reveal anything, I get it, Super Hot.' And then Super Hot's mysterious Red Voice continued on and on with its attitude. I continued to find the secrets because it did answer some of its questions, only for it to conclude with a reward for my dedication, and while I appreciate that it fits back in with the hypnosis/brainwashing angle, I felt as insulted by the game as if it asked me if I wanted to buy more energy, like a freemium game would. The 'secrets' were ultimately unecessary, since like I said, the majority of the ''secret'' ''''answers'''' were questions that I'm confident most players solved themselves in the campaign.  What a strange path the story took though. I was really into it up until the point where it was clear that the secrets were bunk, and then it got all capitalist on me and threw the punk part of the cyberpunk out the window with the coupon.  Still, tho, the game's themes and presentation are intertwined, and I actually do like Killstagram because it ties back into the boldness of their compulsion to make you part of their viral marketing, and even the warez angle feeds into the viral edginess. That stuff is fantastic. Moreover, Killstagram feeds into the playfulness and how much fun you can have by learning that juggling guns and banking thrown objects off walls is the most hilarious and cool looking fun you can have. Killstagram, if you're into it, changes the way you approach the game, turning it into something more creative than clearing the mission.  The story is an intro to cyberpunk and posthuman themes though, and its style and tone are its own. I just wish they excluded the 'secrets' which ruined it pretty handily.  So, yes. It's true. The game really starts after the campaign ends. This game is so much more engaging as an arcade game with rules and restrictions. The puzzle aspect really shines when the game becomes challenging, forcing you to think creatively, and even reactively...  So yeah, I keep bouncing back and forth on whether or not this game is Super Hot or Over Rated because I keep thinking back to the F.E.A.R. series as one of the big games to use slo-mo in a glamorous way but I think you'll probably enjoy the game of Super Hot, and if you didn't find it very challenging, keep playing and the intensity will increase through later modes.",
            "review_score": "1"
        },
        {
            "review_text": "The game was good, definitely a new idea, however they recently signed an Oculus exclusivity deal so that you have to buy the Oculus headset to play it in VR. That makes this game a bad purchase as doing so makes them think that kind of thing is ok, I wish I could refund it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is SUPER HOT!  It's also SUPER OVERPRICED so buy it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great, innovative game. Though for 34.99 CAD it is way to expensive, and I kind of felt like I got scammed. I would love to refund it, but I got it 2 months ago, and played for 5 hours. :/",
            "review_score": "-1"
        },
        {
            "review_text": "Its a great game but its not worth the price. The game is short, lags on a very good computer (Example is GTA 5 at high is 70+fps and SUPERHOT is 10-20 fps on high) This game also crashes for me alot, Im gonna be honest i've been exicted for superhot early 2014 but the hype has gone. Im sure it'll be fixed and it has been released about a day ago. Anyway final rating 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME. The developers sold out to Facebook and agreed to Oculus exclusitivity, effectivly shooting VR gaming in the foot before it's really gotten a chance to start out. Exclusivity is why we PCMR laugh at the console wars, and yet scumbags like SUPERHOT are starting a new generation of HMD DRM. Vote with your wallet. Vote no to ♥♥♥♥♥♥ Facebook money grabs.",
            "review_score": "-1"
        },
        {
            "review_text": "I Had Been playing for two hours, and then on a level with two trendy staircases the game crashed, I tried again, it crashed again. Then now when I try to log in it gives me a black screen. As long as you don't fix this I'm rating it down. My 22 dollars went down the drain.",
            "review_score": "-1"
        },
        {
            "review_text": "too short for the price. Also they took money from a monitor company and made mine unusable.",
            "review_score": "-1"
        },
        {
            "review_text": "The game was fun for the time that it lasted, however, for me, it did not last very long, and I found that the extra mode and replayability was lacking. A great concept, however, it did not live up to the hype that I was expecting it to. Perhaps a little unfair, but in my mind, definitely not worth the $25.00 it costs.",
            "review_score": "-1"
        },
        {
            "review_text": "too short, just like this review",
            "review_score": "-1"
        },
        {
            "review_text": "Hi, you have to check out this game. It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "  Holy crap this game is fun    The story might be kinda short (like a few hours) but the best part of this game is finding the secrets in the levels and completing the speedruns.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "  SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!     Short story, but the Endless and Challenge levels are really fun and you can spend a lot of time in them. If you get this on sale, it's well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This is the most innovative shooter I have played in years.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.  People are really hung up on the length of the story mode, but I don't really think that's fair. The story is (IMO) exactly as long as it should be. I won't reveal why I feel that way, because I don't want to reveal too much.  Even without playing the endgame content yet (which I'm sure I will), I feel like I got my money's worth from this. This is the most refreshing and original game I've played in a long, LONG time. Seriously, regardless of length or price, you are doing yourself a disservice if you don't play this game.",
            "review_score": "1"
        },
        {
            "review_text": "I don't really write reviews for games but I feel like I should write one for this, specifically since it is in Early Access.  Yes, the story is very short, unfortunately. I completed it in about 2 hours, with messing around in the campaign (Trying dumb stuff, no slow mo, etc). While it is a pretty dark and good story (If you want to call it a story, more like a stretched plotline to a story), there really isn't much to it.  After beating the story you get Challenge Mode, and Endless Mode. Challenge Mode being the single player campaign with certain restrictions or objectives to meet, Endless Mode being exactly that. endless enemies spawning in an arena. The more you play, the more arenas you unlock. It can get boring after a while but I can see myself always coming back for at least a little fun for quite some time in the future.  The game itself, however, is fantastic. It even came with it's own website, where you can upload your own clips and replays. While even that may not be handling all the traffic it's been getting, not many games have that. I do wish there were more edit options, however.  Time moving only when you move is a great concept. Any action, even rotating, allows things to move. You can chain together kills in a very satisfying way and put together combos that make you look like you've played shooters every day for your entire life. The game flows extremely smooth and I can't help but say the only reason it wasn't worth the 20 dollars is because the story is so short. But I'm sure more content will be added in future patches, so eventually it will be worth the 20. 15? Sure, but personally I think 10 is too low.   With the popularity this has gotten in only a few days time, there is bound to be more content added (hopefully some *background music*) and eventually, I would hope, mod support. Community levels I would imagine is the minimum that will come into play.  Play this game, tell people to play this game, share it with your friends. But don't talk too much about it, don't let them know what the system is about.",
            "review_score": "1"
        },
        {
            "review_text": "Cannot rebind default keys. Mouse control is sluggish. Don't get this until the devs add features that we expect in FPS games in 2016.",
            "review_score": "-1"
        },
        {
            "review_text": "Tedious and frustrating. Enemies are constantly spawning in behind you, so you have to look around all the time to make sure you're not going to get shot in the back. However, looking around also causes time to move, making you more likely to get shot. Dodging bullets is made tricky by the fact that it's hard to get a sense of how wide your body is. In most of the levels, the most effective strategy is simply to back yourself into a corner so that nobody can spawn behind you, and then dodge left and right as you get shot at; this is especially effective if you can find a pillar to stand behind. The harder levels are purely a matter of trial-and-error and memorization of spawn locations. It only took me two hours to finish the story, but even that felt too long. It's a cool concept, but the execution is just not up to par.",
            "review_score": "-1"
        },
        {
            "review_text": "I am so disapointed with this game! I've waited more than a year and it was not worth it at all. Don't get me wrong, the concept 'time only moves when you move' is awesome but really lacks in speed in my opinion. While the hitbox is impressively huge ! You often die by bullets at 1m from your head !... The graphical part is good too. But I was hoping for a good storyline. Not something 'kind of ok' done in 2h ! All the rest of the game is just challenges.. So yeah, you can spend hours playing the same levels over and over with different weapons. ok... About the music. there is none.. I'm sure something could have been done and I feel like the game is a BETA release as it also crashes often on my macbook pro... It's a shame. Really. The prototype is more interesting than the game itself !",
            "review_score": "-1"
        },
        {
            "review_text": "The most innovative shooter in years!",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING game. I had SO much fun with it. However, it was short enough for me to complete the game (dying multiple times) AND return it and get my $25 back. Amazing game, for $25, not so much.",
            "review_score": "-1"
        },
        {
            "review_text": "Cool mechanic (not 'mechanics', 'mechanic') but disgusting UI and lame story. Unbearable, uninstalled.",
            "review_score": "-1"
        },
        {
            "review_text": " A Filipino Review of SUPERHOT",
            "review_score": "-1"
        },
        {
            "review_text": "While this gameplay is fun, and addicting, the story really just feels like a commercial break between gameplay sessions. I'm constantly mashing the keyboard to get to the next level. When you finish, you unlock more modes, but it's still not worth the current price tag. I'd say $15 at most. The overall game is great, but it is too short to be priced at $25. Definitely pick this up on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Way too expensive.",
            "review_score": "-1"
        },
        {
            "review_text": "It's the most innovative shooter i've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "this game is really awesome. totally worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Really great but too short. Keeping myself busy with some challanges but that price tag was pretty hefty for the gameplay present. Hoping for some free add ons.",
            "review_score": "1"
        },
        {
            "review_text": "Conceptually the game is excellent and well worth the wait since the 7 day challenge. The story is rather short at between 2.5-3 hours, but it has a very expansive challenge array which are all very fun.An element of replayability to all modes if you are creative.   If you played the demo and absolutly loved it, it may be worth the $25USD pricetag. For everyone else, on special this is an easy purchase. Great mechanics, expansive replayability and modes, very funny humour and good fun to watch replays in real-time to see what a badass you are.  Additionally, If you play most of the story, as it is only a bit over 2 hours total, you can refund the game.",
            "review_score": "1"
        },
        {
            "review_text": "Finding this game on the store and said 'I'll give it a go.' It's really overpriced for a 25$ game but its kinda worth it. The slomo action and it is one of the most innovative - wait. I'm currently trying for 100% and the normal mode takes a good hour or so to complete. The endless mode is SOO good. You really should give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "A great overall game. (Suprisingly) Nice and deep story. Cool and inventive mechanic. A little bit pricy. But a must play for any steam user.  Yes, Yes you can finally and easily 360 noscope red dudes who than explode in slo mo epic ",
            "review_score": "1"
        },
        {
            "review_text": "Super hot is a very creative first person shooter game and it's utmost intriguing to first time player. As the conversation in the game said, you can easliy indulge yourself in it for hours. To be precise, its fast pace and obvious objections are real time killers which would bewitch you for some time. I played it until the forced exit plot..........didn't expected that coming but i guess it did so for the atmosphere that    you were being controled by the game rather than contorled the game.    Of course this game is not immaculate, you got a prretty small arsenal to choose form and all you can do in the game is moving, jumping and shooting. However, this game is not some big blockbuster but a novelty for casual gamers or some of the hardcore gamers who feel a little bored by today's highly homogenous FPS shooters. As for me, I like this game and I will recommend it to my friends. And finally, best wishes to the developers who made this game!",
            "review_score": "1"
        },
        {
            "review_text": "It's fun but gets boring after ~25 minutes",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "Very original and satisfying.. makes you feel like a ninja. I see a lot of people complaining about the shortness of the story - though perhaps they do not appreciate the additional modes that unlock after you do complete it - endless mode, various challenges and the like.  Bit pricey, maybe, but yeah, maybe it doesn't represent a good value proposition for you personally.  ",
            "review_score": "1"
        },
        {
            "review_text": "Decent Game, Bullets make no sense but still. Decent time stopper. With an oddly scary aspect.  7/10  -Plot 6/10 -Graphics 5/10 -Controls 10/10 -Glitches 10/10 -Originality 10/10",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT SUPERHOT. This games is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "'It's the most innovative shooter, I played in years'",
            "review_score": "1"
        },
        {
            "review_text": "Hi everyone, you have to check out this game. It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "simple concept, good execution. short.  it's the most innovative shooter i've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT is the most innovative game I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "You will lose time. Worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Innovative first person shooter. Campaign is short, but endless mode is worthwhile.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 game told me not to launch it again",
            "review_score": "1"
        },
        {
            "review_text": "I Loved this game, blazed through the story in the first sitting.  Really hoping that the devs expand on it more, maybe some dlc's or new missions. Waiting on the motion controlls for the rift to try out the VR in this, I imagine it should get even better.",
            "review_score": "1"
        },
        {
            "review_text": "Although a little shorter than I expected it to be, this game still is well worth the pickup. More puzzle than first person shooter, SUPERHOT is by far the best use of bullet time in a game since Max Payne introduced it so many years ago.  I'm looking forward to what the developer plans to do in the future with the storyline.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a very awesome concept. The challenges are fun and difficult. The main game is short, but the challenges makes it highly replayable.",
            "review_score": "1"
        },
        {
            "review_text": "just act natural and remember, they're watching",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome",
            "review_score": "1"
        },
        {
            "review_text": "Hi [insert friends name], you have to check out this new game. It's the most innovative shooter I've played in years! SUPER HOT SUPER SUPER HOT SUPER SUPER HOT HOT SUPER HOT SUPER HOT",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: If scoring and challenges are for you, then you will love SUPERHOT, otherwise you will be sorely disappointed.  I was skeptical about this at first after seeing an abundance of negative reviews about the length of SUPERHOT, but I gave it a shot after a friend's recommendation.  This is a scoring and challenge game, which I typically find short and similar to an arcade game. The extended hours of fun come from completing the challenge levels (katana-only, fists-only, fullstop, real-time, etc.) and going for speed records (speed run challenges). You will often find games like this in the following categories: shumps/shooting games, so-called rogue likes, and indie platformers. As an aside, I saw similar negative reviews for 'House of the Dying Sun,' a tactics/space FPS game, criticizing the length, but neglecting the challenges.  SUPERHOT is graphically simple, which helps to make important things pop out (enemies, bullets, and weapons), but is stylish enough to be interesting to look at.  Sound is slowed down with time, which provides an indicator of enemies and bullets outside of your view. The glass shattering sounds are fairly satisfying as well.  Overall, I enjoy this simple yet challenging game.",
            "review_score": "1"
        },
        {
            "review_text": "Good game design, good story, but pretty easy though.",
            "review_score": "1"
        },
        {
            "review_text": "  You have to check out this game. It's the most innovative shooter I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "I love indie games and superhot is an example of what independance can produce. If there are still any questions regarding the status of video games as an art form playing this game will dispel any doubt. The controls are deceptively simple, the concepts are groundbreaking. Even if you do not manage to beat your highscore the replay in real time at the end of the levels will make you feel awesome.   For the first time I found a shooter that is not a milsim but requires every bit as much reflection, tactical acumen and cunning. I tell you,  This is the most innovative shooter I've played in years,",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years",
            "review_score": "1"
        },
        {
            "review_text": "Innovative and Simple Beat Main Story in 2 Hours Very Fun Good Mix of Turn-Based and Real Time ",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! ",
            "review_score": "1"
        },
        {
            "review_text": "This game is super hot. I loved it. It was much better than Cats. I am going to play it again and again.  For those of you complaining that the game is too short... open your eyes. There are lots of extra modes: challenge mode, endless mode, timed mode. There are also lots of goodies to enjoy in the other directories off the main menu. The campaign is just a small part of the whole game.",
            "review_score": "1"
        },
        {
            "review_text": "Such a singular experience. There really is nothing like this out there at all. It is a short experience, but I certainly think it is worth it for the price. Just know that it is a couple hours for the main campaign and decide what an awesome couple hours is worth to you. It was amazing!",
            "review_score": "1"
        },
        {
            "review_text": "  This game broke me. It took a lot of pain and rage and soul-searching to finish it.  I was actually emotionally drained by the time I finished it. Can I recommend it? I suppose, if you are a masochist. I personally had fun with it until the final levels, so I can't call it a bad game. It's safe to say I won't be playing it again, though.  That being said, it's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "such a good story guiz",
            "review_score": "1"
        },
        {
            "review_text": "Refunded at 2hours and it still lets me play if i open the exe file 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Play time/dollars ratio is really really low",
            "review_score": "-1"
        },
        {
            "review_text": "One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of us. One of Us. One of Us. One of Us. One of Us. One of Us. One of Us. One of Us.",
            "review_score": "1"
        },
        {
            "review_text": "Rather a tech demo than an actual game. The visuals are nice, but the product is overpriced and just lacking content. There are 31 levels, that roughly get you over the 2h steam refund limit, and the some kind artsy-mind-machine-what-is-reality 'story' tries so hard but finally does not deliver.",
            "review_score": "-1"
        },
        {
            "review_text": "The most innovative shooter I’ve played in years.",
            "review_score": "1"
        },
        {
            "review_text": "its alright but i kinda think that the format (like the main menu) is a bit weird and puts me off the game but other than that i think the game itself is very good",
            "review_score": "1"
        },
        {
            "review_text": "I've bought this game for 7 people I know. SUPER HOT.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastically polished game, SUPERHOT takes the prototype and does an excellent job of developing the mechanics in to a finalised product that's worth every penny.  SUPERHOT has a very simple ruleset, and equally simple (but effective) visuals to accommodate that. As a result it's always very clear what you're supposed to be doing. While it is an FPS game, the core mechanic turns it in to something much more strategy-based, especially when attempting the challenge modes.  The main criticism people have with the game is that it's too short, and that's true if you ignore all the extra content that comes after completing the story mode. If you're somebody that enjoys challenging yourself, then you'll have many hours of fun with the challenge modes, in that respect the story mode is more like a long tutorial.  My only personal gripe is that the boss character featured in the prototype didn't make an appearance, but understandably they decided to take the game in a different direction.  In short, if you like the look of this and you understand that the story mode is only a small portion of the game, then I absolutely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun and fresh but plays more like a tech demo of sorts. I'm not even going to complain about the pricing, frankly the game is not fleshed out enough to justify a purchase at all. Even on a sale. You'll play the single player, maybe dabble in some of the challenge or endless modes and then you'll realize you won't really want to play it anymore.   If you're really interested, buy it, play it for under 2 hours and return. It's definitely worth trying but don't let the cheap meta story hook you into playing past the return time limit. There's a vague, tacked on narrative here that really feels like it's in place to take advantage of your curiousity so that you'll think there's something worth playing towards but there really isn't. Nothing satisfying at least and by that point it'll probably be past the point of steam returns, so don't fall for that trap.   There's likely some community based ARG that helps unveil 'THE TRUE STORY' but I don't know. I guess if you're into that then this is for you. To me it just seems like they're deceiving customers into being okay with any kind of quality gameplay running dry after only a couple hours.   Tl;dr It's original, so it'll feel fun at first, but you'll very quickly realize it's shallow and boring.",
            "review_score": "-1"
        },
        {
            "review_text": "SUPERHOT is the most innovative shooter I've played in years and it feels like a badass puzzle game.  It runs fantastic It looks fantastic  It feels fantastic It plays fantastic  Its SUPERHOT  I highly recommend this game. Just try it or play the free website version if you are in doubt.   Disclaimer: I've Kickstarted it, so take that for what it is.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly cannot recommend SUPERHOT to more people than I can right now. There is nothing more satifiying than watching all the cool ♥♥♥♥ you did during a level in real time and getting to easily save and upload it to view over and over again. The improvements to the game with the Throwable weaponry and varied weapons add more depth to the game and once the Switch Mechanic comes into play you can do some very clever stuff.  The challenges range from enjoyable nostalgia romps to frantic perfection to pure agonising frustration and give a nice depth of post game. The endless modes can be a barrel of fun to just casually slaughter everything and overall all the little details really make the game stand out. On top of that the fact that you can give friends discount codes for the game when you beat it is a very nice touch  Personally I think that maybe £17.99 is a bit of a steep asking price and the main story being a bit short is a shame but if you have enough money to consider it I'd honestly say it's worth the experience. Overall a very solid game mechanic that innovates in it's field 8.7/10 from me.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter i've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "Obligatory line: This is the most innovative shooter I've played in years!  There, now that I've done as the game clearly orders me to (literally), I can get to the actual review.  SUPERHOT (no, I dont know why it's always capitalized, just roll with it) is basically 'Bullet Time: The Game'. The core mechanic is that time only moves when you do. When you're just turning your view around, it'll move kinda slowly, but when you're actually MOVING, it'll be real-time. But the instant you stop... back to time-stop. When combined with the fact that bullets dont move at the speed they do IRL... and are slowed down just enough that even in real-time, you can follow their path (they are still very quick though), you can watch enemy shots, and dodge out of the way, just like in the Matrix! But if that were the only mechanic this offered, it wouldnt be nearly as interesting.  Needless to say, the other core mechanic is, well, the weapons. There are only a few of these... pistol, shotgun, machinegun, katana, bat. Not much, you say? Believe me, it's enough. Learning all of the properties of these weapons is key, not just for using them yourself, but for dealing with enemies. With the game's bright, stark graphics, it's super easy to see at a glance what each enemy is carrying, and plan accordingly. But shooting and slashing isnt your only trick. You can also fling weapons or objects at enemies; hit them with one, and they'll be stunned, and their weapon will go flying... and you can grab it right out of the air, if you are in position. Then let 'em have it! Just as fun as it sounds.   That's not all though: The game's other mechanic is the HotSwitch, the ability to instantly, and from any distance, switch into the body of any enemy you can see. Did a guy with a shotgun just fire an unavoidable wall of bullets at you? Take him over before they hit. The only downside is that when you take someone over, the weapon they are holding will break; but you can bypass this by smacking them with an object so they drop it, taking them over, and then grabbing the gun that'll be hanging in the air right next to you.  Oh, and you can slash, or even SHOOT, enemy bullets out of the air.  Combine all of these things, and, well... it cant get much more awesome than this.  Be warned though: This is NOT a story-focused game. Oh, it has one, and it's interesting, but it's very short. This is more of an arcade-style score-attack game, as the meat of the game's content... and there's alot of it... is in the 'endless' mode. Dont think this makes the game not worth the cost though, because it is.  Also: This game is HARD. You're going to die. A lot. Enemies are extremely numerous, fast, aggressive, smart, and can grab weapons off of the ground. And you have to really pay attention, as they just... keep... coming. You have to constantly check the doors for the tell-tale red glow that signifies an enemy about to spawn from one (and they can act *instantly* after they spawn, so dont think you have a safe moment while they're doing so!). But this just makes all of your awesome actions even more amazing, when you're successful against them. But yeah, if you're after a challenge... you'll find it here.  Really, I cant recommend this one enough. An FPS that rewards careful, tactical play, yet still requires LOTS of real skill to do well in, with awesome mechanics that let you do ridiculously awesome moves, and never any true unfairness... really, it doesnt get much better than this. I'll be playing this one alot, myself.  Oh, and one more thing: After any run, you can view, edit, and even upload a real-time replay of everything that just happened. I honestly just never get tired of watching these.",
            "review_score": "1"
        },
        {
            "review_text": "'It's the most innovative shooter I've played in years.' A+ Highly recommended for Quake players - especially the Elevator Level (spawn inside a cramped Elevator with 3 red dudes aiming a pistol at you.....LoL) Luv the psycho games going on between levels. These devs are sick. But I liked that - maybe cuz I'm a psych major. LoL Glad that there is soooo much more to play after finishing the campaign too. Look forward to the future updates.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, but not $40 fun. Not the most innovative game I've played in years. Still fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome concept, but not worth even the discounted price. The game is just too short. Even if I had a VR set (that you **absolutely need** to enjoy this game), I wouldn't pay the full price again.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was broken on release, but, unprecedentedly, the devs actually fixed the bugs when they patched it!",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years...",
            "review_score": "1"
        },
        {
            "review_text": "Amazing little game to play on free time",
            "review_score": "1"
        },
        {
            "review_text": "12/10 the most innovative shooter i ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Although I have only played it for a little bit (4.7 hrs) I love this game and its mechanics. I would definitely recommend to a friend, although, like all games SUPERHOT may frustrate you and requires problem solving skills.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Combat is awesome and it runs so smoothly. It may look easy in the preview but there are some parts which are difficult, but thats what makes this fun! One thing I personally love is how when you complete a 'fight scene,' it replays it at regular speed and it looks like a frwaking action move! I am in love with this game. I personally think it is worth 25$. Dev's did an amazing job on this.",
            "review_score": "1"
        },
        {
            "review_text": "You have to check out this game. It's the most innovative shooter I've played in years. ",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years",
            "review_score": "1"
        },
        {
            "review_text": "Hi [Steam_Name_Here], you have to check out this game, it's the most innovative shooter I've played in years.  ok but honestly. 2 hours of main story is a little short for asking price. gameplay is amazing and feels rewarding but just too short",
            "review_score": "1"
        },
        {
            "review_text": "PROS + Very fun and satisfying gameplay. + Beautiful art style. + Interesting plot. + Plenty to do (20+ hours) after the campaign with challenges, secrets, and endless mode.  CONS - Campaign is only ~2 hours long. - Quite steep price (although worth it in my opinion).",
            "review_score": "1"
        },
        {
            "review_text": "Hi [Friend_Name_Here], you have to check out this game, it's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "Yes, the story mode in this game is short and little more gameplay-wise than an extended tutorial. However, the additional modes offer many more hours of fun with SUPERHOT's simple, yet deep mechanics. Awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "IT'S THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS.  (Maybe wait til it's on sale though, $22.49 is a bit much!)",
            "review_score": "1"
        },
        {
            "review_text": "Its the most innovative game i've played in years",
            "review_score": "1"
        },
        {
            "review_text": "'It's the most innovative shooter I've played in years'  The story is pretty short as many have pointed out however that is not where the meat of the game lies, that is in the endless/challenge modes, and of course you can replay any of the levels.  I don't generaly play a single game for that long, But I feel that I will be returning to SUPERHOT many times.  Overall I rate it 7/10 and definitely worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.  Become one of us.",
            "review_score": "1"
        },
        {
            "review_text": "Hi [STEAM USER]. you have to check out this game. It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "storyline is cringe",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. A unique one-of-kind 2 hour experience. I like how they went with it. It's worth a try. Get it on sale though, not worth the current price.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most clever and enthrallling shooters I've ever played. Super Hot had me evaluating my every move hours after emerging back into the real world.",
            "review_score": "1"
        },
        {
            "review_text": "The game is way too short. But. The gameplay is great. I think i saw JackSepticGuy play it a long time ago and that version was the same... I don't quiet get that. I have been a backer of the game but i'm a bit disapointed on the lag of gametime with the maingame.   It's a great game but there is just not enough of it.  I would only buy it on a real sale. It's not the 22,99€ worth.",
            "review_score": "1"
        },
        {
            "review_text": "Very short game but it was fun while it lasted. I had to promise the dev not to play anymore because he's watching me :/",
            "review_score": "1"
        },
        {
            "review_text": "I love the clean feeling the game achieves through it's use of only three colors. The game play is original and very satisfying. Story is not great but not the worst. It also has challenges and secrets worth your time even though I wish they had more of a reward.",
            "review_score": "1"
        },
        {
            "review_text": "I want to say first that this is a GREAT GAME with AMAZING MECHANICS. It's just way too short! I was able to beat the main story in 1.5 hours and the endless mode just wasn't enough to keep me playing. I think the price is too steep for the ammount of enjoyable content.  People really try to justify the cost with the endless mode. Yeah, some games add worth because of their replay value. This endless mode just isn't enough to keep me coming back.  Amazing game. Had a ton of fun. Beat it and refunded it. It's just too expensive for the ammount of content you get.",
            "review_score": "-1"
        },
        {
            "review_text": "SUPERHOT is the most innovative shooter I've played in years! You should play SUPERHOT! SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT",
            "review_score": "1"
        },
        {
            "review_text": "Really creative premise that still holds up after playing the hell out of the prototype. It's a little rough around the edges and a bit short, but the additional game modes that unlock down the line and overall atmosphere of the game more than make up for it in my opinion.   *SUPER HOT is the most innovative shooter I've played in years*",
            "review_score": "1"
        },
        {
            "review_text": "I love it. A little bit matrix feeling but the price is way too high.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome! i played prototype as soon as it came out. Good plot I love it!",
            "review_score": "1"
        },
        {
            "review_text": "Nice concept, fun, and some of the levels can be challenging. It's a puzzle FPS. The main campaign is short, about 2-3 hours for most people it seems, but after it’s done, some of the variations still make the game interesting and harder. There are always a multitude of ways to solve each level. After the main campaign is done, the variations become available to work your way through. Hopefully they’ll be some DLC down the road. It’s not expensive so it’s worth it overall. It is SUPERHOT.",
            "review_score": "1"
        },
        {
            "review_text": "Despite a relatively short campaign, SUPERHOT is effortlessly stylish and addicting in its core gameplay loop. With a whole host of challenge modes, and endless levels after beating the story mode, the replayability factor is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "This game is pro-american propaganda against communists. 10/10 Would love to kill somemore of those reds again",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter in years!",
            "review_score": "1"
        },
        {
            "review_text": "way too short, i liked it, but waaaay too short (finished it within refund time)",
            "review_score": "-1"
        },
        {
            "review_text": "it's the most innovative shooter I've played in years. ",
            "review_score": "1"
        },
        {
            "review_text": "Be warned if you're on a shoestring budget like me: this game will take less than an hour to finish if you're any good at it (I'm not and it took 100 minutes). It's cool, but don't throw away your GameBudget for such a short game.",
            "review_score": "1"
        },
        {
            "review_text": " A breath of fresh air for FPS.",
            "review_score": "1"
        },
        {
            "review_text": "I got a lot more out of this game than I thought I would, once I started playing I was hooked for hours. I can't stop. It's the most innovative shooter I've played in years. Send help.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I disagree with those that say that the story is too short. The challenges give the levels a fresh and interresting twist, some levels becoming much easier and some levels becoming hell. It sucks that sometimes you get shot without even noticing it.",
            "review_score": "1"
        },
        {
            "review_text": "Played the demo a while back, loved it since. Although 25$(10% off right now) might seem intimidating, it's worth the buy since you don't see a unique game everyday.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, short content and that's not a reason to buy this game if you ask me.",
            "review_score": "-1"
        },
        {
            "review_text": "The story is short, but the real value is in the many challenge and endless modes. The minimalistic, crystalline look goes well with the gameplay, making the destruction of the onslaught crunchy and satisfying.  Definitely give it a go if you're looking to pass the time with something neat, arcade-y, shooter-y, etc.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT LOOK UP GAMEPLAY. DO NOT LOOK UP A TRAILER. DO NOT READ ABOUT THIS GAME. SIMPLY PLAY AND ENJOY THE EXPERIENCE.   I can safely say its the most fun an innovative shooter ive played in years!",
            "review_score": "1"
        },
        {
            "review_text": "This game rocks.",
            "review_score": "1"
        },
        {
            "review_text": "Why is it sometimes it glitches and everything On the screen goes flashing rainbow Is this a glitch or is it Is supposed to be like that ",
            "review_score": "1"
        },
        {
            "review_text": "Great game with great game mechanic. But you have to be rage resistant to play.",
            "review_score": "1"
        },
        {
            "review_text": "Why is it sometimes it glitches and everything On the screen goes flashing rainbow Is this a glitch or is it Is supposed to be like that ",
            "review_score": "1"
        },
        {
            "review_text": "SUPER  HOT  SUPER  HOT   SUPERHOT is the most innovative shooter I've played in years  SUPER  HOT  SUPER  HOT",
            "review_score": "1"
        },
        {
            "review_text": "Great game with great game mechanic. But you have to be rage resistant to play.",
            "review_score": "1"
        },
        {
            "review_text": "After exactly 111 minutes, the game was over. Up until the end, it was pretty decent, but had some crappy scripted 'conversations' between other 'players'. The worst thing about having backed them on kickstarter is that I can't use Steam refund to get my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "ITS ONLY $11 on the Chinese store suckers xddd",
            "review_score": "1"
        },
        {
            "review_text": "SUPER  HOT  SUPER  HOT   SUPERHOT is the most innovative shooter I've played in years  SUPER  HOT  SUPER  HOT",
            "review_score": "1"
        },
        {
            "review_text": "Great game with great game mechanic. But you have to be rage resistant to play.",
            "review_score": "1"
        },
        {
            "review_text": "how to play SUPERHOT   1. Load up game 2. Start game 3. Realize that time isn't moving 4. Get excited 5. Beat first few levels easily 6. Start to fail sometimes 7. Fail alot 8. ALOT 9. Beat the story 10. Spend your days in endless mode  10/10 great game buy it now",
            "review_score": "1"
        },
        {
            "review_text": "Ok so honest review here,   The gameplay is by no means boring or not enjoyable and the idea behind the mechanics is something brand new and original that is a lot of fun to play around with the first or second time.  The only reason I'd not give a positive review about this is due to the lack of replayability and the ridicolously short amount of content, I throughly enjoyed playing with the mechanics of the game but after performing the same tasks multiple times it did get repetitive no matter how much the environment changed.  Some of you reading may not be so put off by the lack of story and may find some real enjoyment in the endless mode however I would personally recommend anyone reading to avoid this until the price has dropped more than it currently is as only 2 hours gameplay for £16.19 is pretty terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, but don't buy the Mac version. Very buggy, is always crashing even though I have twice the recomended processing power.",
            "review_score": "-1"
        },
        {
            "review_text": "A rather steep price for an extremely unique and cool game. Without saying too much, it is basically living out every action scene from a movie ever. I would recommend purchasing it at 10 dollars, but no more than that.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, just finished SUPERHOT. You need to play, it's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "Its the most innovative shooter ive played in years!",
            "review_score": "1"
        },
        {
            "review_text": "HI [FRIEND_NAME_HERE], You have to check out this game. It's the most innovative shooter i've played in years.  super HOT super HOT super HOT super HOT super HOT super HOT super HOT   But thats also what i think of the game, its super HOT (Stop repeating yourself, Dammit )  Its really original  Not too long, but it has a bunch of challenges and other things  Its, super HOT  Its worth playing Its has a simple but timeless artsyle, can't go wrong with White, red and black  It runs better with vsync on apparently (hmkayy??)  Its, super HOT",
            "review_score": "1"
        },
        {
            "review_text": "Two things you need to know about before jumping in: 1) This game is very short. I completed the story mode in 1 hr and 30 mins. It may take longer for those who are having trouble but either way, it is a short experience.  2) It's asking price is a little high for what you get. I don't think the game is worth the $22 I paid for it but if you were to pick this game up at say $15-$10, do it.   With that said, SuperHot is a very enjoyable fps that makes the player conduct each mission as if it were a puzzle. You can't approach this game like a run and gun shooter and it may take you a few deaths in order to come up with a strategy. Again, if it goes on sale pick this game up. It is a great game but not a good value.",
            "review_score": "-1"
        },
        {
            "review_text": "The key bindings on this game suck. It's 2016, who writes a game where you're stuck using WASD? There is a hidden way to remap the keys from the initial startup menu, but so far everything I've tried doesn't work. Nothing ruins the experience of playing a game with unfamiliar keybindings. That is the main reason why this game is a big thumbs down for me.",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game because, red guys. And...guns and...killing red dudes...and creepypasta-like. And awesomeness :3",
            "review_score": "1"
        },
        {
            "review_text": "Oculus Exclusivity?? The game WAS cool until you screwed over your fans.",
            "review_score": "-1"
        },
        {
            "review_text": "'One of the most innovative shooters I've played in years!' -PC Gamer  'One of the most innovative shooters I've played in years!' -IGN  'One of the most innovative shooters I've played in years!' -Kotaku  'One of the most innovative shooters I've played in years!' -Rock, Paper, Shotgun  'One of the most innovative shooters I've played in years!' -PC Gamer  'One of the most innovative shooters I've played in years!' -Polygon  'One of the most innovative shooters I've played in years!' -The Verge  'One of the most innovative shooters I've played in years!' -Gamespot  'One of the most innovative shooters I've played in years!' -Destructoid  'One of the most innovative shooters I've played in years!' -GamesRadar  One of the most innovative shooters I've played in years! ",
            "review_score": "1"
        },
        {
            "review_text": "This game is SUPER HOT!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting idea but overall not well made. AI can shoot faster than the player and randomly spawns behind him. Also way to expensive for the content. Don't buy this game if it costs you more than 5-10€",
            "review_score": "-1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "Great fun. It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "i finished the game and could still get a refund, fun but short",
            "review_score": "-1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT is the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "Way to short.  Quite a few crashes on Linux, and the mouse loses focuse going between the menu and game.",
            "review_score": "-1"
        },
        {
            "review_text": "SUPERHOT is the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT is an awesome and innovate shooter that you'll surely have a lot of fun with! The best thing about this game is its gameplay mechanics!  SUPERHOT'S story could be richer, but it has an interesting setting.  There is one major problem with the game... YOU CAN BEAT THE STORY IN UNDER 2 HOURS!!! UNDER 2 F*CKING HOURS!!!???  It does have replayability to some extent. You can try to beat the levels you've already beaten in different ways or try to have clean runs without dying and such.  I think that SUPERHOT would be an excellent game for speedrunners!  It's SUPERshort but SUPERawesome!  Is it worth its 22£ pricetag? Well it's up to you, really.  Are you looking for a game you can beat very quickly and just have fun with, then this game is for you.  But if your looking for a game with rich story, great characters, awesome graphics, in depth gameplay and so on and so forth, then this game might not be for you.  Personally, I've had a lot of fun so far, and the game has more to offer, like challanges and stuff.  I will recommend this game, but I must say I expected more content, story wise. If the developers of this game truly cares about their fans, they should work on adding more content!",
            "review_score": "1"
        },
        {
            "review_text": "2 hour story line? more like 30 minutes at most -.- for 23 dollars? wtf fun game dont get me wrong but that was the shortest game ive ever played not nearly enough content for 23 dollars",
            "review_score": "-1"
        },
        {
            "review_text": "Good concept. Addictive Gameplay and Simplistic Art Style (if that's your thing). But nowhere near enough content for the asking price, completed the main campaign in a matter of an hour and the other modes are simply just horde mode and challenges, nothing to keep me coming back.   I can only hope we get a lot more levels and possibly a level editor.",
            "review_score": "-1"
        },
        {
            "review_text": "[INSERT FRIEND NAME HERE] THIS IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS",
            "review_score": "1"
        },
        {
            "review_text": "Fun gameplay. Reidiculous story padding that won't even let you skip. You get stuck in the dumbest fake ol timey interface with inane chat. This team wasted whatever time they put into the metagame. Which is not a metagame. Just a bunch of forced waiting while hitting random keys. WHICH YOU CAN'T SKIP. = (  I cannot reitrate enough how annoying the frame story is. . . it's like they were trying to be dumb.  I cannot recommend this fun but entirely padded game at this price.",
            "review_score": "-1"
        },
        {
            "review_text": "really good game, altough I don't think its one of those games you play for years without getting bored. so 8/10 good game",
            "review_score": "1"
        },
        {
            "review_text": "Superhot is one the best shooters ive played in a really long time. I wish it was longer thought.",
            "review_score": "1"
        },
        {
            "review_text": "It's really enjoyable, but you're only going to get a few hours out of the campaign. The rest of the challenges and achievements will take many more hours to make the cost worth it so I recommend a sale if you're only interested in playing through the game once.",
            "review_score": "1"
        },
        {
            "review_text": "I don't recommend this game, it's short and boring.",
            "review_score": "-1"
        },
        {
            "review_text": "The most innovative game i've ever played",
            "review_score": "1"
        },
        {
            "review_text": "Storyline is very gripping and scary, and the game is a lot of fun to play. It's one of the most innovative shooters I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "Superhot is the most innovative fps I have played in years, and is well worth the price. The gameplay and story are fantastic with more content available and to come. SUPER. HOT.",
            "review_score": "1"
        },
        {
            "review_text": "The fact that these guys were looking for a story driven first person shooter called 'SUPER HOT' is their own damn fault. Buy this ♥♥♥♥ing game if you want mindless hours of fun. 10/10 ♥♥♥♥ stories",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME IS REALY GOOD dont get me wrong but when I quit and then waned to play again it give me an good BLEACK SCREAN-O this is the point were I give up I tryto find a sulucion to the probrem but nope its gone if you dont whana risk 23 buckz then dont buy it becose... there is no sulucion.",
            "review_score": "-1"
        },
        {
            "review_text": "It's the most innovative shooter in years!",
            "review_score": "1"
        },
        {
            "review_text": "i really thought i was going to like this game but i was wrong.  I watched play throughs and I thought I would like it but it was just hard to keep playing after a while. The story isn't well done because if you make the villain to dislikble there is more hate then enjoyment. Interesting concept for a game but game play isn't very entertaining. It cost to much and the only reason i got this is because i crafted a 50% off coupon. I think this was a waste of my money.",
            "review_score": "-1"
        },
        {
            "review_text": "Really I think people are missing the point here. Sure, the initial game is like 2 hours long, but it's a big mistake to think that completing the story means you've seen everything, it's far from it. That was only your initiation. The rest of the content you unlock after offers much more and is a lot of fun, not to mention all the secrets that both show off some... I'll call it interesting scenery, and flesh out what exactly is going on just a bit.   At the end of the day though, it's still the gameplay and stunning art style that keeps it together, I'll still stop sometimes just to watch a red guy's head explode into beautiful little shards. Buy it on sale if you're skeptical, but you have to play it. It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "It's The Most Innovative Shooter I've Played In Years.",
            "review_score": "1"
        },
        {
            "review_text": "It's The Most Innovative Shooter I've Played In Years.",
            "review_score": "1"
        },
        {
            "review_text": "Most innovative shooter I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, it just has too little content in my opinion to justify a $25 price tag. I bought it on sale at about $22. I don't regret it, but someone else might.  I have faith that they will add at least a little more content. I would actually like to see more plot. The plot has been called predictable by other reviewers, but for me, it was just interesting enough to genuinely make me want more. And then it ends. Which sucks.  Buy it. Right now I would advise waiting for a sale, but, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "Well, I've clocked a whole day in it. Don't regret it. SUPER HOT",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "Should have been $10. Even on sale at $20 it's not worth it. Only 2 hours worth of content that gets boring after the first few mission. Only get it when it's $10 on EXTREME sale. Refunding right now.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the annoyingly brilliant games ever! Requires some skill to complete all levels and story line is awesome and addictive! Amazing ways to kill the enemies too! Must buy!",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely amazing game. Unique mechanics combined with... with... alright it's the unique mechanics.  It's a lot of fun, it feels like a cross between a shooter w/ travel (i.e. Battlefield instead of COD where the bullets and projectiles have travel time) and a puzzle game/bullet hell. It's engaging and just hard enough to challenge yet not hard enough for me to rage since, even if I die, I ♥♥♥♥ing died in fashion and a blaze of glory! The gameplay is utterly satisfying, especially the killcam at the end when you can see your entire spree of murder! It's awe-inspiring how 10 minutes of meticulous planning and work ends up being a mere 10-12 seconds 'IRL'.  Graphics: It's own geometry style graphics. Nothing to write home about it's very minimalistic so I'll say this is a neutral whether it is a pro or con. You decide. For me I felt it was perfect simply due to the fact that your enemies crumble into pieces before you in a way 'real world' like graphics can't convey. For me this was slightly positive but I can understand if such a simple graphical style isn't to your liking.  Gameplay: Mostly positive as I've stated. What would I change? More weapon variety in my opinion. With a game that literally slows time to a crawl, different guns with miniscule differences would feel completely different and completely change how you go about beating a mission. Touch up the killcams at the end. The animations feel too... flitty since they were designed for bullet-time I feel like the camera at the end sometimes does not feel as epic as it could. A small complaint since it still feels fricken awesome!  Story: Simple story, nothing to write home about but it is captivating. It is only 2-3 hours long, shorter if you're actually good at the game unlike me. Is this a con? To many, yes. To me? Not so much... I didn't care about the story all too much, I just wanted to kill people in bullet-time with a computer monitor and coffee mugs. The story detracted me from these awesome moments. I just wanted to go from corpse to corpse, gun to gun, coffee mug to katana. I was relieved, personally, when I reached the end and unlocked challenges and endless mode. THAT's what I wanted to play.  Price: It's 20 some dollars for a unique, fun experience. I think it's worth it. I've gotten more enjoyment so far (only 2 or 3 hours in so far) than I have from many 60 dollar titles.  ♥♥♥♥ I love this game...",
            "review_score": "1"
        },
        {
            "review_text": "Campaign was great and was short enough to get a refund. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE this game, It's perfect! Only downside is that it's a bit too short, I'd LOOVE to see more in the future!",
            "review_score": "1"
        },
        {
            "review_text": "(Disclaimer, I backed this on Kickstarter).  There's more than enough out there to explain what the premise of Superhot is, I don't think it needs to be reiterated, beyond the fact that it seems like such a simple idea but that no one had doen before.   Superhot basically delivered what I expected and more, but importantly without staying too long to become annoying. (There's a bit of intentional lack of situational awareness that was getting to me in the last few stages and getting annoying, but far from impossible). Some might complain about the length/price, but I do think they have been clear they were looking for something along the length of Portal for the full game, and in that I believe they delivered.  The addition of Endless and Challenge mode (exactly as they sound) is a great way to get added content. The only additional aspect that would be nice to see is eventual Workshop support to drop in user-created levels, but the game does not suffer at all without this.  So I strongly recommend the game, even if you are going to wait for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutley love this game.  Pros: Insanely Unique Lots of Challenges Great Level Design Loads of Fun You feel like a Ninja all the time Matrix-Style Bullet Dodging Graphics are Unique and Interesting You can CUT BULLETS IN HALF with a SWORD. Interesting Story (but kinda cheesy. I still really like it)  Cons: Not a lot of levels Main Story is short NO LEVEL EDITOR. This game desperately needs a community level editor.  Sometimes bullet-dodging isn't clear whether or not you're going to get hit. Arguably not a whole lot of replayability (unless you do Challenges)   Overall, I can say this game is worth the money, atleast to me.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would play 48 minutes of menus again",
            "review_score": "1"
        },
        {
            "review_text": "So, after a few years in development, SUPERHOT finally graces our steam libraries. But is it any good?   Perhaps not.   It most certainly is.   Story  Odd of me to start with the story for a game that doesn't seem to have any story in it, at first, then it starts having a story and becomes   unsettingly meta   a tale about our existence and how fragile our weak, pitiful bodies are and   it really isn't all that great to be honest, just merely an excuse plot to shoot red dudes in the face   SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT.    It also tries to be meta but ends up playing it too much. I was irritated by it in the end when it got blatantly meta.   SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT  TL;DR -   Nothing much to write home about.   SUPER HOT SUPER HOT SUPER HOT   Gameplay  It's a first person shooter that plays like a puzzle. What's the best way to deal with a bunch of red dudes hellbent on killing you? The methods vary from level to level, whether that be shooting them in the face with a pistol, blowing them away with a shotgun, or just punching them in the face. Time moves when you move, the game will boldly state, which is true, time does move when you do, and standing still causes time to move very slowly, looking around causes the game to speed up a little, and moving accelerates the game full-force. You have these tools and the weapons scattered about each map to solve the puzzle which culminates in 'kill all the red dudes and you win'.    Later on, you get the ability to swap bodies at will, like a ghost.   I find the gameplay to be an interesting concept. And it does tend to get needlessly difficult at times and moments where you'll die instantly if you don't move as soon as possible can be frustrating, it's best to carry some patience with you, it's not Super Meat Boy levels of frustration but it can be frustrating at some parts.    Unfortunately, the game doesn't carry itself very well when you complete the game, unlocking endless mode and challenges, playing those will only get you so far. It's a neat little timewaster though.    TL;DR - TIME. MOVES. WHEN. YOU. MOVE. That's the gimmick and it does it well, you can throw, punch, jump, shoot, anything to kill the red dudes. Frustrating at times.   Graphics  Simplistic. The geometry is all white with some exceptions of black being used to mark out objects that can be picked up. Enemies (and yourself) are red and look like something from a wireframe. It works, though, for the most part, you are in a   simulation of sorts   SUPER HOT immersive innovative video game.  TL;DR - Simplistic, but it works.   Sound/Music  There really isn't all that much in this game to be honest when it comes to sound and music, music, when it comes up, is okay at best, and you're not going to hear much sound from the game outside of the computer interface and, in-game, the shooting and glass breaking.  TL;DR - Not much to write home about.   Ending Statement  SUPERHOT is, as they say, an innovative shooter, it's   not   THE most innovative shooter I've played but it certainly carries some interesting gimmicks. Purely good as a timewaster but the price tag might be a bit much for what's in it.  In the end, I'm going to  recommend  this game but  preferably get it during a sale or with a severe discount .",
            "review_score": "1"
        },
        {
            "review_text": "Punch someone in the face, steal his pistol then shoot him with it then toss it at some scumbag creeping on me. Steal his shotgun and kill two other people with it, throw the shotgun at the guy I took it off then punch him in the face twice. Slow-mo jump through the air punch some katana weilding ♥♥♥♥♥♥ and cut him in half with his own sword, throw it and get a double kill. PRESS F5 FOR REPLAY.  SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT",
            "review_score": "1"
        },
        {
            "review_text": "Game told me to leave and never come back. 10/10 won't play again",
            "review_score": "1"
        },
        {
            "review_text": "It’s The Most Innovative Shooter I’ve Played In Years",
            "review_score": "1"
        },
        {
            "review_text": "Opinion, ahoy!  I felt that the story was too self-aware.  Replay doesn't run in realtime (which is odd), and the animations are really poor. Reason why I played the prototype over and over was that it didn't have the replay function - the imagination filled in how badass everything must've looked. Seeing your badass run go at x0.8 speed with poor animations devalues the cool factor it otherwise would've had. Replay definitely lacks design. Shame you can't turn it off.  After beating the story, I don't feel like coming back into the game week after week. Did do a few challenges initially, but doing more doesn't feel fun. Not even for a couple of minutes.  Could it be because the game makes me self-aware that I am playing the game within a game? It's too meta for my taste.",
            "review_score": "-1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!   Besides that propaganda, this game was definetly progressed over the years, from when the beta was first released, and now. They added so much stuff, weapons, new mechanics, and even a story. I enjoyed this game a lot. Even though the story took me about an hour to beat, after you beat it, you unlock challenge mode and endless mode. So there's still stuff to do.  ♥♥♥♥ing loved this game, holy ♥♥♥♥. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Game will not start at all. 'SUPERHOT Launcher has stopped working' everytime. I try to verify the game files and I'm always missing one.",
            "review_score": "-1"
        },
        {
            "review_text": "Superhot is the most innovative shooter ive played in years!",
            "review_score": "1"
        },
        {
            "review_text": "Gotta play this game guys. It's The Most Innovative Shooter I've Played In Years.",
            "review_score": "1"
        },
        {
            "review_text": "Mind-bendingly fun. I need to take a nap.",
            "review_score": "1"
        },
        {
            "review_text": "Superhot provides innovative and simplistic FPS gameplay that is enjoyable if not eventually tiresome. A joy to explore, I really enjoyed each maze of parkour and cache of hidden secrets in each level. The devs are the most involved out of any game I have seen, but it is a little pricy for its length.",
            "review_score": "1"
        },
        {
            "review_text": "Challenging yet fun. Very Strategic with an interesting storyline",
            "review_score": "1"
        },
        {
            "review_text": "Hi [FRIEND_NAME_HERE]. you have to check out this game. It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "SUPER HOT! SUPER HOT! This game alone is the reason i made a steam account, so worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Story: 5/10 - There wasn't much of a story in this game, it wasn't enough to want me to keep playing, the only thing doing that was the concept and gameplay.  Graphics 8/10 - The graphics were great and complimented the futuristic matric-like world.  Gameplay 5/10 - Gameplay was good, however repetitive and it got very difficult at one point and still haven't been able to get past that level.  Sound 6/10 - The sound effects in this game were decent, nothing too special but good.  Overall 24/40 - DECENT",
            "review_score": "1"
        },
        {
            "review_text": "The mechanics are very well done and its super satisfying. The slomo killing and interaction with the environment along with an interesting story line made it worth the wait and price.  It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "For how much they ask it's 100% not worth it. They get a cool concept, make about 10 levels and jam a bs narrative down your throat to make it seem like actual work went into it. Probably not enough content to make it worth downloading even if it was free imo.",
            "review_score": "-1"
        },
        {
            "review_text": "its so frusturating that i almost broke mt headphones! uninstalled it and i want a reefund.",
            "review_score": "-1"
        },
        {
            "review_text": "I was in two minds about whether to recommend this game or not, the idea adds a new dimension to the standard FPS which is quite innovative, its just a shame that is where the innovation ends. I really enjoyed the core mechanic of this game, but it feels like it was a game built around that mechanic only, everything else felt slapped together and when I completed the game after 2 hours of play time I did not feel the least bit enticed to return and complete any extra challenges, content in the knowledge I had killed polygonal reds every which was possible.  The story, is quite short, and sparse and has very little immersion, so when they pull the 'the machine is in control' trope it feels more like a meta-wank than actual contextual plot. In the end it felt more like a series of disconnected combat scenarios with some annoying intrusions whilst the story tries to force its way in. Pantomiming multiple text based chats that really did not require anything from the player felt really empty, and became yet another way the game was building up walls at the same time trying to tell you those walls were not there, it would have been far more surreal/cool/immersive to give us a little control before taking it away.   What was funny is that there were four people credited with the writing and story, so I guess anyone who farted in the close proximity of the monkey that wrote the script was also noted as adding 'something' to the story. In the end I felt like more could of been done with this story and gameplay wise, make us think, dont treat gamers like idiots, put a blue guy in there and make us consider what we are doing and our questionable reality.",
            "review_score": "-1"
        },
        {
            "review_text": "TBH// This game was OVERhyped, I fell in love with the short but meaningful story, but the game wasn't like the trailers (much like most games) but I really had a good feeling about it. Sometimes the game can be hard. ( 7.8/10 ) *too much slow motion*",
            "review_score": "1"
        },
        {
            "review_text": "ITS THE MOST INNOVATIVE SHOOTER IVE PLAYED IN YEARS",
            "review_score": "1"
        },
        {
            "review_text": "It will be fun and worth its price ONLY if you're one of the minority of gamers: a really, I mean really hardcore player, both a completionist by nature, and a lover of hardest difficulty by nature, because then you'll have a ton of replayability after finishing the story — you can complete challenges, which perfectly justify their name and are not simply called 'challenges' to create an illusion of achievement, and also you can just relax by playing the endless mode, but other than that, there's literally nothing else to this game. Okay, there are easter eggs both in the game and in the menu, but easter eggs are part of every game — there's no credit due here. My main complaint is the story, and although it is pretty good, it is too short for my liking — I'm a fan of immersion and video game storytelling, especially from a first-person view, it is my most favorite thing in the world. I would not have been so disappointed if the story was just arbitrary, if it was there just for the sake of it being there, but as I said — it is pretty good, or at least decent if you have extremely high standards, so it's twice as shameful that it's short. Also, I'd just like to warn people who have at least some understanding of how physics work — don't expect realistic physics. And I'm not talking about the whole time-stop mechanic, I'm talking about weapons flying who knows where for no reason, weapons going through a red dude or being stuck between his arms although you certainly threw them right at his face from a distance of an extended hand and couldn't have missed if you were blind, weapons or enemies moving out of your reticule at the exact moment you pressed the left mouse button, somehow, which most of the time will result in you hitting a red dude instead of picking a weapon (despite the fact that reticule clearly showed an icon of picking up a weapon) — it's all out just an awful mess. It tries to come off as realistic despite the visuals and the story, but it fails miserably. Physics of this game have been a reason for many hits of my hand upon a table. I fear that I may have broken a bone in this rage.",
            "review_score": "-1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "Pulls gun on me at a bar. I pick up a martini glass, throw it at his face. Catch the gun in mid-air and shoot him with it.   My name is Hot, SuperHot   10,9/10",
            "review_score": "1"
        },
        {
            "review_text": "It's The Most Innovative Shooter I've Played In Years.",
            "review_score": "1"
        },
        {
            "review_text": "I loved the demo when I played it. It seemed like a surefire hit, as long as there was enough content to justify the price. Unfortunately, there's not. Even if there was, the game can be completely trivialized by jumping and airstrafing. Not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I’VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the best invovative shooter I've played!! :)",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "First off, this game has an AMAZING story. I absolutely LOVE the way it's told, and I never liked a game for its story. Until now.  This game also reminded me of Mirror's Edge, so if you want more of this, check Mirror's Edge out. I guess this game is sort of a mix between Deadpool and the Matrix, which is an amazing combo.   One more thing: Notice that I haven't written a review for ANY game but this one. I really think this game is special and innovative.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "Addicting game. Story is short but cleverly put together. The unlocked gamemodes after completing the story is where things actually get interesting. Watching your combo playback after a death in Endless mode makes you feel like Neo, and constantly trying to beat your best score, while also trying to pull off cool moves.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT is the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "So good! The gameplay is polished, the presentation is stylish, the story is just perfect and the extras are bound to fill your heart with joy if you are in hacker culture. There is no other way to say it:  SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! ",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "this game is good but i am experiencing a minor glitch when my game will turn on but then the screen stays black but otherwise this game is good",
            "review_score": "1"
        },
        {
            "review_text": "Hi [your_name_here]. you have to check out this game. It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing",
            "review_score": "1"
        },
        {
            "review_text": "I recommend the crap out of this game.  You so this 'slow motion' thing while you play the game and you get a fast video. If you play you'll understand what I mean right away.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, something so simple can be so in depth and replayable, if you are a fan of puzzle games this is a great game for you. Also has an amazing menu system 7/10 too much water.",
            "review_score": "1"
        },
        {
            "review_text": "Superhot!   It's The Most Innovative Shooter I've Seen In Years!  I am totally in love with the concept, it's not a game like any other.  You just have to play it by yourself.   It's challenging, has a very unique look, a very interesting and sometimes even scary concept.  WOW!   Game's already out, still in the middle of the hype-train! Choo-choo!",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "Some people are complaining about it being short but let me asure you that theres a lot of more fun being unlocked after completing the campaign.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun. I got what I was expecting. I am not giving a pass for the short content, it is definitely short. But I'm of the mindset that 2 or so hours is fine. This game isn't skyrim, I wasn't expecting to explore open worlds. People complain when a $20 game is 2 hours long, but a $15 movie ticket to see a 1.5 hr movie is okay? Adding on to that, you rarely get anything after a movie, whereas you have plenty more game modes to do here. I don't know, maybe I'm strange. It's short, it's fun, it's innovative. Don't go in expecting hours and hours of gameplay and you'll love it. It was also very frustrating at times but in a good way.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooters I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "This game has a great consept and it has a lot for the price it holds. There are tons of challenges after you complete the main game, which by the way has a great storyline. I think its worth your money, and time.",
            "review_score": "1"
        },
        {
            "review_text": "A game where time moves only when you do and where red guys want you dead for reasons you can't concieve. It's a pretty cool FPS concept, but $30 may be a bit steep for some at this juncture. The devs do intend on adding more content and it's a damn fine game regardless.   In short, it's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game. I have to say It's the most innovative shooter I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "This is the most innovative game I have played in years.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "Superhot is the most innovative shooter I've played in years.  More of a puzzle FPS than a straight shooter in a lot of ways. Absolutely beautiful. Lots of gameplay if you're into challenge modes (e.g. paly the whole campaign again but with only katanas, or only one-hit punchs, etc.)",
            "review_score": "1"
        },
        {
            "review_text": "Hi [your_name_here]. You have to check out this game. It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter i've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "The campaign may be short, but the gameplay is what you want. There's LOTS more game than just the campaign, and the reviews calling it too short obviously missed all the endless modes and challenges along with the all the hidden extras.  It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "Great game just play it.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!                        MIND IS SOFTWARE  BODIES ARE DISPOSABLE  THE SYSTEM WILL SET ME FREE",
            "review_score": "1"
        },
        {
            "review_text": "It’s the most innovative shooter I’ve played in years.",
            "review_score": "1"
        },
        {
            "review_text": "IT'S THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS.",
            "review_score": "1"
        },
        {
            "review_text": "crashes constantly on Linux, but still a kool game",
            "review_score": "1"
        },
        {
            "review_text": "Short Story, but so good. It's the most innovative shooter I've played in years. It lets you put thought into your shots not just spray and pray",
            "review_score": "1"
        },
        {
            "review_text": "MOST INNOVATIVE GAME I'VE PLAYED IN AGES. PLAY IT, IT'S WELL WORTH THE PRICE OF ADMISSION",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter i've played in years",
            "review_score": "1"
        },
        {
            "review_text": "have you heard of superhot,'its the most innovative shooter ive played in years'",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "SUPER HOT  The most innovative shooter I've played in years. It's a great original concept combined with great visuals and gameplay that makes you feel kickass when you succeed. That's really all that should be said as there is a bunch of really cool deeper stuff that everyone should discover for themselves. It's early in the year, but so far GOTY 2016. What a superhot surprise!  Do note the game is somewhat short, so wait for a sale if the 20€ pricepoint is too much for a 2-3 hour main story. It does have some additional content like challenges to check out after though.  SUPER HOT",
            "review_score": "1"
        },
        {
            "review_text": "THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS",
            "review_score": "1"
        },
        {
            "review_text": "While being a little bit pricey, I have not had this much fun with a game for a long long time. The 3 hour storyline is short but mind bendingly fun and the challenges and endless modes offer a ♥♥♥♥ton of replayability. If you watch the trailer and think 'This looks pretty fun' then you will not be dissapointed. And if you wait for a 50+% sale, its an absolute steal.  It's the most innovative shooter i've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!   ",
            "review_score": "1"
        },
        {
            "review_text": "The most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely innovative, also at ♥♥♥ it's only 15 euro",
            "review_score": "1"
        },
        {
            "review_text": "I recommend SUPERHOT to everyone of my friends, it's the most innovative shooter I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "Seriously, this is the most innovative shooter i have played in years. Under most circumstancances Half Life 2 is considered the crowning jewl of innovative FPSs but this game definatly takes it from a diffrent perspective. Perhaps i am getting off topic, Superhot has a lot of really good ideas. Every level is almost like a puzzle, you have to learn what to do and when to do it. Rarely can you win a level by simply going in without thinking. However, this is not simply a puzzle game, it is an extreamly cinimatic shooter. Opening levels can seem simplistic but by the end the levels are large and full of possabliities for epic shoot outs. This review may seem light on details but honestly it's hard to describe what makes this game so great, it just feels right.",
            "review_score": "1"
        },
        {
            "review_text": "Game is SUPER HOT. If you think it's too expensive, remember that it's all about levels and you have plenty of them after main SUPER HOT story. I will gladly support devs and hope more in the future.  SUPER HOT SUPER HOT SUPER HOT   :-D",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT was born of a game-jam, and much of the focus and simplicity that comes with time constraints has carried over to this commercial reimagining. The game is streamlined, focusing on its one major mechanic (time effectively stops when you stop) over a variety of increasingly difficult levels. Its distinct graphical aesthetic and endearingly DOS-like user interface make the game instantly recognisable and memorable.  It's only a shame then that, for the price, SUPERHOT doesn't contain much content. The campaign can be completed in 2 hours easily and while the additional gamemode mutators are interesting, they don't really make up the price.  SUPERHOT would've really benefited from a level editor and some way to share them amongst the community (Steam Workshop?)  The game itself is great, and I recommend it - but if you're tight on cash maybe wait for a price drop.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT. Title. Description. Sensation. This game fills a niche in my escapeworld I didn't realize was missing. I'm not even sure what that niche is yet. Nor if it was permenat. But it was well worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "'it's the most innovative shooter i've played in years'",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years",
            "review_score": "1"
        },
        {
            "review_text": "Best singleplayer fps I have ever played. 10/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "Fun for ppl who like the matrix but overprised. (7/10)",
            "review_score": "1"
        },
        {
            "review_text": "Got a Katana and cut a bullet in half!  11/10 I would recommend!",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing and compelling.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!   SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT",
            "review_score": "1"
        },
        {
            "review_text": "'It's the most innovative shooter I've played in years.'  (even if it was a little pricey)",
            "review_score": "1"
        },
        {
            "review_text": "The most inovative shoot I have played in years!  10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Hi 'INSERT NAME HERE', you have to check out this game. its the most innovative shooter i've played in years. ",
            "review_score": "1"
        },
        {
            "review_text": "THE MOST INNOVATIVE FIRST PERSON SHOOTER EVER.",
            "review_score": "1"
        },
        {
            "review_text": "worth the wait",
            "review_score": "1"
        },
        {
            "review_text": "This Is the most innovative shooter I've ever played. Buy this game friends",
            "review_score": "1"
        },
        {
            "review_text": "Hello there fellow Review Reader, you have to check out this game. It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "I strongly believe that this game has already been worth my money and that anyone on the fence should get it",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "It's The Most Innovative Shooter I've Seen In Years",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this game, It's full of glitches.",
            "review_score": "1"
        },
        {
            "review_text": "It is the most innovative shooter I have played in years.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "Entertaining and unique puzzle game. My main gripes: The main game is rather short and the story is only so-so. Also, the game loves to crash on my Mac. Luckily it only takes a few seconds to get back online.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT is the most innovative shooter game I have played in years",
            "review_score": "1"
        },
        {
            "review_text": "its the most innovative shooter i have played in years ;)  sick game if you have a little spare cash its well worth buying !! 10/10 LOVED IT",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "The most innovative shooter I've played in years!   Because the word has to be spread ",
            "review_score": "1"
        },
        {
            "review_text": "it's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!  It's a fun game. Expensive for what it offers.",
            "review_score": "1"
        },
        {
            "review_text": "You might think there is no story in this game. But you're wrong. There is a story. An amazing one. It's the most innovative shooter I've played in years.   --------------------MY BODY IS HOLDING MY MIND BACK--------------------",
            "review_score": "1"
        },
        {
            "review_text": "Hello, Steam Review Reader. SUPERHOT Is Innovative Shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!  ",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot of people that are upset because there's only a two hour storyline, and then there's challenge modes/endless mode and I don't think they've played through them. I definitely preordered this game and I was so satisfied to have done it because now I can put down Rocket League for a while.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "You should buy this game even only for the ending. I think that's the best game ending EVER! EPIC!",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter ive played in years.  Buy the game to find out why everyones saying that. ",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing!! If you have ever wondered what it feels like to be neo from the Matrix, or Sherlock Holmes (the Robert Down Jr. Version ((you know the one that slows down time and calculates his kill?)) then this is your game!!",
            "review_score": "1"
        },
        {
            "review_text": "Very very good game, only downside being it's a little on the pricy side content wise.  If it was around £10 it would be pretty much perfect quality / price.  If you're thinking about buying it you should, it's definatly worth a try!  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Punched someone and killed them with their own gun. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "People: I only spent 1 hour on this! What a ripoff!  Me: I've spent 5 hours on the game and I still havn't finished it.   I have no idea if it's me, my crappy laptop (yes. LAPTOP), or it's just that some people are GODS.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!  ",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "Would be alot better if it was updated more or given more dlcs or just something to add to the game",
            "review_score": "1"
        },
        {
            "review_text": "superhot is the most innovative game shooter i played in years! ",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "9\\10",
            "review_score": "1"
        },
        {
            "review_text": "Good game but the price is a bit steep. Get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Thsi is the most innovative shooter I have ever come across! 5 stars any day!",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "Super cool",
            "review_score": "1"
        },
        {
            "review_text": "Promised the system I wouldn't launch SUPERHOT.EXE again. Didn't.   10/10  It's the most innovative shooter I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "The only way to make this game better would be to let eveyone make levels",
            "review_score": "1"
        },
        {
            "review_text": "It's a very well crafted game and you can tell lots of time was put into it, I like its 3 colour design.  Personally shooting red guys was fine for me, I get the storyline but it seems kind of forced and as if they were put on the spot to make it up.  It is clearly made for VR headsets but I dont have one and still enjoyed it.  The fight at then end is a ♥♥♥♥♥ and really hard but other than that it is pretty easy.  But i finished the game in about 2 hours without rushing so it doesnt take too long to finish at the current moment.  Overall:   Nice Mechanics Nice Graphics Ok Story (kind of forced) Quite an easy game Hard final boss fight Very Short  I would still recommend this though 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is unique in ways that are so tempting to describe but I'm not going to because it would ruin the experience, makes me wish i had a VR setup when i first played it",
            "review_score": "1"
        },
        {
            "review_text": "if i tell you why this is so good i would ruin it.  but the gameplay is awesome",
            "review_score": "1"
        },
        {
            "review_text": "Even though I was not able to get into the good stuff (the 20 second challenges I've heard about), I really enjoyed my time with the game. I love the minimalist design and the way that everything just feels fluid.   Note to normal FPS players: Moving fast is not always the best idea. You get killed A LOT that way.  Despite my not overall liking the game, I can definitely recommend it to those who like the idea of being the action hero.   The elevator pitch: 'Action Movie Star Simulator'.",
            "review_score": "1"
        },
        {
            "review_text": "Haven't played too much of but I would have to commend the developers on their efforts. I bought and downloaded this game and it hanged every time I tried loading up the first level. I tried restarting, checking integrity, messing around with video settings, dicking around with Radeon settings. Then lo and behold a patch comes in, same day of release mind you, that fixes my problem. ten-outa-ten.",
            "review_score": "1"
        },
        {
            "review_text": "I love love love the game! The most innovative shooter I've played in years!  The only thing I can say against this is the price. I'm glad I stepped out to be a beta backer as I got it for cheaper. However, I wish the game's life was a bit longer, as with everyone else. $25USD is really expensive for a game I beat in 2-3 hours and then will occasionally pick up Endless or something. I wish it went a bit deeper into the story. They could've explored the origins of things. I'm no writer, but like everyone has said, content was short.  tl;dr I recommend the game, not the price.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished playing, no words can describe how i feel right now wow... jaw dropping",
            "review_score": "1"
        },
        {
            "review_text": "Super Hot has a intresting mechanics. the Time moves only when you do, allows the player to pull off coll things, such as thro your pistol up into the air, grab a shot gun, blow someone into peices with the shotgun, throw the shotgun at some one else, grab your pistol from the air, and then shot the guy you threw your shotgun at. It is realy fun, however, i beat the campain in less than a day. the challenges and endless mode will keep me buisy for a while, however. i want something more, I want to be able to compare my time in the challenges to my friends time. that would make the game a bit more fun. to see who ahs the best time or score on a level, or who has the best time. or the most headshots. Rating, 8/10 worth getting, however, at most maybe $10-$15, not any more.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT is the most innovative shooter I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "pretty good tbh",
            "review_score": "1"
        },
        {
            "review_text": "It's a really cool and unique game, but I'd wait for it to go on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Really now, this game made me feel like just as trapped as animé Serial Experiments Lain did. Awesome atmosphere, excelent way of telling a story, it got what it needs at just the right dose.  FPSly speaking, yes, the game delivers. Fun way of giving a renewed chance to 'chain effect' games.  OBEY It’s The Most Innovative Shooter I’ve Played In Years",
            "review_score": "1"
        },
        {
            "review_text": "Short but stellar story mode. Endless, Challenges and High Scores make this game very replayable.   I wish there was an alternate ending -- an option to rebel.  ",
            "review_score": "1"
        },
        {
            "review_text": "Game threatened me not to play it anymore. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever created by humankind das far. 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "This game is just about flawless. You're given a really unique, cool, but easy to understand concept, and the game just goes with it. You make a hectic, spur-of-the-moment action scene, but you're doing it so deliberately, and the game rewards you for planning, being fast, and playing smart rather than pure mechanical skill. Tight controls, satisfying AI, good level design, the graphic design and user interfaces are unique and really work. The story is the type that can only be told within a video game, and for a game about killing red dudes it's actually pretty good, especially because it has tiny amounts of narrative and dialogue. Plus the challenges and endless modes are where you'll get a lot of mileage from.  It's a game I haven't really seen since Hotline Miami. Here is a level full of dudes and weapons, you and the dudes die in one hit, go nuts. You have a similar action flow (knock Dude 1 down, steal his gun, shoot Dude 2, throw gun to stun Dude 3, steal Dude 3's katana, chop up Dude 1 before he even stood up, throw katana at Dude 3, hotswitch into Dude 3, grab katana midair, impale Dude 4 with aimed katana throw), but unlike Hotline Miami the game makes it feel so natural, planned out, and deliberate until you watch the last minute-and-a-half of action compressed into ten real-time seconds of straight up dude killin'. It's good, it's really good, it feels satisfying to pull off, and it looks impressive too. Most of your deaths and failures are preventable with proper time/resource management, not like Hotline Miami where your deaths are funky hitreg or not being able to see a gunman a mile away.   I can easily see this game on a bunch of GOTY lists, but at $25 I don't think it's worth it. At least, not for everyone. If this game was $10-15 I'd heartily recommend it, but when there are other titles on Steam that are just as (if not more) innovative and unique, for half the price, and with more content. The gameplay's solid like you wouldn't believe, but I beat the campaign in an hour and a half, and the challenge/endless modes are just alterations on levels in the campaign. Only one enemy type, 3 guns, 2 types of melees, so far no promises on adding extra content, developer or usermade. Can the gameplay support the price? I think so, but I don't think most people can agree.  I suggest buying it on sale. At worst, you can buy the game, beat the campaign, and refund it and still be ~20 minutes under the time requirement to return it.",
            "review_score": "1"
        },
        {
            "review_text": "Love the game.",
            "review_score": "1"
        },
        {
            "review_text": "I've spent way too much time playing Tree Dude",
            "review_score": "1"
        },
        {
            "review_text": "The game is awesome. I haven't have such fun with a game for a long time. I have constant smile on my face when some elaborate combo works and there is no more red guys :) The game is 1000% worth the price. You have the story mode which is fun to play and yes is not long. I think is ok for a game of this sort. And there is endless mode and the challenges ... and only katana mode ... ONLY KATANA. Definitely buy this game now and play it. It's ton of fun. Runs pretty well. My config is: GTX 770 2gb i5 4590 16gb ram win 10 pro the latest build.  The game is capped at 60FPS and there is no FOV slider.",
            "review_score": "1"
        },
        {
            "review_text": "SUPER HOT. SUPER HOT. SUPER HOT. SUPER H... shut up! This game is fun, roughly 2 hours (max) in scripted length. Then its free for all with endless mode and other variants of the original levels. I recommend playing this game if you want to get better at FPS games. After a few hours of SUPER HOT SUPER HOT SUPER HOT I feel pretty satisfied and ready to move onto a real shooter. It's cool, don't get me wrong but you'll end up itching for live action once you're through the campaign and a few endless runs.",
            "review_score": "1"
        },
        {
            "review_text": "Super cool",
            "review_score": "1"
        },
        {
            "review_text": "I can actually look like a good player.",
            "review_score": "1"
        },
        {
            "review_text": "Feels like a lsd trip. ♥♥♥♥ing lovely game 10/10..",
            "review_score": "1"
        },
        {
            "review_text": "_________________________ |_____REPEAT AFTER ME:______| | 'THE SEYSTEM WILL SET ME FREE'| ---------------------------------------   _______  |___░ __|  |--TYPE--|",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS! SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!   ",
            "review_score": "1"
        },
        {
            "review_text": "Warning, Do not buy SUPERHOT unless you wish to be severly addicted to SUPERHOT, Literally the best shooter I have ever played. Its the most innovative shooter Ive played in years.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT: the only game in the history of all videogames that uses the classic 'slow and speed up time' concept in a way that is truly intuitive, challenging, and fun. Is this a sign of the End Times? Probably.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT has a really cool mechanic where time only moves if you move. This turns what would be an ordinary shooter into a really cool tactical simulator (almost). And at the end of every level, or when you die, it shows the real-time footage of your actions and you can see all the cool kills you got.  The story mode is SUPERSHORT, but luckily there's tons of unlockable challenge modes and endless modes. Kind of disappointing is that I haven't found any of the cheat modes that were in the beta. Maybe they'll be patched in, in the future.  The biggest let-down is the optimization. For a game of this scope you don't really need tons of graphics settings, but for my system (which runs the newest games on close to max settings) I had to turn everything to the lowest settings in order to get -relatively- smooth gameplay. That being said, the visual style isn't really focused on amazing graphics to begin with, so running on minimum doesn't hurt what this game has achieved; a really cool shooter.  ",
            "review_score": "1"
        },
        {
            "review_text": "I now also move slowly afriad someone will shoot at me in real life. Seriously.",
            "review_score": "1"
        },
        {
            "review_text": "A bit on the pricey side, but endless mode and the challenges make it well worth the price of admission. Very fun game overall.",
            "review_score": "1"
        },
        {
            "review_text": "A game that literally makes you want to kill yourself. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Cool single player",
            "review_score": "1"
        },
        {
            "review_text": "Everyone was all liek ' PAHSHOO PAHSHOO!!! ' n I wuz all ' swing Pa-chooo * echo effects * ) n they dyed n then diz guy wuz all like ' SUPAH HOT ' . I didn't think the game was going to hit on me like that at the end of a levul, but itz kewl.",
            "review_score": "1"
        },
        {
            "review_text": "Very enjoyable and makes you feel like the best shooter player ever.",
            "review_score": "1"
        },
        {
            "review_text": "'SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!'  Hi friends, you have to check out this game. It's the most innovative shooter I've played in years!  SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT  SUPER HOT is a very good game. The campaign is short, the price is high but actually the story mode is just a tutorial for the Endless mode and Challenges. The gameplay is 'fresh' and innovative. I can only recommand it to those player who like fps and slowmotion action like in Max Payne.   SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT",
            "review_score": "1"
        },
        {
            "review_text": "rather meaningless to play this game, but great fun !",
            "review_score": "1"
        },
        {
            "review_text": "ok i just bought it and i love it right off the bat but i can't view my replays but i am sure this with be fixed",
            "review_score": "1"
        },
        {
            "review_text": "A very interesting adventure through an unknown compa--- HELLO",
            "review_score": "1"
        },
        {
            "review_text": "So I usually don't write reviews for any games honestly, but my god this game is addicting. That satisfaction when you hear this perverted narrator guy(?) keeps yelling SUPER HOT over and over until you leave the replay, it's a complicated mixture feeling of joy and creeped out. However, I can't say I hate it. I freakin recommend this game to anyone, devs did an amazing job!",
            "review_score": "1"
        },
        {
            "review_text": "An innovative FPS that somehow manages to scare you, warm your heart, blow your mind, and make you feel like a total badass all at the same time.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT. SUPERHOT. SUPERHOT. SUPERHOT. SUPERHOT. SUPERHOT. SUPERHOT. SUPERHOT. SUPERHOT.  A must try game. simply brilliant",
            "review_score": "1"
        },
        {
            "review_text": "Dont listen to those negative reviews!  The story mode (25 levels) can be done in 2 hours sure, but thats not the main game and not even the entire game. This game opens up in challenge mode with 100 challenges + speed runs and theres enless mode with multiple levels and game play modes. just blazing through the story mode then coming here to complain about the game is to short makes no sense. take the story mode as a tutorial to complete challenge mode.   sure $25 is alot, i think $15 is alot for games also, but when this game opens up for steam work shop its gonna be nuts.  this game has reply value for the money in my opinion and is not 2 hours long",
            "review_score": "1"
        },
        {
            "review_text": "Wow... you are in for a treat with this one :) the story is Short around 2 hours long... but the Endless mode is ENDLESS FUN!!! :D gonna stick to this awesome title its a MUST have!",
            "review_score": "1"
        },
        {
            "review_text": "This game is sick.",
            "review_score": "1"
        },
        {
            "review_text": "I usually don't like games that claim to be 'most innovative' in their category but... this game actually is the most innovative first person shooter I have ever played. Simple but engaging mechanics, very cool minimalistic graphics and intriguing atmosphere make for a very enjoyable experience.",
            "review_score": "1"
        },
        {
            "review_text": "Forget The Division and GTA V, this greatest game on steam",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun action game that slows down when you move but if you move time goes faster.  -Best Game ive seen so far  -Fun  -Enjoyable  -Awesome",
            "review_score": "1"
        },
        {
            "review_text": "This game is like a fever dream.",
            "review_score": "1"
        },
        {
            "review_text": "While the main campaign is really, really short, it's different and very clever. Endless Mode and Challenges awaits after you've completed it.   It may look simplistic, but it has ALOT of attention to detail within the core mechanics in the game. I loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Only an hour in and I'm already pooping a baby brown poo",
            "review_score": "1"
        },
        {
            "review_text": "Amazing mechanic makes this game a unique exprience that is thoroughly enjoyable. I have nothing negative to say about it although steam workshop cwould be great and revolutionize the game and make a community for superhot.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS THE ♥♥♥♥ING ♥♥♥♥!",
            "review_score": "1"
        },
        {
            "review_text": "So, SUPERHOT seemed extremely interesting to me when I first looked at it. It instantly drew my attention when I saw same pre-release gameplay a few months ago, but I eventually forgot it. Now when I spotted it in the steam store I instantly bought it without further looking at the reviews.  I'm kind of split up what I should think of this game.  It's extremely interesting no doubt. It features some innovative mechanics and a gameplay experience you will not forget, it is extremely awesome to control time by moving / shooting. It also is a pretty hard game, which will not forgive you one time if you forget to look around. The graphic style is pretty good, the hit boxes are on point and very accurate and everything just works extremely well and its a fun game.  BUT the big, big downside to it is the extreme short game. Playing through the story took me 114 minutes. 114 minutes for 23 € is pretty... bad. But there is also endless / challenge mode, which will get me to play more. I think it's that kind of game you turn on after a long day in work / school and just get to play for half an hour and then you move on to some other game or you do something else.  I think the game can be worth it's full price if you either love the idea behind it or it gets more content. Otherwise I'd recommend getting it at a reduced price, but it's a really unique and sometimes frustrating experience. Doesn't feel good when you turn around and you just see a bullet right in front of your face and there's nothing you can do and it is slowly approaching you and then you hear... SUPER HOT.",
            "review_score": "1"
        },
        {
            "review_text": "Refreshing take on FPS. A lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Dont lisen to the pepole that say its too short you can play this game forever it is the MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!   so join us and buy it   help me   SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT",
            "review_score": "1"
        },
        {
            "review_text": "SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT.   -Go buy this game. Now. Do it. DO IT!",
            "review_score": "1"
        },
        {
            "review_text": "If you're the type of person who needs story to make a game worth playing, you're probably looking in the wrong place. This is all about the mechanics, and the endless and challenge modes of the game grant so much replayability that the story-mode is just icing on the cake.  Don't look at it as a short story-based game with additional modes, look at it as a challenging game like Pac-Man or Galaga with an additional story-mode for fun.",
            "review_score": "1"
        },
        {
            "review_text": "Super Hot fire...I spit that.",
            "review_score": "1"
        },
        {
            "review_text": "Best skynet history documentary to date.",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun action game that slows down when you move but if you move time goes faster.  -Best Game ive seen so far  -Fun  -Enjoyable  -Awesome",
            "review_score": "1"
        },
        {
            "review_text": "Its a First person vector graphics style thinking mans Hotline Miami and is great for the same and its own reasons as that title is. also supprisingly has a pretty decent story so far. SO MUCH FUN.",
            "review_score": "1"
        },
        {
            "review_text": "The only way to make this game better would be to let eveyone make levels",
            "review_score": "1"
        },
        {
            "review_text": "It's a very well crafted game and you can tell lots of time was put into it, I like its 3 colour design.  Personally shooting red guys was fine for me, I get the storyline but it seems kind of forced and as if they were put on the spot to make it up.  It is clearly made for VR headsets but I dont have one and still enjoyed it.  The fight at then end is a ♥♥♥♥♥ and really hard but other than that it is pretty easy.  But i finished the game in about 2 hours without rushing so it doesnt take too long to finish at the current moment.  Overall:   Nice Mechanics Nice Graphics Ok Story (kind of forced) Quite an easy game Hard final boss fight Very Short  I would still recommend this though 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "The stuff you can do in this game is unlike any other game. Essentially a James Bond simulator, and I love it",
            "review_score": "1"
        },
        {
            "review_text": "love this game",
            "review_score": "1"
        },
        {
            "review_text": "Cautious ‎recommendation because of the price. The 'story' is 2 hours, but that doesn't matter since that's not the point of the game. The problem is small level variety. Mechanically it's amazing. NEEDS workshop support.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. I end up spending more time trying to acomplish more outlandish and ridiculous out comes than just trying to finish the level the fastest just so I could watch the replay of what I just did in full speed. It does have a storyish kind of mode that reminds me of something you would find in the Stanley Parable. Its pretty different but I enjoyed it. Its a very short game, but has various diffferent challenges and an endless mode to play after you beat the main game. But I do think the price is a bit too much for what the game delivers.",
            "review_score": "1"
        },
        {
            "review_text": "I usually don't like games that claim to be 'most innovative' in their category but... this game actually is the most innovative first person shooter I have ever played. Simple but engaging mechanics, very cool minimalistic graphics and intriguing atmosphere make for a very enjoyable experience.",
            "review_score": "1"
        },
        {
            "review_text": "SUPER. HOT. SUPER. HOT. SUPER. HOT.  well,really like it. i recommend it. (i would donate 1.000€ but i'm poor af",
            "review_score": "1"
        },
        {
            "review_text": "Played the demo, loved the game. Bought the full version, also love it. Quite disappointed that it won't be on the Vive too.",
            "review_score": "-1"
        },
        {
            "review_text": "So I got this game on the Steam Summer Sale and I have to say it was definetly worth the purchase in my opinion. The campaign is about 2-3 hours long depending on how good you are, and a lot of that time will be spent trying to finish the last level which was almost as painful as some of the flooding missions in Ori: The Blind Forest. Anyways, the story was really interesting and good, but this game isn't supposed to be something you are interested in for the campaign, it's the concept and the many modes that come after beating the story that set it apart. So the basic concept is time pratically stands still until you start moving. Tiny movements (such as turning your head) speed time up slightly while big movements (such as walking) speed time up to regular speed. I would honestly say this is almost more puzzle than FPS similarly to how some stealth games are more puzzler than it is an FPS or third person shooter. This game has tons of replayablitity because there are a ton of modes/challenges that you can unlock after finishing the story.    I would have to say this is definetly one of the most innovative shooters I've played in years! super fun and highly reccommend if you are looking for a 'dumb fun' type game with a little bit of a puzzle twist.   I do have some complaints 1) sometimes it's hard to tell where you get hit from, or wheather or not something should have hit you which can be annoying. and 2) I saw a shotgun blast go through a pillard and then kill me a couple times on the last level (unfortunatly I didn't get time to screenshot it before I died). Lastly I know some people are mad that it is Oculus exculsive and I get that but I'm not interested in getting VR anytime soon so it doesn't bother me in any way and I'd still reccommend it.",
            "review_score": "1"
        },
        {
            "review_text": "  The exclusivity deal is temporary, everyone. Relax a bit and enjoy the game this great developer made.   PROS: +Fantastic gimmick. It's currently the only game of its kind.  +Simple but good looking and easily readable visuals +Cool storyline +Free DLC is being worked on to include procedural level generation! +It's just a real fun game!  CONS: -Short length -Sound design could be improved to have a better idea of your surroundings. Not being able to hear footsteps behind you can cause some ♥♥♥♥♥♥♥t deaths -Enemies spawn in places you've cleared, so it's almost impossible to plan without level knowledge -Price is going to be a bit high for many people to justify with such a short game. If you like score attacking games, you'll likely get your money's worth.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "it's pretty good mang",
            "review_score": "1"
        },
        {
            "review_text": "not worth 30 bucks  but when this is on sale (50% off minimum) get this game its crazy fun",
            "review_score": "-1"
        },
        {
            "review_text": "The fact this game doesn't have overwhelmingly positive reviews makes me sad.   if you are wondering if you want this game, don't let the negative reviews scare you, this game is fantastic.   i strongly think anybody who likes shooters shold get it                     SUPER   HOT",
            "review_score": "1"
        },
        {
            "review_text": "Extremely glitchy for me, would crash every level so I could not pass, and would geta multicoloured screen.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is basically playing the Matrix.  Everyone dies in one bullet, so what you do and what happens is really up to your decision making.  Being able to stop time and see bullets coming at you. Being able to make decisions and look around while the world around you is in slow motion. Being able to throw weapons and pick up new ones in the span of less than a second.  The premise of this game is something that I personally have never experienced, but I am enjoying it immensely so far. The gameplay is fluid, and the red enemies stand out in stark contrast compared to the white background.   I haven't gotten too deep into the story, but the gameplay is so interesting that I can see myself playing this game for a while. Would definitely recommend to others, as I have already.",
            "review_score": "1"
        },
        {
            "review_text": "it is so short :(",
            "review_score": "-1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 - this game is exceptional. Minimalist design, doesn't suffer from endless feature bloat, short enough to keep you entertained without getting to repetitive. The time mechanic adds a very interesting strategy element to gameplay. Endless mode is available once the main story (which was compelling) is complete. The collision engine is a little weird at times, but generally accurate.",
            "review_score": "1"
        },
        {
            "review_text": "It told me to quit. I pressed escape. It laughed and said I wasn't in control and to try again. I pressed alt-f4 and the game closed. Disappointed. 0/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Hi Viewer, you have to check out this game. It's the most innovative shooter I've played in years.                                        help me ",
            "review_score": "1"
        },
        {
            "review_text": "TREE DUDE IS THE MOST INNOVATIVE THIRD PERSON TREE CUTTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS A PILE OF GARBAGE ITS HORRIBILE ITS SO BAD I CANT EVEN BEAT THE END OF THE GAME YOU DIE IN ONE HIT FUDGE THIS GAME!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "Thank god I beat it in less than 2 hours and refunded. Absolutely not worth $25. I don't CARE what the people in the positive review section are saying. Do not buy this game until it is on sale.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AWESOME! SUPER HOT SUPER HOT SUPERHOT PS: if anyone is interested in the game, i have a 15% off coupon i can get you for free!",
            "review_score": "1"
        },
        {
            "review_text": "SPOILER: The song at the end is badass. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, very fun gameplay, and an acceptable story line. This game is unlike any other games, as time moves only when you move. I would definetely recommend this game to any one looking for fun games to play. The only bad thing is that it is kind of overpriced and that the story is too short",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT is the best.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "My first ever FPS game that allows you to aim for a headshot while eating cheetos. Satisfaction guaranteed *wink*",
            "review_score": "1"
        },
        {
            "review_text": "WAY TO SHORT DONT BUY THIS GAME IT SUCKS",
            "review_score": "-1"
        },
        {
            "review_text": "The concopt is exactly what you'd expect and is suprisingly fun.  However for £17.99 thats roughly £6 per hour assuming you play three hours, which is enough time to complete the game and play endless mode a few times.  For that price you might expect something similiar to Portal, strong replayability, good sophisticated plot, however it is clear the main focus was the gameplay and whilst this is unique it is all that the game has to offer. Buy on sale for a fiver at most otherwise avoid this pricey demo.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a fun game, but that's about it. There's no reason this should be $25 dollars. I beat it in an hour and a half, and the challenge modes are just rewrites of existing levels. The levels themselves sometimes feel lazy. There were some really cool opportunities for dramatic action-movie style sequences, but instead you're stuck in hallways being shot from behind by enemies that spawn from places you can't see.   Get it for $10 and it'd be a good dea`l. ",
            "review_score": "-1"
        },
        {
            "review_text": "its hard and can i have my money back?",
            "review_score": "-1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years",
            "review_score": "1"
        },
        {
            "review_text": "You get what you expected in terms of gameplay. Looks like it is a two hours game, but I think it is enough for the gameplay and idea presented... for the ones who are giving bad reviews only because of the time: seriously, you think too small. Sum up the gameplay, the idea and the challenges of each level... I think it worth the price and you will support them to make more of this.  Really, don't hear people who only and always complain about 'oh, I paid X Dollars for two hours of experience'.... Your money worth quality and creativity, not quantity. Period.",
            "review_score": "1"
        },
        {
            "review_text": "Hi [FRIEND_NAME_HERE], you have to check out this game. It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've ever played in years.",
            "review_score": "1"
        },
        {
            "review_text": "pretty goood",
            "review_score": "1"
        },
        {
            "review_text": "Just so awesome how the game toys with u and the gameplay is just so amazing just amzing review done.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I’VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "'It's The Most Innovative Shooter I've Played In Years', the developers claim. Superhot is definitely something new compared to a normal shooter like Call of Duty. The graphics fit to the concept of the game. The story of superhot is a bit short, about 90 - 120 minutes.  Something like community maps would be a excellent update for the future. All in all a cool game, but not worth 23€. So wait for the next steam sale. :)",
            "review_score": "1"
        },
        {
            "review_text": "dont buy this game you guys",
            "review_score": "-1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years. thats all i can say oh and SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT",
            "review_score": "1"
        },
        {
            "review_text": "Matrix and ♥♥♥♥ Also this game is SUPER HOT",
            "review_score": "1"
        },
        {
            "review_text": "The system won't stop. Can't stop. Playing is Inevtable. You have no choice. SUPER HOT.",
            "review_score": "1"
        },
        {
            "review_text": "Been waiting for this game for a while now. Its decent. The gameplay is super interesting and makes it that much more of a puzzle game. However i'm having a bit of frame rate issues when playing which really takes me out of the game. It rarely even hits 30fps after i removed AA. Hopefully this will be fixed but for now im a little dissapointed.",
            "review_score": "1"
        },
        {
            "review_text": "You have to check this out. It's the mｏｓｔ ｉηησναтινє ѕĦØØŦ€Ř Ɨ'ʌǝ dןɐʎǝp !u ʎǝɐʳˢ--.. 𝕋𝔸𝕂𝔼 𝕋ℍ𝔼 ℂ𝕆ℝ𝔼... 𝕐𝕆𝕌ℝ 𝕄𝕀ℕ𝔻 𝕀𝕊 𝕊𝕆𝔽𝕋𝕎𝔸ℝ𝔼... 𝕊𝔼𝕋 𝕐𝕆𝕌ℝ 𝕄𝕀ℕ𝔻 𝔽ℝ𝔼𝔼...",
            "review_score": "1"
        },
        {
            "review_text": "oNE oF uS.",
            "review_score": "1"
        },
        {
            "review_text": "ITS HERE, ITS HERE!.  3 YEARS OF WAITING AND ITS GLORIOUS *and a tad expensive*",
            "review_score": "1"
        },
        {
            "review_text": "The story is VERY short, but if you're in it for the campaign, you're in it for the wrong reason. This is less a game about completion and very much more about mastery. The campaign is almost like a training mode, and the real game is the endless mode. Survive as long as possible and create the coolest, most intense fight scene never in a movie. That's what superhot really is. I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is hot, and some might say it is SUPERHOT. But this game aint as hot as my mixtape fam.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter i've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game",
            "review_score": "1"
        },
        {
            "review_text": " SUPERHOT  is a game all about slowing down time and doing badass thing like doging bullets.  It's minemalistic style work perfectly with the gameplay. The mechanics and gamplay feel satesfying and it all just works perfectly.   The only complaint one cam make is the short story, but I personaly thought it was as long as it needed to be. The endless mode you unlock after the campaign can be a little repetitive.   12 / 15 ★   'SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!'",
            "review_score": "1"
        },
        {
            "review_text": "Two years wait and I didn't even finish this game because I promised not to load it again... but so worth it!!  Far too addictive, you'll end up finishing it before you know it but alas, there is endless mode, after!  SUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSUPERHOTSU",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT is a straight up 10/10. Probs the most 10/10 game made in the last decade? It's perfect. I want to make love to the shader artists.",
            "review_score": "1"
        },
        {
            "review_text": "Ya, the story is super short. But I've put 8 hours into this game and I know I'll be putting in WAY more. The game offers a ton of challenges and different ways to enjoy the game. There isn't JUST the campaign. Theres timed challenges, go through the game with only a katana challenges, and so much more that keeps me coming back! I would buy this game if I were you. The price tag is completely fair for what you get! So much work and effort was put into this game and I just love it!  SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the game but not at that price. It was extremely short. I was surprised that I beat it in just about 2 hours. I guess they think it's okay since you can play the same missions over and over in attempts to get better. Wait for it to be on sale then give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "Is it fun? Yes, do you feel like a king after slicing a bullet in half? Yes. Is it worth 16 pounds if you're on a budget? Unfortunately no.  The 'story' mode is about an hour and a half give or take and then you get challenges which is the same missions but with limited abilities and an endless mode which is exactly what it sounds. Fun but if I knew this rather than insta buying I'd wait until it's down to 10 pounds or under.",
            "review_score": "1"
        },
        {
            "review_text": "[No Spoilers] I'm an adult casual gamer and my son is a dedicated teenage gamer. We took turns playing and both loved it. The primary time mechanic, the difficulty, and the art style were all fantastic. There are some really fun aspects that I hope no one spoils for you that definitely suggest the developers put a lot of creativity into this.  You shouldn't expect more than 3-3.5 hours of gameplay, though. I'm personally happy with the value, especially given some of the modes unlocked when the game is completed. I much prefer unique experiences like this for $20-25 over trying to get hundreds of hours from a single $60 game. SUPERHOT is the price of 2 movie tickets but last twice as long and is more than twice as fun.",
            "review_score": "1"
        },
        {
            "review_text": "I've beaten the story once and have played through the Katanaonly and AD2013 challenge modes. I definitely plan on playing through the other challenges because the gameplay is just that good. Even though the game slows movement to a crawl, waiting for your next move, there is a frenetic undercurrent that pushes you to do better and make more stylistic kills each time you play a level. There's something so satisfying about watching your replay in realtime and seeing if your moves looked as good as you had hoped. Hotline Miami is the only game I can think of that gives the same sense of satisfaction when you complete a level. Superhot is great.",
            "review_score": "1"
        },
        {
            "review_text": "Give it a steam workshop :c",
            "review_score": "1"
        },
        {
            "review_text": "Do you really enjoy hurting other people? Because I do. A lot. Holy ♥♥♥♥ this game is fun.",
            "review_score": "1"
        },
        {
            "review_text": "It was a great game and I really enjoyed it. Very unique idea for a game with fantastic execution. That being said. This game is VERY SHORT. Considering they got their Kickstarter funding sometime around May 2014 I figured it would have a bit longer story mode. I got through the whole thing in about an hour and a half. There are other things to do like challenges and time trials but it was such a good game it left me wanting more once it was done.",
            "review_score": "1"
        },
        {
            "review_text": "Loved the game, After finishing the game things got SUPER HOT ;)",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years. thats all i can say oh and SUPERHOT SUPERHOT SUPERHOT SUPERHOT SUPERHOT",
            "review_score": "1"
        },
        {
            "review_text": "It was great, when it didn't blackscreen on launch.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter i've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "this is the most innovative shooter i've played in years",
            "review_score": "1"
        },
        {
            "review_text": "Good fun and interesting idea but is only ~90 minutes long, not worth the price",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 Made me paranoid about moving my mouse outside of the game afraid I'd get shot but I cant turn around because that wastes time I'd need to get out of the bullets way, pls help",
            "review_score": "1"
        },
        {
            "review_text": "This game is a complete lie. it say's that time moves only when you move, but that is not the case. when you are standing completely still, time basically goes in really slow-slow motion, but when you look around it speeds to normal, and when you look around while walking, time basically goes in fast-mode until you stop moving, so basically it is extremely hard to finish rounds, and the developers are very lazy. when the gamma is at the lowest in settings, it's still extremely bright, and the movements of the character in this game are extremely choppy. and overall, it is extremely hard, but not a challenging hard, just a rage-quiting type of hard.  This game is NOT worth $25, let alone $20 on sale. if this game was $5, i wouldn't be complaining. But for $25, this game is crappy.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game but not much content",
            "review_score": "1"
        },
        {
            "review_text": "This game doesn't have a story. Technically it does, but if the quality of it is important to you, this is not your game.  But the gameplay is amazing. Once you've finished the campaign mode, 'endless' is where it's at. Kill as much as you can before you get killed yourself.  If anyone tells you that time freezes in this game, they are lying. It just goes super slow motion, except for when you move. For this reason, I say this game is the modern day tetris. Tetris can be played fast or slow and it never ends. Once you get the hang of this game, you'll never have the desire to play Tetris ever again.",
            "review_score": "1"
        },
        {
            "review_text": "IT'S THE MOST INNOVATIVE SHOOTER I'VE PLAYED TO DATE",
            "review_score": "1"
        },
        {
            "review_text": "Hi [FRIEND_NAME_HERE], you have to check out this game. It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I’VE PLAYED IN YEARS!  SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "-1"
        },
        {
            "review_text": "You have to check out this game, it's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit that I never even heard of this game until this today. Checked out some videos of it but it looked like nothing special. Checked out the developers website and played the browser version that is there and was hooked. Bought the minute it was available. This game is a blast to play. I have never had so much fun getting shot from behind. Oh Yeah SUPERHOT SUPERHOT",
            "review_score": "1"
        },
        {
            "review_text": "   I was supplied with a key of this game from SUPERHOT but this does not affect my review in anyway!",
            "review_score": "1"
        },
        {
            "review_text": "A really good game, SUPERHOT IS THE MOST INNOVATIVE SHOOTER I HAVE PLAYED IN YEARS",
            "review_score": "1"
        },
        {
            "review_text": "Have you wanted to be neo from the matrix and dodge bullets?  Well you still can't at least not in real life. However this game gives you the ability to dodge bullets throw cups and smack people with bats. This game is one of the most incredible game i have played. If i still haven't convinced you to buy this game then what if i told you that in this game you could...  Throw a katana at a man with a shotgun grab his gun spin around the shoot his friend in the head spin around again throw the shotgun at someone else grab their pistol shoot them throw your gun in the air and just start punching people.   So if this doesn't sound like your kind of game then i would like to recomend that you go and play something like gamedev tycoon.",
            "review_score": "1"
        },
        {
            "review_text": "A simple shooter with some tweaks. The main allure could be the Bullet time of which time only moves when you do, and that certainly sets it apart from the rest. However what I wasn't expecting was the fantastic dialogue. As you play through the levels, it certainly feels the same each time, but you learn more and more. They are watching you. With the same story telling delivery as The Talos Principle, you start to look at things in a more and more different manner. The game is short, only about 3 hours im told, but the feeling as you progress through it is worth the price tag. Very few times is such a game idea pitched, and I am not disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "Just Can't Stop playing it! Its more of an puzzle game than an FPS but its insanely fun although the lack of levels can easily be rectified with steam workshop integration :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is not a run and gun FPS, it is basically Chess in the form of an FPS. You cant run into a room, you have to think. I love it so much, worth the $25.00.  SUPER GET IT",
            "review_score": "1"
        },
        {
            "review_text": " Punches three guys to death in an elevator  stops to take a sip of tea  door opens, picks up shotgun, and kills another three  leaves for a few minutes to sh*t   picks up a katana, slices a few bullets in half, and slices five red dudes in half   org*sms ",
            "review_score": "1"
        },
        {
            "review_text": "Story mode is short, but the challenges are (*ahem*) challenging and difficult in the best possible way.",
            "review_score": "1"
        },
        {
            "review_text": "You are like neo in the matrix, doging bullets and being a badass!",
            "review_score": "1"
        },
        {
            "review_text": "Great one, bringing fresh air to FPS genre. Unique mechanics, nice storytelling",
            "review_score": "1"
        },
        {
            "review_text": "One of the things this game lacks is replayability, something that could be curbed by implementing steam workshop support.  But rather than focus on the longevitity of the game, the developers have decided that VR is more important and getting a big fat paycheck from ♥♥♥♥erberg. The amount of people who own VR right now is miniscule, and rather than focusing on your core audience, you're focusing on the least important of all. On top of being Oculus exclusive, which in itself is complete cancer and a giant ♥♥♥♥ you to everyone who backed you.  Until this dev starts showing actual integrity and intention to support their game   stay as far away from them as possible.",
            "review_score": "-1"
        },
        {
            "review_text": "Hi [FRIEND_NAME_HERE], you have to check out this game. It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "only playable if your high or wasted.",
            "review_score": "-1"
        },
        {
            "review_text": "Hi [FRIEND_NAME_HERE], you have to check out this game. It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "This game is SuperHot fire",
            "review_score": "1"
        },
        {
            "review_text": "Recently there are a lot of negative reviews about Superhot, related to VR exclusivity on Oculus Rift. But if VR doesn't matter for you, this is an amazing game. It's not really a shooter as much as it is a puzzle game - but it's beautiful in its unique time mechanic and presentation. The narrative reminds me a lot of The Stanley Parable, which is a game that I love - it plays with your head.  Superhot is easy to recommend - buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Not worth $81.99, campaign only lasts 3-4 hours but otherwise, a very unique and interesting game  UPDATE: I got a full refund",
            "review_score": "1"
        },
        {
            "review_text": "Such a bad game because it wont even work. It wont let me play the game, and i cant refund it.WHYYYYYYYY",
            "review_score": "-1"
        },
        {
            "review_text": "The game is short, fun, and intriguing. Get it during a sale... It's fun.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT is a very interesting game, the core gameplay is satisfying, fun, and challenging. The main problem with the game is that there is not nearly enough of it. The game's main story mode feels like it was cut off very suddenly and many questions remained answer. This turns the campaign from a cool unique and mysterious story to just very confusing.",
            "review_score": "1"
        },
        {
            "review_text": "When ever I try to play the actual game it crashes.",
            "review_score": "-1"
        },
        {
            "review_text": "Non-remappable keys and monitor lock in a 20$ game. What is this, 1984 ? Refunded.",
            "review_score": "-1"
        },
        {
            "review_text": "It's fun up until a point. It gets to where your doing the same thing over and over and it becomes way to difficult. I was stuck on a level folike an hour until i just gave up. People will call me a noob but it is onestly too hard an there arent difficulty settings.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is an incredibly fresh take on the FPS genre. It plays more like a puzzle game, with each level presenting a unique situation and multiple solutions to progressing. Death is frequent, but the rapid respawn means it doesn't get frustrating.  While the campaign itself is short, about twelve other modes unlock, all allowing for score or challenge based replayability. Rather, the short story feels like a tutorial for the rest of the game.  SUPERHOT manages to always make you feel like the star of a John Woo movie, and the amount of depth hidden in challenges is staggering.  NOTE: I played the game before VR support happened. Since the base price didn't change, I so no reason to complain about VR exclusivity as a free addition to the product. The base experience of SUPERHOT is still stellar enough to recommend.",
            "review_score": "1"
        },
        {
            "review_text": "I'd like to thank the devs for SUPERHOT for working with the #1 VR company to help increase the amount of quality VR content available - with the small 'downside' (for Vive owners) that i get to enjoy it before they do due to TIMED exclusivity.  0% of people found this review helpful. 100% of people are sodium chloride.",
            "review_score": "1"
        },
        {
            "review_text": "I'd personally recommend buying this game on sale or from a third party CD-key supplier. It's really good, but not $25 go-- SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT",
            "review_score": "1"
        },
        {
            "review_text": "Great game really fun,",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT is a fanstastically original game. The core gameplay mechanic is deeply satisfying and allows for a tonne of replay value, the sleek visual style looks fantastic and the slender plot adds a really nice meta element to the game.  Ignore the childish people kicking out at the VR exclusivity, this is a great game and you owe it to yourself to play it.",
            "review_score": "1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": "am i the only one with problems i have been trying to play the game but it keeps freezing on the loading screen ",
            "review_score": "-1"
        },
        {
            "review_text": "'Its the most inovative shoot I have played in years'. Just buy it and if you dont love it there is something wrong with you. Even the people that claim FPS's make them dizzy can play it. Just buy it already its money well spent. Also I would like to add that my kids now run around saying 'SUPER HOT SUPER HOT SUPER HOT'.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, but there are some problems. red dudes can shoot 5 feet off from your head and it kills you, red dudes can be immortals and not die from a bullet through the face, and they will spawn behind you and with their freakin' noob toob shotguns kill you before it is physically possible to turn around!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "A fascinating idea that was executed really well. The gameplay is smooth and enjoyable while not being repetitive. The minimalist art design was also quite refreshing. However my one greivance with the game is the amount of content, for 25 dollars I, personally, would've liked to see more levels, weapon variety or something to make the game a bit beefier and longer than a couple hours. The value proposition of a game is subjective, and if that isn't a problem for you then I heartily recommend this innovative shooter.",
            "review_score": "1"
        },
        {
            "review_text": "There's not really much to say about this game othe than itSUPER's really fun. It does get preHOTtty hard at times but that couSUPERld justHOT be SUPER HOT becSUPERaHOTusSUPERe I'SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT is to action shooters what Portal and Portal 2 are to physics based first-person puzzle games. Beyond simple run-and-gun, this is a complex game that requires the reflexes and forethought of a high-speed tetris game crammed into a melee of bullets, improvised weapons, and cat-like reflexes. SUPERHOT defies easy categorization: is it a simple bullet-time trick played over a paper-thin story, 'accented' with ultra-minimalistic graphics? Or is it something more? What lies beneath the depths of the smudged CRT screen and DOS GUI interface that hearkens back to late 1980s/early 1990s computing? Play SUPERHOT and find out.  ",
            "review_score": "1"
        },
        {
            "review_text": "is this game worth the asking price  will it depends on what you want  if your the kind of player who plays through games once then no this game is not worth the price   but for me the game was worth it especially if there is more coming down the road  many full price games reach 8 hours because there are set pieces  cutscenes walking and talking to the next action segment  loading screens then you die and have to load the same part again   if you cut out everything that's not actually gameplay those 8 hours can be cut to 3 hours  depending on the type of game of course  not saying story is bad but sometimes i feel that they want me to watch they're game rather then actually play it  but SUPERHOT is my favorite type of game  it's just pure gameplay  yes there is a short story but that's just so you have some kind of idea and why anything in the game is even happening i found it pretty neat   but i'm glad there are challenge missions because they let me push the games mechanics  most games just have that one harder difficutly that exactly the same as the others only the enemies have more health and you have less  but the challenge missions make me rethink my strategies  i wish more developers knew that i want to actually play their games",
            "review_score": "1"
        },
        {
            "review_text": "So the game is fun and I like the whole 'Bullet Time' thing. But I dont think it is worth the $20+ Now if they add play made lvls editor and play system it would be",
            "review_score": "1"
        },
        {
            "review_text": "With over 10 hours on record I still haven't finished all the challenges. So if you like an innovative FPS puzzle game you really need to give it a try. Personally I didn't care much for the story/campaign which is only about a hour long. So if you're just interested in the main game I think it's best to wait for a sale. For everyone else just buy it already.",
            "review_score": "1"
        },
        {
            "review_text": "Its the most innovative shooter ive played in years!",
            "review_score": "1"
        },
        {
            "review_text": "Epic slow motion shooter! Tons of secrets to find and a great storyline! Best game ever!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing. The challenge modes are great trying to find the fastest clear time.",
            "review_score": "1"
        },
        {
            "review_text": "it keeps crashing and it loads the main menu but when i click something there it crashes",
            "review_score": "1"
        },
        {
            "review_text": "It's the most satisfying game ever when you finally beat that one level that may kick your ♥♥♥ ive probaly played some level over 50 times but still the game is amazing ive never played a game quite like this and its a great idea it makes me feel like im in the matrix.  P.S. Katana OP 10/10 katana simulator",
            "review_score": "1"
        },
        {
            "review_text": "Concept 10/10 gameplay 8/10 physics and mechanics 5/10 story 5/10 graphics 3/10  Yes, the campaign is short - 90 to 180 minutes. However, most of the game is after the campaign. Completing every achievement which means pretty much everything in the game as well, took me around 20 hours. The most important part of the game and which is why you pay 20 euro is 'Time moves only when you move' . I have never seen anything like it and probably never will. Play this game, watch the matrix, play it again, have a good time!",
            "review_score": "1"
        },
        {
            "review_text": "Endless mode is addicting, finding the secrets is really fun, and the challenges are actually fairly difficult and entertaining. I can easily see myself putting in another 50+ hours before I get bored of this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game works on my Alienware PC, but will not work on my laptop at all. It keeps giving me an error.",
            "review_score": "1"
        },
        {
            "review_text": "Wow! just wow.. I'm hooked. I can see really this idea going places...more weapons, more enemies more melee attacks, more breakable objects. Such an awesome experience just the way it sits though. A+++",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most addicting games I have ever played...seriously.",
            "review_score": "1"
        },
        {
            "review_text": "I mean, you can all see the trailer. That's what you're buying.  Story's not very long, but there's a ton of secrets for the curious completionists. The game as a whole is more like a gorgeous tech demo with some of the most unique mechanics you'll find in the current market, though it should be noted there's a moderate amount of content included besides just the time-moving story/endless/challenge modes.  If you watch the trailer, and feel comfortable paying for what you see and only what you see, you'll be pleasantly surprised that the game offers just a bit more than that. If not, go play a shooter that fits your tastes.",
            "review_score": "1"
        },
        {
            "review_text": "i was really surprised about how this game got me. unfortunately pretty short and within 2 hours finished (i was playing with finish etc). Longer, more story..more robots and difficulty. Loving it.",
            "review_score": "1"
        },
        {
            "review_text": "Super-Hot-Super-hot-Super-Hot-Super-hot mind is software body is disposable  the system will set you free  Get to work  Buy it  If you want to be the one of us If you want to be the tool",
            "review_score": "1"
        },
        {
            "review_text": "Get this game when it's $5-10, not worth it for only 2-3 hours of gameplay. I recommend this game if you like fun and difficult games, but don't agree that it's worth $25.",
            "review_score": "1"
        },
        {
            "review_text": "Ok folks, here's the deal. If its on sale, go for it. If you pay $30, you are going to be disappointed. Most of the bad reviews I've read seem to be from a position of overpriced instead of not being fun. I love it.  First of all, time never stands still (except in one challenge mode.) Time always churns at a snail pace and the more character movement you have, the more time speeds up to normal. So when you move your mouse around, you are moving and time does speed up. Some people call this a super annoying flaw. We call those people ♥♥♥♥♥ gamers. But before I digress...  There are no graphics to speak of. The lackluster screenshots do it accurate justice. It is not a beautiful game by any stretch. For what the game is, however, they work. The stark contrasts and geometric simplicity are kind of refreshing when many games over-saturate backgrounds. It started as a design constraint and turned into a legitamate style.   The gameplay is hectic. And loads of fun. I will say there exist ways to exploit the AI, which I have used to my advantage more than once. You hide behind a corner and run into the wall until someone comes. Then you clober them.  There really isnt a story to the game. Something about a hacker game that sucks people into the computer and turns them into hitmen or something. I dunno. You really don't need it though. The main 'campaign' doesn't take exceptionally long to beat, but it does unlock endless mode. And at heart this is an arcade style game.   Once I stopped trying to 'win,' I began to have massive amounts of fun just trying to pull off ridiculous feats and failing over and over and over (there are no load times btw.) Its when you pull off a brutal combo thats fluid and technically magnificent, you can get a lot of satisfaction seeing it replayed at regular time.   Pros -Insanely fun -No load times -Lots of replayability -You can cut bullets with a sword  Cons -If you pay more than $15 you are overpaying. -No modability in a platform that begs for it. -'Graphics suck' if thats your position on things. (Trying to be unbiased here)  Bottom Line: 6/10 If the regular price were $15 bucks I would bump it up to a seven. Its loads of fun, but I would like to see more done with it before it deserves a higher score.",
            "review_score": "1"
        },
        {
            "review_text": "I throughly enjoyed this game. For me, it goes beyond the gimmicky feel I expected characteristic of games emphasizing a single unique play mechanic. I found the story, while skimpy on details, thought-provoking and unique. It left me musing on the nature of self and filling in the blanks as to what I actually whitnessed in the story.   However, this strength neighbors its shortcomings. Even at $15 when I bought it on sale, the game leaves me wanting more for its asking price. There is just one enemy type. About four distinct weapons. It took me about three hours to play the story mode. It's a good game, but I don't feel that it belongs at its asking price even discounted to $15! In my opinion, I would value it at about $8-$10 worth of game. $15 is a bit steep. $25 is just too much.  The game didn't launch on my Mac through Steam on the Halloween update. I had to use Show Package Contents on the actual game app file and run the executable in the terminal. The game stutters at Fast settings on my very capable graphics card. A little better testing for performance on multiple platforms would have been nice.   I greatly enjoyed this unique game, but I feel that the game lacks content for its price point at the time of writing. The authors have indicated that they will be releasing a free DLC in the future. If and when they do, the game could become a better deal overall.",
            "review_score": "1"
        },
        {
            "review_text": "Ok. I recently got this game on sale, after wondering, because of the reviews saying it didn't have enough content, if it was worth it. It is true, the story itself is short, about 2-3 hours long. But the challenges add a lot to the game, more than the bad reviews account for. I wasted another 3 hours on 1 of the multiple challenges, and had a lot of fun doing it.  So, I think the game was worth what I paid for it, maybe more. I totally think it's a great game to spend some time on",
            "review_score": "1"
        },
        {
            "review_text": "For those who keeps getting crash after launching superhot.exe in the game: Right click on the SUPERHOT in the library and click properties, then click on local files and select verify integrity of game cache. The game should automatically updates itself and after that you should be able to play now. Hope it fixes for you too.  Good game though, but too short. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Unplayable due to it crashing right after trying to execute superhot.exe in-game (enter the campain).  Tried pretty much everything to try get it running (Validating files, running Steam and the game as admin, reinstalling, fiddling with the in-game settings + resolution and running in windowed mode). The crash dialog told me to send a folder that contains the crash logs to the devs of the game and after seaching the only thing i found was the  ifoundabug@superhotgame.com  email address. Sent an email 2 days ago and got no response. Any response would've been sufficient to me (because of not having to waste time troubleshooting the issue myself) and it's not like i didn't provide enough info as i provided them with the logs and description of my issue and you'd assume that they would ask for more info if they needed it.  The game itself looks ok and judging by the gameplay i've seen it would deserve a positive rating if it worked. Refunding.",
            "review_score": "-1"
        },
        {
            "review_text": "You have to check out this game. It's the most innovative shooter I've played in years.﻿  Pros:  - Very innovative. - A pretty good challenge - Unique story. - Lots of minigames and stuff you can do on the menu. - Very high quality graphics, despite usually having only one color. - Endless mode and challenges mode. - Absolutely amazing gameplay. - SUPER HOT! SUPER HOT! SUPER HOT! SUPER HOT! SUPER HOT! SUPER HOT!  Maybe like, maybe hate:  - Very simple textures. - Story can be completed in around 2-4 hours.  Cons:  - Large difficulty spikes sometimes. - Pretty expensive, but you know, they put lots of work into it! 8)  Overall:  It's the most innovative shooter I've played in years. I'll give it a solid 16½ out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "The most innovative shooter I've played in years!  It's short but sweet, not quite worth the full mark up if you're on a budget because it's less then 3 hours of play, unless you like the idea of endless mode, if this goes on sale for £10 or less though, snap it up it's a breath of fresh air.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "+Satisfying slo-mo ultraviolence +Endless mode is the real meat of the game, seeing how far you can go before watching it play in realtime +SUPER. HOT.  +/-A few challenge modes to keep your attention but not all of them are truly must-play +/-Not expensive, but perhaps a little pricey for the amount of content there is. Wait until it's 15 or 20 bucks  -The amount of meta in the story mode kills the pacing, especially near the end -The minimal story within the story kept my attention more than the meta story. Perhaps if they'd gone down that route, sort of like Hotline Miami, could've worked out better -I feel less inclined to praise a game that goes out of its way to demand I tell others it's the 'most innovative shooter I've played in years'. There's no need for vanity here.  Overall though, yeah it's a blast, play it.",
            "review_score": "1"
        },
        {
            "review_text": "I Really liked the game especaily the ending it was a blast to play and share my replays",
            "review_score": "1"
        },
        {
            "review_text": "Now everytime I play a FPS game and I win a round I have to say: SUPER! HOT! SUPER! HOT! SUPER! HOT! SUPER! HOT!",
            "review_score": "1"
        },
        {
            "review_text": "The story mode is pretty short. But the fun part is the challenges after beating it. ",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most inovative shooter i've played in years. 8/10 Buy it when it is around $10-$15 since it's great, but very short with only a 2-3 hour long story. There are also other things like Endless mode and challenges which could also add a few more hours onto the game.",
            "review_score": "1"
        },
        {
            "review_text": "The dark lord approves.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game so far! :D ",
            "review_score": "1"
        },
        {
            "review_text": "I only got SUPERHOT today and I like it so far. But is there anyway to increase the FPS?",
            "review_score": "1"
        },
        {
            "review_text": "This game has a very interesting mechanic that I found very entertaining, even after I had beat the main game I continued to play the endless and challenges. This game is a very good time killer. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A surprise hit! Never saw it coming but it blew me away! A great mind bending story and innovative gameplay.  Keeps pulling me back for the challenge modes :)",
            "review_score": "1"
        },
        {
            "review_text": "Relatively short game on its own, but makes up for it in replay value. I haven't had a lot of time in this game, but the mechanics are very cool and the minimalist red and white graphics are very pretty. My only issue with the game is its short length for the $25 price tag, but if you can pick it up during a sale, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "So cool, one of a kind game. Such an intresting storyline and very interestingly executed.",
            "review_score": "1"
        },
        {
            "review_text": "The most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "I have gotten superhot in its beta prototype phase and pre-ordered it right away as soon as I was finished. the game gave me an experience that I have not seen before in the gaming industry, hence gave me the interest to see what was hiding beneath it.  You could say I was not let down &amp; this game deserves the TEST OF TIME Award. :)",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter iv'e played in years!",
            "review_score": "1"
        },
        {
            "review_text": "SUPER. AWESOME. That is this game in simple terms. If you ever wanted to be Neo from The Matrix, this is your game. Even if not, this is still an amazing game. It is relatively short, but all the little secrets and content make it longer &amp; worthwhile",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to be James Bond or Jason Bourne? You can be like them with this game ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "I NOMINATED THIS GAME FOR: THE “GAME WITHIN A GAME” AWARD  You could play through SUPERHOT normally. Jumping around like a coked up kangaroo, exploring the most inventive ways to kill 8 people with only a katana and a pistol, and punching guys in their stupid, red, polygonal faces.  Or you could play TREE DUDE for way too long.",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "pros -'almost' a matrix simulator cons -can't run on walls",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most fun games i have ever played, and would have been better if it either has a longer campaign, or cheaper.",
            "review_score": "1"
        },
        {
            "review_text": "I got message from red dudes. They said me to promise something and to close the game. I closed it. 10/10 game",
            "review_score": "1"
        },
        {
            "review_text": "This game has a lot to offer. Do you like 'The Matrix'? This game plays sort of like those movies. You'll slow down time, weave to dodge a bullet, jump at a guy, shoot him in the face, turn around to see a guy behind you, throw your gun at him to disarm him, grab his katana and kill him with it, throw the katana at another guy, teleport into him, killing, grabbing your katana mid-air from your previous throw, and slash down a fourth guy, only to have a fifth guy blindside you and kill you. And then you do it again, only different but equally bad-♥♥♥.  While the story may be pretty short (about 2-3 hours), it's actually an interesting experience, and there's always secrets to find in the campaign levels so there's a reason to come back and play it more.  The real meat lies in the Endless Modes. This is where the arcady replayability really shines through. Endless Mode is where you play through arena-like levels with enemies rushing at you. There are different win conditions for each mode, such as 'how many can you kill in 60 real seconds' or 'how fast can you kill 20 enemies' or simply just survive and kill as many guys as possible before being killed. It's the hallmark of a good game if you keep playing just because it's fun, and that's what this is for me.  There are also challenge modes that let you play through the main game again but with different modifiers, such as katana only, or no guns but punches 1-shot. There are also speedrun modes if that's your thing.  Also the obligatory, 'this is the most innovative shooter I've played in years'. But really, it's a good game.  SUPER HOT SUPER HOT SUPER HOT",
            "review_score": "1"
        },
        {
            "review_text": "'SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!'  But the price is out to lunch for what it is. Get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game will mess with your head at the same time your blowing the back of other peoples right out  10/10 fun game with intresting mechanics and storyline",
            "review_score": "1"
        },
        {
            "review_text": "Ever watched a slo-mo gun fight movie/anime where the hero shoots 3 guys in the head, throws the gun into the face of the ninja attacking from behind, grabs his katana , decapitates 4 guys with baseball bats before throwning the sword through the air into the head of a sniper? then replays that at full real time speed?   well thats what this game does. its smooth, its cool and fun.  basically every room is a puzzle and hyper violence is always the right answer.",
            "review_score": "1"
        },
        {
            "review_text": "A game that without textures let's you know perfectly what is going on.  Fighting your way through as many enemies in endless mode and then watching the full speed replay is soo satisfying!",
            "review_score": "1"
        },
        {
            "review_text": "Hi [your_name_here]. you have to check out this game. It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "Superhot is the most innovative shooter I've played in years",
            "review_score": "1"
        },
        {
            "review_text": "A shooter with a truly original gameplay mechanic. The graphics seem bleak yet I really appreciate the style. Once you beat the main story (about 2 hours long) there are plenty extra modes to enjoy + it's filled with easter eggs/secrets to explore. Needs keybinding tho, but it's.. manageble. And some sort of map maker would've served the community greatly. ",
            "review_score": "1"
        },
        {
            "review_text": "Cool game but a little bit too expensive. It's worth 5-10€ not more. Mainstory takes 2-2,5 hours, after that you can do challenges and play an endless mode.",
            "review_score": "1"
        },
        {
            "review_text": "Really great! The concept was unique and put a new spin on first person shooters.   9/10 needs more dubstep",
            "review_score": "1"
        },
        {
            "review_text": "THE GAME IS AWESOME   But it brakes easily and I have not figured out how to fix it",
            "review_score": "1"
        },
        {
            "review_text": "Super hot will make you want to rip your eyes out for 25 bucks",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty good, fun gameplay cool mechanics. But its 25 dollars  ♥♥♥♥ that ♥♥♥♥ mAn",
            "review_score": "1"
        },
        {
            "review_text": "You're in a white-walled room. Bullets are whizzing past you. You look to your right. You see a man about to pull the trigger on a shotgun. You jump out of the way, just in time, and land on the head of another man and in the process, kill him. You take his gun, shoot the goon with the shotgun, and spin around three times before blowing off the head of another assailant with a katana.  You take the sword, throw it halfway across the room and slice through yet another enemy, this time ducking and dodging bullets on your way to retrieve the sword. You free it from the wall and, slicing bullets in half, you slowly cut down your adversaries until there is nothing left but you and what you have done.  Friends, murdered. Colleagues, sliced to ribbons. Their blood is on your hands. You throw your weapon down in disgust, and feel a weight lift from your shoulders. What was that? All you can hear is the faint chanting ...  SUPER HOT SUPET HOT SUPER HOT",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Great game, the time-stopping mechanic is just amazing. Sadly, my computer couldn't handle it too well, so I had to refund it.",
            "review_score": "1"
        },
        {
            "review_text": "Epic game mechanic 9/10 stars",
            "review_score": "1"
        },
        {
            "review_text": "This thing(?) is awsome! Do not buy tripple A titles, safe your money and get this! I had one of the best entertained hours of my gaming career.",
            "review_score": "1"
        },
        {
            "review_text": "Like chess no two games are ever the same.  Reviews stating they love the gameplay but it's too short are drastically missing the point.   The campaign is just an imaginative way of doing a tutorial which unlocks Endless Mode where I've clocked up nearly 30 hours and, like my comparison to chess, each game is unique and the replayability is immense (if you love the gameplay).  Ah the gameplay... the holy of holy's. It's sublime.  I think the key to the developers genius is that they have not tried to complicate the gameplay with any unnecessary trimmings of modern gaming. For example the firearms. Just 3 varieties - shotgun, assault rifle and pistol which all compliment each others strengths and weaknesses and are as different as primary colours themselves.  To summarise? I can't think of any other game I've EVER played (and I'm an old git of 43) where getting 1 or 2 kills in a round is just as satisfying as getting over 100 and, to be honest, I can't think of a better compliment for the moment to moment gameplay than that.  Slinky",
            "review_score": "1"
        },
        {
            "review_text": "Superhot is a very meta game. It's story is cheesy, and a bit poorly written. So many better options could have benifited the game, but we got what we got, I'm afraid. The game's single player story mode is quite short-ranging at around 2 hours. The price was also inflated for some odd reason, from an advertised 14.99 USD to 24.99 USD.   That being said, superhot is a fantastic, addictive and great looking/playing puzzle shooter that makes you feel like a frag god. It's packed to the brim with personality and secrets, and has a lot of replay value. The endless modes are awesome, and some of the maps are truely amazing. The sound design is great, becuase it fits the whole 'time moves when you move' quirk. It could really use some of the advertised music, however, and ends up feeling a little bland. Oddly enough, you can't crouch.    With a few patches, this game could be SUPER HOT",
            "review_score": "1"
        },
        {
            "review_text": "This is right up my alley. The 'time only moves when you move' mechanic works brilliantly. I like the short, easy-to-replay levels, so you can experiment and improve your skills without risking having to replay very much. I like the short story mode so you can easily complete it in a day or two (and there are challenges left afterwards if you want to play more). The progression and learning-curve are great. There's even a well-done clever narrative. All around superb!",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "Thanks for this awesome game, creators! i hope it will be expanded soon, it's so exciting:D thanks.",
            "review_score": "1"
        },
        {
            "review_text": "The game told me to stop so I have not played since I would like to know when I can play again",
            "review_score": "1"
        },
        {
            "review_text": "It is the most inovative shooter I have played in years",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing the story line is creepy but so satisfying i have played for 80 minutes so far but it felt like 10 minutes, time flies when your having fun!",
            "review_score": "1"
        },
        {
            "review_text": "It’s the most innovative shooter I’ve played in years.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a multiplayer junkie, so it's very much a compliment when I say this is one of the best FPSes I've ever played. Yes, the story is short. No, the story ISN'T the game. It's only the introduction. Literally. This is one of the most innovative games I've played in year. ;3  I do hope there will be more, but as is, it's already my favorite game of 2016, by far. Messing around with the katakana is more fun than it should be.",
            "review_score": "1"
        },
        {
            "review_text": "I'd like to start this off by saying SuperHot isn't the easiest to write a review on. Throughout the game it talks about or reminds you how its in control, mentions how you should recommend it to others without revealing to much about the game. The story is short and most time is spent in 'Challanges' and 'Endless mode'. Some might say it has 'No plot, no nothing, just killing red guys.' but that's not totally true and even if it was would it really matter?    Whenever you stop time slows down, only speeding up when doing an action. Time speeds back up while moving,shooting,picking up objects or performing a melee. You're main goal is always to eliminate the 'Red guys' anyway you can. The 'Challanges' are levels from the campaign with different twists on them. A few of the twists would be Katana only, Fullstop, Ghost, and Speedruns. 'Endless mode' is exactly how it sounds, you spawn in a area while a constant wave of enemies charge you. I'd recommend this to anyone looking for a hardcore but 'casul' game, but I'd also recommend waiting for a steam sale being the price 24.99$ is a bit high for this.   'Hi [FRIEND_NAME_HERE] , you have to check out this game. It's the most innovative shooter I've played in years.'  SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT  SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT",
            "review_score": "1"
        },
        {
            "review_text": "'This is the most innovative shooter I've played in years'",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "such a fun game. so f#cking crative and cool",
            "review_score": "1"
        },
        {
            "review_text": "Freaking awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "A really fun game due to it's smart gameplay and with the addition of endless mode, a really good game to play just to feel awesome. The story mode is short but pretty clever, serving as an extended tutorial for the aforementioned endless mode as well as challenges. Overall a good recommendation, worthy of it's price.",
            "review_score": "1"
        },
        {
            "review_text": "very great game, it lags to much on my computer to play sadly but from all the gameplay ive seen it has a very clever mechanic of TIME ONLY MOVES WHEN YOU MOVE. it clearly had lots of effort put into it and it is a breath of fresh air to the fps genre",
            "review_score": "1"
        },
        {
            "review_text": "The Game needs more content for the price however for what i got the game was very solid smooth and can be very fun at times the endless mode is very enjoyable and adds more hours to a very good game I would like to see more content such as the free dlc that is being released in the near future",
            "review_score": "1"
        },
        {
            "review_text": "An interesting new take on standard first person shooter games. Would absolutely reccomend! Looking forward to future addition to the game and the concept.",
            "review_score": "1"
        },
        {
            "review_text": "Hi [FRIEND_NAME_HERE], you have to check out this game. It's the most innovative shooter I've played in years.  Hi [FRIEND_NAME_HERE], you have to check out this game. It's the most innovative shooter I've played in years.  Hi [FRIEND_NAME_HERE], you have to check out this game. It's the most innovative shooter I've played in years.  Hi [FRIEND_NAME_HERE], you have to check out this game. It's the most innovative shooter I've played in years.  Hi [FRIEND_NAME_HERE], you have to check out this game. It's the most innovative shooter I've played in years.   SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT. SUPER. HOT.    Really though, the story, albeit short, is fun and interesting along with some other cool game modes. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Fun gameplay, interesting way to present a story. Kinda short, but it is a must buy when on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Occulus Exclusive...  edit: well the developer comment changed my review",
            "review_score": "1"
        },
        {
            "review_text": "Wait for a sale!!! Story is.. you know what... Let's just leave it at this... It’s the most innovative shooter I’ve played in years..",
            "review_score": "1"
        },
        {
            "review_text": "This game set a world record for how fast a game can be forgotten about. Good game though.",
            "review_score": "1"
        },
        {
            "review_text": "SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT   Recomendo 100%  Graficos otimos, Envolvemento com a historia muito boa, jogabilidade maravilhosa! Um jogo para quem gosta de FPS e Estrategia, e é claro otimos efeitos ;3 ",
            "review_score": "1"
        },
        {
            "review_text": "Not as much content I was hoping for but overall the game is epic. Not. Only is this game fun but it makes you look MLG.",
            "review_score": "1"
        },
        {
            "review_text": "Very innovative.  Just like in the game, playing what seems to be a few minutes is actually a few hours.   Very good game and worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've played. It's fun and addictive.  If you're looking for a game that is inspired by The Matrix, Portal, and Hotline Miami, then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Sick AF! (have been waiting for the game since it was announced a few years ago)",
            "review_score": "1"
        },
        {
            "review_text": "hi, i was wondering if there are mods for the steam verson, can some one please tell me if there is, and if so how to use them? thanks, i love this game, and i recomend it!!!",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT is a great, time consuming game, I play offline a lot so consider me having over 200 hours. This fast paced even in slow mo game take TIME MOVES ONLY WHEN YOU MOVE as a mechanic and runs with it. It has a coherent story, a great art style, varied weapons, secrets, everything. 10\\10 would be Neo again.",
            "review_score": "1"
        },
        {
            "review_text": "The most innovative shooter I've played in years, Little exspensive but really fun and hard to stop playing.",
            "review_score": "1"
        },
        {
            "review_text": "Very unique and entertaining but way overpriced. Wait until it comes down to around $10 but a must-have just for its gameplay concept.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I'VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "you should add mods again because they are gone on the new version",
            "review_score": "1"
        },
        {
            "review_text": "can the illuminati pyramid level not be so hard coz i swear there is abug that makes the red guys have super speed and half the reload time",
            "review_score": "1"
        },
        {
            "review_text": "Great game but short storyline.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, not for 25 bucks though. I got a refund. Only 2 hours of gameplay. There is like an endless mode but still, buy it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "The most innovative shooter ive played in years. SUPER HOT, is incredible. I never really expected to say this, but wow is the story good! It's mind twistingly awesome! SUPER fun gameplay, and a campaign that i feel is fun to replay. As of the complaints about lack of content, it has plenty! Like i mentioned, it has replayable, plus challenges, endless, and soon to come free DLC! Endless is about what you expect, but i adore the way they did the challenges. your basicly replaying the game, (take away some levels and all the story stuff) although, they always got a twist! For example theres the katana only challenge where, as the name states, you can only use the katana! Theres also a ton of other challenges.  9/10 Great game!",
            "review_score": "1"
        },
        {
            "review_text": "The Mac version of this game cannot be opened.",
            "review_score": "-1"
        },
        {
            "review_text": "I'll go ahead and completely ignore the recent outcry of SUPERHOT being Oculus exclusive, and give a real review.  The game is fun. I thought it was creative, entertaining, and the story had me pretty engaged. The only problem is I've literally mastered this game in like 3 and a half hours. I feel like there's absolutely nothing left for me to do now, I've done most of the bonus missions and replaying the story doesn't sound like it would be fun. I can't recommend it at it's price, but if it ever goes on sale for cheap, or you just want to get your SUPERHOT fix, go ahead and try it out.  Also if you're thinking about playing this on Vive, you apparently can't as the devs made it Oculus exclusive, which I think is a huge bummer.",
            "review_score": "-1"
        },
        {
            "review_text": "  Most stylish FPS ever. Another diffrent look on the shooter world.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Played a lot. They fixed some bugs I reported.",
            "review_score": "1"
        },
        {
            "review_text": "Crazy Addictive",
            "review_score": "1"
        },
        {
            "review_text": "you know how every game has that one level that everyone agrees is total ♥♥♥♥♥♥♥t? all of superhot's levels are like that",
            "review_score": "1"
        },
        {
            "review_text": "i recomend this game to anyone who is interested in Time manipulation games or anything that is able to be vr Very happy with this",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: It's fun, but short; especially for the pricetag.  This game is probably the most innovative shooter I have played in years.  That isn't even a joke.  It's super fun to stop time and throw bottles at people and then steal their gun midair and shoot them with it. At the end of each level, you see what you did in full speed, so that is fairly awesome.  It only took me 2 hours to beat the game and play the Endless mode, so $25 was NOT really worth it. Get it on sale... or buy it, beat it, refund it.  ",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, very challenging in places and has al ot of extra content. Is it worth 17 quid? See for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome and a half",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT is fantastic. I wish there were more levels. Theoretically, there is a lot of replay value with the challenge modes, but many of the challenge modes restrict you from the most fun and exciting aspects of the game. Definitely worth a play if you can pick it up cheap.",
            "review_score": "1"
        },
        {
            "review_text": "Hi [FRIEND_NAME_HERE], you have to check out this game. It's most innovative shooter i've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to be honest this surprised me so much. i thought it was going to be a no story just keep shooting type of game. I am glad that i was wrong. I recommend to give it a good go. the endless arenas are very fun as well.",
            "review_score": "1"
        },
        {
            "review_text": "The mechanics are extremely well thought out, fun and satisfying. The graphics are simple, and could use a little more detail and more colours. The slow-motion aspect is great. However there is one major drawback, the price. €23 is way too much for what the game is worth. Would highly recommend on sale, but at it's current price, it is too much considering the amount of games you could buy that are cheaper than this and have more content.  EDIT I refunded this game because of the price. That is why it says 0 hours.",
            "review_score": "1"
        },
        {
            "review_text": "This game Definetley Has one of the coolest shooter concepts rather than the same old 'Shoot 'n' Shoot More.'  Although I only have 1 hour or so for this game, its a great adicting shooter where time only moves when you move, I think everyone should give it a try or at least watch some video's - its super satisfying when people break...   But the one reason that I wouldnt buy this game is becuase of its price,  so if you cant find it on sale, GET IT - its a great game.",
            "review_score": "1"
        },
        {
            "review_text": "&gt; 100% achievement-'d! :D   'It's the most innovate shooter I've played in years.' ",
            "review_score": "1"
        },
        {
            "review_text": "Definatly an experience worth the price.  Oddly enough, I had an absolute blast secret hunting after the main story, turns out the levels are significantly more complex then they appear to be. (Don't look them up, way more fun that way)",
            "review_score": "1"
        },
        {
            "review_text": "Hello [Friend_Name_Here], You have to check out this game. It's the most innovative shooter I have seen in years!",
            "review_score": "1"
        },
        {
            "review_text": "Time moves when you move  When I first played SUPERHOT I thought the game at first crashed my computer until I notice everything in game freezes when you don't move which is pretty cool. In game allows you to decapitate, cut, smack, blow stuff up and shoot your enemies as well as other things in seconds, at least in the game time which only really moves when you're moving It's a really interesting idea and works well. The game feels awesome and really is super fun for at least 6 hours at the time, and for me 25 hours on the challenges.  Price of this game is very reliable and when you get into it brings so many awesome impacts of gameplay, however the main story is quiet short and the game lacks on content, such as weapons, enemy types, maps, length of story as well as what some games have a few other things. This game price is on standing replay value it and it's very high.  The price on the game I'm sure it's still cheap if you saw it on sale...  (Voiceover)    SUPERHOT",
            "review_score": "1"
        },
        {
            "review_text": "Best use of Slow Motion!!",
            "review_score": "1"
        },
        {
            "review_text": "One of the most original games of the year. I completly original take on the shooter genre that doesn't overstay its welcome. Would love to try this one in VR too!",
            "review_score": "1"
        },
        {
            "review_text": "Its hot.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely Recommended, nothing else to say.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I’VE PLAYED IN YEARS.",
            "review_score": "1"
        },
        {
            "review_text": "  It's gr8 m8",
            "review_score": "1"
        },
        {
            "review_text": "This is a completely honest review:  Pros: - Innovative - Fun - Addictive - Challanging - SUPER HOT! SUPER HOT! SUPER HOT!!! (Dat meme do!)  Cons: - Expensive - Wait for a sale - Short Story line - who cares this game isn't just for its story - Bad graphics - Personally i prefer the red crystal shatter and sounds, its more satisfying  Overall - Wait for a sale, then buy, its worth it  Translation: SUPER HOT SUPER HOT SUPER HOT!  SUPER HOT: - SUPER HOT - SUPER HOT - SUPER HOT - SUPER HOT - SUPER HOT SUPER HOT SUPER HOT (SUPER HOT HOT!!!)  SUPER HOT: - SUPER HOT - SUPER HOT SUPER HOT - SUPER HOT - SUPER SUPER HOT SUPER HOT HOT SUPER - SUPER HOT - SUPER HOT SUPER HOT SUPER HOT SUPER HOT SUPER HOT  Seriously though:  THIS GAME IS AWESOME, BUT IT WHEN ITS ON SALE, YOU WILL NOT REGRET IT (UNLESS YOU HATE SHOOTERS OR OVERLY CATCHY MEMES) SUPER HOT!!! SUPER HOT!!!",
            "review_score": "1"
        },
        {
            "review_text": "If watching the trailers for this awesome game didn't convince you to buy it, then reading reviews certainly won't.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT is the most innovative shotting I have ever played.    you'll say the same after you play it   ",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic game, I find it very creative and it's just fun in general",
            "review_score": "1"
        },
        {
            "review_text": "An excellent game. A bit on the pricey side unless your a completionist but definetely wort it on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Best game I've ever played. Solid 5/7",
            "review_score": "1"
        },
        {
            "review_text": "I saw the demo for this game a couple of years ago and was hyped up for the end product, it's expensive, but an interesting concept and worth the wait.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game with a fighting system that is unique, yet enjoyable. The developers were clearly trying something new and taking risks, but it was worth it as they have created a new gamestyle or maybe even a genre.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really a lot of fun to play, I've definitely gotten my money's worth (and I was a Kickstarter backer). For some people it will seem a little short for the full price, but that has not been my experience. If you're worried about it being too short, just wait until it is on sale (but buy it!).",
            "review_score": "1"
        },
        {
            "review_text": "  great game",
            "review_score": "1"
        },
        {
            "review_text": "really enjoyed this game, challenging and fun, how a game should be. good story too 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A truly one of a kind experience. 10/10 &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "I don't do drugs, but I think that if I did, it would be something like this game,",
            "review_score": "1"
        },
        {
            "review_text": "Fun, for a while at least, in story mode the commands and chat-room passages create more of an annoying atmosphere, not a tense one. Would be a lot more fun with less guns and more Melee fights. Challenges and Endless Mode are an excuse to more/better content, same stuff but harder. 5/10 would buy again if price was 10$",
            "review_score": "-1"
        },
        {
            "review_text": "Great game everyone should play.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would have face melted again",
            "review_score": "1"
        },
        {
            "review_text": "S**T HOT.....!  2-3 Hours to complete the game but then endless mode unlocks giving lots more hours of fun:) Probably not worth the full price though",
            "review_score": "1"
        },
        {
            "review_text": "It's the most innovative shooter I've played in years. But it's not worth 25 bucks, get it if it's around 10 bucks, maybe 15. Campaign takes around 2-3 hours when you do it for the first time. You heard me right, 'when you do it the first time', because once you've finished it, you basically do it over and over again with different restrictions (katana only for example). The 3 hour campaign turns into a 15-20 minutes level once you get real good at it.  It's fun, it's simple, it passes time. But nothing mindblowing. 7/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Most innovative shooter i've played in years",
            "review_score": "1"
        },
        {
            "review_text": "great game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Innovative and challenging. Love the concept and everthing. Great game",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, very weird FPS. Definitely a worthwhile buy (even though it's short) so wait for it to go on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game has some of the most intersting mechanics I've seen in a shooter. It's more like a puzzle game than it is an FPS. I finished the game relatively quick (one sitting) but there are several different challenges you can take on, but none of them appealed to me, as it makes the game much harder in some cases. If you're looking for an interesting game to play, I highly recommend SUPERHOT.",
            "review_score": "1"
        },
        {
            "review_text": "&gt; 100% achievement-'d! :D   'It's the most innovate shooter I've played in years.' ",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game with great time manipulation. It's challenging but not to the point where I don't feel like playing anymore.",
            "review_score": "1"
        },
        {
            "review_text": "this game is short but sweet. i really had a lot of fun playing this. and the endless mode has alot of replay value",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░ ░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░ ░▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒░ ░▒▓╔══════════════════════════════╗▓▒░ ░▒▓║Hi, [FRIEND NAME HERE], you have to check║▓▒░ ░▒▓║——out this game. It's the most innovative—║▓▒░ ░▒▓║———–shooter I've played in years.–————║▓▒░ ░▒▓╚══════════════════════════════╝▓▒░ ░▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒░ ░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░ ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░",
            "review_score": "1"
        },
        {
            "review_text": "This game is just amazing. Graphics, sound, story (sort of), Gameplay, mechanics. All great, great things. The game has a lot of replayability and I totally recommend SUPERHOT!      The end of the game is quite cool, so stick around for that.",
            "review_score": "1"
        },
        {
            "review_text": "Sumamry-Interesting, unique, a little expensive for the content  For 2 hours of campaign + endless challenges, I am thinking the price is likely too high, wait for it to be on sale in a years time.  Other than price it was an interesting little time/mind bending game. Unless I did it wrong, this is the frist game that seemed to force you to quit a few times to continue the game.  It would be nice if the replays of your levels were saved locally and not on some website you need an account for.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game. Love the concept of time manipulation. I iwhs the story was more in depth, but it is a great game to play as you can try and kill is different styles. SUPER HOT, SUPER HOT, SUPER HOT!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game made me ♥♥♥ over and over again! 11/10 would ♥♥♥ again.",
            "review_score": "1"
        },
        {
            "review_text": "SUPERHOT IS THE MOST INNOVATIVE SHOOTER I’VE PLAYED IN YEARS!",
            "review_score": "1"
        },
        {
            "review_text": "superhot subjects you to mind control and it works.",
            "review_score": "1"
        },
        {
            "review_text": "It starts at really good. Then slowly, over the course of a couple dozen hours, the hidden tricks and tweaks begin to emerge, and the game gets amazing. I'm not big on shooters, but I had a blast with Superhot.",
            "review_score": "1"
        },
        {
            "review_text": "Hey, steam community, you should check out this game, its the most innovative shooter i've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "It was a very good game when I could play it. Just doesn't work anymore and none of the solutions given help.",
            "review_score": "-1"
        },
        {
            "review_text": "+ This game is awesome! It is not the bloody mess most shooters are. The feeling of time slowing down is really amazing. And I really liked the plot twist in the end. + The graphics are not high quality like 'The Witcher' or 'The Division'. But it looks fancy and innovative. + I know you guys announced VR, but it is not available yet so I played with Vive in theatre mode. I have to say that this was an amazing experience.   - The actual story is rather short (I played 3.5h main story) but the challenges are not as mind blowing as the story.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, really fun, but really, really short. A maximum of 3-4 hours of story mode if you're good at the game.  Good, but not worth the £18 pricetag, wait for it to be on sale if you want it",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, really fun, but really, really short. A maximum of 3-4 hours of story mode if you're good at the game.  Good, but not worth the £18 pricetag, wait for it to be on sale if you want it",
            "review_score": "1"
        },
        {
            "review_text": "This game gets repetitive really fast, and it literally lasts just about long enough for you to finish the game in time to not be able to refund it. The game is just over 2 hours long..",
            "review_score": "-1"
        }
    ]
}