{
    "app_id": 322520,
    "name": "DYNASTY WARRIORS® 8 Empires",
    "release_date": "2015-02-26",
    "developer": [
        "KOEI TECMO GAMES CO., LTD."
    ],
    "publisher": [
        "KOEI TECMO GAMES CO., LTD."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Character Customization",
        "Hack and Slash"
    ],
    "achievements": 48,
    "positive_ratings": 561,
    "negative_ratings": 318,
    "price": 39.99,
    "description": "DYNASTY WARRIORS 8 Empires is the latest installment of the &quot;Empires&quot; series, in which you aim to conquer ancient China using both strategy and the one warrior versus one thousand tactical action the WARRIORS series is known for.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/322520/header.jpg?t=1555467976",
    "minimum_requirements": "OS: Windows® Vista, Windows® 7, Windows® 8, Windows® 8.1 Processor: Core2 DUO 2.4 GHz or better Memory: 512 MB RAM Graphics: 640*480 pixel over DirectX: Version 9.0c Network: Broadband Internet connection Storage: 10 GB available space Sound Card: DirectX 9.0c over",
    "recommended_requirements": "OS: Windows® Vista, Windows® 7, Windows® 8, Windows® 8.1 Processor: Core i7 860 or better Memory: 1 GB RAM Graphics: 1280*720 pixel over　※No 4K compatible DirectX: Version 9.0c Network: Broadband Internet connection Storage: 10 GB available space Sound Card: DirectX 9.0c over",
    "reviews": [
        {
            "review_text": "My favorite part of Chinese history is when my boy Wang Wang killed 2,000 peasants in 30 minutes on the Wu Zhang Plains.",
            "review_score": "1"
        },
        {
            "review_text": "Being a dynasty warriors franchise fan since i was young, the introduction of Dynasty warriors empires really got me excited. Having played almost all games in the dynasty warriors franchise, i strongly recommend this game if you are starting out.  Pros: - good replaybility ( Multiple scenarios) - customization  - in game tactics ( no more no brainer hack and slash) - new sworn sibilings and marrige system - creat your own story ( ruler or officer)  Cons: - having to pay accumlated points if u want weapons transfered - DLC a bit costly - your sons/daughters is randomly generated ( limited customization, repetition)  Overall i give this game 8/10  hope it helps",
            "review_score": "1"
        },
        {
            "review_text": "You know, I thought Koei would do better port job than they did with Dynasty Warriors 8 Extreme Legends Complete. Alas, I was wrong. First off, Koei needs to just stop trying to port their games to PC. They don't seem to give a crap about how they put games on the PC, and just throw horrible console pots onto Steam. Its as if they don't get a crap about PC Gamers, and only look at us as cash cows, a free source of income. Dear Koei, I don't want a crappy Mcdonald's hamburger, I want a In &amp; Out hamburger.  Now to talk about why I don't recommend buying Dynasty Warriors 8 Empires:  1. Direct console port- They put as minimal effort as possible to port the game. No optimization whatsoever.  2. Graphics and Resolution- You only have two options, 'Texture Filter' and 'V Sync.' You change resolutions by cycling through them one at a time and confirming each and every change until you get to your desired resolution.   3. PS3 Port- Its not even the freaking PS4 port, its the PS3 version. Don't even think about running it in 1080P unless you want a horrible unscaled experience with stretched out images and very grainy graphics. If you want to see how bad the textures are, just go to character creation and see how bad the outfits look.   4. $49.99 Price Tag- Its the PS3 port which is $39.99, yet we pay $49.99 for the same damn game.   5. Button UI- Even if you use a controller, the button UI layout will still show the keyboard shortcuts, making you confused at first as to what button you need to push.  6. The Game is Easy- I started a quick playthrough just to see how it was. I played on hard and the enemies just stood there and waited to die. The AI is horrible.   7. The Game has bugs- The little bit I played, I married my waifu and had a kid (yes you get through content really fast in this game.) The moment I tried to name his, game crashed.   8. $118 dollars of DLC at launch- Its basically cosmetic stuff, but the pricetag for some of that stuff is rediculous and all the DLC is twice the price of the game.   There might be other things I haven't mentioned since I rage quitted and don't have a lot of play time. Needless to say, thanks for another crappy port Koei. I can see you think we are not deserving of your best efforts, and I can clearly see you think of PC Gamers in a bad light. Its all good, you lost a fan and never will I buy another one of your ports again.  If you really want to buy the game, wait for it to go on sale. It is not worth 50 bucks.",
            "review_score": "-1"
        },
        {
            "review_text": "Short Review:  A nice sidestep of the DW franchise to the tactical/strategical path plus 8: it has a lot of stuff to make you replay the game and the editor is one of the best of the series, but unfortunately it feels lacking in comparison to DW:E7. However, considering this is the first time a DW has come to the pc, meaning that more might come too, I highly recommend give it a try especially if on discount: it's fun and still has the DW charm to it.  Don't bother if you want variation or don't like action/brawler games.   Long Review:  I've followed the Empires series for a long time now, starting out with DW:E4 (which I think it's the first of the Empires series? Please correct me if I'm wrong)) and I always loved their unique takes on the game and how it's basically up to the player to flesh out the campaign. On top of that you are able to make your own characters fight each others and with the latest installments the editor is now very well made and gives a lot of customization choices (and space).  Still I can't deny that this one installment in particular seems to be the most lackluster of all and that the more I played, the more I wanted to see things happening in game, making it feel more like lazy work.  A lot has been improved: the editor is definitely the best of the series (for me at least) and you can edit almost anything, even single musous that you want: ever wanted Lu Bu skill set but with Diao Chan's Musou? You can! On top of that you have far more slots to create, have a lot more of color choices (for some reason DW:E7 had less colors) and even more weapons to choose, some of which are from the DW:8's DLC. Sure, the editor is still stuck with those pre-made assets and outfits and almost all of them are taken from previous Empires Installments, but it's very nice to see them implemented into a better editor that lets you make all sorts of characters: from giants to dwarves, from busty ladies to Lo-I mean young girls. Overall it's a nice addition and I hope they keep doing this for the next installment too.  Now for the game itself...well it's still well made and I see they improved somethings, using the mechanic of vagabond-officer-ruler taken from DW:E6 (yes it started there) but amplified a little more. Still I can't say I have seen a lot of difference at all and I might forget some details, but overall it feels the samey.  As a vagabond you just wander around the land, take quests and if you want you can choose to serve under a lord and make them the most overpowered forces in the land by giving them flash victories within 5 minutes. Or just keep doing quests because why not, but as a wanderer you won't be able to 'win' the game: it will send you back to the main menu without even rolling the credits, or the ending cutscene (unless something has changed?).  As an officer it's pretty much the same too: you server under a ruler that with the right rank you can give your take and ideas for the land's conquest, or make your kingdom flourish in money or else but nothing much is done here. At each council you're also able to partake to a max of 3 goals to achieve within that time spam (4 ingame months) in order to get more merit points (the experience points) and level up and to upgrade your equipment if you got the right shop in that land, as you can make them yourself by building them. As an officer you are given some choices and options but aren't as important as the ones of the ruler, which I will mention briefly.  The main issue as an officer however is that your ruler is a joke for the most part and unless he's a warmonger (as in, a maniac) he won't bother attacking other kingdoms or anything and simple increase your incomes for no real reason: I was often rich and had everything maximized but my ruler wouldn't attack! I had to give him that suggestion myself (after a promotion) to do that. And to get promotions you need to do a lot of sidejobs, so it becomes easily longers but not really fun. I can safely say that I didn't have much fun as an officer because I felt hindered more than anything.  But as a Ruler it's totally different: as a Ruler you're given a lot more choices - yes even invading (DUH!), and also to split the land between your officers for maximizing protection: that way whenever your land is under attack it's that officer's job to defend it, instead of yourself. Of course it doesn't always work but it helps if you don't want to do defend that zone yourself. You are also given the choice to order your people around the battlefield (you can also as an officer, but only if you got the right rank and also if you're given the command of the battle, but I wasn't able to able to command many battles as an officer), and on top of that I forgot one additional detail of the new game: the stratagems, which are essentially skills that you use for either strategical help (like turrets near a base, or flame arrows for lowering the hp of enemies around the base) or healing or even teleport to base. I think they're ok but nothing too gamebreaking but if done well they can really be gamechanging, especially if you're near losing.  Although you get to die twice before you lose the match instead of once.  Other additions were also made but don't feel well implemented: now you can have children with your spouse but it's so cheaply made that they might as well not insert it because when you get it, the game pops out a soldier telling you that you had a healthy child and then you get to name it. It's so disappointing and really feels cheap. On the other hand, your child can become an officer and will share abilities between the parents (one of my child shared a blind eye...it was so funny I even made a screenshot. Talk about healthy!) and it's surprisingly better implemented because you see the family 'somewhat' relating together as the parents see their child start their fighting...but that's it: as soon as you fight your child is no longer considered yours, your wife/husband is not yours, and everything is the same as there's no special lines of dialogue in battle between married couples and feels so badly done, especially since I was waiting for this feature in a long time.  The game has also the usual scenarios to choose but they're less than before, but then you get the free scenario where you essentially play with random generated kingdoms for random fun everytime: in this part however you can make also your own kingdoms and use them into premade scenarios to play for some specific ideas, as the kingdom edit is far better than the previous and allows you to put 10 officers into it and also customize the soldier, banner and color. Overall it's a nice addition but this is up to your imagination, because while the game is big it also feels lacking some features...and also polish.   The game feels very unpolished despite being a port, which is very depressing because I know the games can be better (heck I played Samurai Warriors 4 on the ps4, and that game is a joy for the eyes too). Sure this is still a good game overall and you get a lot of content, but I can't deny that the lack of 'actual' new features got me bored pretty quickly.   Despite the improvements and a welcome addition to the Empires series, I would recommend the game if you actually never played any of the series before, because for once I felt really 'bored' at playing this entrance but that's because I played every other installments before this so it's hard to not notice the differences.  But if you haven't, you'll have a blast and even if flawed, I can't say that's a bad game. It's unpolished, but still fun.",
            "review_score": "1"
        },
        {
            "review_text": "- Made my character a Cat with a giant head. - Married Lu Lingqi, Lu Bu's daughter (Which I pursued) - Had a daughter, called her Lynn Cest - Executed all the males, enrolled all the girls as officers. - Made banquets most of the turns.  10/10 Would make a decadent warzone Harem again.",
            "review_score": "1"
        },
        {
            "review_text": "Don´t play this if you have stuff to do, this game is too addicting. AND I LOVE IT",
            "review_score": "1"
        },
        {
            "review_text": "Game is very good if we are to compare to Dynasty Warrior 8 Xtreme Legends, it has a lot more replayability and customization. In general at least for me it is way more fun and in the next days and so on I will probably easily surpass the time I did spent on Dynasty Warrior 8 Xtreme Legends.  I think it's easier to point out the negatives as they were few for me:  - Graphics are pretty bad, probably a PS3 port. My goodness, why not just port PS4 this time? It would be excellent. The map textures are noticeable bad ( mind you, I did play on max graphics ) and even of the cannon fodder characters.  - Some may see it as a negative, if you plug your controller it doesn't change the icons to help easier management.  If you did enjoy the other DW game on Steam, this one you will have a blast. If you didn't purchased the other game, I'd recommend this one over that other which is mostly focused on storyline while this one has lots of replayability.",
            "review_score": "1"
        },
        {
            "review_text": "There is something about mowing through hordes of enemies and then, mowing through hordes of officers with Musous and weapon combos. It really scratches that hack n slash itch for me in a way other games don't. I think I may just like seeing my combo and kills counter go up.  There are so many weapons in this games too, I havent even gotton a chance to use all of them. The Stretegems are pretty great too, I race race Lu Bu's red hare all the time with the speed increating ones. I can go on and on about all the neat features in this game but that would be dishonest. Because all these cool sounding features are really shallow. My dog would die of dehydration if I put this in her water bowl.  I can't wholehearly recommend this game to anyone, it's a niche title in the Musuo genre. You have to -really- want to play your own character and take over China because thats what you will be doing over and over again.  The character creation is really the only appeal I can see in this game over the DW8XL game here on steam, there are plently of VAs, constumes and weapons, and you even even choose your musous. And bonus, the face options don't completely suck like 90% of WRPGs.  So, you can have fun making something nice rather than concentrationg on trying to make it look human, unless you're into bizarre stuff, the sliders are generous.  As for everything else. Im starved for more substances in certain areas like quests, invading, dialoues and just the overall progression. Empires is pretty fun, but you can also see how hard to devs worked to make it look lazy and unpolished. The novetly of the actual game wears off, and my source of entertainment is purely from the weapons and CAW or else I would have stopped about about at around 10-15 hours or one playthrough ( if you stretch it).  I also suffer from a bug that where I only my game crashes 90% on the title screen. The PS4 grafics didnt get ported. And if you alt-tab the menus can become corrupted the point where you have to kill it in the task manager.  So there you have it, DW8XL lacks a character creater and DW8 Empires is shallow.  KOEITECMO, please stop making one game into two seperate titles. You're bad and you should feel bad.  It's okay to like ♥♥♥♥♥♥ games, stop getting so upset. Now.. FEAR THE DRAGONS ROAR!  __________ Looks like Im getting downvoted for real.  It's still a shallow game though. I can kind of respect how willing people are to defend it but I decided to look at objectively and it's fun, but it lacks too many aspects and Im not afraid to say this game is far from perfect. The rough edeges are everywhere, it could be so much more. I bought the games for something like $50 or $60 and it feels liek soething I should have had in DW8XL all along.  Get DW8XL for an experience that I consider better than this. Both games follow the same rules for the most part.  And do yourself a favor and ask for more in the next instalment. I can only speak for the PC version but endorsing games that obviously have many flaws and have been cut back or split into seperate games is just a disservice to yourself. I dont think anyone can deny that this game doesnt have elements of all those things.  This game deserves it's red fonted mixed rating and I cant help but think that DW fan are the main force propelling it even that far which I f\\ind a littel dishonest.  It's okay to like bad games.",
            "review_score": "-1"
        },
        {
            "review_text": "This would easily be my favorite game type of Koei's Warriors series if they just ♥♥♥♥ing innovated the thing. Could you imagine the old styled ROTK games (especially 10) mixed with Dynasty Warriors? It'd absolutely dominate the market.   This is a poor attempt at best and absolutely lazy at worst. Empires has the most potential to be different from the norm outside of all of the Warriors titles. You're wasting it, and there's nothing I hate more than wasted potential.",
            "review_score": "-1"
        },
        {
            "review_text": "Of course the primary allure is the hero-maker, that oh so rare 'character customization' tag. You want to make a fictional warlord with a voice deeper than Davy Jones' Locker and with a totally accurate Chinese name covered with black and gold body armor and wielding a sword the size of a door-frame to claw, hack and betray his way up his kingdom's ranks? You can do it. I named mine Ho-Quan Shi and he's awesome. You want to create some midget lady with a giant's cat head wearing a loincloth that taunts her enemies with the 'alluring' voice set and carries a bloody mega-drill three times her size into battle? You can do that too. Her name was Hee Ho. I don't know where she came from or why she appeared in my game with 50+ painstakingly accurate heroes but suddenly Lu Bu was calling a furry drill midgetess to help him out and Ho-Quan Shi lost the battle and got his head cut off.  102/10, would have Chinese god of war make comeback from defeat with 4 foot tall Meow Cat",
            "review_score": "1"
        },
        {
            "review_text": "Terrible game, i'd reccomened everyone go and play the ROTK series if your'e looking for strategy, this is exactly the same as dynasty warriors 8 witha few customization features thrown in and no way worth the ridiculous price tag ! ",
            "review_score": "-1"
        },
        {
            "review_text": "This review was initially postive but after rereading my review and thinking about what I've said and asking myself, 'Do I really recommend this game?'. The answer was no. After everything I typed, I thought 'yeah, I had fun so I recommend it.' but that was because I was fine with it. After reading what I put down, there was a lot of negatives so I thought about the people I would give it to, they wouldn't enjoy themselves. So after thinking about it, this review is negative.  I can't say anything about the graphics since I play everything except for the Texture Quality on low so everything but the officers look like ♥♥♥♥ because I have a really ♥♥♥♥♥♥ computer. The gameplay itself is pretty much what you expect, you grab a weapon and pretty much kill everything in sight. The dlc weapons have come in without having to buy it which is quite nice like the bench, boots and the flame sword. So if you're expecting anything from the gameplay, you're pretty dumb to expect that. An issue that is known is that  ALT-TABBING  will usually crash the game depending what menu your at. So be sure to save often since there's no autosave whatsoever or you'll have to restart.   The strategy in the game using strategems is actually quite nice. Some are more useful than others so you'll eventually have the 6 strategems you'll forever use. Large scale ones are quite good. They can either make or break a battle and it snowballs fast which I do enjoy and makes me feel like I deserve it especially when I'm losing. HOWEVER, ♥♥♥♥ any officer that has  SWIFT RAID  (most notably Guan Yu) If I am disadvantageous in a battle and order everyone to defend. The ♥♥♥♥♥♥♥ officer with that strategem will constantly use it and teleport in an enemy base inside enemy lines and proceed to say he's in trouble. Specific strategems for offense and defense like Fire Attack for advancing or Unity for defense should be used when the order is given, otherwise they just kill themselves. The turn-based part of the Empire Mode is alright. I wish you could make alliances without it being a objective or that I could threaten another province without a specific officer having the ability to. As an officer, it feels like you're the only one doing anything like raiding and inviting officers which other officers do only if you're a ruler. They should've made it where like when you're a ruler, the ruler AI would make policies instead of invading every war council because being an officer is just a chore. You literally do all the work from invading because they can't take over a region without you, you do all the defending because they won't even try and they won't even try to increase your resources other than the guy that recruits troops randomly and he isn't even an officer. The shop, academy and blacksmith is kinda useless unless the prefect or strategist builds stuff for it which they won't and It involves having multiple ones. It honestly feels useless because gameplay is easy already because the AI themselves aren't too great. They don't attack when you have an opening and are only a problem during 3 or more officers. After playing a couple more hours, I've noticed people take note of you if you're decimating them. What Koei should have done to make it rather interesting is that if someone notices how well you're doing they need to buff that officer and make him target you. When I say buff, I'm saying like double to attack, defense and speed and even super armor. (the super armor might be a bit much) And If they do beat you, there should be penalties like morale down. It would've made you feel like you were too good and you were enemy number 1. Instead they just say 'Holy crap, that guy is really good!' and just keep doing what they were doing. They need to make it seem like we are really good and needed to be taken down. They also need to make enemies more aggressive and not scared to start swinging at you. I honestly felt there wasn't enough interactions between officers on and off the field. Like I would've liked my wife Wang Yi to at least not just give me a gift but also heal me by spending time together randomly like Dynasty Warriors 6 Empires. It felt like she could see I was working real hard and needed a break. Also being, there is dialogue for someone finding you suspicous however, I never could find where it would've been said. Even when I make my own ruler exile like 15 officers and make most of the regions unhappy. None of them say anything about it or even try to make them happy. No one really notices your actions and if they do, it's just the enemy and ask you to join them. Like no one has ever requested reinforcements, requested a joint attack, and no one has appeared as a guard.   Alright, now for the character customization. It's fairly good with many choices. You can make a variety of outfits, have many different looks and use all movesets, EX attacks and musou from both Dynasty Warriors 7 and 8 including the 2nd EX attacks from Dynasty Warriors 8 Extreme Legends. What I feel is like a miss was that you couldn't change what weapon type the weapon had like the Spear had whirlwind or that the Dragon Spear had dive. It would've been nice to switch some of these weapon types to make it feel more personalized. I personally love the moveset of the Double Voulge but I hate whirlwind. The customization for horses, banners and soldier are quite bland, nothing really special. I do like downloading other peoples custom characters they upload. A lot of them are pretty cool. You can see a lot of funny ones like I downloaded a custom group that were all Dwarves. The only complaints I have with the customization might just be personal reasons but I found the voices kinda unexpected. As in, I wish there was a gallery alongside the other Musou characters where it displayed their lines like the line they say when a battle starts. Also, there should've been at least 2 voices of an evil type. I wanted to make an evil character and the voice I thought sounded the most evil ended up saying 'I'll be the light' or something like that so it was really disappointing.   Overall, the game needs lots of work. It decided to do something different and overall, didn't do every well. It lacks things present in the other Empire titles. If you're a big fan like I am, you'll probably buy it but you'll know what you're stepping into. If you're not a fan then just steer clear of this one. If you're still curious about Dynasty Warriors, I'd say buy Dynasty Warriors 8 Extreme Legends since it has way more to offer and gives a good introduction to the Three Kingdoms.",
            "review_score": "-1"
        },
        {
            "review_text": "Well been playing since the game is pretty much several hours before 27th of February. Well as how I saw the released DW8XL, well it's basically the Empires version of that same game engine. To be honest, I've been itching to play a Empires version of Dynasty Warriors since long time ago, only experienced the Dynasty Warriors 5 Empires on PS2 only.  This game is what I've imagined it to be like, the newest character roster, weapons, maps, or whatever, but in Empires mode, with the goodness of a robust Edit Mode that had been ever existed since in this series(DW8 was the newest of course lol). So it's pretty much awesome enough even if without those DLCs unless you are big fans, then don't really have to bother with those cosmetic DLCs lol.   I've played it in a casual mannered way and it's actually fun, I've spent longest time for now on the Edit mode to create some characters but then this game is 'EVIL' cause they even let you to build your 'OWN' ARMY which is like a whole list of CAW characters to be your Officers and even change your soldier and mount is amazing enough though it's just simple. I'll need more time to fill those Edit list filled with my ideal characters soon.  The gameplay well, it's the same Dynasty Warriors duh, and it's just awesome mowing down enemies like you're a god in Normal Mode, heck even the Affinity system disadvantage/advantage will not help much on letting them survive from you lol. I've originally started out as a Ruler but then I got overwhelmed by alot of things, so eventually I decided to go out as a Free Officer, which is I think much beginner friendly and realistic alike, So I've joined a random Nation nearby and kicking ♥♥♥♥. Eventually randomly got confessed by the Nation Ruler by accident,married and ♥♥♥♥, and even got a ♥♥♥♥♥ fugly side character asking me to be sworn brothers, lol what.   Graphics are just.....well its nicer looking than PS3 maybe, but sadly it's not Next Gen lookalike,but I think it's fine since Next Gen resolution stuff might have some porting issues, like those new games released recently like Assasins Creed and stuff, so 720p or not who the hell cares, the game does work fine if I set it on medium, and 1080 resolution, No bugs encountered that will break the game at all. It's all fun ol' Dynasty Warriors.   There's a Free mode I haven't try out but I guess it's just a simple make your single match mode, pretty much, The only thing is maybe if this game is priced lower abit, more people might get into the PC version much. The game is in whole package a solid game experience.   9.986567257574844635435758684563/10 would replay in Chaos mode when I mastered it.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty upset with how glitchy my XBOX 360 controller is with the game. It's damn near unplayable. Thats my only gripe with it. I hope this gets fixed. If all the controls are this bad, I wouldn't recomend it. *UPDATE* The XBOX One controller works perfect. No problems with the game now. Love it!",
            "review_score": "1"
        },
        {
            "review_text": "To sum this game up in one word: atrocious.  I played the old dynasty warrior games and they haven't really changed since 3. Same hack and slash. The graphics (at least on this shoddy port to PC) look like PS2 graphics when on max settings. The game is very buggy and clunky. The controls took me an hour to set up in any way condusive to being able to play the game. The original price being $50 is just insulting considering how bad this game is.  Do better.",
            "review_score": "-1"
        },
        {
            "review_text": "In fact, the steam cloud is still broken. I'll change this review when the cloud is fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "Truth be told I'd recommend piracy. This is the worst kind of port, and is only servicable to the most hardcore of fans, such as myself. It has bare minimums of support given to it, with only a handful of BGM, and only 6 scenarios. They charged full price for a game that is barely in a functional state: then charge 7-9 dollars for each of the 23 DLC packs they made for the game. None of the DLC is worth purchasing, yet the game might actually be valued at it's 50 dollar price tag had it just been included in the first place.  Suffering from minimal soundtrack, a burdening quantity of excess DLC that is both overpriced, and seemingly cut from the original product, and lacking the refinement of US voice actors, or even complete, accurate translation, this game is not worth the asking price. I would only suggest purchasing it if you are a hardcore Dynasty Warrior fan, whom is purchasing the product out of support of the company, more so than to enjoy the game you purchased.  For everyone else, there is piracy.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a REALLY REALLY GOOD GAME! Best empires mode so far! Just ONE 'small' problem:  THE BUGS ARE RIDICULOUS IN THIS GAME. You'll get EVERY kind of bugs, such as voice acting bugs, dissappearing weapons bug, random/weird weapons bugs, and slow loading. If you can look past all that, great game.",
            "review_score": "-1"
        },
        {
            "review_text": "For those who love Dynasty Warrior, you should consider buying this one.",
            "review_score": "1"
        },
        {
            "review_text": "i've played dynasty warriors for 8 Years, and i like the empire series.. I usually play DW 5 Empires, I loved it, until my brother bought me this game, i can't help to stop playing. IT IS AWESOME!  Eventhough i didn't understand the commands at the first time, but then i got better.  I recommend this game.   But it has a slight error, if u accidentaly switched to another tab, then the game didn't responded. (FOR GOD SAKE DON'T FORGET TO SAVE)",
            "review_score": "1"
        },
        {
            "review_text": "I really like this mosty for creating diffrent thems and make it the best them ever if you like Dynasty Warriors I am sure like this one",
            "review_score": "1"
        },
        {
            "review_text": "awesome character and map editor with chill and fun gameplay make this the best local cooperative game available on steam",
            "review_score": "1"
        },
        {
            "review_text": "Always been a fan of this series and the SW games /Romance of the 3 kingdoms/etc. Even though its odd they didnt have a English Voice Over but it still stop me from having fun  Cant wait to play SW 4-ll and Empires when it comes out ( hope for the Pc ports for empires :))) )",
            "review_score": "1"
        },
        {
            "review_text": "Very good game with some repeatetive aspects for some people.  Good stuff + Character creation and the entire army creation + After campaign is over you can um... 'save' your children and build up your huge army + If you play online you can get some custom characters from other players into your game! So amount of characters can be rather sky high + Neat and very enjoyable combat + This may sound weird, but if you find campaign easy, repeatetive and boring - go on higher difficulty. I did that and omg game got way more colors! You will actually have to managing empire itself properly. You will be attacked from multiple nations and you need as much provinces as possible on top level for them not to fall into enemy hands in one turn. + Very good performance on 50/50 PC + Beautiful asian art style  Bad stuff - Can be little bit repeatetive, but try to increase difficult. That should get your entertained and challenge your reflexes and spike interest to the game. - Characters don't save level after campaign is over. You can however get weapons from blacksmith outside from campaign. Those (me thinks) should pop up in campaign.",
            "review_score": "1"
        },
        {
            "review_text": "Almost finish creating my character",
            "review_score": "1"
        },
        {
            "review_text": "this game will make you have a ball and want to play it all the time.",
            "review_score": "1"
        },
        {
            "review_text": "Now I wanna be straight up and say 'I love this ♥♥♥♥ing game' but that's not what a review is. Now I love the Dynasty Warriors games, the prospect of killing thousands of soldiers is nothing but stress relief when you've had a bad day or just want to be a 'God of War'. This game is no exception. It has the sword, the axes, the spears, the ♥♥♥♥, the ♥♥♥, I could go on and on (like the jet black chrome).   This game uses 'Strategems' they are basically your methods of messing up the enemies and buffing yourself up like crazy. My favorite has to be 'Lightning Speed' you just move so fast and your attacks also speed up, making you a BLENDER OF DEATH!!! *Ahem* anyway they also introduced'Large Scale Strategems' in this entry. They are your basic strategems however they affect whole battlefields. You could have your normal fire attack, or use 'Inferno' to burn every enemy base because ♥♥♥♥ it! I'm an arsonist and I want to see everyting burn.  Now the great thing about 'Dynasty Warriors' is that you play as a character that is full of color. They entertain, they fight, they even feel bad about everything they've done wrong. In this game, that element is very supressed. All the characters say the same thing to another, even if the person is a wife, sworn brother, or child. It's a missed oppurtunity and even the already established characters are like that. The biggest example has to be Sima Yi. This guy is a natural born villain. He laughs at everything and takes every oppurtuinity to call someone an imbecile. In this game, he may have said imbecile in one line, and laughed in a 'Musou Attack' or when he stated he was drunk. Honestly, this made me a little sad but hey, you can do some funny ♥♥♥♥ with the events.  Unlike most 'Dynasty Warriors' games you start off with every character with his or her full moveset. Custom characters use these to full affect and you can even mix and match Musou attacks. For this game I reccomend the movesets with 'Whirlwind'. It sure as hell makes the 'BLENDER OF DEATH' even more powerful and they tend to clear out crowds even better. Character Creation is really in depth. You could change your characters hair style, facial features, and clothes (which this game is filled to the brink with, even moreso with the DLC.) Now you're asking 'What's the purpose of level ups?' Well your level dictates all of your stats (like strength, defense, and leadership). Your 'Way of Life' dictates your starting level. Now how you find out which 'Way of Life' will benefit you the most is beyond me but you could use bonus points to just cheat yourself to Level 50. I won't judge...  Now I swear this game will crash like nothing else and this is not a problem I'm just having. A lot of the reviews have mentioned crashes and I don't know if it's just because a majority of us have ♥♥♥♥♥♥ laptops, or it's because the game can't help but crash. People have mentioned it being a PS3 to PC port, so that may be a problem but I don't know but if you plan to play this game be wary of that.  Overall a great game. Although events and character interactions could use work, the combat (as usual for Dynasty Warriors) is fun and fast, and Character Creation is really in depth and a big time waster (Hey don't judge me if most of your time was on edit mode). This game may crash more than my Android Phone but that is no excuse to not by this game.",
            "review_score": "1"
        },
        {
            "review_text": "Edit: After the game had updated there are no longer bugs just like flickering floors or eyes coming out of the character.  I've been in love with the series for a long time. Glad to see the game turned less into a sausagefest. A really fun game that allows character creation and lots of slots so you can either upload or download other characters people had created. It does actually get boring that it does seem repetitive for all empires is capturing objectives, Unless you are good at roleplaying it won't get boring much.  10/10 Would help Lu Lingqi have vengance on Cao Cao for killing her father. and have a child with her xD  Ps: Fav couple is mostly Cao Pi and Zhen Ji  Edit 2: Forgot to mention... The having a child part, please update that so once you save the child have it say a son or daughter of this particular person/ with this Musou character or created character. I don't want to always say 'oh shes just confessing on how much she loves her dad' ;-; No Incest please.. xD",
            "review_score": "1"
        },
        {
            "review_text": "If you like Dynasty Warriors, you'll like this. All there is to say really. If you haven't played DW, go watch some videos and see if it interests you. The controls are a little wonky and take a bit of getting used to.",
            "review_score": "1"
        },
        {
            "review_text": "Holy crap.... is that sunlight?  Pros: -Empires on PC  -Customization is really good. Got lost for hours doing that shet  -Runs really smooth, even on max settings. No crashes either!  -Kids are fully grown in a few months time, so no headaches that come with the real-life alternatives  -Marriage, while fairly shallow in the game does wonders for immersion... wish it were like that in real life /sigh  -LuBu's daughter dayum!   Cons: -PS3 Textures/Graphics... even with max settings, it's quite an eyesore to see... especially in cutscenes. (Haha, no-name officer with huge eyes comes to mind, spat my drink out after one proposed in a cutscene). Luckily SweetFX made my game look 99% better after some tweaking.  -The soundtrack: while awesome, get's repetitive quick. Think the soundtrack DLC should have been included instead of being seperate content.  -HUD is a bit too 'in your face', would like to see option to resize it in future titles.  -An option to opt out of marriage/children because if you play a female character, everyone and their fathers/sons will fall in love with you ROFL! After about the 35th proposal by a faceless officer, I was fed-up with playing a female.   Overall score:  7.5/10 - Fun but with a little fixing up (mostly in the graphic/music departments) this game could be alot better! Still, Empires on PC is something you shouldn't pass up if you don't own a console! Nao time to collect some of dat DLC...",
            "review_score": "1"
        },
        {
            "review_text": "Game is pretty good, some few bugs there and questionable port choice.  It's most accurate deciption of China during Three Kingdoms.  (May contain traces of Lu Bu and Cao Cao)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but i have a question...    WHERE THE HELL ARE ALL THE OTHER SOUNDTRACKS KOEI????",
            "review_score": "1"
        },
        {
            "review_text": "Dynasty Warriors 8 Empires can be summed up as sloppy.   The combat is there, and there are a ton of customization options. However, the game seems to just reuse some of the better assets of prior musou games. The new content is uninteresting, and the port feels like it was done as an afterthought.   There are better Empires games out there than this, and there are better Musou games on Steam. Don't waste your time with this one unless you're just itching for the Empires formula gameplay and don't have access to others in the series.",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics aside this is by far the most fun I have had with a Dynasty Warriors game so far.   -All of the keys can easily be rebound to your gamepad or keyboard.  -It may not be optimized for the PC but it really doesn't since the gameplay is extremly fun to just like all the other Dynasty Warriors game we have all come to love.  -Price tag and the costly DLC are they only downsides. That being said DLC is not required at all to make the game playable.",
            "review_score": "1"
        },
        {
            "review_text": "dang I spent like a hundo hours on it I can't really say I hate it?",
            "review_score": "1"
        },
        {
            "review_text": "This game is really great. Nothing else.",
            "review_score": "1"
        },
        {
            "review_text": "Pro: On Steam. Good fluid gameplay. Doesn't lag or stall for me. Good Edit Mode options.  Con:  Not really optimized for PC (lazy port). A lot of DLC for a newly released game. Not an improvement from Empires 7, a bit 'dumbed down' from Empires 5.",
            "review_score": "1"
        },
        {
            "review_text": "So... Dualshock 4 controlers don't seem to work (they don't for me at least) and the game freezes every time I try to rebind my keys for the keyboard. With no good control layout I've basically given up on this game until they hopefully patch the technical issues.",
            "review_score": "-1"
        },
        {
            "review_text": "Is this a good game? Yes, I like this game alot. With saying that I like this game but the PC controls are horrible. This game seems to be a direct port from the console. This means you cannot use a mouse with this game. That is a huge negative for me. You also will have a hell of a time trying to re-map this game. Yes I like this game it is a good game I just wish the controls were better. If you have a controller and don't need to re-map the game it is perfect. But if not I cannot recommend this game thats how much the controls are broken.",
            "review_score": "-1"
        },
        {
            "review_text": "Gameplay is fun but graphics are very poor even on maxium settings.   Can not use Xbox One controller for gamepad but to my knowledge Xbox 360 and DualShock controllers work.  I got a refund mostly because I only have an xbox one controller and the pc controls for this game are very poor.  3/10",
            "review_score": "-1"
        },
        {
            "review_text": "It's great to fight aside He Man in the battlefield",
            "review_score": "1"
        },
        {
            "review_text": "spent 1 hour 45 mins enjoying creating officers/soldiers starting an empire ...then played for 2 mins and realised the controller support was poor, looks exellent if you enjoy the keyboard but if your a controller player like myself this is not for you.",
            "review_score": "-1"
        },
        {
            "review_text": "This game blows for PC. Period.",
            "review_score": "-1"
        },
        {
            "review_text": "Ive always been a fan of the games espescially the empires versions because of the character creation. The only down side i had was the controller issue but after a few rounds and going through the settings and controls you figure out the keyboard controls and get right back to the game. If you like hack and slash combat and character creation this is a great game to have.",
            "review_score": "1"
        },
        {
            "review_text": "Good game and well made, and have only encountered one bug so far. However the game sems a bit short and repetitive and the tutorial is kinda unhelpfuld in how to do stuff. So in short good game, bit on the short side in length and options, would recommend only when not at fuld price.",
            "review_score": "1"
        }
    ]
}