{
    "app_id": 322910,
    "name": "Warhammer 40,000: Regicide",
    "release_date": "2015-09-08",
    "developer": [
        "Hammerfall Publishing"
    ],
    "publisher": [
        "Hammerfall Publishing"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "In-App Purchases"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Warhammer 40K",
        "Strategy",
        "Chess"
    ],
    "achievements": 35,
    "positive_ratings": 1158,
    "negative_ratings": 468,
    "price": 7.19,
    "description": "Warhammer 40,000: Regicide is a brutal take on one of the greatest turn based strategy games of all time. Regicide fuses multiple phases of gameplay with dynamic action. Maneuver your army into place and unleash a devastating array of tactical abilities to crush your enemies.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/322910/header.jpg?t=1528853013",
    "minimum_requirements": "OS: Windows 7 Processor: 2.4 GHz Dual Core (2.4 GHZ) Memory: 3 GB RAM Graphics: NVIDIA GeForce 8600 GT / ATI Radeon HD 2600 XT or greater DirectX: Version 9.0c Network: Broadband Internet connection Storage: 5 GB available space Sound Card: DirectX Compatible Additional Notes: Broadband Internet Connection required for Multiplayer and User Account functionality. A Warhammer 40,000: Regicide User Account is required to use the game's online services. The game's single player Skirmish mode is playable in offline mode.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I enjoy a good game of Chess every once in a while, and I love the 40K universe. So combining them should be a perfect game yes? Well, I have a few issues.  The gameplay as far as how the chess board looks, and plays is great. The models look astounding, and the animations are almost perfect looking when taking opponent pieces.  What I'm mad at is that 40K is about variety and costom armies and such. I bought this in early access and they only had Space Marines and Orks. You only have a few skins available for the armies, but skins like Space Wolves for your Space Marines are the exact same models as all the rest. That's a problem when an army like Space Wolves have very different features like fangs, and different ornaments for armor, and even different weapons. Instead, the models look just like the others. And I was told that they were supposed to have more races than just SMs and Orks. Love SMs, but again no variety. I want to see some Tau, and Tyranids, and maybe at least some Eldar or Imperial Guard. That hasn't happened, and it doesn't look like it will.  If none of that matters to you, and you just like chess then get it. Good chess game. If you are getting this for 40K reasons, don't give your hopes up. I got it for 40K reasons, so I'm not gonna recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "My son is into Warhammer 40k now. It took him about 2 minutes watching this game and now he wants me to buy all the God-Emperor-damned miniatures in the galaxy. WAAAGH! Thanks a lot!",
            "review_score": "1"
        },
        {
            "review_text": "Got this on sale for less then $5! A 40k game with these graphics, voice overs, and action for that price is a steal. I am also seeing lots of new content updates with free DLC!  The gameplay is a bit weird at first, the whole chess thing and all but you get used to it.  The one thing I do not like that I see a lot of people talking about is the crazy miss chances everyone has, it's like a Star Wars movie!  A must have for $5 But for $15....nah.",
            "review_score": "1"
        },
        {
            "review_text": "I am liking the game. Can play normal chess or regicide. Regicide is modified chess where the pieces still move like thier chess counterparts and still 'capture' or actually kill like normal, but also have abilities, health bars, etc... that can damage, buff, or defend other pieces, so you can still kill a piece with abilities .  They plan to give other objectives/missions such as survival, take and hold, etc. The game even in early development has some great visuals and sound. REALLY like it!! Especially for the price!  Update: 3/16/16 These guys are still very active with the community by hosting events and giveaways. A nice game and small community that wants to see some new faces.    I will add that Warhammer 40k Eternal Crusade is bloody beautiful and a lot of fun. I highly recommend it. Like most games now days you can use my referral code for free stuff to get you going. Or if you have a friend playing they probably have a code, use theirs, they will love you for it, if not then here is mine: EC-2TFABZUGJV0QL  www.eternalcrusade.com ",
            "review_score": "1"
        },
        {
            "review_text": "Warhammer 40,000 and Chess: should be a winning combination for anyone with fond memories of the tabletop miniatures Games Workshop games.  However, it comes with several problems, very few of which are to do with the game itself...  - A third-party account is  required  for multiplayer. - A third-party account is  required  for unlocking Steam Achievements. - Offline progress will not carry over to your third-party account when created.  I'm pretty tired of needing third-party accounts for games; if it's only on Steam (which it is on the PC, it does admittedly have cross-platform with iOS...) it should integrate Steam to avoid needing  yet another  account to be created.  I want to recommend this, I really do... but the above totally puts me off. I feel extremely tempted to request a refund.  Not recommended.  edit:  Following a reply from one of the developers, Daniel Todd (which is, I admit, much more than I expected, so points to Hammerfall for that!) I will add some further points and clarification...  First, I'll add some positives!  + Graphics rather good. + Skippable animations (for when you've seen your Tactical Marines open fire in the exact same way for the thousandth time...) + There  is  an Offline Mode + It's Warhammer 40,000 + It's also Chess  Now, perhaps I'm naive, as I'm fortunate enough to have a system to game on where I don't really need to worry about 'minimum' specs... so I don't tend to check that area of the Store Page. Where I  do  check is the bar on the right-hand-side (the one that lists 'Single Player', 'Multi-Player', 'Steam Achievements', 'Controller Support' etc...) because many other games list there if they require a '3rd Party Account' - Uplay, for example.  So fair enough; I can see the appeal of a centralised account for some, however I rarely if ever play multiplayer in any game... I was more surprised to find that Achievements weren't unlocking with my Offline campaign. While I don't 'chase' Achievements (if I get them I get them, if I don't I'm not too worried) that really confused me for a while!  I may yet make a Regicide account to play online, as I will admit I've been having fun in the single player.",
            "review_score": "-1"
        },
        {
            "review_text": "I was not sure about buying this but after playing two games of this I am glad I bought it. Basically its Battle Chess with a twist that you have points to spend each round to shoot or defend. It plays really well and had a simple training level. I would recommed this to anyone who likes chess and if you like Warhammer thats a bonus.",
            "review_score": "1"
        },
        {
            "review_text": "I'll review this as a single player game as multiplayer seems dead as a doornail. The ability to hot-seat is likely to be a great benefit, however.  At its simplest, this is Battle-Chess. In 'Classic' mode, you can just play chess against the computer or another player - using your Warhammer characters. Each piece is taken rather violently with whatever weapon the character has to hand. To be honest, if you enjoy chess, this is a lot of fun.   The 'Skirmish' mode is similar, except each piece has weaponry and can take a certain amount of damage. It's not chess, but it does add a new wrinkle to the game, which makes for some interesting play.  The campaign mode has a lot of playability. You progress by completing chess-type scenarios, with warhammer characters that correspond to chess pieces. They can, however, capture pieces through moving, or damage/destroy them with weaponry. The board also has barricades on it to spice things up, and there are different victory conditions which alter how you play.  I'm really enjoying this game... but you probably need to have an appreciation for chess and, at the very least understand how the pieces move.  If you go into this game thinking it's a regular turn-based strategy game, you may be frustrated at not being able to move your tactical marine (read: Pawn) to the left, or capture the piece in front of you... and you may be annoyed that the heavy-bolter marine (read: Bishop) can only move diagonally.  If this isn't a problem for you, then this game is a great addition to the Warhammer 40k universe.",
            "review_score": "1"
        },
        {
            "review_text": "It's chess.   And it's brutal, and it's simple, and it's worth 5 bucks.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting warhammer 40K take on chess. Played through a game and won with just my king left. There is a campaign mode (currently not playable), skirmish and online modes. I imagine that later they will add more backgrounds and units. I wouldn't be surprised to see other chapters appear as DLC's after the main release as this seems to be the norm with 40K video games. There is currently no save game during a battle. Although this adds to the tension I would like some kind of save feature as a battle can last quite a few turns. The animations are great and pull no punches with graphic gore. The units are nice and detailed. I'm not so sure on the voices though as I miss the deep metalic terminator voice. Again this maybe something they will polish towards release.  A great start and already very playable. I hope they bring out a ton of different pieces for this game as that will just add to the longivity. I await with eager anticipation as to what they will add next.  --------------------------------------------------------------------  Update on Released Version 08/09/15  I liked this game right from the start of the early release. Chess has never been so much fun. The completed campaign adds an interesting story element to the game with different primary and secondary goals for each mission. Chess fits in well with the 40K universe as both involve risk taking and sacrifice. Its very satisfying when you lure a more powerful piece into a trap. My compliments to the devs for a great game that will keep me coming back for more.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game concept with good graphics. Campaign mode and player advancement isn't implimented at this point, but you can still play the other modes (multiplayer, skirmish, and practice at this point). If you're into Warhammer 40k, chess, or strategy, the game is still worth having, especially at the Early access price, and the developers are actively improving the game and adding features.",
            "review_score": "1"
        },
        {
            "review_text": "its a battlechess , if u like chess u might like it. I say might because it contains some other elements that ruin chess (at least for me :P chess is enough thinking for me) though it feels like a windows xp release.",
            "review_score": "1"
        },
        {
            "review_text": "First, I want to say that I can only recommend this game as a Chess-game. Lower goes my review of Regicide-gameplay. If you've had enough of this RNG ♥♥♥♥♥♥♥t in X-COM or other turn based games then this one is definitely not for you. I only played Regicide mode to unlock new skins my armies and bought this game only to play Chess with badass bloody executions. If you seek something more than just chess-experience you better stay away from this game, or else you're gonna get butthurt a lot. Here is a simple example. You play space marines campaign. Your units have mostly &gt;64% hitting ratio and orks (your enemies) have &lt;58%. But in reality they they hit the target more than your troops. My knight didn't hit the target in CQC while given hit retio was 95%. Instant rage quit. Combine this with higher enemy HP and enemy's 2-shot ability and you get one huge explosion in lower back area. RNG ruined this game. Other than that it is very good. The soundtrack, the visuals, everything except regicide-mode gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Worth Every penny. The regicide mode adds a great twist to standard chess, but the classic is still optional for chess fans and champions. Frequent updates and amazing aniimation and graphics. Must buy for WH40K and/or chess fans. Only con - the online community is quiet small (at least during the early access)",
            "review_score": "1"
        },
        {
            "review_text": "Just when you thought normal chess couldn't get any better, Warhammer 40000 chess came along!",
            "review_score": "1"
        },
        {
            "review_text": "While I give it a yes, there is ONE thing. I guess this is how Companies are going now, and I for one am now done with early release and preorders.   I enjoy this game. I enjoy it. What I don't like is that as an early release customer, NOW, I have to pay for other skins like Dark Angels, etc., or play enough to get enough requisition to get them? Why does evrything have to be about micro transactions?   I will still play the game, but I will not be buying anything extra.",
            "review_score": "1"
        },
        {
            "review_text": "  6/10 Fun but with several annoying flaws, crucially blatantly rigged RNG.",
            "review_score": "1"
        },
        {
            "review_text": "Great game I recommend to anyone warhammer fan",
            "review_score": "1"
        },
        {
            "review_text": "A great game with brilliant aspects i struggle to find anything wrong with the game its always keeping me on my toes and i always enjoy playing it the only quarrel i have is that if i am offline i cannot acces da green tide campaign and my save file for the blood angelsa campaign does not carry over to online mode",
            "review_score": "1"
        },
        {
            "review_text": "This is what happens if you mix chess, blood, gore, good animations and warhammer 40k into one hell of a combination. First off, you should pick the game on a sale, because this price is a bit high. The game has 2 gamemodes the classic chess and the regicide mode. The regicide gamemode is a mix from real-time strategy and normal chess. You can move one of your unit, after that you can give orders to the whole squad like simply shoot or throw a grenade. There are microtransactions in this game for new army skins or maps but you also have ingame currency, wich you earn by just playing the game. If your searching for an interesting(or bloody) game of chess you found the right game.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like chess?  Do you like Warhammer 40,000?  Do you also like chess with extra abilities?   Then do I have the game for you!  Warhammer 40,000: Regicide is an amazing game that takes chess and adds ablities to each piece. With this extra layer of tactical decisions to make adds more depth to the classic game. While adding the story and lore of Warhammer 40k (which I am no expert on), makes this game into a masterpiece of blood and gore. With Space Marines vs Orks, or any other variation, is fun and thrilling. Do not let my meger gametime fool you, I love this game. I also like to play chess, I just haven't had anyone really to play against in a good amount of time.  If you like tactics or even just getting into the game then I would recomend this, because even if you do lose seeing all the kills might help you get over it (maybe).",
            "review_score": "1"
        },
        {
            "review_text": "Being a 40k tabletop gamer, pc gamer and a chess fan I love this game. Dont expect much gameplay, just imagine chess with awesome animation and a unique way where you can shoot your enemies pieces. I give it a + but the price is a little up there.",
            "review_score": "1"
        },
        {
            "review_text": "I like the concept of the game but its still chess with warhammer theme on it what i can say is if ya want to play chess with style this might be the best one to play on so i cant say it sucks quite interesting should give it a try",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game as I love the Games Worksop universe and for the price you can;t beat it. Everyone loves running around playing multiplayer know a days even myself but I stopped went offline and played this. (sale for only $4.99). After a round or two of getting used to the game and how to play I got hooked and tthe last few hours shot passed. I really would recommend this if you like turn based games. Plus for this weekend price it can't be beat. Makes me miss some older turned base games :(.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great fun. It has two modes, classic chess, just as you'd expect, but with Warhammer 40k units. Then 'Regicide' mode, which is like chess with extra actions. The regicide mode is quite interesting, and has a excellent level of strategic depth.  The graphics and unit animations are amazing. The UI is very pretty.  On the not so great:  The camera movement controls are wonky. UI has quite a few bugs. UI to start or find a multiplayer game is unintuitive. Not all the UI elements have a pop-up tooltip. Leads to a lot of trial and error, and guessing.  Wishlist: The game has DLC available in the in-game store (great), but it's not listed on the Steam store page. It be nice to see a full list of available DLC on the Steam page. More customizable game modes. Steam Workshop support.",
            "review_score": "1"
        },
        {
            "review_text": "This game needs player vs player from the same PC. Still not a bad game though. But that would make it OWESOME.",
            "review_score": "1"
        },
        {
            "review_text": "7.5/10 to me, only thing that ever makes me mad with this game is its hit percentage chances. A.I. did a few stupid things in the campaign that it shouldnt of (such as the king doesnt take a rook thats un protected but kills it instead with a point blank shot to the face or a bishop doesnt kill a knight by capturing it but just using his gun to do it.) but other than the campaign the A.I. is good enough in my opinion. VERY INTENSE IN MULTIPLAYER REGICIDE (in my opinion anyway i dont know how you might think about it). Seriously when i won my first battle in regicide it just felt so much more rewarding than i thought it was going to be. Pretty much a must-buy if you like chess like myself.   after a recent patch they adjusted the AI so the hit percentages now seem like they hit and miss as they should now, and i can tell easily since the orcs have a 52% chance to hit my guys in the campaign  so after that patch i say it is now 8.5/10 :) (i feel like putting decimals on things today for some reason)",
            "review_score": "1"
        },
        {
            "review_text": "Okay, so you know how chess is a battle of mental skill where the winner is determined on pure strategy? Well, that's not so cool with the Emperor. It's a good basis, but not enough for a full game. So to make it perfect, the Emperor called in another old godlike figure to help. RNGesus may have gone a little overboard, but the Emperor saw that this modified game still had more potential than the original form of chess. In order to make it balanced out and truly a game for all the Ages, Space Marines were put in place of normal chess pieces. The Emperor looked on his creation and saw that it was good. And it was. Thus Regicide was brought to mankind.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes chess more like gears of war (it really fun and gorey)",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun!",
            "review_score": "1"
        },
        {
            "review_text": "Love the animations for the various in-game characters. Gameplay isn't too complex but is challenging nonetheless. Really good fun to just pick-up and play in classic mode as a chess game, but Regicide mode has some really neat features that make for interesting turn based combat. Would recommend, especially for fans of the Warhammer 40,000 universe!",
            "review_score": "1"
        },
        {
            "review_text": "Ive only played the game for about an hour and a half but for most of that time i was in my first online match, which i won by the way :). I love the warhammer series and just bought all the games while they were on sale, and this is a fantastic addition to the series, even the regular classic mode which is just chess is freaking awesome. I did get mad when i missed kiling shoots on important pieces like the quuen, but in the Regicide mode you don't need to take the oiece you can do what i did and just damage it over tme until, VICTORY. It also has a campaign with 50 missions, hopefully they make alternate stories with chaos and all that good stuff. i give this game an 11/10, the music and animations were great, and i was on the edge of my seat the whole time, defiantly worth the $14 bucks, one of my new favorite game.",
            "review_score": "1"
        },
        {
            "review_text": "What started off as a simple combination of chess and 40k has evolved into one of the best Warhammer 40000 video games out there.  +Unlock and play various Space Marine Chapters and Ork Klans, each with their own perks and detriments. +Unlock impressive visual armour upgrades for your Marines/Orks as you level up. +Regicide Mode is a unique combination of Chess rules and a great adaptation of 40k mechanics. +Everything in the in-game store can be unlocked using the in-game Requisition, gained from completing Campaign missions, their secondary objectives, or winning online matches.  The only downsides are: - The White Scars are no longer obtainable. - The Bad Moonz take an inordinate amount of forum tomfoolery to unlock.  Just like the original table-top, Regicide fascinates and frustrates in equal measure, but is a total blast to play with others.",
            "review_score": "1"
        },
        {
            "review_text": "You like chess, you like Warhammer 40k, sometimes you like a little more tactics than just chess.  You like Regicide.   Full review is that this is an amazing game I would recommend to anyone who likes chess. The visuals are amazing, it's just addictive. Includes a story, easy multiplayer, cross platforming, universal levelling up system so you don't have to lose your progress. Not that the levels matter, they just unlock new force colours, so it's still all down to you as a player. You can play regular chess, without the Regicide extras, and you still get all the gripping visuals. It is well worth a buy and you can visit the Regicide forums and become apart of the community! All the staff are easy to get along with people who respond to everyone (given a little time, they are busy you know).  My advice is to get this game and get your friends to get this game! You'll all be having 'just one last game' over and over again.",
            "review_score": "1"
        },
        {
            "review_text": "Hard to say how I feel about this one. I expected a modified chess-like game and that's what I got, but I'm pretty sure I'd have never bought this at full price. Especially with a laughable AI and only 2 playable races. Still, it's chess + 40K so it's fun.",
            "review_score": "1"
        },
        {
            "review_text": "I got to kill a 'Meganob'.   I know a few of these in real life....can't kill them though, but this game'll do for now =)",
            "review_score": "1"
        },
        {
            "review_text": "If you don't like chess you probably won't like this",
            "review_score": "1"
        },
        {
            "review_text": "Well, if you like 40k, and you REALLY like chess, then this game will be right up your alley. Other than that...it's okay. Worth it's $16.99, but no more than that. Only reason I gave it a thumbs up is because it doesn't deserve a thumbs down and there is no median option.",
            "review_score": "1"
        },
        {
            "review_text": "A++ Battle chess game. Excellent atmosphere and the cut scenes are just great. I found the matches very fun and stimulating, both strategically and visually. As for the bad reviews, as you see most of them are MISGUIDED claims of microtransactions. Yes there is an environment and a cmapign DLC which costs you .99 cents. YES I said .99 cents for some DLC you don't 'have' to have. As to the Sub-Factions YES you CAN buy them as DLC (Again for .99 cents) IF YOU WANT TO, or you can play the darn game and over time UNLOCK THEM ALL for free. Can't stand when people either read and or play a game for 5 minutes and jump to false conclusions. Hello, take a look around, like you've not seen games with DLC? Well, I correct that, you may right in that you've not seen nice DLC for FRAKKIN .99 CENTS...i wll give you that...lol   Now back to the games, it's visually very nice and reaqlly really will cure your need for a good battle chess game and being the WH universe it's pretty stunning. Very fun to play. The learning curve is pretty intuative and for the price, this is a great game. (Of course in keeping to my refusal to support Valve's APP scam, I do urge to buy it, but elsewhere. As of this writing 7/2/16 Indiegala has it for barely over 4$. and it's a total steal). Great game, looking forward to new factions! ",
            "review_score": "1"
        },
        {
            "review_text": "The only reason you wouldn't like this game is if you HATED chess, because this is chess ON STEROIDS.",
            "review_score": "1"
        },
        {
            "review_text": "There is only the Emperor, and he is our shield and protector.  NONE CAN WITHSTAND OUR FAITH!   ░▐█▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄█▄ ░███████████████████████  ░▓▓▓▓▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓◤ ╬▀░▐▓▓▓▓▓▓▌▀█░░░█▀░ ▒░░▓▓▓▓▓▓█▄▄▄▄▄█▀╬░ ░░█▓▓▓▓▓▌░▒▒▒ ░▐█▓▓▓▓▓░ ░▐██████▌",
            "review_score": "1"
        },
        {
            "review_text": "Been looking for a good chess game for a while, and love warhammer 40k! This is just perfect.  The regicide mode takes a little learning but its a nice spin on regular chess. The graphics and atmosphere are fitting of a 40k game.  It's not going to win any awards but for the price it's a decent chess game with nice graphics and multiplayer, can't go wrong really.",
            "review_score": "1"
        },
        {
            "review_text": "Regicide is entertaining from a conceptual standpoint, and the gameplay is enjoyable. The main drawback (and it is a significant drawback) is that the level design is repetitive and sometimes poor. For example, some levels feature maps that quickly reach a drawn position, and the game then continues perpetually until the player quits, or tries something brave and loses. Note to the developer: If you incorporate the rules of chess, make sure the position is playable with all available piece combinations.",
            "review_score": "1"
        },
        {
            "review_text": "Quite a long time ago (like in the Commodore age) my parents gave me this book with rather difficult chess puzzles and tutorials – so I wouldn’t waste my life away on them silly video games. Well, it finally paid off!  Warhammer 40K: Regicide is heavily based on chess but offers a variety of chance based skills and attack options after every regular move. And this extension works very well. The single-player campaigns alone make it worth your while, since they offer hours and hours of different chess problems (with the extended rules set).   The competitive multiplayer is fine too, but it does require more patience than regular online chess. Matches in Regicide tend to take even longer, partly because of the fancy move and kill animations. Also expect the ultra violence and over the top tone of any other WH40K video game, which is a good thing. Just by looks and style this game fits right into some niche between Dawn of War and Space Marine. So, yeah, it’s awesome too!",
            "review_score": "1"
        },
        {
            "review_text": "Great concept of a game, Seems to be a perfect mix of chess and warhammer 40k.  Although I would not recommend this game as it seems the AI is completely broken, 3/8 missions and the AI couldn't process any moves and the match would freeze. I once had 3 marines with a 95% hit chance attack a single orc and all 3 missed. Misses seem to happen far to often.  If the Devs did some work fixing the bugs in this game it would be great but considering these large bugs nearly a year after release I would suggest not buying it unless you only want it for the multiplayer.",
            "review_score": "-1"
        },
        {
            "review_text": "All in all, this game takes a great game like chess, and ruins it with chance. 95% chance to hit a target one block away and misses. Orc has 40% chace and hits. This happens so regularly its uncanny. Really just leaves you frustrated.",
            "review_score": "-1"
        },
        {
            "review_text": "Chess on ROIDs!!!!! Perfect!",
            "review_score": "1"
        },
        {
            "review_text": "So apparently the developers idea of difficulty is to just give the AI an unfair favour during matches. Artificial difficulty at it's finest. Don't bother with this, just by a chess board and put some Warhammer figures on it.",
            "review_score": "-1"
        },
        {
            "review_text": "Overall its a decent game, and as much as i like it, i'm not going to recommend it.  Game looks nice, plays smoothly, with a couple of 'glitches' here and there, wich i think is just somewhat sloppy for a game that essentially is quite appealing. I like the idea of chess+warhammer, and you get this blend that works really well, with one aspect that pretty much ruins the whole game for me.  Every action you perform is subject to chance, so in short you can take your strategy, and flush it down the box, because nothing is certain to the point of becoming entirely unpredictable. Its not uncommon to play two rounds, perform 6 actions, fail at performing every single one, while building up some real world aggravation everytime it happens.  I'm not this incompetent in real life, so why does this game let me play like a blubbering idiot? Can you imagine failing at least 1/3 of everything you do in life? Go ahead, grab a glass of milk, i dare you, go see what happens.  Psychologically, it just doesn't work. Winning is a relief, and losing is a pity, neither are satisfying because its not really in your hands. Its just this one little element from the tabletop i think that should have been left out, or within (severe) limitation.  They should take this game, fix it, expand it, and re-publish it, because there is something really cool there, but for now its only provoking potential homocidal tendencies wich i think are never good and should be avoided at all times unless you have low selfesteem issues because then it simply wouldn't matter and its all the same to you.  But really, this could have been so much more and better, and i dont think i will be spending a whole lot time on a game that's quite discouraging.",
            "review_score": "-1"
        },
        {
            "review_text": "A weird chess-like game. It takes less than an hour to realise that the game will not offer you anything new after the first 'mission'.",
            "review_score": "-1"
        },
        {
            "review_text": "Man that space marine leader is annoying. Listen to your phyc guy jss.",
            "review_score": "1"
        },
        {
            "review_text": "Not a must have game for 40k fans. Repititive content warning (like any chess sim)  Requires more game balance, orks are overpowered at the moment.",
            "review_score": "-1"
        },
        {
            "review_text": "Only if you like chess kind of games..but even like that it doesnt have good features that allows the gamer to enjoy it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game reminded that I disliked chess.  The gimmick of being able to do other things in the Regicide mode is fun, but it's just not enough to keep me playing past one or two evenings. Sure, there are pretty animations when you capture someone, but it doesn't really add much into the gameplay and it's aggravating how unpolishedness shines through every now and then, such as -every- time when attacking someone the voice acting line gets cut as the following one starts. The single player campaign has a few good moments, but a lot of the 'optional' missions are aggravating and just seem to have one true way of accomplishing them or hoping that the AI screws up (which it seems to do kinda often).  And why do the Space Marines sound like they're Chaos worshippers? Seriously, that Captain is worse than Khorne Berzerker's from Dawn of War.  All in all, if you're a fan of 40K, you might like it, but I personally didn't find it that great of an experience myself.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is bad. Not much content, boring, same animations over and over, repetitive, hardly any communtity, only 2 classes, and finally no one is playing multiplayer which is the only replay value of this game. 3/10 was really looking forward to playing it when it went on sale but tbh its not even worth $5......",
            "review_score": "-1"
        },
        {
            "review_text": "This 'Game' is just chess reskinned with Warhammer 40k factions, and even then there's barely any factions other than the Orks or Marines. The purchases are not worth it, they're just reskins. Then they tried to employ stats that are used in the table top game, and they only make the game even more confusing. The final nail in the figurative coffin was how boring it got, I only played it for three total hours before uninstalling it. This isn't worth your money so buy something like Battle Fleet Gothic or Dawn Of War.",
            "review_score": "-1"
        },
        {
            "review_text": "Another dissapointing entry from games workshop.",
            "review_score": "-1"
        },
        {
            "review_text": "In my opinion the gameplay was repetitive and boring. The main story mode was lacking as well. I would suggest if anyone does buy this, if they really want to play it, then get it when it goes on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh, what a beautiful game it would be... without 'Regicide' mode! Several abilities don't work, impossible to choose abilities for campaign, almost impossible secondary tasks like 'win without loosing a single unit'(which is almost impossible, when enemy constantly attacks you), orks are more accurate at shooting than ♥♥♥♥ing space marines (64% for a successful hit as space marine vs 52% for orks and they land a hit almost everytime, when my units miss 3 times out of 4). Now this is not a chess game - its a ♥♥♥♥♥♥♥ lottery and it doesn't matter how clever you are or how good are your tactics. The only thing, that matters now is how lucky you are (which is terrible, when you speak about chess - the only game(that I know of), where luck absolutely doesn't affect on game).",
            "review_score": "-1"
        },
        {
            "review_text": "Game is crashing i dont know why........ If there is possibility to put screenshots please say to me how because i wish to show this.....",
            "review_score": "-1"
        },
        {
            "review_text": "**Edit number 3....!  The RNG is horrible and seems artificial, tested on mission 2 moving same unit into same position with 90% chance to hit missed 20/20 times (Yes I restarted it 20 times to test) this isn't RNG its fixed campaign mechanics.   I really want to love this game but its making it hard.   **Edited review  Really fun and interesting take on chess, I never played the original board game version of this that I hear its based off but this is a blast! Looking forward to putting more hours into the game now that launch is here and new features/units are added.    Thanks breathing life back into chess!          Original review:  Could be a fun game but it uses all of the same animations per unit for Melee attacks vs ranged attacks which feels ghetto, asked devs if they planned on fixing this for release and they couldn't bother to answer. RNG nature of the game feels out of place for a chess style game, going 4 rounds and missing every shot feels frustrating and just really feels like a waste of time.  Refunded, would change my review if my listed problems where addressed.",
            "review_score": "-1"
        },
        {
            "review_text": "Stupid, sterile game. No gameplay, no story, bad graphics.  Dont play it.  It isn't worth it",
            "review_score": "-1"
        },
        {
            "review_text": "BUYER BEWARE. The armies are poorly balanced (there are current discussions on the publisher's forums about this), the dialouge in the campaign is laughably bad, and the interface is clunky. If you are both a big chess fan and big 40k fan and have a couple bucks to throw at it, then it might be worth it, but if you are interested in campaign mode then don't bother. This is the first time I've ever requested my money back from Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing Promo eh ? That REALLY gets your attention ?  Then you find out its chess, but your pieces can actually shoot as well.  You get to move 1 piece per turn, limited to what the actual chess pieces would be able to move.  Followed by 3 actions points you can spend on shooting or healing your army.  From the promo i thought it was turn based mayhem on a battlefield, but in actuality its Warhammer 40k Battle chess.      I don't like the limited move ability of your troops, the starting positions of your army often block each others mooves so you have limited options and most games end up in 1 piece mooving 1 square each way then back while hoping you can shoot out your opponent, while your enemy always seems to have harder hitting weapons and more numbers.  Your troops have very short range they can actually shoot in, so often you find your self with a full army, but only 2 guys that actually have the range to fire.    If you can play chess, and you like the idea that after each move you can bang off a few shots, this one is for YOU.  If you like your games with a bit more depth than a pretty, well animated battle chess, give it a miss.  Perhaps i should have read the rewiews before getting carried away with the opening vids eh.",
            "review_score": "-1"
        },
        {
            "review_text": "a chess board game.",
            "review_score": "-1"
        },
        {
            "review_text": "i love this so far :)",
            "review_score": "1"
        },
        {
            "review_text": "The game is quite fantastic, bringing a whole new level of competition and fun to the game of chess. Not only that, the game also has a stylized version of regular chess as well, giving the player the choice between slaughtering their opponents in two different ways.",
            "review_score": "1"
        }
    ]
}