{
    "app_id": 322980,
    "name": "Gods vs Humans",
    "release_date": "2014-10-10",
    "developer": [
        "Artefacts Studio"
    ],
    "publisher": [
        "Microids Indie"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Casual",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Casual",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 51,
    "negative_ratings": 42,
    "price": 3.99,
    "description": "Humans are building a tower to reach the Kingdom of the Gods! Embody one of these divinities to foil their attempts. But, be careful not to kill them with your special powers, because your survival depends on their devotion!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/322980/header.jpg?t=1478597802",
    "minimum_requirements": "OS: Windows® XP / Vista™ / Windows® 7 /8 Processor: 2,4 GHz CPU Memory: 1 GB RAM Graphics: Nvidia GeForce4 MX 440 AGP8X or superior DirectX: Version 9.0c Storage: 250 MB available space Sound Card: Directx 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Played both this and the android version and love it. Super fun game that has provided me with a fair amount of entertainment with much more to come. Decent amount of levels with interesting gameplay and cute designs. If you love simple yet fun strategy games, I suggest you pick this up, especially if it's on sale!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 It's harder than it's looks, but it's so fun... Don't let that puny human reach you~",
            "review_score": "1"
        },
        {
            "review_text": "Mobile game gameplay. Waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "This is by far one of the most repetitive-boring games I've ever played. I bought this game expecting a fun strategy game to waste time with, but instead I lost out on $5 that I could've used to buy something else. First of all, this game is extremely repetitive; the levels never change, there is absolutely no deviation from the basic formula of winning each level (spam on the first floor: win game.) Second of all, this game is not at all fun. There is nothing stimulating in it; there is no change, nothing interesting, and is just not worth it. I say this warning with all there is inside me: DONT BUY THIS GAME. DO NOT BUY IT ON SALE, DONT EVEN LOOK AT IT, AVOID IT LIKE THE PLAGUE. Spend the current price to charity, not this piece of garbage procieved as a game, you'll get a lot more out of it.",
            "review_score": "-1"
        },
        {
            "review_text": "Poor Graphics, Borning Gameplay, and sometimes just dosen't work.",
            "review_score": "-1"
        }
    ]
}