{
    "app_id": 322930,
    "name": "aerofly RC 7",
    "release_date": "2014-11-06",
    "developer": [
        "IPACS"
    ],
    "publisher": [
        "IPACS"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Indie",
        "Flight"
    ],
    "achievements": 0,
    "positive_ratings": 59,
    "negative_ratings": 22,
    "price": 29.99,
    "description": "Learn to fly radio controlled (R/C) models with aerofly RC 7. When it comes to learning and improving R/C flying skills, aerofly RC 7 is the number one choice for R/C pilots. Our state of the art physics simulation gives you a stunning level of realism.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/322930/header.jpg?t=1447363622",
    "minimum_requirements": "OS: Windows XP SP2 / Windows Vista / Windows 7 / Windows 8 Processor: Intel Core 2 Duo or AMD Athlon64 X2 Memory: 2 GB RAM Graphics: ATI Radeon HD 4850 or NVIDIA GeForce 9600 with 512 MB Storage: 20 GB available space Additional Notes: For an optimum flying experience the use of a USB joystick is recommended.",
    "recommended_requirements": "OS: Windows 7 / Windows 8 Memory: 4 GB RAM Graphics: ATI Radeon HD 5770 or NVIDIA GeForce 450 GTS or faster with 1 GB Storage: 20 GB available space",
    "reviews": [
        {
            "review_text": "Wish I could get a refund. I mistakenly assumed they would have improved their flight model from Pro, but all they did was add aircraft and sceneries. I cannot detect any improvement in stall/snap/spin realism at all. Pretty good for basic stuff, and hovering/torque rolls, but stall/snap performance is MUCH too forgiving, and not at all representative of any but the most forgiving models. Realflight is MUCH MUCH better. I have been flying RC since 1978 and I'm an 8,000 hour professional pilot (full-scale) with competition acro experience (full-scale).",
            "review_score": "-1"
        },
        {
            "review_text": "Edit: Figured this out a long time ago, figured i'd change my review. Aerofly RC7 is fun to do stuffs in",
            "review_score": "1"
        },
        {
            "review_text": "800mb of ♥♥♥♥  not equal to the price",
            "review_score": "-1"
        },
        {
            "review_text": "Impossible to play with my xbox controller",
            "review_score": "-1"
        },
        {
            "review_text": "planes - good helis - acceptable multis - bad",
            "review_score": "1"
        }
    ]
}