{
    "app_id": 323040,
    "name": "Laserlife",
    "release_date": "2015-09-22",
    "developer": [
        "Choice Provisions"
    ],
    "publisher": [
        "Choice Provisions"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Rhythm",
        "Music"
    ],
    "achievements": 12,
    "positive_ratings": 62,
    "negative_ratings": 19,
    "price": 7.19,
    "description": "Remember what it means to be a human in this interactive biography of a dead astronaut found in deep space by future intelligences who have no concept of humankind.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/323040/header.jpg?t=1499280079",
    "minimum_requirements": "OS: Windows 7 x64 (Windows 8.1 x64 required for Intel® RealSense™) Processor: Intel Core i5 5xxx Memory: 2 GB RAM Graphics: DirectX 11 compatible graphics card (Intel HD 5000, NVIDIA GeForce 400 or Radeon HD 5000) DirectX: Version 11 Storage: 4 GB available space Additional Notes: A controller or Intel® RealSense™ camera (DCM driver version 1.3 or higher) is required to play.  Supported controllers: XInput compatible (eg Xbox 360, Xbox One), Dualshock 4",
    "recommended_requirements": "OS: Windows 7 x64 (Windows 8.1 x64 required for Intel® RealSense™) Processor: Intel Core i7 5xxx Memory: 6 GB RAM Graphics: NVIDIA GeForce 6xx or Radeon HD 7xxx DirectX: Version 11 Storage: 32 GB available space",
    "reviews": [
        {
            "review_text": "Please beware: This game REQUIRES a controller to be played.  It's not a suggestion, it's a requirement. That's why I'm asking for a refund. Going to recommend this game, music is beautiful, visuals and concept are very interesting. IF you have a controller.",
            "review_score": "1"
        },
        {
            "review_text": "This game tries to sell you on a premise right out of the gate. I think it does, the stages feel pretty nice, and getting the scores are part of the challenge. I like what i've played, however brief. It is a solid rhythm game that keeps you on the toes as it dances about. I don't know about the length, but the music, the graphics, and the whole approach just nabs you and doesnt let go. If its as short as other reviews say, I can see getting it on sale. But I'd get dlc for this in a heartbeat. Easily worth 5-10 bucks for what you are getting I would think, especially going back for challenges.   So, i hope that this review gives you a glimpse from a music fan. (And to give my hands a break on the constant movement that the stages demand.)",
            "review_score": "1"
        },
        {
            "review_text": "Sweet combination of twin stick shooter and rythym game. Really nice looking and good music too. Haven't played much yet but absolutely enjoyed what I have. Plan to play much more, could see plenty of replay value in trying for perfect runs too.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of their previous game series, Bit Trip, you will love the two hours it will take you to complete all of the levels. Fantastic music and visuals, supported by it's mechanics really make you feel part of the music. However, it is extremely short, and this really is what makes it not worth its price at all. It should be a quarter of the price it is demanding. There is no reason for having a score in this, it doesn't give you anything extra when you do nail a perfect level. As soon as you start getting a feel for its mechanics..it ends, that's it, no more content, just re-do the levels if you wish. I'll be asking for a refund, there are plenty of other games for the same price that are just as great but with quadruple the content. I really suggest waiting for a sale of atleast 60% off.",
            "review_score": "-1"
        },
        {
            "review_text": "Great visuals, great music.Worth!",
            "review_score": "1"
        }
    ]
}