{
    "app_id": 3230,
    "name": "Genesis Rising",
    "release_date": "2007-08-06",
    "developer": [
        "Metamorf"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Space",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 30,
    "negative_ratings": 94,
    "price": 4.49,
    "description": "Three thousand years in the future, mankind has carved a bloody path towards domination of the known universe. Self-proclaimed as a divine race and beyond reproach as a species, they view all alien races as inferior.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3230/header.jpg?t=1471962185",
    "minimum_requirements": "Windows 2000/XP/XP 64/Vista, 1.5 GHz Intel or equivalent/faster processor, 512 MB of RAM, 2.5 GB of hard disk space, DirectX9.0c or higher, 128 MB GeForce 4 4200 Ti/Radeon 9500, DirectSound compatible sound card, Keyboard and two-button mouse with scroll wheel, Multiplayer: LAN or 56K Internet connection Recommended: Windows 2000/XP/XP 64/Vista, 2.5 GHz Intel or equivalent/faster, 1 GB RAM, 2.5 GB of free hard drive space, 256 MB GeForce 6600/Radeon X1600, DirectX 9.0c, DirectSound compatible sound card with 5.1 speaker output, Keyboard and two-button mouse with scroll wheel",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Let me start by saying that while I do recommend this game, the Steam version has given people some problems; some say they have had errors on trying to launch, which I have not had, and others have said they have had some in-game oddities such as ships not loading, which I did encounter and initially kept me from advancing past the 2nd map.  The steam version is missing a couple of folders. It is silly but adding these empty folders resolves some of the problems such as the ships not loading. Click Read More if needed to see the fix.  -- Go to your Steam directory.   In Steam\\steamapps\\common\\Genesis Rising Create three new folders called 'replay','temp', and 'save' (without quotes)  Then in Steam\\steamapps\\common\\Genesis Rising\\data Create a new folder called 'scripts' (without quotes) -- [Many thanks to Future2012 who originally posted this fix.]  Other than that I didn't get any errors on Win7 64-bit when launching it so I don't know if compatibility mode would help or if it is an OS or driver issue. When I did the above fix I have been able to play through several missions without incident.  All that said, the game itself is really good and has everything from voice acting to cutscenes and a story with some deep religious undertones if you care for that, and if not then you still get to blow lots of stuff up and capture enemy ships and bases. In fact there are countless decisions you get to make about how you want to set up your ships and even which ships you want to take. Moreover I pose that you have likely never played a space game quite like it, as it has elements of RTS thrown in and on top of that your ships are ALIVE and can be genetically modified to suit your desires, and changed on the fly to boot. Plus the music and visuals are quite appealing, so if you can get it to work then it is easily worth $5 or more. Good luck!",
            "review_score": "1"
        },
        {
            "review_text": "I say stay away from this item. I like this item, but, it has many faults in the Steam version. Just make a Google on it. Its a shame they still sell it WITHOUT addressing the problems. But I guess with their 0% return policy it is easy money. Also they are not ACCREDITED with BBB and they to NOT reply to BBB inquerys. Sorta says a bit.",
            "review_score": "-1"
        },
        {
            "review_text": "avoid this at all costs, even free!!!!!!! developer disappeared and game broken.  love to meet one of the 'brass' from the company just once.",
            "review_score": "-1"
        },
        {
            "review_text": "the game files are broken and it takes alot to put the game back to working condition i do not recomend this even though it is an alright game.",
            "review_score": "-1"
        },
        {
            "review_text": "Just stopped workign one day. No matter what i do. Says my video card is no longer supported....",
            "review_score": "-1"
        },
        {
            "review_text": "Tried all possible attempt to troubleshoot, but just couldn't. Just doesn't run on Windows 8 62bit system. Would have been helpful if the store page mentioned it. Read online that some people managed to get it to work, but I'm left scratching my head here. Managed to tone down the initial launch error message to 1 by fixing a few lines in the Crucifom.cfg file, but no matter what suggested fix I try, the game would crash as soon as I try to even start a tutorial campaign. Pity, loved the idea of the game. I guess I'm just glad that the game didn't cost that much to buy in the first place as I don't think steam has a refund policy in these cases.",
            "review_score": "-1"
        },
        {
            "review_text": "bought game for nostalgia sake. i'm a dirty little ♥♥♥♥♥ for almost anything involving space, but i can't recomend this game.   it scores a 'DO NOT' on my 'buy everything in space' list.",
            "review_score": "-1"
        },
        {
            "review_text": "This game doesn't work, so don't try it. Its a shame, cause was interesting the one time i got it to work.",
            "review_score": "-1"
        },
        {
            "review_text": "Very lame game....",
            "review_score": "-1"
        },
        {
            "review_text": "Worst 5 bucks I ever spent. 0/5.",
            "review_score": "-1"
        },
        {
            "review_text": "Using the fixes mentioned in the discussions section of the game I managed to get the main menu working, which allowed me to adjust the usual things located there such as graphics, sounds, etc. and look at the possible tutorial/campaign missions you should be able to play.  Sadly the slightest adjustment in the graphic options will result in a flurry of error messages (which I ignored while starting up the game) and trying to launch a tutorial, campaign or skirmish will promptly crash the game.  -2/7 Not enough sci-fi space battles",
            "review_score": "-1"
        }
    ]
}