{
    "app_id": 323190,
    "name": "Frostpunk",
    "release_date": "2018-04-24",
    "developer": [
        "11 bit studios"
    ],
    "publisher": [
        "11 bit studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "City Builder",
        "Survival",
        "Strategy"
    ],
    "achievements": 75,
    "positive_ratings": 22952,
    "negative_ratings": 3202,
    "price": 24.99,
    "description": "Frostpunk is the first society survival game. As the ruler of the last city on Earth, it is your duty to manage both its citizens and its infrastructure. What decisions will you make to ensure your society's survival? What will you do when pushed to breaking point? Who will you become in the process?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/323190/header_alt_assets_1.jpg?t=1556109975",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7/8/10 64-bit Processor: 3.2 GHz Dual Core Processor Memory: 4 GB RAM Graphics: GeForce GTX 660, Radeon R7 370 or equivalent with 2 GB of video RAM DirectX: Version 11 Storage: 8 GB available space Sound Card: DirectX compatible Additional Notes: Please make sure that you have the latest VC package installed, and - if you're using Windows 7 or 8 - that you have the KB4019990 update applied.",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: Windows 7/8/10 64-bit Processor: 3.2 GHz Quad Core Processor Memory: 8 GB RAM Graphics: GeForce 970, Radeon RX 580 or equivalent with 4GB of video RAM DirectX: Version 11 Storage: 8 GB available space Sound Card: DirectX compatible Additional Notes: Please make sure that you have the latest VC package installed, and - if you're using Windows 7 or 8 - that you have the KB4019990 update applied.",
    "reviews": []
}