{
    "app_id": 32340,
    "name": "LOOM™",
    "release_date": "2009-07-08",
    "developer": [
        "LucasArts"
    ],
    "publisher": [
        "LucasArts",
        "Lucasfilm",
        "Disney Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Classic"
    ],
    "achievements": 0,
    "positive_ratings": 306,
    "negative_ratings": 41,
    "price": 4.79,
    "description": "Long after the passing of the Second Shadow, when dragons ruled the twilight sky and the stars were bright and numerous, came the Age of the Great Guilds. Blacksmiths. Shepherds. Clerics. Each dedicated to the absolute control of secret knowledge. Another such Guild was the Weavers.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/32340/header.jpg?t=1547342892",
    "minimum_requirements": "OS: Windows XP or Vista Processor: Any 2002 era PC or better Memory: 32 MB RAM Graphics: 2 MB - PCI Graphics Card DirectX®: Required for sound Hard Drive: 290 MB Sound: 16-bit sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is 1 of the best games I have played. it contains puzzles, jokes, epicpixel graphics xD if u are looking something good to play with less violence and with epic story. U just found it! try out other lucas arts games too",
            "review_score": "1"
        },
        {
            "review_text": "Far different from the typical 'combine every item in your inventory with every other item in your inventory' LucasArts games, this focuses more on music to create spells. Like other LucasArts games of the era, be sure to save often with lots of separate save files, because there are chances for you to be unable to continue the game if you forgot to write down a spell somewhere.  This is not the original game version, which had no voice acting and low-quality synthesized music. It has voice acting (decent) and higher quality music, but as with the original game, there's not a constant flow of music, so there's a lot of dead space. What music there is, however, is beautiful Swan Lake. This version also has some cuts from the original, a few bits of dialogue here and there, and lots of closeups. Apparently there was also some censoring so there's no evidence of blood or death anywhere, so that's a little disappointing.   Overall, if you like classic adventure games, you should ABSOLUTELY play this one. There's nothing like it.",
            "review_score": "1"
        },
        {
            "review_text": "Such an amazing game from the good old LucasArts days. There was a time I thought I would see sequels to this and Maniac Mansion. Now they are gone. If you like the sorrowful British feel of Fables and enjoy adventure games then please buy this gem!",
            "review_score": "1"
        },
        {
            "review_text": "Loom is awesome, unique and poetic. It features two of my favorite lines of dialogue ever: 'My destiny is in your hands, Elders.' 'Our hands are empty, Hetchel.' However, those lines are not present in the version that is available on Steam. As others have said, this version is terrible, a crime. However, I recommend you to buy it. Because once you have it in your Library, you can right-click on it and download the game manual. It is not actually the game manual, but the Book of Patterns, a piece of literature that you need to keep at hand while you play Loom. Steam features the best digital version of this book that can be found anywhere. Once you have downloaded it, don't bother to install the game. Instead, download some good old floppy version of the game and play it on ScummVM. You won't regret it.  ",
            "review_score": "1"
        },
        {
            "review_text": "Confusingly charming and charmingly confused, this adventuring classic is only spoiled by the bittersweet cliffhanger ending.",
            "review_score": "1"
        },
        {
            "review_text": "GO OUT AND BUY LOOM TODAY!",
            "review_score": "1"
        },
        {
            "review_text": "This game has the coolest story ever from 1990. Also, it has a musical pun.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game back in the day and it totally holds up!",
            "review_score": "1"
        },
        {
            "review_text": "I had a good time playing Loom. It's an adventure game that does away with a lot of the previous staples of adventure games, and tells an interesting story in a creative world. It's been a while since I played it last, but there were two negatives I can remember: it takes a bit too long to explore the world, and some of the songs required to finish the game weren't properly explained, and I had to look them up. Despite that, I enjoyed it, but it's not for everyone.  If this sounds like your style of game, $5 will be worth it. If not, there are better adventure games to look in to (like most of the Telltale Games).",
            "review_score": "1"
        },
        {
            "review_text": "A wonderfully gorgeous game.",
            "review_score": "1"
        },
        {
            "review_text": "I'll divide this review into two sections. One for the point and click veterans and one for those who haven't played it before.  For the new players first:  Loom is closer to being a point and click than anything else adventure but it is unique. There are no inventory based puzzles, and only a few conversation based puzzles. Instead your character makes progress by casting 4 note long musical spells. Figuring out which spell you need can be as challenging as many traditional point and click puzzles.  The game is short but it has a properly charming storyline set in a completely weird fairytale-like universe. I think that alone is enough to make it worth its price. It also has 3 difficulty settings since a lot of the game is based on music. So it doesn't matter if you're tone deaf, pick the easiest setting and you'll not lose any of the game.  Reasons to play it... In spite of its age, Loom has a truly arresting atmosphere, an intriguing and mysterious plot and great atmosphere. The difficulty settings allow anyone to play and enjoy it.   Reasons to not play it.... very few... if you can't handle outdated graphics, if you only like object based puzzles... and you really need the sound on so don't buy it if you hate Tchaikovksy. The background music is mostly Tchaikovsky.  For veterans such as myself: This is a very faithful update that has caused me no trouble working on modern windows machines.  There has been some very decent voice acting attached to the game. The only negative is that the inclusion of voice acting meant that the producers had to cut down the dialogue so what was already a short game is even shorter.  ",
            "review_score": "1"
        },
        {
            "review_text": "Never understand the point with LOOM... I tried, once... twice... three times, even more so... Can't get anywhere... so.. i dunno..   If you played LOOM before you'd propably get this no mather what i say... I, however.. cant really recommend it. I'm not saying its a bad game, its just hard to get in to.",
            "review_score": "-1"
        },
        {
            "review_text": "Classic adventure game, you learn spells as short mellodies, if you have an ear for music, best played on the hardest level (no visual clues, mellody heard only).",
            "review_score": "1"
        },
        {
            "review_text": "It's a good version of the game, the same that remember.  The version have a filter, and a vga graphics.  The first of three, the next is the Forge :)",
            "review_score": "1"
        },
        {
            "review_text": "An old game from the 1990;s however this was one of the games along side the legendary 'The Secret of Monkey Island' series that made adveture games what they are now. You need to re-visit these games to see the true form of adventure games. With LOOM you need to have a pencil ready to write down musical notes. If you have a ear for musical notes then this should not be a problem. LOOM has a great story line (which I won't spoil here), but you need to see it to experience it. The ending was not what I thought...   Cheers to the Monkey Island Series however. .... Damn great adventure game franchise....",
            "review_score": "1"
        },
        {
            "review_text": "For all retro lovers, a MUST have title. I suppose most of retro gamers know what is LOOM al about. I fully recomed it. A++++++++++",
            "review_score": "1"
        },
        {
            "review_text": "This is an old Lucasarts adventure game, in the same style as The Dig, the Indiana Jones-games, partly King's Quest, Police Quest etc. Though the graphics are a bit outdated, the game is still fun to play.    Also, the old point-n-click games are much harder to complete than newer games.    I can't believe it's been almost 20 years since I plast played the game..",
            "review_score": "1"
        },
        {
            "review_text": "Classic game. Works well, and no issues, takes maybe 2 hours to beat.",
            "review_score": "1"
        },
        {
            "review_text": "A classic graphical adventure by Lucasarts. If you're not afraid of (really well done) pixel-art, this should be a treat. It's not as challenging as many games in the genre, but I found it really fun to play because of the story and the style of it.   Of course, it's quite cheap these days, so if you like adventure games, give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Classic game. Clever way of taking away the 'Push' 'Talk' 'Pull' etc... buttons, and creating more interaction. Logic based. Try not to use a walkthrough. You can work out the puzzles!",
            "review_score": "1"
        },
        {
            "review_text": "Classic adventure. They don't make them like this anymore.",
            "review_score": "1"
        },
        {
            "review_text": "The game itself is great. Interesting story and gameplay, likable characters, great art style. The problem is the steam version. The voice recording cuts off too quickly and it's gets frustrating, as it happened pretty much every time.  I personlly bought the game for nostalgic reasons. I played the game as a young child with my brother. We couldn't speck Englich then and couldn't finish the game.  Like I said before, the game itself is beautiful. The use of music is amazing, which makes the sound cuts even worse. I would still recommend the game but the faults should be taken into account before purchasing.",
            "review_score": "1"
        }
    ]
}