{
    "app_id": 323430,
    "name": "Crow",
    "release_date": "2014-10-06",
    "developer": [
        "Sunside Inc"
    ],
    "publisher": [
        "Sunside Inc"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 70,
    "negative_ratings": 33,
    "price": 6.99,
    "description": "Crow is the critically acclaimed, story-driven action-adventure developed by Sunside. Combining unique exploration, combat, and game mechanics, Crow takes the player on an exciting journey to faraway lands where an ancient battle is unfolding. Your choices will forever alter the course of this world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/323430/header.jpg?t=1512176000",
    "minimum_requirements": "OS: Windows XP Processor: Intel Core i3 Memory: 1 GB RAM Graphics: NVidia GeForfce 600 series, AMD Radeon HD 5000 Series Storage: 1200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "- Simplistic (e.g. bad) phone port  - I guess it would more fun on tablet as a casual game (20 min in and I am already bored) - Sound issues (muted parts during 'story-telling') - MANY loading screens - Loading screen freezing   ...I was really hoping for something different...",
            "review_score": "-1"
        },
        {
            "review_text": "Wow... Just wow. I was debating with this game for a long time. I still don't know exactly if it was worth it.  Pros: It has a great story to it and the gameplay is simplistic, but not in a bad way. It really hooks you and make you want to play more. The game is extremely responsive and it's obvious that it was given its time in development before it was released to the public. The soundtrack really is beautiful and comes with the game's purchase along with development and marketing images.  Cons: EXTREMELY SHORT! It is not worth the $5 price tag because of this. Get it on sale! There is only 4 levels and even with the challenge modes it with only take about an hour to finish the entire thing. I REALLY, REALY, REALLY want there to be more to this game! It has so much potential!",
            "review_score": "1"
        },
        {
            "review_text": "Crow simulator",
            "review_score": "1"
        },
        {
            "review_text": "This game was absolutely charming, ignore the spoiled haters.  It has a lot of problems....mediocre graphics, no sound controls, only resolution changing for graphics, bit awkward controls, and 'meh' in terms of story.  But the music was cool and so was the flying around....even if it was a bit on rails it felt good playing it.  It earned its 5 bucks from me, I recommend checking it out or sending it to a friend as a stocking stuffer esque game. If you have a young kid it would make a great game to play with them.  If you can't spend a couple dollars and enjoy the flight...then you are too young to appreciate unique experiences and oddball games. You would be better off handing EA 60 bucks for 4 maps. =P",
            "review_score": "1"
        },
        {
            "review_text": "I was interested in both this and Abducted because I like indie adventure and I wanted to see what was out there. So far I'm not disappointed! I actually played more of this on a friends PC first and I'm about halfway through. Not a long game but its different, interesting and unique. The music is great, you get to make some skill choices, its not what I expected but in a good way. Really enjoying it! Good job devs!!",
            "review_score": "1"
        },
        {
            "review_text": "uniqe type of game story seen from a crows view of the world nice if you like games that arnt 12 in a dozen  this is a game i cant really say its like this or that game very calming strangly while its a dark world",
            "review_score": "1"
        },
        {
            "review_text": "You fly around as a crow and use magick its rad",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would fly again",
            "review_score": "1"
        }
    ]
}