{
    "app_id": 323460,
    "name": "Raiden IV: OverKill",
    "release_date": "2015-09-02",
    "developer": [
        "Moss Co., Ltd."
    ],
    "publisher": [
        "H2 Interactive Co., Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Shoot 'Em Up",
        "Arcade"
    ],
    "achievements": 47,
    "positive_ratings": 314,
    "negative_ratings": 53,
    "price": 10.99,
    "description": "The series that changed the history of arcade shoot’em ups is back with the crazed action of Overkill mode! Instill fear in your enemies with devastating attacks and earn the acclaimed title of Master Ace!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/323460/header.jpg?t=1449022697",
    "minimum_requirements": "最低配置: 操作系统: Windows 7 / 8 处理器: Intel Core2 Duo 内存: 2 GB RAM 图形: nVidia GeForce 6600 or better 存储空间: 需要 1 GB 可用空间 声卡: Direct Sound",
    "recommended_requirements": "推荐配置: 操作系统: Windows 7 / 8 处理器: Intel Core i3 or better 内存: 4 GB RAM 图形: nVidia GeForce GT 640 or better 存储空间: 需要 1 GB 可用空间 声卡: Direct Sound",
    "reviews": [
        {
            "review_text": "Played a few minutes of this already and I can tell you it's a great SHMUP (Shoot 'Em Up) title! Two things you will need to navigate the bullets in this game: 1/ Ninja fast reactions to navigate dynamic bullet patterns. 2/ An elephant like memory for the static bullet patterns.  From there you have the fundamental skills which will allow you to compete with other players around the world for the highest score! The longer you live then the higher your score multiplier goes up!  Classic arcade game with classic end of level baddies too!  One thing I want though.. in this age of widescreen displays, I want a SHMUP like this (vertical scrolling) BUT utilizes the ENTIRE screen real estate.. no large areas along the left and right hand side of the screen that are vacant (I KNOW in this particular game and series as we know it because the original arcade version was a vertical screen orientation), but I think there would be a market for it ! You know? Like GigaWing.  Could you imagine something like that running at 1920x1080 or higher? It could be very good indeed!",
            "review_score": "1"
        },
        {
            "review_text": "Own the PS3 version and logged many hours into it. Highly recommended. Even though it is not a danmaku, it does feature fast bullets in tricky patterns to keep you on your toes. Also, when you feel comfortable with the game, do not use continues for the best experience.",
            "review_score": "1"
        },
        {
            "review_text": "IT AWESOME only real pro can past all the game :P",
            "review_score": "1"
        },
        {
            "review_text": "A must buy for all STG fans. Damn it its Raiden!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Do you want ninja-reflexes? Because playing this game is going to get them to you!  I remember playing games like this as a kid, never being really good in them, since my parents didn't let me put endless amount of money to arcade machines. Who can blame them?  Finally, all i have to pay for is my electrity bill/rent to keep playing and practicing this as much as i want! And i do want. It's fun, fast paced and really rewarding when you start to get further and further. Fun game to kill time for a few minutes, or play one or two runs at a lunch break, OR practice a bit longer.   Fast paced shooter, some tricky achievements to get, good set of levels, and the overkill mode that's just hectic.  buy it if you like a challenge! It's awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing,Thanks :)",
            "review_score": "1"
        },
        {
            "review_text": "A solid, fun shooter with tight and simple controls.  Runs at a smooth, consistent 60.   It has your standard resolution options, as well as some display rotation (TATE?) options if you're into that.  Apart from the standard balanced ship, you can also play as different ones like the classic ship (slower/more powerful?) and a fairy? (fast/different weapons).  The bonus OST is also nice. I frankly bought this on a whim, and i'm glad that I did.",
            "review_score": "1"
        },
        {
            "review_text": "Raiden games have always been about traditional gimmick free textbook shooting (well other than the Fighters spin offs). So its a nice accesible shooter that doesnt change the rulebook, but it just gets all the basics right. This ones no exception , nothing too fancy ,just solid shooting action . Also a very solid port as well, perhaps could do with running at a slighly higher resolution. Recomended for both casual and hardcore shmup fans. ",
            "review_score": "1"
        },
        {
            "review_text": "I cauteously recommend this to fans of spaceship shooters, and not to people who wanted to try something arcadey from a more casual perspective. Personally I greatly prefer Jamestown, it has a more acceptable learning curve and, unlike this game, bullets are always very visible. I get a bit bummed out about crashing into a bullet that blended in with the environment.",
            "review_score": "1"
        },
        {
            "review_text": "You probably alreasdy know if you wanna play this. I never played raiden iv, but it's about what you'd expect, the bullet patterns almost seem a bit more psykio though. There are two scoring modes, one where pumping more bulletts into dead ships is encouraged and one where killing enemies fastest is. Difficulty on normal is just right for a shump, which is fricking hard. If you're new to the genre I would probably not recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Is this danmaku? No, it isn't, as a fan of bullet hell games however, I still recommend this one. As this series has been around since my childhood, nostalgia is an unavoidable bias, but beyond that, this game has high replayablity through the varied ships (and levels) available, a killer soundtrack, and engaging gameplay. Also plus for naked fairy",
            "review_score": "1"
        },
        {
            "review_text": "One of my faves for the Xbox 360 now available with more content on Steam! A great addition to the Shoot'em Up Genre, much like all the other Raiden titles, and it is fun as hell to just blow up everything in sight.",
            "review_score": "1"
        }
    ]
}