{
    "app_id": 32360,
    "name": "The Secret of Monkey Island: Special Edition",
    "release_date": "2009-07-15",
    "developer": [
        "LucasArts"
    ],
    "publisher": [
        "LucasArts",
        "Lucasfilm",
        "Disney Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Point & Click",
        "Adventure",
        "Comedy"
    ],
    "achievements": 0,
    "positive_ratings": 2156,
    "negative_ratings": 115,
    "price": 7.19,
    "description": "Back by popular demand, The Secret of Monkey Island™: Special Edition faithfully re-imagines the internationally-acclaimed classic game (originally released in 1990) for original and new audiences alike.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/32360/header.jpg?t=1542757349",
    "minimum_requirements": "OS: Windows XP® or Windows Vista® Processor: Intel Pentium 4 3GHz or AMD Athlon 64 3000+ Memory: 256 MB RAM, 512 MB for Vista Graphics: 128 MB with Shader Model 2.0 capability DirectX®: 9.0c (March 2009) Hard Drive: 2.5GB free hard drive space Sound: DirectX® 9.0c compliant sound card        Controller support: Xbox 360 controller",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Could so much awesome really be in one game.?! A story about mystery (Monkey island), ambition (To become a pirate), love (True love lasting over a series of 5 games), betrayal (Carla and Otis), epic humour (A red herring) and the start of the most awesome of it all….insult sword fighting! Without a doubt the best Adventure series out there, and this is where is starts.  How appropriate, you fight like a cow! ",
            "review_score": "1"
        },
        {
            "review_text": "Still on of the best games in the world with a graphic update. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Just finished this game (With slight abuse of the hint system) - It's a fantastic remaster of the original!    The ability to press F10 at ANY time to seamlessly revert to the original graphics / UI and back (Even mid conversation / cutscene) make this highly recommended as it's almost 2 games in 1 :)",
            "review_score": "1"
        },
        {
            "review_text": "I played this when it first came out - I had lots of time playing the old Sierra titles and this was so incredibly fun and original I was hooked immediately. The remake offered here does something I love - they included the original version! You can easily switch between the new grpahics (they seem rushed and a little 'off' - more than in Monkey Island 2) and the original UI. You can use a gamepad, and while I didn't enjoy that control I have a few friends who used it with only some minor adjustment (cursing).  At any time you can switch between the two versions and can even grab hints in the newer one. I did bonce back and forth in a few scenes to see how it looked 'remastered' but just went right back to the original.  This game is a classic for a reason - you can't die, (rubber trees to the rescue!) it is clever and the story is great, and there are so many little gags and goofs that will keep you chuckling throughout the game.  This game is also why one day I will own my very own rubber chicken with a pulley in the middle - mark my words as I am also a Mighty Pirate!  If you can grab it on sale, don't miss it!",
            "review_score": "1"
        },
        {
            "review_text": " ENGLISH and Italian Review",
            "review_score": "1"
        },
        {
            "review_text": "The Secret of Monkey Island is a very classic and revolutionary game. Although it was made in the 90s, it will always be a brilliant game, and this special edition shows that it can even stay up to date with modern video games (Although you can never beat the classic graphics).  The Secret of Monkey Island series is one of the most funny games series that I have ever played, with the brilliantly weakened forth wall, and the cute child-like innocence of Guybrush Threepwood, every time I replay a Monkey Island game I cannot help but to laugh at the jokes and the little references, and every time I replay it, I always find new brilliantly absurd commands and interactions.   The special edition of this game is in some aspects an improvement, but in most, quite a disappointment. The inventory is different, there's voice acting, the Stump Joke is missing and a few more differences. The special edition shouldn't be thing to deter you from buying, or from not buying this game. If you don't like the notion of a special edition, and would rather the classic, floppy disk version, you shouldn't let that stop you from buying this version, quite a lot of the special edition factors can be turned off and, apart from the missing Stump Joke, not much else was changed. If you love modern, newer games, and feel that old games are in the past, you should still not let that stop you from buying this game, for the special edition has updated the game to look sleek and new, and if you cannot stand having to read dialogue, just turn on the voice acting.  The Special vs Classic edition aside, the dialogue in Money Island is very funny, Guybrush Threepwood constantly breaks the forth wall, so much so, that by the time of the second game, you would have forgotten that it was ever there. There are lines of dialogue that are just so perfect in the game, that you simply cannot help but to pick, sometimes it is Guybrush Threepwood saying he wants to be a fire-fighter (instead of a pirate) or him asking if two brothers are his mother. The plot of the game is not that thick and at some times it barely even makes any sense. But the love story in the whole series of Monkey Island games is the cutest love story you could ever see, with the stupid, innocent Guybrush, and the strong, independent Elaine, why they are even together boggles the best of the fans.  There are many good things about The Secret of Monkey Island, but one big factor that cannot be turned off or on is the difficulty. This game is very, VERY hard, because it is an old fashioned point and click game, it has absurd logic, Guybrush Threepwood cannot reach something a few metres off the ground and thinks that if he mixes red flowers with meat it will poison it, also somehow he is able to use a kitchen pot as a helmet.... The game thus feels as if it goes on forever when you play it, whether you spend ages pondering over a specific puzzle, executing trial and error, or you have a walkthrough up in a tab, trying to not overuse the hints, you will spend quite a bit of time on the game. Sometimes it is merely a simple puzzle that with stitch you up, or maybe it will be the whole game, either way, I heavily recommend having some sort of hint system or walkthrough handy, just in case.  I would heavily recomend this game to you, even if you are a very serious person, the humor is not all there is to this game, it has a brilliant soundtrack and very difficult puzzles, and on a whole is quite an enoyable game.",
            "review_score": "1"
        },
        {
            "review_text": "This game's sense of humor is hilarious. Nowhere else in the world can you find obvious product placement, a rubber-chicken-with-a-pulley-in-the-middle and names like Guybrush Threepwood. The jokes may not sound like they'd be funny, but you have to play the game yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Look behind you, a Three-Headed Monkey!",
            "review_score": "1"
        },
        {
            "review_text": "What is the SECRET of Monkey Island? Well your going to have to figure that out yourself. But one thing that is not a secret, is how amazing this game is. Quite possibly the first adventure game I ever played and the game that got me hooked to the genre. I love the music, the humor, the storyline, and almost everything about the game. Now looking back 25 years later I do see that the game is not completely without flaw. First, the game was made in 1990 so the graphics aren't all that great and there are no voices. Second, the game is relatively short by today's standards. This is not something that bothers me and shouldn't for most people, but might to the more recent fans of adventure gaming. Luckily the Special Edition gives the best of both worlds graphically (sorry but the story is still just as short), as old fans and new fans can enjoy the game they would want to play. Because trust me, there are some old fans that would cringe at the new look. The classic version and new version can be switched seemlessly by hitting F10. The old version staying true to its ancient (voodoo?) roots of a verb menu and an inventory box. The new version many good additions added to its gameplay as the new version intoduces 3D art, voices, and a much larger screen of play (due to the fact that the verb menu and an inventory box have been removed). Although I do enjoy a much larger screen, this is the one thing about the new version I am not fond of. They do have a drop down menu for the verb menu by hitting Ctrl or V as well as one for the inventory by hitting Alt or I, but this feels like more of a hassle than the old game used to be. At the end of the day, this game is a keeper. So don the adventurer's cap and become 'Guybrush Threepwood, mighty pirate!'  Check out my other point and click adventure reviews on my page!",
            "review_score": "1"
        },
        {
            "review_text": "It's a shame Lucas didn't opt for a more sensitive treatment of originals' wonderful backgrounds and character design. Soulless outsourcing did not manage to destroy the wonderful game underneath though. And the new voiceovers + music are great.",
            "review_score": "1"
        },
        {
            "review_text": "You fight like a dairy farmer.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome and hillarious classic point &amp; click adventure, recently re-worked for all of you graphics babies. (Also available in classic format as well).",
            "review_score": "1"
        },
        {
            "review_text": "Old glory to be relived",
            "review_score": "1"
        },
        {
            "review_text": "Redone nicely over the original. Pros: Music, Voice Acting, Story Line, Characters, challenging puzzles, and the new Art design  Cons: Low replay value, sometimes the puzzles or finding items wasn't obvious.   I'm glad they redid this game, everything looks much better visually which might attract newer gamers to this serious. Overall 8.5/10 for a point and click remix.",
            "review_score": "1"
        },
        {
            "review_text": "Loved the game the first time round and this is brilliant nostalgia. The updated sound and graphics make this accessable to people who wont remember the original.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game as a gift from my dad for the new year of '91. As a foreign speaker of English at the age of 11, a good deal of the humor and much of the puzzle logic went over my head, but amazingly that did not stop me from playing it on my Amiga 500 until the early lights of the day, mesmerized by the beauty of what I was playing. I remember basically memorizing every pixel of what was in front of me, going to bed and having dreams of being on Melee Island myself (because even after six hours of clueless clicking, I still hadn't made it off Melee Island). Eventually, I managed to finish the game as an enchanged 11 year old (with the help of clue guides) and went back to replaying it every now and then only to better understand it as my English improved. I still remember the first time I got the 'Is that a banana in your pocket or are you just happy to see us?' joke. It only got better after I learned about Mae West. And you know what, this game only keeps getting better and better no matter how many times you replay it. Hats off to you, Mr. Gilbert. You have done an amazing job.  Yes, there are problems with the Special Edition. Three major problems to be exact.. First, the graphics are not what anyone hoped they would be (it's not Curse of the Monkey Island quality for sure) but what really hurts is that majority of the characters and backgrounds lost a lot of charm in the transition. Second, the animation is terrible. Monkey Island never really animated well (most Lucasarts adventures before Fate of Atlantis did not), and the same animations used on HD sprites just becomes terrible. Finally, the GUI is bad, and I mean REALLY bad - it somehow manages to be worse than the original. Manipulating your inventory in particular is a truly painful experience. However, the game makes up for these three faults by offering you a really well done remastered soundtrack and the option of playing with the original graphics (hotkey switchable with F10) and Monkey Island 2's GUI to boot!  Ultimately, this is a must have, for anyone. Whether you played the original back in the day and want to relive it, or whether you are curious about what this gem of gaming history is all about - do not hesitate, get it. You will thank me for it. Back in the days of clue books and hint lines, this game would take well over 20, maybe even 30 hours for the 11 year old me to beat, but this time around I managed it under a dozen hours. And they were a really, really enjoyable, heart warming dozen hours that took me 25 years back in time. I can hardly wait for Thimbleweed Park..",
            "review_score": "1"
        },
        {
            "review_text": "The greatest epic story in history! Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "If you have some nostalgic moments about good-old-time-quests try to re-imagened Monkey Island. I spent the hole day on it and that wasn't quite waste of my time. Yeah-yeah, of course it was... but first of all that was great and funny! You should try this beautiful flashback!",
            "review_score": "1"
        },
        {
            "review_text": "runs great on windows 10 pro   no problems. fav childhood rpg series ",
            "review_score": "1"
        },
        {
            "review_text": "A great way to share this gem with a new generation",
            "review_score": "1"
        },
        {
            "review_text": "To be honest, this game is one of the best point 'n click adventure games although i am a big fan of grim fandango. Maybe it is possible that Monkey İsland is better. İt serves you puzzles which are funny but no easy to solve. Briefly if you have interest in games like that , you will have great times with Monkey Island without getting bored.",
            "review_score": "1"
        },
        {
            "review_text": "Must have!",
            "review_score": "1"
        },
        {
            "review_text": "Rating 6.5/10 Overview: Point and Click Adventure  The Good:  + The ability to change between modern and retro style graphics any time is really cool.  + Fully voiced acted in modern mode.   + Clever dialogue, fun characters and an interesting world   + Soundtrack   The Bad:  - You can't skip dialogue when you are in 'modern mode'. You have to switch back to retro if you want to skip dialogue   - The interface is worse in modern mode than in retro mode. In the original, you had all your commands and inventory on the screen so it was easy to issue commands and use your inventory. In modern mode, inventory and commands are hidden off screen, you can use your mouse wheel to scroll through a list of commands but that becomes tedious. Lets say you want to combine items in your inventory, first press 'I' on the keyboard, then scroll to the 'use' icon with your mouse wheel and click on the item, THEN press 'I' again to open up your inventory and then find the item you want to combine it with...... nothing modern about this at all. If you are going to modernize the graphics then you should atleast modernize the interface as well.   - A lot of puzzles require needless backtracking that makee solving them a huge chore.   Conclusion  I know Secret of Monkey Island is sacred to most gamers. It was one of the best and most successful point and click adventure games of its time. I'm glad they remade this game that works reasonably well for modern computers, but if you are going to play this, stick to the original mode.",
            "review_score": "-1"
        },
        {
            "review_text": "Worth every dollars i've spent",
            "review_score": "1"
        },
        {
            "review_text": "I love this game.  Monkey Island is my old favourite game and I 90% recommend it, the remaining 10% leaning towards the fact that if you don't enjoy point and click puzzle/adventure games this is NOT for you.   This game has incredible characters, amazing smart puzzles, incredible adventures and an eerie feeling throughout the whole game (I better not forget the monkey's! They're awesome!)  So the story of this game (Which is very well written) is that you are Guybrush Threepwood, a wannabe pirate. You must go on three trials to become a true pirate, once LeChuck, the evil ghost captain, hear's that Guybrush is in town and up to no good (Well, no good for him) he attempts to capture him, torture him and kill him. He also want's to marry SPOILERS Guybrush's girlfriend, Elaine.  It's very difficult to find a flaw with this game, it seems almost perfect. The only problem is that sometimes there's no music which can be just eerie and just doesn't feel nice, it's a very scary game in that sense.  The other thing is some puzzles are too hard and keep you trapped on them for sometimes weeks, but you could use the hint system to help you which is a helpful add on.  The voice acting is pretty good in my opinion and so is the music (If it's even there) and the sound effects, although scary they're superbly atmospheric and you won't get tired of them.  Another thing you won't get tired of is the adventure: It seemingly never becomes boring, it always feels interesting and enjoyable.   And there are a HUGE amount of locations and now for my favourite part of the whole game... The sword fighting. But let me keep that a surprise. Let me just say, it's not sword fighting like how you'd imagine it.  The graphics are good too, especially with the special edition's effect.  And the final verdict for The Secret Of Monkey Island: Special Edition is the highest verdict so far... A 9.5/10. The few flaws JUST deprive it of that beautiful and unachieved 10/10 but it's still an amazing game and it will forever hold a piece in my heart.   Until the next review! :)",
            "review_score": "1"
        },
        {
            "review_text": "It's the classic forged in the golden era of LucasArt everybody loved, but revamped.  If you like adventure games and never played it, now it's your big chance of grabbing some sweet updated game history. The humour is soberb just like the story.",
            "review_score": "1"
        },
        {
            "review_text": "The best point and click of all times. Thats all you need to know if you're thinking about buying it. This game is epic.",
            "review_score": "1"
        },
        {
            "review_text": "The visuals are nice and the story is interesting but the mouse controls suck.  Honestly, I expected much more from this game. However, it is a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice and well made remake. History is pretty much the same as the original. Takes 2 to 5 hours to finish. I have way more thant that because I tend to leave my PC on and forget the game is running.",
            "review_score": "1"
        },
        {
            "review_text": "Clunky, tedious and dated gameplay interspersed with incredibly slow-moving dialogue scenes that make you feel like you're playing an interactive childrens' book.",
            "review_score": "-1"
        },
        {
            "review_text": "The updated graphics are bad, the voice acting is poorly timed, and the dialog doesn't sound that good out loud. Suddenly there are loading times where none existed before. Play it the old way or don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun point and click adventure, only takes a few hours to finish but is full of funny moments.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing series. I wish MI3 and 4 would be released on Steam soon.",
            "review_score": "1"
        },
        {
            "review_text": "A very good point and click adventure game!",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious and the puzzles are extremely satisfying to solve. It's one of the few point-and-click adventure puzzle games I've played that contained no joke 'puzzles' or pointless features.",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME remake!!!! very funny point and click adventure with Pirates!... ARGGGG",
            "review_score": "1"
        },
        {
            "review_text": "A classic quest remastered with a new modern graphics. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I grew up playing these games, I think they did a decent job on this one, I don't like Guybrush's redesign much and there's a few stray lines in the updated art, I think they did a much better job on the 2nd game but that's most likely due to lucasarts giving them a bigger budget after seeing this game's success.   the core game is still there, so there's that.",
            "review_score": "1"
        },
        {
            "review_text": "Great if you like old adventure games. This version even lets you see it in its original version. Always liked the insult sword fighting.",
            "review_score": "1"
        },
        {
            "review_text": "'My name is Guybrush Threepwood and I want to be a pirate!' These words will stick with you long after you've completed the game. It's one of the most creative games in terms of plot, dialogue, art direction and characters. You won't get a chance to get bored. Oh, and the general overhaul of the game(without changing any of the gameplay) is a nice and welcome adaptation for the 2010s. You still get the option to play retro style, if you want to, with all the magic of 8-bit music and state-of-the-art 1990 graphics. So it's all extra, no downsides. The Special Edition is hands-down the best version of the game.",
            "review_score": "1"
        },
        {
            "review_text": "I remember sitting in my friend's house playing this game, and being able to play it again after so many years It's just awesome. ",
            "review_score": "1"
        },
        {
            "review_text": "Faithful scene by scene remake of the classic game that kept the genre alive.",
            "review_score": "1"
        },
        {
            "review_text": "I got lost and never found, Falling leaves falling leaves on the ground.",
            "review_score": "1"
        },
        {
            "review_text": "Now I remember this game the first time round and absolutely loved the original. I was overjoyed to be able to play back through on a modern machine again and relive all those memories. I was a huge fan of the old Lucas Arts point and clicks and the Monkey Island series was right up there in my favourites. I love the characters, even the purposely annoying ones...cough...Stan...cough. The sometimes ludicrous puzzles are always funny, which makes the fact that some of them are a bit out there totally fine. If you've never played, or heard of Monkey Island before I cannot recommend these games enough. If you don't have the time or will to play, feel free to check out my full playthrough below:   Monkey Island Full Playthrough  ",
            "review_score": "1"
        },
        {
            "review_text": "While the graphical update, along with the redone voice overs, detracts some from the original charm of the game, this Special Edition has allowed me to relive one of my favorite game franchises. 10/10, 5/5, A+++. A must download for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "Simply great! Got the original in the early 90's. Loved it! The new one is fab too. They really need to bring back some of the good old stuff - Ringworld, Kyrandia.",
            "review_score": "1"
        },
        {
            "review_text": "This was my first introduction (as you would expect) to Guybrush Threepwood, Mighty Pirate. I loved it so much that I got the sequel and then Tales of Monkey Island after that. It's not your typical point and click adventure game; it's a lot funnier, for one thing, but it also requires a bit more out-of-the-box thinking than any other game I've ever played in the genre. While that can be frustrating at times, it is also VERY refreshing.  Prepare your eyes for the visual atrocity that is Stan's jacket, though. And I mean that in absolutely the best way possible.",
            "review_score": "1"
        },
        {
            "review_text": "A classic that defined a genre and had many a swashbuckler learning how to sword fight the true pirating way. Wit.  This remake is a lovingly re-creation of the original, that adds fantastic artwork and lively voice acting that feels perfectly in-keeping with the originals theme. The only character I think looks worse is Guybrush. He looks quite weedy in this rendition. You can really see the difference in the last shot, where you see his face in the old version.  I have to admit that I preferred the IOS version of this game though. The UI on the PC feels much more clunky, often having to open two menu's to do something (verb menu and item menu) and it feels like a step back from the original's slightly more intuitive interface.  After completing Monkey Island three times, including the original back in the day, I clearly have strong nostalgia with this title. But even after three times, some of the puzzles still feel pretty random or have flaky logic.   Still a classic. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this game so much it is just so fun and so well what word am I looking for... mindracking I suppose the puzzles are so fun",
            "review_score": "1"
        },
        {
            "review_text": "This is the first PC game I ever remember seeing, and it is what started my love affair with the point and click adventure. They did a wonderful job of remastering this game, and I hope and can't wait to see if they do the rest. Excellent work, please do the Curse next!",
            "review_score": "1"
        },
        {
            "review_text": "I really wish there were achievements for the steam release.",
            "review_score": "1"
        },
        {
            "review_text": "After 20 years, the Monkey Island series remains one of, if not THE greatest adventure game series of all time. If you like good puzzles and laugh-out-loud dialogue (and who wouldn't, really?), you should absolutely play it. And now, with the remakes of the first two games, you no longer have the excuse of sh-tty graphics and an archaic interface to not make the plunge. So do it!",
            "review_score": "1"
        },
        {
            "review_text": "Played through with my girlfriend and had a blast watching her struggle with puzzles I already knew the answer to. Spent most of the game in classic mode because the modern interface loses some of the jokes (eg the scene behind the wall in the governor's house) and it is a bit weird to use. The MI2 re-release got the classic/modern mix working a bit better.",
            "review_score": "1"
        },
        {
            "review_text": "Look behind you! A three headed monkey! Fine leather jackets, rubber chicken with a pulley, and the mightiest pirate ever to walk the earth Guybrush Threepwood! Best. Game. Ever. Play it or face the wrath of the ghost pirate Lechuck!",
            "review_score": "1"
        },
        {
            "review_text": "An absolute classic even 26 years later and the updated visuals and voices are great. If those aren't your thing then you can switch back to the original graphics/text,",
            "review_score": "1"
        },
        {
            "review_text": "Fav game of all time, will always come back to this again and again!  At least I’ve learnt something from all of this... Never pay more than 20 bucks for a computer game. (Best quote ever)",
            "review_score": "1"
        },
        {
            "review_text": "I love the game, but it won't work anymore with the actual NVidia drivers! (GTX 980)  EDIT: It works again with the new drivers.",
            "review_score": "1"
        },
        {
            "review_text": "No one should not have this game in there collection. One of the best adventure games you should play.  Nominated for Test of Time award as the monkey island series is the only series of games on steam I have continously replayed since I was a youngling.",
            "review_score": "1"
        },
        {
            "review_text": "Over 25 years since it was created and still the most hilarious game ever to grace a hard drive.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilarious. And as someone who played the original all those years ago, I appreciate the ability to hotswap between the old and new art styles. This well made production successfully brings an old classic into the new generation. Play it. Love it.",
            "review_score": "1"
        },
        {
            "review_text": "A real classic re-imagined. Everbody should have played it at least once!",
            "review_score": "1"
        },
        {
            "review_text": "Secret of Monkey Island is one of the best graphic adventure games I've had the fortune to play. Immersive story, fun and creative dialogs and ingenious puzzles make this game a must play for both young and old gamers alike. I played this game for the first time around 1997. It was the remastered version of the first floppy disc one, which had a revamped GUI and better music, and since then, it has been on my top 5 best games of all time list. On the downside, the new version makes everything look overlight, making it look (In my humble opinion) kind of cheap (Altough it may be nostalgia speaking, as the pixelated classic version let a lot more to your imagination). In retrospective, this was, and still is, an excelent game worthy of every game library out there. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "a timeless classic, you can't go wrong here.",
            "review_score": "1"
        },
        {
            "review_text": "A must-have for all the mighty pirates :ahoy:",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, such a classic. Great puzzle game. Even when you get stuck, you always have the humour to look forward too. This re-vamped version has definitely stood the test of time. (but you can still play old-school-pixel if you like too ^^).",
            "review_score": "1"
        },
        {
            "review_text": "If my personality and humor could be bottled and poured out in a game, it would be this one. A must have for any character focused adventure gamers.",
            "review_score": "1"
        },
        {
            "review_text": "You know the adventure genre is not dead. Once you play this game you'll probably poke around the Internet for other similar games of the 'Adventure' genre. If you've never played an adventure title you owe it to yourself to try at least one. The Secret of Monkey Island is a great place to start.  Once you finish look on Google for AGS (Stands for Adventure Gaming System), it's a programming language for writing your own adventure games. There are a lot of them online, free to download and enjoy. Some of them are even made by Yahtzee Crowshaw. If you don't know who he is, Google him, he's a fabulous writer and sly whit and cynicisim will leave you in stitches.  (He also writes horror adventures that will freak you the hell out!) Don't miss out on this wonderful genre, get started here ASAP.",
            "review_score": "1"
        },
        {
            "review_text": "I used to play this with my dad when I was 5. This is a great series and this is the game that started it all!",
            "review_score": "1"
        },
        {
            "review_text": "Still playable in either graphics setting. They really don't make them like this anymore.",
            "review_score": "1"
        },
        {
            "review_text": "Just as good as when I played the original, all those years ago. The voice acting is very good, and the ability to switch between original graphics and the new high definition graphics is great.",
            "review_score": "1"
        },
        {
            "review_text": "Become a pirate, save the damsel in distress, fight the evil ghost pirate, become a swrod master and find treasure!  When this game came out originally, it was a total blast. Great writing, really funny and a fantastic adventure with silly and clever puzzles. Today, perhaps adventure games like these are a little outdated. But this remake is well worth it, if you enjoy the series. In many ways, the first Monkey Island is the best game, and now you can enjoy it fully voice casted, with improved artistic graphics and music. And if you don't like that, you can easily swap back to the original version as well.  Perhaps mostly suited to people who know and enjoy the series, but the game is good enough for people who have not tried it before and want to try a really funny and great adventure. Probably one of the better adventure games ever made, with a great style and atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "I bought an old floppy disc version of Monkey Island some years ago and really enjoyed the nostalgia of playing it again. Then I played the Special Edition and the new graphics seemed to blow away the old blocky pixels. I just played through the Special Edition again and now I find myself missing the old blocky pixels. It's a beautifully put together game, but the art style is off. I'm especially not keen on the way that Guybrush Threepwood and Governor Marley are drawn. That being said, the Special Edition does let you switch to the old graphics and sound by hitting F10, so you get both versions of the game :o)",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing... played it when I was little, played it again now... it's still awesome...",
            "review_score": "1"
        },
        {
            "review_text": "Classic LucasArts with classy new graphics. Oh nostalgia...",
            "review_score": "1"
        },
        {
            "review_text": "Anyone who is familiar with the days of the amiga should know that monkey island just has to be played. Classic.",
            "review_score": "1"
        },
        {
            "review_text": "The game that started it all. The market of of tongue-in-cheek adventure games just wouldn't be the same without this series, and now you can play it in glorious HD with voice acting!",
            "review_score": "1"
        },
        {
            "review_text": "This is youth sentiment. Love the gameplay, exactly the same as the original, but better!",
            "review_score": "1"
        },
        {
            "review_text": "Played old one years ago and I fully enjoyed the another playthrough. This game is a must.",
            "review_score": "1"
        },
        {
            "review_text": "Remake of one of the best point-and-click adventure games by LucasArts.  Join Guybrush Threepwood on his quest to become a pirate and find the legendary Monkey Island. Epic insult sword-fights, sailing the seven seas, hypnotizing monkeys ... a must-have for anyone who enjoys good humour and epic stories.",
            "review_score": "1"
        },
        {
            "review_text": "An unbelievable journey from beginning to end, listen to old jokes, old tales, and old characters given a breath of fresh air and a new coat of paint. Even if you've heard all the old jokes, you'll still be caught off-guard by this game's silly themes and surprisingly cheeky wit. Definitely a nice play if you like adventure games, and don't mind the 'try everything' approach for when you're stuck. (Don't worry, there's hints for if you don't)",
            "review_score": "1"
        },
        {
            "review_text": "Very great game, with good jokes, and well constructed puzzles. Being a point-n-click game, you may need some walkthroughs. But after one playthrough, all the puzzles are fuzed to your soul. BUY IT!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best point and click games. Would recommend that everyone should play it, and give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite Adventure Game of all time comes in a pretty new coat. One can still switch back to original graphics, too. If you haven't played this Masterpiece you definitely should!",
            "review_score": "1"
        },
        {
            "review_text": "Classic! graphics given a little boost but still the fantastic old gameplay. Oh and now has voices! A must buy",
            "review_score": "1"
        },
        {
            "review_text": "This game shaped my childhood years and I'm still broken from it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm terrible at point-and-click games, so I couldn't beat this without a walkthrough, but it was absolutely hilarious. It's the cheesiest pirate game in history and I love all the characters. Some good voice-acting, great music, and hardly a minute without something silly enough to cause a giggle.",
            "review_score": "1"
        },
        {
            "review_text": "THE GOOD: Play with updated graphics or the original, fully dubbed speech, still works the way it did in the old days THE BAD: Newer gamers may struggle with the concept A classic point and click that received a legitimate HD remake. A fantastic upgrade to a timeless classic.",
            "review_score": "1"
        },
        {
            "review_text": "TSoMI:SE is the second best game about monkeys and islands I have ever played!",
            "review_score": "1"
        },
        {
            "review_text": "Sweet memories :) .. It's been awesome to see the old characters again in updated graphics ..   Voices to all dialogue makes it a really fulfilling revisit to this game  If you have played the original, or any game in the Monkey Island(TM)-game series. and you feel like a trip down memory-lane (on first class mind you ;)), then this is a game to buy :)",
            "review_score": "1"
        },
        {
            "review_text": "I never played this game growing up. So in 2015, 25 years after its initial release i only had 1 question  does this game measure up by todays standards?  the answer is:  Yes, yes it does",
            "review_score": "1"
        },
        {
            "review_text": "Pays homage to the 8-bit version released in 1990 by LucasArts, so it's a blast from my past! Pirates, excellent graphics, a bit of point-and-click puzzling, and silly writing make this game thoroughly enjoyable for everyone!",
            "review_score": "1"
        },
        {
            "review_text": "Game from my childhood, now in a remastered version. wonderfully :-)",
            "review_score": "1"
        },
        {
            "review_text": "Just as good as i remember.  Great game, def recommend for anyone interested in poinnt and click adventure, or just humourous games in general.  10/10 for me",
            "review_score": "1"
        },
        {
            "review_text": "The story is the perfect length. It does not overstay its welcome like Monkey Island 2, and the sword fighting/insult puzzle is one of the most fun moments I've had in video games. ",
            "review_score": "1"
        },
        {
            "review_text": "It's Monkey Island so it's great... except the fact that the voice acting is horrible. And what the hell is the haircut Guybrush has? Great, but I would recommend the original, if you can get your hands on it.",
            "review_score": "1"
        },
        {
            "review_text": "My second favourite point-and-click adventure game of all time. I love it; the humour, the mystery, the adventure... Amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing adventure games for years, and love the genre. LucasArts helped define adventure gaming with the original Secret of Monkry Island, and it's stood the test of time since the remake has made it possible to keep on newer machines. That being said, I did not play this before the remake and I think the lack of nostaglia has made this game somehow less exciting for me than I had hoped for after years of hearing about it. The gameplay mechanics are tiresome, the story is pretty one-dimensional, and it's never going to crack my top 10 point-and-clicks of all time... but it's certainly worth having in your library if you see it on sale as a fun retroscpective on the genre.  TL;DR worth it on sale as a throwback, but don't let the hype you may have heard set your bar so high that it can't reach it.",
            "review_score": "1"
        },
        {
            "review_text": "Oh the memories...",
            "review_score": "1"
        },
        {
            "review_text": "- pirates - monkeys - aggressive seagulls - trolls - GROGG - rats - parrots - treasure - ghosts What more could a game offer? Go and play it!!!",
            "review_score": "1"
        },
        {
            "review_text": "A great comeback includes the nostalgic 32-bit version graphics and also the new graphics, The stopry is really nice and immersive.",
            "review_score": "1"
        },
        {
            "review_text": "The yarrrdstick against which all other point'n'click advenutres are measured.",
            "review_score": "1"
        },
        {
            "review_text": "It is a funny game, which I love playhing since I'm small.   The only thing that I would change is the gameplay itself. This could be also made as a fance flash-game",
            "review_score": "1"
        },
        {
            "review_text": "Classic of LucasArts! My recommend!!!",
            "review_score": "1"
        },
        {
            "review_text": "The greatest adventurer there is. It brings feelings of something I cannot deny. It's like a drug; you have to try it yourself to really understand what it is.",
            "review_score": "1"
        },
        {
            "review_text": "Classic masterpiece from my childhood, now with updated graphics and added voice acting. Still as entertaining as the first time through. This game is a perfect introduction to the 'point and click' genre. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This was and still is one of the best adventures (if not THE best) and funniest PC-games ever.",
            "review_score": "1"
        },
        {
            "review_text": "It's still the best, funniest, point and click adventure game of all time. Sure they ruined Guybrush's hair style and the remastered graphics would benefit from the inventory and verbs being at the bottom like the original, but it's almost perfect so who cares. Play it!   Give clown stylish confetti.",
            "review_score": "1"
        }
    ]
}