{
    "app_id": 323680,
    "name": "Caffeine",
    "release_date": "2015-10-12",
    "developer": [
        "Incandescent Imaging"
    ],
    "publisher": [
        "Incandescent Imaging"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "VR Support",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "First-Person"
    ],
    "achievements": 11,
    "positive_ratings": 8,
    "negative_ratings": 35,
    "price": 8.29,
    "description": "Caffeine is a quirky first person adventure game with environmental puzzles and a dab of psychological horror. Set in the near future, the entire population of Earth is vigorously addicted to coffee. You awaken aboard one of these caffeine mining stations alone.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/323680/header.jpg?t=1510199592",
    "minimum_requirements": "Mínimo: SO: Microsoft Windows 7 and above Procesador: 2Ghz Dual Core Processor Memoria: 4 GB de RAM Gráficos: 1GB Dedicated Graphics Card DirectX: Versión 11 Almacenamiento: 4 GB de espacio disponible",
    "recommended_requirements": "Recomendado: SO: Microsoft Windows 7 and above Procesador: 2.8Ghz Quad Core or Higher Memoria: 8 GB de RAM Gráficos: AMD R9 270 or Nvidia GeForce 760 or Higher (2GB+ Recommended) DirectX: Versión 11 Almacenamiento: 4 GB de espacio disponible",
    "reviews": [
        {
            "review_text": "I've been following the development of Caffeine for some time now. The developer, Dylan Browne, is probably one of the kindest, most transparent and hardest working indie developers I've seen in quite a while. However, there are several unmistakable flaws regarding Caffeine that, at present, would prevent me from recommending this game to friends, especially at its current price point.   Caffeine is a sci-fi horror game set in the near future on a (seemingly) abandoned spacecraft that mines caffeine for earthlings in deep space. You play as an unnamed child protagonist, and you wake up on the ship and search for answers. Seems like a great concept, and I will admit that.   However...  Please save your money and wait for Incandescent Imaging to straighten out the bugs and refine this game.  For starters, I would go on a limb and say this game is very poorly optimized. My rig can run Mad Max, Battlefield 4, and Alien: Isolation maxed out at 60fps, 1080p, and no framerate drops. I am lucky to get 20-30 with the lowest settings on this game at 1080p. From what I understand, this game was intended to be ran at higher resolutions such as 4K, and running it on low (which is the only way I can get stable framerates) resolutions just doesn't make for an enjoyable experience.  Next, I would like to say that the physics in this game are beyond any level of comprehension. Picking up any assortment of objects is a spell for a glitchy, ragdoll disaster. Regardless of size, items don't always do what they're supposed to, sometimes walking with a keycard will send it spiraling into another room, sometimes it'll move a chair next to you. To me, this totally ruins the immersion factor with laughable physics.  Going along with poor optimization, there are some areas on the ship that have missing textures, and you can see through parts of the hull. I was not able to capture screengrabs of this, but near the beginning of the game and further in, it is apparent that there are some glitches.   Some bugs came up, too, such as doors not opening and closing properly, the player character clipping through chairs, being stuck in doors, as well as items thrusting you across a room. One funny glitch was that my character shrunk in size further while crouching in a water-flooded area. L O L   There appears to be no real goal in hand apart from exploring the spaceship as there is no HUD or objectives or anything, you just have to do guesswork and hope a keycard is lying around. I can appreciated the immersion attempt at forcing the player to read the sticky notes and listen to audio logs, but in the end, I got frustrated by walking around for about an hour and making no real progress and quit the game to write this review. This game has potential, but that is sadly spoiled by all that's wrong with it. I hope this can be fixed.  Due to the poor performance of this game it's hard to really enjoy it as it was intended which is a real shame, as I had incredibly high hopes for Caffeine. You can zoom in on notes and monitors to get tidbits of information on the crew and a window into what happened aboard. However the fun ends when computer monitors with text boxes end up being a jumbled, pixelated mess.  Also, the flashlight in the game is essentially useless, sometimes it won't even turn on, and when it does, it doesn't last for more than 30 seconds. Ruins it for me. Unsure if this is a bug, or what.  The game is, at present, a glorified 'walking simulator' that borrowed some pages from games such as Alien: Isolation, System Shock, SOMA, Routine, and Bioshock, but without the real sense of doom that those convey. I had not, in 90 minutes of playtime, encountered a single threat or enemy type apart from the game's glitches. There were a few 'enemies' and scares in the various tech demos of Caffeine, but they have since disappeared.   This isn't an issue to me-- if the concept of Caffeine had more time on the drawing board, and a bit more time for revision, I would say this game is a perfect candidate for Early Access. At present, it is nowhere near a complete episodic game and needs plenty of work.   Finally I notice i'm not the one having issues saving graphical settings in Caffeine, they seem to reset every startup and there are no save points in the game (that I'm aware of.)  However, there were some things about this that I did enjoy, notably: -Native controller support for Xbox gamepads -Wonderfully constructed level design creates sense of dread, isolation, and claustrophobia around every corner -Oozing with atmosphere -Even if it is poorly optimized, the graphics are incredibly beautiful -Sound design is arguably the best i've experienced since Alien: Isolation -Plot leaves a bit to be desired but takes a unique spin on the tropes set forth by Slender, Among the Sleep, and SCP. -Chilling concept (but poor execution)   6/10, honest rating. A lot of hard work went into this, but, alas, not enough.   I have waited quite some time for this title, only to be let down. I will be uninstalling Caffeine from my PC after submitting this review. I'm anxious to try it again, but not until the bugs get sorted out. I am totally excited to see how this game pans out. Dylan, if you're reading this, please don't take it to heart, I believe in you, I just can't recommend this game right now.",
            "review_score": "-1"
        },
        {
            "review_text": "A pretty decent atmospheric game - it's a shame that the physics are totally broken.",
            "review_score": "-1"
        }
    ]
}