{
    "app_id": 32410,
    "name": "Lucidity™",
    "release_date": "2009-10-07",
    "developer": [
        "LucasArts"
    ],
    "publisher": [
        "LucasArts",
        "Lucasfilm",
        "Disney Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Platformer",
        "Puzzle"
    ],
    "achievements": 12,
    "positive_ratings": 37,
    "negative_ratings": 16,
    "price": 4.79,
    "description": "From the team that re-imagined The Secret of Monkey Island™, comes Lucidity, an addictive puzzle platformer set in the surreal childlike dreamscapes of the little girl Sofi. In this challenging puzzler, it’s your task to keep Sofi safe as she drifts deeper into the strange new world of her dreams.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/32410/header.jpg?t=1542757756",
    "minimum_requirements": "OS: Windows XP Service Pack 3 or Vista Processor: Intel Pentium 4 3 GHz  or AMD Athlon 64 3000+ Memory: 256 MB RAM, 512 MB for Vista Graphics: 128 MB with Shader Model 2.0 capability DirectX®: 9.0c (March 2009) Hard Drive: 520 MB Sound: DirectX® 9.0c compliant sound card         Controller support: Xbox 360 controller",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A combination of platformer and Tetris. Character moves forward at a constant pace. Place various puzzle pieces in the level to keep the girl from falling. Beautiful artwork and all around lovely game. A real work of art. Definitely worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "She auto moves right and you place utilities to make her avoid obstacles.  The gameplay of this game is bearly existent. it is a painfully slow simple game made around what would normally be a half ♥♥♥♥♥ mini game.  The art and animation would be it's saving grace, but with such limited content in the game there isnt a lot to see.  Do not buy this game without checking out the a lets play on youtube, you just need to see one level played because they are pretty much all the same",
            "review_score": "-1"
        },
        {
            "review_text": "OMG this game sux so much. F*CK YOU LUCASARTS.",
            "review_score": "1"
        }
    ]
}