{
    "app_id": 32420,
    "name": "STAR WARS™: The Clone Wars - Republic Heroes™",
    "release_date": "2009-10-06",
    "developer": [
        "Krome Studios"
    ],
    "publisher": [
        "LucasArts",
        "Lucasfilm",
        "Disney Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Partial Controller Support"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Star Wars",
        "Singleplayer"
    ],
    "achievements": 0,
    "positive_ratings": 166,
    "negative_ratings": 279,
    "price": 15.49,
    "description": "Star Wars The Clone Wars: Republic Heroes lets Star Wars fans young and old live out the sweeping galactic adventures of the Clone Wars. For the first time ever, players can fight as their favorite Jedi and Clone Troopers from the preeminent animated television...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/32420/header.jpg?t=1542757853",
    "minimum_requirements": "OS: Windows XP or Windows Vista Processor: Intel P4 3.0GHz AMD XP 3000+ or higher Memory: 1GB Ram, 2GB for Windows Vista Graphics: Nvidia 7300 GS or better, ATI X1600 or better* *Requirement of 256MB or more video memory DirectX®: DirectX 9.0c Hard Drive: 8GB Sound: 100% DirectX 9.0c compatible audio Device Controller Support: Yes Other Requirements: Requires login to Games for Windows - LIVE",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I bought this to play in multiplayer with my 5 year old....she loves it..for kids who love watching the clone wars cartoon, it has all the main characters. Most importantly they can play as Ahsoka! Controls are easy for her to use and she loves the style of the game. Its just like the cartoon. Very easy for her to navigate the screen and gameplay is simple.  If your looking for something more complex then dont buy this. If your looking for a game for a child between 5-7 then this is ideal.  ",
            "review_score": "1"
        },
        {
            "review_text": "*Starts game* 'All right, let's check it out.' *Games for Windows Live required* '...' 'Goddammit' *30 minutes later, finally have an account* *Starts up game again. 'GFWL requires update'* 'Of course. Of ♥♥♥♥ing course.' *Starts up again, finally starting campaign* *Worse graphics than LEGO Star Wars* 'Oh god, no' *Cringeworthy disney channel sitcom animations* 'nononononononono' *Ballerina fighting animations* '♥♥♥♥ this. ♥♥♥♥ you.'  1/10",
            "review_score": "-1"
        },
        {
            "review_text": "Star Wars The Clone Wars - Republic Heroes is difficult choice when it comes to an enjoyable game. It has many fun aspects to the game i really enjoyed. When i played as one of the Jedi Knights, i had alot of fun swinging my lightsaber through droids on screen. When i started playing as the Clone Troopers, i refreshed from the change in gameplay. These were some of the good aspects of the game, but they cannot compare to the troubling glitches or bugs that came with it. The fun of playing as Anakin Skywalker quickly disapeared when the jumping mechanics were shown. I found myself stuck on parts of the level for ages because the character would never land where you wanted them to. They would keep missing the ledge by the smallest fraction and i would be sent back to the start. That is the most frustrating glitch in the game and the most seen.  Also worth mentioning, if you do not have a microsoft live account then you will not be able to save your progress in the levels.  If you are a fan of the Clone Wars series you might enjoy the feeling of fun pace of the game. But for $19.99, maybe not. When it is on sale you may get some fun out of it for a while but you may find your self not coming back to it again.  To put it simply, if this wasn't titled 'Star Wars', it wouldn't be in my Steam Library.",
            "review_score": "-1"
        },
        {
            "review_text": "This is unfortunately a weighty blotch on the reputation of the Star Wars gaming franchise. What strikes me more than anything, given the fact this is an official Star Wars title, is how overwhelming 'budget' the entire experience feels. The sub-seven hours I spent with it became all the more wearisome as it went on, revealing more and more horrible design decisions and a blatant lack of any sort of meaningful playtesting. I sincerely did try to enjoy this, although it was with a mighty sigh of relief I breathed when it was all over.  Now a little disclaimer, I haven't actually watched any of the cartoon show, but from the clips I've seen the art style does seem quite faithful. But what is puzzling is how poor the graphics are overall, given that the game is only half a decade old. I thankfully had no problem in getting the game to run, but to those still struggling, I implore you to not waste your time.  The dialogue is suitably inane and suits the Saturday-morning-kids-cartoon feel that they were aiming for. As you progress through each level the characters will jabber back and forth at one another. However, combat is not paused during these exchanges, and to skip through these conversations, you press left-click. To fire, you also press left-click. And given that you have very little to do in the game beyond firing, odds are you will blaze your way right through these conversations, with broken audio fragments punctuating your battles in a very jarring staccato-beat. Though as a small mercy I'm fairly sure none of the conversations would have turned around my enjoyment of this train wreck.  The game is separated into 3 acts, each separated by a rather well done movietone-esque war news broadcast updating the viewer on the current events. Between level cutscenes are not quite so well done by and large, and are overlong. Thus the brevity of the 40-odd levels (some clock it at 3-4 mins to complete) means any sort of meaningful flow is brought right back down to earth constantly by the recurring cutscenes.  The gameplay is fairly boring and repetitive, with the designers playing it safe with the generic action-adventure style of running, jumping between platforms, and blasting or slashing enemies as they rear their heads. However the platforming sections are horrendously bugged, with the game completely misinterpreting the jump command altogether and plummeting you to your death ad nauseam. Thankfully you jump between most characters in the game level to level, which stops it being a complete snore-fest, and the ones where you play as clones give you a welcome respite from the awful platforming. However, even these sections are flawed as the camera angles chosen are woeful. And countless times I was shot down by unseen enemies off screen but I wasn't able to return fire!  Various other glitches abound, such as where you would get permanently stuck on scenery or the next area/cutscene would fail to trigger, forcing a level restart.   RPG elements are laughably token, with the majority adding nothing to gameplay whatsoever. You can also do challenge missions to gain more upgrade points. In these, you have to complete certain actions within a time limit such as killing a bunch of enemies in a certain way or collecting as many free-floating points as possible, and these pop up as you clear certain areas. But after I completed a few and realised they were all just pointless busy-work, I skipped doing them altogether. And even at that I still managed to buy all upgrades well before the game's end.  Now I know, given the fact this is aimed at children, I can't expect a Dark Souls-like experience. But the game is ridiculously easy, and dying in this game doesn't stop combat or respawn enemies, your partner keeps firing on and then you appear beside them, fully healed, a matter of seconds later. I believe they must have decided to go this way when it was clear the jumping and camera angles would induce countless unnecessary player deathes and if they wanted people to finish they had to make the constant death less painful. It also removed any sort of challenge and made me even less enthusiastic to play on.  Now there are moments of sporadic genuine fun to be found but they are smothered under the weight of all the issues the game piles upon itself. Do yourself a favour and pick up virtually any other Star Wars game available instead.",
            "review_score": "-1"
        },
        {
            "review_text": "I would give this game a 5/10 but since there's not a 'meh' option for Steam reviews I'll go with a recommendation.  This game does have its flaws. Most folks will need to download and install Microsoft Games for Windows Live in order to play the game and there is an annoying bug where the game will start with Co-op turned on and you won't be able to progress until the other player character is moved.  But once you get into the game, it evokes memories of the Playstation 2: Lord of the Rings the Two Towers and Return of the King games in that you control characters through a sort of gauntlet from one end of the map to the other, racking up kills as you go. The graphics are very close to the CGI animation of the Clone Wars TV Series and has all of the original actors. There are moments where you feel like you're watching an episode of the Clone Wars.  That said there are some annoyingly frustrating sections where due to camera angles you end up missing jumps for small platforming areas and falling straight down a bottomless pit. The bugs mentioned above and this issue are the biggest obsticals for this game.",
            "review_score": "1"
        },
        {
            "review_text": "The only real problem I have with this game is the lack of being able to actually die. Usually I start games on the hard or medium difficulty because I like the challenge. Since there were only two I chose the former. I was expecting something somewhat hard. I beat 1 1/2 levels and couldnt continue. Not because it was hard but because the hardest difficulty was not hard enough. Checkpoints are too frequent and bosses health dont reset if you 'die'.",
            "review_score": "-1"
        },
        {
            "review_text": "Based off the children TV series. A shoddy miss mash of platforming, fighting and shooting. Which all the those elements have been combined WAY better before in other older Star Wars games. AKA Outcast, Academy and Battlefronts. I think I have triggered some kids with my opinion. Wow just look at the down votes, ooh... This was in the Star Wars collection bundle so it was not a intended standalone purchase so I kind of got lumped with it, ouch...",
            "review_score": "-1"
        },
        {
            "review_text": "Fell off abour 20 times 10/10 would reccomend",
            "review_score": "1"
        },
        {
            "review_text": "A lazily made co-op exclusive game with a terrible microsoft login thing which will, in the end, not work rendering you unable to save your progress. Awful. The worst ♥♥♥♥ing thing to happen to me. Depressing as hell. I truly have a dark hatred for this game and its problems. If you want to ruin your life, buy this game. ♥♥♥♥ THIS GAME.",
            "review_score": "-1"
        },
        {
            "review_text": "piece of ♥♥♥♥ game. do not buy.   not even worth buying it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad. Really bad. Worst gameplay ever seen.",
            "review_score": "-1"
        },
        {
            "review_text": "GAME ISN'T WORKING IT FIRST WORKED WHEN I BOUGHT IT BUT STOPPED AFTER 30MINS I'VE TRIED EVERYTHING TO FIX IT AND NOTHING HAS WORKED PLEASE FIX THIS ASAP.",
            "review_score": "1"
        },
        {
            "review_text": "  I don't know why people hate this, you don't need to sign into windows live, you can just click the X button in the top right and no signing in or anything is needed... Plus its a very fun game.",
            "review_score": "1"
        },
        {
            "review_text": "My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.' I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because this game gave me cancer anyway.  But in all seriousness, it's just not that fun a game. It wants to be like one of the Lego games, but ends up being dull. That's if you can even get it set up.  Pros:  - Clone Wars themed, I guess - Republic Commando hats can be bought. Cons: -Pain in the ♥♥♥ to set up, getting around GFWL -Not very fun -You can't save without a GFWL account",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ NO this game is crappy and crappier has my old headset! (and that headset was crap!) and the reason why I posted this on 2 Feburary is because I was so busy playing other games and recoomending other games! SO GO AWAY FROM THIS GAME AND NEVER EVER ♥♥♥♥ING COME BACK! but I only liked the clone parts! but the jedi parts were crap!",
            "review_score": "-1"
        },
        {
            "review_text": "Game crashes at start up and despite several solutions proposed in the forums, I've been unable to get it to work. The original support page for the game is no longer active, and there doesn't appear to be anywhere to go for actual tech support. For a $20 game, a much higher level of support is expected. Not recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow, this is just about horrible. The controls are garbage. The voice acting is crap. This game is for small children. If you are not a small child avoid.  You might like this if: You have the IQ a 4 year old.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS CANT BE PLAED ",
            "review_score": "-1"
        },
        {
            "review_text": "thise game suck why does not work? a crap game :(",
            "review_score": "-1"
        },
        {
            "review_text": "dont work : ( but i remember i played it one time and that was cool on a laggy laptop not on a pc that i have now!",
            "review_score": "1"
        },
        {
            "review_text": "I really did enjoy this game. Not happy about it having to go through Windows Live service. But still the game was enjoyable. Glad I got it on sale, cause even playing it on and off it ended reather quick. Still it did feel like you were playing Clone Wars tv series.",
            "review_score": "1"
        }
    ]
}