{
    "app_id": 32430,
    "name": "STAR WARS™ - The Force Unleashed™ Ultimate Sith Edition",
    "release_date": "2009-12-15",
    "developer": [
        "LucasArts",
        "Aspyr Studios"
    ],
    "publisher": [
        "LucasArts",
        "Aspyr (Mac)",
        "Lucasfilm",
        "Disney Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Star Wars",
        "Third Person"
    ],
    "achievements": 0,
    "positive_ratings": 2287,
    "negative_ratings": 1389,
    "price": 15.49,
    "description": "A game that will show gamers the deepest, darkest side of the Force in a story that puts them on a collision course with Luke Skywalker himself.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/32430/header.jpg?t=1545238540",
    "minimum_requirements": "OS: Win XP SP3, Windows Vista SP2 or Windows 7 Processor: Intel Core 2 Duo 2.4 GHz or AMD Athlon X2 5200+ Memory: 2 GB Graphics: 3D Hardware Accelerator Card Required - 100% DirectX 9.0c compatible 256 MB Video Memory with Shader 2.0 support (Radeon HD 2900 or Geforce 8600) DirectX®: Directx 9.0c compatible Hard Drive: 30GB Sound: Directx 9.0c compatible Controller Support: XBox 360 Controller for Windows Supported ATI Chipsets: ATI Radeon HD 2600, 2900, 3650, 3690, 3850, 3870, 4550, 4650, 4770, 4850, 4870, 5890 Supported NVIDIA Chipsets: NVIDIA GeForce 8600, 8800, 9400, 9500, 9600, 9800, 250, 260, 275, 280, 285, 295",
    "recommended_requirements": "Processor: Intel Core 2 Duo 2.8 GHz or AMD Athlon X2 Dual-Core 6000+ Graphics: 512 MB 3D Hardware Accelerator Card (GeForce 9800 GT)",
    "reviews": [
        {
            "review_text": "So, back in 1996, George Lucas, creator of Star Wars wanted to know whether the world was ready for more Star Wars. After all, it had been 13 years since the last film had been released. To gauge the public’s opinion, Lucas launched a massive multimedia project quite unlike anything seen before. The entire Lucasfilm marketing engine would produce and publish everything that would tie in with a feature film release, but without actually releasing a film. The result was the  Shadows of the Empire  chapter. Basically Star Wars 5,5; rich in plot, lore, characters and other elements you’d expect from a Star Wars feature. The project was such a success that it motivated the release of the Special Editions one year later, and finally the prequels.   When you consider that project’s success, it isn’t hard to imagine why Lucas would revisit the concept to continue the Star Wars line, even after the release of  Revenge of the Sith . Once again, the marketing machine was awoken and the fires of the multimedia forge flared to give shape to:  The Force Unleashed    The Force Unleashed  bridges the gap between episodes three and four. It tells the story of the founding of the Rebellion and the uneasy relationship between the Emperor and Darth Vader. The story is compelling enough to keep you playing. At the same time the game boasts an interesting three-way of physics engines that create a spectacular environment to test your mettle. The package is rounded out with great concepts and art direction, but it is stained with severe cosmetic glitches.   The game’s story, and the project’s main plotline follows the exploits of Galen “Starkiller” Marek, who is taken by Vader to be trained in the ways of the Sith after he killed Starkiller’s father himself. Darth Vader raises and trains the boy in secret until he is ready for trials. Vader then sends Starkiller out test his mettle against a number of Jedi who escaped the purge with the ultimate goal of preparing him for a showdown with the Emperor whom Darth Vader seeks to overthrow. The plot ultimately leads to betrayal, rebellion and finally a test of resolve that either leads the universe into the natural course of the larger Star Wars line, or you can derail the entire plot and force the premature end of the rebellion.  While strictly linear and with hardly any exploring to do in both gameplay and lore, the game does offer an interesting bridge between the prequels and original trilogy. Both as an explanation for the founding of Rebellion, as well as Vader’s old personality still seeking revenge against the man who turned him a mechanical monster. The newcomer Galen is a rather disappointing affair. He is your typical bald space marine and communicates through whispers and shouting, but no measure in between. He merits more exploration, because the game makes him out to be stronger in the force than any Jedi seen before. The game makes a set piece out of this by having you drag a mile-long, gargantuan, Imperial Star Destroyer out of orbit with the Force just to draw the Emperor’s attention.  The story is compelling, and certainly interesting for Star Wars fans, but it also introduces some awkward subjects. Like the robot Proxy, who is programmed to both train and kill Galen, while also appearing at the most impossible locations to provide some gratuitous fan service. Or the character of Juno Eclipse, Galen’s love interest, who seems to be just an accessory. All in all though, the story is interesting and enthralling enough to warrant a good romp. The included DLC chapters play a fun “what-if?” game with the original trilogy events, but they’re short, and unsurprisingly, non-canon*.    The Force Unleashed  is a technological show stopper with some very clever design, but also riddled with clichéd traits and other gameplay substitutes. It runs a total of three physics engines at the same to time govern a set of parameters. The first engine, Havoc, controls ragdolls and other jiggle bones to give the game its organic aesthetic. Alongside runs Euphoria, the engine that controls the enemy AI to interact with the environment. That way, enemies with grab on to objects to prevent being thrown away with the force. Lastly, the DMM engine governs the world’s materials and their reaction to collision and impacts. Glass shatters realistically when you send a poor sod hurtling through it into deep space. Everything comes together in LucasArts’ own Ronin engine where you basically play like Kratos from  God of War , but with significantly more lightning.  As Force prodigy, your abilities stretch far beyond your regular Jedi. Force push isn’t just a shove; it’s more like a hadouken. Force lightning now lights up the night sky. You can weaponise the environment by throwing everything and the kitchen sink at you enemies. It is inviting and fun to rip off the walls to toss at your enemies in every new room. However, the multitude options has its limits. A lot of enemies are still dealt with through boring and poorly executed quick-time events. While the physics generally hold up well, they can get buggy at times. It wouldn’t be the first time a boss would sink through the floor after zapping him. Or that the ground suddenly stretches to insane lengths. If you’re entirely unlucky, the game can even give up on you and crash. However, as a PC port, it holds up reasonably well. Don’t expect the illustrious 60fps or 4K resolution. It’s a 2009 game.   While its age does show, the art makes up for it. Although not as stylised as  Republic Commando  or the  Clone Wars  cartoons, the game does a good job looking like a technically advanced version of the original trilogy. The bedlam around you is well married to the fine-tuned art of the levels and characters. Electricity arcs convincingly, characters recoil and writhe in accordance. Air rushes out of rooms as you break the windows; explosions blow enemies away. Trees move and sway in the wind and shockwaves. Some bosses have seen a very stylish makeover from their film versions. Everything is accentuated with John Williams’ impeccable score to heighten the mood.  However, that is where the problems arise. The game shows cracks in the veneer. The music suddenly stops and doesn’t come back on until after a reboot. Or that the sound effects are horribly out of synch with the cut-scenes. Last time, my lightsabre didn’t deactivate during a cut-scene; resulting in a hilarious display of senseless eye-poking. However, it’s such a mess at times you just want to stop playing.   In the end though, the game is enjoyable to Star Wars fans. Especially people who got involved during the original era will get a kick out of the focus on the empire over the clones. Interesting characters and satisfying storyline make it worth at least one romp at a good discount. The tech is a thing behold when it doesn’t bug itself out too much. The same goes for the visuals; while a little dated, they use the source material in a dignified and well adapted manner for a more brutal game. This media project paid off my opinion. Give it a go if you like Star Wars.",
            "review_score": "1"
        },
        {
            "review_text": "the intro level is the best because you basically commit Wookie genocide as Darth Vader",
            "review_score": "1"
        },
        {
            "review_text": "The community is hard as hell on this game. I'm not really a starwars fan (more of a star trek fan) so i could give 2 sqates for the story. I am on the other hand a big beat em up fan, so im easily pleased if certain criteria that i believe is common in the beat-em up genre is met.    I'll honestly say this game feels slow as ♥♥♥♥ locked at 30fps, to a point where it virtually feels a bit unplayable and more of a chore just playing it. One of my main reasons for not continuing to play the game was because of how slow it felt. till someone told me i could fully unlocked the game and get 60fps  After doing so man how this game felt so much improved. At heart one can clearly see this game was a rip straight off of the consoles. I'll be quick to say the menus are downright dated to the point of disgust. Menus surly doesn't scale to resolutions, thats for sure.   game is worth it, as long as you can deal with the small janks.",
            "review_score": "1"
        },
        {
            "review_text": "Galen Marek, the Starkiller, the most powerfull jedi ever seen. An excelent story, perfect background from the series, completing one of the most interesting periods on the Star Wars saga, the rise of Vader and his young apprentice. You'll feel free to explore everything The Force has to offer to you, strongly recommended to any Star Wars fan. Perfect game, one of my favorites, the only complain possible is its lenght, a little short for some.",
            "review_score": "1"
        },
        {
            "review_text": "The game play is very hack and slash style, with the good old classic lightsaber action and with a drop of force action too, the combat is very exciting and pack with all sorts of fancy attacks and duels. Part of your force powers includes the use of electric shocking your enemies too; this can be extremely pleasing to do on large groups of Stormtroopers. The combo system with the lightsabre is easy to get a grip of, and you can soon be showing off some crazy attacks, that look simply awesome. The game does have quite a lot of QTE’s throughout, these normally occur at the end of a regular fight, allowing a more cinematic dramatic end to a fight, normally I am not a fan of QTEs, but these are done in a way which allow you to enjoy what is happening on the screen whilst also testing your speed and awareness of what is going on.  The game its old but its nice and of course im a Star Wars fan so i recomend to all my friends :D",
            "review_score": "1"
        },
        {
            "review_text": "Pretty badass Star Wars game. Trust me, there are no Ewoks or Jar Jar Binks here. You can throw Rebel scum or anybody else around like ragdolls. It's like Devil May Cry with a Star Wars flavor.   The game serves to bridge the ~20 year gap between Episodes III and IV. The game has some flaws (capped 30 fps and some audio bugs) but it's still pretty fun. It's no KotOR or Battlefront II, but Force Unleashed is a decent game.",
            "review_score": "1"
        },
        {
            "review_text": "EDIT: After re-installing the game, it does in fact work now. A little buggy here and there but still playable on Windows 10 without compatibility mode turned on.  This game does't support Windows 10. Be warned:  ''There was a problem finding or creating one of the game's folders. Please contact Aspyr customer support.''  I received this error while trying to launch this game on my Windows 10 PC. I tried switching the .exe launch file to a compatibility mode, but the problem still persists. No knowns solutions as of Sept 2016.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, both fun and challenging",
            "review_score": "1"
        },
        {
            "review_text": "I bought it cause i heard you could throw people into stuff using the force        needless to say i was not dissapointed",
            "review_score": "1"
        },
        {
            "review_text": " Do not  buy this game unless you like all the bad things about the console gaming.  Unresponsive controls and battle - check. God damn it, even such old title as JK:JO had much more fluid sword fights. The lightsaber feels nothing like it should (light and fast, as the 'blade' is weghtless). Not to mention the ridiculousness of  dozens  slices to kill a usual enemy. Come on, it's a lightsaber, not a stunbaton.  Stupid camera angles - check. Why? It's nowhere near convenient. Damn you, consoles, you make these angles acceptable within general audience. Console fans, how can you play with such angles?  The absense of video options - check. Lava that looks like ♥♥♥♥♥. Visual and physical holes in the textures.  Horribly designed menu - check. Everything about this game is just not good.  To hell with this game. It's just awful, it's not fun at all. It's a console miscarriage of a game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is honestly very fun and is a must for Star Wars and videogame fans. Good gameplay, but very short. It was also a port from consoles and the controls can be weird because of this. It is very fun and I recommend it but I would buy it on sale since you can't play it for very long.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to be a Jedi knight or a Sith Lord? Have dominion over the force and use it to crush your enemies or unite your allies? Then this might be the game for you  This game was tremendous amounts of fun. I am biased because I like Star Wars but still, with a ton of force powers and duel lightsabers, this game was just fantastic. Even from the beginning you feel like a one man army, ripping ships from the sky and hurling them at anyone who stands in your way. The power trip you get from literally cutting your way through a horde of bad guys is something to behold.  The setting is wonderful, obviously, as its Star Wars. The levels take place on many different planets and starships leading to a reasonable verity of settings and environmental challenges. The enemy design is fantastic and varied; from Wookies to Tie Fighters you battle them all. The game is not the best looking but it still holds up to this day as rather pretty.   The characters and story were both very engrossing and I was compelled to see what happened to everyone and how it would play out in the end. It even adds some depth to the original movies, showing what goes on behind the scenes and adds to the feel of a living universe.  There were a few issues however that hampered my enjoyment. This is not a good port at all. The controls can feel clunky and the menu operation is a pain. There were a few glitches, not so many that they spoil anything but enough to notice. There was one section that was almost impossible with the mouse and I had to look it up, it was really obvious once I found the answer but the game doesn’t do a very good job of explaining.  I would recommend this game to Star wars fans and haters alike. Its super fun and a great time. Even at full price you will get something out of it.  Have fun ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Old game by now, not so pretty by today standards. Gameplay is quite OK albeit it's repetitive and frustrating here and there. Game is basically a third person action adventure with lightsaber. It's as generic as it gets, but it has one pro that takes it above average and that's the Star Wars licence. So...  Pros: - it's Star Wars with all the good stuff (Vader, AT-ST, Rancor, ... royal guards, Emperor ^^ ) - interesting story - character powers and upgrades (lightning strike FTW) - some Boss battles are rly fun - physics mby, but its bad for what we are used today  Cons: - some enemies are block ♥♥♥♥♥s - stun chains, like rly you can just go from 100 to 0% health and you don't get any interrupt - confusing level design - some Boss battles are just ... frustrating - technical issues (missing sound effects in last 3 levels, there is a fix for that)  If you are not SW fan don't bother, otherwise consider.",
            "review_score": "1"
        },
        {
            "review_text": "An over the top TPS game taking place in the Star Wars universe. Some of the force powers you have are so strong that you can take down AT&amp;Ts and later on a star destroyer, too. You do, literally, unleash the force in this game to its full potential. This also means that the focus is on the action not story telling so you may find this game disappointing if one of your favourite SW games is the Knights of The Old Republic or another RPG taking place in the same universe.  Unfortunately, the game is horribly optimised. You install 25 gigabytes on your hard drive. Today this size is common but this is a 5-year old game. Additionally, there can be bugs and glitches and just because the Ultimate Edition is offered for purchase for PC gamers it's not an excuse for not looking into its issues. Personally, I did not find the story particularly interesting. I got that it was about Vader's secret apprentice but there are so many games out there taking place in the era of the old trilogy as well as the new one that I was already fed up with these.  Anyway, this is not necessarily a bad game. It is an interesting concept and you really have some amazing power at your disposal. If this over the top approach does not deter you then I recommend this game but only the first one as the sequel was a very, very (and I mean very) short one and a complete disappointment.",
            "review_score": "1"
        },
        {
            "review_text": "Disclaimer: I am a massive Star Wars fan so I may be biased Star Wars: The Force Unleashed is not a polished game by any means. The framerate is locked at 30 FPS (although there is an unlocker which I strongly reccomend) and there are numerous texture issues such as pop-in and flickering. The keyboard controls aren't great either (I used a 360 controller). However these issues aside, the game is damn fun. You have multiple different force powers and tons of combos you can pull off as well. The story so far is fantastic and the characters have genuine feeling and it is very noticeable that the voice actors Lucasarts have hired are seasoned veterans in the voice acting industry. I would recommend this only to Star Wars fans or hardcore hack and slash fans and only those that own a controller, as that really is how this game is meant to be played.",
            "review_score": "1"
        },
        {
            "review_text": "+ great story + good voice actors  - terrible and slow menus - no enemy locking system (this is a console game after all), it makes killing enemies on platforms hard and frustrating and hard to use the electrocute skill efficiently - bad fighting mechanics - bad graphics for it's time - locked to 30 fps - not enough useful combos that are easy to use in combat so most of the time you just use the main X X X combo with one or two other combos  This is the worst Star Wars game I've played so far, I can't recommend this to anybody else but someone who is interested to see the story, luckily it's rather short game to complete (around 6h) so you don't have to waste too much game on such a bad game.",
            "review_score": "-1"
        },
        {
            "review_text": "I probably played through this game like 5 times when it came out on PS3 so playing it again after all these years was nostalgic. Pretty short and buggy but they are funny bugs and I'm willing to replay it and the dlc which I have not gotten around to play yet. Fun game I recommend it...besides the infamous star destroyer scene.",
            "review_score": "1"
        },
        {
            "review_text": "You: But you said you wouldn't come after them!  Darth Vader: I lied.  10/10 would get lied to again",
            "review_score": "1"
        },
        {
            "review_text": "Not a perfect port from console, but not a bad one either.",
            "review_score": "1"
        },
        {
            "review_text": "This is not a bad game. Just want to say that off the bat because I am gonna sound a bit negative here. This game has serious problems. Brain dead AI, rough boss fights, irritating level design, and ♥♥♥♥ poor menu navigation, with a loading screen in between each one, and the 30 fps frame lock, this game has a ton of problems that stop it from being great.  Now on to the good This game has genuinely beautiful graphics, and the star wars universe is realized in a fantastic way. From the Hoth levels in the DLC, to the acid and junk world of Raxus Prime, this game has a lot to offer. The character designs are stunning as well. I remember years ago when this game was coming out, seeing how they motion captured the actors for the characters, and it shows. In addition, there are a ton of DLC costumes that are awesome to screw around in, from playing as C3PO, to old sith lords. My favorite was the Sith Assassin armor, with the black lightsaber.  All in all, get this game on sale if you can, because it is worth a playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "The greatest Star Wars game next to Jedi Outcast. A ton of fun to play and the Ultimate Sith Edition adds a lot of cools stuff. It is worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Missed out on this game when it was released way back. Lot's of hype. 'Amazing story.' 'Better than the prequels.' Etc.   Don't believe the hype. I had better fun with force powers playing Jedi Knight 2 more than 10 years ago. The highly praised story is cack too. Vader's apprentice ffs. The gameplay is repetitive, glitchy, feels like a bad console based movie tie-in from the 90s. This is not the Star Wars game you are looking for.   Now EA hold the reigns I hope they have the sense to let Dice or someone make Dark Forces 3. Not hopeful tbh.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun. I especially like being able to slice and dice my way through the bonus missions as C-3PO. But if there's the option to play as him, I have to ask: No Jar Jar Binks Skin? Come on! It would be so cool to play as Darth Jar Jar now that the theroy of him being a sith is going around.  regardless, fun game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! Never had any single issue wit it. Unlocked FPS to 60 and plays like a champ. Graphics are beautiful for the time. Nice animations. Good voice acting. ETC. Jedi Academy was my favorite Star Wars game for years, now it's this one. I still don't get all those people complaining that they cannot launch this game. I think it's mostly new Win 10 user who are not enough tech savvy to do a few tweaks. The game it self runs right out of the box on my cheap, second-hand component built all AMD PC.  May the Schwartz be with you!",
            "review_score": "1"
        },
        {
            "review_text": "A good hack and slash game, Star Wars The Force Unleashed happens after Episode III before Episode IV. Some people think that it is not lore while some others does, In my opinion, yes, it's just that they could have done it better but it's still a good game to play for a first time and maybe a second time, there are duels but unfortunately, it can't be done against the AI. I'd suggest you get it while it's on sale or while getting the Star Wars Complete Pack.  6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "One of, if not the best Star Wars games around. It massively improves on aspects where the first one fell short, such as force grip and camera issues. The graphics are incredible, and the storyline is gripping, if a little short. I personally did not notice the shortness of the game too much, as it is filled with challenges to help make it feel longer. Overall, a very good game. Must have for any Star Wars fan.",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly fun game. Some visual effects problems but apart from that 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Combat and the quality of port to PC are meh but the story is epic! Must have for every Star Wars fan.",
            "review_score": "1"
        },
        {
            "review_text": "WoW, this game can be a lot of fun with it's distinctive locations BUT @ the same time this game brings U a difficulty through your 1st play through that makes me shake my head &amp; say 'ur f'n crazy' to make it this hard. - [update] 'But' when you run through the game a 2nd time it is Much easier &amp; more satifying since you keep your previous skills/items.  Some items to get are in places that seem unattainable, maybe i am getting old or just not skilled enuff, but it's a headache non the less. - [update] Going through the training tutorials will help you a lot, sadly i forgot about them &amp; ONLY completed them after my 1st play through.  - [update] I have had ONLY 4 crashes after 53hrs of play while using the 60 fps.exe fix. There are 2 other issues with the 60 fps fix 1. Objects you control with force powers float upwards to the sky. 2. There is a test in ' Jedi Temple ' that i can't do when using the fix cause it's impossible to move the sphere horizontal without messing up.I will try the default exe &amp; see if that helps.  Another oversight was Lack of info on mission ojectives scream 'WTF' WHO are these 'things' &amp; HOW do i get/do them. Starting level of the 'death star' had me getting killed over N over N over like as if this was a dark souls version of force unleashed.The difficulty for this level was by Far Most difficult for me, absolutely INSANE &amp; i am not played @ the highest difficulty either. While in tight quarters, 80+% of the time the cam's viewing angle &amp; the lack of sight is going to get you killed.There are plenty of other games with this problem.  There is LOTS of Fun factor in this game, seems they dropped the ball in a few key areas like the last few maps with sound issues.  Lastly, this games combat is absolutely a joy to play once you acquire skills/weapon goodies &amp; get used to it :) I give the game a 7.5/10 since it has me playing out fantasies of my childhood in adult yrs without any regret............if they balanced the difficulty &amp; fixed the sound issues i'd be willing to give it a 8.5/10.  P.S: There are 3 DLC's for this game once you finish but have to start a new 1 to see them appear.  Also these dlc's are very short &amp; wish they were atleast 3x longer. REALLY like this game.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I loved this game at one point, and I wanted to still love it, but it's so BROKEN!  Camera gets stuck in crappy area battle angles even after the boss battles and leaves me two inches in 3rd person from my character's face.  Bosses Disappear randomly in the middle of battle and don't even reappear after a bathroom break and cooking dinner...the long way, like with time and care. So a LONG TIME, I have yet to have a boss re-pop up for me, which leaves me heart broken because I love Star Wars and if they took concepts of this game and put it into one of the new star wars movies, like super profound force abilites, I'd be happy with that, but this GAME gets a thumbs down for me, honestly I'm sorry, I love it for being it, but I truly judge it on being so broken that is has broken my heart.  *Feels sad I bought the star wars collecton pack, hope The Force Unleashed 2 isn't as broken* Also anyone please leave comments on which game from the Star Wars Collection I should play next! Can;t wait to play them all, so hard to choose!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is nearly completely unplayable due to bad porting from a console. If you get an x-box controller for your pc then it is playable, until the game loses it's audio during key battle sequences ruining the game all together. Not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "I played this game on my Brother's XBOX in 2010, and honestly I loved it. This game singlehandily kicked me into a 5 month long star wars binge. So when I saw it in a humble bundle with so many other great games I spent my $13 without any second thoughts.  Unfortunatley this game was just not made for PC its controls are so slow and horrible and I couldn't even keep going past the first level. I've been told using a controller helps but I have not yet tried myself. If you have a console I would fully recommend buying the game on that, but don't bother with the PC version",
            "review_score": "-1"
        },
        {
            "review_text": "Nope. First of all you have to download a patch/mod or whatever to get it to run at 60fps, that's kind of annoying but not a gamebreaker. In fact other than the fact that it's just not aged well there isn't really one. Supposedly there are sound and crashing issues somewhat in abundance but I didn't get any of those in my short time playing it. Instead I got to the second level and had to raise a platform that simply wouldn't go high enough for me to jump and dash over to the other side. It either kept getting stuck or they just expect you to make that jump on wishful thinking and childhood dreams. It was at that point I just gave up. I completed it once yonks ago and loved it, playing it now it's just not fun. Certainly not £15 worth of fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Have fun, kill ♥♥♥♥. Be a badass sith.",
            "review_score": "1"
        },
        {
            "review_text": "The controls, the movement of your character, the buggy graphics, the crashes, everything in this game sucks. I got rid of the crashes and this game still sucks. First of all, forget about your powers, you only need your force lighting and your saber, because this is what you need to stun the annoying enemies and then slay them. Now, the annoying enemies on this game is ALL OF THEM, if you ever played god of war or darksiders you know that some enemies are annoying and some are okay. In this game, even the weakest of them are a ♥♥♥♥in cancer to kill. Let's get the basic trooper as exemple. If he starts shooting and walking backwards, your X/Square slashes won't hit them, you need to dash and slash, every single enemy. Also, your combo locks you in place for the duration and even 2 seconds after, in this time, you are open to melee enemies who you dive at you, and unleash a combo that takes up to 75% of your health on 2 seconds. In this game, you mostly rely on running around and zapping people with shock. Also, bosses have attacks that are instantenous and take 50% of your health away. Sometimes the second boss would spray me with force attacks that would insta kill me, each of them taking half my health away.  All things considered, i played on hard mode, idk if that's how the game sucks and normal mode is okay, but you are going to play, DON'T play on hard mode, i do that because i am stupid, don't do that.  Honorable mentions:  -Sometimes the sounds bug, and the music go away, i even got youtube videos to start going all static while this game was open. -You know those terrains that you are not supposed to walk on and if you do, your character will helplessly slide out of it? Well, this game has a lot of them even on common roads etc, and most of them will slide you to insta-death. -The jump and slide on this game are terrible, and not only because the control sucks, but how they are displayed among the scenery, you really don't feel like one of those jedis that does an unecessary flip on the air just to jump a simple ledge(just like the hero of LazyTown, if you never watched Star Wars). One of the amazing things of Jedis is their parkour abilities, and this guy, at least on gameplays(cutscenes he moves like a ninja), sucks on movement. -You can't walk and defend on this game, compared to the second one, where you can. This will lead you to never ever defend(ever).",
            "review_score": "-1"
        },
        {
            "review_text": "Fun, but buggy as ♥♥♥♥. Low quality overall.",
            "review_score": "-1"
        },
        {
            "review_text": "Stardestroyer mission ♥♥♥♥ing stupid",
            "review_score": "-1"
        },
        {
            "review_text": "The scripting broke on several occasions resulting in me being stuck in a box with invisible walls in my path",
            "review_score": "-1"
        },
        {
            "review_text": "If you're a star wars fan, yes it's fun",
            "review_score": "1"
        },
        {
            "review_text": "Despite all of the negative things I've heard about this game, i.e. Repetative, Terrible Controls etc. I love this game! The Force Powers are fidgety, but you don't have to use the Force Grip. Use your lightsaber, Force Push, Sith Lightning and the host of other attacks possible! Don't make a game seem bad because of some glitches! It's really fun, and the visuals in the game are some of the best I've seen in a Video game!",
            "review_score": "1"
        },
        {
            "review_text": "Year 2015 , Cannot save the game for unknown reasons .You have to start from the start every time you launch the game. Dont waste any money on this.",
            "review_score": "-1"
        },
        {
            "review_text": "Everything is fine except the boss battles put you in a ♥♥♥♥♥♥ third person fixed camera view and that makes it practically impossible to fight.",
            "review_score": "-1"
        },
        {
            "review_text": "Play the second one, this one is horrible.",
            "review_score": "-1"
        },
        {
            "review_text": "6/10 game. Barely playable, the creative design department did a very great job recreating that Star Wars feel unfortunately the game itself suffers from a constantly buggy experience with music cutting and sound effects cutting in and out. Story itself was nothing special, the DLC with the alternate universe scenarios are fantastic - had a lot of fun killing Luke Skywalker and change to course of the universe.",
            "review_score": "-1"
        },
        {
            "review_text": "Force Unleashed is defiantly dated, but has an interesting story with some great uses of the force. You should pick up this game if it is on sale.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Okay so despite being one of the worst PC ports I've played, TFU is one of the best Star Wars game I've played. The story is deep and conflicting and the Force is raw and devastating. The locations are varied and you feel progressively stronger and more adept as the game progresses.   Great game, frustratingly bad port",
            "review_score": "1"
        },
        {
            "review_text": "I want to like this game. It has so much potential. And sometimes when you're playing it there are moments that are really, really fun. When you're jumping from Stromtrooper to Stormtrooper, your lightsaber combos are flowing beautifully, you're force throws are on point, you feel really powerful. The close you can ever feel to being a real Jedi.  But unfortunately those moments are too far between. What could be epic gameplay is, more often than not, hampered by shotty targeting, bad camera angles, weird boss fights that block everything so you can't really use any good combos or slick moves, annoying sequences where you will get hit by an attack that knocks you down, and it takes your character so long to stand back up that you're hit by another one immediately, and this repeats until you die while you scream at your monitor. Seriously for being a badass Jedi, this guy stands up at a speed that would make my grandpa laugh. For every time you epicly force grab something and throw it at an enemy, there are three times where you force grab something and for some reason throw it in a completely random direction. Or when you try and force lightning someone, and for some reason you force lightning the air right beside them while they stand there and look at you like you're crazy.  The game is difficult. But not in a fun way. I like a game that is a challenge. If I make a mistake, punish me (didn't realize how dirty that sounded until I said it out loud). But this game isn't difficult in that way. It's difficult in a lot of the enemies have slow, repetitive unblockable attacks that knock you down over and over and over again. It's difficult where the boss just randomly becomes invincible/blocks everything you have so you just have to wait for him to let you start attacking again. Really any lightsaber duel feels less like a duel and more like you using force lightning and just running away because that's significantly more effective than actually using your lightsaber due to the enemy blocking all your attacks and all of his attacks being unblockable. It has entirely too many jumping puzzles for a game with a bad camera and an erratic, unreliable double jump.  Little things like that that should have never made it through any kind of QA testing.  The DNA of a great game is there. But it needed another 6 months of polishing before release, at least. This is on the top of my 'games that didn't live up to their immense potential' list.  And that's not even counting how bad of a PC port this is. Straight port. 30fps. No extra graphic enhancements. Nothing to take advantage of being on a PC. Just seems lazy.  I played the game all the way through because of those brief moments of fun. But I would say I only really enjoyed myself about %30 of the time, the other %70 I was just more annoyed and frustrated than anything else.",
            "review_score": "-1"
        },
        {
            "review_text": "Dayum it does terrible when i bought it i thought it would go fine but it was crap on mission 1 for some resson the background was weird and going laggy pretty much i bought something unuseful",
            "review_score": "-1"
        },
        {
            "review_text": "  This game is unplayable. The Worst steam purchase I ever made. I will not recommend this until it is properly fixed for pc, even the ds version is better than this buggy mess.",
            "review_score": "-1"
        },
        {
            "review_text": "Star Wars game that is (debatably) cannon. Many of the reviews are complaining about the controls or that it was glitchy-- None of which were super bad, at least for my computer. There are definately flaws, but this game is actually pretty old, made in 2008. It has an interesting story and fun gameplay, even a new soundtrack mixed with Star Wars' classic music. I had a lot more fun with it than I did Star Wars: Knights of the Old Republic, although both were great ;)",
            "review_score": "1"
        },
        {
            "review_text": "It should be known that I played this game vigorously on Xbox 360, so in terms of storyline, cannon, and other non-machine related topics, I have at least 300 hours of experience in this title.  Star Wars The Force Unleashed, is possibly one of the most entertaining Star Wars games I've ever had the pleasure of playing! It is not a game fitting for the avid lightsaber fight loving Jedi/Sith personality, as this game's name; 'the force unleashed', is quite literal. You get 'way' more options in this game in terms of using the force, than you do with lightsaber combat...Frankly, lightsaber combat in this game is more of a 'last resort' deal, or if the enemies are so weak/few that it honestly would take longer to beat them with the force.  In terms of gameplay, however, the game is extremely entertaining, and thanks to the game's commendable difficulty curve, from Apprentice to Sith Master(last one has to be unlocked), the game sports an absolute TON of replayability, from alternative endings, to new lightsaber colors, to new unlockable costumes and entirely new characters, the game is one of those gems which has you coming back for more!  In terms of lore, the Force Unleashed opens a new, previously unexplained gap between two movies, I believe its number II and III(not the newer videos). It tells the story of a rogue Sith apprentice to Darth Vader, codenamed simply as Starkiller, who works under the strict and vicicous tutelage of the Dark Lord himself, effectively hunting down exiled Jedi. However, as the story presses on, the young Sith apprentice begins, for varying reasons, to feel less secure in his apprenticeship to Lord Vader, and his life takes a complete U-turn when he meets his new ship pilot, Juno. The story is believable, as it fills in a lore gap to explain what happened in the space between movie II and III.  Graphics wise, this game is on par with modern video games, and takes quite a bit of effort on your GPUs part to keep up the Framerate counter, however, it can easily be resolved by lowering the resolution, and unchecking the High detail box prior to starting the game, which pretty much eliminates framerate lag(Unless your computer is a potato with copper wires in it)  Do I think this game, and its sequel, are worth adding to your Star Wars game collection? Without a doubt. This game's shere popularity, and Lore accuracy, makes it a 'must play' in order to get insight into a truly intense and entertaining part of the untold-in-the-movies story!",
            "review_score": "1"
        },
        {
            "review_text": "great game so many fun memory's.",
            "review_score": "1"
        },
        {
            "review_text": "brings me back to the dark side #loveit",
            "review_score": "1"
        },
        {
            "review_text": "This is so close to being a good game. However, controls are not fast enough to respond and it kills any fast-paced saber action that the game might have.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this game for the XBox, and it was hands down the best Star Wars game I have ever played. They really made the Force a power to be reckoned with.  HOWEVER, the port from XBox to PC was not good. There is a pause every time you go into a menu, the menu navigation is clumsy, and they did not do a good job converting the dual joysticks to keyboard/mouse. On the XBox, when you pick someone up with the Force, you have full 3D control on moving/throwing them; you still have this on the PC, but very nonintuitively.  Amazing game on the XBox, not so much on the PC. If you can play with a controller, it might be better.",
            "review_score": "-1"
        },
        {
            "review_text": "Force is Clunky and camera angles are SO BAD in boss fights. Only buy if you have played a game with bad camera angles before and didnt hate the game.",
            "review_score": "-1"
        },
        {
            "review_text": "So, like some people I got this from the Humble Bundle where this was was a tier 3. Now I though that for some reason that this would be better than the ps3 version which I had (and though it was boring). Little did I know that even with unofficial files to help make the game more playable, the game is still broken.  Most of you probably didn't have the same issue I had but I'm gonna say what issues I had. 1. When the game starts up, on the battle of Kashyyk, the audio started off EXTREMELY off balance. You could barely hear either voices or music thanks to the sound effects and this was all on normal settings in the audio option 2. When facing the jedi as vader, the camera is locked away from where the battle suppose to be, making it difficult to actually see what's happening (I beat him, he's not ment to be hard anyways) 3. This is more of the issue from the fps unlocker but some reason you'd constantly levetate anything upwards, making the use of the force annoying 4. The break on the cammel's back, When fighting the jedi on the space station, the audio gave up and just died. Literally it gave up and no audio was coming out. I though there was something wrong with my hardware but it turns out it wasn't cause a cutscene to interrupt the boss fight played and there were sound.  Yea, I rage quit afte that but after seeing this kind of problem, I should have known that playing this on the pc would be a bad idea to the point I'm pretty scared to see how the 2nd game (Force Unleashed II) would perform if the first game had this slew of problems.  I really don't recommend this game to anyone unless you are covered in good luck to not run into this landfill of bugs.",
            "review_score": "-1"
        },
        {
            "review_text": "Cons: Rather bland gameplay despite the 'Combo System'. The check point system is rubbish and down right infuriating at times. Speaking of infuriating Purge Troopers have this wonderful ability to fire missiles at you from across the room that knock you down and when you do get back on your feet its just in time for another missile. There is also a fair amount of lag between the controller and the character that leads to some rather rough moments fighting muiltiple enemy types. All and all it feels rushed and not quite at the level of polish I believe the developers would have been happy with.  Pros:  There are times when everything falls together and you do feel like a badass sith. Story.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm not a huge fan of the yes/no system. Can this game be fun? Yes. Will it be frustrating? YES. Would you be missing out if you never played it? Probably not.  There's something enjoyable about this game and getting to use force powers in an excessive way. I enjoyed it on my Wii and I'm enjoying it now.  However, this game is not a very well made game. Level design is not good, enemies are either too easy or stunlock you until you die, checkpoints are not close enough together and you will ALWAYS be fighting the camera. I probably wouldn't play this without a USB gamepad. The controls are not tight at all and it's hard to get your character to do what you want him to do. You will fall off of edges a lot because the platforming is terrible. There are QTEs at the end of boss fights.  Personally, this game feels like it has a spectacle-fighter sort of vibe. Except, it lacks almost everything that makes a spectacle fighter good. If done correctly, this game could have been amazing.   The graphics are pretty good (aside from the cutscenes). But honestly, nothing dates this game more than its terrible control and camera issues.  Overall, I think the game is fun, despite its shortcomings. I would probably only get this game at a heavily discounted price though. This is a bargin-bin game (which is where I bought my Wii version). It is good fun for that kind of game. But I find myself setting the game down at least once every 30 minutes because of how frustrating it can be. Unlike something like Dark Souls, this game controls so sloppily that you do not blame yourself, you blame this poorly made game.",
            "review_score": "-1"
        },
        {
            "review_text": "Seems like it was a very good game, but it's one of the worst pc ports I've ever seen. you navigate the menus with [] and backspace. no i'm not ♥♥♥♥ing kidding. also kazdan paratus. uninstalling.",
            "review_score": "-1"
        },
        {
            "review_text": "I remembered playing the demo of this game on the Xbox 360 years ago and having a favorable experience. Game is on sale so why not, bad idea. This is NOT that game. It is not a bad game per say if you have never played another action game and you started playing video games in 1998 or so... But by today's standards it is awful. The first thing you will notice after you get to say the third or fourth level is that the camera gets caught behind things. Then the play control, it is out of this world awful. You do a button combination and it delays for a second. Your character will take a while to set up his moves, but thankfully the computer AI is super fast. Trying to levitate a rock to throw at a character, well you better have at least a second before.... too late the computer can instantly hurl rocks, lasers, or rockets. Which leads me to ... blocking. You really can only block when you know way in advance you want to do it, other than that it is pointless. But when you are getting pumelled don't worry the game developers thought enough to allow you to keep getting attacked till you do a very slow get back up.  This game is crap on the play control and graphics and this is 2015. There are ton of other action games that put this game to shame. One of the few games I will probably finish because the story is a little intriguing but the gameplay is godawful.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has so many issues. Buttons wont work half the time and sometimes my character will stop moving. I cant look at how to do combos because of course the button doesnt work. I have no idea what made the developers think that they could release a game with this many problems. And dont even get me started on the Mission where you have to pull the starship into the ground. I got so sick of aligning the ship so I could pull it down just when the next wave of tie fighters came. And then eventually it stopped guiding my alignment and it said that I was always wrong no matter what I did. In short, this game does have a lot of potential. It just seems like it was rushed and thing were not thought through very well at all.",
            "review_score": "-1"
        },
        {
            "review_text": "Combat system has one hell of a learning curve. This isn't some button masher where you can just swing your lightsaber to victory. You need to think strategically about each move you make.   Enemies can take a nasty chunk of you health away if you aren't playing correctly, and it's just a struggle until you actually start using the good force which aren't all that intuitive nor are they always reliable. Force push controls sometimes fly objects off in directions you didn't want, and the camera angles are just bad, especially boss fights.   I would say that in this game, there wasn't a single boss fight I enjoyed. Every one of them was just annoying. As enemies can begin to block your attacks mid combo but you can't do the same to them....so if they hit you once they may as hit you 2-4 more times for a massive lost in health due to the ragdoll mechanics.   I found myself stunned in ragdoll mode many many times due to be hit by an offscreen projectile...remember those camera angles I mentioned earlier?  Story: 8/10 Combat: 3/10 (camera angles, ragdoll physics, overpowered AI, and annoying stuns, just kills the combat system)   I'd rate this game 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game could be so much better if the controls weren't garbage. The concept is inventive and the story is pretty good but my god it's like controlling a drunk person. Super clunky and I always find myself shooting lightning 15 feet to the right of my target.",
            "review_score": "-1"
        },
        {
            "review_text": "The story of this game is spectacular... And thats about it. You find yourself doing the same missions just on different planets and the gameplay itself, horrific at best. I give this game a D-",
            "review_score": "-1"
        },
        {
            "review_text": "I really liked this game when I was younger; I had the PS2 version and I played the PS3 version a couple of times at friends' houses. The game itself is really fun: you play as an incredibly powerful force user, and the plot and characters, while not the best, are good enough to hold the gamplay together into a cohesive, fun game. But shame, because it's ported so poorly that it is nigh unplayable. The background has some wierd mirroring kaleidscope effect that prevents you from seeing anything further than a few paces away from you. I tried playing anyway, but some segments require that you deal with far away foes, and those parts cannot be done. Don't buy this game, it can't be played in its current state, and it's very unlikley this issue will ever be fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm not giving this a non-recommendation because of the controls or any of that because I'm totally fine with that, I'm not recommending this game because there is literally no replay value which is really important in short games like this to me. But if that doesn't bother you by all means get this game because it truly is really fun, it doesn't have horrid controls, the targeting is kinda annoying sometimes but mostly it is fine, but the game lacks a replay value.",
            "review_score": "-1"
        },
        {
            "review_text": "This version of the game has far to many glitches and bugs to be enjoyed to its truly fullest capability. If you wanna play it, just buy the Xbox or PS Version of the game, far less bugs and a hell of a lot less crashes.",
            "review_score": "-1"
        },
        {
            "review_text": "Game play was ♥♥♥♥ unbalenced and it crashed, 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "Poor port, 30fps locked and clunky controls, looks okay but with horrible pop in.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was actualy quite pleasantly suprising, because when i first purchased it i read a lot of reviews saying that, 'it's one of the worse star wars game ever made', but they couldn't be more wrong, the story line is very gripping, the voice acting is average, the gameplay is fun yet easy to get into at first (gets a lot harder later on in the game and as u put the difficulty up), boss battles are soo pleasing to Watch because light sabre fighting in this game is very pleasant and is as smooth and looks as real as it did in the films, How Ever Killing Stormtroopers (which u will, a lot as their your main enemy in the game) will get annoying as you need to hit them with your lightsabre/force far too many times and ruins the releasm and fun for me. anyway the cut scenes are fairly well done with really good character manerisms, and is very beleivable, how ever my only problenms with the game re the glitches but if you can overcome the glitches you will verry much enjoy this Game, definately a Best Buy for any Star Wars Fan!!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those rare times I would recommend a console version instead of the pc version. Even though it is cheap. The game is good, but the pc-version suffers from a lot of issues and I have a very good rig so it's not my pc.  My big 3 issues: The graphic options are very, very limited. Only resultion and High quality textures are available to tinker with. Stuttering framerate and worst drawdistance I've encountered in a lastgen game. Sound giving up completly during gameplay and menues.",
            "review_score": "-1"
        },
        {
            "review_text": "Would like to state just a few things about this game. If you don't have godlike reflexes and can active abilities or combos in less than half a second this game is not for you. There is no story behind this game whatsoever. The graphics aged horribly.    - Boss fights camera angle is absolutely absurd. You may as well buy a lottery ticket if you happen to get the game to target the boss.   - Targeting as a whole in this game is just ridiculous. There is no way to actually focus on something, the game just sort of picks what it wants you to fight at any given time. Sometimes the game is even helpful enough to let you use Force Lightning on the rubble instead of the enemy standing right in front of you.  Game was better on the PS3, recommend buying it there. PC version just doesn't work for the user makes it more frustrating than fun. ",
            "review_score": "-1"
        },
        {
            "review_text": "If you like Star Wars this game is for you. Has alot of action and lore, related to Darth Vader's Secret Apprentice, Starkiller.  It's a Hack and Slash, wich means, mash your buttons to victory!   But really, you do have to dodge occasionally, plus, you get to be a bad ♥♥♥ using the Force.  I have to say, I liked it. Was entertaining plus you actually *can* make choices. Wich is something you don't see everyday with Hack and Slashes.  All in all, it's a good game, although I advise getting this and the second one at the same time. You'll just want more and more. *.*  Have fun!",
            "review_score": "1"
        },
        {
            "review_text": "This is a terrible port. It feels like the developers put no love into this game now. This is extremly broken.",
            "review_score": "-1"
        },
        {
            "review_text": "A lot of fun playing around with and combining the force powers. The DLC doesn't add anything.",
            "review_score": "1"
        },
        {
            "review_text": "Some great cutscene production value for the time, but the controls are absolutely unforgivable. I felt like i was back in the early 90s were games were rarely completable and player frustration seemed to be the designers main goal. NO GIVE IT A MISS. terrible",
            "review_score": "-1"
        },
        {
            "review_text": "It'd be a pretty fun game if it worked correctly. Unfortunately it doesn't. One of my most regrettable purchases, and so far as I know there is no fix for it. You can get about halfway before it gets to be completely unplayable...",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, too bad The Force Unleashed 2 sucks more ♥♥♥♥ than a gay guy at a gay orgy.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly this game has so much potential, but seems to trip over its own feet all the time. I won't go into a long list. I'm sure that's been done before a lot for this game. I'll just point out my main gripe: the idiotic decision to make boss fights have a fixed camera angle. Why in the flying F the devs thought this was a good idea is beyond me. It's bad enough that I will not continue playing the game. It's too frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "Well this is my first 'NO' review. Since the beginning the game was a 6.5 for me... but i finish the game 100% so i could give an objective review.  Playtime:16hours on 'hard' (including the 3 campaigns of the sith edition, ~1h each).  First thing you will see in this game is that this will consume pretty 30GB in your disc (SWU 2 will consume just 10)... One of the most annoying issues of the game is that you can't skip some cut scenes... but when you want to take an screenshot (or even push the volume key)... 'BANG' the cut scene is gone... so... WTF? (i'm a screenshot fan so this is a 'turn down').  Graphics are amazing, and have a nice story... but i'll recommend this game only to SW fans... if you are looking for a good and cool hack&amp;slash game, just keep looking and save 20 bucks. game is too easy, you are more focus in the secrets than the enemies and 'sith edition' doesn't have anything special more than those 20GB extra in your disc (3 campaigns of 50min each? come on).  So why 6.5? here we go:   -Graphics 10/10 (graphics are awesome, i had fun taking in-game screenshots) -Music 7/10 (music of all sw games... is that good? yes, but makes a hack&amp;slash boring sometimes) -History 9/10 (to bad is not cannon) -Controls 10/10 (respond fine, but have to separate this from 'combos/mobility') -AI 4/10(AI sucks like hell, enemies can stand in front of you without doing anything... on hard difficulty) -Difficulty 4/10 (extremely easy, on hard difficulty. enemies are stupid and main character is too OP) -Camera 7/10 (can get stuck a few times, but nothing to be worry) -Combos/Mobility 4/10 (even if controls are good, combos kinda sucks and mobility can be a pain in the ♥♥♥, your character can just layout in the ground while he's being shoot) -Menu 6/10 (simple that's good... but mediocre...) -Re playability 4/10 (the game is too easy, there's nothing special that lead you to play it again)  Total: 6.5",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible controls, surplus of quicktime evvents, terrible PC port (every menu option has a loading screen..).  You do not want to buy this game. Buy Jedi Knight 2.  If you got this game in the humble bundle, play Jedi knight 2.",
            "review_score": "-1"
        },
        {
            "review_text": "Sadly I have to score give this game a negative review. It does not work for me, to be exact the game lags so much that it is nearly unplayable. This problem could easily be just me, and I have tried tons of methods to fix it, none of them working. I do own the Ps2 version of the game, it is fun and a good game.",
            "review_score": "-1"
        },
        {
            "review_text": "Game isn't even playable on pc.",
            "review_score": "-1"
        },
        {
            "review_text": "Star Wars always needed a hack and slash game. Force Unleashed was the game we needed, and deserved, after a 5 year hiatus from Jedi Knight. Ignoring, of course, that it has no multiplayer. That's probably a good thing, though, considering how wonky and broken saber duels were in JK2 and 3.  Sam Witwer, the dude who voiced Darth Maul in Clone Wars and also Rebels, and also Crashdown from Battlestar Galactica 2003 (and unfortunately the protagonist in the upcoming PS4 zombie game), plays Galen Marek i.e Starkiller, Vader's secret apprentice. He finds Marek in the beginning of the game and raises him as his own, then uses him to apparently infiltrate/create the rebel alliance. TFU is kind of a Sith power fantasy where you go around beating the hell out of Jedi masters, falling in love with an imperial officer, and pulling Star Destroyers out of the atmosphere with your force powers. But it's awesome.  The combat in this game is unfortunately not as complex, or at least the moveset not as large as you would hope for after gems like Ninja Gaiden or games like God of War. You get your standard Force powers - crush, push, pull, mind trick, lightning, and you get to develop those skills by putting points in to them by earning points and by finding Holocrons, which also lets you make some sort-of-combos. You also find saber crystals throughout the game which change your saber color and change what passive effect the saber has when used. Combat eventually gets boring as with all games that have combat, but on the bright side you get to toss Stormtroopers around like toys, or kill those walking trash can droids.   Graphics, considering they are from 2008, are as good as you can expect from a console game that's 8 years old at this point. The PC port doesn't appear to have been given any special attention, though - even maxing out the graphics still shows that they used the same low-res textures for most of the game.  Unfortunately, as a GFWL game, this is one of many titles that didn't get the Steamworks treatment and never will. No achievements, no workshop, none of that. It also has a fair share of technical problems and I can't even get mine to work on Windows 10 properly, not to mention it would crash at random on Windows 7 when it had nothing to do with performance.  I'm sure it's overpriced right now, so I really wouldn't recommend buying it if it's anywhere over $10.",
            "review_score": "1"
        },
        {
            "review_text": "Do not purchase this game on a newer PC. It is incompatable with controllers and the screen will tear. Not recommended for PC, great for consoles though.",
            "review_score": "-1"
        },
        {
            "review_text": "I normally wouldn't have anything to say about this game, because the console games are awesome. VERY repetitive, but awesome. In this case though, do NOT buy this unless they fix the issue at the menu. I literally couldn't do anything on it, meaning no input from my keyboard or controller. I am a very big Star Wars fan, and this just makes me mad.",
            "review_score": "-1"
        },
        {
            "review_text": "I don’t know why a monumental franchise like Star Wars is so utterly incapable of producing even a mediocre 1st person game. They should be embarrassed to have the Star Wars name on it. The Force Unleashed is clunky, awkward, and hard to control. You have to be specifically aimed at a person to swing a lightsaber at them, and miss everyone else within three feet. The combo system that won’t allow you to move or activate another ability while the game finishes elaborate moves on dead bodies is frustrating. Combos from enemies are just as frustrating as you take your hands off the keyboard and mouse as you wait for them to finish as you’re unable to block/defend/move. The clunky menus are not interactive with a mouse but instead use the arrow keys and enter to make selections, backspace to get more info on an item, and the brackets ( [ &amp; ] ) to change pages.",
            "review_score": "-1"
        },
        {
            "review_text": "Well lemme put it simple if you have a badass computer i would still reccomend you keep the graphics on lowish. Its fun flinging troopers around and murdering Jedi while being hunted down by your own partner is crime proxy bla bla bla this game has no Happy ending On any DLC On any choice you make at the end its all Dark and depressing I  If you still have a xbox 360 i recommend you get on that  But this game has a rather depressing ending for everything  RIP General Rahmn Kota RIP Juno Eclipse RIP Galen Marek RIP Senater Bail Organa RIP Rebelion RIP Proxy  Rip Galaxy!  But my god this is a fun game i wish Galen Marek (StarKiller) Was on the new Starwars film he could kill Kylo Ren in a second he basically re-directed a star destroyer alone with just the force  P.S The second game is a money grab but still entertaining",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, but it's capped at 30 frames per second. :C",
            "review_score": "1"
        },
        {
            "review_text": "Ultimate Flying Wookiee Simulator  10/10 would blow furrballs in the air again.",
            "review_score": "1"
        },
        {
            "review_text": "this ame has so mny bugs and is just a horrible purchase",
            "review_score": "-1"
        },
        {
            "review_text": "Its the best SW-game which I play. Storyline, characters, graphic's... Its awesome game! 9,5/10",
            "review_score": "1"
        },
        {
            "review_text": "If you can play more than one hour without crash, then the force is with you. 10/10",
            "review_score": "-1"
        },
        {
            "review_text": "Worst SW game ever... Beautiful graphics, nice physics, all for frustrating arcade game. Dozens of combos, but in fight you use only one, over and over again. Boss fight = same combo, use few more times. Famous 'bring down the destroyer' part - the most frustrating and repeatable fight ever... wave after wave of TIEs (each destroyed the same way) and between them player has to try to force destroyer to point at given pixel on screen. Because force allows to pull down objects only if they're aligned properly. Feng shui probably. And don't let me get started on so called story and characters. PC port sucks like hell - who would thought about using [] as arrows to navigate menu? Damn, I stop it right here, it's not worth my time to describe it further... If you liked JK series and you think Force Unleashed is some sort of continuation, think again. Then look at its abbreviation.",
            "review_score": "-1"
        },
        {
            "review_text": "Looks great, but the controls are awful. Hitting your target with a force thrown object is basically random chance. And switching to 2D mode for boss battles makes them stupidly difficult...suddenly, all that you learned playing in the 3D mode is taken away and you're put in a platformer, only with even more broken controls; you think you're about to Force Lightning the boss, and it just fizzles right next to them. And to top it all off, there are quick time events...",
            "review_score": "-1"
        },
        {
            "review_text": "Ive tried reinstalling it but there is a really bad glich the makes the backround layer it's self like in windows xp when a program faild and when you try to move the window around it leaves a trail.",
            "review_score": "-1"
        },
        {
            "review_text": "part 2 is to 100% better sorry but this is ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Writing here on 05 Dec 2015. Everything is wrong with this game, avoid it. Spoend your time and money on a cheap excellent indie game like Invisible Inc. Don;t waste your time on this game, go play something else.  * Combat is repetitive, just hack and slash.  * No skill required in combat. * No story,  * No character progression. * No loot to collect. * No weapons dropped by enemies. * No weapon pickups. * No loot in destroud boxes or objects. * Linear path, just follow the dot, no alternative routes. * Console port with no PC specific additions. Framerate loecked at 30 frmaes per second (fps) is a disgrace to PC gamers. * No tradeables with other NPCs. * Pre-rendered video, Full motion video cut-scenes. * Bland levels with lots of brown, dark brown and dark colors.  * Repetitive scenery. *(Enemy) difficulty increases by increasing the number of enemies. * Enemies rush up to you and all you have to do is cut 'em down. * No skill based combat. If your upgrade for 'skill points' was not right you'll take much longer to defeat an enemy, whereas with a game for example Metal Gear Revengeance one could defeat an enemy on skill. * It is totally possible to speed run through whole sections/levels, avoiding combat. * Gfx is horrible console ported, even for 2008 standard. A digrace to PC gamers. * Plays like an arcade coin-up game, but the endless version.  * DirectX9 game not compatible with my LG 3D displays.  * Horrible framerate, only 30 fps. According to Steam forumsa this was how the game was designed to run, framerate locked. * Played with a wireless XBOX360 controller on PC.  Don't waste your time on this, go play something else. I have invested a lot of my precious time in this game. I knew I shoul've played Invisble Inc, or Endless Legend or Withcher 3 instead... but now I'm this far I might as well finish this.",
            "review_score": "-1"
        },
        {
            "review_text": "It's terrible, I'm just waiting for a refund, it's honestly just a boring game. I do not recommend this at all.",
            "review_score": "-1"
        },
        {
            "review_text": "This is an extremely bad console port!!! The camera angles are a pain in the ♥♥♥ during the boss battles, which makes it extremely hard to aim youre force powers. The controls are just the worst! They feel really ported and unoptimised for pc.  Since this is an awful console port, expect bugs and glitches! Several times I experienced sound glitches, no music etc. Two bosses even froze during the battle which forced me to reload my latest checkpoint.  The game itself was rather boring, enterntainless quick time events, boring combat, inconsistent level design, annoying menu navigation etc etc.  I recommend everyone to stay away, but if you are a die hard Star Wars fan and absolutely has to play this game anyway, go for a console version instead I",
            "review_score": "-1"
        },
        {
            "review_text": "The way this game controls, the janky physics, lack of explaination for how to do things and ludicrous AI makes me wish for the sweet embrace of death, as I fall off a cliff for the 13th time, and am sent back to a checkpoint before some cinematic intro, only to then be pushed off a cliff again while I try and figure out what the hell I'm meant to be doing.",
            "review_score": "-1"
        },
        {
            "review_text": "  &gt;recently started sharing games with friends &gt;notice he has force unleashed and decide to try it out &gt;first level playing as darth vader &gt;tossing people left and right &gt;fighting a jedi dude &gt;blasting him all over the place with the force &gt;he brings down a tie fighter &gt;crashes the game because EXPLOSIONS &gt;0/10 first boss WAY too OP pls nerf",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a Star Wars fan. This game could be a really great game if it could run correctly at least on the NASA's computers. ♥♥♥♥ you.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ controls, ♥♥♥♥ gameplay, awesome story just go and watch a lets play its not worth paying for the gameplay only the story.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is terrible. The controls are wonky, and the fights are boring. Get KOTOR instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Force powers, although initially they feel good, just end up being too clumsy to wield due to bad targetting where it's difficult to target what to pick up/push and where you want it to get thrown to. Light saber combat is lackluster, especially compared to the Jedi Knight series. Would recommend Jedi Knight: Jedi Academy instead for a Star Wars Jedi fix.",
            "review_score": "-1"
        },
        {
            "review_text": "Great graphics, great story line, untill...  They messed up when it goes from fighting to having to do scinimatic buttons as the thing is basically dead. And if you don't do it right, or fast enough, it auto heals, and you have to bring it's health back down again. I am killing it, so don't have time to even see what the button is and a big red X covers it. End of game.",
            "review_score": "-1"
        },
        {
            "review_text": "The force really didn't feel unleashed",
            "review_score": "-1"
        },
        {
            "review_text": "When first buy game, it seem good. Good graphic, sound, I much like. Then I play. It leave bad taste in mouth like bratwurst. Very bad. I pay good money for game, I expect it work! Overall, it remind me of story. I was 12, very young Russian child. My mother tell, 'you grow up, become like Brezhnev. Be big, strong, not little.'. I grow to be like Brezhnev. Then, I force to be left country. I see president, I think he little man. I go to bet dogs, but it illegal. I go prison. I get out, bet on chicken fight. Chicken I bet on lose. In end, don't lose if lose is bad.   I give game 2/17.",
            "review_score": "-1"
        },
        {
            "review_text": "F*ck this piece of trash. It's now five years since and still people are reporting the same bugs, the same problems. Difficulty is absurdly inconsistant, lots of instant death scenarios that just happen as if the game wanted to tell you Random Trollollols and the controls and camera made this a anger management lesson.  I will quit now before I slam my Razer Naga too hard on the table again. This game isn't worth my time and energy. And certainly not the money I've spent when I got it.  I've been staying away from playthrough videos since I wanted to know the story but wanted to earn it. After multiple starts over the years, some of which at the beginning because TFU wanted me, and yes I am not ♥♥♥♥♥♥♥♥ you, INSERT A F*CKING MEMORY CARD into my PC, I simply can't give a ♥♥♥♥ about it anymore.  I want to know the story to end this horrible part of my gaming life. I am just glad I haven't broken any hardware over this game, because god knows, it was tempting. Oh so tempting.",
            "review_score": "-1"
        },
        {
            "review_text": "Can be dizzying for some to play (makes me motion sick!), but it's 100% awesome fun for any Star Wars fan wanting to let off some Steam (ba dum tssh!). Leveling up feels smooth, combat is good (albeit a bit touchy, causing me to feel nauseous), and the plethora of extras in this version make it great. Sooooo many outfits!!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent hack'n'slash, especially if you love the star wars universe, i suggest ANYONE gives this game a try if you can!",
            "review_score": "1"
        },
        {
            "review_text": "Fun at first, but the gameplay gets somewhat repetitive and dry. Even so, it is a joy to play around as a jedi, and the story was interesting.",
            "review_score": "1"
        },
        {
            "review_text": "It has inconsistencies, and frustrating boss-fights, but if you're able to ignore such things it's a really fun game. It makes you feel more of a Jedi than any other game ever did.",
            "review_score": "1"
        },
        {
            "review_text": "runs perfectly and lots of fun .",
            "review_score": "1"
        },
        {
            "review_text": "First off I'm a star wars nut. love the lore and the movies etc yadayada...  I for one love this game for what it is. You play as Vader's secret apprentice and live by far one of the ♥♥♥♥♥iest lives in the galaxy. I wont go into any details for spoiler reasons. I will say I do love the story because of how snugly it fits within the canon of the universe, aside from never being mentioned Starkiller and his adventure could easily be part of the offical lore of the setting.  Now onto the game itself. First off this is clearly a port from the console, it feels WRONG on a keyboard and probably for that reason, fortunately if you have a controller you'll be right at home. Being a port (and a fairly lazy one at that) it's got it's share of odd bugs, fortunately none of them are too horrifying, aside from some noticable pop in on the larger more busy worlds and some textures you won't have alot of visual problems. But you will notice the occasional physics bug where a person suddenly goes mach 2 in any given direction.  Speaking of physics the havok engine is used for maximum lulz here. it's WAY too easy to just pick up like a trash can and knock everyone over, the second you touch them they go ragdoll and collapse and act llike they've forgotten how their body works its pretty entertaining. That being said it obviously makes your force powers seem ridiculous in comparison, take that and the fact that more than half the time your enemies will be utterly helpless against the power of the force and you can really feel like a tiny god at times.  All in all a fun game but it's fairly dated at this point and as I said before a is a lousy port. still pretty fun",
            "review_score": "1"
        },
        {
            "review_text": "Do NOT buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Received this game as part of a bundle along with a bunch of classic Star Wars Expanded Universe games. Consumers should have found whomever rushed this project among the parent company and tortured those executives. Pretty good storyline concept is present....that is it, all of the story content seems rushed and disjunct. Your protagonist has the amount of breaks as I'd expect from a coin-up arcade game. A potential significant improvement over the fighting mechanics in Jedi Knight &amp; KOTOR, but its rushed too. Every battle including bosses (with the exception of the last) is the exact same fight. The only surprises this game holds for a player is the flighty controls and random bugs that happen throughout your playthrough. If you happen to get this as a part of a larger bundle of games you want, exlude this one from the download. Don't give the voucher away either...unless there is someone you absolutely hate.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game until the point where a !#*$ destroyer don't want to fall. How is it possible that this level has made it through a beta testing phase, seriously? I don't know if the last chapters are good because I rage uninstalled the game after one hundred failures of 'destroyer force pull'.",
            "review_score": "1"
        },
        {
            "review_text": "Best star wars game other than battlefront 2!",
            "review_score": "1"
        },
        {
            "review_text": "Good game. I liked the story. Short, though. Somewhat disappointing, though. It could have been so much more than it was.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ port if you like a ♥♥♥♥♥♥ cam and terrible controls buy it on console or use a controller otherwise its a great game and one of my favorite star wars games so 7/10",
            "review_score": "1"
        },
        {
            "review_text": "The Force Unleashed is a really good Star Wars game, perhaps one of the greatest ever made. I came in with low expectations, based on the other reviews, but I was pleasantly surprised by how much I enjoyed this game.  If you're a Star Wars fan, BUY THIS GAME.  8/10  P.S. Use Combos, it's not as fun without them.",
            "review_score": "1"
        },
        {
            "review_text": "Only game I've played where you really feel like a force and lightsaber weilding warrior. Doesn't mean the game couldn't have been better, possibly. But I've replayed it a number of times, and if you want just fun jedi/sith combat and tossing dudes around with the force and lightning-ing them, this is a blast. Tried playing KOTOR and I just can't do without good combat. Click click or couple-button combat is not fun for me. THIS game most certainly is fun.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly I only picked up the game because of how fun it is to pick up people with the force, ignite them with force lightening and then hurling them into another person. (Because that's what I would probably do if I had the force)   The real gem is playing the game with triple screens. Simply edit the config file to fit the resolution for your monitors (in my case it was 5790x1080) - its an easy Google search for more info. Keep in mind that this is not a native resolution for the software and in-game cut-scenes will look streched and weird but normal gameplay is more expansive and impersive   The controls are odd with the mouse and take sometime to get used to.  ",
            "review_score": "1"
        },
        {
            "review_text": "So, I had this game for a while and now I bought it on steam. Athough the menu flips, it's the best game I ever played from the starwars universe, except the MMO STWOR",
            "review_score": "1"
        },
        {
            "review_text": "I usually love star wars, though this? A ♥♥♥♥ing abomination, I played it for 14 minutes, an then stopped. Reason I stopped? Not because it was bad, or because they game was bad, the ♥♥♥♥♥♥ graphics. Literally everything in the foreground is pretty good looking I can see everything perfectly, everything in the background? A bloody disaster, don't waste your money, buy a real star wars game, like Knights of the Old Republic. Something more fun, and actually works. This game took over 5 ♥♥♥♥ing hours to download, I had to keep pausing and resuming the download. I was up till 5 am trying to download it, I started download it at 10 pm the night before!!!",
            "review_score": "-1"
        },
        {
            "review_text": "TLDR: if you like Star Wars, 3D platformers and crashing stuff, do buy this game while it's on sale.  Don't fool yoursef. Don't expect a classic or a blast. This is a brainless force powered 3D platformer. And it's REALLY enjoyable when you just look for some casual gaming and you like Star Wars. Using the force to throw things and people around is pretty antridepressant. However, this game is not worth full price. Contrarywise to many reviews, I have to say that physics and controls are pretty good. You really NEED to use a gamepad here. The most important thing: when you start a new game, you'll control Darth Vader. This is just an 'intro' and it feels like another game: a very ugly one. Just get passed that stage until you control the actual main character, and then start making your own conclusions. And yeah, it's 30 FPS locked. I really don't care that much about it. It plays just fine. Nice story, by the way.  Edit: I just kept playing and it only improves. Boss fights are a blast!",
            "review_score": "1"
        },
        {
            "review_text": "Star Wars: The Force Unleashed Ultimate ♥♥♥♥ edition.  Clunky controls, bad camera and/or bad targeting especially during boss fights.",
            "review_score": "-1"
        },
        {
            "review_text": "It has everything. Lightsabers, the force, the occasion to play as the dark side for once.  Somehow still manages to be boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Works well for me!",
            "review_score": "1"
        },
        {
            "review_text": "ive encountered a certain difficulty that kind of makes gameplay itself sucks, it seems as though my games backgrounds and short veiw distance make it seem as though my game character is in a noclip mode out of the game, it makes everything difficult, if anyone knows how to fix it i would like a little help conserning this",
            "review_score": "1"
        },
        {
            "review_text": "Good game overall except for the star destroyer minigame. Almost impossible.",
            "review_score": "1"
        },
        {
            "review_text": "Don't waste your money on a very bad port of a rather good game. It is unplayable.   Game itself is fun. I had played it in xbox 360 years ago and it does make you feel powerful and it is quite entertaining. However this port to PC is one of the WORST I have ever seen. It has stutter that renders the game umplayable unless you change your video graphics card settings (searching online) and then it still stutters in cutscenes, making them unbearable. Apparently you can fix it by downloading some files from who knows where. Finally it also has sound bugs that come and go. I gave up.  ",
            "review_score": "-1"
        },
        {
            "review_text": "My favorite star wars game so far! gameplay is awesome and I love the story. Kinda sucks that its locked at 30fps, but I can live with it. I really love this game.",
            "review_score": "1"
        },
        {
            "review_text": "So this is not a 100% reccomended title, simply for some issues with it bieng older.  So, by far this is one of the best Starwars games out there. Decent lightsaber combat along with using storm troopers as a human shield then using him to knock down his friends. The quicktime event are pretty decent also, even though I suck at them. Aside from the combat mechanics, the story (so far for me) is pretty good.  But it is a older game soooo, it has some issues. Namily the fact that unless you have a Xbox controller is it impossible to get past the first Star Destoyer pull down minigame, as you only get the correct speed for pulling it down for a short time before the mouse suppot kinda gives out, and you only get about 1/4 the pull down speed. Now this wouldnt be so bad if TIE fighters didn't continuly spawn and would reach you before you could rip the Star Destoyer out of the sky.   Can rip Star Destroyers out of orbit, cant throw purge troopers or small walkers.   Will update once I get my hands on a Xbox controller.",
            "review_score": "1"
        },
        {
            "review_text": "8 hours of campaign and I finally finished this game. I don't know why it gets mixed reviews, but mine won't be one of the negatives. This game is the second best SW game I played so far, considering I haven't played all of them, this one is not better than Battlefront 2 only. I found a lot of problems but I would be lying if I say I didn't have a great time playing this. The plot was ok, it wasn't amazing or anything but it made me care about the characters. Gameplay is non-stop action with no puzzles but I'm not complaining, there's tons of other games with puzzles out there, I just wanted to slash everyone with the lightsaber and I did. Best thing is, there's a lot of different enemies, makes you put different moves and aproachs to each of them and this is what I value more in an action game, the variety of enemies and different strategies to defeat them.",
            "review_score": "1"
        },
        {
            "review_text": "Hours of Fun gameplay and interesting non-canon story. Approve   1337/42069 Would force lightning everything again",
            "review_score": "1"
        },
        {
            "review_text": "You know a game is good when it shows gamers the deepest, darkest side of the Force",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game and storyline, really fun to play, especially if you're a star wars lover like myself  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing doesn't run on Intel computers, Steam refuses ♥♥♥♥in refunds this is ♥♥♥♥♥♥♥t. It's a great game, but Intel computers CANNOT run it.",
            "review_score": "-1"
        },
        {
            "review_text": "Played this game on Nintendo DS, Nintendo Wii, PlayStation 3, and PC. All versions were fantastic and different in their own ways. Story is compelling, gameplay is solid, and it holds up as a game half as old as I am. Definitely one of my all-time favorite games. Great Star Wars game, if you feel like some Expanded Universe jazz is what you want.",
            "review_score": "1"
        },
        {
            "review_text": "I grew up playing this game, so I might be a bit nostalgic, but I love this game. You get to use the Force in really cool ways, and the ragdoll physics are great 11/10 would Force again",
            "review_score": "1"
        },
        {
            "review_text": "A fun game with too many bugs and glitches to be an overall enjoyable experience. Lots of potential but the tenth time you miss your mark because of a combination of bad camera/controls/movement you really start to get too frustrated to bother.",
            "review_score": "-1"
        },
        {
            "review_text": "The best Star Wars game I've ever played 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Mind blowing",
            "review_score": "1"
        },
        {
            "review_text": "This Game is not bad in fact it really is rather enjoyable, until you get to the star destroyer boss which is so stupidly, inhumainly and horribly hard (you will never beat it! ever! ever! ever! ever!) you will just give up after furriously trying to find a trainer (cheat) for 2 hours all for nothing because some ♥♥♥♥♥♥♥s at  {LINK REMOVED}  'Cheathappens.com'  thought it was a good idea to request premium login to download the ONLY working trainer for this game. So ♥♥♥♥ you Aspyr! Why did you have to ruin what could have been a good game! Stupid Level designers! They should all be shot!",
            "review_score": "1"
        },
        {
            "review_text": "Star Wars the Force Unleashed is the ultimate Star Wars Game. I'm sure that at some point during a Star Wars game we've all said to ourselves 'Why the ♥♥♥♥ can't I just throw this guy off the edge of a cliff with the force?', well, now you can ACTUALLY DO THAT.  This game lets you use all the force goodies from the movies, plus a couple new ones, such as creating a force shockwave and imbuing your lightsaber with sith lightning.  The combat is fast paced and dodge-oriented. You get health for killing any enemy, but be careful; on higher difficulties you can be torn asunder by blaster fire very quickly.  From a story standpoint, this is a game that takes place during the 'Dark Times', the period between episodes III and IV where the last of the jedi were being hunted down, and the Rebel Alliance hadn't been formed. The game takes you through the deaths of most of the remaining jedi, and shows the origins of the Rebel Alliance, as well as Vader's plan to overthrow Emperor Palpatine (supporting his actions in Episode VI).",
            "review_score": "1"
        },
        {
            "review_text": "I would fully recomend this game it is brilliant :) ",
            "review_score": "1"
        },
        {
            "review_text": "Closest thing you'll get to experiencing 'the force' on the PC game that has been released yet. Taking down a star destroyer with your mind is quite a feat! Not since Jedi Knight had I this much fun in a star wars game",
            "review_score": "1"
        },
        {
            "review_text": "Not quite as well done as the Jedi Knight series, but since we haven't seen one of those in a while, this will have to do. Still pretty fun, but some of the boss fights can get to you.",
            "review_score": "1"
        },
        {
            "review_text": "After going from the console version to the PC version I dont see why there is such a bad rep for the PC version. Played through the whole game with a 360 controller and full graphics and found the experience to be vastly superior to consoles in every way.",
            "review_score": "1"
        },
        {
            "review_text": "Not half as bad as everyone makes it out to be. Visually still stunning even after all those years, and the gameplay is fast and action-packed. Definitely use a 360 controller though.",
            "review_score": "1"
        },
        {
            "review_text": "The Force Unleashed is a great game, if a little akward to control at times. The game really shows how badass jedi/sith can be, and is great for stress relief.   My only two complaints are that (1) the game can be difficult to control in combat (you feel knockback way more than some enemies, and can easily get stun locked at times), and (2) the DLC (included in teh Ultimate Sith Edition) feels very separate from the game itself. The DLC isn't added into the game itself, to allow you to continue levelling up and such in new missions, but instead are three new options when you start a new game, providing you a pre-levelled character to use.  Overall, though, it's a great game, and definitely one I'd recommend to all Star Wars fans.  (PS, if my low game time seems suspicious, it's because I put most of my time into this game on my console, and only recently purchased it for Steam)",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is best played on the Wii!!!",
            "review_score": "1"
        },
        {
            "review_text": "Although this game is extremely fun to play it is not meant to be played with a keyboard and mouse, this means for some people (including myself) who get really intrerested in it then realize they can't complete one of the missions simply because it is almost impossible with a keyboard and mouse very disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "A decent game... On playstation. Constantly crashing, lagging and stupidly repetitive gameplay make the interesting story not worth the purchase. Wouldnotbuy/10",
            "review_score": "-1"
        },
        {
            "review_text": "An insult to the Star-Wars-Franchise",
            "review_score": "-1"
        },
        {
            "review_text": "If you ever dreamed about playing as a customized Jedi or a Sith in a great Star Wars game with terrific plot and combat then get out of here and go buy yourself KOTOR I and II.",
            "review_score": "-1"
        },
        {
            "review_text": "If you are a fan of Star Wars, you should definitely play this game. If you are a fan of action games, this is also a game for you.  The Force Unleashed is an excellent action game with a pretty good story. You play as Starkiller, Darth Vader's apprentice, and at the beginning of the game are tasked with killing the last remaining Jedi. The rest of the story is a bit predictable, but the excellent cutscenes, backed up by great writing and voice acting, make it very enjoyable. There are a couple of insanely cool moments you will remember for a while, such as    force pulling an FING STAR DESTROYER from the sky and smashing it into the planet surface   . Backed up by great art and music, you can easily feel what the characters feel and get emotionally involved in the story. In my opinion, Starkiller is especialy well developed and is very easy to relate to.   The gameplay is excellent most of the time. It is a standard action hack 'n' slash game. Levels consist of platforming sequences and sections where you fight a lot of enemies. Fighting is excellent, and makes you feel like a real Jedi because you can freely throw everything and everyone around as you wish. It is even more fun because of the ragdoll physics and it can be really fun seeing your enemies tumble around in air as you throw them.  The game does have a few setbacks. The camera can go crazy. Boss fights, despite usually ending in great executions which are simple and short QTEs, can vary in quality. Some are too easy and can be easily button-mashed, and others require you to follow just one pattern over and over again slowly. Another issue is a lack of replayability, since you only have one ls/ds choice and it is at the end of the game, so you can just reload and see it. There are challenges and collectables you can pursue, but they don't really offer much, and the story can be finished in some 5-6 hours, maybe even less.  This is still an excellent game, and it is a shame LucasArts/Disney decided to ignore the extended universe since this was a great addition to it. Definitely recommend it to all, both for it's action and for the story.",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend it only for Star Wars fans.  It is kinda fun, yes, but the controls can get real weird, the fighting mechanics can be a routine (hey, it's a hack and slash). The story is what kept me playing. I often had thoughts of 'oh please let this level end and let me know what happens' in some awful levels. This game is very story-rich and for any Star Wars fan, that should be enough.  The difficulty is a little more hard than it's sequel though but no problem with that. Some glitches, the locked frame rate.. I don't care, I enjoyed it and left me wanting more (and so, I went and played TFUII)",
            "review_score": "1"
        },
        {
            "review_text": "I recommend it because...well...I don't know. I love Star Wars. I love the universe. And of all Darth Vader is my favorite.  I enjoyed the game for what little hours I played it, but overall...the game plays like an unfinished beta. The controls are for the upmost frustrating on many occassions, the camera angles can make you rip your hair, the sensitivity seems to be everywhere, the levels are...inconsistent I would say. Don't even dare try to play it with a keyboard, it'll frustrate you. Best with a controller. The menu, options menu (paticulary graphics), and load times are horrid are amateurish. It just feels very....rushed and unpolished and like a bargin bin action-fighter rpg.  However...if your Star Wars fan. You'll enjoy it. Definitely without a doubt. But $19.99? Pfft. Hell no. Buy it on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "The Bad: Medicore, frequently repetitive gameplay with often unresponsive controls and a very cool Force throwing system with utterly impenetrable aiming mechanics (At best, you can move the object/individual you're trying to throw vaguely in the direction you intend it to go in, and hope that it lands somewhere in the vicinity. More often than not it just drops straight down, or goes flying in a completely different direction...I'm still not sure why.)  Occasionally hairpullingly frustrating when there are massed ranged troops, some of whom have weapons that can stun you or knock you back, leading to instances where you get chain stunned and take an enormous amount of damage with little to nothing you can do about it. I'm assuming that in these instances you're supposed to use your incredible Force powers to hurl some of the random debris that sits around every environment in the game into the groups of your enemies but the aformentioned uncontrollable aiming system makes trying to hit anything that you're not locked onto an exercise in futility, so the debris mostly gets in the way (you can also Force-grab enemies, but in some areas the debris is so thick that half the time Starkiller ended up grabbing random detritus and violently throwing it out of the way of his foes like some sort of telekinetic custodian clearing away trash in mortal fear of a personal injury lawsuit) so you're reduced to wading into the thick of your foes as best you can, Force-dashing along the way to avoid the stream of rockets, electric rounds, etc. that are being shot at you, and then flailing about with your lightsaber.  There are a number of simple combos that you can use in combat, but after about halfway through the game most of the enemies have shields that block your Force powers until you do enough damage to them, at which point they're almost dead anyway, so in practice you wind up spamming attack a lot.  Now and again you'll come across a larger enemy (Rancor, AT-ST, etc.) and that'll be cool the first few times, but after the third or fourth you'll realize that you can kill it by popping out of cover, zapping it with a full bar of Force Lightning, then popping back into cover and waiting for your mana to regenerate (which it does almost instantly) until its health is in the red and you can run up to it and kill it with a quicktime event. The combination of this, the aformentioned stunlock issue, and the Force-blocking shields mean that a squad of Stormtroopers in 'Force Unleashed' is generally much more dangerous to you than a pair of Rancors.  Possibly the crowning achievement of the game's bad design occurs near the end of the game, where an event that should've been an incredible, 'holy crap' experience is instead reduced by an actively deceptive onscreen prompt and poor controls into an exercise in absolute, controller-throwing frustration.  The Good: Absolutely spot-on voice acting (Vader sounds like Vader, Palpatine sounds like Palpatine, all of the new characters are on point as well), a very strong story, and gameplay that is often fun despite itself. It has its (many, many) flaws, but the core mechanic of Force manipulation is enough to sustain the game. Almost every level has some sort of awful. hilarious thing you can do to your foes, from dropping an Ugnaught into an active carbonite bath, to slowly pressing a Jawa against a laser fence, to throwing a Stormtrooper through a window and into a stream of flaming railgun exhaust (or into the vast void of space, or into a Sarlacc's mouth, or...) to just plain hurling them against the wall until they stop moving. The Force Push also figures into this, and the first time the stars align and you chain it into a combo that targets a cluster of unshielded troops, hurling them screaming off of a platform, it will be absolute magic.  If you're a Star Wars fan (and honestly, who isn't?) I'd grab it, but I can't recommend it to someone who isn't attached to the mythos and is just looking for a good game to play.",
            "review_score": "1"
        },
        {
            "review_text": "I never regret buying this game in Humble Bundle. 10/10 would replay this.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the console version of this game and was looking forward to seeing it in action on my more than capable pc.  Despite this, the Force Unleashed I played on Steam was a mess of slow loading flora and fauna, missing colours and objects replaced by unsightly black blobs, zero customization when it comes to graphics and most annoyingly of all 2 of the levels, the second and last level were lacking almost completely in sound.  Bizarre. This is an OK game that hasn't aged well, but the bugs on this PC version render it completely unplayable. I would not buy this product, and I'm highly disappointed at such a half-♥♥♥♥♥ port.  FOR THOSE FACING THE SAME PROBLEM, there is a patch availiable on steamforums, but I cannot possibly give a positive review to a game that relies on fan-made patches to work.",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend the game if you just like being the all powerful Sith Lord you wanted to be as a kid.It does have a few annoyences like the loading times,and trying to pull down the star destroyer with a mouse and keyboard.Other then that I recommend it fully if you just want to murder storm troopers",
            "review_score": "1"
        },
        {
            "review_text": "Overall clunky and unconvincing. Wouldn't buy again.",
            "review_score": "-1"
        },
        {
            "review_text": " Star Wars The Force Unleashed™",
            "review_score": "1"
        },
        {
            "review_text": "This game has an amazing combat system, but the action is constantly interupted by quicktime events every boss or big enemy you fight. This breaks the flow of the game entirley too often which is upsetting since the rest of the combat is so good combo wise.  The controls feel ok sometimes, but a lot of the time you don't feel in control of the character. You push buttons, and he does whatever, but it feels very synthetic and loose.   The camera and targetting system is hard to control. The enemy AI is absolute garbage, the enemies aren't hard, once you find out there weaknesses you can just spam till it dies, which is upsetting because the combo system is awesome and really satisfying, also the storm troopers are pathetic as they shoot at you till you get close enough to cut through them like a piece of paper. The games crappy AI turns the whole thing into trial and error, get killed by a bunch of enemies, learn how to beat them after 5-10 tries, rinse and repeat for the whole game. Not very compelling.   The port isn't good either, This game runs on a constant 30fps and no way to bring up. But the most annoying thing is the frequent crashes.   Pretty disapointing because I really wanted to like this game, but I found it waaay over hyped and non-compelling. For a person wanting a decent hack n slash, play this game.   Die hard Star Wars fans wanting a compelling, challenging masterpiece that controls like butter and has satisfying gameplay overall, this game is not for you.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a real piece of ♥♥♥♥. It has bugs even inside of other bugs, the controls are weird and not helpful. Enemies can kill you instantly at some parts of the game, leaving you to wonder what the hell just happened, and the terrain is really faulty and hard to understand. Some bosses are really unbalanced, and others too easy. A poor game for a nice franchise that star wars is. Sure, the story is awesome, and I wanted to understand the story by playing the game.  At some time I just gave up and saw the whole story via youtube and read the comics, much less stress and loss of time.   ",
            "review_score": "-1"
        },
        {
            "review_text": "A fun Star Wars game. The acting isn't always that good but it is interesting to see how the rebellion could have been formed. If you are impaitent waiting for Disney to come out with a decient Jedi based Star Wars game, then this is a good game to tide you over until then.",
            "review_score": "1"
        },
        {
            "review_text": "Well..... it's aight",
            "review_score": "1"
        },
        {
            "review_text": "Pros: -Amazing story that follows the events of the prequils.  -Decent graphics -Gameplay  Cons: -Gameplay: I put this in cons as well because at times the game feels unbalanced. Either making you much more powerful or making the enemies more powerful than you. It may have just been my experience but the fight with Shaak Ti felt even and fun. Then when I would fight Proxy it was not fun. It never felt completely balanced at one point during the game. Again, my experience may be different from others. -Very, VERY short game. 9 chapters total. Took maybe 3 hours to beat, and I took my time.  I would get the game if you're a fan of the Star Wars universe. However it's not something you NEED to play. I got it at a great price during a steam sale and I wouldn't buy it again unless it was on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Star wars+Hack an slash=Funtimes",
            "review_score": "1"
        },
        {
            "review_text": "Almost everything in this game is awful. Targeting is awful, CC is awful, balance is awful, level desing is awful, platforming is awful, the boss battles (you'd think that jedi vs jedi fights would the pinnacle of this game, yep, the pinnacle of awfulness). I really liked what they tried to do, but unfortunately they failed in everything. Even the praised story/plot wasn't that good (but it wasn't awful) and I felt that it was presented badly.",
            "review_score": "-1"
        },
        {
            "review_text": "30 FPS cap I had to edit the config.xml file to get a resolution higher than 1080.  Textures glitch quite often SFX/Music/Voice balance is skewed on at least 4 of the levels I've had to restart my game at least 4-5 times because I stepped on an elevator and it passed right through my character, causing my character to lock in place. It's now a 6 year old game without a patch from the developer.",
            "review_score": "-1"
        },
        {
            "review_text": "I like it but its hard to control i cannot control so good with it settings can someone help me i mean i can only go to right and down not left or up",
            "review_score": "1"
        },
        {
            "review_text": "This game like ♥♥♥♥,i mean they didn't make versions of 8,1 and optimization for AMD graphic cards,It's locking itself on 30fps.If you want to buy any Star Wars game i prefer you to buy Jedi Knight : Jedi Academy.",
            "review_score": "-1"
        },
        {
            "review_text": "Star Wars The Force Unleashed, Ultimate Sith Edition. What can one say about this game, well its Star Wars and its just awesome. I thinks that alone is worth buying this game. And it is better on the Dark Side.....",
            "review_score": "1"
        },
        {
            "review_text": "Now is the game perfect? Hell no. The controls are difficult to handle and the gameplay is eratic. Sometimes enemies will continually hit you with no chance of you getting back up. Really, this is a console game, even with controller, it's still difficult to handle. But once you get combat down (which is a chore) you will feel like a badass. This game not only looks great, but if you are a star wars fan (and hate Disney for ret-conning EU) than this game's story will satisfy, even if you aren't, it is pretty well written, voice actors clearly know what they're doing, and overall it fits nicely in the Star Wars universe. Reccomend if you have a controller, if not, it's still worth a go. And for the price, it isn't asking for much, especially with the various other DLC campaigns.  EDIT:  This game is probably one of the most recent and best examples of star wars combat, except for one major MAJOR flaw... The lock-on mechanic. You know how in the Batman Arkham games whenever you threw a punch, Batma would automatically hit a nearby enemy? It's said that Arkham Asylum came out the same year as this game, and if this game somehow managed to incorporate that one little addition of code. That made it so that not every bad ♥♥♥ move you made completely missed an enemy, but immediately locked onto an enemy? This game would have very little issues and be out-right perfect in my mind. But it's not, and that's a shame.",
            "review_score": "1"
        },
        {
            "review_text": "I just finished this game, and it was still entertaining even though I played it well after it was released. The graphics seemed fine as well, although I'm not too picky about that. The game only took 11 hours to beat though, so just consider that you are paying for 11 hours of entertainment, and decide if the price tag is worth that to you.",
            "review_score": "1"
        },
        {
            "review_text": "Game is fun. I would recommand to use a controller though, the Star Ship is a pain in the ♥♥♥♥ with a mouse.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game and all, but i can't upgrade any force powers because the game requires you to use these two logos [ ] to switch sides and those two can't be accsesed in game. Does anybody have a fix for this?",
            "review_score": "1"
        },
        {
            "review_text": "Ignore whaky controls and camera angle and lack of graphics and this is a great game. You feel powerful. A ust get for a starwars fan.",
            "review_score": "1"
        },
        {
            "review_text": "Star Wars: The Force Unleashed is a game that was originally released for the Xbox 360 and Playstation 3 and was ported to PC and Mac.  The game follows the character Star Killer through the Star Wars Universe performing tasks for Darth Vader. There are various planets in the game however some are bundled with glitchy sections. For example, I experienced times in which I fell through the world leading to my death which was infuriating due to the checkpoint system they have meaning sometimes I would be forced back way earlier in the level.  The story in 'Force Unleashed isn't a work of art but it wasn't too much of a bother for me. The game follows a simple formula of sending you to a location, killing every living thing and defeating the boss. What makes this interesting is the various ways to kill your enemies. As you progress through the game you unlock new abilities and you can upgrade them with Force Points which are gained by completing the current mission, finding hidden holocrons and killing things.  As mentioned before, there are bugs and many are annoyances however some can be quite funny. One particular bug prevented me from completing the game right at the very end. Revealing details of this bug may ruin your experience if you intend to play this. However I can say this: near the end of the game you will encounter boss fights in which you can't take your time otherwise you will run into a bug and won't be able to progress.  Overall, despite the bad port job and other negative things I recommend this game but only to a fan of Star Wars and only if it was on sale.  Apologies for any grammar and spelling mistakes - at the time of writing, it is three in the morning and I am slightly tired.",
            "review_score": "1"
        },
        {
            "review_text": "As a Star Wars fan, I would say it's the best slice and dice game on the internet.  P.S. Stormtroopers don't miss in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awful forced camera angles and not really fun boss fights. The whole game seems like more of a hassle than fun. I'm on PC, maybe it's more fun on console, but this was a chore of a game. 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great game with mostly great level design and I absolutly love the story if you like Star Wars I would definately recomend it",
            "review_score": "1"
        },
        {
            "review_text": "TL:DR at the bottom  Preface: Im not the biggest star wars fan. I like it and find Darth Vaders character to be really interesting but i find the whole universe a bit shallow and the movies a bit cheaply made. This review looks at the game from a gameplay perspective.  Ok so little backstory on why I dont recommend this.  I had rented this for x360 WAYYY back when it was released, I reached the last mission and had to go to sleep. Parents however returned it without asking me and I never got around to renting it again. I had completely forgotten its existence until I saw a bundle of it + FU2 on the interwebz.  I bought it in an instant.  Im still debating if that was a mistake or not. I got around to finishing a game from my childhood but the PC port is SOOOOO terrible I thought of uninstalling a myriad of times.  Sound files are missing, in combat you might as well be deaf on certain levels. Music is playing around 70% of the time, the other 30% its turned off. Im not joking sometimes, even in combat, the only thing u hear is your character jumping and swinging his lightsaber. Its like fighting storm troopers in space. I mean literal no gravity space, not on a deathstar or on a planet. Apart from this, the volume of the characters voices seems to go up and down constantly and I got the hint that it wasnt the same voice actor at times. Very big hit to my immersion.  The game allows for a decent amount of powering up your character, but honestly you already feel pretty powerful without most of the upgrades. You basically one shot people with the Force Throw ability. Also, the game allows you to change costumes, but in doing so you have to load to the last checkpoint, and when the mission ends your costume is reset. So i changed costume the first time and never bothered again since it would be reset by next mission.  Another god annoying thing, some character models seem to strech. Like the apprentice of Shaak Ti, her right eye and right lip side stretched like she was having a stroke. By the final missions you will have noticed this on most characters happening at least once.  The graphics are locked to 30 fps by default, only way to circumvent this is by googling for a fix. A guy made a couple .exes that set the fps lock higher. I applied the 60 fps lock and it worked for about 80% of the game. At around the final mission it reverted back to 30 fps, but i was too annoyed at the game at that point and just wanted to finish it and uninstall to care about fixing the lock.  Also, its a very damn short campaign. Granted there is a certain modicum of replayability. Dont let my game time fool you. I left the game open on occassion to attend to RL stuff. The campaign can be finished within 5-6 hours max.  EDIT: forgot to mention how terrible the camera work is. I honestly feel The Last Guardians camera is a masterpiece compared to this game.  TLDR: Nostalgia is a cruel mistress. Terrible PC port. Get this on sale only and only if you are a star wars fan. If you are looking for devil may cry in space, look elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "Has compatability issues with a fair number of graphics cards. Should have done my research. Didn't work for me.  Ultimately, the game is pretty good, but I recommend the console version unless you have double checked that it works with your graphics card.",
            "review_score": "-1"
        }
    ]
}