{
    "app_id": 324610,
    "name": "The Shopkeeper",
    "release_date": "2014-10-23",
    "developer": [
        "Tom De Roeck"
    ],
    "publisher": [
        "Mastertronic"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 10,
    "positive_ratings": 18,
    "negative_ratings": 117,
    "price": 1.99,
    "description": "A desperate man needs to find the right antique to impress a rich relative, but his choice will have dreadful consequences. The Shopkeeper is a point-and-click narrative game set in a space between the Twilight Zone, classic Lucasarts adventures, and Antiques Roadshow.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/324610/header.jpg?t=1496987866",
    "minimum_requirements": "OS: Win XP / Win 7 / Win 8 Processor: 2.0 GHz Dual Core Processor Memory: 2 GB RAM Graphics: Integrated Graphics (512MB VRAM and above) DirectX: Version 9.0c Storage: 100 MB available space Sound Card: DirectX 9.0c compatible.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I typically do not write a review for a game until I've played it for quite a few hours. I may have only played this one for two hours, but I believe I've found everything the game has to offer. And truthfully, I wanted to enjoy it... but I felt I was lost in a story that made little sense and wasn't captivating.   There are also the following core issues: - The fancy handwritten script can be extremely hard to read. - There's no option for subtitles. I usually play with audio anyway, but I always dislike it when games /force/ me to have the sound on. - There's also no music. Music adds so much to a game, or in this case, NOT having it actually takes away from the experience.  The achievements were also mostly based on repetition; the game had to be completed twenty or thirty times to get everything, and even then, there was little to no guidance on how to get the achievements, so it was mostly me stumbling around blindly clicking on things and hoping an achievement unlocks.   There are some high points, like the voice acting -- it's not great, or even good, but I've also heard much worse. The concept is also cool, though the storyline could have been fleshed out more. It doesn't even do it justice to storylines to SAY this game has a storyline, as it's mostly random tidbits of information about items in a fictional shop coupled with a minorly interesting, not-that-compelling dialogue between The Customer and his Mother-in-Law. Overall, I don't think I can really recommend this game, but if you insist on buying it, I recommend checking out the achievement guide I wrote in the guides section, mostly because it will limit the amount of frustrating repetition that is to be found in this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Short but sweet gem of a game. The art is original and well executed, and the voice acting very good. It is not so much a puzzle or adventure game as a story exploration game. The central puzzle is there as a raison d'être, but the game is more about contemplation and atmosphere - playing it just for the challenge would likely have you missing much of what makes it beautiful. My only complaint is that it is very short, but the format seems open to more visitors to the shop in the future.",
            "review_score": "1"
        },
        {
            "review_text": "The Shopkeeper is a short, confusing, repetitive, obliquous game with a pretty bad voice acting with no subtitles to make the comprehension easier.   The game presents us with a young businessman looking for an antique to gift and impress his Mother-in-Law. The titular Shopkeeper tells the story behind each item for sale in his store and through a series of dialogue choices, it will be explained the consequences of choosing one gift over the other. Pick the incorrect gift and the story will repeat itself, until you pick the right one and the game ends.  The problem is that the story is never particularly explicit. Even when the best ending is achieved, you can’t really be sure what happened or why that approach was more successful than your previous ones. This results in each subsequent play through feel too repetitive and it becomes frustrating... very frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "A strange little point and click adventure game with multiple endings. Extremely short and very little interation. Graphics are alright. Basically there's very little in the game to recommend. Just too amateurish.",
            "review_score": "-1"
        },
        {
            "review_text": "The game started off as a harmless game with vaguely entertaining undertones. Something to spend an hour , before moving on to other matters.  Little did I know what broiling, seething, endless amounts of hatred this game would inspire. The voice acting is grating and repetitive. It is easily ignored at first, but after a while you hear them say the exact same thing over and over again. There are limited choices you see, and each of them as meaningless as the last.   What item you choose in the shop means nothing. It just has a meaningless bit of trivia attached to it. One you will hear over and over again, as sometimes seemingly at random you will start outside of the store and instead of going in, the game chooses an item for you. You start knowing each item by heart and hating yourself for it.   The dialogue with the mother in law is equally meaningless. The only ending in the game which seems remotely entertaining is where she dies. None of the characters are remotely interesting or evoke the slightest bit of sympathy or engagement. The protagonist is a shiftless, whiny, useless man who his wife probably married to spite her mother. Understandable, as the mother is a shrill harpy whose voice slowly makes one wish for blunt cranial trauma. The best character is the shopkeeper, for he is only ineffectual instead of being an outright blight on humanity. To add injury to insult, I think I made the characters twice as interesting as they are in the actual game..   To make this game palatable, I would suggest the following.   1. If one is outside the store, allow one to simply skip to be within it. You already heard everything the flower shop guy had to say.  2. Always allow one to choose your item. That is the point yes?  3. Let people change perspective themselves.   4. Provide subtitles  5. Allow one to skip dialogue if it is the exact same. clicking through simply isn't fast enough.   In short, strive to not waste people's time with the game.   Although in hindsight a letter of apology for releasing the game would seem the better option.",
            "review_score": "-1"
        },
        {
            "review_text": "Sometimes, the indie-game-world produces amazing games. They can be minimal, they can be short, they can have bad voice-overs or bad music. A game just needs to be fun, or at the very least, entertaining in some way. 'The Shopkeeper' fails in every possible way.  Simply put, the game is boring. This is a point-and-click adventure game with, perhaps, 5 screens to explore. Gameplay revolves around a short story that repeats ad infinitum. (It's a bit like the movie, 'Groundhog's Day', except really short and uninteresting.) You have no control over your character. (It isn't even clear who your character is supposed to be.) There are only 6 characters in the story. Two of them, will never interact with you. Clicking on items will sometimes give an explanation... and sometimes it won't.  ...and... that's about it for gameplay. Oh, there is ONE dialog tree. Most of the time, the dialog doesn't change. You have to pick the correct item AND the correct dialog options in one run. Make a mistake? You must play through the entire sequence to start over.  The graphics are quaint, but poor. If all I'm going to see in a game are 5 screens, those screens should look amazing. Instead, we mostly have neutral tones of brown and gray.  This isn't a game, it's a story. A non-interactive story that provides choices but punishes you for making the incorrect decision. It just isn't fun. This is a really bad way to tell me a story.",
            "review_score": "-1"
        },
        {
            "review_text": " The Shopkeeper Review",
            "review_score": "-1"
        },
        {
            "review_text": "This is just so WTF, you should get this game just to have your own WTF moment and then realize that all the negative reviews tell the truth. But hey, I got 100% achievements ... wooooooot o.O",
            "review_score": "-1"
        },
        {
            "review_text": "I got this as part of a Humble Bundle package and decided to give it a try. Its the same 3 characters having the same conversation probably 10-30 times depending on if you're lucky to hit the exact sequence of vague dialogue options. You get so 'into' the game that you start rapidly clicking through sections that you've heard a bunch of times. I skipped the ending by accident and really have no desire to go back and 'play' just to find out how the game ends.",
            "review_score": "-1"
        },
        {
            "review_text": "I was very unsatisfied with this game. Repetition, and dullness, with very little to tell you if you're moving in the right direction or not. Once you know the solution, that's it. At 2.99 I still feel as if this game is overpriced, and It's one of the rare times when something like this has left a sour taste in my mouth. No depth, no insight comes from making various choices. The developers missed the mark terribly on this one.",
            "review_score": "-1"
        },
        {
            "review_text": "LOL ITS NOT EVEN A GAME",
            "review_score": "-1"
        },
        {
            "review_text": "This game has 2 things going for it:  1. Like hitting oneself with a hammer, it feels great when you finally stop.  2. Helps you appreciate the good games in your life.",
            "review_score": "-1"
        },
        {
            "review_text": "While the art is very cool and the idea was interesting, this game is driven by it's dialouge. And unfortunately for The Shopkeeper, the dialogue is only underperformed by the voice acting. I got this with a Humble Bundle, so it was a snag, but I would never actually recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "The asthetic of the game is unique to indie titles. Sadly too common within that genre.   The game plays as a point-and-click adventure. Slowed by only allowing you to select 3 items before an elaborate and familiar conversation or two before the day starts anew. A tutorial wouldn't go amiss, minecraft pulled it off. The Shopkeeper, not so much.   Let my small play-time tell you this, I have every achivement, I have entierly finished the game. Read every sign, saw every coversation and while the story is somewhat interesting I find myself struggling to list worse games.",
            "review_score": "-1"
        }
    ]
}