{
    "app_id": 324760,
    "name": "Monster Truck Destruction",
    "release_date": "2015-07-10",
    "developer": [
        "ODD Games"
    ],
    "publisher": [
        "ODD Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Racing"
    ],
    "tags": [
        "Racing",
        "Action",
        "Destruction"
    ],
    "achievements": 0,
    "positive_ratings": 137,
    "negative_ratings": 167,
    "price": 3.99,
    "description": "Can you handle a 1500HP Monster Truck that can crash cars, get massive air and pop wheelies with a blip of the throttle? Monster Truck Destruction is here to satisfy all of these needs plus more!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/324760/header.jpg?t=1552477972",
    "minimum_requirements": "OS: Windows XP or higher Processor: 2.0 GHz processor or better Memory: 1 GB RAM Graphics: 256 MB RAM required DirectX: Version 9.0c Storage: 450 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  Actually good",
            "review_score": "1"
        },
        {
            "review_text": "Very hard game. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Yes! As of 27/7/2015 there is CONTROLLER SUPPORT! :D THANK YOU for adding that, developers!  At last, it's properly playable on a PC and it's a fantastic game.  The only downside has to be the menus - they're really scrappy and not really functioning well with the controller, but thankfully there's a mouse pointer for that. It would be lovely to see an update to tidy up the menus in the future.  That said, the gameplay is top notch. At the price it's on here for, you won't get better monster truck physics anywhere else.. it's tough as nails but great fun too, with lots of content to keep you busy :)",
            "review_score": "1"
        },
        {
            "review_text": "With the new patch. The game works pretty darn well. I loved it on the iphone and android. I love it even more now that it is on the PC. For a $4 game and the controls patch. well worth the money for any Monster Truck fan. The best MT game since Monster Truck Madness 2. Now if we can get a track and truck editor or at the very least a track editor. :)  I think people were a little quick to through stones at the game. Its not like it was a AAA title at $60.",
            "review_score": "1"
        },
        {
            "review_text": "I dont know what the negative comments are about but they have NO clue what theyare talking about.  Pros: 1. Controls are really easy to master 2. The graphics are GREAT 3. It's crazy cheap when on sale   Cons: 1. AI needs to be dumbed down a bit because they are way too fast in racing and win all the time in freestyle    I recommend 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Its a damn fun game. 10/10 More of a game than a simulator. If you want a simulator. Go to Rigs of Rods and Sim-Monsters.",
            "review_score": "1"
        },
        {
            "review_text": "Writing this review to say its a buggy mess. The most destructive thing you can do this game is buy it, cause its boring and a waste. Hey Devs! You know that email you sent to Nerdcubed? yeah he made a pretty nice video about that you scum.",
            "review_score": "-1"
        },
        {
            "review_text": "Not very good, don't reccommend.",
            "review_score": "-1"
        },
        {
            "review_text": "This game on paper should be amazing,, what hot blooded male doesn't love the idea of getting behind the wheel of a monster truck and driving around a race coarse at top speed... Crushing puny car's like nobodies business...  Unfortunately this game is fundamentally broken atm. The menus' don't funtion, the mouse seems to be disabled, and it's a hot mess...   This game is only 3.74 and has licened Monster Trucks.... it's nearly unplayable in it's current state, I'd say buy it anyway for the LOL's of owning a game that gets removed from the steam store... If you don't care about such things avoid buying this game like the plague.. The dev's have time to fix the issues though, so lets hope they get to it..",
            "review_score": "-1"
        },
        {
            "review_text": "A pretty underwhelming experience in every regard. The music can be okay, but that's about it. Floaty physics, laughable graphics and settings (Resolution is set as 'high') and seen before gameplay.   The lowest price on ITAD has it listed as $0.74, so it might be worth it then if you are desperate. Maybe.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible.  I bought this looking for some lighthearted monster truck fun, nothing too serious. What I found was a buggy, impossible to use, unfinished game that truly felt to me like someone's half finished term project from school. The UX design was atrocious, when the menus even worked at all, and there was no sign of controller support whatsoever. This game needs 3 months of solid dev work to get it finished and polished out to the point where it'd be worth money at all.",
            "review_score": "-1"
        },
        {
            "review_text": "This was an okay game at a cheap price, better than it's competition, I actually liked this game and gave it a mild recommendation and a positive video review, but unfortunately ODD Games decided to flush their reputation down the toilet by threatening a reviewer with legal action because he gave the game a negative review. Since that debacle, I have deleted my positive review and pulled that video from youtube. I can't support any dev that attempts to bully people into censorship. This could be the best game ever made and I'd still say don't buy it. What they did was unethical, and disgusting on many levels and it will likely cause their company far worse damage than that single negative review ever did.   Devs, it's simple, really, if you can't take criticism, don't make art or consumer products. And instead of going after negative reviews with legal action (that you can't actually take because that isn't how the law works) how about you reach out to the people that actually liked your game and try to build a community? You know, be positive and grow organically, instead of being toxic and unethical. Just a thought.",
            "review_score": "-1"
        },
        {
            "review_text": "This game destroyed my lif GG",
            "review_score": "-1"
        },
        {
            "review_text": "stoped euning ceap",
            "review_score": "-1"
        },
        {
            "review_text": "So bought this in a bundle for multiplayer... I have to say it doesn't work. Me and my cousin both selected 2 players, and it was stuck on 'searching for match' Tried playing the game for a brief while... It's awful. I feel ripped off still getting it in a bundle of 10 games for £1.39. That's how bad it is... Controls are awful... I started a championship game and well, I couldn't move!? For about 60 seconds. Had to restart it. Exited. Uninstalled.",
            "review_score": "-1"
        }
    ]
}