{
    "app_id": 324750,
    "name": "StuntMANIA Reloaded",
    "release_date": "2014-11-13",
    "developer": [
        "Sector3 Games"
    ],
    "publisher": [
        "Bigger Boat"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Racing"
    ],
    "tags": [
        "Racing",
        "Casual",
        "Adventure"
    ],
    "achievements": 20,
    "positive_ratings": 45,
    "negative_ratings": 36,
    "price": 3.99,
    "description": "StuntMANIA Reloaded is a fast paced 3D car stunt driving and exploration game, where you get to perform the most amazing tricks and stunts in some really cool environments.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/324750/header.jpg?t=1447363785",
    "minimum_requirements": "OS: Windows 7 Processor: i5 Memory: 2 GB RAM Graphics: Discreet Shader Model 3 Card DirectX: Version 9.0c Storage: 400 MB available space",
    "recommended_requirements": "OS: Windows 7 Processor: i7 Memory: 4 GB RAM Graphics: Discreet Shader Model 3 Card DirectX: Version 10 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "The Short Version: 7/10, but keep in mind this is a driving exploration game, not a racing game. You'll be disappointed if you expect Mario Cart. Think Spyro's hub worlds in a car, and graphics like the original Spyro.  Long Version: I'm two levels in and I have to say this game is exactly what I wanted. You drive an RC car around a large area collecting hidden things and doing tricks. I have a couple of complaints, however. Doing tricks doesn't seem to do anything but flash some text; It'd be nice if there were more motivation for me to rack up score or soemthing. There doesn't seem to be a functional difference between the cars, and they all cost one coin to unlock (you get a coin by finding three parts in a level.) So after you've found one coin you'll unlock the car you like and after that there's no incentive to unlock more. The graphics are pretty rudimentary, and in places you'll think you're playing a PS1 game.  Despite these issues, the game is still fun if you like exploring an area and collecting things in a vehicle. It brings back memories of playing Diddy Kong Racing and San Francisco Rush 2049's stunt mode, and is comparable to the drive-around-collect-stuff mode from Joyride Turbo on Xbox 360. I only wish this game's player investment system had gotten a bit more attention.",
            "review_score": "1"
        },
        {
            "review_text": "YAAAAAAAAYYYYYYYYYYY vroom spin kaboom crash explode WEEEEEEEEEEE!!!!  7/10  5 bucks - totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "its a waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "StuntMANIA is a really cool game! I really recomend it! The only let down is when you find all the coins in all the levels and unlock all the cars and game modes, the game seems pretty useless. But its still really fun!",
            "review_score": "1"
        },
        {
            "review_text": "its really good so get it",
            "review_score": "1"
        }
    ]
}