{
    "app_id": 324800,
    "name": "Shadow Warrior 2",
    "release_date": "2016-10-13",
    "developer": [
        "Flying Wild Hog"
    ],
    "publisher": [
        "Devolver Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Online Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Gore",
        "FPS"
    ],
    "achievements": 64,
    "positive_ratings": 10152,
    "negative_ratings": 1406,
    "price": 34.99,
    "description": "Shadow Warrior 2 is the stunning evolution of Flying Wild Hog’s offbeat first-person shooter starring the brash warrior Lo Wang, who must again wield a devastating combination of guns, blades, magic and wit to strike down the demonic legions overwhelming the world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/324800/header.jpg?t=1530549212",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7/8/8.1/10 x64 Processor: Intel Core i3-6300 (2 * 3800) or AMD A10-5800K APU (4 * 3800) or equivalent Memory: 8 GB RAM Graphics: GeForce GT 560Ti (1024 MB) or Radeon HD 6850 (1024 MB) or better Network: Broadband Internet connection Storage: 14 GB available space",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: Windows 7/8/8.1/10 x64 Processor: Intel Core i5-5675C (4 * 3100) or AMD A10-7850K APU (4 * 3700) or equivalent Memory: 8 GB RAM Graphics: GeForce GTX NVIDIA GeForce GTX 970 / ATI Radeon R9 290 with 4 GB of Video Memory (4096 MB) or Radeon HD 7970 (3072 MB) Network: Broadband Internet connection Storage: 14 GB available space",
    "reviews": [
        {
            "review_text": "TLDR: This game is great, there is so many solid reasons to give it a recommendation. The most important one being that this is literally a AAA game standard at a B game price. It still feels like a steal even if you buy it right now at full price.  Edit: Also, this game should be named game of the year by reviewers.  Before review, I'll talk about some of the critisim I saw in others' reviews:  1)  Poor graphics .  Seriously, do me a favor and just down-rate any review you see that complains about this. Just go compare the screenshots of this game from community hub with other games, even the triple-A games. This game has beautiful graphics comparable to other much more expensive titles. Not to say that this game is the pinnacle of gaming graphcis but there's very little to complain about if you're being honest with yourself.  2)  Frustrating inventory full of junk .  To be honest, inventory management aren't well designed and took about 10-15% of my gaming time. Do keep this in mind if you don't like to plan or look at fine prints of a game. You can play the game at a lower difficulty setting and completely ignore this portion of the game if you hate inventory management or looking through a list of available upgrades.  3)  Game difficulty .  The difficulty descriptions are detailed when starting new game so much so they even give the exact % increase in received damage, enemy HP and exp gained. But if you haven't started playing I highly recommend you to play this game near the highest difficulty level. Normal feels like easy and Hard doesn't feel hard. Insanity level 1 feels more like somewhere between normal and hard of a typical game. Keep this in mind when you start a new game. If you like a challenge just keep changing difficulty level to the highest one available based on your character level. Only at insanity level 4 did I feel like the game is at hard core mode of a typical game.  4)  Bad story . As most story and artisitic appreciation goes, this is very subjective. Shadow Warrior 2013 wins in terms of the raw feel it deliveries. In particular the humor and x factor if that's even a thing. And Shadow Warrior 2013 has a stronger ending. But due to all the added dimensions of the story in SW2 I feel that the story here is more rich and there's alot more lore building. There's alot of small notes you can find and collect and read when the game ends. Its nothing as ground breaking as Resident Evil's 'Fever gone but itchy. Hungry and eat doggy food. Itchy Itchy Scott came. Ugly face so killed him. Tasty.'. But to be fair they are interesting to read anyway. Oh and SW2 ending suck.  5)  Frustrating element system . There are 2 sets of element. If enemy is immune to poison, it is weak to electric and vise versa. If enemy is immune to fire, it is weak to ice and vise versa. Very simple mechanics and yet people feel it keeps them from enjoying the game. I feel its interesting and prevents gamers from bulldozing through the game mindlessly. So, I like it.  6)  Boring fetch quests . The quests actually adds abit of story and conversation between Lo Wang and NPCs so its not all boring. Honestly, you can literally rush through the level without fighting and finish the quest quite quickly. Problem solved. You know a complaint is stupid if its solution is one only sentence and doesn't require any sacrifice of any sort. Also, no idea why such a subjective opinion get repeated in the exact same phrasing so many times. Feels almost like its the same guy who bought many copies of the game just to lower the rating of this game to below 90%.  7)  Game gets old fast . Another stupid complaint. The game is actually very interesting due to high customizability to gamer's perferences. See point '8' of my review of this game below and you'll see why.   Before I go ahead and review this game, I'll just go right ahead and mention the following:  1)  Preorder discount .  You get 10% upfront for pre-order or 20% if you already own the previous game. I'll be lying if I said it didn't affect my impression of this game and their dev team and management. Doing so not only win fans' hearts, it also kinda shows how they're not here for the money. Also reminds me of some of the cool people I've met in my life who I wouldn't mind buying them drinks every once in awhile.  2)  Lack of bug and optimization issues .  Sounds like a weird thing to mention except when you look at recent releases like Mafia 3 and Dishonored 2 etc. Oh, and the not so recent Arkham Knight. I basically feel its quite shameless to release games in broken condition and it seems to be a common trend these days.  In short, looking beyond the game itself. These guys are a good bunch of fellows who did their job well and aren't here just to make money. Not say that they don't wish to profit, but obviously they don't do so by doing questionable things like selling out on people's trust in them.  Wow, I've already said so much about this game I'm feel sleepy. Anyway, here comes the review:  1) This game has a 89% rating. So, if you're not picky as hell there's a good chance you'll enjoy youself playing this game.  2) Good graphcis.  3) Fast pace awesome action game.  4)  Better than Doom 2016 .  Yup, your eyes aren't playing tricks. I'm going to go ahead and say that this game is so good that I feel that its better than Doom. Down rate this review if you disagree but this is how I feel honestly. From story to game design to environment design to just how the game generally feels.  5) Good story. But bad ending.  6) Good music. I mean like seriously good. But you may need the Deluxe Upgrade to enjoy it fully.  7) Good value for money. This is literally a AAA game at a B game price. Definitely must buy.  8) Notable improvements above Shadow Warrior 2013.  8a) Ammunition used to be insufficient at high difficulty due to high enemy HP. Less of an issue now. Basically you are not forced to use melee weapon at high difficulty levels.  8b) Interest factor. Getting new weapon, skill etc constantly allowed me to constantly enjoy the game in a new light.  8c) Customizability. You can spec your character to DPS Build (High Crit Change and Dmg Bonus), Tank Build (Dmg resist and HP), Invisibility High Dmg Build (Raw Damage without Crit), High Mobility Build etc etc. You can abuse the mechanics of the game in a very forcus specific way using upgrades and they are fun in their own way. Btw, high dps means you can hack and slash and make use of high DPS. Invis however means you have to hit enemies one hit at a time as invisibility bonnus damage only applies for one attack and then you will have to go invis again so Crit chance and damage doesn't apply with consistency here.  8d) Free Roam. I like how I can go back to stages I've completed before.  8e) I know how many people say its like Diablo or Borderlands but is that necessarily bad Subjective if you ask me.  8f) Also the elemental system. I think I find it fun. I like how I can poison and burn enemies to death, freeze or paralyse enemies with ice or electricity. I like especially how corpse of poisoned enemies explodes and poisons + damage other enemies near them. Fun to see a chain of explosions. Disagree if you like, then just ignore this point as an improvement.  8g) No need to find all secrets for achievement. I think you only need to find about 70-80% to unlock achievement which I think is much more reasonable than having to find them all.  9)  Photo Mode . I love how I can take photos of scenic views when I see one. Might even say the whole gaming experience feels like a vacation in Lo Wang's world.  10)  Co-op  Didn't actually try. Seems like there's a friendlist and a public mode.  So, to conclude just buy the game already. I'm sure its obvious that you will very likely enjoy it and find every dollar spent well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm all wang baby, I gots my chApperz toyz.  Running GTX 760 / 16gb / AMD 8370 / SSD - 70-80fps (some drops in areas but patch mite fix) Runs smooth on ultra/high some medium settings no screen tearing with v-sync off looks amazing  So far I'm having a blast, I'm playing game mode no pain no gain. I recommend if you like fast paste FPS F-ing badas. The Humor is top notch I find my self giggling to much. Plus the gore its satisfying. Weapons feel great to use. RPG element works great so far.",
            "review_score": "1"
        },
        {
            "review_text": "Best game about massacre at last years.  Convenient control, dynamic gameplay. A lot of blood, and perfect sound of blasted watermelon and broken glass. And also branded jokes by Lo Wang.  I will re-play on highest difficulty.  Who wants some Wang?",
            "review_score": "1"
        },
        {
            "review_text": "(updated)  I liked the 2013 Shadow Warrior a lot. I think this game is just as good, if not a little bit better.  Possible Spoilers:  Pros:  - LOT of new weapons. I stopped counting after 20. - Duel wielding for a lot of weapons. - Duel wielding katanas! (I feel just like Deadpool!) - Nice game play. - Same old smart mouth Wang. - Stan Bush intro! - The game doesn't strip everything away from you that you earned in Shadow Warrior. You get to keep your chi powers (to an extent). Weapons, clearly, are reset, but you get a lot. - New enemies.  - Old enemies with improved graphics! - I believe that Lo Wang has schizophrenia! - The in-game descriptions of things are still just as funny. - A lot of the old characters make an appearance.  - Hoji's grave. - Remember the giant horse-eagle armored guy you had to fight? You get to see his armor again! Also, he's in the story.  - The story is pretty good. Not as simple as: 'get a sword. Get another sword. Get a third sword. Fight and try to kill former boss. Watch friend die. Kill friend's ♥♥♥♥♥♥ brother.'  Meh: It reminds me of Dragon Age 2 with how you have a base to return to that kinda serves as an HQ. But unlike Dragon Age 2, it doesn't SUCK. At all.   Cons: - The cutscenes are a bit janky. You start out in one spot then warp over to another. They didn't attempt to make them smooth like the last game. - It feels like everyone betrays you in this game! The only person I'm loyal to is the little voice inside my head... Kinda like in the 2013 Shadow Warrior actually... I can only take so many betrayals before it starts to feel like Knights of the Old Republic 2: The Sith Lords with Darth Traya is running the show.  This is a good game. As of this review, I would highly suggest it. So far, I think it's better than the 2013 version they did.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Borderlands....but better since you don't have to give money to Randy Pitchford.",
            "review_score": "1"
        },
        {
            "review_text": "Gratuitous amounts of Wang 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "  It's like if DOOM, Dying Light, and Borderlands adopted a baby of unknown Asian descent.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best games of the year so far and not just this year, but in general! The content you get in this game is just mind-blowing, you have semi-open-world game in style of wolfenstein 2009, but this game pulls it off 10 times better! You have so many options of playing, you can play it as an epic cyber ninja or as some RPG Diablo-style game in first person! You get a lot of areas with most of them feeling a lot of 80s(my personal favorite era of all time), the player can take different upgrade items for almost everything - weapons, armors, coop experience, powers... The soundtrack is just mind-blowing and I have yet to get to the gold stan bush - warrior song! I do recommend this game to everyone who loves - 80s, hectic action, guns blazing, chaos, tribute to the 80s and gamers in general even if you are not fans of the first person shooter genre!",
            "review_score": "1"
        },
        {
            "review_text": "Even more blood and explosions. Was not dissapointed.",
            "review_score": "1"
        },
        {
            "review_text": "Congrats to the developers for creating such an amazing game with loads of different elements. For anyone looking to buy this game I definetly recommend it. On ultra textures the game looks amazing. The sounds are amazing and the little puns are actually quite funny to the easily humoured minds. The only thing I would say is a down point is the character visuals as the woman isn't very detailed in custscenes, however that doesn't matter at all. The weapon variety is amazing and it's so fun to chainsaw some enemies down then fire the grenade launcher at the boss you're frantically trying to run away from to heal.   Gameplay - 10/10  Sounds - 10/10  Characters - 8/10  Overall - 9/10 BUY IT IF YOURE CONSIDERING  EDIT: Just completed the game. This game has lived up to my expectations and the first impressions it created for me have stuck thoughout the whole entire duration of the game. A twisting plot, interesting characters, a bad ♥♥♥ collection of weapons and loads more to be enjoyed. I'm now going to do New Game + and try and find all the secrets and hidden items which are in the game. Ive also nominated this game for one of the first steam awards which they're doing, Thanks for reading!",
            "review_score": "1"
        },
        {
            "review_text": "They took Shadow Warrior, slapped randomized items and weapon improvements on it and made a game out of it that. And you know what? It is tons more fun than Borderlands ever was. You are agile, you can double jump, you can dash. That is how shooters are supposed to be. Melee is also a lot better than in the first game.   The game itself also runs smooth as butter on my PC:  i5 6600K Nitro+ RX480 8GB 8 GB DDR4 RAM 3000 Mhz  80-120 FPS at all times on Ultra Spec, no dips below 60 at all. And it looks amazing. The only criticism I have is that the city parts have waaaay too much bloom. I wish they would tone that down a bit.  All in all, GOTY!",
            "review_score": "1"
        },
        {
            "review_text": "The game looks pretty good, fightings are amazing, just like old times! There's no much difference between SW and SW2, and there's no need for it. The changes are that game is more coop oriented now: inventory, lots of weapons and upgrades, DPS, weapon's levels, sorts of damage, kill-drop system e.t.c. So it's looks like Borderlands, Dead Island or something for me.     Features i'd like to introduce      Swords    Short blades    Light weaponry (pistols)    Medium weaponry (SMGs / Rifles)    Shotguns    Heavy weaponry (!)    Grenade launchers (!)    Artillery weaponry (nail gun, gauss)    Special weaponry (chainsaw)    Fire, Poison, Electrecity, Ice elements.    Weapon upgrades    Skill upgrades    4 enemy fractions    Lots of lore and wangopedia    Good level's design    Good optimisation    Good humor    Sick drama  ",
            "review_score": "1"
        },
        {
            "review_text": "Plenty of Wangling with Wanguns to get sWang. Easy to get tWangled up with Wanglers. Quite Wangly the tWangiest Wangan, tWangle. Don't be a tWanger, come get some tWangs!  WangDate 9th DeWanger   Wang DLC Wanglleges free! More Wangled parts than Dr Wanglestein, who got Wang phW from Wangley! Don't Wangt to Wang a Wanger and be a Wangker but Wangley Wang got to Wang, Wanga Wangathon with some Wangs. Wang Out!  W.s bWang Wangrey Wang Wang Wangin, Wang it Wang Wang, Wang Wangin, Wang Wang Wang Wangin Wang. Wangiously, So many Wangpuns in this Wang, Wangsaws, Wangords, Dwanging Dwanguns.",
            "review_score": "1"
        },
        {
            "review_text": "Really first optimized game on PC in 2016",
            "review_score": "1"
        },
        {
            "review_text": "Everybody Wang Chung tonight.",
            "review_score": "1"
        },
        {
            "review_text": "Ultra settings by default! It doesnt get better than that. Plus more guns, more jokes, more fortune cookies, more gore, more players, and most of all, more Wang. Shadow Warrior 2 is easily the best FPS of the year.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "wait... no season pass ? this game actually works ? high fps ? and it's fun to play ?? ..... (in 2016)......   this can't be real",
            "review_score": "1"
        },
        {
            "review_text": "The Wang we Deserve :D",
            "review_score": "1"
        },
        {
            "review_text": "  When you're mad AF just play this game until you calm down. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Plenty of ♥♥♥♥ jokes for everyone!  Basically, a better, more mobile borderlands. If it was not for Doom 4, this would probably be the most satisfying shooter of 2016.   BUT this is not just a regular shooter, like in borderlands, they added a diablolike LOOT COLLECTION, but unlike borderlands, it is not quite ♥♥♥♥ since what you will be getting for the most part if 'gems' that you can insert into your weapons to alter their behavior, add elemental affixes, or extra effects (including a very nice one that lets you turn a weapon into a static turret), so all your weapons have uses and you can customize them to it your playstyle. Much better than the way Borderlands drops a million useless guns, and the enemies all are ♥♥♥♥♥♥♥ bullet sponges.  Doom 2016 was focused, this is... Not as focused but it is still sharp as heck.  Also, kill all the bunnies you can see in the game, you will not regret that action.",
            "review_score": "1"
        },
        {
            "review_text": "I get to brutally gore people with a giant ♥♥♥♥♥, what's not to love.",
            "review_score": "1"
        },
        {
            "review_text": "The sleeper hit of 2016.  this is what happens when you release a game on PC only, or at least on PC first. well optimized. actual graphical settings that are for PC. so sick of ♥♥♥♥♥♥ console ports that we PC gamers are getting this year.   but the biggest thing that surpise me is graphics.  it won't set the benchmark, but it's really good. and I'm running it on GTX1080 and I can't get 60 fps on 4k this is a proper PC game. and they acutally made it so you can run as good as you hardware can handle.  this isn't just a game that acts as a reboot to the 90s game. but it can actually hold its ground to other modern games. much like DOOM this is another excellent revival of a classic game the perfect blend of modern and classic mechanics hell, I'll just say it. this game is better than DOOM. while DOOM is also very good and my personal favorite. it's only the classic DOOM we all love with new 2016 graphics. it doesn't bring anything new to the table but shadow warrior 2 is more ambitious in that department  Shadaw warriors 2 have: - weapon variety. you think they're only weapon skins but they have speical effects bond to a specific weapon so it's a new weapon entirely  - actually challenging gameplay. tired of moderns game being so easy even on hardest difficulty settings? play this game ,crank it up to the most difficult setting. aim assist off. you're in for a challenge.   - borderland style loot. this one is a hit or miss. peronally I'm ok with it. only complain is you have to read a lot of stats when you just want to get to the action. if you have short attention span like me. you may hate it . Lol  - did I mention this game is well optimized and a must have for PC gamers? when's the last time you played a game that's not a mess on launch day and please the PC gamers?  10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't followed the Shadow Warrior series very much. I didn't play the last game (the demo didn't impress me too much), and I had not played the original DOS game either, so I was coming into this with no real expectations (other than a certainty that this couldnt be as fast and smooth as the recent DOOM).   Well, suffice to say, Shadow Warrior 2 has proven to be a pleasant surprise indeed.   A lot of people are comparing this game to Borderlands, Diablo and even the aformentioned DOOM reboot. Personally, I think a better comparision would be Star Wars Jedi Knight: Dark Forces 2. Like that game, you'll be fighting with three primary toolkits; magic (called Chi here), guns and melee weapons. Also like Dark Forces 2, melee combat uses movement combinations to dictate the type of attack you unless (though it is far more advanced here). Add to this the sprawling and often vertical design to the levels , its hard to think of this as anything short of a spiritual successor to that Lucas Arts classic.  Where this game does differ from Dark Forces is in its speed and violence. This game is FAST, rivaling (and occassionally suprassing) the pace of DOOM 2016. Combat is so hectic that you'll end up resorting to button mashing in a panic for the first few levels. This works for a while, just long enough to make you doubt the depth and quality of the games systems, but after a few missions, you'll gain a deeper understanding of how to control both your movement and sword to unleash more deliberate attacks and manouvers. Just in time too, because button mashing absolutly stops being viable once the training wheels are off, and the enemy numbers start going through the roof (and the levels get bigger).   Once you get the hang of it and have upgraded both your Chi and arsenal, each battle turns into a strangely ordered chaos. Particles fire off every which way as you leap, zip and slash your way into the hordes of monstrosities. The pace and flavor of these fights almost makes you feel like you're starring in your very own action anime', amidst some fantastic environments that range from neo-tokyo style dystopias to warped japanese villages. However, for how beautiful these areas look, they are also where the game starts to stumble.   The game is supposed to have semi-proceduraly generated levels, though I couldn't tell you if it had any real effect. Areas are very clearly recycled multiple times over, leading to each zone eventually feeling inconsequential. The game itself is still so much fun that this becomes little more than a small annoyance, but it is one I do hope the devs will address either with patches or expansions/ DLC's. Less easy to ignore is the use of invisible walls and clunky nature of the mantling system. To put it bluntly; as much fun as dashing and jumping is, it is NOT as smooth and cleanly executed as in DOOM. Several times I'd try to catch onto a rooftop that was well within range, to no avail. Some roofs would keep pushing me off as if I had hit an invisible border, and at least once I managed to walk on top of a level because I had jumped over some invisible barrier. Granted, this last one only happened once, but the fact that it was possible at all is somewhat odd.   Speaking of bugs; there was also a funny instance where a boss battle had began, but I had accidently back peddled too far back before the lockdown door could close, thus creating an impassible barrier between the enemy and myself, leaving us to awkwardly stare at the door and get nowhere.    Those are about the only real issues I had though. The plot- such as it is- is okay, niether great nor awful. It's chuckle worthy now and again, with a couple of laugh out loud segments, but the meat of the game is in the fights, not its dialogue or plot. Speaking of which; some reviewers online have complained about the humour being overly juvinile and falling flat. I myself am not generally a fan of crass humor, but I didn't find anything so off putting here. Many people have commented that the central joke is '♥♥♥♥♥', but honestly, I felt more like the joke was that Lo Wang isnt as funny as he thinks he is. Certainly, the characters he's surrounded by are only barely tollerating his antics, which more often than not does make for some funny scenes.   Anyhow, all in all; Shadow Warrior 2 was a TON of fun. If you're coming from DOOM, this is an obvious next step. If you were a fan of Jedi Knight: Dark Forces 2, this should be a no-brainer.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS ♥♥♥♥♥♥♥ ING AWESOME!!!!!!   Seriously, this game is really amazing. 2 min in to the starting cutscene and im already laughing my ♥♥♥ off. This game does have some differences from the first, but they are good changes (the new controls take a bit to get used to). Humor is spot on and reminds me of the firsts while still being unique. There is also more gore in this compared to the first, you can keep slahing bodies to your hearts content. I highly recommend this game.  10 Wangs/10 Evisorated Demons",
            "review_score": "1"
        },
        {
            "review_text": "This is pretty much the easiest review I'll ever write. Poland just did it again. This is a perfect game. The price of 33€ for a brand new game that runs smooth as f_ck while having sweet graphics and brings full multiplayer/coop support with tons of content. The perfect example how a PC game should look like. I bought it without even reading something about it because i played the 2013 version and the classics. The RPG mechanics and gameplay fit like a glove to what the 2013 version has done right. Support the developers. This is one rare well polished gem between all the rusty scrap people call 'games'.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games ive played in a long time!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "♥ Humor ♥ Action-packed / Fast-paced ♥ Huge campaign ♥ Cooperative Campaign  A must-have for every egoshooter/action-loving fan!",
            "review_score": "1"
        },
        {
            "review_text": "Intensive full speed gorefest with lots of weapons, just buy it and give them some Wang.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredibly fun. It's fun alone or with friends, if you like Borderlands you should really try this game, You get awesome loot when you slay mobs/bosses and you can craft stuff, put gems on your weapons and stuff like that so it's kind of similar to borderlands in that way.  Heads up, DO NOT play this game on the easiest difficulty, it's waay too easy and its no fun at all, medium maybe, but I would recommend HARD difficulty for sure (IMO the most fun).  Stunning graphics and hardly any fps drops at all on ULTRA, alot of graphic options which is great. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "- Review written at the state of the game on the 23rd of October 2016. -  Fun, lots of fun, but a little easy and unpolished, and gets repetitive.   Not a lot of replay value.   If you'd like a game thats a bit of a throwback to the old Duke Nukem/Doom style 90's shoot-em-ups, this game has a lot of oldschool play feel (I can't remember the last time I pushed up to #8 to change weapons?!)   = The Good =  - Fast fun, energetic action play - Quippy funny dialogue (if you have a 13 year old male sense of humour like me, otherwise you'll hate it) - Interesting levels that each have a different feel to them (until you find you've played the same one 3 times with a slightly different objective) - Cool weapons, and the ability to slot upgrades into them (until you realise they didn't really put that much effort into the upgrade system and its fairly randomised) - Decent melee combat (whole game with melee challenge anyone?) - Interesting story and characters  = The Bad = - After the first two hours of play you'll start to realise that the game is actually fairly repetitive in its playstyle.  - The minimap makes the game TOO EASY. It could have been interesting if I had to find my way through levels but you just follow the little 'auto direction' thingy in the map and you get to your objective. So you don't really explore the level at all, and a lot of work was put into the design if you look at them.  - Even if you had to search for loot- the loot system doesn't really reward exploration anyway. Loot drops in level seem completely randomised If they had specific hidden upgrades you had to search for that gave unique rewards, exploring the level would be much more interesting. - Your shift key will be mashed to bits. The 'dash' aspect makes the game way too easy. You can kite enemies forever, until you run out of space to run into, which is never. Get hurt, press shift a few times and run away, heal up off chi, return and fight. Repeat. I heard there used to be a limit to how often you could use it like an endurance bar, what happened to that? - Although the melee system is fun, having 3 special attacks in a way is a bit limiting. Some sort of fancy WASD combos with slashes could have made it a bit more interesting. Parrying is somewhat worthless. - Enemies have no weak points, you just shoot/slash at them till they die, doesn't matter if you hit them head foot or whatever, doesn't matter, there's no damage different. Same for bosses.   Summary -  - After 15 hours, I finished the game on the second most hardest difficulty. I think i died about 5 times, but you become way too strong for the enemies toward the end of the game. It really becomes more about how much fun you can have killing them.  - No intention to play further, there's no point. I don't think I'll gain anything by doing it in the hardest mode. There's nothing more to do in it, I did multiplayer for a bit with my friends, but it's the same thing, just more enemies.   Can only recommend if you want to pay the price for about 15 hours worth of play. Overall, it's fun. But I don't care about the money to afford it that much, however, you might not want to shell out for it.",
            "review_score": "1"
        },
        {
            "review_text": "After 15 hours and doing all the sidequests, I gotta say I had alot of fun. The loot shooter aspect was alright but I would have taken a more straight foward approach like Doom did. Great shooting, feels real good, just hope they go back to the basics in the next one.",
            "review_score": "1"
        },
        {
            "review_text": "This entire game is just fun. I've played a lot of Serious Sam as a kid and this is exactly what it reminds me of, just with better humor.  This game really blew away my expectations  WELL ♥♥♥♥ING DONE M8",
            "review_score": "1"
        },
        {
            "review_text": "WANGTASTIC!!  It's like Shadow Warrior+Doom+Borderland with more chopchopchop. Well, I don't quite like Borderland, especially the looting system, but I like Doom and Shadow Warrior, and I like Shadow Warrior more than Doom. So anyway, WANGTASTIC!!   8/10",
            "review_score": "1"
        },
        {
            "review_text": "Excellent meat grinder, helps to relax after a hard day at work, just sit down and chop demons heads, with classic Wang jokes  And What's brown and sticky.... ?",
            "review_score": "1"
        },
        {
            "review_text": "Only having played an hour, I can already tell that this is an absolute masterpiece. 10/10 from top to bottom. Gameplay is amazing, the voice acting and the humor in this title are nothing short of superb, and this is overall one of the best game I've played in quite some time. A must own!",
            "review_score": "1"
        },
        {
            "review_text": "Normally I make excellent long reviews (Just look at my profile), but I got no time here. Buy it, it's probably the best shooter gamer for 2016. I try to make it as long as possible:  PROs: - Loot - Excelent gore system - RPG - Free Roam - Procedural Generation - Feel like the most badass guy ever - Excelent Puns and Jokes - and, and, and..  CONs: - No cons, get it already!  Sorry that's it, I gotta chop more Wangs off, this game is so addicting..!",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly fun and very funny. Very similar to Borderlands gameplay - Kill stuff, loot, quest, rinse &amp; repeat on a new difficulty.  The protagonist's dialogue is without a doubt one of the most hilariously-written scripts I've played in 30 years. I've lost count of the number of games that try to be funny but fall cringingly short. Shadow Warrior 2 doesn't just hit the mark, it gives it a middle finger.  Pros:    Extremely funny    Excellent shoot-em-up gameplay    Engaging quests and cutscenes   Cons:    Multiplayer feels tacked-on. No chat. No voice. No way to kick troublesome/AFK players as the host, and only one way to filter the dozens or even hundreds of games in the server browser - difficulty. No 'ping' visibility, which means many joined games are brutally laggy to the point of being unplayable.     Only one 'class' - the protagonist himself, although amulets, gems, and skills provide for at least 2 major classes - Melee or Ranged. To a lesser degree, minor sub-classes are possible with very specific gems and skills - Healer and Tank. A coop gem allows for a heal aura or 'direct damage' healing, and a tank would just stock up on damage resist and health. This is only recommended for coordinated teams, though, since going any route other than pure DPS will take its toll in singleplayer.    Somewhat useless 'crafting' system - combine 3 gems into a better gem. Catch is, the new gem is still random stats, so you're probably better of just selling the original 3 gems.  ",
            "review_score": "1"
        },
        {
            "review_text": "Dig it.  This is a solid B game, and I think most would agree that the overwhelming positive reviews here don't reflect an A++ game but are more like RottenTomatoes - thumbs up or thumbs down. And in that sense, I totally recommend this B action movie game (even B+).  I think I'd be hard pressed at $60, but at $39.99 MSRP this is a GREAT time. Brainless, super fast paced action that I sometimes/often miss when playing a brilliantly crafted A++ story game. Here, the action never lets up if you don't want it to, you can skip every cutscene and just blast through and hyperspeed shooting stuff. That's awesome, and sometimes it's exactly what you want.  Brilliant performance, fully customize-able, PC only optimization, so far bug free, fast paced, great looking, reasinably priced. What more do you want really? It's basically a Shadow Warrior rendition of Borderlands that harkens back to the good old days when games were simple and easy to pick up and play in short bursts - and I'm all good with that. Nay, I'm more than good with that. If that sounds up your alley, pick it up. If you want a more methodical, nuanced gameplay experience with custom crafted world and a gripping story, look elsewhere... but otherwise...  FUN.",
            "review_score": "1"
        },
        {
            "review_text": "Already my Game of the Year. +Replayability +Good graphics +A lot of action +Co-Op +Many types of enemies +Game mechanics not so complicated to adapt +Many skills and weapons  I give it a 9.5/10. (Due to nostalgia) 8.5/10 (as being realistic)  I recommend it a lot if you are a fan of the classic Shadow Warrior, if not you might need to adapt to the way of the Wang.   ",
            "review_score": "1"
        },
        {
            "review_text": "i have been looking for a good game for awhile now.... THIS GAME ROCKS the trailers and reviews on youtube do not even come close to doing this game justice  positives graphics+video combat story line DID i say combat...because wow i laughed i cried i clutched  negatives  orb currency needs better drop rates orbs need to be a buyable thing in steam market 100-200+ on some weapons and 3 per trial lagged twice for a few momets (could be pc related)  HANDS DOWN BUY THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "Open-world gore-fest that feels like a beautiful mix of Borderlands 2, DOOM, and Serious Sam.    + Beautiful graphics, filled with colour and detail + Full graphics menu that lets you control DoF, Chromatic Abberation, Film Grain, etc. + Insanely well optimised - runs at 120+fps on my 980 Ti (2560x1440) on Ultra + Great gore, with full dynamic dismemberment and sword control + Tons of customization and an addictive loot system + Lots of humour. None of the characters take themselves seriously, and often reference internet memes, wang jokes, or pop culture references. Makes things a little more interesting. + Huge variety of weapons: bows, shotguns, swords, nailguns, grenade launchers, etc. + Seems very stable so far, not a single crash or glitch.",
            "review_score": "1"
        },
        {
            "review_text": "This game was my most anticipated title of the year. The first one blew me away, and I couldn't believe it didn't get more attention for being so visually spectacular and fun (first person melee combat is rarely good or visceral in the way that SW2013 is). The sequel is good, but they throw out the linear story-based game with a simple ability/weapon upgrade system in favor of a mission-based shooter that feels more like Borderlands than anything else. Wang is still funny, the environments and shadows still look best in class, and the gun and swordplay are still super satisfying, but the pacing is wrong. Stopping to loot, and spending a lot of time in menus modifying weapons and equipping new ones feels more monotonous than it should, and turns it into something more reminiscent of Borderlands than SW2013. They might've gone too far in a few places, here.  Seems like a lot of people had the same issues. I kind of wish they had just stuck to their guns and given us more of the same type of game the 2013 version was. You can see what FWH was going for pretty clearly; they wanted to include a ton of weapon variation that the 2013 system just wouldn't have allowed for (that game played more like an old school shooter where there's x # of total guns and once you have them all that's it). Including claws or dual swords wouldn't have been easy to do unless they were purely a cosmetic change. But the benefits of having a bunch of extra weapons were outweighed in my opinion by the tedium of equipping and socketing them.  The last problem I had with the game was the sidekick character. Kamiko just doesn't have the same impact or rapport with Wang/the player that Hoji did. Hoji's story in the 2013 game was surprisingly poignant, and by the end of a game that was supposed to be about murdering the ♥♥♥♥ out of demons as a man whose name is a euphemism for ♥♥♥♥♥ shouting puns about it every few minutes, I was actually emotionally invested. Hoji was a friend. Kamiko clearly detests Wang until like, 2 or 3 missions from the end, when she kind of has a make-or-break moment of 'oh ♥♥♥♥, this guy holds my fate in his hands I need to stop being such a ♥♥♥♥ to him.' It's abrupt, it doesn't work for me, and I didn't care about her at all.   Shadow Warrior 2 is still worth a look to anyone interested. Even with all the flaws, the gunplay and visuals are so good I still rate it an 8/10 at least. But I would highly recommend newcomers trying the 2013 game first. It's a better, more compact experience, and regularly goes on sale for like $5. The writing is better in that game and doesn't try so hard to recapture bottled lightning.",
            "review_score": "1"
        },
        {
            "review_text": "My best Pre-order so far!  More weapons? Check More blood? Check Coop? Check More trash talking and inappropriate humor? Check A chick quarreling with you in your head? Check  This is ♥♥♥♥ing awesome! WHO WANT SOME WANG?",
            "review_score": "1"
        },
        {
            "review_text": "This game is freaking amazing. I was expecting just a simple action melee shooter, but the fact they added RPG elements and online play is freaking amazing.",
            "review_score": "1"
        },
        {
            "review_text": "It is fast it is brutal it looks beautiful. Thats all I need. Still you get a bit more. Loot, NG+, Skills to unlock... I wouldn't even need that for the game to be awesome but its nicely done here and fun. But oh dear the chainsaws and chainswords! Most fun I ever had! IN MY LIFE!",
            "review_score": "1"
        },
        {
            "review_text": "If you like Borderlands, Diablo, Serious Sam, Doom, you'll love Shadow Warrior 2.",
            "review_score": "1"
        },
        {
            "review_text": "Turned out to be a disappointment, given all the good reviews. The main character is funny but dialogues are a tiny piece of this game. As of now (Nov 2016) it is quite buggy and suffers from drastic fps drops up to 1FPS, mouse clicks are not always detected in the menu and dialogue windows. It's an OK game that should cost £15. 6.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "Probably the best old school FPS I've played in a long time. The mixed RPG elements work well for the most part, adding a lot of variety while still staying true to the original (e.g not becoming a grind fest). Very large selection of satisfying weapons that's entirely customizable to your liking with different element/ammo/fire mode/whatever mods. Toxic shotguns, fire chainsaws, freezing dual blades etc all possible, pick whatever you like. There's also lots more unique chi powers compared to the first game, and new movement abilities, letting you kite enemies a lot easier (kinda reminds me of Painkiller for some reason as I was always bunnyhopping there, now I just fly around :P).   The levels are absolutely huge and fun to explore, and sometimes look pretty gorgeous as well. Open-ended approach to missions is cool too so you can do everything in your own order. The game ran okay on high-medium settings with my specs (960M GTX, i5 6300HQ).  Downsides? It starts off really cheap, the first mission didn't really sell me the game at all, but thankfully it opens up from there pretty quick. Compared to the first game, the plot is probably a lot weaker as well, or at least I felt that way at the start, and secrets aren't as present as in the first one. The upgrade system is a bit too overwhelming as well and should be toned down, you get too many powerups all the time and it's a lot to manage (not a biggie for me though).  Once the game opens up properly a few missions later though, it gets really fun. I'd really like to see SS4 made in a similar style as it feels very innovative.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 from me After the patch everything is working (I couldn't launch it earlier)  I'm not the mmo/loot player so I've totally skipped it. :D Few weapons and dash is all I need",
            "review_score": "1"
        },
        {
            "review_text": "'Two wangs are better than one.' - Lo Wang",
            "review_score": "1"
        },
        {
            "review_text": "This is the Great Japan Stereotype game ever. xD  Good points:  ・Stylish combat movement.(Dodge action, Katana style and skills, some badass fire weapons.)  ・Funny incorrect japanese words and culture.  ・Beautiful Graphics.  ・Good setting options. (actually it's so attentive to me like Japanese people.)  Good game :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is hard to write a review for. It is in the end a game like Borderlands 2 which some people greatly enjoy and I sadly do not. So for all ends and purposes if you love the Borderlands games then give this a go.  The reason I am giving this game a thumbs down is that I am a big fan of the first game and me and my friends wished for a coop version of the same game. And boy did we get excited when news of Shadow Warrior 2 dropped with coop mode! Sadly the tacked on quest system, loot and semi-open world additions did not do the game favours. One reason the first game was so fun was that it was a linear and well-designed experience with a good balance of introducing new weapons and enemies, scaling the difficulty along the way.  The ambitions of adding hyped upped features like the loot and random spawns propably turned some fans and players off this game. It propably attracted alot others so that's good. Me and my friends who were looking for a tightly designed fps with coop features were sadly turned down.  I will return if they add an arcade mode throwing the loot, open world and randomness out the window.  TLDR: Great game if you are a fan of Borderlands/Dead Island. If you were hoping for DOOM 2016 with friends and swords then give this a pass.",
            "review_score": "-1"
        },
        {
            "review_text": "I've beat the game 3 times. First time on 2nd difficulty took 9 hours, second time on last difficulty took 5 hours and third time was on easiest difficulty took 1 hour. (was rushing) Let's just say I'm still not done with the game.",
            "review_score": "1"
        },
        {
            "review_text": "One good Wang deserves another. I guess that was the reason this 'Sequel' was made...  Loving it so far  Great price, great fun.  I cant help but thinking as I played that the devs were heavily inspired by Borderlands 2 gameplay. This is a good thing imo. I loved how borderlands 2 played. This game looks nothing like BL2, but the mechanics, the layout, and the gameplay have a lot of strong similarities. (4 person co-op, the way enemies are designed, the way loot works, the central 'Town' hub, etc etc).  I honestly wish there were more co-op games like this.   Cant wait to play more.",
            "review_score": "1"
        },
        {
            "review_text": "Basicly borderlands 2 in a new setting with smooth gameplay and corny story, skipped most of the cutscenes. Still fun and worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "A cheap game with a gameplay extremely satisfying, a lot of customisable weapons, a huge bestiary, coop, and much more!    Originally posted by  Statue of Fortune :",
            "review_score": "1"
        },
        {
            "review_text": "anyone can find reviews out there highlighting this game's postives/negatives. i'm going to be quick about it and say just reference those or the worthabuy guy. this game is definitely worth your money if you're thinking about buying.  i am going to talk a little about how i think the sequel stacks up to the first one. while i still recommend shadow warrior 2 to just about anyone, i liked the first one better as a single player experience. it was simpler, the story was much better, and i really enjoyed the grading system at every encounter. it was also a lot more challenging on its own without having to mess with the game after launch.  with shadow warrior 2, we lost the grading system, and the storytelling is inferior. we got better combat, graphics (of course), and audio in the sequel. we also got loot and deeper progression but some of the original remake was lost when they put emphasis on progression and multiplayer in shadow warrior 2. for me, the singleplayer experience started strong but went downhill during the last half of the game. i felt almost every aspect of the game became repetitive and i was just playing to wrap up the campaign. others might have felt that last half was a great time to get loot and level up, but i didn't buy shadow warrior 2 simply to progress my wang.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay here is great. It's just a fun game to play. The story and character development isn't all that great, but I still find myself coming back to kill some badies even after beating the game.",
            "review_score": "1"
        },
        {
            "review_text": "Best Optimization game of 2016 beside Doom... Flying Wild Hog definitely brings up a refreshment in First person genre with fluid swordplay and awesome gunfight.. The game looks freakin beautiful even when i play it on my older system (i5+GTX 780 ) But the game is not without a flaw... ex : There are not enough Variation to do In multiplayer mode beside repeating mission that u have already done or just free roaming, also in free roam mode sometimes it just hard to find enemies and last but not least there is no Visual Modification in equipment (it's really important for the Visual Modification on gear when the biggest aspect of the game is looting and grinding for replayability)... so i really hope in the future DLC/Expansion Flying wild hog would add somekind of horde mode or any kind of mode that differs from the main story and allow player to enhance their equipment in an interesting way...",
            "review_score": "1"
        },
        {
            "review_text": "The character dialogue is amazing, I previewed the game at PAX this year, and was impressed then, but just played a couple of minutes today for the first time since I bought it, and was clearly reminded of why it is so amazing. No regrets!",
            "review_score": "1"
        },
        {
            "review_text": "This game is nice, i played the old version and rebooted 2013 and it's still same wang and wang still have the joke, but i feel kinda the joke is not enough and the ENDING, well what i can say about it, it just kinnda dissapointing",
            "review_score": "1"
        },
        {
            "review_text": "Some of the most fun I've had playing a video game in a long time. Just pure goodness. Graphics, controls and 'most' of the dialogue are just wonderful. I love me some WANG! Lo Wang that is.  UPDATE: Just finished first play through on the hardest difficulty at the time. Was fantastic all the way through and honestly longer than i expected. Started a new game + and still very much enjoying it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is kinda disappointment - as sequel. Its VERY different from first (reboot) SW. Yet its somehow awesome. Maps/enemies has touch of Diablo, gameplay is like fully weaponized Genji (Overwatch) and loot reminiscent Borderlands in little different way - instead of loads of weapons, thers loads of gems that can be inserted to weapons so at he end, effect is very similar (+amulets/armor enchants). On top of that, theres still alot of skills (RPG progress) to shape your gameplay to yor liking.  All in all, THE BEST SPENT 30€ IN YEARS.",
            "review_score": "1"
        },
        {
            "review_text": "Don't listen to the negative reviews. This game is brilliant. If you like Borderlands you'll like this. My only criticism of the game is that it's too short.  Well worth the £35, not like the stream of games recently that charge a premium and turn out either to be complete pants, unfinished, badly optimised or just simply not what the developer promised.  The loot system can be a bit annoying in terms of inventory management as you find loads of upgrade crystals and it can get a tad tedious sorting through them all and either selling or combining the ones you want to keep. The weapons are awesome as other people say each feels unique and there are about 70 altogether.  Basically I'm having a blast playing this game so buy it. I hope it gets some DLC, hell, even a new game plus mode would be awesome where you get to keep all your stuff.  One more thing the game opens up with Stan Bush's 'You Got The Touch' from the Transformers The Movie, nuff said!",
            "review_score": "1"
        },
        {
            "review_text": "I'm about half way through the story, which i just skipped over the entire time. You'll probably want to do the same, because it is done very poorly. But, that is totally fine, because the combat is the best I have ever played in a video game. I'd say you will probably get about 20-30 hours out of this game before it starts to get boring. but that is okay in my opinion for the price.  If you like fps games, this is a must buy. Best fps of 2016 without a doubt.",
            "review_score": "1"
        },
        {
            "review_text": "Another great modern reboot done right like Doom.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, the main character is trolling ♥♥♥♥♥♥♥♥, and I love it, and the swordsmanship aspect of the game is my favorite, killed several hundred mutants, demons and cyborgs with a sword and never shot anyone with a gun, but there are tons of guns to choose from and spells too. This game gives you a choice of what to use to kill, almost anyone will find there favorite toy to cause a massacre.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty frustrating at first for the lack of proper weapons and upgrades but after a couple of missions the game starts to pick up and becomes awesome. This is pretty good to pick up if you like fast paced FPS with some RPG elements like skills, weapons upgrade and loot.",
            "review_score": "1"
        },
        {
            "review_text": "The movement speed of Shadow Warrior + the loot drops of Borderlands/Diablo + open areas to explore and kill enemies in = one hell of a fun game. Add in incredible optimization and gorgeous graphics and this game is a definite buy!",
            "review_score": "1"
        },
        {
            "review_text": "i was so ♥♥♥♥ing hyped for this game devs promessed so much and here it is. it's everything the first one was with a ♥♥♥♥ tons more element, skills &amp; weapons. you're free to explore levels before going for the missions objective just slicing shxt up! if you played and enjoyed the first one you'll definatly enjoy this one even more :D  STORY 10/10: slice ♥♥♥♥ up save the world and pull some joke every 5 seconds. the disrepect is real and true to the first one GAMEPLAY 10/10: improved movement and dodge attack, ♥♥♥♥ tons of movement specific to each weapons, SUPER POWER! CONTENT 10/10: played for 2hours and already got 5 new cool weapon, a lot of gemmes and upgrade. GRAPHISM 9/10: could be better but still look great very colorfull and run smooth at 1080p60 ultra (gtx980). SOUNDTRACK 10/10: rock n roll metal and other well synchronized with gameplay ennemy and attack sounds are great!  Overall 10/10 finally a game in 2016 who keep it's promesses, havn't got any season scam, run smooth at day one.",
            "review_score": "1"
        },
        {
            "review_text": "This game is what happens when you mix the best elements of Borderlands and Diablo while on drugs.",
            "review_score": "1"
        },
        {
            "review_text": "I played for a while and the game was too perfect. It runs smoothly, is funny a lot of the time and it is just straight up amazingly fun.  I'd recommend buying it if you want a game sort of like DOOM but less grim and with more of a sense of humour.  Great job devs!!!  (Only Con is that there is no chat in game with the players :/ )",
            "review_score": "1"
        },
        {
            "review_text": "I give it a 10 on the wang-o-meter.",
            "review_score": "1"
        },
        {
            "review_text": "The game is excellent, but everyone sounds like Max Headroom.",
            "review_score": "1"
        },
        {
            "review_text": "- Best soundtracks - Beautiful graphics - New weapons 10/10 for this game",
            "review_score": "1"
        },
        {
            "review_text": "I was collecting fortune cookies, when one of them I opened read 'Wangs out for Harambe'.   In all seriousness, if you like cheesy jokes, or live for the cringe experience of a lifetime while killing people in the fanciest way possible, this game is for you to both cringe at out of embarassment and enjoy immensely.  100/10 Will spin my Wang for Lo Wang...no homo",
            "review_score": "1"
        },
        {
            "review_text": "Double jump, unlimited dash, weapon wheel, stinger. Fantastic game.",
            "review_score": "1"
        },
        {
            "review_text": "People wanted more Lo Wang, and we got more Wang... yep",
            "review_score": "1"
        },
        {
            "review_text": "If DOOM and Dead Island had a baby , ♥♥♥♥ing amazing.....",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would laugh about more d¡ck jokes.  Epic game, coop is fun, could use slightly more d¡ck jokes.",
            "review_score": "1"
        },
        {
            "review_text": "(:",
            "review_score": "1"
        },
        {
            "review_text": "Great game, definitely worth getting at this price!",
            "review_score": "1"
        },
        {
            "review_text": "Was not expecting much... and was blown away by the game. Its worth the price, for a enjoyable playthough.",
            "review_score": "1"
        },
        {
            "review_text": "A game that doesn't take itself too seriously and is all the better for it. Good looking, well optomized for PC and most importanttly good fun! HAPPY DAYS! ;-)",
            "review_score": "1"
        },
        {
            "review_text": "Its like, what more could I ask for in an fps hack and slash? Not only does the game endlessly give you content without stop, and not just boring filler garbage, but actual progressive greatness. I have 12.2 hours already in 2 days of release and I can tell you, I CANT STOP PLAYING! ITS SOOOOOOOOOOOO GOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOD!   10/10 Would Wang Again   EDIT:  I forgot to mention that in all this gameplay time I havent even touched co-op yet, and thats supposed to be a HUGE portion of greatness to this game, so if I havent convinced you to buy it yet, idk what will XD!",
            "review_score": "1"
        },
        {
            "review_text": "9 Wangs out of 10. Like Skyrim but with Wang",
            "review_score": "1"
        },
        {
            "review_text": "Pros: definitely has the WANG  1.Gorgeous graphics  2.very fluid gameplay  3.love the snarky comments during  combat/in game scenes  4.love the melee/ranged/chi power  combat  5.Dash feels great, from here to there  fast as $%CK   Cons (not really)  1. normal melee attacks (as in not a   charged melee attack) feels useless.  I am playing on [get some wang]   difficulty..so most of the time a normal   melee attack means trading blows &amp; not   every enemy just hits, some simply kick  you in the face if you get close, or a   Talon will crush the life out of you, while   others just parry a normal attack. A heavier attack is needed for most enemies to do some real Dmg or knock them down.  Otherwise this game is absolutely awesome...",
            "review_score": "1"
        },
        {
            "review_text": "6/10    + Very immersive environment.  + Voice acting is on point.  + The jokes are creative and hilarious.  + Weapons are alot better than the previous Shadow Warrior game.  - The 'future city' levels felt like they were poorly made.  - Story didn't feel as immersive as the previous game.  - Game could've been longer.    ***SPOILERS***  Final Thoughts  The game had an amazing atmosphere and the game definitely was great on the eyes. Weapons were creative, voice acting was on top, some of the maps were beautifully made, but I felt like the story and a few of the 'futuristic maps' were a bit sloppy and could've been spent more time on.  Mixes in a samurai kind of stealth game with actual weapons and magic powers which is an insane combo.  I don't have much to say for this game, but for the price that you are paying for this game, it's definitely a game you should be getting, despite if you haven't played the previous game or not.",
            "review_score": "1"
        },
        {
            "review_text": "Excelent game! You are missing out if you have yet to purchase this game.  -The graphics are amazing, period. Some textures fall a bit behind but you'd hardly ever notice unless you go looking. -Lighting and colors are fantastic, very vibrant -Overall detail and artwork of the maps are beautiful, very well crafted -The guns and swords are plentiful and different in their own ways, all kickass -4-way Coop is a blast with friends as you go around f*cking Sh*t up non-stop -Enemies sometimes feel a bit like a bullet-sponge, but they are all cool looking and a challenge to fight -Movement is very clean and fast, think of it as a fine blended mix of DOOM and Warframe -Upgrade system is great, tons of options. Though slightly overwhelming, the amount of pickups is a bit high and I wish they were better organized versus a long list and you could compare/contrast upgrades side by side or the game would tell you if you had a better version of an upgrade.  Gets a solid 8/10 from me. The devs really slipped a great and VERY well priced game into the lackluster market of other games you would find. Would play with my Wang all day.",
            "review_score": "1"
        },
        {
            "review_text": "Best for slicin, dicein, and chicken fried ricein!",
            "review_score": "1"
        },
        {
            "review_text": "great port, good fun, relatively cheap. Highly recommend",
            "review_score": "1"
        },
        {
            "review_text": "A hood cerebral shooter.  Check out Tom Chick's review, for better explanation on why this is a good designed game.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for something that feels just like the good old days, with a bit of dose of modern and nifty mechanics, then you've just found it. Ludicrously intense combat with a huge variety of weapons and skills to pick, along with a pack monsters and furious enemies, acompanied by option for co-op play, will definietely keep in for days. Must. Play. Wang.",
            "review_score": "1"
        },
        {
            "review_text": " 4 hrs into the game    and i must say i think it is really worth the price.    nice graphics, nice gameplay.  friends of borderlands/warframe etc will love it.  guns, ninja swords, aliens, magic, hacking, slashing, gunfire , skill points, upgrades....what you want more?  oh right, awesome humor Ala duke nukem/borderlands!  and i didn't even scratch the surface (18% of normal difficulty story)    Multiplayer worked flawlessly since day 1  4 difficulty lvl as far as I have seen, for replayability and equipment farming.  (more difficult, more bonuses)    (I barely play SP games , so I cant compare it to SP games that match this game)    For 36€ day 1 release, grab 1-3 friends and enjoy, or wait for discount.",
            "review_score": "1"
        },
        {
            "review_text": "SHADOW WARRIOR 2 a senses shattering explosion of non-stop adrenaline pumping blood splattering mayhem. Slaughtering the diabolical monstrousities in all their many incarnations from towering demonic entities to futuristic cybernetic death machines along with seductive sexy female assassins or their grotesque half naked zombie like counterparts is a visceral deep razor blade cut of pure blood gushing ecstacy.   Wielding an arsenal of weaponary which seems infinite as new flesh penetrating guns, dismembering swords, gut ripping chainsaws, area annihilating rocket launchers, shotguns emanating legendary heroes with BOOM STICK prowess. melee skin slicing blades etc etc just keep appearing as if you just won the Sonny Chiba Street Fighter weapons of death lottery. On top of this is a just as endless mod upgrade system where you can add enhancements to make your life taking friends even more efficient in their murderous qualities.  Exploration is mesmerising eye candy erotic as you travel through TITANIC GIGANTIC environments hauntingly beautiful and sensual. To see such beauty running flawlessly on my i5 3570k with 8gb ram, Geforce GTX 970 with 4gb vram on ultra settings at 1920x1080 resolution is miraculous. What is even more astonishing is how many of these highly complex detailed filled areas are procedurally generated yet feel hand placed so your gaming experience will be different every time without it having a amateurish level design look.  Audio and music is relaxingly soothing disarming the player only to send electrifying jolts of pure brain frying terror into your very being as insane cackling laughter is heard in the distance from some rotting half naked thing which seemed to be a woman once whose only thought is to butcher you into stew sized chunks of blood soaked flesh. Yea she's gonna eat you and she is going to like it! Mmmm sexy...  Character design and leveling my goodness! There are so many skills to choose from and upgrade it is as if SHADOW WARRIOR 2 is finally bringing in the evolutionary fusion of rpg stats to first person shooters just as Bethesda has done with bringing fps sweetness to rpgs with the Elder Scrolls and Fallout. At last! At last we can have it all in our games without feeling as if we are missing out.  Oh and then there is PHOTO MODE which can be found in the options menu which allows the player to not only take screenshots but to manipulate countless graphical settings to create screenshot masterpieces unseen in any game series before. Screenshot lovers and photo manipulators rejoice!  SHADOW WARRIOR 2, BUY IT! PLAY IT! Feel the HUMONGOUS POTENCY of the LO WANG! WANG! WANG! ooo did you hear the golden gong just then?",
            "review_score": "1"
        },
        {
            "review_text": "Would have preferred a more linear experience with a tighter narrative. The game is still a lot of fun though, sort of like a borderlands lite.",
            "review_score": "1"
        },
        {
            "review_text": "This gives me both Shadow Warrior and Borderlands vibes... And I love it. There's RPG elements now such as loot and stats and elemental strengths/weaknesses... And plenty of upgrades and weapons to find and unlock! LOTS of weapons. Seriously. I saw someone online say it was somewhere in the 60s but I only have about 25 or so at the moment. There are also a lot of skills to find/unlock and level up with karma points.  I started on hard difficulty so it's not too difficult but I can still get pretty decent loot. That ended up being the perfect balance of challenge and reward and I recommend playing on it from the start. If you start on normal or easy and find it's too easy, you can change difficulty but you'll still only get achievements from the lower difficulty.  Exploration is important, as you can find lots of extra powerful enemies that can potentially drop new high-level upgrades, skills, or weapons.  The game has a lot of different upgrades with different effects that can encourage specific builds, such as a Vanish and special attack melee build, or a movement speed-focused gun build, etc.  Also, the chainsaw weapon is amazing. You get it pretty early and it's one of the most fun melee options. You can chop with it or move your mouse (or stick, I assume, if you're using a controller) to guide it around and cut enemies up.  I really really love this game!",
            "review_score": "1"
        },
        {
            "review_text": "Before Shadow Warrior 2 comes out I hv playing Shadow Warrior (2013.Ver). As r person to play this game which is too bloody and violence, but this game to me is very awesome, Im not talking about this game how bloody or violence, which is this game has r beautiful views with delicate detail of characters to monster, when I seen this game I love it so much, setting of lead which is awesome too, like tricky personality seems like DeadPool that badass. Also, in this game I love though Easter Egg hidden in everywhere, to me I love to find it out what is the secret is just like mini game, even this is Shadow Warrior 2 still put the oldest .Ver of Shadow Warrior Easter Egg, it feel great even I hvnt play Shadow Warrior oldest .Ver. In conclusion, this game is the best game in my life.Yes I love this game every every every much. I take most of the time in Shadow Warrior and Shadow Warrior 2. Thank You Flying Wild Hog. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Best use of the WANG award goes to..  Amazing game! tonnes of fun. Not quite enough story for my liking but the coop and replay ability makes up for the lack. I recommend this game to anyone WITH a good sense of humour the language is a little colourful :)  4/5 on my rating .. Lots of fun.. weapon and armour mod system is amazing but a little short for the money for me.  BF",
            "review_score": "1"
        },
        {
            "review_text": "Zilla: Bring me everyone. Demon: What do you mean “everyone”? Zilla: EVERYONE!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty excellent suquel to an awesome game. It builds upon core gameplay from first game and fixes most of it's issues. Everything is much bigger - many more weapons to choose from, robust skilll system, crafting and upgrading, lots of different enemies erc. My only issue with the game is very 'consolised' interface. It's sometimes pretty hard to figure out some of it's elements or find an upgrade. Also some people mind be displeased with refocusing the game from linear corridor shooter to more of a looter-shooter, but for me it worked almost perfectly.",
            "review_score": "1"
        },
        {
            "review_text": "The most fun i've had in ages! Best slash and clash game ever played with so much things to collect and do. 10/10 rated! Can't wait for Shadow Warrior 3 to come out.",
            "review_score": "1"
        },
        {
            "review_text": "Runs Flawless..  Graphically reminds me of Unreal 2 when it first came out .. updated of course  This game is fun if your not looking for fun well not for you ..",
            "review_score": "1"
        },
        {
            "review_text": "I have a Black Widow Chroma keyboard.....Upon loading it lit up the w...a...n...and g keys automatically. It's the little things....Also, it's very very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Love It.",
            "review_score": "1"
        },
        {
            "review_text": "So at first i didnt really care about this game but then thought to give it a try beucase i had some free time and omg this game is fun as hell but with friends on co op basiclly its borderlands 2 combined with doom but with japanies history you have a lot of weapons you can choose and find or get from missions , the world it self is kind of little and not big as borderlands map but you wont mind it because what you will be doing is cutting demons and yakuza with your friends i recommend this game but only in co op to play alone this game is really boring   pros- -good story  - co op  -nice graphics - a lot of weapons  cons-  -really boring to play alone -no after game missions (extra missions) -ends kinda quick (10 hours i think)  i give this game a 8/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Good fun ! Also great graphics !",
            "review_score": "1"
        },
        {
            "review_text": "Nice game I really like this but wtf happend at the ending I'll give a 8.9/10  If you haven't played the first one play it its really good ;)",
            "review_score": "1"
        },
        {
            "review_text": "My wang approves!",
            "review_score": "1"
        },
        {
            "review_text": "good on ya Flying Wild Hog - 9/10. Awesome game !",
            "review_score": "1"
        },
        {
            "review_text": "For overwatch player  I feel like playing Genji while using Ultimate all the time.  So much fun",
            "review_score": "1"
        },
        {
            "review_text": "Amazing hack and slash with witty humor and extensive combat options.",
            "review_score": "1"
        },
        {
            "review_text": "I'm having a blast playing this game.  + Gun-play is as good if not better than the 2013 game; + ♥♥♥♥ jokes...  + Great open levels + Great lightning and foliage + Just look at the price...   To think No Man's Sky was almost 20 euro more than this game... We need more devs like Flying Wild Hog.",
            "review_score": "1"
        },
        {
            "review_text": "(UPDATE at Bottom) I was so worried that a sequel would be a skeleton of Shadow Warrior; that they wouldve hollowed out its body, removed its soul, and replaced it with a bunch of things that no one was wanting or expecting.  Thank god that didnt happen. Ive played the intro/training style mission. And it seems to have kept everything that was great about SW and improved on areas that were lacking.  First off, the intro itself (cut scene) is great. Im glad to see the rabbit finally get a starring role and be front and center [on my windshield]. To me, the rabbits were sort of the hapless npc of SW. All they really wanted to do was get their freak on. And so many were killed in that process. Some revolted, albeit possessed, and still received the same fate.  Im also glad to see that lanterns, benches, and other acoutrements are still fully destructable. I havent seen a bicycle yet but I will destroy it once I find one and post results.  Climbing ledges, double-jump and aerial dashes all a huge plus. The double jump wasnt needed in SW but aerial dash wouldve been great. And climbing ledges and walls allows the devs to creat a much more 3d world. Rather than just look like a 3d world Wang is now part of, and interacts in a 3d world.  Couple of things that Im not so crazy about so far: (And yes Im aware that Wang learned these things prior in SW) Right off the bat you can heal yourself. One of the challenges of SW was that if you hadnt unlocked the healing spell, you really had to be careful with how you approached certain fights. Dev have sort of capped this according to your available Chi. Fine. Not a deal breaker but seems to dumb-down the game. In addition you immediately start off with 3 weapons: Katana, uzi, and a very powerful .357 magnum. You seem to have retained two of your special powers with the katana but theyre slightly different than SW. And oddly enough it doesnt seem like you need any of that just starting off unless youre starting on the hardest difficulty. I played right through the beginning just using my katana. And I didnt need to use the special powers. Im sure that will change later on and I may need them. But it seems like too much in the start. It seems to almost give you an edge instead of learning how to develop your own strategy and fighting style (as people did in SW)  [sic] 'Hold Control while falling to look more bad ♥♥♥' - Ok, so if I fall from a high point I can hold CTRL and do a roll. Why not just have that happen automatically? In a game that already had a lot of key combos to remember, and now has added more keys, cant I just play the game without having to hold akey to make the character do something that you (devs) obviously think I should be doing anyway? I mean, had I fallen from a great height and had the action happen automatically, I wouldnt have said 'Oh man, I really wish I needed to manually do that'.  Overall it seems ok. And its SW. As I get deeper into this I might add stuff into this review. Im sure there will be more things I like and dislike. I cant give it a a numerical rating yet. But I can give it a thumbs up. They would really have to ruin this to warrant a thumbs down.  Update 10/17/2016 - I firmly believe and fully stand by the next statement. This is the best game of 2016 without a doubt. It also may be one the best FPS games ever made. I think it easily ranks with the top contenders. I do want to add to the review and talk about some other points in-depth in the near future. And since the game does almost everything right, I will address and dissect the few areas that I either didnt like, didnt seem to fit, or possibly werent needed at all. They are few and far between. And they also are so minor that they really dont affect the overall score I would give this game. But I do think its necessary to address them. I will update soon, Im jsut too busy having some of the most insane fights in FPS that Ive ever had. Its that good",
            "review_score": "1"
        },
        {
            "review_text": "Wangs out for Harambe",
            "review_score": "1"
        },
        {
            "review_text": "Everyone is comparing this game to DOOM but actually it's a lot similar to Borderlands. I'm a little disappointed because I was expecting an old school linear shooter like Shadow Warrior 1 but instead I get this hub world procedurally generated masses of land where I'm sent to find quest items. I'm still recommending this game because it's extremely stable, the graphics are wonderful and works well on old PCs, the gun fights are satisfying, the swordfights are outstanding and the game is pretty fun in coop.  Another thing which bothered me was that the game's story was not written with coop in mind. If you play the game in coop mode, the story doesn't make sense. When you're progressing through the levels, fighting the monsters, you're different characters. But in cutscenes or when you're talking to people, you're both Wang. This takes out the immersion somewhat. The story should have been written taking coop gameplay in factor.",
            "review_score": "1"
        },
        {
            "review_text": "4 player coop, procedural levels, over 70 customizable weapons, optimized graphics engine,  15+ hour campaign and free roam,  no Denuvo,  no season pass,  no day one DLC,  no microtransactions.... it is a complete game in every aspect  Shadow Warrior 2 is one of the best games of 2016 and it practically ♥♥♥♥♥ on other PC ports (like Mafia 3) when it come to optimization and content. buy this game... NOW!!!",
            "review_score": "1"
        },
        {
            "review_text": "Slayed the Bunny Lord on hard difficulty and lived to tell the tale.  Twice.",
            "review_score": "1"
        },
        {
            "review_text": "Right price?  Check. Runs on my pretty good GTX780 rig at Ultra (the 4Gb VRAM Setting)?  Check. Great game Design? Check. FULLY Re-mappable Controls?  Check. Fun gameplay?  Check.  Any problems?  Nope.  Probably one of the very best games of the past five+ years.",
            "review_score": "1"
        },
        {
            "review_text": "Let me start by saying that I'm not really that much of a shooter fan, but I did love the first game and I'm also a fan of co-op stuff like Left 4 Dead and Borderlands.   That being said, this game in its current form just isn't a very good sequel to Shadow Warrior (2013) and not a very good loot-based co-op shooter either.  The main problem I think is that the game is hurt by too much randonmess: rather than a tightly crafted and challenging corridor shooter, you get a a game in which nearly everything is random and as a result of that, more often than not just not very compelling.  Despite of the random nature, pretty much every fight and every level feels exactly the same, and apart from very basic tactics regarding various elemental weapons, there just isn't too much to most of the fights - sure, they can be fun and fast and frantic, but the majority ends up feeling far too easy and far too long. This is made worse by the fact that especially in co-op dying rarely feels like it matters and it's far too easy to use cheesy kiting techniques.   On top of that, exploring the levels just isn't very much fun since all they will ever offer is more of the same, and the game throws so much and such poor loot at you that running around collecting everything is rather pointless - pretty much all the cool stuff is obtained automatically or very easily found by killing the mini-bosses and the endless slew of weapons mods that you get is more of a chore to sift through (using a horrible interface) than something to get excited about. This is probaby the first game ever, also, in which low level common or rare upgrades are often better than ultra expensive and and rare legendary upgrades, further adding to the sense of pointlessness of it all.   And to top it all of, the system with a quest hub and numerous fetch quests adds very little to a game of this type, other than constantly keeping you out of the action with endless loading screens and boring cutscenes. I simply started skipping them halfway through.  I'm not ruling out the possiblity that this game can be ultimately saved by a gigantic patch that overhauls the loot system into something meaningful and rewarding, but even then I feel that the repetitive and random nature of this game will not lead to something memorable. It's OK to play in short bursts if you just want to have something colorful to look at without having to think to much, but it feels far to much like busywork to be compelling for long periods of time. ",
            "review_score": "-1"
        },
        {
            "review_text": " 'An excellent addition to the series with new gameplay chops, excellent graphics, and rock solid Gameplay' - ACG  View his full review for the game on Youtube , im too lazy to write a full review.    This is the best i can come up with:  You played Doom or Borderlands before? Shadow Warrior 2 is a mix of both , go give it a try ~  I have a full walkthrough of the game   here   , check it out. or if you want to watch some High Level gameplays from the get go ,   click here  ",
            "review_score": "1"
        },
        {
            "review_text": "Greatest FPSRPG out on the market right now! Definitely puts something new to the gameplay vs all the copy cat clones these days and pretty much sets a world example of a true Shadow Warrior ^///^",
            "review_score": "1"
        },
        {
            "review_text": "I really wish there was a 'neutral' option on Steam reviews for this one.  The melee combat and movement is amazing and really fun. However, the guns feel pretty useless compared to melee, damage is lacking, the ammo is sparse, ammo efficiency is pretty low, etc. and the ki powers are all geared towards close combat, so there's pretty much no reason to use them other than sniping and/or kiting the more resilient and powerful mobs until you find your melee flow.  The Borderlands elements are done pretty poorly, the elemental effects have no purpose, other than the occassional 'x element immune' which sometimes can bring back those Diablo-esque rage-inducing frustrating moments of unfairness. The randomization does not work, because the maps themselves never change, only the location of mobs and loot can, but those are pointless. The loot itself is also pretty pointless, even on the highest difficulty, the game is easily beatable without using any of the gem slots.  The humor is very 80's toilet jokes heavy, which I personally found pretty great. However, there's far too little real banter in the game, because all in all, there's not much story or cutscene content there. The game's pretty short and it's entirely possible to finish in a couple hours if you don't bother with any exploration (which is pretty dull and pointless) or fiddling around.  Haven't tried any multiplayer, but I can't imagine it would make the game any better, or worse for that matter.  Overall, the game's design feels rushed and not thought through at all, however, just for the melee combat and the few truly funny cutscenes and banter lines, it's still worth it on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "This is not as good as the previous game. It feels unpolished, incomplete. Especially given the previous game. They went more Borderlands style with this one, looter shooter, only it's lacking some elements that made that work. The loot in this comes not from weapons, but from gems to slot into said weapons. The problem with that is that most of these gems are just stat boosts. A slight increase in a stat or two, and the 'better' ones all come with a drawback. There ARE some elemental ones, but again, they get slightly better as the game progresses, that's it. The only ones that are actually good are there are a few that actually change the behavior of the weapons. IMHO the system would be better with only those gems, and only one slot per weapon. AND NO ♥♥♥♥ING ELEMENTS. Seriously, I hate those.  The recent patch 1.1.3.0 only made a few things worse. And illustrates that the game is still, effectively, in beta. They've been asking the community what they want to improve, and using that to balance the game... slightly. They nerfed a couple things that were admittedly overpowered, but they also reduced the effectiveness of some things that weren't that powerful. And on top of that they increased the difficulty of enemies, AND reduced the amount of skills players can get. Enemies can now spawn resistant to everything just by the nature of having so many modifiers put on them in higher difficulties. Combine that with removing one of the major reasons to even bother with New Game+ - that being gaining skill points from repeating missions (you only get the skill points once now, no matter how many replays), and it just feels like they're poking blindingly and hoping the game will eventually balance out.  There's a lot of base weapons in the game, more than 70. You won't use most of them. I don't even really like the flow of combat in this one versus the previous game. The previous game was quick, responsive, and you could do a lot with combinations of movement keys. Double tapping a direction to prepare spells etc. The new one puts them on different buttons, which just adds to the complexity of the controls. And not in a good way. Controllers are not able to be freely customized either. This makes this game more complex, needlessly so. The levels as well are pieced together procedurally generated to add some randomness. However, the pieces do NOT always fit together well, creating a lot of seams and places where you could jump out of the map entirely, or get stuck.  Even the story feel like a bit of a rehash, and a let down, from the previous game. The previous game's was very interesting, and kept me sucked in. This one feels disjointed, not helped by the fact that there are side missions. The cut scenes as well are VERY badly animated. Like they are filled with placeholder animation, with wild, exaggerated movements that in no way match up with what is going on. It looks absolutely awful.  All in all... no. I don't recommend this. Maybe if they fix it, but this game right now feels like Early Access... and I don't see it actually ever being completed.",
            "review_score": "-1"
        },
        {
            "review_text": "Solo Played this Game Great Entertainment While it Lasted. The Few Ghaphics and Couple Missing Sences didn't Spoil The Fun For me. Had Funny Comentary and Reading Material Through out the Entire Game. This Game Is Like Trying To Put Doom With Deadpool Together.   8.5/10 Would recommend.  True Ninjas Use ChainSaws.",
            "review_score": "1"
        },
        {
            "review_text": "Started it up to see a dude with a selfie stick chainsawing a monster in half on the title menu. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "i added so many addons to my weapons that it crashed the game 10/10 would wang again",
            "review_score": "1"
        },
        {
            "review_text": "My Wang! as she said...",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Just wow. This is what comes to mind. When i bought Shadow Warrior 1 back a few years it was on special 10$. For some reason i did not think the original could be made justice and tought they just wanted to cash in on the name, i was wrong. It was a superior game and totally engaging and well done. Back then i promised myself i'd buy this sequel on release if it happened. And it did. Also, at one point i checked into the studio's portfolio and found an old game they made, called Hard reset. I actually enjoyed the hell out of it too, and then i knew Flying Wild Hog( the studio that made it ), was for real. This game was made with love. It shows. It just is apparent. It can't be seen in screenshots, movies or reviews. It must be played. There is nothing cheap about it. There is no lame optimisation or anything that speak of people rushing a game to the market. These devs are on a different world than the market is. They care about quality.   Please give these guys the duke nukem license. They are the ONLY ones outside of Bethesda that could make it justice.  Now with +/-  + Great optimisation. No slowdowns, crashes or lame bs. + Great graphiqs. + TONS of destructible stuff that makes AAA games look like indies. + Incredible play control. + Great soundwork. + Funny scenario. + Loot system ala Diablo ( this was totally unexpected ). + Lots of customization possibilities. + Coop play ( did not yet try it ). + Tons of weapons.  + The chainsaw is amazingly FUN and you can cut stuff up with great bloody details. Perhaps the greatest chainsaw ever made in a game alongside the new doom, but this one is better because it is limitless. + Just ton of fun all around the place. + Chinese fortune cookies are back! + Cool preorder sword.  On the negative side...  - Not available.  ",
            "review_score": "1"
        },
        {
            "review_text": "Beware the Bunny Lord",
            "review_score": "1"
        },
        {
            "review_text": "Note, I played the game on Hardcore mode from the get-go here. So these comments are from the perspective of only the hardest difficulty level, on single player scaling.  Pros:  +Runs like a charm, no FPS drops even during intense combat. (This is on a mid-high end rig)  +Funny dialogue that only occasionally falls flat. Kind of like a ♥♥♥♥♥.  +Diverse array of weapons to use and unlock.  +Great looking levels.  +Fairly diverse array of creatures to mutilate.  +Great viceral feedback from melee weapons.  +Dashing feels good, and helps traverse boring open space quickly.   Cons:  -Awful level design. Tons of backtracking through empty areas, and tons of 'open areas' to 'explore', that 99% of the time have nothing of interest. Not even enemies to fight. The game wants you to parkour, but gives you almost no tools to do so. Only certain ledges can be grabbed. You find yourself running around a lot looking for ways to move toward the objective. Very UN-ninja like.  -Very little variation in fights. All the monsters behave the same. Ranged dudes kick you away when you get close, and melee dudes try and keep their blades in your wang at all times. No matter what type of creature they're skinned as, this remains true of all enemies.  -The chi system is tedious to manage. You usually only have the option of using and focusing on a single skill. Even with maxed out regen/pool size cards. This will almost exclusively be the heal, since most elite/special enemies have a debuff aura that stacks with each element type, and force you to constantly spam the heal button to remove them since they'll kill you in 3 seconds if you ignore them.  -Ammunition starvation &amp; Bullet Sponge Enemies. Ammunition drops are FAR too scarse in the hardcore difficulty. You mag dump the entire ammo pool of every weapon type into 3 bullet sponge enemies, then have to use the chain saw or katana for the rest of the map until you pick up 10 shotgun shells per every 10 enemies you defeat. Gets tedious very quickly.  -Completely unnecessary Borderlands style stat management / Diablo style gem system. Slows down the action, and forces you to stop and switch mods when certain immune enemies show up. Biggest downside to this though is the ridiculous amount of low level mods you will pick up that clog your inventory. There is no effective way to quick sell mods below a certain level. You need to manually mark every single of of them as 'junk' and then sell them to a vendor. It's tedious. The mods also sell for virtually nothing. Even the 'legendary' rank mods.  -Loot gathering. I shouldn't need to stop on top of dead dudes and mash 'E' to gather book drops. It slows down the action, and makes me have to back track after kiting enemies after long fights that usually take 5-15 mins due to the bullet sponginess of enemies.  -Sprinting. When you're spamming dash constantly, sprinting doesn't really do anything. Either make Wang always run at the sprint speed, or remove it altogether. It's tedious to manage.  -Melee skill charging. Why the hell does it take 5+ seconds to fully charge a melee stab/spin attack? Slows down the action, and makes you need to kite for an unnecessary period of time.    I'm sure some of these things are influenced by having 1-2 more players. However, the bullet sponge enemies that aren't bosses are ridiculous. I shouldn't have to chain saw into a Yakuza's chest for literally 120 seconds with a min/maxed fire damage warrrsaw on enemies that are weak to fire. Even on the hardest difficulty. Make the AI smarter, or have more abilities/better weapons. Don't just tack on more HP and call it a day.  Steam really needs a 'mixed' option for recommending games. This game is perilously close to thumbs down territory. But, it's fun enough if you can look past the more tedious portions of the game mechanics.  If you're looking for a shorter, less open Borderlands with more ♥♥♥♥ jokes. This is your game. If you're looking for a non-stop slasher/action shooter - pass on this game, or play it only on the lowest difficulty setting.",
            "review_score": "1"
        },
        {
            "review_text": "REALLY GOOD..... Pleasantly surprised on how great this game is. The combat is smooth so is the preformance. 9.3/10.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would recommend for great humour. Gameplay is amazing. Loved the graphics and the story as well. 10/10 would recommend again for the gameplay and the weapons.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: + wide variety of weapons and guns + finally the guns are very satisfying to use + upgrades can really change how the gun works + wide varitey of enemies + compared to the first game, enemies can be killed much more quickly which doesnt make the fights frustrating as it sometimes was in the first game (not the original one) + a lot of enemies to kill, sometimes the battlefield is a nonstoping madness which is great + multiplayer + gameplay is fast and fluid and the movement is really great   Cons: - compared to the first game the story was pretty much dissapointing to me, too complicated to keep player interested in and not much memorable moments, shame - only one huge boss, again compared to the first game I was dissapointed - Lo Wang sometimes goes over limits and is a real prick - some animation needs more work especially while talking with a quest givers - the ending was dissapointing - it can become repetetive - after finishing the game there is nothing much to do   Rating 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Through 8 hours of playing with my Wang I have enduring an endless onslaught of demons, busty cyborg deathbots, and Wangtastic one liners.  The Way of the Wang is indeed long, and hard...and ribbed for her pleasure.  Edit-   Now through 22 hours I have beaten the game twice. Once on easy and again on No Pain No Game. Wow. I am still so new to the game too. Where you can go from here to make yourself more powerful is just awesome. I wish the game had a better end game, similar to Diablo 3 but I hear that more trials and other content is coming so I can't wait for that.  This game is just downright fun. The weapon choices are so huge and diverse and rarely did I find a weapon that seemed useless. These weapons can be further modified in crazy ways with elemental damage types, different fire modes, and other stats. Using the triple barreled Cerberus shotgun with the 3 barrel fire mode made for some HUGE damage output but slow reload for instance.   I would highly recommend this game to anyone who is a fan of shooters, RPG shooters, and diablo style loot and enemy systems. Not to mention all the crude humor that keeps you laughing throughout the entirety of the game.",
            "review_score": "1"
        },
        {
            "review_text": "-Find two bunnies humping. -Shoot them with Minigun.  -Bunnies turn into the Black Rabbit of Inle. -Get your ♥♥♥ ♥♥♥♥♥ to the sound of heavy metal.  -Try it again on sissy mode. -Shoot hundreds of rounds trying to kill the stupid rabbit. -Fail miserably.  9/11 would get butt f*ckd again",
            "review_score": "1"
        },
        {
            "review_text": "Asian Deadpool , thumbs up",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! Very different than Shadow Warrior 2013, but still great on its own way! This is definitely better experienced with a friend (or 3), so make sure to play it on co-op. It may take you some time to get into it and understand how everything works, but once you get the hang of it, it's extremely fun, so don't give up on it so soon! Ultra recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Cutting up thugs with their faces so ugly, stomping on demons who aren't all that snuggly, shooting at nightmares who fly with their wings. These are a few of my favorite things!",
            "review_score": "1"
        },
        {
            "review_text": "Shadow Warrior 2: Badass Simulator  Pros: The Wang Richard Jokes Blood...all over, on everything, every where, all the time. More Fun than Doom!   Cons: Having to go to work in between gaming sessions.  ",
            "review_score": "1"
        },
        {
            "review_text": "Runs extremely well, 4 players Co-op Hack'n slash rpg , great night in with mates playing the story co-op a must have!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ Doom Guy. Wang is the best!",
            "review_score": "1"
        },
        {
            "review_text": "If you want to play a game like borderlands, but Asian style.",
            "review_score": "1"
        },
        {
            "review_text": "the greatest thing ever bulid by man since Doom 2016 its that good",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun as heck. finnished the story on hard, took me 13 hours and 31 mins to complete all the side quests and story along with a little bit of chest hunting. Also, There are some bugs in the game that are not ground breaking but overall great game.  P.S. Don't get hooked by a enemy while they are teleporting back to their starting location. you'll get stuck under rocks or better! under a house.",
            "review_score": "1"
        },
        {
            "review_text": "Right after starting the game it felt like an awesome game, after a few hours I realized just how repetitive and boring it actually was. Now do keep in mind, I played the game no normal difficulty.  I never felt the need to actually craft weapon mods nor was there really any need to change the weapons themself, not that the new weapon I got was all that much better than my current weapons. I never saw any reason to actually farm for anything, I just went around slaughtered rabbits, killed the rabbit lords and got free orange drops that I equiped and never changed again. I never felt the need to use elemental weapons nor use anything else except my sword, I did also use my revolver though because I love revolvers.  Your character, he's the kind of guy that turns everything into a joke, and at the start they're actually funny but after you've done a few quests and realize 90% of everything he says are just jokes and insults, you get kinda tired of him, doesn't even feel like the jokes comes natural when he says them in a lot of situations.  The length of the game, well I did every main quest and optional quest I could find, and in total it took me only 10 hours to beat the whole game, now keep in mind that this game does like Borderlands 2 does, when you beat the game you can start over the game and keep all your items, but due to the fact that the quests were rather repetitive and the story is the kind of story that's only enjoyable the first time, I don't see myself playing through it again, and for the current price of the game, 10 hours of gameplay isn't a lot(the last 3 hours weren't even enjoyable, I was just sitting there hoping that the current quest was the last one in the story).  Wouldn't recommend this game if you like a good plot, good gameplay or if you want a game like Shadow Warrior, would recommend it if you like cutting up enemies though.",
            "review_score": "-1"
        },
        {
            "review_text": "If you played the first Shadow Warrior and are looking for more of that fast paced action look elsewhere.  Humor is just as good as it was before, the animations are top notch, the environments are great, the characters are great I really want to love this game If it just didnt have this loot system that just continually breaks the flow of the action and combat and makes it feel like I have to stop and look through my upgrades every 5 minutes and the whole elemental system just feels tacked on.  Take the elemental system and the socket upgrade system out and this game would be amazing.",
            "review_score": "-1"
        },
        {
            "review_text": "in 0.5 hours of playtime I can already come up with valid judgement to buy this game  Pro - Dedicated Screenshot mode, literally, filters, DoF deepening, Bloom intensity, Dutch tilts (Camera tilt) - More Wang Quotes, Even wang singing. these are a few of my favourite things - Damage indicators (the numbers) give me a nice borderlands nolstagia trip - Optimization level: Battlefront  - More Variations of those pesky demons, So your not killing that same ♥♥♥♥♥♥♥♥♥ from 10 hours ago again..seriously F*ck off! - Mo'Wang  Cons - Couldn't Preload so I could get into wanging it earliere - I miss Sprinting, mabye its in the game but haven't unlocked or my dumb A$$ cant figure where it is yet - No Hoji, rip my husbando - Not enough 'YOU GOT THE TOUCH' at the beginning, seriously I was jamming to that   Conclusiion; Buy this unless you really miss Hoji. Or buy this to avenge Hoji Yeah, go! AVENGE HOJI!! 9/10 missing Hoji",
            "review_score": "1"
        },
        {
            "review_text": "i love beating demons up with my lil wang",
            "review_score": "1"
        },
        {
            "review_text": "Loved the original - loving the sequel. Its alot like the proper Shadowrun action game we never got...  UPDATE: with the current patch removing skill points and nerfing the ♥♥♥♥ out of many player resources - I really dont know what the company was thinking. Removal of skill points and nerfing of weapons, well after the game releases, is NOT a way to reach whatever balance vision the devs may have had - you figure that ♥♥♥♥ out before release.  With this update, I can no longer recommend this title. A company that is willing to ♥♥♥♥ on the players isnt a company I am going to support. Nor should you.",
            "review_score": "-1"
        },
        {
            "review_text": "Fast, loud and overwhelming action. Exactly what I want! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game, could be better in every way though.",
            "review_score": "1"
        },
        {
            "review_text": "The semi open world format makes the game empty. Not enough ennemies, lots of time being lost and jumping around.  My opinion is that the open world format killed the shadow warrior action. And without the action there is not much to be done within shadow warrior 2. Without much to be done there is not much to like after a while.  Can't be bothered to end the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Would play with wang again.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, very good graphics and gore. Interesting weapon designs. Wish had more depth.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the only good New Release this year. ",
            "review_score": "1"
        },
        {
            "review_text": "Loved the smoothness of the game! (Kill and Keep Running)",
            "review_score": "1"
        },
        {
            "review_text": "Shadow Warrior meets Borderlands and it works really well.",
            "review_score": "1"
        },
        {
            "review_text": "-- PROS --  + The loot system is really great. You find your weapons from special bosses (marked as a skull on your map), or occasionally from chests (potentially from other monsters, but I think I've only seen that once). You then find upgrades for your weapons, which is the loot that largely drops throughout the game modes. The weapons have set stats, but the upgrades do not, so that is what you farm for. They give you a lot of loot, so you have a lot of chances to find something valuable. The highest rarity drops at frequent enough intervals to keep you from getting frustrated, but not so often that they rain from the sky.   + The shops are actually done properly. You can find real hidden gems in there, and as soon as you progress through the story enough you can find some really great high level upgrades. At the moment I am posting this review...you can do something pretty cheesy... get to the end of your first playthrough (after finishing the final boss), then bump up your difficulty to the highest setting. Go back into your game and visit the shops. There will be higher level gear in there than what you should be getting (at least that's how it worked for me).  + The combat is a blast! I dislike first person shooters usually (mostly because they give me headaches, but also because I suck at fast paced shooting). This game is great because they have a very viable melee combat system. In fact, right now it's more viable to be melee than it is to use guns (a common complaint that will at some point be fixed, I presume). My favorite weapon is a chainsaw, because the melee skills feel much more pleasant with that weapon than with any other type. My boyfriend plays this game with me, and he solely uses guns while I solely use melee. It works out very well for us, and he loves the gun combat.  +/- The humor...lots of sexual inneundos (which is a negative for me - I don't like this style of 'funny' - but a positive to others, and is trademark to this series). But the game did keep me laughing (mostly AT it). There are a lot of genetalia jokes, so enter at your own risk. There are also Fortune Cookies which are really cute and usually have a funny message.  + The environments are randomly generated, which I like.  -- CONS --  - The story... I'm not going to go into detail (there are plenty of reviews that do that for you already), but the story left me wanting. The ending in particular left me with a WTF look on my face. I was really angry about the end cutscene. Anyways, if you take out the humor, which is in 75%+ of the questline, you're left with a very lackluster story.   - Ammo can be hard to find. If you don't like switching weapon types (because there's a chance you'll run out of ammo of a certain type), you won't enjoy this game as much. There are skills that help combat this. On that same note, you also need to have elemental weapons set up and a physical weapon. There are enemies that are completely immune or just resistant to certain types of damage. There is a lot of weapon switching. I personally don't like to switch weapons, so I just set up my melee to physical, have one back up elemental melee weapon in case of a physical-immune enemy, and then power house through Physical Resistance enemies with my main physical melee weapon. I have only elemental range weapons, which I primarily use for big story bosses where melee can be rough.  - Crafting is a waste of time and money. You'd rather just reset the shop and hope to get lucky. This might be changed eventually.  Overall, this is a really fun game! The positives far outweigh the negatives. This is worth a purchase, in my opinion. The devs patch frequently and balance the game, so you'll see a lot of changes throughout the upcoming months.   Note: If you intend to play this game ONLY cooperatively, I do not recommend this game YET. I would wait a few patches for them to clean it up before getting into it. The experience for me was...very lackluster and incredibly frustrating. And there were changes in patches that completely infuriated me. I wish I had waited to play this game and not bought it Day One.  -- My COOP Experience --  My boyfriend hosts. We go through the entire playthrough, all the way to the end. The entire time, my progress did not not save in my story (this is an intended feature). So, if I wanted to play my own game without him, I would have to start all over again from the beginning. It is absolutely a HUGE waste of time to go through your first playthrough if you have already gone through it once cooperatively, which I'll explain in a moment.  Throughout that playthrough, I missed out on a few skills that were rewarded from quests (perhaps a bug, I received some skills, but not all of them). At a certain point in the story the shops reset and get great loot. At this point, the player that does not host (probably due to the fact that your own story progress does not save, so it thinks you shouldn't have access to these shops), you cannot talk to shops. This means you cannot buy ammo (which can be scarce, especially if you don't hunt down chests). This means you cannot buy any skills. This means you cannot buy any weapons that are added to the shops in the late game. This means you cannot sell anything. You cannot buy anything (and the shops have great loot sometimes). This is a bug, and presumably will be fixed. But for my experience on day one...this SUCKS.   Also, when crafting is unlocked for the host, it is not also unlocked for the coop player. So, you'll need to go through the first few hours of the game on your own save game, where you won't get anything for your time other than low level upgrades and some XP and gold. Then if you wanted to craft you could. I'm not sure if this unlocks the crafting in coop or not (I haven't tested it), but if it doesn't, you can always just go into your own game when you want to craft. But, crafting sucks in this game, so don't do it.   And the coop specific performance issues...oh gosh...CONSTANT disconnects from the server (even with good internet connection). Constant huge frame rate dips... every patch improves these things. But it still isn't what it should be.  So, since I was missing a handful of great things from not hosting myself... I was frustrated and quit the game. A few patches roll out, and now they have added these Orbs. You get them from quests after your first playthrough (basically to give you a reason to go through different playthroughs). They will help you boost the stats on a chosen weapon with the next patch. But for now you can just collect them. We think 'let's play Shadow Warrior 2 again and horde some resources for the next patch!'   We launch the game, and since I'm still frustrated with missing out on skills (that are actually useful), I decide to host. We go through a few quests...and then I realize that I'm not getting any orbs. Because, duh, the game thinks this is my first playthrough...meanwhile, the host from my last playthrough is getting a lot of them. Since I've already done these quests once, I don't get any rewards from them other than the ones that bugged out. Fantastic. So, I get to go through this entire playthrough, really only to gain XP (there is a cap at some point, which I haven't hit yet), gold, and some very rare upgrades. Because, as I said, the upgrades are tied to story progression. I go through most of the playthrough finding really garbage loot, with nothing useful in shops until the second half of the game. That entire first half I find maybe one upgrade that I ended up equipping. But, hey, at least I could pick up the skills that I should have gotten already and purchase the weapons that I should have already been able to buy!   Frustrating and a huge waste of 13hrs to go through that playthrough. It's annoying that you are penalized for not hosting, even though you have completed every quest once!   Read comments! / Character cap",
            "review_score": "1"
        },
        {
            "review_text": "Wangs out for harambe.",
            "review_score": "1"
        },
        {
            "review_text": "It has Wang in it, do you even need to consider ?",
            "review_score": "1"
        },
        {
            "review_text": "Gunplay is almost as good as doom while capturing everything going that was exciting about borderlands. I only wish different weapons would drop instead of the plethora of gems. This is a minor detract as there are so many many weapons",
            "review_score": "1"
        },
        {
            "review_text": "So, take the fast paced, old school FPS action of Shadow Warrior, with it's lush environments and A+ Melee to Gun combat. Then add in Borderlands' loot drop mechanics with the all too requested feature of being able to edit and upgrade your guns as opposed to just hoping for a better drop once they get useless, and you get this masterpeice.   If I had any nitpicks it's that Lo Wang has a really bed habit of repeting the same one liners over and over and that the final boss theme, the best theme in the game, isn't in the soundtrack for some stupid reason.",
            "review_score": "1"
        },
        {
            "review_text": "game good computer bad endgame pls",
            "review_score": "1"
        },
        {
            "review_text": "Liked the gameplay. It reminds me of doom and is alot more easier on my pc. Love these fast oace shooter games. Could have a longer sotryline though, theres not much to do after completing the game",
            "review_score": "1"
        },
        {
            "review_text": "Really good game. Lots of hack, slash, pew-pew and fun. Lots of unique weapons - more than 50, i think + intresting upgrade system, which can help you fine-tune weapon for your game style.",
            "review_score": "1"
        },
        {
            "review_text": "I was only going to give this a 10/10 because I thought the fortune cookies from Shadow Warrior weren't there anymore, but then I found a fortune cookie, so now it's Wang/10.  And that's the most Wang a game has ever received.",
            "review_score": "1"
        },
        {
            "review_text": "  For a indie price you get a AAA quality",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game and be Wang-a$$",
            "review_score": "1"
        },
        {
            "review_text": "Dame ! One of the best game this year",
            "review_score": "1"
        },
        {
            "review_text": "Member when games had multiplayer coop story mode? I member. Member when your friends loved the Wang as much as you? I member. Member Chewbacca?",
            "review_score": "1"
        },
        {
            "review_text": "Just remember 'Wangs out for Harambe!' ",
            "review_score": "1"
        },
        {
            "review_text": "You want some Wang? Because this game has got some Wang. Lots and lots of Wang.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect!",
            "review_score": "1"
        },
        {
            "review_text": "What can I say, crazy guns, swords, gore, humour and a wang. And in one healthy serving...",
            "review_score": "1"
        },
        {
            "review_text": "One of the most immersive story lines I've ever played and I've enjoyed every minute I've played on this game. It's also multiplayer so you can have fun wiht your friends.",
            "review_score": "1"
        },
        {
            "review_text": "  My friend bought this game for me and it's amazing. I saw it played on youtube and was going to buy it anyway. Comedy like borderlands, combat like ninja gaiden but not as hard, and it's amazingly fluid. Great story and just all around a good game.",
            "review_score": "1"
        },
        {
            "review_text": "overall a good game can have a bit of lag if you try to immedeatly try to equip a weapon that just dropped ao you just have to go into inventory .  good 80's style soundtrack ,good gameplay, cool/ bada** demons and such, all around fun game would reccomend. oh also there are fortune cookies.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Gratuitous violence &amp; lowbrow humour abound like the rabbits in this game.",
            "review_score": "1"
        },
        {
            "review_text": "For goodness sake its everything that a game is supposed to be. THis games turns everything to 11 and does not stop. Seriously fun, I sincerly wish it was longer.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome action. Dizzying array of weaponry. Outrageous! FPS goodness.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most immersive story lines I've ever played and I've enjoyed every minute I've played on this game. It's also multiplayer so you can have fun wiht your friends.",
            "review_score": "1"
        },
        {
            "review_text": "By far the best FPS I have played in several years. While I'm more into stealth games than straight out shooters, the combat in this is brilliant. Almost 30 hrs in and not a hint of bordem. I'm not so keen on the direct comparison to Borderlands alone, but reminds me of a FP version of Diablo/Grim Dawn and other ARPGs. RPG elements are fun and grinding to gain skill points and cash on previously completed missions is an option if you want, but not required. It takes a while to properly master the combat mechanics and skills, but once you do it is so much fun - and for $36 this puts some others games asking $60 or above to shame in terms of enjoyment value per $. Highly recommend to anyone that likes ARPGs, FPS, humor, Borderlands (all of them), Far Cry (3-4) etc.",
            "review_score": "1"
        },
        {
            "review_text": "absolutely loved it. great game guys. could use something more to do after the campaign like multiplayer exclusive missions or stuff like that",
            "review_score": "1"
        },
        {
            "review_text": "First, a basic overview. The gameplay is addictive, the plot is good, and it still has that same sense of humor (the main character's name is Lo Wang, figure it out).  The gameplay is not very similar to Shadow Warrior, but is still quite fun. The best way I can think of to describe it is that if Tourchlight and SW had a child, it would be SW2. You have plenty of weapons, many different effects of all kinds to place on those weapons, and several metric tons of people that want you dead. Coincidence? I don't think so. Also, if you're looking for a game that is quite bloody, you've found it. Watch the trailers if you don't believe me. I feel I should mention the chainsaws. They aren't the most useful weapon, but they are pretty much the most fun. Time slows down for when you are slicing through an enemy. Blood, guts, slivers of flesh, all that good stuff.  I will be short in referencing the plot. It's suffice to say, the plot is not as predictable as many other games I have played recently. It made sense, but wasn't the kind of game that you know the plot from the first two seconds of story. That reminds me, there is lore. Several pages of scrolls, books, digital books, and similar items.  The humor has gotten less subtle. There are jokes around every corner, be it an implied joke or a direct joke. I would give a few examples if I didn't think that would ruin the fun. But if you really want to see them, you just can google it or buy the game and play it to discover the jokes for yourself. There are mock fortune cookies here as well. while most aren't as funny as the original SW cookies were, there are many more. And they are numbered, and stored in the Wanglopedia. Sorry I couldn't help but reveal at least one joke, and not even a very good one at that.  From what I've heard, this would make a better Deadpool the game than the real Deadpool the game.  P.S. Not the bunnies, please not the bunnies.",
            "review_score": "1"
        },
        {
            "review_text": "Shadow Warrior 1 plus Borderlands, without the boring stuff and no clap-trap plus a whole lot of interesting enemies that can block, evade and maneuver, then add some excellent music and even better graphics plus a WHOLE LOTTA WANG! Was a little unsure about pre-purchasing, but it's worth every cent! Get it, get some friends to get it, and find an answer to the age-old question: 'You wanna wash Wang? Or you wanna watch Wang wash Wang?'",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AWESOME, SO MUCH GORE!  If you like loot games and upgrades and abilities and new weapons, you should like this game.  And it's also Parkour, Ninja, and just jumping around, so much fun.  I really recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "Give me more Wang.",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't sure if I should buy this game because I have not play the first one but after watching Angry Joe's Gameplay video where he said this game is 'Game of the year' worthy I just had to buy it. And trust me it didn't disappoint me!!!!! This has to be my 2nd or 3rd favourite game of all time and I wish they make a 3rd part because I want the Developers Flying Wild Hog to have so much success with this awesome game. They deserve it!",
            "review_score": "1"
        },
        {
            "review_text": "Shadow Warrior in 2013 surprised the hell out of me.   I'm a story fanatic; a good game is centered around the story and graphics, gameplay, etc take a second place(Not distant, but still second)  Generally in an FPS the game is told mostly passivly, sparingly, is one of buffoonery, or borderline non-existant- Halo, Hexen, Duke Nukem(Lots of others), Doom.  Shadow Warrior had a god damned STORY! So...if nothing else, play that.   I was hoping Shadow Warrior 2 would continue and exceed the original.  Well, credit for getting half of it.   But let's take a look at secondary-   Graphics: Great. Settings can be repetative but that's something you get accostomed too with a grinding co-op. Quality is airtight.   Sound: Sure. Music, great. Sound effects, wonderful(I love the WarSSAWWWW)   Gameplay: It's okay. Melee weapons outclass guns in every way EXCEPT...you can't really duel. Just being near enemies gets you hurt and they're everywhere. So range is your friend unless you're tweaked pretty well.  Customization seems varied, but despite drowning in gems after a battle, the actual diviristy is pretty spartan. Elemental Damage boosts supercedes most other abilites...and again...WARSAWW OF FIIIIRRREEE!!!  Powers: Ah, easily abused. Right gems, right powers you can pretty much screw anything over except bosses. Which is nice. I like it.  Story: Here we go....  I'm not going into the story. You want a summary look at the wiki. The story doesn't 'surprise' as much as the original. There are a LOT of nods to it...still miss you Houji...bro...comrade.... and the sense of continuity is there. The 'I Am Power' trailer is a bit deceptive though. The end result is explained and the sense of near-tragedy continues fairly well enough, but it's not the SURPRISE and I can't directly fault Flying Wild Hog. I wish it was the same, but we always want more of what we loved.   Is it worth it?  Oh ♥♥♥♥ yes.  You want the Wang.  YOU WANT THE  WAAAANNNNGGG (with a warsawww...OF FIRE)  ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games out this year, above average on everything but AI features during cutscenes.  Co-op is fun and easy to join.",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes you just want to feel like a ninja badass. To fly into a situation with armed with your sword, your chi, and an unlimited supply of ♥♥♥♥ jokes, raining ♥♥♥-kickings on demons, yakuza, and cyborgs, cracking a joke while you walk away with their shiniest toys. This is that game. A linear story with some side quests that you should be able to finish the first time on normal difficulty in about 15 hours or so. If you liked the first Shadow Warrior, first person hack and slash, demon powered heavy machine guns, or fun and humorous games I'd recommend this one.",
            "review_score": "1"
        },
        {
            "review_text": "The first game didn't grab me for some reason, I don't know, I tried to play it at least three times but nope.. Then I've seen gameplay footage from Shadow Warrior 2 and I really liked what I've seen so I bougth this game.  Shadow Warrior 2 feels like a mix of Borderlands, Diablo 2 and Shadow Warrior (reboot). I don't like Borderlands at all in terms of gameplay and bullet sponge enemies, but I really like Diablo 2 and I really like the aspect of upgrading weapons in Shadow Warrior 2, plus it doesn't look like there's billions upon billions of guns or other weapons in this game like in Borderlands, so overall I like this game more that the first one (reboot) and Borderlands games.  The story and cut-scenes though... well, it's not my thing pesonaly, but hey, who cares about the story and cut-scenes in Shadow Warrior games anyway? I know I don't. I mean, clearly It's not what these games is all about just like DOOM, Quake, Duke Nukem, Serious Sam etc., plus the gameplay is really fun, meaty and with a ♥♥♥♥ ton of gore so... what else you need to entertain you?  But here's the thing, I still like DOOM a lot more than Shadow Warrior 2 cuz it's just... well, a lot better and way more satisfying FPS for me, not to mention that in DOOM there's no usless crafting system, bullet sponge enemies etc. But it doesn't mean that Shadow Warrior 2 is not a good game, no, it's good, just... nowhere near as a good as DOOM. Damn, I don't even know if there will be better FPS than DOOM, it is very hard game to beat imo.    Pros     *  Lots of meat and procedural gore  *  Very satisfying swordplay and chainsaw weapons  *  Fast and responsive movement system  *  Freedom of movement  *  70 unique weapons to choose from to suit your playstyle  *  Great soundtrack (especially title screen theme)  *  Really cool visuals (enviroments and PostFX) and weather effects  *  Runs really good even on not that powerful hardware (except setups with dual-core CPUs)  *  Photo mode  *  No Denuvo    Cons     *  Stats and level based gameplay, especially on harder difficulty modes  *  Borderalnds-style FPS and loot system (for some players all of this and all that is below can be a huge departure from the first game and a very serious flaw)  *  Bullet sponge enemies (not regular mobs that you can kill in 1-2 sec) with weakness to various elements (can be very annoying, aggravating, dull and tedious)  *  Weapon upgrade system (you can't ignore it and it ruins pacing on harder difficulty modes cuz you constantly need to upgrade weapons to make bullet sponge enemies less annoying, dull and tedious)  *  Useless and needless crafting system, hub and shops (gems and stuff like that - just don't buy anything except weapons, skills and ammo)  *  Levels can be very similar to one another (they are procedurally generated)  *  Semi-openworld structure of levels (for some players it can be boring to wander around on a big map to look for action, enemies to fight, mission objectives etc.)  *  Side quests and stuff like that (most of them are fetch quests)  *  Really bad character models (personal nitpicking, but for F's sake Flying Wild Hog, it's 2016!)  *  Co-op    Overall score:     7,5  /10  If you think that the negatives is not a bad thing - buy this game, if not - stay as far away or wait for a sale. There's also an option to play the game on Easy (or Normal) difficulty, so you can eliminate at least some of the game negatives if you don't like looter shooter focus of the game.     Update 18.10.16: ",
            "review_score": "1"
        },
        {
            "review_text": "props to hog for actually balancing their game with patches; VERY rare for non-pvp games to do this",
            "review_score": "1"
        },
        {
            "review_text": "game is fun but some areas have massive fps drops. it was a slind show 4 hours in,   3/5",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed playing with my wang.",
            "review_score": "1"
        },
        {
            "review_text": "A very good game, like one of the best games in 2k16 in my openion. if you are in to first-person, big monsters, a lot of blood, epic weapons, and a comedy style story mode. Then you should buy this game  {LINK REMOVED}  (♥♥♥.com)  chen its cheaper :)",
            "review_score": "1"
        },
        {
            "review_text": "the game is overall good but I tell you this 'solid' 60 fps  specs: GTX 960 4gb ASUS STRIX oc edition core I7-6700 16 GB of ddr4 RAM",
            "review_score": "1"
        },
        {
            "review_text": "' wangs out for harambe '  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This was probably one of the best games I've played in a while. The little puns and remarks that you hear throughout the game keep things interesting. I've had a few hiccups with the multiplayer but not enough to really be that bothered by it. They even have their own little spin on the typical internet drop message. Graphics are amazing, guns are diverse and look badass, and the comedy factor is worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "what a great game its like doom and a RPG all in one.",
            "review_score": "1"
        },
        {
            "review_text": "Its like Deadpool but more badass :D  Great gameplay, grafic, music. Cooler monsters , great story.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "as good as the remake of the original hints of borderlands and carnage, chaos, violence. i really enjoyed this game lol",
            "review_score": "1"
        },
        {
            "review_text": "top bants",
            "review_score": "1"
        },
        {
            "review_text": "what kind of ending was that!!!!!!!!!!!!!!!!?",
            "review_score": "1"
        },
        {
            "review_text": "14h+ sologame... insane comedy whit stunning gameplay/graphics",
            "review_score": "1"
        },
        {
            "review_text": "retard devs patching their game to make it less fun, if you want to make it harder increase the enemies strength don't nerf the funnest weapon in the game, it's like the autists making this game forgot it's supposed to be satisfying to kill enemies, not a chore of chipping their hp away.",
            "review_score": "-1"
        },
        {
            "review_text": "14h+ sologame... insane comedy whit stunning gameplay/graphics",
            "review_score": "1"
        },
        {
            "review_text": "Wangtastic GOTY! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is not Shadow Warrior. It's a Borderlands game that looks like Shadow Warrior. The first part (2013) was a superb modern remake of the original, while this game went as far away from that formula as possibly can. Very dissapointed and hoping for a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Not as good as the first, fails in all potential, ridiculous balance update, high difficulties reward you with bupkiss (jack s.) all challenge for underpowered weaponry, broken skills system.",
            "review_score": "-1"
        },
        {
            "review_text": "they changed the formula from being a nice old school shooter to a ♥♥♥♥ing looter shooter that has no concept of pacing",
            "review_score": "-1"
        },
        {
            "review_text": "Such a beautiful title music... What? This should be a review of the game? Well it's also not bad.. but let me hear it one more time..",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome game, the gamplay is smooth and the comments of the main character are just epic.",
            "review_score": "1"
        },
        {
            "review_text": "Yes! Play it! Or don't. EIther way, do it!   May the Wang be with you.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game   Very good price   you can not go wrong   ",
            "review_score": "1"
        },
        {
            "review_text": "First hours - It is like Shadow Warrior 1, but better.   Finish hours - I love this game! 10\\10 would Wang again!   It beats Doom! Love it, just love it!",
            "review_score": "1"
        },
        {
            "review_text": "Did you like the remake? the fast paced action, the simplistic but direct gameplay that wasted no time and made sure you were knee deep in the blood of your enemies at all times? well you're not going to get that here.  Instead of doing a follow up and producing something in a similar vein to the DOOM remake/sequel they decided to cash in and copy Borderlands because that's what you want from this type of game right? grinding and loot collecting? everything has taken a back seat to this and it results in a shallow game that will take forever to get to even half the level Wang was in the 'first' game.   Do yourself a favor and play DOOM instead, or Serious Sam, support developers that actually care about the source material because any good that was here has gone the way of DUKE now. RIP Shadow Warrior.",
            "review_score": "-1"
        },
        {
            "review_text": "A swing and a miss. I loved the first Shadow Warrior. The story was fun and the progression felt rewarding. This is something else. This is Borderlands without the rewarding drops, freedome and fun plot. Since I've only played this co-op and that part had been executed extremely poorly I can't say much about the single player experience but I can't imagine it's alot better. Granted the co-op part feels like it was thrown in last second.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't believe you people: you rate this game 'Very positive' when it has nothing to do with the greatness of the original Shadow Warrior.  You spend half the time in your inventory scrolling through endless lists of 'upgrades', to find something better than your current '+0.000001 damage' upgrade in you favourite weapon. Seriously, the 'upgrade system' is a ♥♥♥♥ing joke and ruins the whole game. It's suppose to be a FPS game, not a min-max RPG where you spend your time optimizing your guns with garbage upgrades.  Oh, there's also 74 different weapons but most of them seem to be ♥♥♥♥ as well. For example, you have two katanas with minor differences in stats. Sounds intresting, huh? I would instantly trade it to a system with ten basic guns with lots of custom options. Kinda like the system in the previous Shadow Warrior (or DOOM), but with more options. Instead, we have this PoS upgrade system that kills the whole game.  Also, they ♥♥♥♥ed the level design. Generated levels for your (♥♥♥♥♥♥) side quests, sounds like a good idea? Well, it's not. There's no spirit in levels, nothing memorable.  Good job devs, I can't understand what you were thinking. Why couldn't you just refine the concepts of the previous SW?  The worst part is, that I paid 27 euros of this. I'm poor and usually don't spend this much money on a game. This time I thought I'd support the devs because the previous Shadow Warrior was such a great. And what did I get? The GREATEST DISAPPOINTMENT OF THE YEAR.",
            "review_score": "-1"
        },
        {
            "review_text": "it ends with you getting vored by a dragon",
            "review_score": "1"
        },
        {
            "review_text": "Crap After New Patch Not Fun Anymore",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this because so many was praising it. Should have realized that this is to much like borderlands (which I didnt like) for my taste.  I loathe spending time shifting through loot to optimize gear.  Its not enough that it has humor. Can't recommend this, if you dislike Borderlands/and or loot in FPS.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a bit of an FPS, it's a bit of an action RPG, and it's kind of not brilliant at either. I'd take it over Borderlands, don't get me wrong, it's certainly has it's charm, but falls a bit flat after a few hours.  Would recommend if you can get a bunch of mates together and pick up a copy each during a sale or something, it's definitely got a good couple of evenings in it as a co-op game.  Wouldn't recommend it as a single player game though and doubly not at full price. Just don't think it is offering much that other games don't.",
            "review_score": "-1"
        },
        {
            "review_text": "Failed to really recollect what makes a Lo Wang game fun. Albeit an interesting take compared to the traditional style of the older games, it failed to really make me want to come back to the game and complete it. What made the older Shadow Warrior games fun was none of this Borderlands style gameplay and quests that's for sure. This installment to the franchise was a let-down sadly.",
            "review_score": "-1"
        },
        {
            "review_text": "As a SP FPS game goes, this is the worst I've played and that's quite difficult to do..  Missions/maps aren't missions or maps, they're just arenas where the same enemies spawn randomly and infinitely while you go from side to side repeatedly because every mission finds some stupid way of getting you to walk across the same arena at least twice (example: you find a captured guy in a cage, he tells you the key is back where you started, so you walk all the way back and there again, with the randomly spawning enemies).  I've never seen a game so lazily made. It's a multiplayer arena with bots that tells you it's a single player campaign. Comparing this with something like farcry3 is... well, that's a game and this is ♥♥♥♥♥♥♥t.",
            "review_score": "-1"
        },
        {
            "review_text": "Gore.Guns.Humor 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Pros: ♥♥♥♥ jokes  Cons: Everything else",
            "review_score": "-1"
        },
        {
            "review_text": "Boring repetitive game, you play on the same areas over and over again .",
            "review_score": "-1"
        },
        {
            "review_text": "please hear me this is is really short really really short easy you don't get alot of weapons and the story is ♥♥♥♥ short and iam only playing this game becuase i can't refund it so yea don't buy it",
            "review_score": "-1"
        },
        {
            "review_text": "It's like borderlands only not funny and boring.",
            "review_score": "-1"
        },
        {
            "review_text": "-Wong: Ban ♥♥♥♥ing zai you ugly son of a ♥♥♥♥♥   ♥♥♥♥ing awesome game DOOM with swords AND Asians  11/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "The game's multiplayer is actually WORSE than the singleplayer. Obviously not designed for multiplayer and is very low quality, like it was tacked on near the end of development. :((((((((((((((((((((((((((((((((((((((((((",
            "review_score": "-1"
        },
        {
            "review_text": "I was expecting Shadow Warrior 2. Not some borderlands type game with barely any story, lame level design, and a lack of comedy that the first one had. Some cutscenes just teleport you to a place and your like wtf happened?",
            "review_score": "-1"
        },
        {
            "review_text": "stop looking at the bad reviews and GET THIS GAME!!! so fun not even joking",
            "review_score": "-1"
        },
        {
            "review_text": "I really feel duped into thinking this was local coop. unfortunately its online coop only",
            "review_score": "-1"
        },
        {
            "review_text": "killing Floor 3  + good story  - same npcs over and over  + good guns   Shdow warrior 2 (killing floor 3)  All i did was shift,jump,shift,jump needs more npcs and free roam and cars .  2 hours of game play... 6/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "I'd love to give this a good review, however, the game was crashing on me during the loadscreen so I couldn't really get a chance to see how the game worked. Whenever I went to go make a new character the loadscreen would start then the game would stop responding. I know people are giving this good reviews but it's hard to give a good review when you haven't been able to play at all.",
            "review_score": "-1"
        },
        {
            "review_text": "Thought I was getting a sequel to the Shadow Warrior 2013 reboot, but apparently I got Borderlands with a Shadow Warrior skin over it. The combat now feels really weak and you get an infinite amount of little upgrades you have to juggle around with. You also get a lovely little hub where you get sent off to do real neat fetch quests in a wonderful randomly generated map. Really expected this game to be much, much more. If you're looking for an actual sequel to Shadow Warrior, don't even bother.",
            "review_score": "-1"
        },
        {
            "review_text": "meh. the best i can give is meh. sorry Shadow Warrior 2 fans. I'm just not that interested",
            "review_score": "-1"
        },
        {
            "review_text": "Yo this game is for boy poosyes and twinks. If you buy this, I want to see you publically lynched. I want minors to throw smooth stones at your limp corpse until they no longer understand trauma or basic human altruism! Sorry just the truth! Just the tru-uth!",
            "review_score": "-1"
        },
        {
            "review_text": "right so at first was going to give it a 8/10 but seeing the game is broken after beating it 2 times one time norm one time on hardest setting bothe times AFTER I KILL THE BOSS u get no LOOT it will show u a CUTSCENE while this plays u can see the loot laying on the floor after the cutscene u get send back to main menu.............. so long story short when u kill the last boss in game u get RESET BACK TO start of game........ insted of getting loot!!!  its beyond me how a game studio makes games and make it this glitchy/bugy   im like 99% sure this is a glitch/bug but it defeats PLAYING THE GAME if u kill last boss and get a kick in the back why play it??????????   so if u like a good game with broken end game content then this game is for u!  did i mention when u go in NG+2 all loot will scale down what this means is that u would get loot lvl 70 normal play thru then in ng+2 u get lvl 9 items ALL OVER AGIAN.....  it seems like the balancing of the game is HORRID also like how the end game sword RUINS all other weapons.......   did i mention i took 22hours to beat it on NORMAL dificulty. ( used over 50 difrent weapons LOTS OF FUN!!! )  did i mention i took 3.5hours to beat it on hardest dificulty ( used 1 weapon end game broken sword )  so to try and sum it up it plays smooth it has ok design the first playthru...   the 2nd playthru felt very much the same randomly generated maps are not true i saw very much of the same.  connector areas are randomyes but the mission areas are all THE SAME....... so random is not rly random.......... NO MANS SKY ANYONE?????   anyways im very annoyed i just dont understand how something this game breaking is in the game its like they didnt beat thier own game.... if they did they would have seen that get ZERO LOOT after LAST BOSS KILL.... and most likely FIXED IT......   but no this is not a priority this should be fixed YESTERDAY!!!!! rigth so without the GAME BREAKING GLITCH i would rate the game 8/10 now i rate it 5/10 cuz theres no point in playing a game that does not reward u for beating it.   i spend 30 hours in 2 days so ye i figured this out fast ppl with jobs and school they will figure this out in 5-8 days but they will be in the same boat and then the HYPETRAIN will fall everyone is blinded by DI CK JOKES and chopping up mobs..... will wear of fast enuff and ONCE U REALIZE U WONT BE REWARDED FOR BEATING IT well.......  I CAN NOT RECOMEND THE GAME TO PPL IN THIS STATE it wouldnt be fair.... so sorry Flying Wild Hog but fix ur game befor u release it.  5/10 score",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to play this game but for the very long loading I cant say much since now I just got a refund so Ima just leave it at this. It is one POWERFUL game and if u guys decide to purchase this then do so at risk. Since I just got salty for trying to play it. Otherwise if u guys can try not to crash because dat also happens. If not then enjoy this game dat I tried to ♥♥♥♥in play.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just plane fun to play. It's not a deep title but, who cares? This takes me back to the good 'ol days of the likes of Duke Nukem and such. You'll spend so much time crawling all over the map to find secrets. Mad fun. But, beware... The way of the Wang is long, hard, and ribbed for her pleasure....",
            "review_score": "1"
        },
        {
            "review_text": "+Story/Humor and voice acting is quite funny at least i enjoyed it +Lots of weapons for Lo Wang to dismember with +Environments, lighting and particles all look great +Music is good and done well  -Bullet sponge while improved with balance changes still exists -Repetativeness really starts to show and the amount of grind is unreal  *No Longer Issues (Fixed in recent patch) Bad Performance runs even worse with new patch Not balanced at all upgrades don't do much against elites/superiors on higher difficultys insane 31/51+  Overall, I think the game is rather fun and enjoyable even though it's not near as good as the first Shadow Warrior, but the recent patch ruined it for me and the experience.  *Update as of 10/26: The new patch fixed some of the bad performance and balance issues in which now make the game more playable and fun! I have updated my review.",
            "review_score": "1"
        },
        {
            "review_text": "Shadow Warrior 2 is an explosion of fun, blood, guts, guns, blades and mobility. A ridiculously over-the-top massacre with the sole purpose of being enjoyable. Stuff explodes and breaks apart everywhere all the time as blood and viscera sprays all over the place and there's this juvenile sense of fun in it. It has a strong 90s feel in those areas. It's a kind of a game that has tons of shortcomings but I just didn't care and enjoyed myself all the way through. The slaughterfest that it offers is just really satisfying. Not to mention the game looks absolutely stunning.  With that said, the open nature of the game with the overworld map, side quests, loot and leveling is a double edged sword. It has potential but feels subpar and rushed. The non-combat areas are pretty lifeless and dull, especially when compared to the lore that's incredibly abundant in the game. You're constantly drowning in upgrade gems that kind of blend together too much and it's easy to lose track of your stuff. The semi-random levels do not have a whole lot of pieces to offer so you're gonna see the same bits over and over in seemingly different parts of the world and, to be perfectly honest, the diversity of the environments is not as high as in the SW'13. The game has a decent amount of content but the story lacks any kind of meaningful conclusion.  Compared to the previous game though, it has a much better feel to the combat. The enemies are no longer bullet sponges that take forever to kill (might still be the case on higher difficulty levels). Guns are, for the first time in a FWG game, actually fun to use and as far as melee goes, watching enemies getting sliced into bloody pieces is as fun as always. Especially the movement is a huge step up from SW'13. No more pointless stamina bars: you've got an infinite sprint, double jump, dash and ZERO fall damage. That let's you just glide and fly through the environments like a badass ninja should be able to.  I think the best way to go about it is to approach this game as a stress reliever and stick to Easy/Normal. Do not overthink it, sit back, laugh at cringe-worthy jokes and enjoy the carnage.",
            "review_score": "1"
        },
        {
            "review_text": "Shadow Warrior 2. This is the CharDee MacDennis of games.  It's like all those other games you play, but better!",
            "review_score": "1"
        },
        {
            "review_text": "I was skeptical at first of the procedurally-generated level and loot, but i've come to really like the gameplay in this game. The movement mechanics are fast and fun, and the large weapon variety and different 'gem' combos makes experimenting interesting. Much faster than the first game in terms of movement, and enemies are generally less bullet-spongey. The levels are pseudo-procedually generated, basically there are sections which are combined together to form a level, sort of like Diablo 2. Thatnkfully there are still secrets, and because the levels are more open-ended they encourage exploration. The performance is mostly good, with some minor lighting bugs and sometimes the UI glitches out. Sometimes it slows down during heavy fights with lots of enemies or explosions on the screen, although that's probably not the game's fault, just the amount of stuff going on. Visuals are nice, a bit better than SW2013 although the character models are kinda eh. Still the enviroments and guns look great. The story and background lore is interesting but the characters themselves are all massive ♥♥♥♥♥, which I suppose is the point. The humor, well that will be up to you. I found a lot of the jokes funny just because of how childish a lot were but I can understand if someone would be annoyed by the relentless amount of jokes. Overall this game was extremely fun, especially if you don't mind the loot-based mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "I don't ever (and I mean ever) pre-ordered a game on principle but this one looked too good to pass up. I'm glad I was right. A superb, over the top gorefest (think Borderlands with swords and more customizable weapons). The swordplay at hand is excellent and very satisfying. Watching enemies arms fly off and land ten feet away doesn't get old and I couldn't help but laugh the first time I saw it. The weapon customization options are plenty and a little overwhelming at first but you soon develop an attachment to your personal favorites. It's hard not to feel like a badass when you take on 15 enemies and systematically hack, shoot and blast them to pieces. The story is over the top and ridiculous as the gameplay but there is a certain amount of depth and dialogue from the characters especially in regards to your traveling companion. Don't expect the Witcher 3 character development here, that isn't the purpose of this game.  The graphics are nice; again, it's not the Witcher 3 and there are some areas of clipping and a few bugs here and there but overall it's very easy on the eyes especially when you're flying through mounds of bloody piles. I'd recommend this game any day. It's fun for a twenty minute mission or a two hour slog- I've been playing for around 9 hours now and am only about 20% complete (side quests included) and there's enough content here to keep me going for a long time. Pick it up even if you're not particularly a fan of the genre (I wasn't really before playing it). It'll grow on you over time. Edit: Upon completing the game, I loved it even more. Simple as that. Not to give anything away but there will definitely be a sequel. Great to see and feel from the producers.  Chop-chop motherf*ckers. Get hacking.",
            "review_score": "1"
        },
        {
            "review_text": "So... Shadow Warrior 2. If I had to rate this Wang from Lo to tough, I'd give it 'rock hard'. The fighting, whether you'd use guns or swords, everything feels satisfying and impactful. Only nit-pick are these crystals to upgrade your weapons. Neat effects, but it's a chore to manage them all. The story is negletable, but the very last fight... god damn... literally. Graphically and aethestically this game is georgeous, but the colours happens to blend with the enemies and it can get quite confusing. The playtime is... pretty short. I played through all missions and side-mission straight and got 14 hours out of it. I smell DLCs... but it'd still worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Finished first playthrough on the 3rd difficulty.   Pros 1. Its fast-paced, enganging combat with switching between ranged and melee, moving, jumping and dashing around quickly to avoid damage and its fun to do it. 2. Tons of weapons to play and customize with. That includes dual wielding, explosive ammo, charge shots, elemental effects and etc. And various weapons have different unique attribute.  3. Run's pretty well on a mid range GPU (GTX 960). 4. Environment graphics and level design is great. With various video settings to add some spice to the overall experience and tweak to your performance liking.  Cons 1. Cluttered loot system. Inventory drowned with weapon mod pickups, lack of item sorting thus everything is in a list and you need to go through them 1 by 1. 2. Finished in roughly 20 hours, I'd say it's rather short for a loot shooter type of game similar to borderlands. Eventhough the first Shadow Warrior is roughly at the same playtime, the game should have more end game features like for example endless horde survival, arcade mode and so forth. 3. Despite environment graphics looks good, the models does not. Models texture looks blurry and not stylized like most of the 2016 titles, body parts clipping, thus not much immersion to the overall experience. 4. Lack of boss fights variety compare to the first Shadow Warrior. This one is sort of a disappointment.  It was said that there will be content updates soon. Will update more after trying out.   For now, do I recommend people buying this? If you love loot shooters, dashing around like a ninja and hacking enemies to pieces with your melee weapons or blowing up enemies with many ranged weapons. Then yes. If you prefer a story driven shooter like the previous title, with no fuzzling with items and loots, better character design and development, more enemy and bosses variety, then it's a no.  If you're somewhat in between, I recommend getting it on a sale. Although the full price it offers isn't as expensive as AAA titles.",
            "review_score": "1"
        },
        {
            "review_text": "Did you enjoy borderlands but wished it to be more gore ? Well then, this is the game for you.  The only complain I can throw at this game is the lack of end game. A fun end-game mechanic could increase much more the life of the game. Right now you are kinda limited to the small amount of content. It is still great fun.",
            "review_score": "1"
        },
        {
            "review_text": "too fun in this game i like it",
            "review_score": "1"
        },
        {
            "review_text": "What an awesome game ! A good, Fun, Fast paced Old School FPS with tons of secrets, plenty humor and a perfect gameplay !   It looks good, sounds good, plays good, runs good   May well be the best FPS of 2016",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorites. Definently in my top 3 games of 2016. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Deadpool mixed with borderlands mixed with ninjas. I'm in.",
            "review_score": "1"
        },
        {
            "review_text": "2 Hours in and haven't found a thing I don't like about the game. Childish humor, intense combat and great loot system.",
            "review_score": "1"
        },
        {
            "review_text": "This GAME IS GOOD!!! IT RUNS REALLY WELL but im not sure how to download the dlc or if it is even out yet can anyone tell me please",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game thus far. Runs great. From a top notch dev team. Good to see things like nvidia multi res added. Running on ultra at 4k with a gtx 1080.",
            "review_score": "1"
        },
        {
            "review_text": "It's a very nice game so far, certainly it took a while to start, I really disliked the first couple of minutes with this game, I think mainly it was because I just didn't understood very well certain things with the menus, and stuff, but after pushing through that the game has truly become an incredible experience, just a very brutal, very fun and enjoyable game, in my opinion the comparison between this game and Doom, as well as Borderlands, are comparisons that are unjustified, there are people that haven't even gotten past the first tutorial mission and are complaining about this stuff, heck there are people that are not even playing the game and they're complaining about this stuff, which it's a shame for them, because they're missing out on a very fun game.  So far at the very least.  There are a lot more missions as well as much more weapons than the first game, I think the important thing to question it's not if this mechanics are wrong to show their presence in here, but much more, question how can this mechanics work with the old mechanics of the original remake, and they work, I think, in my opinion they seem to complement pretty much everything, ranging from the gunplay, to the upgrades, the customization, everything just carries a lot of personality, functionality, and heart, it's one of those games that you can tell the artists even had fun designing the smallest, of the smallest of details.  I really appreciate everything they've done, I think Flying Wild Hog (the developer) made a slight mistep with Hard Reset Redux, but frankly this completely reinvindicates every bit of confidence I have had, and always had for them, pair that up with the incredible optimization, the wonderful comments that clearly seem to understand what's wrong with drm, and well... You pretty much can look past and see the real developers intentions without even trying it, it's a joy when developers are as transparent with their game, as they are with their fanbase, this is a massive improvement, and so far, in my opinion, and underrated game, even after noticing the 8, and the 7, the gaming press has given to it, altho, overall, it's been a very positive reception, I wish the best to this developers, as well as to the publisher, Devolver, Flying Wild Hog, all of this guys have truly done something, i'm not only talking about this game anymore, i'm just talking generally.  It's just nice I guess to see the maturity in their game design coming from something like Hard Reset (which was an already pretty good game) to something like this that's truly a demostration of the gap that can cause just a couple of years in creators, and creations alike.",
            "review_score": "1"
        },
        {
            "review_text": "So far as I can tell it's pretty good, Co-op was a great addition. If you like RPGs, shadow warrior, and jokes, then get this game.",
            "review_score": "1"
        },
        {
            "review_text": "My Wang is rdy for some hardore action!",
            "review_score": "1"
        },
        {
            "review_text": "Great optimalization, funny, full of action, some rpg, awesome main character ! Superb fps ! If You like fps , this is must buy. Just better version of part 1 !",
            "review_score": "1"
        },
        {
            "review_text": "Great game, must have for all coop Gamers.",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced, ridiculous, ludicrous amounts of Wang. two thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "If you loved the first one then get this one!  DON'T THINK ABOUT IT! JUST DO IT!",
            "review_score": "1"
        },
        {
            "review_text": "I put my Wang in things, they either fall to pieces or burst into tears...  Either way there is enough wang to go around.",
            "review_score": "1"
        },
        {
            "review_text": "Shadow Warrior 2 is incredibly awesome. Despite each world being procedurally generated, none of them feel like they are. Fast-paced gameplay and tons of weapons and powerups. Definitely worth the price tag and even more so if you already own the first and get a discount. Highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Not much to say...  Shut the xxxx up and take my money :) really nice to play .  Absolutely not wasting ur money to buy it . got a little bit hard to kill that demon :) need skill ,sound like Doom ... 100% good game (Can help you relieve a lot of pressure). Trust me :))",
            "review_score": "1"
        },
        {
            "review_text": "I don't have much time you know monsters to kill and other wangtastic things to do. Just buy the game already or do you need to read more people saying I &amp;$@&amp;ing love this game",
            "review_score": "1"
        },
        {
            "review_text": "So nice.... Play this to wating for Half Life 3...^^",
            "review_score": "1"
        },
        {
            "review_text": "Hang out with your Wang out.",
            "review_score": "1"
        },
        {
            "review_text": "The combat system allows the player to play many different ways. The loot system is eh, and the weapons are pretty cool. 15 hours in and I am not tired of it at all.",
            "review_score": "1"
        },
        {
            "review_text": "Wangtastic.",
            "review_score": "1"
        },
        {
            "review_text": "Pros  +Very good graphics, weapon models, and animations. +Amazing soundtrack. +Hillarious dialogue. +Interesting story (up until the ending, anyways). +Large variety of weapons to choose from to meet your enemy slaughtering needs. +Pretty good RPG aspects to improve certain parts of your character as you progress. +Weapons feel impactful as you slice, dice, and explode your way through groups of enemies. +Loot upgrades allow you to make your weapons even stronger, allowing you to kill even more enemies faster. +Large maps to explore to find chests, secrets, or side bossess. +Maps are diverse enough to not cause visual burnout. +Good enemy variety throughout the levels. +Decently challenging, however becomes a little too easy once you get certain weapons and skills. +Variety of skill upgrades allow you to choose the way that you play, with the option to reset at any point in the hub world.  Cons  -Multiplayer feels tacked on. Inviting friends is a chore, lack of in game communication method, co-op specific bugs, story progress made while playing co-op will not transfer over to your solo game, some enemies (such as the bunny lord) do not drop loot for clients, some quest rewards are given to the host only (such as the 'Like the Wind' skill), requires insanely good connection from both the clients and the host in order to not experience lag, unable to change game from public to invite only (or even from single player to multi player) once you have launched the game, some achievements do not track properly during co op (such as the 50 vanish kills), chests are opened locally and not globally so every player has to open their own chests, and only the host can progress the quests forward. -Framerate drops in later areas of the game when 5+ superior or elite enemies are on screen. I don't have the perfect computer, but sometimes my FPS would drop to below 40 when fighting groups of superiors. I would also occassionally encounter freezing for brief seconds when speeding through an area and hitting a checkpoint. -Some of the weapons are way too underpowered (such as the infinite ammo SMG) and other weapons are far too strong (such as the Arm of Orochi). I would have preferred having a more balanced variety of weapons so I don't have to ask myself towards the end of the game 'Why am I even using this weapon?' -Too many upgrades are thrown at you. There are so many utter garbage upgrades that you pick up along the way that just clog up your inventory (even if it is limitless). -Crafting unlocks way too late in the game and only gives you upgrades based on what part of the story you are at, not based on what level your character is. You also lose access to crafting on new game+ until you reach the point in the story again that it unlocks (although due to crafting scaling to story progress it isn't worth crafting until you are at the very end of the game.) -No effective mini-map. The mini-map in this game is not very good. I wish there was a bigger version you could use to see the area as a whole that you are in and not just a slightly bigger version when you push m.  Even though I went more in depth on the negatives than the positives, I would still recommend this game to people who want a fun single player experience with lots of fast paced combat and mayhem. It can also be really fun when played with friends, but be warned of the co-op specific bugs that exist. To avoid some of the bugs, I would recommend making it known via voice chat when the host is moving since some of the bugs occur when the clients are messing around with their inventory during a teleport.",
            "review_score": "1"
        },
        {
            "review_text": "I love the Wang! I thought that nothing can really do better than Doom 2016 for 2016 FPS wise (not a fan of BF) But I admit, DEEPLY SO, I was WRONG. The Wang is the chosen ONE, the one to rule them all, kick them all in the as* and do it all in style and ABSOLUTE PURE FUN dark comedy. Not as serious as the first Shadow Warrior. RPG element, at its core where it really counts is the style and combat that simply works  that ORDERS YOU TO HAVE FUN CRACY Joyous MOMENTS of game play, this is what games should be all about...fun!. IT would be shame for anyone to miss this gem of an FPS games, WeLL Done to the developers you have NAIL it! I Love you and please do it again! TAKE MY MONEY!  ",
            "review_score": "1"
        },
        {
            "review_text": "Great game well worth the $.",
            "review_score": "1"
        },
        {
            "review_text": "It's Asian borderlands 2. The dialogue is so stupid, it's awesome. Just started playing it, loving it so far.  My Wang ain't Lo anymore...if you catch my drift ;) ;) ;)",
            "review_score": "1"
        },
        {
            "review_text": "'The 'Way of the Wang' is long and hard...and ribbed for her pleasure.' -Lo Wang  Pros *Beautiful graphics *Excellent attention to detail in the gore *Mindless Fun *smooth and refined movement system  Cons  *Lack of story or character depth *Mediocre multi-player *Lack of replayability *Too many ♥♥♥♥ jokes  The core gameplay is beautifully crafted. The combination of stunning graphics and precise detail to how your sword creates gore or even affects walls and objects makes this game very satisfying to pick up. The nifty moveset accompanied by the protagonists cocky one-liners makes it so that you can't help but feel like a bit of a badness. With a nice selection of weapons and the ability to keep every gun and pick up you get, Shadow Warrior 2 gives you the freedom to be the ninja assassin you always wanted to be.  The genius of the game begins and ends with the gameplay however. The story isn't very long or deep and the characters aren't much either. The protagonist is an obnoxious narcissist named Lo Wang who can't stop making bad jokes (although a couple of them do land). To be honest, I think the developers intentionally did this as some kind of jokes itself. The fact that he is not funny...is funny.  Still it's nice to see a game that prioritizes gameplay over story and not the other way around. If you want to feel like an unstoppable Ninja with a slightly sadistic nature for 20 hours or so, buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly this will be the most fun you'll have with a video game this year. 10/10 &lt;3 good job Flying Wild Hog and rip my ♥♥♥♥♥ Hoji",
            "review_score": "1"
        },
        {
            "review_text": "Walk around the map found a fortune cookie it says 'Life is a Wang way road'. 10/10 would read fortune cookies again. ",
            "review_score": "1"
        },
        {
            "review_text": "Pro's: *Entertaining story and adolescent humor (e.g. ♥♥♥♥♥ everywhere) *Graphics are wonderful (for the most part) *Controls are on point (read: doesn't feel like a crappy port or clunky controls because of controller support) *Cut scene's enhance and move the story along, but not so much so that game play feels choppy. *Co-op *Improved weapon system over SW1  Con's: *After playing with my bf/f for 3 hours, we were kinda upset to find out when you do co-op only the person who is hosting the game has their story progress. He was still at the beginning while I was on the last mission we had done. *Some of the modeling work is pretty bad--there is an opening scene of a woman and man in an office, and her hair looks so bad, especially considering the detail of the pine tree behind her was crystal clear, so much so that I could see each individual pine needle (gtx 1080 ftw!). So, she was either rushed or someone messed up with some of the models because she definitely could use some more work.  For the price, this game is well worth it. If you like to play games with friends, and want something that you can play over and over again with increasing difficulty, this is definitely a great choice. Graphics wise, I'm in love with a lot of the landscape/building detail, even if they did mess up on a few human models. 10/10 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Coop is a blast. After all, two wangs are better than one.",
            "review_score": "1"
        },
        {
            "review_text": "Overall, a very good sequel to the reboot, though it has some flaws that make it not as good as the brilliant reboot. I'd still heartily recommend this one, but just be aware that it's not quite the same kind of game that the first reboot was anymore.  Pros:  -The noment to moment gameplay loop is still top notch. Melee combat is still great, and the weapons are interesting and feel good to use. Combat is still super fun and fast paced. -The story is interesting, with decent voice acting -The humor from the first game is still very present here -Sidequests add some extra fun things to do, though it makes the game feel a bit more meandering. -The game looks beautiful. Graphics are top notch.  Cons: -The borderlands-style loot system is too complex for what this game is meant to be, in my opinion. I'm here to chop up a bunch of demons, not stop very 10 seconds to vacuum up all this loot and then try to figure out whether this new '+4.5 damage, -1.5 movement speed' socket is better than the one I already have. It breaks up the action and makes the whole game feel less tight. -On a related note, the random level generator they touted is a nice idea, but in practice it made the levels feel empty sometimes, without even any enemies to fight. Entire buildings were just completely barren, with maybe only a chest sitting in the middle. It really is jarring when you compare it to the great art design of the one-of-a-kind sets they made, both in parts of this game and the last one. I honestly think I'd prefer fewer but custom designed areas, rather than this huge number of samey, empty feeling areas. ",
            "review_score": "1"
        },
        {
            "review_text": "Please.... Dlc.... I need it....",
            "review_score": "1"
        },
        {
            "review_text": "KILLER game. still not playing? == wasted life",
            "review_score": "1"
        },
        {
            "review_text": "lu wang, f#$k yeah!   Am i the only one missing dem handgranades ?  buy that game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is legit! I recently finished the first game and I can say, without a doubt, this is one of the best hack &amp; slashes on PC.   BUY THIS GAME!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing sequal to the original just need more time to play",
            "review_score": "1"
        },
        {
            "review_text": "Could use more wang jokes but otherwise a decent game",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game with amazing weapons and ofc Lo Wang.",
            "review_score": "1"
        },
        {
            "review_text": "I may played just a bit, but still this is one of the best games that came out in 2016, it just lack a couple of things like dynamic side quests and real open world, oh and better loot &lt;3 Beside that, this is one of the best game from polish devs that I played.",
            "review_score": "1"
        },
        {
            "review_text": "Just enough wang  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Despite some dodgy jokes, this game just plays amazingly, with great weapons, powers and enemies to fight. It's just damn fun!",
            "review_score": "1"
        },
        {
            "review_text": "I have waited for this game since it was announced. is it like the last Shadow warrior? not really, but does it kick the most ♥♥♥? you bet your Wang loving ♥♥♥ it does! It mixes the gory loving combat of Shadow warrior and mixes it with Borderlands style rpg and combat. Shadow Warrior 2 prooves that some sequels could be even better than the original (in this case the Shadow Warrior reboot)",
            "review_score": "1"
        },
        {
            "review_text": "I played this game, and I thought it was fun.  I checked my watch, it was 6 am. I had been playing this game for 10 hours straight. I then thought this game was addicting.  I'm still playing it, now I think I need rehab.",
            "review_score": "1"
        },
        {
            "review_text": "Not better than DOOM but still a really good game to get lost to for hours.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, hope they keep more good content coming for this game and not screw it up like alot of other companies have.",
            "review_score": "1"
        },
        {
            "review_text": "I have mixed feelings about the Borderlands-type system, I still prefer the traditional shooter scheme and the game could've just revamped its style with RPG elements and the like. Still, the performance is amazing, great graphics and playful gore.",
            "review_score": "1"
        },
        {
            "review_text": "Shadow Warrior 2 is a First Person Shooter that scratches the itch that many FPS don't do today. This game puts you against thousands of enemies with thousands of interesting weapons and styles and lets you just have unadulterated fun just letting off steam. Coupled with the fact it has 4 player co-op, tasteful vulgar humor/puns, and fast-paced movement to keep you in the action; this game hasn't disappointed me yet.",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous graphics, addictive gameplay, funny dialogs.  Some of the critics are true: yes, the story isn't as interesting as in the previous SW, yes, the looting-system isn't that great and I also kind of missed the more-linear-but-better-guided-kind-of-gameplay from the previous SW. BUT, hacking through masses of enemies in that really gorgeous graphic and smooth 60 FPS is just so much fun that I'm currently playing it for the second time and I think a third probably will follow.  So, buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Would Wang again.",
            "review_score": "1"
        },
        {
            "review_text": "great game, MORE BLOOD FOR THE BLOOD GOD!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome graphics, doom like gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Like Borderlands, but actually enjoyable if played alone. Levels can feel repetitive and some enemies are reskins of other enemies. But who cares. You'll be too busy slicing, shooting, and super powering to notice or care. The co-op is just and added bonus. Grab a friend and your favorite weapon and get ready to unleash to beast. Who wants some Wang.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've played in a long time",
            "review_score": "1"
        },
        {
            "review_text": "It's like playing fps garen with the amount of spinning that I've been doing. That being said, it's kind of like borderlands with more movement based combat and aside from mediocre rocket launchers, it's pretty fun. On a side not, dont keep dashing backwards or you may find some more friends.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of ... if not THE most optimized game iv played in almost a decade. Minus some of the muddy textures on some of the people ... and the odd akimbo/dual wield animations.. this game is a must buy for thos looking for a fast frantic shooter with just enough differant to keep it intertesting... also .. tons .. of... weapon .. types :D   Edit: As of 1.1.3.0 patch doing a huge pass through of drops... and balence ... the game has gotten even better.. .. sad to see some of the bugs gone.. 'looking at you king skeletor xD' .. but over all the quality.. and difficulty has been made much more solid.. at least in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "An extremely fun and rewarding game! My personal GotY so far.",
            "review_score": "1"
        },
        {
            "review_text": "Great freaking game, if you enjoyed the reboot of Shadow Warrior then youll freaking love this game. Combat is super fluid and the new weapon customize system allows for a great deal of diffrent tactics in the combat that just keeps it fresh.",
            "review_score": "1"
        },
        {
            "review_text": "'this game sucks' -20 hours played, released yesterday.  Runs smooth, plays like doom and d3 combined, massive customization, squillion weapon choices, bunnies sometimes become demons and terrorize you in your sleep.  Great game would spend rest of weekend on it again.",
            "review_score": "1"
        },
        {
            "review_text": "BE VEWY VEWY QUIET. I'M HUNTING ♥♥♥♥♥♥♥♥S  Okay I'm just gonna say so far so good. Will update later.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. Hack and slash and shoot til it's all dead. Humorous Lo Wang is back.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Serious Sam and Borderlands had a baby.",
            "review_score": "1"
        },
        {
            "review_text": "chinese please",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥ing ♥♥♥♥ this game is nice. Lots of weapons, sick magic skills. just need someone to play it with.   Edit: Found a lucky cookie with the text ''Wangs out for Harambe'' on it. 5/7 best game 2016,",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic! There's so many weapons and ways to customize them, and the sense of humor is still intact! Loving every minute! The one thing I was worried about was that weapons would become obsolete quickly, like Borderlands or Diablo, but they don't as far as I can tell. Still using the default katana, because it is awesome, despite the fact that I now have one of the Oni Blades, or the dual swords. Every weapon is fun to use, and all are upgradeable! Awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "I loved everything about the first Shadow Warrior remake/reboot. And this just adds so much and builds upon that. It's like Diablo meets Borderlands in a demon ninja Shadow Warrior worldspace. Diablo like enemies like the tiers of the same mob etc etc and Borderlands style loot and shooter. Great FPS, gore, and Comedic fun. I couldn't not recommend this and the First one. If you love the old classic style FPS's like SW, DOOM, and Duke Nukem. You'll love the modern spin on this old 'OG' classic FPS. Love Shadow Warrior and thank you so much Flying Wild Hog and Devolver Digital. This game runs, looks, and plays so ♥♥♥♥ing beautiful. I only played 2 hours so far(at the time of writing this) and already know it's completely outstanding. I hope you get to experience this amazing FPS game. If you're tired of COD and MOH, give this a wild shot in the dark. &lt;3 Spread the love of the classics. Get the modern ones so we get more good FPS goodness that's a newage of old times.",
            "review_score": "1"
        },
        {
            "review_text": "First things first, exploding demons and slicing a yakuza in a hundred pieces is one of the things that bring the most satisfaction after a day of work. This game is right now one of the best games I ever played. Why? Let me do a axplanation :  PROs -The grafics are great, even if I don't play it with max graph because my PC is a piece of s*** -The story is great from the begining to where I am now in the game -Lots of weapons, and they are so damn cool  -The gems to enhance the wapons make them cooler -Monsters aren't as dumb as we think, but when you expode their face wirh a shotgun who need a brain? -The abilities are so badass, but I rather use the mode my bullets to speak -Sword... what to say about them execpt that you look like a total ninja when you bring down a horde of demons -Lo Wang is like a Deadpool 2.0 with his puns 'shh, i'm hunting d*ckheads' CONS -Sometimes when i used to much a grenade luncher (ehehehe) my fps drop drastically, but maybe its just my toaster like PC -Its hard to only use sword, even harder when theres a lot of small demons and you keep slashing over their heads -This game is so damn addictive. What? Is that even a con?  In conclusion, buy this f***ing game and follow the hard and long way of the Wang",
            "review_score": "1"
        },
        {
            "review_text": "I have no words to describe my feelings right now.  Ive just completed this game on highest difficulty and the adrenaline is still pumping through my veins. This is next level. DOOM is nothing compared to this game. Just try it out for yourself and you'll understand that Carmack was dicking around for 12 years while a bunch of badass Polish guys perfected their awesome Shadow warrior in just 3 years. This is one of the best games I have ever played and Id just like to say Thank You to Flying Wild Hog. This is truly a masterpiece. I hope now people will know what good gameplay and supreme graphics are, and that they don't require millions of dollars (Hey, Destiny) or being a 100-th installment in series (Hey, CoD).  And by the way, look at the price. What are you waiting for? Buy a million copies for your friends and go smash some demon skulls!",
            "review_score": "1"
        },
        {
            "review_text": "How to infiltrate the Yakuza:  1) remove yakuza head 2) bypass retinal scan with yakuza head 3) ♥♥♥♥♥ joke",
            "review_score": "1"
        },
        {
            "review_text": "Shadow Warrior 1 was Awesome!!!! Shadow Warrior 2 Is EPIC!!!! Love this game!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Do you like Diablo? How about Borderlands? Do you love having so much loot you don't know what to do with it all? Combine all that crazy ♥♥♥♥ with some amazing first person melee/shooter mechanics and you have my game of the year. This game does not dissapoint. You think it's going to be linear, boring, and almost like DOOM? NOPE! You can be whatever you want to be the custimization in this game is insane. Every weapon you make is unique and you're going to have a blast strategizing new ways to blast your foes with your wang.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say that hasn't been said yet???  Life is great....Life is hard...LIFE IS WANG!!!!!  Seriously game exceeds expectations. Fluid, beautiful gory madness. It plays great on my gtx 760 2gb with high textures. It's so well optimized. Big devs could learn from these guys. This is how a game is released!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game had me a Wang.",
            "review_score": "1"
        },
        {
            "review_text": "great game 22/10, would buy shadow warrior 3.",
            "review_score": "1"
        },
        {
            "review_text": "Some of the most visceral combat and entertaining gameplay I've ever witnessed in a game. A shame that even with all the side quests added up the game only takes about 14 hours.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say? Solid game, nice graphics, great performance and loads more one-liners. What are you reading this for? Go get some Wang!  Still here? Very well.  Shadow Warrior 2 takes the great sword combat and shooting from part one and adds Borderlands style collecting and upgrading, skills and also adds side missions. The upgrade system improves damage and resistance to damage and allows you to add several improvements to each of the many weapons in the game. The weapon loadout is impressive and nicely varied. Besides the many sword variants there's anything from a bow and arrow up to a nail gun. Side missions can be collected from characters in the main hub map and serve to provide skill points for unlocking and improving additional combat and support skills. Skills improve health or chi (used to power abilities) or add new abilities you can use in the game. You also collect money which you can spend in the stores to buy more upgrades (and sell the crap ones). Don't like the collectathon? Then ignore it and slice your way through your enemies the hard way. Just fit in the highest level upgrades every once in a while and you'll be fine. I personally wish I didn't have to rely so much on the minimap for finding chests and items, though. The cluttered maps sometimes make it difficult to recognise things.  The story and the writing are okay. The humor is what it is and can sometimes be funny, sometimes not. If you already played the previous game, you know what you are in for. If not, you didn't really miss out, storywise.  From the technical side you get a very well optimized game that can really look quite pretty. There are loads of settings to tweak to further improve the visuals or the frame rate. All in all Shadow Warrior 2 is a technically very competent PC title.  There's also coop, though I haven't tried that yet.  This is a solid if not perfect game that is definitely worth its asking price.",
            "review_score": "1"
        },
        {
            "review_text": "This game is damn fun.",
            "review_score": "1"
        },
        {
            "review_text": "It feels like  Borderlands + DOOM + Shadow Warrior 1 + Wang  Diffculty Play on insane recommended   ",
            "review_score": "1"
        },
        {
            "review_text": "Doom + Borderlands + amazing graphics. The art and engine are awesome! Flying Wild Hog is amazing! ",
            "review_score": "1"
        },
        {
            "review_text": "It's bloody fun!  Also, for once a game where recommended specs actually mean you can run it at 60+ fps on 1080p ultra. Not capped at console peasant 30.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game!  +Fun combat +Music +Grapich +Fun skills  +Alot of loot! +Gore  ",
            "review_score": "1"
        },
        {
            "review_text": "PROS ------ The game has difficulty levels to test your skills and the higher the difficulty level the better the loot! There is a nice variety of different creatures too kill, a lot with their own unique styles too fight you. There is your basic small enemies, than big enemies, Than elites that drop the nicer gear. Lots of cool skills you can unlock, like Ninjutsu magic!   Tons of weapon customisation, that is mainly what you will be killing monsters for is to find nice mods to make your weapons more awesome.  The game has double jump feature and a dash you can use for a quick movement to dodge or get around, the dash can be comboed with a jump to do a dash/glide across the sky, and you can also sprint by double tapping the forward movement key.  The gore in the game is pretty epic, basically you have to deplete the enemies health and then that last swing or blast will be the nice gore finisher that you will enjoy most when killing things. you can still dismember a few limbs and stuff before you get too that nice finisher also :D  The game has a lot of fun cheesy humour in it , and a lot of awesome hidden secrets. --------------------------------------------------------------------------------------------------------------- CONS ------- The co-op mode has no chat box to type to your friends and I have not seen any microphone options, you basically have to set up a steam chat to talk to friends. Also it is hard too make friends in the game as there is no option too add them even if you check your recent steam game history for people you have played with. So basically you are playing with no way to communicate to other people usually.  That is the only con that I really care about.   I think the game is awesome and it can be repetitive but that is just the way the game plays, because you are suppose too test yourself through the harder difficulties of the game too earn better loot and become a bad ♥♥♥ ninja warrior gunslinger.  A lot of the weapons you get will start too seem useless as you play through and find better ones. There is a nice variety of different weapons in the game to unlock and eventually you will have a nice set up of all the stuff u like too use and have them all modded out nice the way you like. ---------------------------- Over all , I totally do recommend this game, I think it has awesome game play. I like how you play through the difficulties too get better loot and I love all the cool skills/abilities you can unlock.  I JUST REALLY REALLY HOPE THEY ADD A WAY TOO COMMUNICATE TO PEOPLE IN CO - OP!!!!",
            "review_score": "1"
        },
        {
            "review_text": "MRDA JAK HAJZL !",
            "review_score": "1"
        },
        {
            "review_text": "Excellent and fun shooter. Campaign is 8-10 hours.",
            "review_score": "1"
        },
        {
            "review_text": "I wrote this review just to raise the percent of positive reviews. Not only is this game only 40 dollars, which is 2/3 of what big releases, like this one, should be (60$), but this game also has hot chicks. Unlike ♥♥♥♥♥♥♥♥♥ like Mafia III, this game is so worth its money I can't even explain. I am ♥♥♥♥♥♥ at writing liegit reviews, so keep scrolling for that review that is as long as my ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Great sequel of the great remake of the great game! If like FPS and slashers, BUY IT NOW! 10 Wangs of 10  But it is a fully new game. Keep it in mind.",
            "review_score": "1"
        },
        {
            "review_text": "This game is Wangtastic. 100/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "This game is very well done. It keeps the spirit of the original games while introducing new gameplay elements such as the new weapon system. The sense of humor is great and doesn't feel forced.",
            "review_score": "1"
        },
        {
            "review_text": "Beter than the first! And the first was quite awsome.",
            "review_score": "1"
        },
        {
            "review_text": "Game of the year material right here. Don't pass it up.",
            "review_score": "1"
        },
        {
            "review_text": "Heh there is nothing better to do in life than playing with your wang.",
            "review_score": "1"
        },
        {
            "review_text": "Great old school humor and fun imaginative game play.",
            "review_score": "1"
        },
        {
            "review_text": "I want Shadow Warrior 3!!!",
            "review_score": "1"
        },
        {
            "review_text": "1. Never got to see Kamiko's ♥♥♥♥♥♥s or a QTE sex sequence. 0/10 2. Rest of the game 8.5/10. 3. After I finished the game and was put back into free roam mode, I was overwhelmed by this sense of emptiness. There wasn't anymore story to experience, no new dialogue trees with the NPCs, nothing new to explore. This game actually made me regret that there's no DLC for it. 4. BUY THIS GAME... unless, you know, you're RACIST towards ninjas.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic. We need more 'pulp' games like this flooding the market. Games that are not necessarily masterpieces but that you can keep coming back to, playthrough after playthrough and still be thouroughly satisfied.  Shadow Warrior 2 had me feeling like that 12 year old kid again, discovering the Build and DOOM engine games for the first time. Hexen, Heretic, the original SW - they had this strange appeal to them that kept me coming back and remaining thoroughly engrossed for as long as I could keep my eyes open.  The price is pretty damned sweet, too!",
            "review_score": "1"
        },
        {
            "review_text": "amazing game much comady and so much gore. a really fun game to play with friends and i think it should have SW3 ",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun, had a great time with it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is stupid good! a few very rare glitches here and there, but this game rocks. Funny story line, ♥♥♥♥ jokes, Characters and weapons. I've just finished 'who wants wang' and I'm back into it with 'Insanity'. Great playability.",
            "review_score": "1"
        },
        {
            "review_text": "Good fun with friends.  Pros: Fluid action, good co-op gameplay, good sense of humor Cons: Story does not seem to be strong. Graphics is very bright and colorful but it is not it's trong point.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 slaughter all your foes with your wang.",
            "review_score": "1"
        },
        {
            "review_text": "A piece of top cake",
            "review_score": "1"
        },
        {
            "review_text": "Bloody enough, violent enough,crazy enough.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing. Best single player shooter/action game in years. Need a lot more like this and there's plenty they can do with Shadow Warrior to keep it fresh, so I hope for many more titles in the future.   This blows Doom out of the water in my opinion which is the only real competition for this game that I can think of.   You'll find very little wrong with the gameplay here, extremely well polished, intuitive controls that are easy on mouse and keyboard or a controller (even without proper controller support). My only real gripes being that the loot system could do with a bit of refinement. It's very cluttered and because of this a bit overwhelming but fortunately it's easy enough to keep your character powerful with some quick upgrades. If however you're a little bit obsessive with organisation and always having the absolute best stuff equipped you may need to set that aside with this game otherwise it could ruin your enjoment.   The humor is better than most games...you can't really expect much more than that and if you don't, you'll have a good chuckle.  This game is excellent at what it aims to be. What it aims to be should be obvious but if you're on the fence I'd just take the leap or at the very least wait for a sale. I don't buy full price games much at all anymore but this was well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Most funny I've had playing a FPS! Awesome",
            "review_score": "1"
        },
        {
            "review_text": "Once again another awesome Shadow Warrior game plus the preorder was worth it. Runs great on my system there is alot to do in Shadow Warrior 2 besides slicing people up and shooting things. Secrets are well hidden, Lots of weapons, Free Roam to build up more exp and find better weapons and gems over all i give this game 10/10 i have not experienced any problems with this game since day 1 i recommend this game to every one both new and returning gamers from the first Shadow Warrior.",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it already",
            "review_score": "1"
        },
        {
            "review_text": "Not much to say, it's an excellent game, great humor with awesome gameplay.  I'd encourage all of my friends to play this. An experience never to be forgotten.",
            "review_score": "1"
        },
        {
            "review_text": "The combat improved a lot over the first game. I love how you do a quick slash when you switch to your blade and the new power attacks. Also you can fly over the battlefield due to the lack of stamina and the infinite dashes.  However I dislike the borderlands loot system and the bullet sponginess of the 'special' regulair enemies. So if you are really turned of by unnecessary loot systems don't pick this game up.  Bassicly the 'special' enemies only have a bunch of ressistances and and do elemental damage. It would be a lot more interesting if they had special abilities or attacks diablo 3 style or something but sadly they only do more damage and take more damage compared to the regulair versions.  The loot could be interesting but it mostly just changes damage type and augments stats. It would be great if the gems you slotted in the gun really changed the gun simmulair to path of exileor something.  I think this game has the pottential to be a great singleplayer shooter or a really original ARPG sadly it shoots inbetween both targets missing both.  I still recomend it since the combat, humor and music are just so much fun that I finished the game in 2 sittings.",
            "review_score": "1"
        },
        {
            "review_text": "I was a huge fan of the 1997 original when it came out. The phrases 'Whoooooo wants some wang?' and 'Herro? What died in here?' have found their way into many of my conversations since then. The moment I began playing SW2 I immediately felt that nostalgia and picked up on the style of humor I was so familiar with. The game mechanics are really comfortable and the buildout system keeps each replay fresh. After everything is said and done, I am STILLL a huge fan!",
            "review_score": "1"
        },
        {
            "review_text": "It was fun, but got bored after 10 hours.",
            "review_score": "-1"
        },
        {
            "review_text": "It's so much better than it has any right to be.",
            "review_score": "1"
        },
        {
            "review_text": "Just...total f--king fun, do yourself a favour and buy this immediately. Has pretty good co-op, a lot of story items to collect, a sh!t tonne of fun weapons, destructible environments, awesomely fun swords, and plenty of replay value. The wanky gem system is probably the only real let-down. Play it on hard difficulty, the normal is too easy.",
            "review_score": "1"
        },
        {
            "review_text": "Better chainsword fight simulator than any warhammer 40k game.",
            "review_score": "1"
        },
        {
            "review_text": "cool game wish they could put like a arena mode where u can pick diff monsters that come out that would be awsome replay i think",
            "review_score": "1"
        },
        {
            "review_text": "Doom + Asian Badass + ♥♥♥♥ Jokes = Shadow Warrior 2. I'd say it's pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible. Satisfying the whole way through and just the right amount of challenging.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game to everyone who likes rather classic ego-shooters with a lot of enemies at once and isn't turned off by quite some gameplay elements from an action RPG. It is well-crafted. And melee fighting has the right amount of complexity here as well.  Compared to Shadow Warrior 1 by Flying Wild Hog it has a way weaker story and less rich characters. The gameplay feels different, but there are certain core elements that stayed. Both games have their weak and strong points and I find it hard to compare them.  I had fun with both, but personally liked the focus on puristic singleplayer gameplay of SW1 better.   Still I feel safe to say that Shadow Warrior 2 is a good game and Flying Wild Hog are a great developer team as they seem to truly love what they do. Someone should give them a bigger budget so they can pump up their story presentation and work on a game that combines the strengths of SW1 and SW2.",
            "review_score": "1"
        },
        {
            "review_text": "As good as the first, if not much better.",
            "review_score": "1"
        },
        {
            "review_text": "I will update this review later.  But I just want to say that I'm 30 minutes into the game and it's amazing.  This game is both retro and modern, and I can already see how much replaybility has (you have lots of weapons and skills to choose from) and the combat is really well done.  *The only thing that bothered me were the Questmarkers, But I removed them right away.",
            "review_score": "1"
        },
        {
            "review_text": "good game,act+rpg+fps,chinese,plz.",
            "review_score": "1"
        },
        {
            "review_text": "It is crazy how good this game is. I think I have a new game studio to follow after this game. I bought this game during the Winter sale. However, if I would have known it was this good I would have purchased at launch. If you are a fan of borderlands then you will like this game.",
            "review_score": "1"
        },
        {
            "review_text": "Holy mother of pancakes, batman! This game is so freakin fun, especially on the hardest difficulty.  Pros: -fast paced action -smooth performance -great visuals -great loot system -lots of upgrades and weapon tweaks -open combat environments -perfect combat mobility -co-op -fun bosses and mini bosses -funny humor  Cons: -story is so so -world design feels a bit random  Fixes from previous game: -no more double tap nonsense to use abilitys -better upragades -more types of enemies with more interesting abilities -non-linear environment",
            "review_score": "1"
        },
        {
            "review_text": "This is simply Wangtastic :)",
            "review_score": "1"
        },
        {
            "review_text": "If flying Wild Hog made lager, it'd probably be the best lager in the world. So that says it all about Shadow Warrior 2. Sure, there are some bugs, mostly clipping issues, but the game itself is fantastic and is a must own for anyone who enjoys fun. It's crass, funny, has some RPG elements, and is just a really good crack. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This is the game you buy if you are anal retentive and absolutely HAVE to optomize your character for twenty minutes after every single mission.",
            "review_score": "1"
        },
        {
            "review_text": "Great borderlands style game, the humor is a bit hit and miss. But the gameplay is tight. Must buy for any borderlands fans.",
            "review_score": "1"
        }
    ]
}