{
    "app_id": 32510,
    "name": "LEGO® Star Wars™ III - The Clone Wars™",
    "release_date": "2011-03-22",
    "developer": [
        "Traveller's Tales"
    ],
    "publisher": [
        "LucasArts",
        "Lucasfilm",
        "Disney Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Co-op",
        "Shared/Split Screen",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "LEGO",
        "Star Wars",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 825,
    "negative_ratings": 140,
    "price": 15.49,
    "description": "LEGO Star Wars III: The Clone Wars will allow fans to explore endlessly and laugh their way through the Star Wars galaxy in the most humorous, accessible and action-packed LEGO game to date.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/32510/header.jpg?t=1542758524",
    "minimum_requirements": "OS: Windows XP SP3, Windows Vista® SP2, or Windows 7 Processor: Intel P4 2.24 GHz or AMD Athlon 64 Memory: 512 MB RAM Hard Disk Space: 8GB Video Card: 256 MB Video Memory with Shader 3.0 support; ATI Radeon X1300 / NVIDIA GeForce FX 5800 /Intel GMA 3-Series Sound: 100% DirectX 9.0c compatible Audio Device",
    "recommended_requirements": "Processor: Intel Core 2 Duo or AMD Athlon 64 X2 Video Card: 256 MB Video Memory with Shader 3.0 support; ATI Radeon HD 2900 / NVIDIA GeForce 9800",
    "reviews": [
        {
            "review_text": "Another great game from the Lego Star Wars series! And believe it on not, for a third game in a series, it it quite good. I'm 18 and enjoyed it as well as being begged daily by my younger brothers for me to let them play.",
            "review_score": "1"
        },
        {
            "review_text": "Can kill enemies with Jar Jar  11/10",
            "review_score": "1"
        },
        {
            "review_text": "The good old days before Lego games had voice-acting.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a Lego game as we know them but its also a bit of a strategy game!  They tried something different and implemented a sort-of-strategy mode where you build production buildings and take out the enemies base step by step. Its really great, as are the 'story' and the normal gameplay. Its just a very well made Lego game with a bit of a twist.  Also it comes with a really big 'hub-world' aka. two spaceships, one clone-ship and one of the seperatists with tons of stuff to explore and riddles to be solved.  I'd give it a 9/10 because it doesn't just do the story and is done with it like other Lego games did. Honestly this is a great game and you don't have to like the cartoon series to like this game.",
            "review_score": "1"
        },
        {
            "review_text": "GREAT game thats all and you can play 2 players just need one more keyboard ;3",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite video games. Love the way the gameplay and presentation has been refined since The Complete Saga. Not to mention 100 percent keyboard-friendly.",
            "review_score": "1"
        },
        {
            "review_text": "It is a great game but with a controller. it is almost imposable to play with a keyboard and mouse. So if you are getting a lego game get it for a console or use a controller.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy LEGO games, and this is one of those that I enjoy the most",
            "review_score": "1"
        },
        {
            "review_text": "Going to make this one short, seeming that I haven't finished the game, but I couldn't get into this one. I love Star Wars and the original Lego Star Wars is great, but this one felt extremely bland. There's some great additions like better combat, insanely awesome graphics, and massive battles. Unfortunately, everything else is just a run-of-the-mill Lego game. If you like Lego or Star Wars, it's okay, but not the best out of the series.",
            "review_score": "1"
        },
        {
            "review_text": "Legos + Lightsabers + Samuel Jackson Minifigure = Awesomeness",
            "review_score": "1"
        },
        {
            "review_text": "Best sequel to the hangover made yet",
            "review_score": "1"
        },
        {
            "review_text": "First off if you played Lego Starwars the complete saga and liked it you should get this. It offers alot fo stuff and ita f dsijbn hdfj;hbnjdkfhbndkjbnkdjn.kmfdxbbxbvcbvcbvcbv",
            "review_score": "1"
        },
        {
            "review_text": "well this game is really good but it crashes all the time thanks steam you basterds",
            "review_score": "1"
        },
        {
            "review_text": "Played For 6 Hours Straight and got grounded. 10/10 Would Get Grounded again",
            "review_score": "1"
        },
        {
            "review_text": "  Good Game But it should be mouse and W A S D if uou know what i mean ;D ",
            "review_score": "1"
        },
        {
            "review_text": "6,5/10",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░▐▀█▀▌░░░░▀█▄░░░ ░░░░░▐█▄█▌░░░░░░▀█▄░░ ░░░░░░▀▄▀░░░▄▄▄▄▄▀▀░░ ░░░░▄▄▄██▀▀▀▀░░░░░░░ ░░░█▀▄▄▄█░▀▀░░ ░░░▌░▄▄▄▐▌▀▀▀░░ THIS IS BOB! ▄░▐░░░▄▄░█░▀▀ ░░ ▀█▌░░░▄░▀█▀░▀ ░░ COPY AND PASTE HIM, ░░░░░░░▄▄▐▌▄▄░░░ SO HE CAN TAKE ░░░░░░░▀███▀█░▄░░ OVER THE WORKSHOP! ░░░░░░▐▌▀▄▀▄",
            "review_score": "1"
        },
        {
            "review_text": "Fun game but needs mouse support",
            "review_score": "-1"
        },
        {
            "review_text": "So I got this expecting to be total ♥♥♥♥ but it completely got me by surprise. in some aspects, it's even better than the Complete Saga - and i find the 6 movies WAY better than the Clone Wars series. visuals and gameplay are amazing.  bad part is: although innovative, the battles are very repetitive, comparing to other lego games, and it's REALLY. LIMITED. it's ridiculously short, about 25% of the content of the series. this could have been great, but the producers chose this a demo-lenght game... and the 'dialog' are way too childish and annoying. not even the series was that much. and the other Lego Star Wars weren't either.  because of this, it's not really worth the price. 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes more than I do in a racing game",
            "review_score": "-1"
        },
        {
            "review_text": "The Lego Star Wars Games were the first set of lego games and are what made the games so popular with kids and adults alike. They are funny, family friendly and were able to tell a story simply with the character's grunts an giggles. Does Lego Star Wars 3 live up to the expectation?  The first thing you will notice is that the animations have been significantly overhauled which some may consider a good thing and some won't. The characters don't feel or look like toys anymore which I like. There's enough cartoon like momments that make the game feel like you are playing with one massive Lego set but I would have prefered they had just made the animations more realistic and left the character designs like they were in Lego Star Wars 1 and 2.   The game is quite like an RPG. The hub is no longer a small cantina, it is two massive spaceships (republic and seperatist) and a big chunk of space in between the ships. You can hop in mini lego spaceships (and some classics like Slave 1) and defeat the enemy which will convert the planet you are fighting over to your chosen faction.   The levels are what you would expect from a Lego game, simplistic puzzles that an eight year old could solve, straightforward bossfights and lots, and lots of jumping!  Lego Star Wars 3 is a good game but has taken Lego characters to the point were they look a lot more realistic, the animation overhaul is well done but there really isn't much of a challenge to be had.  7.75/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best of the lego series. My son and I played this together and had a blast. The puzzle scenarios were fun and not too hard and all the different characters and their abilities made even running around the spaceship intersting. We particularly liked the land battle sequences which had great mechanics and tons to do in each one. We made it our mission to get all the mini-kits, gold and red bricks and ended up with 100% complete. Even after that we would create new games to start over since the game was so fun.",
            "review_score": "1"
        },
        {
            "review_text": "It's a really fun game. All fans of the movie or the tv show of the clone wars will love it. Or just any star wars fan at all will live so I give it a 7000000000000/10 great work Lego",
            "review_score": "1"
        },
        {
            "review_text": "Not going to lie to you; pretty G",
            "review_score": "1"
        },
        {
            "review_text": "good game, however it would be better with the newer episodes in the clone wars show",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would spleen again.  JAMES PUT YOUR REVIEW BACK UP",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game for anyone that is a Star Wars fan but definately need a game pad for the best experience. The only frustrating thing I have to say about it is that with free play it is very hard to get the characters you need.",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion this game is alot better than Saga, the graphics are better, the mechanics are better and it's just a whole lot funner to play. But for me there is one con, controller support. This game has partial controller support but you need special logitech or whatever remotes to play with it, you can't play with an Xbox or PS3 controller which is quite dissapointing. I don't understand it either because Saga had full controller support and this doesn't even though the controls are almost identical, plus it makes it even worse so you can't use your mouse in this either, I don't believe that this review will make them try to add full controller support since it is so old now but it's worth a try :/  EDIT: For some reason when I just re-opened the game my wired Xbox One controller was working with the game, I have no idea why this has happened but I'm really happy about it :) maybe it does work with these controllers after all...?.",
            "review_score": "1"
        },
        {
            "review_text": "Only game iv played for a week i love it every brick!",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as the complete saga in my opinion, but still good.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game to pass time. Overall a great deal!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best Lego game I ever seen. I really recommend it. This game combines the Star Wars the Clone Wars TV show with the joy of building of Lego. I bought it with the Winter Sales.  THIS A ,,MUST TO PLAY'' GAME!!!!",
            "review_score": "1"
        }
    ]
}