{
    "app_id": 325120,
    "name": "Notch - The Innocent LunA: Eclipsed SinnerS",
    "release_date": "2015-06-04",
    "developer": [
        "Angels Blue Digital Entertainment",
        "DigitalEZ"
    ],
    "publisher": [
        "DigitalEZ"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Anime",
        "Horror",
        "Visual Novel"
    ],
    "achievements": 20,
    "positive_ratings": 578,
    "negative_ratings": 73,
    "price": 6.99,
    "description": "This is an isolated town, a town of memories that have been forgotten by its people. However, this small town has not been quiet and peaceful since the murders began... Time passes by, where are the sinful spirits going? Are my memories reality, or just a dream?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/325120/header.jpg?t=1547699696",
    "minimum_requirements": "OS: Windows XP or higher Processor: 2.0 GHz Pentium 4 Memory: 512 MB RAM Graphics: Integrated Storage: 750 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game cured me. An unusal story with hate, betrayal and love, just like what I've experienced these days. My boyfriend left me, there was a wound in my heart and I didn't think I could find any joys in games. This game heals my heart.  It's the first time I saw a game has so many endings, and all of them are so different. I hope you will find a peaceful place from the 'Good ending'.",
            "review_score": "1"
        },
        {
            "review_text": " Notch - The Innocent LunA: Eclipsed SinnerS  is one of those unique visual novels you only come across every once in a blue moon. Thought evoking and story rich, this made for a very good read. I completed it in two 8hr sessions (yes, it was that addicting!), and that was only for my first playthrough.  The protagonist, Yuhito Asakawa, and his childhood sweetheart, Nanami Shio, reside in a remote town that has been long forgotten by the rest of the world. We first meet Yuhito and his beloved in a dream realm of horror, already hoping that the two lovebirds will find a way to escape the nightmare unharmed. And if Yuhito thought that was bad enough, his reality was about to get much worse. His once peaceful little town had been painted red by an elusive murderer, where the victims were all young girls. It is then that he decides to embark on this difficult journey to catch the killer and bring them to justice. Along the way, he'll make some interesting friends, struggle with reality and illusions, and grow braver and more determined with each step he takes.  ^That's just my little summary - short, sweet, and to the point, without spoiling too much of the story. Seriously, it took me 16hrs to complete one playthrough. ONE! And there are 14 different endings! So trust me, there is SO MUCH MORE to this story than what you'll find in the reviews (unless you're looking for spoilers). Bottom line is, if you're considering this vn, then do yourself a favor and add it to your collection. You won't regret it! :)  ***Also, the narration can be pretty gorey at times, so just be aware of that in case that's not your cup o' tea.   Helpful Tip:  If you want to go through all of the endings, press [F] to skip all of the text you've already read. That button will be your new best friend ;)",
            "review_score": "1"
        },
        {
            "review_text": "I haven't read many visual novels, so my review may be a bit off. I've read Narcissus (An extremely good read), as well as Love at First Sight (A good but short read), and I have to say Notch falls a bit short in quality, but makes up for it by pure quantity and length. This is, in my opinion, a slightly longer read than I'm used to, and the writing is... mediocre. The story is decent with some twists and turns you may not expect. Anyway, time to make a easy list of pros and cons to look at:  Pros: -A ton a dialogue for those who can't get enough of hearing what the characters have to say about anything -Blood and gore for those into the horror genre -Multiple endings meaning you have to be (very) careful about the choices you make for the protagonist -A lengthy read to keep you occupied for the long weekends, or whenever you're bored xD  Cons: -Somewhat repetative dialogue. I find that sometimes the characters talk a bit too much, especially during situations where something important is about to happen. This is just my oppinion though. -Dialogue is rather simple, and the narrator is absent most of the time. I would prefer more descriptive writing, but this is just my preference. -Difficult to get a good ending. You may end up near the end of the of the story but finding yourself reaching a 'bad ending' because of a decision you made very early on, forcing you to start over from the beginning multiple times. If you have the patience to do this, then it's not so bad, but I found it fustrating and had to look up a guide to finally find a proper ending.  Overall 7/10. I still recommend this. I would have enjoyed this more if I didn't have to restart multiple times to find a good ending. Luckily I found out that holding down ctrl speeds up the process ;)",
            "review_score": "1"
        },
        {
            "review_text": "How to unlock all character i still dont know !!",
            "review_score": "1"
        },
        {
            "review_text": "Story is really Amazing. For story i can easly say i recommended it! The story just catch me in game on ♥♥♥♥♥ 2 day's but there is 2 things what i don't like here. 1. Story is too much linear. Whatever you choose you are getting EXACLY the same Text [ even if game have a lot of possible chooses it just count points from it and choose for you 2 routes at LAST chapter or one of bad endings. So if you will fked up just 1 choose at beginning game be ready to repeat all ♥♥♥♥♥ game :&gt; 2. Game is missing a some options to skip text or like skip some parts like big text or changing chapter. ( skipping all story took me like all ♥♥♥♥♥ hour bcs of that ) So if you don't care about linear route with chooises what don't change anything only the ending of story then i fully recommended that game ,bcs the story of it is worth that money and time to spend at that game :)",
            "review_score": "1"
        },
        {
            "review_text": "I've reached the second chapter of this game and have played for 3 hours at the time of this review. There's a summary at the very bottom if you don't wanna read the whole thing.  I bought this because the several reviews promised an engaging, interesting storyline complimented by a colourful cast. I was warned the English was shaky, with translation awkwardness riddling the script. But I can manage the occasional awkward English, so long as the story was strong and the characters interesting.  And guess what? They aren't.  The story is good initially, I'll admit. It immediately kicks off and you're pulled into the world. Directly after the prologue comes the scenes introducing us to the main character, a frightening dream-sequence that raises hundreds of questions.   But then the actual game starts, and you're staggered by how throuoghly moronic the protagonist is. The plot couldn't advance if he wasn't such an idiot. Also, he's not likeable at all - he's openly sexist and talks to his childhood friend, Nanami Shio, like she's 10 years old. He refuses to explain anything to her because he doesn't want to upset her, completely ignoring the fact that by withholding important information, he was setting her up for a tramatic experience. He doesn't talk, think or react like a real human being.   Spoiler: after finding a mutilated body, he's briefly afraid, but calms down and begins to think of it as a crime scene. Suddenly, he's not disturbed, or even vaguely upset, by the violently murdered human being lying in front of him - just embarrassed that he freaked out. I thought, maybe, he was emotionally withdrawing, as people sometimes do when confronted with something so horrible, but nope! He's fine, guys. / End Spoiler  He makes the whole experience less believeable and frustrating.  Nanami Shio is the only other character I've met thus far (aside from a girl in a maid outfit, but she appeared very briefly before vanishing). The protag talks to her like she's 10 - and she sort of acts like it, too. She's obsessed with plants and flowers, is constantly expressing worry over the protag, and easily cries. This in itself isn't bad - there are women like Nanami, and there's nothing wrong with them. There's nothing wrong with an emotional, naive female character. The problem is that she isn't treated respectfully by the protag, who is constantly reminding the audience how lovely she is, even after a tramatic dream where he saw dead people, and Nanami covered in blood. Literally, that's the first thing he thinks after waking from a dream where Nanami is pertified and bloody - she's so lovely. He treats her like a child who can't handle bad news, infantilizing her in the same breath he uses to scold himself for sexualising her.   It doesn't help the translation is utterly terrible. They translated the Japanese so literally, the characters sound like robots. When I say that, I don't mean to imply the Japanese language lacks emotion, but what flows properly in Japanese sounds awkward, jerky and needlessly repetitive in English because of how different the languages are. Characters often repeat themselves like they're trying to up the word count on an essay. It's annoying to read.  The game's saving grace is its art - although the characters are very 'anime', which I'm fine with, but might disturb some people - and its animations, which thus far are all good. Its music is average, setting the mood but adding nothing in my opinion.  I'd recommend not buying this - unless the translation is redone so it's flows and the characters stop sounding robotic. I think the reason the protag feels so stupid and heartless, and the reason that Nanami sounds like a woman-child, is because of the bad translations.  tl;dr: While the story is good, the game suffers from idiot characters and terrible translations that are awkward and jerky. The main character is a sexist moron who doesn't act like a human being with emotions. Don't bother with it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is clearly a knock-off of the Higurashi series, what with the series of strange murders including dismemberment and the like. Unfortunately, it is so poorly written and the charecters so one-dimensional and irrational that I have found myself having to put it down multiple times out of boredom. I've yet to even complete one route fully, and I honestly don't know if I'll be able to with out bad it is.  Has some decent artwork and music, but that cannot make up for a lacking story.  Not even worth the discounted $5 I paid for it.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this because it wasn't very expensive for an 8-10 hour game. It's not voiced and the graphics are quite nice. The story, although mostly gory, is quite engaging. But the dialogue moved too slowly for me and I felt frustrated not being about to fast forward the chapter transitions, and other scenario transitions. It just took a very long time, like a powerpoint presentation that takes 30 seconds to move from one slide to another.  Back to the dialogue, characters can literally spend ages just trying to make a point. Do you need 10 mins to say goodbye? I remember this is what happens sometimes in juvenile phone conversations - 'You better go sleep' , 'No, you hang up first', 'No I don't want to hang up, how about you hang up?', 'Why not I wait for you to sleep and then I hang up?' 'But how would I know if you are sleeping already?'...  I hope you get the point.  If you can bear with all this pointless dialogue and slow transitions, I suppose the game is still worth a buy.   ",
            "review_score": "-1"
        }
    ]
}