{
    "app_id": 325790,
    "name": "Fallen: A2P Protocol",
    "release_date": "2015-08-14",
    "developer": [
        "Red Katana"
    ],
    "publisher": [
        "Red Katana"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Strategy",
        "Turn-Based"
    ],
    "achievements": 21,
    "positive_ratings": 81,
    "negative_ratings": 134,
    "price": 7.19,
    "description": "A post-apocalyptic, turn based, tactical combat and strategy game where you lead your caravan on a quest for revenge.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/325790/header.jpg?t=1447363904",
    "minimum_requirements": "OS: Windows® Vista SP2/ Windows® 7 Processor: 2GHz Dual Core Memory: 2 GB RAM Graphics: Intel HD 4000 Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I watched the trailers, and the thought that went through my mind was 'Awwww Yeaahhhh, post-Apocalyptic X-Com!!'. I waited for a while until it was on sale, because I'm a miser like that, and I got at at 75% off. Whoooo boy, that was probably the best decision I made. Quickie run down, Do I reccomend it? No. Also Yes, but then more No.   Here is the thing. The mechanics work simlar to X-Com, maybe even slightly better because instead of 2 actions each round you may be able to run, shoot, and then run, or stab someone three times, or other options. Its actually a superior action point system in my mind. The graphics while not stunning are surpisingly good too.   Then come the problems. The most notable, glaring issues are all related to the characters. Whoever wrote the dialogue for this game should be imprisoned. It's seriously that bad. Most games where people complain about the quality of the story, or the quality of voice acting and writing, I look at them and go 'Well, it's really not THAT bad'. The only way I managed to finish this game was to stick my fingers in my ears, cover up the text on the bottom of the screen and go 'LA LA LA LA I CANT HEAR YOU'. The dialogue doesn't match the subtext, and both of them are not only gramatically awful, but uninteresting at best and confusing at worst. The voice actors might as well have been reading the back of a cereal box. Hell, they were probably hired on Craig's List, because their 'performance' (If i can even be allowed to refer to it as such) was flat and emotionless, not to mention the voices definitely not matching faces. And the overall story was... well 'lacking' doesn't even begin to sum it up. Possibly the worst excuse for a game in these categories that I have ever seen.  Gameplay you say? Well there were a bunch of different kinds of maps I guess.... but the game started out being atrociously hard, and ended up being laughably easy, and all because of the same weapon. Grenades. The single most important weapon in the game is grenades. If you do buy this game just remember that grenades are god. Your low HP characters will be blasted apart by them early game, but then late game when they barely scratch you, don't worry; the enemies will continue throwing them at you even when you are standing right next to them and they set themselves on fire. Oh, and they take up like no space and are the most valuable things in the game. Good news, pretty much every enemy carries two of them. Grab a sniper and just pick off your enemies and grab them for easy cash.  Probably don't buy this game. It was just okay enough that I finished it, but I almost always complete campaigns. You have been warned, I cannot express accurately how horrible the writing and voice acting are.",
            "review_score": "-1"
        },
        {
            "review_text": "In all fairness, after the latest patches I have to change my review to a solid recommendation.  The speed and diligence with which the bugs and annoyances were fixed is commendable, and in the current state it's a solid, fun turn-based tactics game. A pity, that it was so messy at release, as with only 2 weeks of beta testing, bugfixing and tweaking the game, as it's been done now, it would have collected MUCH better initial reviews. I hope it's not too late now, and others give it a second chance as well.  The story is nothing to write home about, but it's solid and the combat works. There are still minor tidbits and balance issues (like, for instance, rocket launchers having less reach than a thrown grenade, grenades becoming uttely useless [AND harmless!] in the endgame) that irk me and would profit from some polish, but it's playable and fun now.",
            "review_score": "1"
        },
        {
            "review_text": "I was really enjoying this game until I realized that the bugs are impassable. I reset the game, got past the bug only for it to happen again a few missions later. Hopefully they continue to make improvements but as of this writing it is frustratingly unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game! It seems they made an Xcom Enemy within / Wasteland 2 sandwich here. I like both of those games alot, and I like this game too.",
            "review_score": "1"
        },
        {
            "review_text": "Overall not a bad game but with so many turn based games out there it could be better. I like the overall feel and game play . I added an extra guy after the first missions and if I ever have him shoot it crashes the game. If anyone has figured it out let me know . (on a plus side dev wants to look at issue.)",
            "review_score": "-1"
        },
        {
            "review_text": "26h to en d the game, lot's of visual bugs but playable. overall doesn't worth the prize",
            "review_score": "-1"
        },
        {
            "review_text": "Love turn-based games?  X-COM fan?  Enjoy playable games? Then this games isn't for you! Turn around and run your ♥♥♥ away from this steaming pile. The bug simulator also know as Fallen is a poorly conceived joke. Im not sure how games like this keep making it onto steam. I guess no one from Valve does quality control anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "Just started playing it. Wish the graphic were better at least get rid of the obvious texture tiling. Game is fun though got me hooked.",
            "review_score": "1"
        },
        {
            "review_text": "It could have been so good.....waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "My family bought this game for me  i'll never see them ever again",
            "review_score": "-1"
        }
    ]
}