{
    "app_id": 326180,
    "name": "Sinister City",
    "release_date": "2014-10-20",
    "developer": [
        "Jetdogs Studios"
    ],
    "publisher": [
        "Jetdogs Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Hidden Object",
        "Casual",
        "Adventure"
    ],
    "achievements": 17,
    "positive_ratings": 942,
    "negative_ratings": 484,
    "price": 0.79,
    "description": "Who would name their town Sinister City? Vampires, of course! When John discovers his bride-to-be has been kidnapped by Sinister City's number one bloodsucker, there's only one thing to do - search for hidden objects! And kill vampires! Or at least insult them until they give your girl back.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/326180/header.jpg?t=1482755609",
    "minimum_requirements": "OS: Windows XP Processor: 1.6 GHz Memory: 512 MB RAM Graphics: 1024x768 resolution DirectX: Version 9.0 Storage: 300 MB available space Sound Card: On board",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Most hilariously 'bad' game I've played in quite awhile. It's obviously a satire and the corny plot was clearly intentional. It did its job and entertained for a few hours, and at its $0.99 price point I can only recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Best 9 cents I've spent on Steam. I sold trading cards for 20 cents and spent a few hours enjoying the game. I had to remove special characters from my Steam name to run the game, which was very annoying, however after I launched the game all was forgiven. This game is funny parody of its genre and is so glitchy that I cry and laugh all the time - check out my screenshots. The vampire teletubby is awesome as well as the psychologist character (outdated stereotype). I can't believe I'm saying this, but I would buy this game for it's full price.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game *if* you get it cheap, i.e for like 50 cents etc.    The good  Some of the puzzles are challenging Oddball sense of humour Can be completed quickly Decent trading cards/badges   The bad  Brings nothing new to the HO table Graphics are sub-par Some of the hidden objects don't match up to their descriptions",
            "review_score": "1"
        },
        {
            "review_text": "Thought that will be something uninteresting, but i played several hours. Nice try.",
            "review_score": "1"
        },
        {
            "review_text": "Mediocre hidden-object game.  + Some nice puzzles. + The sound is ok and the graphics are good, too, but nothing special.  +/- The story is so rediculous that can get funny at times.   - The voice-overs are horrible, though I kind of liked the director's voice. - Small - it took me about 2.30 hours to complete - but this could be a thing for some. - Quite a lot of bugs and they can actually make the game easier since, for example, some h/o scenes were totally white exept for the places that the items I needed to find were.   For the 1€ it asks, it can be an idea for h/o fans that don't have anything else to play...",
            "review_score": "1"
        },
        {
            "review_text": "The game is filled with bugs. Annoying. But you solve that by going back to main menu and then continue.  I recommend finding a guide for the game, since you just get thrown into it, so you could get a hang of it.  It's repetitive as f***, but as soon as you understand the way of playing the game, you'll finish it within an hour (I had the game running as I was eating and after that I watched several TV shows).  It's far from one of the better point-and-click and hidden object games I've played, but it's okay since you can 100% it quickly and just leave it on until you have your 3 trading cards.  Get it on sale though, it's not worth even 0,99€ since the developers couldn't be arsed fixing bugs and glitches before releasing it (and still haven't fixed the problems).",
            "review_score": "1"
        },
        {
            "review_text": "In Sum: Playable but not great hidden object game with some glaring flaws. Do not buy at full price. 3/5  This is another grudgingly recommended game, which I would have preferred a neutral rating on. This is not a horrible game, and I have suffered a share of stinkers on Steam. It is just a hidden object game, not much more or less than that, and I suspect a lot of the objection here is due to the casual nature of the game. However even as a genre, within hidden object games, there is something to be desired.   The concept is seemingly inspired by Dracula and early vampire movies that novel inspired, but with a twist that comes off somewhat amusing but not pulled off as well as, say, a similar theme in Magicka. Unlike most hidden object games, you actually get to play a character and move around some parts of the game. The visuals are actually decent for the non-searching parts of the game, and the voice acting is not bad. It feels like it would have been a well-received, even high quality game in 1998. I am not saying that the graphics are that ancient, just that I can't help but recall the casual games of that era.   The game consists of exploring very small areas for hidden objects, talking to NPCs, and solving puzzles. Through playing, you effectively unlock search quests where you must find a certain number of specified items. In some areas, there are item lists that must also be found before a quest item is revealed. Once the quest is completed, a puzzle must be solved. The puzzles are not complicated in the least.  Some HO games are difficult for various reasons, including devious trickery in design, such as putting similar looking objects, wordplay in clues, shifting images, interactive objects, and so on. This game uses it's own method of frustrating the player, and it unfortunately is not very satisfying. The objects are often hidden behind other objects that are not related to the puzzle (like a book or a plate), which must be clicked on to reveal the item underneath. Makes it hard to search for something that isn't there. Worst of all, the lighting and visibility of the objects is often terrible, to the point where I found myself clicking the screen randomly...and still succeeding! Despite screen settings, the images can be so dim that they are practially not there, and I am sure on some monitors, would not show up at all. And with the secret movable items and the poor display of items, and a lack of consequence for random clicking, it can become as much of a clicking game as Cookie Clicker...but without managers.   Some seem to say that the objects are hard to find because they are not what people are expecting. I have played many hidden object games, and as far as the genre goes, this one is actually very good at properly telling you what you are looking for.   There are two major glitches, however. If you are using Windows 7 or above, you will need to set the game to XP compatibility mode, or it won't even launch. Sometimes during the game, you will not be able to interact with environments after a cutscene. Going to the main menu then resuming will fix this.  All together, it is an acceptable HO game, purely casual and good for destressing or a waste of time. On the easiest mode, there is no pressure and no consequence for wrong, and the soundtrack is not bad at all. It was worth the 9 cents, but not the $10 full price by any means.",
            "review_score": "1"
        },
        {
            "review_text": "I liked it. Yes, there were some bugs, but they disappear once you go to the menu and then come back to the game. Is really easy and short, that's true. But for this price, I'd say it's worth it. Grab it on a sale, if you're afraid.   Anyway, it's short and has some bugs. But the story is priceless. Some people here said it was  bad , but I found it hilarious. The voice acting, the characters, the story and the general mood of the game, is obviously a comedy. And it made me smile quite a few times, so that's good on my book!  I can't really say this is a GOOD game, but it's really cheap, it has trading cards, and it distracted me for a few hours, in addition to being funny. So hey, grab it if you don't have anything else to play.",
            "review_score": "1"
        },
        {
            "review_text": "Worth it for the 10 cents I paid, wouldn't be dismayed if I paid full price. Actually found it pretty funny and some of the puzzles were overall fun. It really owns its kitsch and plays in it. In a way it felt more like a point and click adventure game of old that happened to have some hidden object areas.  I did hit the mirror glitch some people talk about but I just escaped to main menu and hit continue and I was able to play on without issue.",
            "review_score": "1"
        },
        {
            "review_text": "So, this game takes a bit over an hour. It's a pretty simple hidden object and puzzle game. If you like those, you'll like this. The story is seriously stupid and goofy, which it is supposed to be, but still, I had a good time playing it. Recommended for people who like hidden object and non-challenging puzzles. Not recommended for people who like well scripted storylines.",
            "review_score": "1"
        },
        {
            "review_text": "It's a completely average hidden object game. The voice acting is awful... BUT that makes this game so much more entertaining.   definitely worth the $0.99",
            "review_score": "1"
        },
        {
            "review_text": "Laughable dialoge, short games, cheesy....definitely a 'B game'. Can finish the game in about an hour and if you come across a bug just quit out into the menu and try again.  10/10 would race my brother to beat it again.",
            "review_score": "1"
        },
        {
            "review_text": "Get it while it's cheap! 2 hours of game play to finish the story (minus 1 achievment), but it was something my kids enjoyed watching and helping me play. A little more than just your basic hidden object game. I did enjoy it :) 2 Play throughs for 100% Achievement.. at 0.09c to buy the game (on special), the cards gets you your money back (and more), locations of items don't change, so second play though is simple. If you have kids, definatly get the game, a nice little puzzle for them, but for adults, it runs its course quickly.",
            "review_score": "1"
        },
        {
            "review_text": "I purchased this game on sale for 9 cents and got about 3.5 hours of entertainment. It has good puzzles and the hidden objects while sometimes hard they are not brutal. The story doesn't take itself seriously so if you're looking for a true vampire type story the comedy in this may put you off. I actually enjoyed the story and found this game to be worthy. At the low cost being able to get 100% completion and being able to sell the steam cards earned afterwards to make a profit is totally worth getting this game.",
            "review_score": "1"
        },
        {
            "review_text": "bought it for .09 to make a profit on the trading cards and actually enjoyed the game. If you liked 'I Spy' books as a kid, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "The game is no Portal but it does occupy time for a few hours. I enjoyed the corny plot. It was kinda like an average 80s movie with vampires. Plus what are you expecting for $.99? Fallout 4?",
            "review_score": "1"
        },
        {
            "review_text": "10/10 best Shark simulator on Steam. Truly the greatest sequel to come out of the Half-Life franchise.  ' A masterpiece of art. ' - The homeless man down the street",
            "review_score": "1"
        },
        {
            "review_text": "This game has a few bugs but overall it's still a pretty fun game for 99 cents also for some laughs.",
            "review_score": "1"
        },
        {
            "review_text": "Before I begin, I have to say, I recommend and don't recommend this game. The problem is that this game clearly isn't for everyone, the story was alright, but not the best. When I read the description, I thought, 'Oh, maybe this game will be horror related perhaps or at least have that sense of 'scary' vampires as well as his future wife turning into a vampire possibly making him turn into a vampire.' Although, instead it gives you more of a comedy like relief than anything else, to me it really ruined the whole dark, 'scary' vampire part that I wanted. If you want a puzzle related game with a story that has nothing to do with dark vampires, but instead gives you a light-hearted, childish related vampire scenario, then this is the game for you. Although, paying only a dollar just to get it wasn't a total waste of my money for I did enjoy the game.  The problem with this game is the lack of the horror element in the game, this is a vampire game after all and therefore the characters should feel scared. It's also easy to beat the game, I beat it the first time in roughly 3 in a half hours, although that was on 'easy' difficulty.  Overall, I did enjoy the game, it was light-hearted, seemed more like a kids game than an adults game, especially with the 'find the items' part added into play. Do I recommend this to everyone, no, I only recommend this to people who want a light-hearted, puzzle related game that is kid friendly.  I rate the game 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "I'd buy this for a dollar, or actually a euro... or actually I just paid around 0,09€ for this since it was on -90% discount. You get what you pay for I guess. I recommend this since I was happy with my purchase, see the pros and cons though to see what exactly you're getting with the buck this game costs. Some of the things listed are strong matters of taste.  The review  This game is an extremely short and extremely easy hidden-object puzzle game. It's very silly and the whole plot is just finding your girlfriend, freeing her and [spoilers]kickstarting her vampire father's film career[/spoilers]. Voice acting is bad and the texts don't match the lines, but due to overall campy feel of the game I really didn't mind.  Gameplay consists of you mostly clicking a person / object and seeing what he / it wants / needs, finding the items from nearby and then usually solving a puzzle of sorts. Some of these necessary items are often hidden behind some other items that are involved in a hidden object game, totalling to about 11-16 items (5 at a time), the last of which usually has the final items you are looking for hidden behind them. It's really simple and usually you can just get through most of it by randomly clicking the obvious items in the scene. If you want all of the achievements though, check the items required and then click through 5 of them (the hidden objects, not the quest items) in 10 seconds to get the achievement, that's basically the only one needing bit more effort.  The puzzles are the most interesting part in this game (beside just seeing the silly plot and clunky conversations go by). Unfortunately there were like 2 or 3 puzzles requiring actual thought while the others were passable by randomly doing stuff or just matching things together. There's not much explanation to them, but they're so simple a child will understand their point, you really don't need the included hint system. (also there's an achievement if you don't!)  - Funnily, you can actually tell the main character to walk somewhere in the scene, but it really has no function as clicking on hotspots trigger them immediately.   That's about it. Game really doesn't span far. I played it 100% through on hardest difficulty in ~2h. More lucky person can probably do it in less time. Well, here's the pros and cons.  Pros: + Cheap (like really, got it for 9 cents) + Campy (got a few chuckles from some events, couple unexpectedly silly ones too) + Money's worth of entertainment and ultra-light brain exercise + Achievement icons look pretty cool +/- Easy even on hardest difficulty  Cons: - Some bugs (backgrounds messed up or characters floating in the backgrounds, also one time (in the psychic dimension) game didn't let me click any hotspots, closed and restarted the game and it worked again though) - Typos - Lame story (and there's barely any of it) - Harder puzzles can be calculated with a single quaternary digit - Finger got tired from all the basically useless random clicking +/- Bad acting +/- Easy even on hardest difficulty  Score 6 / 10",
            "review_score": "1"
        },
        {
            "review_text": "i'ts a puzzle game where you have given objectives you have to do i personally dislike Puzzle games but if you like it you can go for this game!",
            "review_score": "1"
        },
        {
            "review_text": "considering I got it for 9 cents I would say it was a good deal. I enjoyed the puzzles and the story but to complete it all on both levels of difficulty without skipping any puzzles it was just over 3 hrs for me but I'm sure others have done it in less. Either way it's not bad for a puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Best game NA 11/10 IGN confirmed",
            "review_score": "1"
        },
        {
            "review_text": "I bought this to sell the trading cards, and was able to make an overall gain of $.06. I really liked the gameplay. It was pretty fun. I would definitely play this some more, but have other games I have my sights on.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS SOOOOOOOO ♥♥♥♥IN BORING  But ♥♥♥♥, it was ninety-nine cents! Bag it, ♥♥♥♥ it, coppin' it, washin' it 'Bout to go and get some compliments, Passin' up on those moccasins, Someone else's been walkin' in, Bummy and grungy, ♥♥♥♥ it man, I am stuntin' and flossin' and Savin' my money so 12/10 points would buy again... THANK YOU SO MUCH JETDOGS STUDIOS FOR RUINING MY LIFE... KAPPA i luv you boyZ and Gurls",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Saw this game with 90% discount, Bought it. &gt;Download and Install. &gt;Run the game. &gt;Sleep. &gt;Woke up &gt;Check inventory &gt;3 Steam trading card &gt;Uninstall  10/10 would pay for steam trading card",
            "review_score": "1"
        },
        {
            "review_text": "trapped in sinister city with your wits and cunning being your ONLY defense (in the same vein as Outlast), you must escape a mindless horde of demonic vampires and ally yourself with madmen and the renegade undead. the video game medium makes a triumphant return to horror. will you survive? ",
            "review_score": "1"
        },
        {
            "review_text": "Actually not bad considering I paid 9 cent for it.",
            "review_score": "1"
        },
        {
            "review_text": "Sinister City is certainly the most breathtaking game of 2014, and as for me buying it for only 0,09€ is a massive steal.   Anybody looking for a deep, thought provoking mystery drama should definetly check this wonderous game out. The amazing world building and dynamic characters are only the beginning, as they only scratch the surface of the actual genius and innovative gameplay.   Now as opposed to todays RPG, shooting and action based this game takes a creative path in making you think deeply about your choices, as you uncover the mystery of what happened to your missing wife. You're always forced to stay focused and look for subtle clues in your enviroment, and the aesthetics just makes the experience a whole lot better.   When I first saw this game on steam I was unsure about it's directional capabilities, however I found myself surprised by the sheer level of thought and care taken into crafting such a epic and emotionally investing story that will keep you thinking about it for days on end. I would have to give this game a solid 20/10 and I hope that more people will be able to experience this hidden gem amongst the rocks. -Aru",
            "review_score": "1"
        },
        {
            "review_text": "Very short, very funny. Graphics is somehow creepy but it adds even more fun!",
            "review_score": "1"
        },
        {
            "review_text": "Actually not bad considering I paid 9 cent for it.",
            "review_score": "1"
        },
        {
            "review_text": "This was really good I loved it! I didnt expect the twist at all! Bravo!",
            "review_score": "1"
        },
        {
            "review_text": "Sinister City is certainly the most breathtaking game of 2014, and as for me buying it for only 0,09€ is a massive steal.   Anybody looking for a deep, thought provoking mystery drama should definetly check this wonderous game out. The amazing world building and dynamic characters are only the beginning, as they only scratch the surface of the actual genius and innovative gameplay.   Now as opposed to todays RPG, shooting and action based this game takes a creative path in making you think deeply about your choices, as you uncover the mystery of what happened to your missing wife. You're always forced to stay focused and look for subtle clues in your enviroment, and the aesthetics just makes the experience a whole lot better.   When I first saw this game on steam I was unsure about it's directional capabilities, however I found myself surprised by the sheer level of thought and care taken into crafting such a epic and emotionally investing story that will keep you thinking about it for days on end. I would have to give this game a solid 20/10 and I hope that more people will be able to experience this hidden gem amongst the rocks. -Aru",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the most hilarious point-and-click games I've ever played. It conjures up Ed Wood at his worst (that is, best). As a send-up to to B-movies, I can't find a better game.   And the graphics couldn't be better. By better, I don't mean you'll mistake this game for Crysis. I mean, it's got all the charm of a cheap budget title -- which it is, but with a wink and a nod. All-the-more self-aware.  Regarding the voice acting, it reminds me of Castlevania Symphony of the Night at is worst moments. And so if you're a fan of all the awkward conversations in that game, you'll think this one is a hoot.  The drawbacks are that this game is short and the puzzles easy. Even when you're stuck -- which you won't be often -- the game is more than happy to give you a hint that practically solves the puzzle.  But don't buy this game for the gameplay. But it for the over-the-top plot, and the hilarious satire.",
            "review_score": "1"
        },
        {
            "review_text": "Tepid casual gameplay, absolutely ridiculous writing that doesn't take itself seriously but plays it straight, and a lot more fun than it actually deserves to be.  If you know what you're doing, you can power through this with no walkthrough in around an hour; so assume you're getting around an hour of stifled chuckles out of this one. If it's on sale for a dime, absolutely get it. If it's the full price of around a dollar? Maybe still worth it.",
            "review_score": "1"
        },
        {
            "review_text": "i dont know whats up with all the negative reviews. its a fine point and click and it gives me a nostalgic feeling of some the old games i played when i was younger. the soundtrack is also very good. i don`t know if its stolen or its orginal, But good it is. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Part Puzzle Solver / Part Object Finder at a elementary level . Sinister City's storyline is clearly targeted for a younger audience . The story length will vary , depending on one's puzzle skills , but I feel safe saying the average person will complete it in 1 1/2 - 2 1/2 hours . There are some bugs / glitches , but in almost 4 hours I experienced 2 , which were easily fixed by selecting the main menu and selecting continue . A couple hours entertainment for $ .99 US , not a bad deal for a younger gamer . Probably not for serious gamers , but it does offer entertainment . All my opinion from my own experience .",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the worst if not  the  worst game I have ever played in my entire life! I really like hidden object game so that's not the issue. The thing is... This game is poorly made. The story, the voiceacting, and you will encounter tons of bugs e.g.:     White boxes everywhere in a hidden object scene    In certain hidden object scenes each click will throw you out of the scene, rinse repeat (unless you restart the game)    You need to guess where the hidden object scenes even are, how many of a certain item is placed in each one + no indication what is clickable or whether there is an item hidden behind another one or not. In order to complete the scenes, you basicly need to click on everything..    You often need to restart the game because of bugs e.g. when the game doesn't register any clicks being made in a scene    Every time someone finishes a sentence you need to click to get to the next sentence    Generally the story is really poor concerning the dialogue    The English subtitles are even different from the spoken English    The graphics are not the greatest thing and sometimes the characters are floating above the ground when they obviously shouldn't.    The animations in the game are extremely poor. Especially the raven flying away at the castle.    The puzzles are really dull    The achievements are not unlocking in right order and there is a broken achievement - but they seemed to have fixed it today (20/11-14), so the game might be further improved.    The only good thing about the game is the ending. The outtakes are a bit funny. But that's all. And the fact, it's 3~ hours game with possibility to unlock all achievements since they finally fixed it.  Though I would still not recommend the game at all .  ",
            "review_score": "-1"
        },
        {
            "review_text": "For starters, the game is a hidden object game with a great title 'Sinister City: Vampire Adventure'. But that is the only thing good it has to offer. If you are looking for a dark and scary story, forget about it, there is nothing scary about this game.  The story evolves around a silly plot that goes like this: Your girlfriend was hidden from you by his father who turns out to be a vampire lord. Your future father-in-law is basically against your relationship because you are just a mere mortal. Because you are more interested in the undead than the living, you still went out and searched for your bloodsucking girlfriend.  You do this and that. Then followed by you look for this and that. And a little more of you fetch this and that. Then towards the end the story takes an odd turn which was absolutely ridiculous. I don't want to spoil the ending for you, but believe me it was rather silly. The puzzles are rather easy and the only challenge is when you are trying to locate objects that were microscopic and finding things that blend with their backgrounds, other than that it was smooth sailing for me. In conclusion, I would NOT recommend this game, I like the artwork and the graphics but I just could not stand the horrible plot. As they say ' Don't judge a book by its cover' or in my case the 'Title'. If you are looking of a challenging game, I suggest you find it elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "After reading the reviews, I thought it might be 'so bad it's good'. I was wrong!  Yes the dialogue did make me laugh out loud but that's about where the fun ended. This doesn't even work properly as a hidden object game or a point and click. When you have finished with a hidden object scene it doesn't tell you this, you just have to guess. As other reviews have said it's poorly rendered so it's difficult to see the objects (I swear a few were invisible) and it's buggy as hell - after 30 minutes some of the locations just whited out.  Just don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "Seriously, pure and utter crap. Even at 99 cents....take your chance. Never thought that something would make me think that I could actually waste a dollar more. The only thing it has going for it is it's so cheesy, it's comical. It was almost painful to endure....",
            "review_score": "-1"
        },
        {
            "review_text": "I play lots of terrible hidden object games, especially spooky ones with tonnes of old-looking junk in them. This one is so terrible I wish I hadn't spend 25 cents on it. It was trying to be funny, I think, but it didn't work. Also, you can just click randomly about to find all the items. SPOILERS AHEAD. Story and dialoge are this terrible : you check into a hotel and the clerk says 'what are you doing here, don't you know we are right next to Sinister City full of vampires and all sorts of evil?' (he doesn't think anyone should pay him to use his hotel?) then casually offers to let you talk to your girlfirend telepathically. He's got a hypnosis machine in the store room.",
            "review_score": "-1"
        },
        {
            "review_text": "I really love hidden object games and I really wanted to love this one too since it was cheap and so. The story had potential if only it had better voice acting maybe? The thing that really brought this game down was the graphics, the hidden object areas were so pixelated that you could barely tell what you were looking at. Most of the time I ended up randomly clicking all over the screen until I found all of the objects. The game also was very buggy, in one scene the hidden object area kept kicking me out of the area everytime I clicked on something and certain places had graphic glitches. I wouldn't recommend this game even if it was discounted to barely nothing.",
            "review_score": "-1"
        },
        {
            "review_text": "sorry but this game unable to play is full bug",
            "review_score": "-1"
        },
        {
            "review_text": "Such a bizarre and quirky game. It was like playing a bad movie. While I enjoyed the cheesiness, and the hidden pictures, as well as the mini-games, I really got frustrated because of the bugs.  There are a lot of bugs in this game. I had to reload several times due to errors that caused the game to be unplayable.  Bug #1 Random white squares during hidden pictures parts of the game causing me to reset multiple times. (Requires restart or going back to main menu)  Bug #2 Bugs causing me to be unable to leave a certain area. (Requires restart or going back to main menu)  Bug #3 Getting stuck on the map screen. (Requires restart or going back to main menu)  Bug #4 Walking through many objects: Walls, doors, floors ETC. (not game breaking, just weird)  Various other visual bugs that aren't game-breaking, but still weird.  If you can look past all of that, then you've got an okay game. Not great, but okay.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Oh wow, Im being impressed about the missing textures than the game. So the only + is the price and maybe the music Then it was just weird, idk what happened at all. 10/9",
            "review_score": "-1"
        },
        {
            "review_text": "this game makes no sense, there's a storyline but all oyu have to do is click unnecessary stuffs... I mean *SPOILER* (lol not)  collecting a bug, an apple, a dartboard,a rhino statue...for what? nothing... I don't get this all  but still, you can enjoy this game, the music is chill, if you are really bored you can play with this for a short time",
            "review_score": "-1"
        },
        {
            "review_text": "This game might as well be in early access. It kept acting like I was clicking on an object and the back/skip button, regardless of how far the object was from the button.",
            "review_score": "-1"
        },
        {
            "review_text": "was ok....already beat it in literally under 20 minutes",
            "review_score": "-1"
        },
        {
            "review_text": "15 minutes in, 2 gamebreaking bugs, can't progress further",
            "review_score": "-1"
        },
        {
            "review_text": "I generally like HOGs, but this is absolutely awful  - Story-crap -Graphics-crap - Gameplay-crap - Sound - crap  Generally, awful, awful, awful.  Do not, under any circumstances, buy this game, even if it is going for only a few pence in a Steam sale  WARNING - DO NOT BUY THIS GAME!!!",
            "review_score": "-1"
        },
        {
            "review_text": "The game isn't too bad on story,but the graphics and the caracters sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Typical hidden object game with a semi-interesting story. A little buggy. Was floating in a door for a while. I thought one puzzle was a loading screen for a while as there was no prompt to complete a puzzle. It's O.K. I wouldn't reccomend buying it.",
            "review_score": "-1"
        },
        {
            "review_text": "Nope, nope, nope and nope! This game is so bad that I can't come up with a single positive thing to say about it. Too many bugs, such as the screen turning completely white during hidden object scenes, which makes it hard to proceed. The story line is incredibly horrible, as is the awful voice acting. Save your money and time on something that is actually enjoyable.",
            "review_score": "-1"
        },
        {
            "review_text": "Whos the old man, why dracula dic? Is wife a bat lady? All of these questions and so ISpy. This is not Sin city. Ok. Also Game broke in a few minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't like this game at all. It's text based, bad graphics, bad plot quality.  1/10.",
            "review_score": "-1"
        },
        {
            "review_text": "It seems like the creators of this game couldn't quite decide what kind of game they wanted to make. After making it all the way to the end, I'm pretty sure they made it on a dare. The voice acting isn't terrible, but I haven't seen writing this bad since they cancelled the American remake of Coupling.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible by all means of this word",
            "review_score": "-1"
        },
        {
            "review_text": "Repetitive, uninteresting, no sense of humor and very short. Not recommended to pay any money to get this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Not much of a story line, just hide and seek not many other puzzles to do, got bored 10mins in",
            "review_score": "-1"
        }
    ]
}