{
    "app_id": 326120,
    "name": "Horizon Shift",
    "release_date": "2015-05-29",
    "developer": [
        "Flump Studios"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Arcade"
    ],
    "achievements": 12,
    "positive_ratings": 228,
    "negative_ratings": 60,
    "price": 3.99,
    "description": "Horizon Shift is an explosive wave based single screen shooter with a ton of new ideas and platformer elements. Do what it takes to protect your horizon from the ever encroaching enemy attack!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/326120/header.jpg?t=1469129956",
    "minimum_requirements": "OS: Windows 7/8 Processor: 1.8 Ghz Memory: 2 GB RAM Graphics: 1GB Intel Graphic DirectX: Version 9.0 Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows 7/8 Processor: Dual Core processor of 2.4GHz Memory: 2 GB RAM Graphics: Nvidia Geforce 200 series DirectX: Version 9.0 Network: Broadband Internet connection Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": " Edit: This is a labor-of-love for the developer, and it shows. They are very active and interested in community input - this cannot be valued highly enough.    With that being said, unfortunately I don't see the magic that everyone else sees with  Horizon Shift .  I have tried several times to get into it, and all I can see is a subpar arcade shooter. While the axis-flipping mechanic is not new, the game does bring some interesting platforming mechanics into play complete with enemies being able to destroy the line creating jumpable gaps. On the negative side, the visuals are nothing special. I played with a keyboard and also a controller, and both felt decidedly awkward for what is a simple game although I only tried one of several configurations for the controller.   Pros:  +Its cheap +It can run on a toaster   Cons:  -While there are some interesting platforming elements that are new, it wasn't enough to keep me interested. -Artwork is bland. -Music is generic.  Perhaps I did not get far enough to see something great, but I doubt it.  I was hoping for something completely addictive (like many reviews boast - even friends of mine), but that was not the case for me. ",
            "review_score": "-1"
        },
        {
            "review_text": "I've played a lot of shmups over the years, even though I've never been great at them. From Galagon (a 90s shareware Galaga clone) to Kenta Cho's classics, like Torus Trooper and Titanion, and through to Jeff Minter's near-perfect Space Giraffe. Played some of Steam's smaller shmups, too, like Revolution Ace and Syder Arcade--and even Flump Studios' last game, the underrated Super Killer Hornet: Resurrection.  Horizon Shift is up there with the best. It's like a long-lost Kenta Cho masterpiece with a dash of Space Invaders Extreme. The central horizon-flipping mechanic is just ingenious--why hasn't one of the shmup giants done this already? Playing essentially two games at once is intense, and it ensures that the excitement never tapers. It also makes for a very difficult ride. I don't think Horizon Shift is a controller-smasher by any means, but it definitely draws from an earlier period of shmup design. A lucky run landed me just barely in the top 20 before this review, and not many people are even playing the game yet. If you're new to shmups, you might get destroyed. But, whatever happens, don't get discouraged--the game steadily and invisibly grows your abilities. You can replay stages that once gave you fits and discover that they're a breeze.  Subtle stuff like that is what makes Horizon Shift work. Flump hasn't fallen into the amateur's trap of letting one cool feature carry an otherwise middling game. Your ship's speed, bullet spread and damage are perfectly tweaked. Every enemy has a clear, unique design and attack pattern, and the bosses are always fair. Bombs are better balanced than in most shmups I've played. Not to mention the brilliance of letting enemies break the horizon platform--and of letting you   double-jump  . The subtle excellence continues in Horizon Shift's audiovisuals, which are minimalistic but not bland, and attractive but not (in Geometry Wars fashion) overindulgent. A perfect balance that certain people might not catch at first.  The bottom line? Horizon Shift is one of the essential shmups on Steam, up there with Ikaruga and Space Giraffe. It's also $5. Buy it. Even if you're not a fan of the genre, this game might convert you.   A final word:  a bug with this game (now fixed) prevented me from playing it for several weeks. During that time, the developer was more hands-on than I've ever seen. He added me as a Steam friend. We chatted about the problem, tested various builds and finally solved it--and he updated the game soon after. Throughout the process, he was apologetic and beyond gracious. Indie games need less aloof, defensive jerks and more developers like Flump Studios. Start the ball rolling by buying this game.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, Bit of a new spin on the shooter genre and really Challenging. Also a Great soundtrack to accompany it. Highly recommended from little old me! ",
            "review_score": "1"
        },
        {
            "review_text": "awesome blend of that retro arcade-style addictive gameplay with modern game design elements. The main mechanic is switching your orientation on this horizon line as you shoot enemies coming from all angles.   Pros - The game has a great retro feel to it with neon-on-black art style - Music tracks chosen for the game are perfect. - The title is easy for beginners to schmups to grasp, but can ramp up to challenge any veteran. - Multiple modes of gameplay and leaderboards.  cons - A somewhat steep difficulty",
            "review_score": "1"
        },
        {
            "review_text": "This is a rather nicely made little arcade shooter in the style of classic coin-op machines of the 80s. It's not just a simple remake, though - it brings some new ideas on the table.  At first glance it resembles a space invaders that is mirrored at the ground line. Your mission: defend the horizon against waves of all kinds of alien crafts and other objects that fall into several color-coded categories. Beset from both above and below, you can swivel up and down, slide and jump and collect several powerups. Destroyed bits of horizon make it harder to move around but increase your score multiplier. Every once in a while you will encounter giant bosses and there are bonus levels that may remind you of some other classic games. There are several game modes available and multiple customization options for gameplay, music and visuals. Among other things you can go for crisp graphics, make things look pixelated or emulate a a CRT's scan lines.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Fun arcade style action. Simple but hard.",
            "review_score": "1"
        },
        {
            "review_text": "A SHMUP where your ship has the ability to double jump. Ground-breaking! No for real the ground breakes apart. The music and graphics worth the price of admission alone. My arcade addiction just got a sweet juicy indie to feast on.  pew pew  Top and bottom friendly shooter. Very progressive.",
            "review_score": "1"
        },
        {
            "review_text": "Horizon Shift is a game that I recommend because: - is a method to banish boredom - have trading cards - have action - is indie  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "I can not convey how vicious this game is. It is stressful, it is mean, it is unforgiving... it is unrelenting.  Hell,you get a badge for surviving the first screen....  and well,you should.  I would seriously marry a girl who I could rock this game...  as I can not.  Pick it up...now.",
            "review_score": "1"
        },
        {
            "review_text": "The most fun I've had out of an Indie game in awhile!",
            "review_score": "1"
        },
        {
            "review_text": "ive only played this game a couple times and i can tell im gonna love it although im not that good at it, the guy working on this game was at a game exhibition at cardiff yesterday and i met the guy working on this, i played his game on an arcade cabinet and it was really fun, the guy was kind enough to give me a free steam code after i volunteered to put videos of his game on youtube and im still gonna do it soon. cheers",
            "review_score": "1"
        },
        {
            "review_text": "  Very decent indie game! Challenging achievements though... :p",
            "review_score": "1"
        }
    ]
}