{
    "app_id": 326340,
    "name": "River City Super Sports Challenge ~All Stars Special~",
    "release_date": "2015-12-17",
    "developer": [
        "Arc System Works"
    ],
    "publisher": [
        "H2 Interactive Co., Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Co-op",
        "Online Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Action",
        "Retro"
    ],
    "achievements": 46,
    "positive_ratings": 432,
    "negative_ratings": 197,
    "price": 14.99,
    "description": "This is the River City sports challenge! The Rule is simple, be the # 1 in 4 events by all means. That's it! Hitting and kicking? Of course! Wooden swords dumbbells and even bombs are available to use. The great sports challenge where anything's possible has just begun!!!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/326340/header.jpg?t=1499236872",
    "minimum_requirements": "OS: Windows 7 / 8 / 8.1 Processor: Intel Core2 Duo Memory: 256 MB RAM Graphics: nVidia GeForce 7900 GT or better / AMD Radeon X1900 / nVidia GeForce GT 620 (Windows 8.1) DirectX: Version 11 Network: Broadband Internet connection Storage: 2 GB available space Sound Card: Direct Sound",
    "recommended_requirements": "OS: Windows 7 / 8 / 8.1 Processor: Intel Core i5 / i7 Memory: 1 GB RAM Graphics: nVidia GeForce 8800 GT or better / AMD Radeon HD3700 / nVidia GeForce GT 650 (Windows 8.1) DirectX: Version 11 Network: Broadband Internet connection Storage: 2 GB available space Sound Card: Direct Sound",
    "reviews": [
        {
            "review_text": "First of all, press M if you want to start the game on the title screen. It's also the same button for pausing the game. Also if you ever played Nintendo World Cup during your childhood, you oughta look into this game.  Warning! If you don't want any spoilers, avoid reading this review until you have seen/played the game yourself!    So River City Super Sports Challenge All Stars Special AKA River City Ransom x Sports is a beat em up game with sports modes in them. As a River City Ransom fan, the game keeps what makes the series fun to the BARF and Street Fighter-like moves with a mix of 4 modes/games you and your team will experience. Game comes with Story Mode, Free Mode, Online mode and customization.   Gameplay",
            "review_score": "1"
        },
        {
            "review_text": "I am torn between recommending and not recommending this game. It's a very fun game to play and pass the time. Also the story is funny if you are familiar with the japanese school delinquits. Where it falls short is the unfamiliarity of controlls and how the game works. There are 5 pages of move sets you can do and you can only select 2 of them to use while in competition, however how to execute these moves is only posible to see in the main menu. So you basically have to exit and restart the game to look it up if you forget. It gets worse as you have to use 5 different characters on your team and each one has a different set of special moves.",
            "review_score": "1"
        },
        {
            "review_text": "An Olympics game where you're allowed to beat up the other athletes along the way! The story is surprisingly deep, especially for a sports game. It truly captures the charm and spirit of Technos / RCR / Crash 'n the Boys. Lots of variety, twists, and unlockables give a LOT of replay value. The only major flaw is the controls cannot be remapped and the action buttons are awkwardly placed (U, J, O; seriously?) but at least the controls are simple and responsive. Use a working gamepad and JoyToKey to get the most out of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Pay for the childhood.",
            "review_score": "1"
        },
        {
            "review_text": "pros -Old school fun game cons -Suppory only XBOX360 joy -My friend can't connect to my rooom",
            "review_score": "-1"
        },
        {
            "review_text": "Fun. but why this game doesn't allow me to change keys... all i can change is between U, J, O... which is sux",
            "review_score": "-1"
        },
        {
            "review_text": "Lower Expectation for this game from the original version in FC console.",
            "review_score": "-1"
        }
    ]
}