{
    "app_id": 326670,
    "name": "Warhammer Quest",
    "release_date": "2015-01-07",
    "developer": [
        "Rodeo Games",
        "Twistplay"
    ],
    "publisher": [
        "Chilled Mouse"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Strategy",
        "Turn-Based"
    ],
    "achievements": 53,
    "positive_ratings": 516,
    "negative_ratings": 246,
    "price": 10.99,
    "description": "Based on the classic tabletop game, Warhammer Quest is an addictive mix of role-playing and strategy.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/326670/header.jpg?t=1447364004",
    "minimum_requirements": "Минимальные: ОС: Windows 7+ Процессор: Dual Core, Intel Core i5 (3rd generation Ivy Bridge)+ Оперативная память: 4 GB ОЗУ Видеокарта: GeForce 200 series+ Место на диске: 2 GB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is designed and made for an ipad. Its graphics and controls are for an ipad. You use your mouse like a finger to a touchpad and have no way to do anything using your keyboard. I would like to move the camera with wsad or arrow keys. It is highly annoying that there is no keyboard controls.   I like to zoom out and play it that way but every turn the enemy resets the camera to super zoomed in on it. This is extremely annoying. Also you should have an option to fast forward through enemy animation always but need to click it every turn.  There is no multiplayer but warhammer quest is a game you want to play with friends.  There are microtransactions. What?!  There is no replay value. The game has a crafted story line. What? Is this Warhammer Quest?  You have to do an extra click every time you want to end turn because they hide it just incase your finger hits it...wait were on a computer.",
            "review_score": "-1"
        },
        {
            "review_text": "Could have been a decent Steam game. Has (well, some) depth to tactical combat, is somewhat fun. Ended up being a poor mobile port, where every feature from store inventories to loot drops to random events silently points at monetization. Guess noone really bothered to think about the actual players. Don't bother with this game at least until it's way down in the discount bin.",
            "review_score": "-1"
        },
        {
            "review_text": "Everyone is hating on the game for the micro transaction. They are ignorable.  Everyone SHOULD be hating on this game for the sloppy production values. They can not be ignored.  With clumsy and unintuitive controls, Warhammer Quest has transformed a classic board game into an exercise in frustration framed by a Full Sail drop-out's animations.",
            "review_score": "-1"
        },
        {
            "review_text": "Swing and miss....youll be seeing this happen a good 85% of the time. In game perchases are for IOS games NOT for PC. If you are planning on buying a good board game, skip over the electronic version and buy the physical game, so much more fun and co-op.",
            "review_score": "-1"
        },
        {
            "review_text": "Having played the Warhammer Quest board game, I had high hopes for this game on the PC. Unfortunately, it gets boring quickly. Save your money for something else.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a real swine of a game. Some dungeons last far too long because of RNG behind the scenes that create ambush after monster ambush, it gets quite tiresome. Couple this with the abissmal hit-miss ratio that ensures you miss more and more...it's just tiresome.  Currently there is not enough varied loot, not enough special loot, and not enough reward for the time required to slog through a dungeon.",
            "review_score": "-1"
        },
        {
            "review_text": "They say you never forget your first love. Warhammer Quest was my introduction to the wonderful world of tabletop RPGs, and, despite its flaws, I still look back fondly to those long afternoons spent hanging out with my buddies, eating pizza and murdering wave after wave of monsters. So, when I saw that there was a PC version of it after all these years, I had to try it out.  The game is not without its downsides. They kept the worst mechanics from the original game, which was that the warriors had to 'buy' their level-ups with GP, and whichever warrior landed the killing blow on a monster got all of its GP. My group quickly house-ruled those away. This version keeps the purchase of levels, but at least it has a collective purse for the party. It still has the 'you kill it, you keep it' mechanic though, now in the form of XP. So you still have to carefully manage the battles to ensure that your wizards get some kills, to ensure that they can progress alongside your fighters.  Some other thoughts: - This game is very obviously a mobile port, with little or no attention given to updating the UI for a PC. Everything in the game is controlled by the left mouse button: click some things, double-click some other things, click-and-hold yet other things. Would it be so hard to add, say ability hotkeys, or replace the click-and-hold with right-clicks? At least they did add in scroll-wheel zooming. - The plot is paper-thin, and mainly just an excuse for the dungeon crawls. But, that's not so different from the original game, if you played it straight from the source books and just rolled up the dungeons randomly. - Some people have complained about the game being grindy. I didn't find it to be that much of a problem; by the time I reached the last quest, about 2/3 of my party had hit the level cap of 8, and the rest were level 7 with max XP and just needed the gold to level. So yeah, I might have needed a little grinding to max out everyone, but not all that much. - In the mid- to late-game, the battles tend to be rather easy with the right strategy. Just park your fighters in a doorway to create a bottleneck, with an archer and wizard behind for support. Then laugh as your foes feed themselves to the grinder. True to the original, though, get a few bad rolls and you can quickly find yourself swamped by two or three stacked random encounters.   Overall, if you're feeling nostalgic and can catch it on a sale, I'd say go ahead and pick this up. This game won't ever be remembered among the RPG legends like, say, Baldur's Gate or Diablo, but it's a good one to pull off the shelf from time to time when you're in the mood to just mow down a ton of monsters without putting in a lot of thought.",
            "review_score": "1"
        },
        {
            "review_text": "good game, lotsa fun , nice time passer and a pretty good adaptation of the board game ..",
            "review_score": "1"
        },
        {
            "review_text": "A colorful and indepth RPG in the Warhammer fantasy setting - even makes mention of Nagash himself -the greatest of all Necromancers! Its Turn Based which so lets you think your strategies and tactics in your own timing. The map feature gives you an non-linear feel allowing you to choose your quests. The combat is fun and exciting. Character development improves it even more as you level up and gain new skills. It has an olde style flavor and the music is gentle and inspiring. The added quests, characters and items you can buy enhances the game greatly; though you can enjoy it regardless without those. Graphics are detailed and vibrant without heavy strain on your system requirments. I also feel this game has great potential and look forward to more expansions. I highly recommend this game and I hope it sounds and looks good to you and that you seriously think about getting it. If you want an RPG game that is easy to play and easy to learn then view this one and consider it. One other point: if you love dungeon crawls then its another reason to choose this game as its one of the best dungeon romps! Well done Games Workshop A+++",
            "review_score": "1"
        },
        {
            "review_text": "I use to have the box game in the mid-90s and loved it. I was very happy to find this game on steam. So far the game plays like the box game. I would love to see more DLC! If you enjoy dungeon crawls then this would be a good addition to your library and the deluxe package is $3.00 during the summer sale. Worth it IMO!",
            "review_score": "1"
        },
        {
            "review_text": "Whilst I've only played a relatively short way into this one, I think I can safely say that it's by far one of the best 'turn-based fantasy roleplay quest' games you could hope to buy. It's incredibly newbie-friendly - the minimalism of the tutorials not really mattering, provided you've played one or two similar games before, be they in the digital and/or paper and/or board-game realms - and while I can't comment on the controversy regarding the pay-for-gold scheme and its alleged 'necessity', thus far I can't really see that I'm going to NEED to expend such extra funds, as long as I resist the urge to jump straight to the more challenging dungeons and just stick to the easy-peasy ones for now.     In all honestly, I mostly lost interest in this kind of 'high fantasy' stuff a long, long time ago (I'm in my early forties, and played the original Warhammer ROLEPLAYING game - the one with dice 'n' paper - back in my late teens/early twenties!), but this brings back fond memories of murdering snotlings and orcs and what-not like it was only yesterday. Ah, to be young and nerdy again...and sure, it might lack the STRATEGY of the otherwise quite similar Space Hulk (the first video game adaptation, not the unnecessarily convoluted Ascension, which I'm yet to make my peace with), but if it's a more casual, jump-in/jump-out turn-based game you're looking for, you can't go far wrong here. Hell, I played for six hours straight the first night, and I don't do that with ANY games, ever. Simple, fast-paced, addictive, and sure to give you a severe case of 'just-one-more-dungeon-before-bedtime', even when it's already past five o'clock in the morning.   Verdict: 9/10.  (Oh, and PS...make sure you get the Deluxe edition, unless you really can't afford it...'cause I can only imagine that the variety inherent within the gameplay - hardly the game's strong point as it is - would be even more limited without it.)",
            "review_score": "1"
        },
        {
            "review_text": "Ignore the micro-transaction / IOS-port haters. This game is great for those who love turn-based combat (think XCom), especially great for those who love the Warhammer universe, and extra-specially great for anyone with fond memories of the excellent boardgame, of which this is a fairly faithful implementation. Anyone who does a little research will find that buying the Deluxe edition is the way to go, as this represents the best value for money - this is a lot cheaper than buying the same package on IOS (where micro-transactions are the only way forward).  The graphics can be pumped up from the main menu though it appears many people would prefer to ♥♥♥♥♥ that it's a lazy port with crappy IOS graphics than actually go in and look for that option. Mouse-based control works perfectly, so again any complaint about that is equally petty. True there are no PC key mappings, but the game doesn't need them. At all.  Just bear in mind it is a port of a dice-based boardgame, with all the pitfalls that come with RNG, and the slow pace of a boardgame, and you'll be fine.  So then, a fun game whose depth slowly reveals itself as your party levels up and acquires new items and skills and items that give new skills. Frustrating at times, as you will wipe due to bad rolls, but there's a great sense of progression as you move from town to town tackling increasingly difficult dungeons with an increasingly potent party. I am really enjopying this.  ADDENDUM: After playing considerably further after writing the above review, I am changing me review score. As your party becomes more potent and yourselves and the enemies get a lot more abilities to play with, the game really starts to shine. ESPECIALLY as a single player experience where interaction between heroes becomes more interesting and thought-provoking. This allows the game to show some tactical depth as you start to worry about carefully positioning your party and ordering your attacks to maximise very large Death Blows from your heavy-hitters that sweep away a LOT of enemies at once. In the end this offers more tactical depth than, say, late-game XCom, which was a pleasant surprise. Raising my score to 8.5 (from 7.5) accordingly.",
            "review_score": "1"
        },
        {
            "review_text": "This is a beautiful adaptation of the original boardgame. I am a huge fan of many of the Games Workshop titles and have been wishing for either a physical rerelease or an electronic version. Finally I have my wish. :) I am especially pleased that they have kept true to the mechanics of the board game. They have only made changes to a few of the mechanics to facilitate it as an electronic game.  If they keep putting out more DLC and especially add multiplayer support, this game will be a contender for best game of the year IMO.",
            "review_score": "1"
        },
        {
            "review_text": "The additional content bumps this game up to about four times the advertised price. Just not worth it for what you get.",
            "review_score": "-1"
        }
    ]
}