{
    "app_id": 326730,
    "name": "Whisper of a Rose",
    "release_date": "2014-11-14",
    "developer": [
        "RosePortal Games"
    ],
    "publisher": [
        "Degica"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "RPGMaker"
    ],
    "achievements": 53,
    "positive_ratings": 37,
    "negative_ratings": 39,
    "price": 6.99,
    "description": "Melrose is trapped in a life of hardship. She can find no one who understands her. To cope with her sorrow, Melrose turns to her imagination. Sadly, dreams must end... But not today. Melrose is about to meet her godmother and discover that the land in her dreams is real and in trouble.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/326730/header.jpg?t=1447364010",
    "minimum_requirements": "OS: Microsoft Windows XP/Vista/7/8 (32 bit or 64 bit) Processor: Intel® Pentium® 4 2.0 GHz equivalent or faster processor Memory: 256 MB RAM Graphics: 1024x768 or better video resolution in High Color mode Storage: 200 MB available space Sound Card: DirectSound-compatible sound card Additional Notes: 1024 x 768 pixels or higher desktop resolution",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a beautiful game that looks pretty promising but 13 hours in I find myself extremely frustrating wanting to quit it, delete it and never play it again. The same enemies OVER AND OVER AND OVER AGAIN. The frustration doesn't come from the fact that the game is hard. It's quite easy actually, but it gets so boring. Story is average, design is pretty cute and colorful, but other than that, everything is very annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a standard turn-based RPG. It looks like an old SNES RPG. Story wise its pretty average and alot of the dialog is awkward at times. The music is great, there are alot of stand out tunes that feel like they came from the glory days of RPG gaming. The battle system utilizes the same mechanics as the Final Fantasy ATB. Nothing groundbreaking here, but if you enjoy RPGs, this game wont let you down.",
            "review_score": "1"
        },
        {
            "review_text": "Here's what I liked: -Great art direction -Good music and sound -The turn-based combat was fun and streamlined  Here's what I didn't like: -Battles could get repetitive -The crafting system isn't very well-explained and the skill tree doesn't let you look ahead to plan -Some design pitfalls like making some objects impassible even though it's not clear why + invisible walls -Characters are flat, with attempts at nuanced backgrounds but... -the writing is all over the place, and it felt like it was written by somebody very young.   That being said, if this game was the result of somebody's first effort or that of somebody young, this is great work.   I would recommend it for those who are interested in game design, as a good case study, but only if deeply discounted",
            "review_score": "1"
        },
        {
            "review_text": "What I will say is that this game was playable enough for me to finish. I will give credit where it is due and say that there are some very nice things about this game. For a small developer (with this being their very first game), there are some things they did well... but they also definitely dropped the ball in some areas. For me personally, the features that I felt needed improvement and things that I found frustrating outweight the few shining aspects that the game has to offer.   Pros",
            "review_score": "-1"
        },
        {
            "review_text": "What the ♥♥♥♥ roses can't talk let alone whisper.",
            "review_score": "-1"
        },
        {
            "review_text": "Only so much crap that I can take and STEAM is overrunning with it.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a passable RPGMaker game dragged down by numerous small annoyances and frustrations. Your enjoyment will depend on whether you can look past them and get invested in the story or not.",
            "review_score": "-1"
        }
    ]
}