{
    "app_id": 326720,
    "name": "Instant Dungeon!",
    "release_date": "2014-11-25",
    "developer": [
        "With The Love Studios"
    ],
    "publisher": [
        "Flying Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Arcade"
    ],
    "achievements": 51,
    "positive_ratings": 139,
    "negative_ratings": 23,
    "price": 1.59,
    "description": "Instant Dungeon! mixes dungeon exploration with arcade action in the vein of the classic maze games from the 80s. Let Instant Dungeon! create a new dungeon just for you, complete with glittering treasures, vicious monsters, brutal boss battles, wild power ups and most importantly fun, Fun, FUN!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/326720/header.jpg?t=1478035923",
    "minimum_requirements": "OS: Windows XP/7/8 Processor: 1.5 Ghz or better Memory: 1024 MB RAM Graphics: OpenGL 3.0 or better capable video card Storage: 60 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Bought it on sale for less than $2. It's quite addictive and pretty challenging.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a throwback to the early 80's. I'd say a combination of Pacman, Lock n Chase with weapons and powerups. Boss battles are pretty tough. Seems like alot of mindless fun content for 1.99. Achievements and cards added.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun and somewhat addictive roguelike.  Keeps you playing to see how far you can get, in order to unlock new gameplay modes.  The further you get the bigger the levels get, as well as the darker they get.  May get a little repetitive after awhile, but for ~$2 you really can't go wrong picking up this game and having a little fun with it.",
            "review_score": "1"
        },
        {
            "review_text": "I had installed it,and when i did i wanst too thrilled i thought there was only one game mode and when i relilsed i was wrong i was in love the game and still am.",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play to burn some time",
            "review_score": "1"
        },
        {
            "review_text": "When I first got this game, my controller didn't work. There's not a lot of controls in this game, so it was totally playable without one, but the quick navigation through the mazes really made me want to be able to use an analog stick. After a long time not playing the game, I tried it today and my controller worked. I thne proceeded to make it significantly further than I ever had and was prompted to jump over here and recommend the game.  I've seen this game described as Pacman and Gauntlet having a baby and I would say that is an accurate description. If i had to think of another description, I'd call it a procedurely generated Epic Pacman. The graphics are great - big blocky old school NES type tiles. The music (which I didn't really realize existed til I played with my headphones in tonight) is also great. The music is soft, but that really sets the mood. I t really gives you a fantasy dungeon crawling feeling.  I think this is an awesome little indie game, and the only negative I acn possibly think of is: I'd like to see achievements. You can unlock different game modes in the game by doing specific feats. I would like to see achievements that tell all my friends that I accomplished those feats. It's just a little obsessive type thing I have.  With or without achievements, this game is fantastic and well deserving of a measley $1.99.  Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "It's fun. This is a placeholder review, so more is to come. But it is good.",
            "review_score": "1"
        },
        {
            "review_text": "-Grab coins -Grab key -Advance to next room which is the same thing but bigger  This is all there is to this game.....Better watch your cash burn.....its more fun",
            "review_score": "-1"
        },
        {
            "review_text": "I was totaly bored in 10 minutes. Pacman may have beem cutting edge entertainment in 1981, but things have moved on.",
            "review_score": "-1"
        },
        {
            "review_text": "Really simple and cheap yet so great. The simple idea of getting the key and going to the next level is very well executed with multiple unlockable gamemodes etc. It's a cheap game you just need to have in your library. AND THE QUESTS HAVE ORK RACISM!  11/10",
            "review_score": "1"
        },
        {
            "review_text": "This game... Tired of traveling to the dungeons?   ~ Instant teleportation to the Dungeon.  ~ 2$ PRICE! ~ WORTH IT!  ~ Has a better combat system than Elder scrolls: Morrowind.  ~ Most of the characters you generate are black.  ~ You ask yourself where the ♥♥♥♥ has this game been back in the 90's?  ' Yeah it's a pretty good game i guess...' :)",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive and I can see many hours ahead wasted on this game. Starts of easy for the first few levels but gets harder as the dungeon gets bigger and darker.  Using my 360 controller made it easer to move around. The only thing that is missing is an option to exit the game in the main menu (you have to hit the ESC key to exit)",
            "review_score": "1"
        },
        {
            "review_text": "There is so much about this game that was done well. The variance in the game modes and the randomly generated dungeons allows for almost unlimited playability. The game is also very rewarding as well. I invested time into the Adventure Mix mode and ended up with the 12th highest score of all time in that game mode.  10/10 This should be in everyone's library",
            "review_score": "1"
        }
    ]
}