{
    "app_id": 32680,
    "name": "Delta Force — Black Hawk Down: Team Sabre",
    "release_date": "2009-06-18",
    "developer": [
        "Ritual Entertainment"
    ],
    "publisher": [
        "NovaLogic",
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS"
    ],
    "achievements": 0,
    "positive_ratings": 167,
    "negative_ratings": 17,
    "price": 0.0,
    "description": "Delta Force — Black Hawk Down: Team Sabre is the official expansion pack to the #1 best selling PC game in North America. Team Sabre was developed using the Delta Force — Black Hawk Down engine and it requires the mother product to run.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/32680/header.jpg?t=1531308383",
    "minimum_requirements": "OS: Windows XP, Vista Processor: Pentium 4 1.4 GHz or Higher Memory: 512 MB Graphics: 64 MB 3D Card Hard Drive: 750 MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "To this day, the last few missions of the main campaign can still really absorb you. Now that's an achievement.",
            "review_score": "1"
        },
        {
            "review_text": "This was one of the best multiplayer FPS games with a great community of the 2000s. I started in 2003, and stopped around 2009. The community still has people playing and Novalogic even upgraded their servers in June/July 2014.   ",
            "review_score": "1"
        },
        {
            "review_text": "there is not much to say about this game except one question:  did you like the movie black hawk down?  1) yes &gt; then buy the game because it is based on the movie and it even has much more completed missions about the mogadishou story, the game is simple amazing and missions are way too long besides team sabre expansion allows you to play 2 more campaigns one in cloumbia other one in Iran.  2)No &gt; then i am sorry for you... go kill yourself  3) what is black hawk down? if you do not know the movie then just hang yourself gg thanks bye!  10/10 this is Five-One are we cleared to engage?",
            "review_score": "1"
        },
        {
            "review_text": "A blast from the past! Fun game!",
            "review_score": "1"
        },
        {
            "review_text": "No man left behind!   A must have.",
            "review_score": "1"
        }
    ]
}