{
    "app_id": 327010,
    "name": "Motorama",
    "release_date": "2014-11-21",
    "developer": [
        "251 Games"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Racing"
    ],
    "tags": [
        "Racing",
        "Action",
        "Simulation"
    ],
    "achievements": 21,
    "positive_ratings": 116,
    "negative_ratings": 210,
    "price": 14.99,
    "description": "Go back in time and experience, “The Fabulous Fifties”, in a game that recalls scenarios, vehicles andstreet races of the legendary 50´s films. Customize your car and compete in 8 different race modes, through five completely different 50´s themed areas and become the King of the Road.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/327010/header.jpg?t=1447364033",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: Intel® Core™ i3 / AMD® Athlon™ 64 x2 or higher Memory: 2 GB RAM Graphics: Nvidia® GeForce™ 8800 GTS / AMD® Radeon™ HD 3850 or better DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This might be one of the worst games I have ever played. The cars handle like they were from Crusin USA or some other early 2000s game. The physics are almost non-exsitant and there are absolutely no damage models. The soundtrack gets on your nerves after a few minutes. Also it never feels like you are traveling very fast. 150 feels like 50. Oncomming traffic appears to be moving at a SNAILS pace when you blow by them. If I were in one of those cars, maybe I could get to work in 10 hours at that rate...  This game might be worth it, if it was advertised as a cute little 4.99 arcade racer. There are lot's of costumization options and the visuals aren't terrible for a Unity game.   However, overall I would give this a 1.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game isn't even worthy of a lengthy review, but a simple 'don't waste your money'. A near $30 game (yes, 30 bucks, because I'm Australian and our dollar is horrible) that's not even worth the $2 or something that I paid for it on a third party site.",
            "review_score": "-1"
        },
        {
            "review_text": "I understand the criticism for this game, some of the critics make rather good points like the idiotic AI, the looping music and few bugs while racing. But all in all I found the game enjoyable, I like the mechanics of the achievements to unlock new levels and the car customization. The physics during the race are not brilliant but decent and I found myself struggling to finish some of the races. If the developers keep fixing bugs and implementing some of the required improvements claimed by some critics I think this could be a funny and entertaining game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is alot of fun despite it's few bugs it looks good on the Unity engine   The gameplay is alot of fun and it is keyboard/controller style gaming, drifting is fun and tracks rather large so plenty of powersliding room, lots of upgrades can be done for performance and there are visual upgrades to which are little limited.  Its good break from later cars with the game set in the 1950's sort brings back memorys of game i used to play in school Street rod and the game makes the 50's era work rather well, there is great deal of cars for small game and anyone into this era of cars will notice some familiar looking cars  There is no damage or performance loss when crash, and options are limited standard unity selection pretty much   The game does have some bugs music issue is worst for me if turned off it turns back on only in menus, The AI are very crazy and do ghost through the traffic and really need option to turn of motion blur when using Nos  I think if the developer fixes some bugs maybe add in some nice classic V8 sounds they will be on a winner   The price is ok i think discount price of $16.99 USD is about right  It won't be everyones cup of coffee but it sure is for me i enjoy and will continue to play it",
            "review_score": "1"
        },
        {
            "review_text": "Game released in late 2014 with Xbox 360 pad support... yet there's no dead-zone configuration available anywhere? Brilliant! Have fun having your car blast its way to the wall or constantly shifting left and right.",
            "review_score": "-1"
        },
        {
            "review_text": "At first i first i saw that it had alot of not recommended review but i decided it might be okay but boy was i wrong. the games can sometimes lag for no reasons,the handling is bad and because its a racing game its handling can make it quite....well not fun at all   WOULD NOT RECOMMEND! i want my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "my game is stuck at level 10",
            "review_score": "1"
        },
        {
            "review_text": "I prefer to play Bad Rats than this. I guess I don't have to say anything more.",
            "review_score": "-1"
        },
        {
            "review_text": "It had great promise, terrible execution. Clearly, the game was never finished.",
            "review_score": "-1"
        }
    ]
}