{
    "app_id": 327410,
    "name": "A Bird Story",
    "release_date": "2014-11-07",
    "developer": [
        "Freebird Games"
    ],
    "publisher": [
        "Freebird Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Indie",
        "Story Rich",
        "Great Soundtrack"
    ],
    "achievements": 1,
    "positive_ratings": 5987,
    "negative_ratings": 1147,
    "price": 2.79,
    "description": "An experimental short from the creator of To the Moon &amp; Finding Paradise: A simple &amp; surreal 1-hour interactive animation about a boy and an injured bird, told without dialogues.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/327410/header.jpg?t=1547583097",
    "minimum_requirements": "OS: XP, Vista, 7, 8 Processor: &gt; Intel Pentium III 800 MHz Memory: 2 GB RAM Graphics: 1024x768 High Color + DirectX: Version 9.0 Storage: 200 MB available space Additional Notes: Usually runs on anything more than a baked potato.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "To The Moon had a great story. I didn't expect as much from a short preview for the next game. Heck, this game doesn't even have dialogue, and there's hardly even any gameplay. But it seriously brought me to tears. If you have a soul, play this game. If you don't have a soul, play it anyway.",
            "review_score": "1"
        },
        {
            "review_text": " Perfect for those that lament having left childhood behind",
            "review_score": "1"
        },
        {
            "review_text": "A Bird Story is told in a surreal blend of dream and life sequences. There's no text; the graphics tell the story, while music and color evoke the mood of each scenario. One dream sequence, for example, manages to convey a threat to the boy and the bird solely through imagery. It's a powerful example of both the child's imagination and his perception of threats. It speaks to the emotional strength of the tale.  There's more story than game in A Bird Story, but it effortlessly conveys volumes in short cinematic sequences. The experience is tightly controlled, and the player interacts at key points such as rescuing the bird, giving it food, and playing with it. The sweeping sequence where they go on a paper airplane flight to help the bird find its family is magical and literally a flight of fancy. The experience may be incredibly short, but it's powerful, and players will marvel at the sense of imagination and storytelling without a single word being said.",
            "review_score": "1"
        },
        {
            "review_text": "Bird Story is a lovely little story told with out words, about a little boy and a bird he found and rescued. I totally enjoyed this heart warming story as I followed the path of the boy and his new friend. :)  This in my opinion is a very sweet story, with real life story telling in it, and worth a play through if you enjoy heart warming story games. The story is short, and can be completed in less than 2 hours, and I felt it was a very nice 2 hours, I enjoyed my time with this game. ;D  I am extremely grateful to the lovely friend who gifted Bird Story to me, this was truely a lovely surprise, and I Thankyou greatly for the lovely gift and the opportunity to experience this journey, between the boy and the bird. ;)  ",
            "review_score": "1"
        },
        {
            "review_text": "I usually make it a rule to never touch RPG maker games, but after how great To the Moon was, I figured I'd give this one a shot (it's made by the same person). I am so glad I did. I wouldn't call this much of a game, but it's a really good interactive story. Without a single line of written or spoken dialogue it still manages to be more emotionally moving than most games dream to be. It was short, sweet, and incredibly captivating. If you liked To the Moon or just want to try something different, definitely give this a shot",
            "review_score": "1"
        },
        {
            "review_text": "Bird story is a prequel on the 2nd extension of to the moon, it introduces on what will be the 2nd patient on the sequel.  It is only an 1 hour long so this is definitely recommended only for people who had played to the moon and treat it as a religion just like me. It's a bit hard to convince and sell it to your friends especially since the game is still stuck on the limitation of the engine; resolution and input responsiveness. But hey, A storytelling games usually don't need those anyways and the beautiful artwork inside the game redeems the low 640x480 default resolution.  The story itself is quite simple but the game does it without using any words or dialogues. While the story may have been weaker vs to the moon, the presentation, execution, ambiance is way better. Changes in color grading are perfect for every certain emotion. As usual, just like in to the moon, there's a few jokes and icebreakers to refresh any tension in the story flow.",
            "review_score": "1"
        },
        {
            "review_text": "  In 1979 an interesting psychological experiment was concluded. 144 depressed and 144 non-depressed undergraduates were told to press some buttons and tell if it turned the light on. Most of the healthy subject were prone to overestimating their control, but the depressed ones were free from any positive bias and viewed the situation more realistically. For some reason I remembered this study while “playing” the game. Even when you do have the controls, sometimes the character would just walk in the predestined direction no matter what you do, and most of the time the game just plays itself as the story unfolds wihout any input whatsoever. Depressive realism at its fullest. The story itself is very simple, and as something that was designed to be a sad, imaginative and emotional journey is instead a clichéd tedium. I think one would appreciate such a tale when ~10 years old or so but a 10 year old would never have the patience to watch this (pretty boring!) scene unfold. So the target audience is virtually nonexistent.  Also, forget the bird, I would totally take the awesome badger!",
            "review_score": "-1"
        },
        {
            "review_text": "I hope to write a longer, more detailed review later, but perhaps not.  ' 'It was hell...', says former child.' - Kliban  Experienced 'A Bird Story' last night. 57 year old man, and cried like a baby (more than once.) All the memories of my childhood spent in such total lonliness and isolation. The unconditional love I found from animals (to this day.) The getting older, causing so much purity and innocence to be left behind. The slow, then sudden understanding of the pain of living.  Not exactly a game, since it pretty much takes over the controls. In fact, control is so rare, the computer notifies the player of every single instance.  A Bird Story destroyed me. I don't honestly know if I would go through something like it again, knowing the pain it would cause. But I have to say the story itself was as close to perfect as I would ever want. Other than pain avoidance, I can think of no reason for anyone to choose to not experience it too.  Online completion is necessary to obtain the achievement.",
            "review_score": "1"
        },
        {
            "review_text": "Very short but nice story. I won't tell you anything about the story, because everything would be too much of a spoiler. All I can tell is, that its nicely written.  The soundtrack is really good and helps describing the atmosphere and the story. There is almost no text, only the main menu and the credits. So for me it didn't matter which language I took, as long as I can understand some of the words. All the story is told with just the music and character movements. Like an old movie.  Artwork is nicely made.  As a gamer who wants the achievements done, this is one of the easiest game to complete. And even if you are not into achievements, it only takes about 1 hour to complete/watch.  100% recommendation from me.",
            "review_score": "1"
        },
        {
            "review_text": "As always an amazing game from Freebird Games can't wait to see what's next!",
            "review_score": "1"
        },
        {
            "review_text": "Once upon a time. There's a boy who likes folding paper planes, And a bird who was found by the boy. So the boy made the bird into a bird-paper plane.  Best story ever.",
            "review_score": "1"
        },
        {
            "review_text": "A satisfactory game that didn't quite leave me fulfilled, however, recommended for the simple, interactive story, beautiful artwork and buoyant soundtrack. Not for the easily distracted.",
            "review_score": "1"
        },
        {
            "review_text": "A lovely story about a young boy and his pet bird, 'A Bird Story' is a short visual novel-esque game that manages to deliver a heartwarming narrative without a single spoken word.",
            "review_score": "1"
        },
        {
            "review_text": "Much like To the Moon, but shorter. It seems to be the prequel to a later game. I found the music enjoyble, but similiar to the game that came before this one. I liked the subtle references to To the Moon as well. There is not too much gameplay, instead the game likes to focus on the story with lots of cut scenes. Overall, I liked it, but not as much as To the Moon.",
            "review_score": "1"
        },
        {
            "review_text": "Having just finished A Bird Story, I have to say how much I loved this game. Granted, I haven't had a chance to play To the Moon yet although it is in my Steam library and I'll get around to playing it when I have a chance. However, getting back to this game, I truly loved it. It has a beautiful story, music, and art. As much as I would love to reveal what the story is about, I can't do so without revealing major spoilers. Instead, I'll simply describe what I loved about this game.  A Bird Story narrates a story through the use of graphics, music, and, of course, gameplay so no words need ever to be said. Now if a game can truly convey a story without ever uttering one word, that truly is something special, I think. As another reviewer has mentioned, this game does play more like a visual novel, specifically like a kinetic novel. I say that because you don't really get to make any specific choices as to how to control the main character. When prompted, you have to move your character as designated. However, because the story is beautiful and touching, I think it makes up for the lack of choices.  If there is one negative, I'd say that I would have liked it if there had been an option to save at any point. Despite that the game is pretty short, I still would have liked a save point option rather than the game determining from where I could leave and start again. Other than that, I really liked A Bird Story a lot and the ending has me intrigued. There's sure to be a sequel in the works and I can't wait to try it out if/when it comes out. :D",
            "review_score": "1"
        },
        {
            "review_text": "A lovely story about a lonely little boy and his friendship with an injured bird. With no dialog, no text and barely any interaction, A Bird Story grabs your hand and guides you along the story simply with its soothing visuals and music.",
            "review_score": "1"
        },
        {
            "review_text": "This game is good, it has a artistic &amp; creative story. Even though there is no spoken or written words you can see what is being said through their thinking and body language. Reminds me of silent films. It has an awesome soundtrack and a very imaginative story.",
            "review_score": "1"
        },
        {
            "review_text": "  Best story, best not to cry :'(  10/10 for this game",
            "review_score": "1"
        },
        {
            "review_text": "I cried. So worth it  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Such a heartwarming story! I could cry and smile at the same time.",
            "review_score": "1"
        },
        {
            "review_text": "In a strange sort of way, this game reminded me of Calvin and Hobbes. Social misfit kid disconnected from parents finds happiness in his imaginative interactions with an animal. Bad comparisons aside, as long as you don't play the game with the expectation that it will replicate To the Moon's format, you'll be in for a pleasant hour. It does replicate many of the things that made TTM great (great soundtrack, throwback 16 bit graphics, quirky sense of humor), but eschews the more complex story of TTM for a stripped down narrative that focuses more on emotion than complex narrative development.   I've seen a lot of backlash against the lack of dialogue in the game, with the general impression that, as RPS put it, it just adds a 'bonus sense of pomposity' to it. This strikes me as an overly cynical view of the game. As I experienced it, the lack of dialogue forced me to search elsewhere to fill in the narrative gaps, a search that A Bird Story rewards by layering the game with a series of subtle, effective cues. A blanket placed around a sleeping child's shoulders. A pile of briefly read notes scattered on a table. Taken in isolation, none of this means much, but I found that the sum total of these snapshots was enough to make the experience sufficiently immersive.   A Bird Story didn't move me to tears, and it didn't have me laughing so hard that I couldn't catch my breath. But it did make me smile, and its whimsy and simplicity carried me back to my childhood, if only for an hour, and that's where I think this game succeeds. It's a brief ode to the boundless imagination of childhood, to the inherent mutability of what we perceive, and to the small joys and miniature heartbreaks that we encounter in our daily lives. The game never aspires to be more than a brief snapshot of a lonely kid, but within those confines are small moments of levity, loneliness, and genuine warmth, and that was enough for me.",
            "review_score": "1"
        },
        {
            "review_text": "This isn't a game. If you're looking for a game, this isn't for you. If you're looking for a brief but sweet set of vignettes about a boy and his bird, you've come to the right place  Especially recommended for those who played and enjoyed To The Moon.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely amazing, great, and breathtaking. The story starts from a young boy who is what I would expect to be an orphan. As he journeys around the world finding hope, he is isolated and all alone. He is brave and keeps going. He goes to school, and to a forest where he saves a bird. That bird then becomes his friend and he feeds the bird in his home and take care of it. Then the boy and the bird make a big paper plane to fly around many places. Unfortunately, the bird and the boy escape from a bad guy and fly through a thunderstorm. The thunderstorm then shatters the paper plane leaving the boy alone. In the very end, the boy finds hope and sees the bird return home with another bird. But from all of the content and gameplay in this game, I've found it very sad, emotional, and overall amazing. The sound is amazing and it fits in with the background. I cried until the very end of the game. It's just so sad, and emotional. Just to be honest, I think this game relates to how a young person's life would be like to be alone, homeless, and become an orphan. I find it so hard to think that when your alone, it's so hard to continue your life but you just know that you have to push yourself to the limits as to what this game is pretty much about. I recommend playing this game if you just want to cry, feel sad, and be emotional about someone you just miss and want them to come back. I just love this game because I'm emotional like most people are and have a bright heart that has care, respect, love for my parents, cousins, friends, and anyone that I love. Overall, I love this game and I just play it again to remember that sound in the background to think in the past of the people I missed in my life and couldn't ever see them again. T_T I'm crying! :D :( So much tears, I cri evrytiem. This game just brings so much tears, and sadness that it's so beautiful! :)",
            "review_score": "1"
        },
        {
            "review_text": "If the birds in hatoful boyfriend were not enough",
            "review_score": "1"
        },
        {
            "review_text": "07/10",
            "review_score": "1"
        },
        {
            "review_text": "1 hour long story which almost just almost got me cry! Almost got me there Kan! :P This is a really good story even though it is rather short and no text (that is unique in itself). Any person that have or had shared something special with any kind of animal, like me and my grandparent's dogs would definitely feel the feels on this game.",
            "review_score": "1"
        },
        {
            "review_text": "A Bird Story seemed to me that it was a touching game, with a rich story and fun to play. I couldn't have been more wrong. First of all: you don't really play it! The game doesn't let you interact for long periods, and when it does you just do boring and pointless actions. Most of the time you only watch the character moving himself in a tedious sequence. Also, it has a prepotent air of a game that was supposed to be touching and very sensitive, with a constantly playing piano and a lonely boy as a the main character, but I didn't feel connected to the plot at any time. A Bird Story, that was supposed to be touching a lot a feelings, will only make you feel bored and, if much, angry for spending your money on it.",
            "review_score": "-1"
        },
        {
            "review_text": "This is best game ever...but it's very touching. I remember, I played To the Moon and I cried at ending and now it made me laugh and cry when the boy made his good friendship with a bird.   I would like to thank you, Reives....Thank you for making To the Moon and I really did enjoy with this. Now I would like to see 'Finding Paradise' when the game release.   100/10 would cry from my saddest memory from To the Moon.",
            "review_score": "1"
        },
        {
            "review_text": "Okay so yeah there is a bird. There is a story. There is one achievement so you can easy perfect game. nuf sed.",
            "review_score": "1"
        },
        {
            "review_text": "To The Moon is my favorite game of all time. Naturally, I have been impatiently awaiting A Bird Story. As always, the music is absolutely beautiful. I think the disclusion of dialogue fits the story well; the dialogue would be unnecessary. To The Moon is still my favorite game, but I can't wait to see the future of the protagonist in the sequel. Buy the game and sountrack bundle and sit down for an hour of awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Thanks for gently breaking my heart again, Freebird Games.",
            "review_score": "1"
        },
        {
            "review_text": "(This has a little bit of spoiler)  ♥♥♥♥ing ninjas cutting onions  Now being serious this game is fantastic , it's great you should definitively buy it , time doesn't matter because you can win it in an hour . It's a short game but damn it hits you right in the feels , well if you know how it's to lost a pet that you loved.  I recommend it to everyone , but well it's your choice if you want to buy it",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet!",
            "review_score": "1"
        },
        {
            "review_text": "The moment the bird is flying, I couldn't hold my tears anymore :'( Thank you Freebird and Kan Gao for the wonderful 90 minutes journey :)",
            "review_score": "1"
        },
        {
            "review_text": "I shared my ice cream with my bird like the boy in the game did. But my poor bird died. A bird story is based on lies!",
            "review_score": "1"
        },
        {
            "review_text": "This game has heart. The art is beautiful, the soundtrack is beautiful, and, most importantly, the message is beautiful. I cannot explain what you will feel or what you will take from it but I can say it will change you for the better. Just go in with an open mind and be receptive to what is being conveyed here.  As a microcosm of life, we knew how it would start and how it would end. We stayed for the journey. Oh what a journey. Thank you for making this game, Dev.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "A lovely sweet story about a boy and a bird. The music is briliant throughout. Was expecting a game, and if thats what you want dont get this. Interactive in places, but it is just a story.",
            "review_score": "1"
        },
        {
            "review_text": "A charming little adventure story about a boy and a bird. Graphics are simple RPG-maker fare, but it's the heart-warming tale that makes the game worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "A Bird Story is a 'game' that focuses on non-verbal language. There are many ways to tell a story, but most of the games are based on text. The game ambiance is very rich, mixing beautiful music with beautiful scenery. Your task though, is just to sit and watch. If you're looking for a game to play, explore, do things, etc., you might get frustrated with A Bird Story. For me, that's not actually a con, (as follow the description, it's an  interactive animation ). If you're not bothered enjoying a short sentimental animation, this game is for you, but don't expect something like 'To the Moon'.",
            "review_score": "1"
        },
        {
            "review_text": "  ★★★✯☆ This was yet another touching game by Freebird Games , although this time around it was a lot shorter and a lot less emotional , yeah it is still a sad game but to a lot lesser degree than To the Moon . The game is however still good and pulls at your heartstrings one way or another, if you liked To the Moon you won't necessarily like this game but it’s worth giving it a try. 3.5/5! ",
            "review_score": "1"
        },
        {
            "review_text": "had a great time. Exactly what i expected and look forward to future games from this dev.",
            "review_score": "1"
        },
        {
            "review_text": "Never in my life would I think birds would make me cry but here I am crying",
            "review_score": "1"
        },
        {
            "review_text": "A Bird's Story is less of a game and more of an interactive short story. But anyone who has played To The Moon, the creator's previous work, knows that this is not necessarily grounds for criticism. Any fan of classic 16bit Japanese RPGs could tell you that simpler graphics, animations and musical phrases, when used correctly, take on a metaphoric quality that can be more effective at communicating concepts and emotions than the most detailed scripts, character models, animations, and fully orchestrated scores ever could.   This is a director who demonstrates not only an understanding of this type of restraint, but a mastery of its employment. Here, as in To the Moon, Kan Gao is able to get a lot of mileage out of lovingly drawn 16 bit pixel art and a beautiful miminalistic piano score.  A Bird's Story is a much simpler narrative than To The Moon, but it is no less elegant. It is a deeply sentimental story, but also one with restraint, two characteristics rarely found in the same work. The entire story is told, quite effectively, without a single word and the ending hints that this narrative serves as a small teaser for the creator's next big project, something undoubtedly to be anticipated. But in the meantime, if you have an hour and a couple of bucks to spare, this is beautfully rendered little story. Nothing pretentious enough to pretend profundity, just a lot of heart and beautiful craftsmenship. 4/5",
            "review_score": "1"
        },
        {
            "review_text": "A delightful and endearing story!  10/10 would neglect my kid again!",
            "review_score": "1"
        },
        {
            "review_text": " I almost cried at one point.",
            "review_score": "1"
        },
        {
            "review_text": "Hatoful Girlfriend - the video game.",
            "review_score": "1"
        },
        {
            "review_text": "I personally felt this game was dragged out, loved To The Moon, but this in my opinion isn't their best work.",
            "review_score": "-1"
        },
        {
            "review_text": "I really like this. It was short and sweet.   It didn't quite have the impact on me that To the Moon did, but it was nice to see Freebird Games putting something out. I can't wait for their next full length game.",
            "review_score": "1"
        },
        {
            "review_text": "Half imagination, half memory, A Bird Story is a simple 'game' that explores the hazy recollections of a young boy who saved an injured bird. Despite not having any dialogue and artfully lacking in player interaction, A Bird Story successfully evokes emotion in the player through its poignant soundtrack and beautiful imagery.   I was a huge fan of To the Moon (I've bought the game multiple times for friends and also purchased the soundtrack) and A Bird story does not disappoint. However, I'd recommend buying it on sale for its brevity, however powerful.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "A cute and sweet little game, but had even less 'game' aspect than To The Moon which I adored. It is an easy 'perfect game', it was short and generically enjoyable. Get if it is on sale and you want a relaxing evening.",
            "review_score": "1"
        },
        {
            "review_text": "This is more like an interactive movie than a game, but I really enjoyed this.  There are so many cute and emotional moments, the soundtrack in the background is wonderful and I really liked the idea behind the story. It works great without any dialogues and I didn't miss them at any time.  ",
            "review_score": "1"
        },
        {
            "review_text": "Charming, simple, short, and moving. Very enjoyable. The ending was just the icing on the cake.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very sweet. the art and music are incredible. The art is a step up from Freebird's previous game, To The Moon, but the music remains much the same. Not that that is a bad thing at all! The game has no dialogue or text whatsoever, yet maintains a strong narrative. It is very well executed. Well worth the cheap price, but don't expect to get deep gameplay or to play more than an hour or so. Get this if you want to experience a cute story about a boy and a bird, and/or if you're a fan of To The Moon (this game sets up for the sequel)  did i mention it's super cute?",
            "review_score": "1"
        },
        {
            "review_text": "Just like to the moon, this is absolutly beautiful. It is simply done with how beautiful it is. It pulls you in a simple narrative that translates well using only images and it got me teary eyed like all the others.  Unlike what David Cage says, there is no reason you can't make a heart-touching game if you don't have the polygons.",
            "review_score": "1"
        },
        {
            "review_text": "There are no words for a masterpiece like this. The soundtrack makes having a dialogue obsolete. Personally this game is worth more than the pricetag.",
            "review_score": "1"
        },
        {
            "review_text": "Well, it's not as good as To The Moon but 1 hour long game which can tell the story without any words certainly was an interesting experience. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "As I am typing this I'm still a little overwhelmed (in a good way) about this fantastic game. I recommend this to anyone who loves birds, weird pixel stuff or who just want to cry, basically anyone with real human emotions.",
            "review_score": "1"
        },
        {
            "review_text": "  I don't know why, but their games stir up a hurricane of thoughts in my mind. This game is so me, I did everything from making paper planes using all of sister's and my school books and throwing them out of our balcony only to find people complain about how messy the whole block would get the next day to trying pet the pigeons that lived on my loft. I'd chase butterflies and learned my lessons the hard way that these are living things that die when not handled with care. This is a wonderful game. It's so simple yet so bold, so quiet still so descriptive. A very cute narrative and everyone should play it once for old times sakes.",
            "review_score": "1"
        },
        {
            "review_text": "Where can i start?  this is a short little 1 hour 'game' that isnt a game. its more an experience.  nearly no gameplay and rpg-maker like graphics. BUT lots of heart in the Story. it tells the story of a little kid and a bird without a single line of dialogue.  not as good as the Masterpiece 'to the Moon' from the same producer.  but its a great journey at a really low price.",
            "review_score": "1"
        },
        {
            "review_text": "A simple concept, told with such extraordinary whimsy, charm and heart. It's short, but a thoroughly worthwhile experience, reminiscent of Bill Watterson's best work.",
            "review_score": "1"
        },
        {
            "review_text": "What a great ♥♥♥♥ing indie game. This developer knows how to get you right in the feels. If you loved his first game 'To the Moon', you will definitely love this one too. I can’t wait for his next game “Finding Paradise”.",
            "review_score": "1"
        },
        {
            "review_text": "END: Obviously, this is the prologue to To The Moon: Episode 2. With this view you can forgive the monotony and linearity, for even in The Mirror Lied was interactivity. The soundtrack memorized one main theme.  In short, this is the prologue (as MGS V: Ground Zeroes).  RUS: Очевидно, что это пролог к To The Moon: Episode 2. С этой точки зрения можно простить однообразность и линейность, ибо даже в The Mirror Lied была интерактивность. Саундтрек запоминается одной главной темой.  Короче говоря, это пролог (как MGS V: Ground Zeroes).",
            "review_score": "1"
        },
        {
            "review_text": "I played to the moon, both of these games are sad. If you want to love birds from now on and get a little sad maybe more or less it depends on what type of person you are. Play this game it may seem like a short game but trust me this game will ruin your way of looking at birds in any bad way what so ever.",
            "review_score": "1"
        },
        {
            "review_text": "A short story about a boy and a bird. Enyoable and I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This not really a game but in fact its like a story telling about a lonely kid which is abused in class and the teacher just punish him without asking whose at fault, which in fact similar to most childhood memories of everyone, in return we would seek our own happiness especially to those that felt that are alone.  Warning: Please do not play this game when you are depressed, this will makes you feel worst despite the ending is slightly considered as happy ending. You also should not play this game at night time or when you are going to sleep as there is no save button despite the game only lasted for an hour or even less.  Recommending this game? Well I would say yes and if you are the type that really enjoy visual and hate reading,this game is suitable for you and in fact, I enjoyed it but the only regret I felt is that the movement of the character seems to be very laggy and the story is alittle short.",
            "review_score": "1"
        },
        {
            "review_text": "It's rather short, lacks much actual gameplay, and there is no actual dialogue. But it still manages to touch you in a way. I'll admit I'm a bit overly emotional, and this story had me crying by the end. Both out of sadness and happiness.",
            "review_score": "1"
        },
        {
            "review_text": "Like many, I was touched by Freebird Games' first game 'To The Moon', one of the most emotional games I have ever played. So how does 'A Bird Story' stack up compared to that game?  As you have probably already seen in the screenshots, both games are made in RPGmaker. Most people either love or hate RPGmaker games, personally I do not really care as long as the game is good.  Aside from the graphics, A Bird Story does differ a lot from To The Moon. The first difference is the length of the game, To The Moon was not a very long game but it still was a lot longer than A Bird Story, which only should take you one hour to complete. Second difference is there are no conversations, unlike To The Moon where you would get sucked in the story, A Bird Story takes on a different, more art-like story.  The third difference is that A Bird Story is a 'feel good' game and no tearjerker like To The Moon.  So yes, both games differ quite a lot from each other, which is not a bad thing. Both games are good in their own way, you just should not expect a game like To The Moon, even though it has some moments that reminds you of To The Moon.   Overall 'A Bird Story' is recommended to anyone who enjoys 'art' games and want a nice 1-hour experience.   ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 a sweet and fantastic story",
            "review_score": "1"
        },
        {
            "review_text": "After playing 'To The Moon' I wasn't sure what to expect from 'A Bird Story'. I didn't think a game so short could measure up to what I had experienced before. But 'A Bird Story' was a really nice, quick game with great music and a sweet story. There was no dialogue which came as kind of a surprise to me but it was so easy to understand and follow what was happening. The friendship between the bird and the boy was so great to see unfold and it was just a perfect way to spend an hour. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This was the first game in my life to actually make me... cry.  A touching and beautifully visualized tale about a child and a bird, with gorgeous music and a fantastical dreamlike element that really sets the tone for your own interpretation, working towards a buildup that makes you feel things you probably wouldn't expect. A Bird Story shows that engaging storytelling doesn't always need words. Lovely.  It's something I wouldn't have expected from a 16-bit game. Definitely worth the price and a further look into the studio's other games.  My only complaint has to be about the finnicky controls, but since you don't use them that much at all, it's forgiven.",
            "review_score": "1"
        },
        {
            "review_text": "A silent masterpiece in storytelling",
            "review_score": "1"
        },
        {
            "review_text": "This game is just a true piece of art!   It doesn't have much gameplay, but the story and everything else is just amazing beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "Touched me like its prequel. It's that kind of game you carry with you for a long time thinking about it. The RPG maker graphics woke sweet memories of Gameboy times.  Really worth it!",
            "review_score": "1"
        },
        {
            "review_text": "-1,5 hours long -just a boy, his bird and a bunch of shadows -no word spoken  still a better lovestory than Twillight",
            "review_score": "1"
        },
        {
            "review_text": "Complete misuse of the medium. Tedious as a game and underwhelming as a story.",
            "review_score": "-1"
        },
        {
            "review_text": "Point and click games, art games, and exploration games are all things I really love because the story is usually very strong. But the story was very predictable of any animal/human trope that you can think of. Visual novels and interactive stories are something I love as well but usually.. even those require some of the player's input? You're just prompted to move and push the spacebar every so often. The game is BEAUTIFUL and I wanted so badly to love it since its been on my wishlist for so long.. but I didn't. It's worth it if the game goes on sale but I wouldn't recommend 'playing' this for the full four dollars. That being said, I DO hope the next chapter of the game does better and I'm up for giving it a try if there's improvements made!",
            "review_score": "-1"
        },
        {
            "review_text": "'Thanks for paying money for our slightly interactive teaser of our next proper game that makes little to no sense or point without that next proper game!'- might as well be the description of this. It still uses RPG maker in a creative way for storytelling and has okay (at least fitting) music, but it's basically making something that has no point or taste at least look nice. Seems like a flashback scene that just was made into a separate game, and you know what? If you do that, you might as well do something as good as Blackwell Unbound (which became a separate game out of a flashback side-story). If you want something short but cool from the Freebird games, try their older The Mirror Lied which is completely free if you didn't already.",
            "review_score": "-1"
        },
        {
            "review_text": "The perfect coming of age story. I ugly sobbed.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, Once again an amazing work of art by Kan Gao. First of all I want to say how amazing this idea of a game was, the fact there are no words really makes the player think about the story and almost interpret what they believe is going on, making a more personal connection to the game. I really can't express my feelings about this game all at once but I will say that the music was amazing, the story was truely wonderful, and I can't wait to see more. For 5$ this game is worth it not only for an amazing story but as a lover of the classical music genre I would buy this game and the dlc just for the music alone and it would be well worth it. But adding an amazing story is what makes Kan's ideas so amazing and why I will always enjoy playing through his stories.  Thanks!",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "For a simple gamer who is looking for easy game for perfect achievement. this game is for you~!  this is another good game done with RPGMaker, well.. It's hard for me to give opinion for A Bird Story, because this game is full of metaphor. I tried not to correlate the behaviour of a bird in this game with the real bird, or how a child litterally lives by himself. I don't say if this game is bad, but it's just like spicy food (I like spicy food) if there is too much spicy things, it doesn't taste good, your tummy will hurt, well I think that's all I could say about this game without spoiling much detail.  I played To the moon before, and the game is much longer than A bird story. For an hour game, I think this game has a lot of things to tell and If it took longer than it, I honestly might dislike it. An hour is good, remove some scenes might even better. I hope people don't abuse with new steam refund policy because the whole game will take about an hour or less.  the music of this game is just like to the moon, it has 'vibe' of dramatic story-rich scenes. the graphic is OK, i think it's not possible to change the resolution .  well , that's all I could review about this game. if you like short game that focused on story that has metaphor I think this game is for you. A guy like me might not love it, well -- it's OK for me, i don't hate it but I couldn't love it. I enjoyed playing it, but not engaged to it. it lacks of something to make me curious enough of the characters -- lacking of personality I think.. I don't think this game is memorable to me, but I shouldn't compared it with To the Moon. That one is masterpiece and this one is more 'casual'",
            "review_score": "1"
        },
        {
            "review_text": "Though this is a fairly short game, you gain so much love for the character. It will leave you in a horrible inpatient wait for the second episode because you are wanting to know what kind of regret does he have to wish to relive his life again. There is more interactive bits and a lot of quirky bits which I really did enjoy. I found myself laughing at the most little things (like the exchange in the elevator).  Finishing this game, I want to say it's kinda like the movie short 'Paperman'-how it expresses so much through body language and music instead of words (and of course, paper planes!) and 'To the Moon' in a beautifully crafted 'game.'  Just as Kan have written countless times, play this game with no expectations. It is not like To The Moon but it still has that same feeling of warmth/adventure as you learn more of the main character through your travels. The music blends so well and beautifully, almost being the words to the muted characters.  Finishing thoughts: this is a wonderful bit to get you hyped for the second episode in this series. It leaves you with some questions as to why does he ultimately called the doctors. The journey is very enjoyable and I will definitely be looking forward to the next installment whenever that will be. (Hopefully soon-ish. ;w; )",
            "review_score": "1"
        },
        {
            "review_text": "Among games out there that try to shovel their story at you, A Birds Story, though short, delivers its own story in a way not widely explored. Although having no words may seem like a handicap, but when you play and see it for your self it truely isnt. The synergy of both the music, which is yet again amazing, and the story are clear and they fit together like pieces of a jigsaw. It may lack somewhat in a gameplay perspective but if you were expecting some extensive mechanics, you're looking in the wrong place.  If you loved To the Moon the definitly get this. If you haven't played To the Moon still get this! Then get To the Moon.",
            "review_score": "1"
        },
        {
            "review_text": "This game is short with not so much interactions, but the moment I saw the pictures of it i seen something inside that other games dont have it, and that thigs was me. When I was a kid i was bullyed allot and had no friends and I felt like everyone ment nothing to me, so like the character in the game the only friends I had were the animals, which I miss till this day.  10/10 - never spent my money so well",
            "review_score": "1"
        },
        {
            "review_text": "Quirky, quaint, but not quite matching the quality of To The Moon.Worth what I paid for, and a nice little title - but go play To The Moon instead.",
            "review_score": "-1"
        },
        {
            "review_text": "TL;DR; This game is ♥♥♥♥.  TS;DR; I guess i was expecting too much... Or in this case - i was expecting something. 'Something what?' you might say. I mean SOMETHING at all! Yes, it's a 1 hour long game, but that wasn't the problem. The music and the art style were good, so atleast we got that going on for the game. THE ACTUAL story was boring. When i knew this game was from the creator of To the Moon, i was like 'Man, can't wait to cry at this game too', but unlike To the Moon, i couldn't feel ANY connection or sympathy for the characters. Atleast they took their time to translate the whole game! (sorry for the sarcasm) All in all, i give it my personal 1/5. I have had better experiences looking at a single vine or a 9gag post than 'playing' this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Seriously, what the fxxk is this? what you want to say about by playing this game? there's just a kid and bird, so what? recommending this game never makes you emotional. just read another classical masterpieces. that would be more helpful than playing this.",
            "review_score": "-1"
        },
        {
            "review_text": "it's probably have a deep meaning and stuff but it's just not good game",
            "review_score": "-1"
        },
        {
            "review_text": "[ENG] The hype was real guys! I just finished it besides my wife and it is such a remarkable piece as is To The Moon. I felt really involved on the history, the questionings are so simple and yet so remarkably well done. Something like what we can play here is not really common on video games. Thank you Mr.Kan Gao (and everyone on Freebird Games) for bring to light such a beautiful game.  [PT-BR]  O Hype é real ferinhas! Acabei de terminar o jogo ao lado da minha esposa e ele é uma obra tão memorável quanto o To The Moon! Eu me senti realmente envolvido com a história, os questionamentos são simples e mesmo assim, extremamente bem executados. Algo como o que podemos jogar aqui não é comum nos vídeo games. Obrigado Sr. Kan Gao ( e todo mundo da Freebird Games ) por trazerem à luz um jogo tão bonito.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and touching story about a small boy on LSD.",
            "review_score": "1"
        },
        {
            "review_text": "The game is not sad like TtM was, you should not expect ABS to the same as TtM. ABS is very funny in some parts, and is very sweet. If you enjoyed TtM, you will likely love ABS.   ABS has a very beautiful atmosphere, the areas look and feel very dreamlike to play through and the music compliments the entire setup. The animataions and the graphics feel much more advanced than TtM's, although they are still have the same retro look, they are so nicely shaded and the ground is more often than not, seemly covered in fog.  The music of ABS is very soft (such as TtM's was), and it is very playful in some moments.   There is not speech in ABS, this is one reason the music is so important, but to replace the speech, are the occasional thought-bubbles-with-pictures-in-them to show what the characters are saying. This is a very nice method, and it helps to stop immersion breaking within the game.  The storyline of ABS is about as clouded as the screen is. You can make out a story, but with the added strangness of the game, it makes some parts of the story abstract and open to a bit of interpretation, but other than that, the story is quite clear and very heartwarming.",
            "review_score": "1"
        },
        {
            "review_text": "BEAUTIFUL GAME WITH AN AMAZING SOUNDTRACK!   About 1 hour gameplay Story 8/10 Music 9/10  lovely details 100000000000000000000/10",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful, heartwarming albeit short experience with beautiful music. I look forward to playing To the Moon after this.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would cry again. - IGN",
            "review_score": "1"
        },
        {
            "review_text": "Just to be clear, this is not a negative review, I simply cannot recommend it and there is no neutral option, so with that said...  A Bird Story is what I would define as the media's version of Darwin's missing link, a storytelling medium that is not a game, nor is it a film, and unfortunately as a result of this, the whole experience suffers.  Whilst playing I just couldn't enjoy having to walk from A-B for five short seconds only to trigger a cut scene that lasts for 5 minutes. It often left me tempted to stop playing and find a silent lets play on Youtube as I would easily rather have sat back and watched the narrative unfold naturally.  The story is a very charming and uplifting one, with many laughs along the way, all achieved without one word spoken throughout the entire game, a great accomplishment, but as a whole, it unfortunately isn't one that stayed with me for very long. I found the ending to be fairly predictable and despite the game being around 1 hour long, I did find at times certain sections dragged and outstayed their welcome.  All in all, despite its clunky controls, lack of any real game play (but let's be honest, you didn't come here for the game play) and slightly above average story, its an experience worth your time, just make someone else play it whilst you watch to get the most enjoyment out of it.",
            "review_score": "-1"
        },
        {
            "review_text": "better story than twilight!!  8/10 i would cry again..",
            "review_score": "1"
        },
        {
            "review_text": "  Cute, easy, and minimal gameplay that shows value of friendship.",
            "review_score": "1"
        },
        {
            "review_text": "These tears are real.",
            "review_score": "1"
        },
        {
            "review_text": "  Holy **** this game is weird, f***ing weird, but somehow it touched me, it touched right in the deepest parts... 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This was literally the most boring game I've ever played, if you even can call this a game since all you did was hold buttons to go to the next cutseen... And I wouldn't complain at all if the story was in any way, shape, or form interesting or compeling in the slightest. It's extremely slow paced and not at all catching.",
            "review_score": "-1"
        },
        {
            "review_text": "There's very little gameplay in this 'game'. You take 5 steps, press spacebar to interact with the obviously highlighted object, then lose control of your character and watch him do stuff for a minute. Eventually a pictogram of the arrow keys pops up to remind you to move your character 5 more steps and repeat the process. It's not a game, it's just a short, dull movie where you occasionally have to press a key to advance to the next scene.",
            "review_score": "-1"
        },
        {
            "review_text": "music's great",
            "review_score": "1"
        },
        {
            "review_text": "65 minutes gaming, 45 of them crying. The story is actually not that good but the way they present it to you is extremely touching and immersive. Just buy it now, probably you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "What a waste of time and money for this thing. This is a short film, not a game.   Çoluğunuz çocuğunuz, yeğeniniz falan varsa 2-3 yaşlarında alın yanınıza onunla oynayın. Yoksa benim gibi eşşek kadar adam olduysanız o parayla indirimde ne oyunlar alırdım derdine düşersiniz. To the moon gibi bir şaheserden sonra ters köşe yapmak bu olsa gerek.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring and pointless game. Not even close to the experience of To The Moon.",
            "review_score": "-1"
        },
        {
            "review_text": "4/10 pace is way too slow, and not enough buttons to press. Just too simple to entertain me, and I felt like a chore from the moment the game started. Maybe less annoying if I had controlled the character for more than 5 minutes of my 70-minute experience. The onscreen control prompts are also disruptive to the experience. At times I thought I could take control but ultimately could not, and the design of games like this should always make it apparent when you have control and when you do not by the dialogue (not present for good reasons) or some other indicator. I liked To The Moon, for the record, but this is just boring and uninspired pixel movie where you ocasionally hold right and press space bar. Buy it to support the To The Moon sequel if anything; that's what I did.",
            "review_score": "-1"
        },
        {
            "review_text": "It is not a game. It is movie - a pixel movie, sentimental boring pixel movie to be precise.",
            "review_score": "-1"
        },
        {
            "review_text": "The following is an opinion, so judge as you may.  It's not that I didn't like it, but I don't believe the game is worth as much money as they're asking for it. It is advertised as a short game, which it is. However, being a story-oriented gamer, there wasn't much in terms of content. They had some interesting abstract concepts, but a lot of the time they just came off as confusing. The story overall was somewhat cliched, but it was cute. For a summary...  Pros: -cute characters -short (if you're looking for that kind of thing) -didn't experience any glitches  Cons: -cliched plot -confusing concepts -short (if you ARE NOT looking for that kind of thing)  All in all, if you can get it on sale for less than a dollar, try it out if you want- but I would suggest simply looking up a gameplay to save yourself the time and money.",
            "review_score": "-1"
        },
        {
            "review_text": "A very solid 'meh'. I tend to enjoy story-centered and exploration-based games, but this one just never got my attention.   Most of the game drives itself, and you don't have to make any decisions. When you need to accomplish specific tasks, there are clear onscreen cues. I'm OK with all of this.  The game felt slow. It may have mostly been a problem of character movement speed, during both player-controlled and automated portions. There weren't any surprises to the plot. It's a predictable story and an unoriginal plot. Some graphic elements seemed well-done, but nothing struck me as exceptionally magical or impressive. (The 'nest quest' sequence was the most interesting part graphics-wise, I'd say.) I wouldn't be surprised if (nearly) all of the sprites were from a generic sprite pack.  Nothing was exceptionally wrong about this game, it just failed to impress. When this genre was new, this game may have been worth a try. Now that we have plenty of exploration/story games to choose from, I think this one can very safely be skipped at any price.  Since it's so short, though, it won't ruin your day if you pick it up for less than a dollar.  I imagine a lot of negative reviews will come from people who don't like what this game was striving to be. I  do  like what this game was trying to be, and I still can't quite recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "not a game, not even a story. really boring",
            "review_score": "-1"
        },
        {
            "review_text": "This is a fairly jolly (albeit at times confusing) experience. However, simply put: making and releasing a game in 2014 that only runs at 640x480 (no hyperbole!), yet asking money for it, ..... that is not okay. It just isn't.  If  EasyPeasyGameCreationTool 1991  hasn't been updated for use in the real world in a few decades, use something else!    P.S.: If you can get this for around $2, the price of admission for you and your friends/family is certainly well-invested, however be prepared to have it destroy your window placement, wreak havoc upon your desktop, and maybe even consider using the creepy Windows magnifier tool (press  Win  and  +  together) to make it bearable in windowed mode. At $5 you're overpaying. P.P.S.: Plus points for the devs' no-questions-asked refund policy, even though that is promoted in the context of this title more because fans of their previous game had wildly different expectations for this title (and not because of the insultingly antiquated engine employed). I don't belong to this group quite yet, hence can't speak about how it compares to that title. P.P.P.S.: If films (or video games) have a reasonable chance of bringing you to tears, you could even contemplate setting your budget for this to $3.   P.P.P.P.S.: There's the odd funny easter egg here, and certainly permissible creativity in scene transition has been employed in the game's design, but - and this is a big but - some core aspects of it just feel thrown in  because why not , like the moving-back-in-time storytelling approach, or his faceless clone, the slapstick chase(s), etc. Feel invited to point me at a developer-sanctioned full-spoiler explanation of 'what actually happens'.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Artifically lengthened walking simulator",
            "review_score": "-1"
        },
        {
            "review_text": "After playing to the moon, I impulse bought this purely because it was from the same minds. Boy was I sorry about that purchase.  This game's plot is BORING BORING BORING. dont waste your time or money on this game.",
            "review_score": "-1"
        },
        {
            "review_text": "They should've called it 'A Bland Story'.  Ha... ha... ha...  I've never been opposed to JRPG-stylized games, wherein you play with a top-down perspective on pixelated sprites, but it severely limits the amount of range and emotion many other 3D games can achieve- like Brothers, a game I fondly remember (primarily because I beat it a few hours ago).  A Bird Story is a story. About a child. And there's a bird in it. If you grew up watching kid's movies with an animal theme in them, I'm sure you can piece together the plot of A Bird Story.  Kid finds animal- adults try to take animal- kid loses animal- kid finds animal again.  It's as formulaic as it gets. And I wouldn't mind it as much, if there were some actual characters in this story. I don't mind characters without a voice (like the Naia and Naiee in Brothers), but all we know about the child is that he's a dreamer and likes birds. We know his mom loves him, but we never see her. We know little about his teacher and vet, except that they want to bird. To take care of it. Because it was injured.  Seriously, why would anyone sympathize with the kid, if he's preventing the bird from appropriate medical care? I don't often sympathize with children for this exact reason. They let their near-sightedness get in the way of something far more important going on.  And the way the child's imagination is handled is really strange and lazy. At first, it seems more like how he perceives the world, and how he dreams. But then he gets away from the vet by... dreaming up a giant paper airplane... and flying away...  Did I miss something?  A Bird Story can be enjoyed by somebody out there. Somebody who hasn't been exposed to the cliches of most animal movies for kids, and who doesn't mind bland characters, with some odd plot development. I'm giving this game a 3/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Not as great or tear jerking as To the Moon, but I'm not dissapointed with the game. I just didn't feel nearly as emotionally attached to the story. Still great storytelling even without the use of words. Music is still excelent as well. Unfortunately the game doesn't quite stand up to the expectations I had after To the Moon.",
            "review_score": "-1"
        },
        {
            "review_text": "It's ok, but I can't recommend it at this price. I feel like this should be a free teaser for the next story.",
            "review_score": "-1"
        },
        {
            "review_text": "Its worse than To the Moon. What else can i say? Decent music, decent pixel art, but... its just not To the Moon. I don't care about the bird, sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't play this 'game' when you are tired because it's very boring. It's easy to 100% but you will fall to sleep... The first game of Freebird (To the Moon) was much more better than this.  It's not a game, it's just a visual novel without game mechanics, but you can not call it 'story'. Don't buy it, it's not worth it. Definetly not recommended!",
            "review_score": "-1"
        },
        {
            "review_text": "A Bird Story is the second realease from publisher Free Bird Studios. It follows a story about a boy who one day on a walk home from school finds a hurt bird and decides to nurse it back to health. The game is short at only about an hour long but it is a very well written and beautiful story. It is not as tear jerking as To The Moon but it has the same great music that made To The Moon so special and easily remembered. All in all i would give this game an 8.5 out of 10 since it is beatifully crafted but it could have been a little longer.",
            "review_score": "1"
        },
        {
            "review_text": "I loved To The Moon with the witty humor and touching story. Unfortunately, this game lacked the witty humor and the story wasn't at the same scope of the predeccessor. However, it's a nice set up for what's to come so I'm still excited about the next game. So while not a bad game, I just can't recommend someone getting this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Just short enough to keep my interest (and I normally don't have the patience for this genre), this is a pretty unique gem that tells a touching story with a couple of well-placed video game references to boot. I appreciate what this guy did on his own. I still wouldn't pay any more than $2-3 for this considering the length, but definitely memorable.",
            "review_score": "1"
        },
        {
            "review_text": "A Bird Story is a sweet little game or rather story for that matter. If you like a small emotional story, than you can definitely pick this game up, if you're looking for a small interactive game (or any form of game for that matter) than this is not for you.  Everyone considering buying this game be warned that this is more like a story than a game, because the interaction possibilities are very limited for that matter, which isn't necessarily a bad thing. Unfortunately the interactions provided were simply so linear (you could not do any other thing except that single interaction at a given time) that they seemed more forced than anything.  The story itself was actually extremely cliché, but it was executed perfectly and did not leave any questions open.  The level design is the best thing about this game. It's not that the level design was something special or breath taking but how well it was designed to reflect the boys everyday life, especially the tunnel vision. Going from home to school and going home back again, after some time you don't even completely realize how you got to your destination.  The soundtrack also fitted perfectly into the game, not much to add there.  What I found to be extremely annoying though are those long pauses, moments where your screen goes blank and stays that way for a moment. If it would have happened once for every chapter it would have been ok, but there were moments where it happened quite often in series which was simply put quite irritating.  All in all, I enjoyed this short little story and can recommend A Bird Story if you're aware of its shortcomings and what this game is not.",
            "review_score": "1"
        },
        {
            "review_text": "I have to recommend the heck out of this game. It's an hour long, so it's easy to finish in a sitting. The thing is, this game is so beautiful, and it needs no dialogue to express its beauty. Through the amazing soundtrack, the beautiful pixel art, and the cute lovable story, this game is a joy to play. It's cheap too, so I'd highly recommend picking it up.",
            "review_score": "1"
        },
        {
            "review_text": "What a piece of art. I really enjoyed going through A Bird Story.  It was a bit too short though and too linear, left me thinking perhaps another format would have worked for this story. Then again, it seems like freebirdgames are going to make this into similar game like to the moon, in which this would be a part of.  I can think of more boring things to do for an hour than playing through A Bird Story. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This game is good. It is short, but not as good as To the Moon. it leaves you hanging.     9/10",
            "review_score": "1"
        },
        {
            "review_text": "A touching story with great music and art. Since there's no dialogue, you should pay attention to the details. If you're looking for gameplay and can't sit down for a couple of hours to just observe, give this one a skip. If you're willing to listen to the plot and have the time, then I'd recommend you checking this out.  Also, stop comparing it with 'To the Moon'.",
            "review_score": "1"
        },
        {
            "review_text": "It's experiences like this that remind me why I still pay attention to video games as a hobby.",
            "review_score": "1"
        },
        {
            "review_text": "Treat this more like an interactive movie rather than a standard game, that being said it is a beautiful experiance, silmpe, sweet and with a great surreal design that told a story with the world. The soundtrack is utterly amazing and one I made sure to pick up myself. The other thing that made me love this game all the more is that    the kid you play will be the character whos memories you will travel through and alter in the sequal for 'to the moon'   ",
            "review_score": "1"
        },
        {
            "review_text": "Tries entirely too hard to create some weird situation where you feel for a kid and a bird through their fever-dream adventures.  The only thing i felt was frustration at yet another fade-to-black or another stupid impossible situation that just made me confused, at best.  I would avoid this for its price. It is a hour and a halfs worth of nothing-much-at-all-really.  Did the bird die? Well, no. It didnt. So there was no tension at all.  Did any of the game happen? Well, no, since the ending shows that it was all a dream.   Is there any sort of hook for a sequel? Apparantly, becasue the game features a teaser at the end showing more... 'games'... coming 'one day'.  It wasnt fun, it wasnt interesting, it wasnt sad, it wasnt happy. It was another poorly animated RPG-maker interact-quest that doesnt even have dialouge.  Yet they managed to fit in a benny-hill reference.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is trying to do some touching things, but it doesn't get there.  Unfortunately, there's neither much gameplay nor much story to be found here. It's rather a dry, tedious exercise in tapping a few buttons. See the RockPaperShotgun review for a good summary of the problem.",
            "review_score": "-1"
        },
        {
            "review_text": "Really good lead into Finding Paradise. Haven't played To The Moon in awhile, but I can really tell how much improvement has been made from an artistic and technical standpoint. The way the world around you moves is pretty impressive. Great experience.",
            "review_score": "1"
        },
        {
            "review_text": "This is a wonderfully imagined and gloriously nostalgic coming of age tale that never overstays its welcome. Just a beautiful and moving story.",
            "review_score": "1"
        },
        {
            "review_text": "If you played the game and liked it, I highly recommended you to play 'To the Moon', it is much better and longer",
            "review_score": "1"
        },
        {
            "review_text": "Simply put, I got this game because i liked 'to the moon'.  I was dissapointed then, when the sparse but suitable gameplay of that game was replaced in this one with...absolutly nothing.  It could have made a very nice animated short, with the right artwork and characer animation to convey the sweetness it has within.  It is very short and available for a very low price so to see the story develop so it is not a mistake to purchase with that in mind however it really is just a digital short-story without any text.   Still, there was no quicktime events so it is at least a better game than some tripple A titles lately.",
            "review_score": "-1"
        },
        {
            "review_text": "To The Moon was heart-touching masterpiece. This? More of a short video than a game.  Interactions where I could actually do something were rare and worse, they were meaningless. Story is frankly leading nowhere. When I saw the ending, only thing that I could be perfectly be sure of was that this game was a prologue to an another game that will 'come out one day'  I really do hope 'Finding Paradise', the main story to ABS, does better than this. This wasn't even a joke.   ***I was careless and missed the description of devs. This is not 'To the moon 2,' fault was on me I guess.",
            "review_score": "-1"
        },
        {
            "review_text": "A Bird's Story was simple, yet elegent to the touch. I'm more of a type of gamer to interact with stuff more, but it was calming just watching and clickin' a few times at the game. It's that one game that relaxes you and makes you feel better. Would strongly recommend italong with To The Moon and it's upcoming game, Finding Paradise.  9.7 / 10",
            "review_score": "1"
        },
        {
            "review_text": "Beautifully written/composed/directed. Reminded me of the kind of animation you'd see in early Final Fantasy games. The no narrative was very refreshing and felt really engaging in the sense that it got you thinking what was being thought/felt. Truely emotional story of a boy and bird's friendship. It's not much of a game, but a well told story you can guide yourself through at your own pace. Takes a little over an hour to complete.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would cry again.",
            "review_score": "1"
        },
        {
            "review_text": "RM17 for a story &amp; a great OST, totally worth it",
            "review_score": "1"
        },
        {
            "review_text": "Unparalleled storytelling by one of the great independent game developers of today. An emotional rollercoaster achieved with no text is a fantastic accomplishment; throw in a stellar soundtrack and you have an inspired product. 10/10 - Can't wait for Finding Paradise!!",
            "review_score": "1"
        },
        {
            "review_text": "A short but lovely interactive story that bridges the gap between To The Moon and its sequel.",
            "review_score": "1"
        },
        {
            "review_text": "If you loved To The Moon, you'll love this.  If you love life and beauty, you'll have loved To The Moon, so you'll love this.",
            "review_score": "1"
        },
        {
            "review_text": "Although not as good and moving as To The Moon (I had the fair warning from Kan Gao's youtube video about that), it's still an enjoyable story. I would rate the music higher than the story itself, so I'm glad I purchased the soundtrack along with the game.  All in all, I would not explicitly tell people to buy this game, but considering it's very low price, playability on nearly any pc and its once again marvelous music, I can say I do not regret this purchase.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best hours I spend in my life. So good! So beautiful! So Soundtrack! Play it!",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant, moving story. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing music. Can't wait for the next game!",
            "review_score": "1"
        },
        {
            "review_text": "Very emotional interactive story about a bird and a boy",
            "review_score": "1"
        },
        {
            "review_text": "Not like a heavy story line like To the Moon, but its worth trying. :) If you like emotional stories, try this game out!",
            "review_score": "1"
        },
        {
            "review_text": "An experiment in storytelling; the plot devices used were more interesting to me than the plot itself.  Just don't expect a full on sequel to the heart-wrenching To the Moon. The narrative vignette of A Bird Story is vastly shorter and not so involved.",
            "review_score": "1"
        },
        {
            "review_text": "Quite good; not the same as To the Moon, but if you knew this going in.  Didn't have the same 'emotional impact' but it's a very sweet story, and would recommend to anybody with an hour tok ill. Great price too; especially to support a really good video game developer.",
            "review_score": "1"
        },
        {
            "review_text": "Brought tears to my eyes 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Another great game from Free Bird. Now, like 'To the moon' , you're pretty much just witnessing the story and eventually moving to another place or triggering the events with the arrows on the keyboard. The story is pretty simple in itself and it only lasts an hour, but you can feel every inch of emotion that goes through it, and you don't even need dialogues to get it. Kan R Gao and the whole team at Freebird games have proven, once again, that if you put effort and talent into your game, you can make a masterpiece even if you're just using RPG Maker. I recommand this game to any people out there who play video games to feel the emotions of a well told story.",
            "review_score": "1"
        },
        {
            "review_text": "This is just amazing..",
            "review_score": "1"
        },
        {
            "review_text": "CAN'T HANDLE ALL THIS FEELS",
            "review_score": "1"
        },
        {
            "review_text": "A Bird Story is a beautiful emotional game with a perfect story &lt;3  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a beautiful story about a lonely boy who befriends an injured bird. Beautiful game. Amazing soundtrack. Think this is the first time I just about tore up over a game. 10/10. Strongly recommend it for anyone who plays for story.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game. In a couple of words I would review this 'You don't always need words to tell something'. Interesting and emotional story about friendship between a boy and a bird. I enjoyed every single moment of playing.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful little follow-up to 'To the Moon', some cool little quirky mechanics and ambience elements to this game, short but sweet and sad.",
            "review_score": "1"
        },
        {
            "review_text": "relaxing/spacey visual game in which you take care of a bird and say ♥♥♥♥ the police!",
            "review_score": "1"
        },
        {
            "review_text": "Another amazing work from Freebird Games. I recommend that this interactive story be played in one sitting as there is no text or speech, aside from that it's quite a touching story about a young boy and his new found friend.",
            "review_score": "1"
        },
        {
            "review_text": "A very nice story about a boy and his bird.   Additionally, even though there was no text in this game, the creator was able to get his meaning across to us.",
            "review_score": "1"
        },
        {
            "review_text": "Oh wow... this was amazing... Really nailed the same emotional rollercoaster of To the Moon, but a little more subdued. The Soundtrack was easily the key thing here, it was incredible. Very short, I think maybe 1-2hours (I don't even know, I was that enthralled, it felt like 10 minutes!). The transitions and implied journey mechanisms were AMAZING. Really felt like you could understand everything that was going on, and knowing exactly what to do, really clever how they built this. I can barely wait for the next Freebird title.",
            "review_score": "1"
        },
        {
            "review_text": "I guess the music’s nice-ish, but it sounds kinda ripped off from To the Moon…",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game the whole way to the end. Just wish it was longer but that would just hinder the story, great game!",
            "review_score": "1"
        },
        {
            "review_text": "i like to the moon this game is low than to the moon but sound track is very good",
            "review_score": "1"
        },
        {
            "review_text": "Anyone remember that Pokemon episode with Butterfree?",
            "review_score": "1"
        },
        {
            "review_text": "It's not To the Moon But it's lovely and charming all the same.",
            "review_score": "1"
        },
        {
            "review_text": "I loved it! Its story, and its narration style!",
            "review_score": "1"
        },
        {
            "review_text": "This is not a game. It is a one hour interactive story with no dialog. The story is simple. The music is good. The pixel art is good. I would not pay more than $2 for this experience.",
            "review_score": "1"
        },
        {
            "review_text": "To be honest I was expecting a little more. But what the story provided I enjoyed and would recommend someone play it if they have a few dollars to spare.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful and senseble story that touch you just by observing and listening. Minimum interaction and maximum feeling. Just like you can place yourself directly in the story.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game I have played",
            "review_score": "1"
        },
        {
            "review_text": "If you are interrested in this game and are coming at it as a fan of Kan Gao's previous work (especially To The Moon), I will start off by saying that this was somehow much less impactful for me than that was. This is very short, 1.5 hours or so at most. That's not a knock imo, I just say that to point out that you can finish it very quick if you're on the fence. I wouldn't say it's a hard pass, but just don't expect the incredible storytelling found in To The Moon. This is really a quick tale about a boy finding a bird, then... well you can probably guess something sad happens, and there's amazing piano music overlayed just like in To The Moon. Yet somehow... this didn't even find my heart strings, nevermind actually tugging on them. It was interresting, just not the 'I want to go hug everyone I know now that the credits are rolling' experience that I was thinking it would be based on that other game that I have typed the title of too many times already in this review. Anyway, that is all.",
            "review_score": "1"
        },
        {
            "review_text": "A Bird Story will make you feel To the Moon level feels. Beautiful music, effective storytelling........it's a good thing.",
            "review_score": "1"
        },
        {
            "review_text": "What this game does not have: -Dialogue -Significant gameplay or challenge  What this game does have: -A short, charming narrative -A fantastic soundtrack  Can't really say this is a full-price-buy kind of game, it's an hour long and has no replayability, but as an experience I thought it was really nice.  I care immensely about this pixelated bird.",
            "review_score": "1"
        },
        {
            "review_text": "The game is short and completely linear. Story is good but kinda confusing in the beggining. It has a great and relaxing soundtrack, not better than To the moon's soundtrack though.  Do not worth buying at full price.",
            "review_score": "1"
        },
        {
            "review_text": "SImply beautiful. The story, the art and the music are all stunningly beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "This is very short and sweet. The animations are absolutely adorable.",
            "review_score": "1"
        },
        {
            "review_text": "Sadly, I waited this long to play it because I love To The Moon (TTM) and I was swayed by the fact that this had negative reviews when it came out. I thought 'Was TTM just a fluke? There is no way something could be that good again.' I put off buying and playing A Bird Story for fear of being let down. I couldn't have been more wrong. This game defys what people think a game needs to have and be to make an impact. No fluff, no wasted time, no silly or useless mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "While it looks a bit generic this game has some nice visual moments. The story is told wordlessly which actually had me confused about some things including a pretty important plot point. I am still not really sure what the conflict   with the vet   was about, and that might be because such a thing is hard to convey visually with small pixel art.  I really enjoyed the good moments of this game so I think it is worth playing. But even as short as it is it's linear style and tedious gameplay keep me from wanting to play it more than once.   Bonus points for adorable bird sprite.",
            "review_score": "1"
        },
        {
            "review_text": "I do NOT recommend this 'game', even when i enjoyed my 2 hours with this game. Why?   - story is really simple  - gameplay is boring, everything is so slow  - i think this animation would be better as some short movie, not a game. And even shorter, because you can tell the story of this game in 5-10 minutes. It is thanks to that gameplay, that you need to spend 1+ hour to finish the story.  - only one achievement (for finishing the game, as there is nothing else to do)  - you will pay 4,30€ for the 'game', with simple story, which has only one end, and it will take 1 hour to finish it. And there is no reason to play this game again. Soundtrack? Yes, maybe nice, but you can buy it for 2,50€, so it is cheaper than game, and you can replay it again and again. I just think that 5 euros for 1hour game with so simple story and no replayability, just NO.  When to buy this game? If it is on sale, then grab it, this 'game' and its story is worth 1€ (maybe 3€ with soundtrack). And if you are achievement hunter, this game is also perfect thanks to only one achievement, which is easy to get (just finish the 'game').",
            "review_score": "-1"
        },
        {
            "review_text": "A wonderful game that really shows the emotional impact you can make with just sprite characters. While I wouldn't see it as the best in the company's line-up, it certainly is an emotional story that brought a smile to my face. Not very challenging in any manner, but you don't play this sort of thing for the challenge.",
            "review_score": "1"
        },
        {
            "review_text": "A story about boy who doesn't like his notebook.",
            "review_score": "1"
        },
        {
            "review_text": "A bird story is a short game about a boy who finds a wounded bird in the woods an nurses it back to health. This game is very short and it has a few flaws, but it is overall a very good story. One of the things that stood out to me was the lack of text in this game. It is very obvious what yu have to do, but you won't find a written word. For achievement hunters this is a very good game, cause the only achievement is very easy to get.  Pro's:  + Great story + Very relaxing music + Very well put together for a RPGmaker game  Con's: - You can't TAB+ Schift to the steam menu - Sometimes it can be a bit unclear what to do - No Replay value  In all i recommend this game if you can pick it up in a sale. Not worth the full pricetag",
            "review_score": "1"
        },
        {
            "review_text": "Hmmmm... This is definitely not a game, not even an interactive story. It requires you to watch and feel, act - only in 15% of cases. Is it bad? Not at all. That is just the way it is supposed to. I am not going to say that this is a blast, it seemed to be just a bit too emotion oriented. Maybe, after completing Firewatch today, impressing me got harder. Never the less , if you have an opportunity to play this game and you are OK with the graphics, you will have fun for a great hour or so.",
            "review_score": "1"
        },
        {
            "review_text": "This is so beautiful. I love how it told an interesting and compelling story without any words or dialouge. The music and graphics are gorgeous. I loved every minute of it. Completely worth the money and time.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful little story. Amazing what can be done with the clever use of just a hand full of pixels and some sounds. Obviously a much smaller game than the amazing 'To the Moon', but on the same level of quality.",
            "review_score": "1"
        },
        {
            "review_text": "Another masterpiece, just like To The Moon, soundtrack is flawless and the story is simplistic yet amazing. Beautiful message behind the narrative tackling isolation and loneliness.",
            "review_score": "1"
        },
        {
            "review_text": "This is just too ♥♥♥♥ing sad, great game even if it is very short",
            "review_score": "1"
        },
        {
            "review_text": "love this",
            "review_score": "1"
        },
        {
            "review_text": "What a charming and poignant slice of storytelling! Absolutely worth sitting down for an hour to experience from start-to-finish.   Such a pleasant surprise to find that pixel-art graphics and zero dialog can result in so powerful a meditation on loneliness and loss.",
            "review_score": "1"
        },
        {
            "review_text": "I cried because I didn't cry. I spent a lovely hour though.",
            "review_score": "1"
        },
        {
            "review_text": "A strange but lovely game. Its lack of dialogue is a strength I feel and gives the whole story a wonderful quality. Well worth the short time it takes to experience this game.",
            "review_score": "1"
        },
        {
            "review_text": "A Bird Story is a simple yet touching narrative that plays out over the space of an hour and requires only cursory and largely irrelevent input from the player. It's basically little more than a short film which occasionally prompts you to walk across the screen or open a refridgerator. What it lacks in interactivity it makes up for in emotional content and a great soundtrack. Not my cup of tea but a decent diversion and well worth the hour.",
            "review_score": "1"
        },
        {
            "review_text": "Slowest, most boring kids story ever with no gameplay or interaction necessary at all. Like a visual kindergarten book. Not at all like To the Moon. An hour of just looking at the screen seeing nothing happening, having no influence on anything. just waiting, slowly, until you turn to dust from the boredom of the story. Not heartwarming, just predictable.   And if you play through it, remember it makes everything as a flashback in the end so you see it all twice! So dissappointed in the developers. Embarassing to charge money for.  I wanted to buy the sequel to To The Moon but after this? Forget about it.",
            "review_score": "-1"
        },
        {
            "review_text": "It's pretty much as the title describes. Would bird again.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting, but very short. May not appeal to those who have not yet played 'To The Moon' - best seen as a teaser for the next episode 'Finding Paradise'  Incredible range of emotions and storytelling in such a short time, with a limited amount of pixels.",
            "review_score": "1"
        },
        {
            "review_text": "A short, dialogueless story that's mostly told through a dream, allowing for more creative narration, it's a cute story that makes you care about that little bird with the broken wing, and takes you on an adventure on a giant paper airplane.",
            "review_score": "1"
        },
        {
            "review_text": "Simple and elegent game with sweet and relaxing story.",
            "review_score": "1"
        },
        {
            "review_text": "Such a great game! I have been waiting for this game for quite some time now, and was not disappointed. Great job Freebird Games!",
            "review_score": "1"
        },
        {
            "review_text": "We live in amazing times when five dollars can buy your way into such a touching experience. I cried at the end of the first season of TellTale's The Walking Dead, but I was expecting it. I came into A Bird Story based soley on my love of To The Moon. I came with some preconceptions of what I would find... but wiping my eyes now, I can say I really had no idea.  Charming? Yes. Empathic? Oh yes. Artistic and expressive, of course. But poignant? In a story with no dialogue and over almost as soon as it begins? ... So very, very yes.  Try it, and see for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Ah yes, to pull on one's heartstrings.  This isn't a game as much as it is a story.  I got this on sale, to help me with my own writing.  PS: I just slept with this game's music playing. Lovely. Just lovely.",
            "review_score": "1"
        },
        {
            "review_text": "Very cute story and very well written. Reminded me a bit of Alice Madness Returns with it shifts from the real world and his own world in his mind. The lack of any dialouge helped this game be even better. well worth the hour or so to sit down and see a true work of art.",
            "review_score": "1"
        },
        {
            "review_text": "It's just more than ONE HOUR~",
            "review_score": "1"
        },
        {
            "review_text": "If you liked, To the Moon, You'll like this game. PT to Sillent Hills as is Bird Story to (the next game FreeBirdGames is going to do which I just forgot the name of).  P.S. To friends wondering why I haven't written this sooner, I forgot.",
            "review_score": "1"
        },
        {
            "review_text": "Something different. A story without words. It's only about an hour, so I would only grab it when you see it on sale. I'm looking forward to more from this company.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic story about a lonely boy finding purpose in life by saving an injured bird. The score is beautiful and uplifting, and the story is emotionally gripping. This game doesn't really have much 'game' in it, but it doesn't need to. It does what it set out to do and it accomplishes it in spades. Note: The games story is told without words, and I don't just mean that there's no dialogue, I mean LITERALLY no words, not even writing, just symbols, drawings, music, and sounds.",
            "review_score": "1"
        },
        {
            "review_text": "All I could think while playing this game was: it is not as good as To the Moon.  I suppose I couldn't 'feel' the game. It is beautiful and has this wordless narrative that is quite filled with impressions. But it still didn't reach me.  But that's my problem, not the game's, so giving a thumbs up here for the narrative and the soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Don't expect much gameplay, but instead an adorable storyline. Coming from the makers of 'To the Moon' I expected a beautiful game and that's what I got :D",
            "review_score": "1"
        },
        {
            "review_text": "It's a slightly interactive story without any dialogue. If that doesn't sound like your thing, then pass on this. However, it is a cute story that made me somewhat nostalgic for my childhood. It is very short at about one hour, but it frequently goes on sale. I recommend this experience, but don't purchase it looking for a game because you won't find it here. Besides, you can't exactly go wrong with this purchase because 'As a guarantee with all games from Freebird, there is a 100% personal (confidential) refund policy with no questions asked; if it just isn't your cup of tea.'",
            "review_score": "1"
        },
        {
            "review_text": "A rollercoaster of emotions.  Very goo story told through cutscense and minimal gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, this game is beautiful. The music was great and the story behind it was very touching. Just like To The Moon, this game is a great example that every game doesn't need big up to date graphics and the craziest of gameplay. Instead, this game shows that gaming can be an experience through pure story. It is full of a multitude of emotions. This game doesn't run incredibly long and is best played through in one whole sitting.  Unfortunately. just like every game, there is a slight issue and I wont ignore it just because I am a fan of both A Bird Story and To The Moon. This game has NO TEXT (I know this was intentional). The only text you will see in this game is at the main menu and during the credits. Removing all of the things such as dialogue can make the story a little bit difficult to follow as you will have to refer to facial expressions and body language which can make it even more difficult when what you're refering to are pixels. The music itself does however, help ease this problem slightly as the tone and pace of the music indicates different things and sets moods.  All in all, this isn't a game but more of an experience. An experience which you should go through sitting comfortably with a headset/headphones and the lights off. I will say this however, I highly recommend checking out To The Moon first if you haven't already. There are sections of this game that may go over your head if you haven't played/seen it. If you have played/seen To The Moon then yes, pick up this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great! But know what you're getting into.  This isn't really a 'game', more an hour long animation sequence. There is no dialog, and almost no input. It’s almost like an independent animation movie, but done in a video game medium, and a lot of work was put into this, from the presentation, to the graphics, to the amazing soundtrack. I know $5 may seem like a lot for that, but I think it’s not too bad considering you usually pay more than $10 for a movie.",
            "review_score": "1"
        },
        {
            "review_text": "Pretentious ♥♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Consider this a visual novel with RPG Maker graphics more so than a game. Saw a couple people complaining about this, so just putting it on record.  Anyway, for a story with no written text, it does a really good job of communicating what's going on. It's easy to just blaze through everything to try and finish as quickly as possible, but try not to do that. Look around at the surroundings, there's quite a lot in them.",
            "review_score": "1"
        },
        {
            "review_text": "A short little interactive game revolving around a story that is pretty good. It won't tug at your heart-strings as much as 'To the Moon,' but will provide you with a good smile throughout the entirety of the hour. For the love of the bird, just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "I can only recommend this for a select type of person. That person must have a wistful personality, a personality where imagination is not dead.  This is another example of a visual novel with barebones interactivity. It has the same feel as 'To The Moon' (which this reviewer believes to be a far superior story), but it has a cute story, with pretty darn good music. The graphical style is 16-bit sprite/pixel art. Basically it's like watching a cute story on Super Nintendo with a nice soundtrack playing in the background.  Playtime (or runtime, really...) is basically right at an hour. It's good for a quick storytime break.  All in all, I would not call this a game. The bits of interactivity are actually rather pointless unless the point is to keep an uninterested person from falling asleep.  The TL;DR version: Good music, 16-bit graphics, visual novel, short runtime. Wouldn't pay more than 99 cents for it, but I didn't consider its purchase to be a mistake.",
            "review_score": "1"
        },
        {
            "review_text": "I can't recommend it because it's way too short. It's so short that I actually have to run it idle to get all the steam cards. Also, to me, the fantasy/magic (flying in a giant paper airplane? moving trees? the evil clone shuting the doors?) kinda screwed up the emotion of the game. I couldn't actually feel sad.  Altho it has some pros: Great art, great OST, decent storytelling.  It's also fun that the translators got their credits in a no-dialogue game. Their job was translating 'Begin/End' and the credits to their respective languages and ta-dam, you get your name in a pretty popular game.  I'm not refunding it, but I'm also not recommending it.  Edit: Forgot to mention: the game made me hype alot for Finding Paradise, though, since I really loved To the Moon",
            "review_score": "-1"
        },
        {
            "review_text": "From the developers behind 'To the Moon', a beautifully crafted story about delving through the life of a dying man, this story focuses less on the voices of the people. This time, it's about a child's imagination, and how it twists the world around them. An incredible follow-up to 'To the Moon', with the same RPG style sprites and animations, this game, for me, was nearly as touching an experience, however short it was.  This is where it gets interesting. Some spoilers for the reveal at the end of the game, but no story spoilers.     When you finish the game, after the entire story has played out, you are greeted with the timeline bar from 'To the Moon', which shows each stage in the life of the person whose wish the company in 'To the Moon' have to fulfil. But, to my absolute amazement and happiness, the boy from 'A Bird Story' was depicted on that chart. The sequel, Finding Paradise, may be about the boy from this game. Whom I adore.     The gameplay is similar to previous works by FreeBird, with a couple of extra events here and there. Ultimately a touching and fulfilling story, this game is worth buying as it does not focus on the characters' physical voice and speech, but the emotion they convey through actions and imagination. An interesting take on a child's perception of the world.",
            "review_score": "1"
        },
        {
            "review_text": "I cried at LEAST seven times during this game.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine this game without the lovely piano music.  - a boy only seeing shadows instead of human beings. - without parents. - seeing walking trees. - kidnapping a wounded bird. - having flashbacks. - in a never ending nightmare.  It would be scary as fu(k.",
            "review_score": "1"
        },
        {
            "review_text": "A Bird Story is honestly more of an interactive movie than a game. And it's short, less than an hour and a half to get through it. That being said, it's very nice. It a simple and dialougless story about a boy and a bird. I personally went in with very high expectations because of how wonderful To the Moon is and wasn't disappointed at all.",
            "review_score": "1"
        },
        {
            "review_text": " This game is worth playing and worth completing (getting all achievements).",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful story and soundtrack - once again!",
            "review_score": "1"
        },
        {
            "review_text": "This game demonstrates perfectly that video games can be art. Impressive story, the interactions as they are given explore and expand the story. It is not just some arbitrary character's choices being made, I am driven to these choices by a world that must be.  Surreal in the best ways, everything advances the narrative, and at the end, right before the credits, I was in tears. I'm in tears just writing this review right now.  This is truly some of the best value I have ever spent my money on.",
            "review_score": "1"
        },
        {
            "review_text": "Not quite as emotionally impactful as To the Moon, but still a great title. With no words, the developer conveyed to me a lot of emotion and intrigue, even if I didn't know what was going on for some parts of it.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game almost half a year ago, but never reached it's end. Now, I have, and I can properly write this.  A Bird Story, prequel to the popular To The Moon, a beautiful tale of friendship, grief, and coming of age, all achieved witouth a single line of dialogue, and only using something as old as RPGMaker. The tale of a lonely child, disconnected from the rest of the world, and how he rescued a little bird, with a dream of flying. Thing here are not literal or realistic, it follows a oniric feel.  Everyone who had to let go something or someone in their lives will feel attachment to this story. You don't need to have played To The Moon to understand anything. And be wary: Gameplay here is not the focus, nor is extensive. Kan Gao could even get rid off all bits of gameplay, and it would not harm the story a bit, it would be more immersive even. Play this for the feels.  +Excelent story +Manages to convey it's message without a single line of dialogue +Outstanding OST, very To The Moon like.  -The game would be better without gameplay at all. -No settings for resolutions and volume, wich sometimes are really needed. ----------The next game is still not released. We want Finding Paradise!  Overall: 8/10, would recommed anytime, unless you dislike heavy story little gameplay games.",
            "review_score": "1"
        },
        {
            "review_text": "NOTE: Knowing precisely what you're getting into with this game especially if you've just finished 'To the Moon' can drastically impact your opinion of the game.   For what it was, I enjoyed 'A Bird Story'. It isn't a sequel to 'To the Moon' yet it is somewhat related. Much like Freebird Games' previous title, the 'A Bird Story' is a very artistc approach that differs in its offering in comparison to many within the industry. The interactive portion of the game is quite minimal, though this title was attempting to tell a small and emotionally evoking story without exposition. In many ways I feel as though it succeeded.  + Fantastic soundtrack + Charming premise + Innovative storytelling - Minimal interactivity   Fact of the matter is, if you've come here for an experience on par with 'To the Moon', look elsewhere. However, if you'd like to take a short ride and experience a charming tale of a boy, his bird, and dreams then I think it's worth the price of admission.",
            "review_score": "1"
        },
        {
            "review_text": "This game... This game is amazing It's just a short story mind you (1 hour max) but it's worth it, worth the price in full AND the beautiful soundtrack. i, have few words to say about the game, its just amazingly well done for a pixel/rpgmaker style game, and blows expectations, it knows how to tell a story, it made me cry, and it's funny sometimes, it is not what one would expect, it did every thing right and now i'm repeating myself because there is no more room for critisism here, this game is a 10/10 and i can't wait to make a Fanart for it!",
            "review_score": "1"
        },
        {
            "review_text": "Sound track is amazing! More of a movie than a game. The controls are kind of clunky using a XBOX 360 pad. Great story, could do with being more interactive though.",
            "review_score": "1"
        },
        {
            "review_text": "  This sort of 'game' is the exact reason I wish steam had a thumbside neutral option for reviews.  First, let me make it clear that this isn't a game. I actually feel 'visual novel' is the most accurate title - and it is literally VISUAL. There is no dialogue, which is actually a plus. The story is told through interaction, dream-like sequences, and visual metaphor. There are no choices for the player to make, absolutely nothing you can do to alter the story in any way. It is completely linear.  During the paper aeroplane sequence, some very important instruction was missing and I ended up flying around for a full twenty minutes before lucking into what I was supposed to do. Those twenty minutes felt a lot longer.  The music is pleasant, the story is a little cliché but charming nontheless, and the art is pretty. Yet I struggle to recommend this. The description is up-front about it only lasting an hour, and I emphasise that it is completely linear. If you think the screenshots look good and just want to enjoy being shown a short story in which you occasionally have to press a button, A Bird Story might be for you.  Just...buy it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Really moving game. I didn't understand everything but loved the visuals and game mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Good story but zero gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "This game reminds me of my cat :(",
            "review_score": "1"
        },
        {
            "review_text": "It's a very touching and inspiring story.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 The game is beautiful  for 3,99 it is a good game i love it  (sorry for me english language :D ) ",
            "review_score": "1"
        },
        {
            "review_text": "This game thawed my icy grinch heart.    Also +1 for off-brand Benny Hill Theme",
            "review_score": "1"
        },
        {
            "review_text": "It was a great experience, i love the game, i'm deeply thankful. The music and the story is very touching",
            "review_score": "1"
        },
        {
            "review_text": "A touching little story and an excellent soundtrack from the team behind one of the better RPG Maker games in recent history,  To the Moon . Short but very sweet, and very much worth the price of admission (and the soundtrack).",
            "review_score": "1"
        },
        {
            "review_text": "A great short story game about a bird and a child.",
            "review_score": "1"
        },
        {
            "review_text": "  this game is very good and interesting",
            "review_score": "1"
        },
        {
            "review_text": "Where's a BibleThump when you need one? ∞/10",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games I have ever played, without a single word of dialogue the game perfectly captures a multitude of emotions. I'm willing to admit that I teared up a few times during this short but absolutely uplifting tale. A definite recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "I played to The Moon a year ago and only recently have recovered from the emotional roller coaster that was presented. With all intents and purposes, I purchased this game as I thoroughly enjoyed enjoyed the publishers other game. I went into the game with a clear head. 'Ok' I thought. 'I won't be sad with this one. It's about an Owl!'. Needless to say, I'm now a professional Sous Chef whose sole duty is cutting onions in the kitchen. Damn you, Freebird Games.",
            "review_score": "1"
        },
        {
            "review_text": "This is not really a game. This is a story, with a little bit of gameplay here and there to get you to do something, in the graphical style of 80's JRPGs.  The story has no words or text, but the stoy is told through piano music and pixel animation.  This is a very cute story which is told with a lot of visual poetry.  This is not for everyone and it is short (about one hour), but I am glad I played it.",
            "review_score": "1"
        },
        {
            "review_text": "Another amazing Freebird Games game. You get attached to the characters easily even though the story is about an hour long. Can't wait till the sequal Finding Paradise comes out. A must buy as well as To The Moon :)",
            "review_score": "1"
        }
    ]
}