{
    "app_id": 327560,
    "name": "Near Death",
    "release_date": "2016-08-02",
    "developer": [
        "Orthogonal Games"
    ],
    "publisher": [
        "Orthogonal Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Survival",
        "Indie"
    ],
    "achievements": 18,
    "positive_ratings": 555,
    "negative_ratings": 54,
    "price": 10.99,
    "description": "Stranded at an abandoned Antarctic research base with no hope of rescue, you must battle a deadly blizzard in a desperate fight to find your way home.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/327560/header.jpg?t=1491230918",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 (64-bit OS required) Processor: Intel Core i5 2.00 GHz or AMD equivalent (64-bit processor required) Memory: 4 GB RAM Graphics: Nvidia GeForce GTX 650 with 1GB memory (or AMD equivalent) Storage: 1 GB available space",
    "recommended_requirements": "Requires a 64-bit processor and operating system",
    "reviews": [
        {
            "review_text": "The good:  1. The game is a well-designed maze (instead of a sandbox that is dominating the survival genre right now) which means you can left no stone unturned and feel good about it.  2. The game has a plot; it is nothing out of the ordinary but it is just interesting enough to keep you going and already more than many early access games could ever dream of (looking at you, The Long Dark).  3. The game has a replay value (though you would probably never play it more than five hours).  4. Good performance &amp; minimum requirement: I was running this game 720P on an Intel i7-6500U and its on-board HD520 graphics card yet the game was still playable.  The bad:  1. The price tag is a bit aggressive; $9.99 would be a fair price and give the game more attention.  My Conclusion:  Near Death is the exact kind of game I was looking for: a short survival maze that is driven by a plot not mindless resource gathering.",
            "review_score": "1"
        },
        {
            "review_text": "Short but very, very sweet. You're always one careless mistake from death. It is fairly linear in that if you are off exploring instead of following your objective you will probably die. But, Antarctica is so hostile it might as well be another planet or outer space. If the astronauts on Apollo 13 hadn't listened to the engineers on the ground trying to save them, they'd have died. The same is true here. You'll definitely have your hands full just trying to do what you're supposed to, anyway. $15 is a bit of a hard sell for what took me around 2.5 hours to run through once, but if you see this on sale it's a no-brainer.",
            "review_score": "1"
        },
        {
            "review_text": "The game is interesting in that you really feel like it's a constant battle with the cold and resources. Survival is hard and brutal and the place you're at doesn't care for your existance. The game does a good job with visuals and audio.  My problem with the game is length and lack of real replayability. For $15, I feel like that's a bit high of a price for this game. Further, the game doesn't seem to like you going places out of order. I went to the radio station after I got the blowtorch to attempt to get more resources since I was desperate for duck tape in order to make more lights/rope for my eventual trip to the heavily disconnected science area. After reaching the top and seeing a switch I couldn't use and taking the gondola ride down, I thought I wouldn't have to make that slightly harrowing journey across the rope again. Apparently the Gondola ride is one way. And when the game decided to give me a great view and see all the little blinking lights int he valley, I was concentrating on not falling off the gondola ropes so that I could make it back down and not die.   TLDR: if you do not have a problem with the price, I would recommend this game for you but don't expect it to be lengthy or to have any real replayability.",
            "review_score": "-1"
        },
        {
            "review_text": "What a great game. Beat it in one sitting and the whole time I was on the edge of my seat. The game flows brilliantly and has a great anecdotal sense about it that is supported by a narrative that is what it needs to be. A great voice that hints towards your hidden stats along with dizzying visuals when your status is critical. A beautiful and desolate soundtrack that doesnt detract from the atmospheric gameplay. Tough decisions need to be made fast in this ravaging survival game, it is easy to get turned around when you first start playing. I appreciate that Near Death was not a sandbox game which allowed it to explicitly drive the player forward. It was indeed short but in an age where a new survival sim comes out almost every other week I am was pleased. I played on normal which I kind of regret as once you near the middle point a lot of your gear isn't 100% required once you have your bearings. For hardcore survival fans I would recommend at least Hard difficulty (and maybe pop your brightness down a few extra clicks).  Overall I was satisfyed with the experience and the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "*start game max difficulty *30 minutes of gameplay in on death 17, starting to consider changing difficulty *2 hour in, smooth sailing *5 hours in, relized I couldn't win due to earlier bad choices *took a moment to set fire to an icecub out of spite *reloaded earlier save *1 hour of no fuel leap frog *finally get what I'm after *Devs made a choice..... ####### you devs!!!! You know what you did. Well played, nice touch. :)  I really liked the game. However, unless you really love a difficult game that is more akin to using your head to break a concrete wall, don't choose the highest difficulty setting. I enjoyed it, but I wanted a challenge. Worth the money IMO. I've not tried a second play through, but it doesn't strike me as a game that will have a replay value.  Overall: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "As someone who loves games like The Long Dark and snow in general, this game was a pleasant suprise. I picked it up for a few euros in the Autumn sale, expecting mediocre gameplay. I am happy to say that I was wrong. While quite short, this was definitely worth the time and money I invested into it.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, all the suspensful and stressful momements were all created by my own hand. There's only one scripted surprise moment and the rest of the game is just you facing the elements. Likle other reviews have mentioned it is a short experience, maybe 2-3 hours in one sitting, but it's a very engaging few hours.",
            "review_score": "1"
        },
        {
            "review_text": "One word, thrilling. If you like titles like The Long Dark, and don't mind that it's a single self contained story rather than an open ended experience, grab this game immediately. Full marks from me.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game playing through it in 2 sittings (darn work). The antarctic base feels authentic, run down but still offering some shelter from the relentless weather.  The weather is your enemy every journey outside is taken with steeling yourself first and planning your route. As the weather worsens it gets trickier and trickier and that moment when you lose your bearings in a blizzard and stumble in the wrong direction really gets the tension rising. The game also convey the sense of isolation partly because there is just enough evidence of the former inhabitants to really reinforce this and due to some clever decisions on communications. Overall much like in a story like the Martian it is being in a terrible, life threatening situation and trying to survive. It's not the longest game but it is a fantastic experience and one I would greatly recommend, especially if you are a fan of games like Dear Esther, Firewatch and to some extend Soma.",
            "review_score": "1"
        },
        {
            "review_text": "In a short Let's play I've started, I found the short amount of gameplay I've had to be a great time! I understand how some people have gotten use to the idea of a meter for everything. Health, warmth, fuel, water, food, etc. But if you give thought to the idea of guages being stuck due to the tempature and the fact that it does prompt you to refill or reload, This game play is great! I love the Idea of the story and the way the it's written. It seems like a simple enough concept. But the weather has other ideas. Stay warm or die trying! If you play the game that you bought and not the game you wanted to buy, you will enjoy this game! Also I have to agree with JD Hero, this game does seem very much like the game play style of The Long Dark. But that being said, I still would buy this game again.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed this game, great atmopshere. Just moving objects in the wind was the anoying part, but rather then that would reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a short and sweet, atmospheric tension and relief roller coaster. When your outdoors your scared, worried, and riding a knifes edge, between getting where you want to go, and getting lost and freezing to death. When your indoors, it's a panic to seal the room and make it warm, or it's a heavenly blissfull suprise to find a room that's already warm....  I don't know how to explain how good it feels to find a warm room. Something so simple as that, which so many games try and fail to do, this game masters.  - Runs great on linux. 21:9 support... even though it's not in settings.",
            "review_score": "1"
        }
    ]
}