{
    "app_id": 327650,
    "name": "May’s Mysteries: The Secret of Dragonville",
    "release_date": "2014-10-15",
    "developer": [
        "V5 Play"
    ],
    "publisher": [
        "Studio V5"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 24,
    "negative_ratings": 32,
    "price": 6.99,
    "description": "Mays Mysteries The Secret Of Dragonville is an exciting puzzle adventure. Follow May, an intelligent and charismatic girl, in her quest to find her missing brother. Advance through the adventure by solving over 270 logic puzzles, tricky rhythmic games and hand drawn hidden object scenes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/327650/header.jpg?t=1476971001",
    "minimum_requirements": "OS: Win XP / Win 7 / Win 8 Processor: 1.5 GHz Memory: 512 MB RAM Graphics: OpenGL compatible Storage: 500 MB available space Sound Card: DirectX compatible.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The game is locked at a non-standard resolution, cannot go windowed mode, and the devs have not responded to anyone's issues on the forum. This game will be unplayable on some people's machines due to this. Be careful when purchasing.  Edit: Testing the game again on a newer computer. Still a non-standard resolution that some computers will have trouble displaying, but it actually does go windowed mode on this machine (the option was greyed out on the original comptuer). Still no word from devs on the forums, so caution is still recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has one mayor problem: no resolution options. This results in some puzzles being harder to do (like finding hidden objects) but it doesn't make the game unplayable.  Due to this technical problem this might not be a recommendationa at full price.   However, the game itself is pretty decent. The gameplay is good, puzzles are varied and there are plenty of them. The story is surprisingly reasonable and ties in nicely with puzzle solving. Characters you meet are colorful and well drawn, same as the locations.  Overall the game is decent, even with the resolution problem. I had a lot of fun with it but I did get it at a discount so I would definitely recommend it at a lower price point.  At full price it is up to you to decide if you want to get this game",
            "review_score": "1"
        },
        {
            "review_text": "The secret is: there are dragons there.",
            "review_score": "1"
        },
        {
            "review_text": "i did spend my time with it and i quess it was satisfying and fun but there is a lot of downsides aswell as some good things about this game. im not gonna go in debt but if you like a puzzle game i quess this is a potential buy for you. its a bit like buying a puzzle book so if you like those i quess this is something for you.   No achievement :(",
            "review_score": "-1"
        },
        {
            "review_text": "I found this game to be pretty terrible. The controls didn't work properly and made it impossible for me to finish some of the puzzles.",
            "review_score": "-1"
        }
    ]
}