{
    "app_id": 327910,
    "name": "7th Legion",
    "release_date": "2014-10-23",
    "developer": [
        "Epic MegaGames",
        "Vision Software"
    ],
    "publisher": [
        "Retroism",
        "Nightdive Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 35,
    "negative_ratings": 26,
    "price": 4.99,
    "description": "There's no Salvation from this army! Can you survive this furiously fast, kill-for-money, real-time blood-fest?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/327910/header.jpg?t=1466811939",
    "minimum_requirements": "OS: Windows XP / Vista / 7 Processor: 1.0 GHz Processor Memory: 512 MB RAM Graphics: 100% DirectX compatible graphics Storage: 500 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "recommended_requirements": "OS: Windows 7 Processor: 1.5 GHz Processor Memory: 1 GB RAM Graphics: 100% DirectX compatible graphics Storage: 500 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "It took some work to get it working for myself on windows 8.1, so be prepared to possibly have to tinker. The reward can be worth it however. Paying full price may be a bit much, but dont hesitate if you see it in a humble bundle of some sort.",
            "review_score": "1"
        },
        {
            "review_text": "Game doesnt work.....why is it on steam? Because of the money grab. Don't buy this game until the new publisher releases a fix (which will probably never happen)  It has a cool intro and soundtrack though.",
            "review_score": "-1"
        },
        {
            "review_text": " This game is similar to the original Command &amp; Conquer games, but more confusing and harder to grasp as it doesn't explain what certain units and buildings do in-game or what the controls are. The storyline is interesting but I would just stick with C&amp;C.  3/10",
            "review_score": "-1"
        }
    ]
}