{
    "app_id": 328470,
    "name": "Slave Zero",
    "release_date": "2014-10-23",
    "developer": [
        "Accolade, Inc."
    ],
    "publisher": [
        "Retroism",
        "Nightdive Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Cyberpunk",
        "Action",
        "Mechs"
    ],
    "achievements": 0,
    "positive_ratings": 118,
    "negative_ratings": 15,
    "price": 4.99,
    "description": "It's 500 years in the future. Man and machine are virtually on and the greatest megacity in the world is locked in a brutal war. You are the ultimate saboteur and part of an elite fighting force. Your mission: steal the largest, most sophisticated bio-mechanical attack weapon ever designed ...and kick some serious ass!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/328470/header.jpg?t=1468248928",
    "minimum_requirements": "OS: Windows XP / Vista / 7 Processor: 1.0 GHz Processor Memory: 512 MB RAM Graphics: 100% DirectX \\ nGlide compatible graphics DirectX: Version 8.0 Sound Card: 100% DirectX compatible card or onboard sound",
    "recommended_requirements": "OS: Windows 7 Processor: 1.8 GHz Processor Memory: 1 GB RAM Graphics: 100% DirectX \\ nGlide compatible graphics DirectX: Version 8.0 Sound Card: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "I remember when I first got this game some 14 years ago, I went into it blind and loved every moment of it. I still do. When I saw it on steam, I had to get it.  It's amusing looking at reviews from back in the day that were generally unfair to the game.  The game's essentially a run-and-gun game in 3D with cutscenes thrown in, and it lives up that description. Essentially you point your gun at things that shoot at you and hold down the mouse button while running towards the end of the game. It's more about taking part in the journey of getting through the game and enjoying the scenery than it is putting your skills to the test, and the game somehow still looks okay to this day. I think reviewers 15 years ago were expecting Slave Zero to be a different game than what it is -- but what it is is perfectly fine from my point of view.  Well, if you like run and gun games, and you want to see how they were done around the year 2000, Slave Zero is a nice experience. It's also short enough to get through in one afternon.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game filled with nostalgia and quite epic. We don't see much Mecha games nowadays. You feel really powerful as a giant robot walking into a futuristic maze-like city, playing your role as an anti-hero who fights the powerful tyranny of SovKhan while grabbing cars and even people, to throw them at walls or other robots. There's no pause, it's all action.  Recommending this game in these days is hard, not many people will have the will to disregard such old graphics and play it for the pure fun. But people like me, who had or still have the game CD (yes, in that magazine) will have no doubt to jump right in and own a copy. Having your old games in the cloud and updated to run on modern OS is really convenient, definitely worth the price.  And the game as a concept, I find this have a lot of potential for a remake.",
            "review_score": "1"
        },
        {
            "review_text": "This game was a large part of my childhood and i had nothing but fond memories of it. I was estatic when i saw that steam added it to the store and when i played it all those childhood memories came flooding back. If you never played it before, i highly reccomend you atleast try it.",
            "review_score": "1"
        },
        {
            "review_text": "My first ever Mecha game. The memories...  Even now it's still worth the price. ",
            "review_score": "1"
        },
        {
            "review_text": "I wish these guys would make an Evangelion game.",
            "review_score": "1"
        },
        {
            "review_text": "Classic.",
            "review_score": "1"
        },
        {
            "review_text": "The game for itself is good... the old school shot whatever moves with some bosses   unfortunately the game crashes often which usually happens when you attack some of those robots that look like you in later stages of game or due to some bigger explosions also the crosshair is kinda annoying you have to aim a bit lower and to the right in order to target the enemy   if you have some feelings for the game like i did (loved it as kid) just wait for some sale but for the rest i really cant recommend it",
            "review_score": "-1"
        }
    ]
}