{
    "app_id": 328460,
    "name": "Redline",
    "release_date": "2014-10-23",
    "developer": [
        "Accolade, Inc."
    ],
    "publisher": [
        "Retroism",
        "Nightdive Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Racing"
    ],
    "tags": [
        "Action",
        "Racing",
        "FPS"
    ],
    "achievements": 0,
    "positive_ratings": 49,
    "negative_ratings": 24,
    "price": 4.99,
    "description": "It's 2066 and the world is a different place. While the privileged insiders live in fertile domed cities, the rest of us fight for survival in the wastelands. Rival gangs battle for supremacy, turf control and valuable resources. In order for a young man to succeed he must make the right choices about his future.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/328460/header.jpg?t=1468248580",
    "minimum_requirements": "OS: Windows XP / Vista / 7 Processor: 1.0 GHz Processor Memory: 512 MB RAM Graphics: 100% DirectX compatible graphics (This product may not function Intel HD Graphics Chips) DirectX: Version 6.0 Storage: 600 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "recommended_requirements": "OS: Windows 7 Processor: 1.8 GHz Processor Memory: 1 GB RAM Graphics: 100% DirectX compatible graphics (This product may not function Intel HD Graphics Chips) DirectX: Version 6.0 Storage: 600 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "Amazing game! A true example of the 1999 era of FPS.",
            "review_score": "1"
        },
        {
            "review_text": "Redline is a unique combat driving/fps hybrid. Both the fps and the combat driving elements control great and feel good. But I strongly recommend remapping the controls. The first 9 levels (out of 12) are well designed and the combat works well. The gameplay in these levels are well paced with proper incrementing difficulty. But the last three levels of the game are very glitchy and overly difficult (which is not retroism or night dive's fault). I spent a few hours trying to finish the last three levels due to saving and door glitches, as well as the overly difficult level Area 51 (the part with the aliens). The first nine levels alone are worth playing and worth the money. I would welcome a reboot. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "ARGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGHHHHH! Painfully annoying the game doesn't work on most computers. When I did get it to work setting up the controls is buggy as a VW Beetle that has been adapted into a dune buggy, filled with large insects that have been eating small insects! Avoid!",
            "review_score": "-1"
        },
        {
            "review_text": "Old cool bug game",
            "review_score": "1"
        }
    ]
}