{
    "app_id": 328500,
    "name": "Potatoman Seeks the Troof",
    "release_date": "2014-12-03",
    "developer": [
        "Pixeljam"
    ],
    "publisher": [
        "Pixeljam"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Platformer",
        "Pixel Graphics"
    ],
    "achievements": 2,
    "positive_ratings": 398,
    "negative_ratings": 142,
    "price": 2.79,
    "description": "Potatoman will put your reflexes and worldview to the test as you journey through scorching deserts, dark forests, busy cities, the tallest mountains and eventually your own potato-consciousness in search of the ultimate answer. Are you prepared to face the TROOF?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/328500/header.jpg?t=1450301981",
    "minimum_requirements": "OS: Windows XP Processor: 1 Ghz CPU Memory: 1 GB RAM Storage: 50 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Potatoman Seeks the Troof is a short, evil but enjoyable platform. Probably you'll not find any truth at the end of the road, but you'll have a pretty nice (and frustrating 90% chance) experience.",
            "review_score": "1"
        },
        {
            "review_text": "its a simple side scroller insta death game. Nothing amazing here.",
            "review_score": "-1"
        },
        {
            "review_text": "- Nice This Game! :D - 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "   Frustrating, not fun",
            "review_score": "-1"
        },
        {
            "review_text": "This is a very short, and random platformer. Like seriously, less than 30 minutes. I got it in a bundle, so it was worth checking out since I already had it. But I'm not sure I'd spend any cash on it alone.",
            "review_score": "-1"
        },
        {
            "review_text": "I really like this game. It is very short (10 minutes). Extremely basic (left, right, jump) platformer. Of a potatoman seeking the meaning of life.",
            "review_score": "1"
        },
        {
            "review_text": "There are games that are enjoyable to beat.  This is not of them.",
            "review_score": "-1"
        },
        {
            "review_text": "Go forth. Seek the Troof. Find the Troof within you. Become one with your inner potato.  You are the Potatoman. The Troof is out there.  (In all seriousness: a difficult, fun, and insightful platformer. Get it on sale if you must, but do play it.)",
            "review_score": "1"
        },
        {
            "review_text": "No ability to save",
            "review_score": "-1"
        },
        {
            "review_text": "I feel that after playing Potatoman Seeks the Troof, my life has been changed. I feel that this game shows a deep study of the human mind and how life is a long andventure that ends in a new generation being born. In conclusion, Potatoman Seeks the Troof is a deep, rich game with amazing gameplay. Great game for aspiring psychologists.",
            "review_score": "1"
        },
        {
            "review_text": "Decent for what it is I guess, and priced fairly to boot. I didn't care for it too much when speaking from personal taste, but there's nothing actively bad about it.",
            "review_score": "1"
        },
        {
            "review_text": "The game does not work. When I open the game I get the message: '' Uh Oh! Your Graphics Card does not like our game. Please try updating your drivers 'but the drivers are up to date and the game still does not work.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is challenging but it lacks any depth or complexity. I lost interest quickly.",
            "review_score": "-1"
        },
        {
            "review_text": "Solid game. Not long, but on sale it's worth the $1.  Enjoyable for what it's worth :^)",
            "review_score": "1"
        },
        {
            "review_text": "Not sure how much simpler things can get and still remain entertaining, but if the mobile market is any indication of this, then there is still a LOT of creativity left to play around with using the bare minimums of entertainment. Sometimes all you need is a stick, a ball, and an endless road.    Gameplay: 82/100 B- Potatoman Seeks the Troof is a little game that took me two minutes to download and just a few more to finish, but those were some of the most enjoyable minutes I have had with such an easy game. You have two controls: left, right, and jump. With those at your disposal, you make your way jumping and dodging various obstacles. You will soon learn that this game is not easy at all. Obstacles don't just sit, some jump, some grow, some multiply right into your path, and so on and so forth, it's enough to keep you on your toes...that is until you figure out the patterns for most of them. The aerial obstacles are a bit more difficult to navigate, which actually makes the replayability a little bit better.  Audio: 70/100 C- The sounds, like the gameplay is simple and basic, reminiscent of the Colecovision and Atari era of gaming, both paying homage and still being a modern game. It's charming, but nothing special.  Visuals: 74/100 C- 8-Bit galore, at first. The game sports the simplest of graphics, having a ton of colors and animations here and there, but things come alive when you die, of all places, as a semi 3D, blue and red hue filters everything and spins away.  Content: 75/100 C Like I mentioned at the start, this isn't a particularly long game, but it is one you can play at a party over and over, it's simple enough that anyone can get, has enough variety to keep it challenging and definitely something you can share with others. And I'm sure kids will have more fun with this game than they will with Flappy Bird.  Design: 75/100 C When dealing with the limited movements it really isn't hard to screw up and while they're not perfect, they are solid and do what they need to do. Sometimes there is some detection issues, but then again, that could just be me as well.   Performance: 80/100 B- Potatoman plays very well on my PC and probably works very well on the mobile platforms as well. It isn't processor heavy at all and doesn't have the common issues higher end games.   Verdict: 76/100 C+ It's charming. It's cute. It's colorful. It's solid. Share it to your friends. Give it to a kid. It'll keep them occupied. It's nothing grand, but not everything needs to be.",
            "review_score": "1"
        },
        {
            "review_text": "I died of flying cactus.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "The troof is bootiful ;u;",
            "review_score": "1"
        },
        {
            "review_text": "This review is the ever present and infinite unfolding of all things that ever were or will be, yet the illusion of florp prevents us from this simple realization of blah bloo blah. Your conscious mind is vibronging with jibber joobers and interconnected potatoness. Open your mind and blonk, surrender to blah blah blah blah blah blah blah blah blah blah blah blah bleep blorp blah blah blah blah blah blah blah blah blah blah blah blah blah blip blah troof troof troof blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blee blah blah blah blah blah blah blah blah blah blah blonkblah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Feels like a blend of almost atari 2600 graphics with the gameplay of nintendo games. Very fun to play. All kinds of unexpected surprises happen. Very challenging at times. Check it out!",
            "review_score": "1"
        },
        {
            "review_text": "I'm unsure, distrubed and slightly aroused by this game. I am Potatoman. The troof? Yes. The troof.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really hard maybe the hardest i ever have play don't worry i have never play dark souls 3 this game is not that hard but it is hard good or bad ;&amp;  good the music not super but good nomal good  game play if you like difficult platformer pixelated art style it was cool in 2014 maybe not now but still    mid i got it for a cheap price 0.59€ now when i think about it is not super cheat especially because it is not a long game    bad  short game play about 10-20 mins long after you have beat it you will not touch it for a long time after  two achievement kind of nahh    time to my opinion  i like hard platform but this is not hard when you have play the same level 20 times but what platform game chace level every time you die no games back to this game i wil like to like it but as i sayid it get really boring after you have beat it ones  4 out of 10 Potatoshamers",
            "review_score": "-1"
        },
        {
            "review_text": "dont seek the troof, the troof hurts ;w;",
            "review_score": "1"
        },
        {
            "review_text": "THAT WAS CERTAINLY A THING THAT HAPPENED.",
            "review_score": "1"
        },
        {
            "review_text": "The potato is a starchy, tuberous crop from the perennial nightshade Solanum tuberosum L. The word 'potato' may refer either to the plant itself or to the edible tuber. In the Andes, where the species is indigenous, there are some other closely related cultivated potato species. Potatoes were introduced outside the Andes region approximately four centuries ago, and have since become an integral part of much of the world's food supply. It is the world's fourth-largest food crop, following maize, wheat, and rice. The green leaves and green skins of tubers exposed to the light are toxic.  Wild potato species can be found throughout the Americas from the United States to southern Chile.The potato was originally believed to have been domesticated independently in multiple locations, but later genetic testing of the wide variety of cultivars and wild species proved a single origin for potatoes in the area of present-day southern Peru and extreme northwestern Bolivia (from a species in the Solanum brevicaule complex), where they were domesticated approximately 7,000–10,000 years ago. Following centuries of selective breeding, there are now over a thousand different types of potatoes. Over 99% of the presently cultivated potatoes worldwide descended from varieties that originated in the lowlands of south-central Chile, which have displaced formerly popular varieties from the Andes.  However, the local importance of the potato is variable and changing rapidly. It remains an essential crop in Europe (especially eastern and central Europe), where per capita production is still the highest in the world, but the most rapid expansion over the past few decades has occurred in southern and eastern Asia. As of 2007 China led the world in potato production, and nearly a third of the world's potatoes were harvested in China and India.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is too hard but it still gets a 10/10 for the best trailer.",
            "review_score": "1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        }
    ]
}