{
    "app_id": 328920,
    "name": "F-117A Nighthawk Stealth Fighter 2.0",
    "release_date": "2014-10-30",
    "developer": [
        "MicroProse Software, Inc."
    ],
    "publisher": [
        "Retroism",
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Flight",
        "Classic"
    ],
    "achievements": 0,
    "positive_ratings": 56,
    "negative_ratings": 13,
    "price": 4.99,
    "description": "Down below, the enemy sits unaware while a sleek, metallic creature slices through the dark. No blips show on the radar, no sign is given. Then, an instant, the roar of exploding ordnance shatters the night, demolishing targets, sending troops and pilots scrambling.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/328920/header.jpg?t=1486753104",
    "minimum_requirements": "OS: Windows XP / Vista / 7 Processor: 1.0 GHz Processor Memory: 512 MB RAM Graphics: 100% DirectX compatible graphics Storage: 600 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "recommended_requirements": "OS: Windows 7 Processor: 1.5 GHz Processor Memory: 1 GB RAM Graphics: 100% DirectX compatible graphics Storage: 600 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "I get more entertainment Value out of this then I do with DCS  and I wish I wasn't lieing.  This is my second fav Fighter Combat sim to date. Chuck yeagers Air Combat is still have fav...  The Steam Version works Flawless on Windows 8.1 x64 and Windows 10 x64.",
            "review_score": "1"
        },
        {
            "review_text": "simple and fun - loved it on the amiga",
            "review_score": "1"
        },
        {
            "review_text": "This game crashes often. I have run 3 missions and 3 times it has crashed just before the end of the mission. I can run the abanware f19 in a dos box my self and have more luck. I would not recommend this. This is a poor implentation to say the least. I would like my money back. If the dev sees this i would appreciate a response in a day on this or i will reach out to steam support",
            "review_score": "-1"
        }
    ]
}