{
    "app_id": 32900,
    "name": "Restaurant Empire II",
    "release_date": "2009-05-27",
    "developer": [
        "Enlight Software Limited"
    ],
    "publisher": [
        "Enlight Software Limited"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Management",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 112,
    "negative_ratings": 65,
    "price": 13.99,
    "description": "The sequel to the widely popular Restaurant Empire game takes you further into the depths and delights of the culinary universe than ever before. Take part in an exciting world where the customers are fickle and the bounty in your cash register changes as quickly as their tastes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/32900/header.jpg?t=1448749949",
    "minimum_requirements": "Operating System: Windows® 2000/XP/Vista/Windows 7/Windows 8 Processor: 1 GHz CPU or above  Memory: 1 GB RAM Hard Disk Space: 2 GB Video Card: 128 MB 3D card compatible with DirectX9 Sound Card: DirectX compatible DirectX® Version: DirectX® 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "First of all i don't know what's wrong with this game....  It's really   really genius     I... I.... ok lets be serious now.   I have played this game enough to know that this game is a master-game, so to speak. I see no problem with it, the graphics are ehhh but the gameplay and the campaigns are good, the ways and things you can make your restaurant is amazing and controlling the restaurant is even more amazing. The campaign Scenario's can be hard, but if you just want to play this game for killing time or something, you can go with the Sandbox Mode!! This game provides everything for every type of player. You can change the dishes in your menu, you can even give discounts when you want, you can increase/decrease the money you spend on a dish i.e you can raise or decrease the Quality of a dish. You can assign a chef to every particular dish and if you don't have time to do that any of your chef creates the recipe and serves it. You can hire people to work for your restaurant like Servers, and Captains who take orders, Receptionists etc etc... You can participate in a cooking competition. You can do almost EVERYTHING you can do in a real life restaurant as its owner. I really recommend this game, it's worth more than it's price. The amount of people who play this game is low because it's too old but i think if people become aware of this game, It could be in the list of the top sellers.",
            "review_score": "1"
        },
        {
            "review_text": "This is my first review so please bare with me. What I liked about the game is that I really had to think, I had to think about what kind of servers I wanted, and whether or not I wanted to open the upstairs dinning area or not. I had to use the chefs that was available very wisely, of course once your reputaion is high enough then you get chefs that ask to join you. If I am honest I had to play through a number of times to get it right for myself. Graphics are a little dated but that is not a big thing with me. Its story mode is very good and I liked how Restaurant Empire 1 and 2 tie in together, in other words if you have never played a simulator game then its best to start with one and go from there. All in all if you really like to play simulator games and don't really care for graphics or if you want to try something new I recommend this game but wait for it to go on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I think most have covered gameplay, and yes this game could be made nice with an update and some more features added. But the basic game is fun, not for those that don't like simulation games. It does take quite a while to get the hang of how it all works in the finer details. Once you understand then it becomes easier to manage. The shitbag complaining customers need addressing, as some settings need scaling back. A real restaurant would be broke real quick with half the amount of complaining customers. Aside from that...  To be honest it is not a game you would play continuously, but is good in here are there. For and old game still is pretty good and the price is good. Hopefully the game will get a good overhaul.  Played a lot more on old game on last PC so steam hours don't reflect.  ",
            "review_score": "1"
        },
        {
            "review_text": "As a fan of the first Restaurant Empire game, at first I was disappointed with this one. A lot of the animations are the same, and this game adds coffee and dessert shops, so you have customers eating sandwiches and cookeis with forks and knives. Also, all the customers are talking on cell phones and using laptops now, which is annoying when you're waiting for a chance to click on them. I actually quit the game for a long time because of these irritations.  However, I recently came back to it and I'm glad I did. It's a lot of fun as a strategy game, and still fun just to tinker around with the restaurants and watch the chefs cook. The first game lacked female chefs, aside from Delia, but this time there are plenty of them, and that's a welcome change too. The game isn't very difficult, but it has some challenge to it, and it's hard to find challenging strategy games these days.  The storyline is entertaining. Armand gains some fame as a celebrity chef and gets a big head, putting his marriage in jeopardy. I've only played through once, so I don't know if there's a different outcome for different choices. I'll probably play again just to find out. And I hope there will be a Restaurant Empire III because I'll buy it. Yes, the game is old and clunky looking, but it's still great to play.",
            "review_score": "1"
        },
        {
            "review_text": "360 noscopes in the Kitchen.",
            "review_score": "1"
        },
        {
            "review_text": "I spent many a time playing this game a while back. I had a crappy computer that wasn't built for gaming but that didn't matter to me at at the time and I played this game alot! I restarted alot and tried different techniques. it was awesome.  Now when I saw it on steam I was really excited and happy because I never heard that they made it for steam or that they made a sequel so I purchased it right away and went right back into enjoying every second. I even stopped playing the game I was mildly obsessed with just to get back into this game. I nailed every challenge perfectly and made it to my second resturant and saved the game so I could get my kids to bed. I was a happy camper.  As soon as I had enough time to jump back into my game I logged on immediately to continue my journey and EVERYTHING I HAD ACCOMPLISHED WAS GONE! I had to start all over again and it's happened 3 times to it's safe to say I probably wont be playing this game again.....very disappointed. It's a great game if you don't mind restarting every SINGLE time you load your game.",
            "review_score": "-1"
        },
        {
            "review_text": "Even for $5 the interface is much too glitchy and unpredictable. Object placement is so painful and elusive I spent 10 minutes trying to place a bathroom stall and sink. I wanted to play a ground up restaurant simulator but I never got past the bathroom... I recommend avoiding unless you'relooking for a tool to measure your patience.",
            "review_score": "-1"
        },
        {
            "review_text": "This game had alot of potentual but i felt it was a rushed game, the layout wasnt very user friendly and was hard to actually play, on top of all that the grathics was really poor, this game is acient and isnt worth 2 pounds so dont waste your money!  I rate this game 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "6/10",
            "review_score": "-1"
        }
    ]
}