{
    "app_id": 329440,
    "name": "Sonic Lost World",
    "release_date": "2015-11-02",
    "developer": [
        "Sonic Team"
    ],
    "publisher": [
        "SEGA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Platformer",
        "3D Platformer"
    ],
    "achievements": 100,
    "positive_ratings": 1000,
    "negative_ratings": 612,
    "price": 19.99,
    "description": "When the Deadly Six threaten to destroy his world, Sonic’s new moves &amp; power-ups are the only way to defeat them before it’s too late!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/329440/header.jpg?t=1456488291",
    "minimum_requirements": "OS: Microsoft Windows 7 / 8 / 10 Processor: Intel Pentium Dual-Core T4200 (2x2.0GHz) or AMD equivalent Memory: 2 GB RAM Graphics: NVIDIA GeForce 8800 (512MB) / ATI Radeon HD 2900 (512MB) DirectX: Version 9.0c Storage: 8 GB available space Sound Card: Sound: 9.0c compatible. Additional Notes: Memory: 2GB RAM (XP)/3GB RAM (Windows 7 / Vista)",
    "recommended_requirements": "OS: Microsoft Windows 7 Processor: Intel Core i5 @ 2.66 GHz / AMD Phenom II X4 @ 3.0 GHz Memory: 3 GB RAM Graphics: NVIDIA GeForce GTX 460 (1GB) / ATI Radeon HD 5850 (1GB) DirectX: Version 9.0c Storage: 8 GB available space Sound Card: Sound: 9.0c compatible.",
    "reviews": [
        {
            "review_text": "This was supposed to be bad?  Yeah, it's not the second Generations, but it's a decent installment. It has many, MANY obvious flaws, but it manages to not screw up more to be seriously offensive.  The most problematic element of the game are controls. Those are seriously sloppy and badly designed. Let's recap: dedicated run button, walk speed without said button is akward, double jumping feels akward (like struggling through the mud), going smoothly in diagonal direction at 3D sections feels off, ice physics, air physics... Those controls take enourmous amount of time to get a hang off. Not that it is impossible to do so, but after you master them, you still don't feel right in controlling Sonic.  Level designs aren't helping. I can commend Sonic Team for trying something new and fairly original (but let's be frank, Mario comparisons are legit), but some levels can completely change rules of play, in worst cases putting some dreadful one-hit kill obstacles. There are some misses, but other levels are not that bad and they give some enjoyment in completing them. While designs can be creative and fun at most times, I still don't like the theming - shuffling the styles between zones without much sense and with zero interesting settings or locations. Not only you have some Standard Video Game Forests and Deserts™, but you also have something like beehive or candy land on said desert... What?  Last serious offenses are the Story which is uninteresting and boss fights that are laughably pathetic. Those last ones are particularly jarring. While some of the ideas for them are pretty neat, the execution and difficulty dropped hard. Final Boss in Sonic Lost World is easier than FIRST bosses in several other platformers. King Knight (Shovel Knight) is harder than a Lost World's final boss. Snake Mount (Freedom Planet) is harder.  So why I'm giving a positive review after all? This game is not a masterpiece, but at most times it stays competent and gives decent amount of fun. While I won't defend this game to death, in my opinion Lost World got disproportionate amount of flack and hate. I would recommend to grab in on decent sale if you are interested in 2D and 3D platformers and already beaten Sonic Generations. LW doesn't hold a candle to Generations, but it is still a solid title for those experienced in the genre. However, I would discourage people not good with the genre, since difficulty level on some stages proper may be frustrating for less resistant.",
            "review_score": "1"
        },
        {
            "review_text": "The level themes are good, it looks good, music is great.  Not too fond of the controls, though.  I'd still recommend it for any Sonic fan, though.",
            "review_score": "1"
        },
        {
            "review_text": "Just played about an hour of this game. Got it with a HumbleBundle and I gotta say it's really a throwback to Sonic 2. I know people like Pros and Cons lists, so here it goes:  Pros: -Nice graphics. -Great cutscenes -Enemy detection and combos work great -Plenty of variety -Worlds are only a few levels, but make up for that with plenty of worlds (wouldn't it be biomes since this is all on the same planet? Idk.) -Just the right amount of frustrating -Voice acting is great -Soundtrack is good, but could be better. (this is a pro, because the soundtrack doesn't blow. It IS good. I just feel like it could be a bit better)  Cons: -Everything feels kinda slow. There are parts where the speed does pick up (like how you want a sonic game to be) but the majority of it you just feel like Sonic is holding back. This is a major flaw in all the 3D Sonic games. Not just this one. -Color powerups are finicky. They sometimes last for 10 seconds, they sometimes last for 1 second. It's a total crapshoot. -Powerups are underwhelming. Example: the speed power up (red shoe) has a nice sountrack, but you hardly notice a difference in speed. -Sometimes Sonic just doesn't respond to moves. I've noticed this is a problem more when you're doing a wallrun than anywhere else.   That's really all I can think of. This game is definitly worth getting on sale, but I wouldn't pay the full price. The few things that I think are wrong with it really hinder the overall flow of the game, but it's not like it kills it by any means. It's still great to play, and if you were a fan of Sonic 1 &amp; 2, then you'll enjoy this. If I could recommend a change for this game, I would recommend focusing on Sonic's speed. Increase that and you'll have a much better gaming experience. Maybe there's a mod for that...  Recommended. 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't really feel like a Sonic game... Doesn't mean it's bad, it's quite fun. Portwise it's good enough, the res doesn't go higher than 1920 x 1080, but that's not really a problem for most normal people.   Also it's really colourful and has a pretty damn good soundtrack, which is all that really matters. Oh, the controls are meh",
            "review_score": "1"
        },
        {
            "review_text": "Sonic Lost World is the next main stream Sonic Game after Sonic Generations. For some it is a step backwards but for other's it is an underrated classic.   For me, it is an underrated classic with a lot of Flaws. Although I say this. the first Playthrough I did on Sonic Lost World for Wii U made me despise it. After hearing it was coming to PC for some reason I was very excited and couldn't wait to give it another go.   So before going into detail about the game itself, I will answer the question what is on everyone's mind for people who played it on Wii U.    Is the PC port good?  At first I didn't like the port because it was very lacking in the Settings department. I had to force Anti-Aliasing to make the graphics look amazing. Other than that it is locked to 60fps and sometimes there is slow down. So not the best port but playable.   Is the Game good?    Story   The Sonic Franchise isn't really known for having a great story and Sonic Lost World is no acception. The new bad guys 'The Deadly Six' are nothing more than archetype's. They are very one dimensional and have no real purpose than being the bad guys. Although The Deadly Six are a let down, That doesn't mean the other character's like Sonic, Tails and Eggman are a let down as the character interaction's in this game are very good and may have you laugh sometimes.    Gameplay  Taking away the Boost Formula was a very risky move by SEGA as Sonic Generations was a huge success due to the Boost formula. Instead we have Sonic at a walking pace, a run button, A Parkour system and the Spin Dash becoming useful again. This Port of Sonic Lost World improves the control and makes it a lot more tighter.   Sonic Lost World does not tell you how to use a lot of it's features including the Parkour System.  Because of the success of Sonic Colours wisp's make a come back. Now they are basically just power-ups which control ok-ish.  Overall Sonic Lost World can be a very frustrating game at time's and especially on your first playthrough. If your a Sonic Fan or a Fan of Platformers maybe take a look at this misunderstood gem.",
            "review_score": "1"
        },
        {
            "review_text": "Sonic Lost World is such an underrated game in my opinion and deserves more love although              AIN'T A NINTENDO EXCLUSIVE ANYMORE HUH!",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoy this game, it's cool to finally get to play a Sonic game that was locked off on a system I didn't own for a couple of years, it has a lot ot enjoy as well. Like Colours and Generations it keeps the gameplay as a mix of 3D and side scrolling, which works better than it has any right to do. It's very much a case of Sonic does Mario Galaxy on many of the 3D sections, however the inside tube levels remind me of Knuckles Chaotix more than anything else. It's got classic Badniks, the story still keeps the Saturday Morning Cartoon approach that I enjoyed in the last two games. and the new controls work better than they sound on paper.  But I can't recommend it. So much of this game is cheap rather than difficult. Moving upwards in a virtical scrolling level shouldn't create an instant death pit beneath you, and a lot of deaths feel forced or ineffectively telegraphed.  If you're a fan of Sonic, you'll probably dig it, but I totally understand the lukewarm reception it received on the Wii U. If it felt tighter maybe a lot of that would go away, but it feeling cheap as opposed to challenging kinda breaks some of it for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Besides Sonic Colors, this is the only 3D Sonic game made of all original material that I have thorougly enjoyed (and Colors isn't on Steam at the time of this review.) It runs on perfectly on my 2011 laptop with dedicated video. It is a little less Sonic and a little more Mario Galaxy, but this was the mixture that made Colors so great, and to me it's worth the very shallow loss of some speed of gameplay. The controls work great for me on an Xbox 360 controller, and I didn't have to 'get used' to the controls at all. Besdies Generations, it's the only 3D Sonic game I would recommend on Steam at this time. It's just fun to play in a way most 3D sonic games are not.",
            "review_score": "1"
        },
        {
            "review_text": "Sonic Lost World for the pc is a great port, before I start let me just tell you something quickly, this is the first steam sonic game, TO HAVE GRAPHICS CUSTOMIZATION IN GAME! But that's not really a selling point now, is it? first off the resolution only goes up to 1080p, which is fine for me, secondly, DON'T PLAY THIS GAME WITH A KEYBOARD! your fingers will probably fall off (not really) play with a controller. thirdly the game plays great, well it did for me some people found it hard to get used to the run button, but when the game came out for the wii u I found it easy to get used to, also the parkour is pretty nifty once you get it down resulting in some cool shortcuts lastly, SEGA you did good, this shows that you can make good ports, but just one more thing......   PORT UNLEASHED TO PC!! XD",
            "review_score": "1"
        },
        {
            "review_text": "I mean no hyperbole when I say Sonic Lost World is the best 3D Sonic game despite its flaws.  Why? Because SLW has none of the filler no one asked for found in other 3D Sonic games--the Adventure games' emerald shard hunting or the walker sections, the illusion of choice from Heroes, Adventure games or Shadow the Hedgehog, and the forced mini-games of Sonic Generations.  Another reason is that SLW focuses on what makes Sonic special. This is the game that finally puts the 2D style gameplay of the classic games into the 3D games, and it's because this game is about three things: Sonic, skill and speed.  Is it worth the $30 price tag? I don't think the game offers enough, although you will get 10 to 12 hours of gameplay (especially if you go for the Red Rings, which I would recommend). But if you can get this game at half-price, you should definitely give this game a chance.  (Also, don't play this game without a controller. You won't have a good time.)   Isn't That the Mario Galaxy Ripoff?",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, played on the Wii U as well. People just hating to hate.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. Mario Galaxy without the waggle sticks.",
            "review_score": "1"
        },
        {
            "review_text": "Sonic Lost World is a very interesting Sonic game. The PC port is a bit off with how its built but I imagine that with a good PC you can run it good. The graphics are fantastic. The colors pop and the textures are great. The level designs are kind of wonky but are fun enough to provide a decent platforming romp. The music is great for the most part like most main series Sonic games. Overall I recommend trying Lost World out if you can get it at a decent price.",
            "review_score": "1"
        },
        {
            "review_text": "SEGA just has to keep reinventing the wheel, don't they? Don't get me wrong, this isn't a bad game but it just falls flat on almost everything it's trying to emulate from the Galaxy series. Also, holding the R-Trigger to run makes for a very odd way to play a Sonic game &amp; it makes my hand cramp.    PROS  -Solid PC Port -Includes Nights DLC -Unique style gameplay compared to other Sonic games -Well Done Animated Cutscenes   CONS  -It's boring -Clunky &amp; Painful Controls -It does very little with the Galaxy-like design -Absolutely must have a controller   Story   The story is pretty basic, even for a Sonic game. It starts off with Sonic riding with Tails on his biplane chasing after Eggman who's capturing critters to use for his experiments. Your plane gets shot down into this new place called the Hex. Sonic then chases down Eggman only to blunder &amp; release some new minions from his control. It then turns into Sonic stopping these Deadly Six from destroying the world. That's pretty much it.   Gameplay   So this is where things get iffy. First of all, you know how in most sonic games you hold forward to run &amp; then there's a boost, spin dash &amp; a jump? Well whoever directed this game thought it would be a good idea to give Sonic a run button. My guess is because of how the new world is designed to go slow, or at least slower than other Sonic games. Now, a run button doesn't sound like a bad idea when so many other games use one but good god, they couldn't have picked a worse button to map it toward. You have to hold down the Right Trigger constantly in order to move fast and oh my god is this terrible. After a few minutes of holding it down my hand starts to cramp and you need to hold it down a lot. Not only because you use it to run but you also use it to cling to walls for wall jumps &amp; parcore maneuvers. This game is basically an endurance test for me to see how long I can handle my hand straining from holding down a trigger that wasn't meant to be held down this long.  Then there's the level design. It's trying to be like the Super Mario Galaxy games but it does absolutely nothing with it. If you've played the Galaxy series you know how much fun it is jumping around worlds &amp; platforming around in low gravity. This game has very little going for it in that area. They basically decided to make levels in the style of the Galaxy games but you still just run straight to the very end. No little extra areas to unlock, &amp; aside from the red rings there's nothing to collect. The game does give you Omachao challenges but these offer very little reward. You basically get a random item to use in stages.  Another thing this game does poorly is the tutorial. In which, there isn't one. So you basically gotta figure out how to play the game on your own with some Question marks giving you vague explanations in the first level. I didn't even know I had an item box until halfway through the game when it said I had too many items &amp; had to delete one. Also, the game's UI looks like it was designed for the Wii U gamepad since you have no way of knowing what button opens what menu. Would you guess that R3 opens the item box? Cause I didn't know that &amp; the game doesn't do much in the way of telling me &amp; no situation where I had to use it to know it even existed.   OVERALL   This is, for the most part, a very generic 3D platform experience especially for a Sonic game. It's not a bad game, but it does absolutely nothing to expand the franchise. If you decided to skip this one you wouldn't be missing a whole lot. I'd say only get this if you are a big SEGA or Sonic fanboy like I am (even then you should wait for a sale) or if you have some kids that need something to keep them busy. And make sure you have a comfortable controller because holding down the R-Trigger is the absolute worst part about this game.",
            "review_score": "1"
        },
        {
            "review_text": "100% the game on Wii U; this is me speaking from experience.  This game is a dramatic departure from Unleashed, Colors, and Generations. Do not go into this game expecting a similar experience.  Pros Game runs at 60 fps constant Controls are tight good level design good music good (if simple) story Xbox controller support  Cons While controls are good, takes much getting used to Wisps are useless Cutscenes are way to grainy Not enough of the main 3D levels where the game truly shines Underdevloped antagonist.  Really, this is a game worth picking up. If you're still not sure, pick it up when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "The closest 3D Sonic has ever come to being like 2D Sonic (specifically the Genesis/MegaDrive games), and it's GOOOOOOD. Have this game on Wii U - The port is flawless. 1080p, locked 60fps throughout. Supports FXAA through drivers, vsync is forced in-game by default. Supports XInput controllers, including my own Xbox One controller, without any issues whatsoever.  Now, onto the game itself: It's the best 3D Sonic game, quite simply. Only Sonic Generations comes close to being as good as this. Close, but not quite. Unlike Sonic Generations, Sonic Lost World is more controllable. Sonic's movement has pinpoint precision, which means this game is significantly more focused on exploration and precision platforming.  In a nutshell, this is finally Sonic's break into 3D the way it should have been 20 years ago. Sonic Lost World is to 2D Sonic what Super Mario Galaxy and, to a lesser extent, Super Mario 3D World, is to 2D Mario.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great Action Adventure Platformer with a nice story, amazing music and a fair amount of collectables. The story feautures Sonic, Tails and Eggman as they face difficult trials on their journey, teaching them many life lessons. I recommend that you buy this game, it's a fun experience and worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to love this game. I wished for it, And was so hyped for it when i heard it's coming to PC.  But like almost every 3D Sonic game, the level designs are really bad and many parts of the game are way too frustrating.  I don't know why this game really likes to get on my nerves. Why The controls sometimes get so unresponsive and sluggish suddenly? Why the checkpoints are far from each other, specifially on hard parts? I got sick repeating sections before i return to that spot where i died and try again. Why Sonic sometime refuse to acknowledge the enemies in front of him? Many times after jumping to do the homing attack, suddenly the red circle don't appear but when i get hit and lose my rings, Sonic decide it's an enemy and the red circle appear after it's too late. No I'm not talking about the enemies who need a specific time/strategy to attack, I'm not that stupid.  I don't hate playing a challenging game, but this one is taking it too far and it's rely on its flaws to make you suffer which is most of the time the failures were really unfair.  Despite the premise to be the Fastest Thing alive, most of the time you need to move slowly and carefully or prepare to die too much. And some levels consists too much on trial and error.  The Zeti/Special moves from Sonic Colors gets way less common and useful here and they are usable for a very short time just progress through little sections.  On the positive notes: The graphics are beautiful, the music is great and the story is interesting specially seeing the new side of Eggman.  About the PC Port, it's crap depends on hardware. If you have laptop with a Nvidia Optimus with Intel integrated, it will give you a Black Screen if you are using the Nvidia GPU, unless you switch to Intel GPU and enjoy the low framerates and bad graphics.  On my Desktop PC with GTX 1070, the game doesn't work on high frequency, probably on 58hz or lower making the visual looks bad.  On the postive side, it's runs smooth with 60FPS (tweakable to run more but i heard it will generate more bugs) and so far no crashes.  That being said, the game has enjoyable and fun moments, but overall it's a product for rage-quitting.  5.5/10 - Get it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "- This review isn't written by a native speaker, thank you for your understanding -  - If you haven't found this review helpful or if you have found a mistake please leave a comment below -   Rating :  between Good Game and Must Play   - Key features below ---- Review after -------------------------------------------------------------",
            "review_score": "1"
        },
        {
            "review_text": "Really great, I am pleased with my purchase. The visual's are bright and appealing, the gameplay for me is a lot of fun, and the music is awesome! Well worth what I paid for it.  **Game Completed Update**  OK so I just finished this game, and wow I had so much fun with this! Once I figured out all the controls I had a blast and I am really impressed with the production values in this title.   The music in this game is in my humble opinion incredible, and so are the colourful graphics. Some of the later levels are challenging, often enchanting, and certainly very beautiful! I just wish other's would play the game long enough to see just how great the game really gets as it progresses.  I have noticed some people are leaving reviews after having played less than an hour, but this game really picks up big time as your progress and I think a lot of those 'negative nancy's' havent played it long enough to see just how much fun it really is.  This game is easily the best single player game I have purchased in a long time, and I would not hesitate to recommened it.",
            "review_score": "1"
        },
        {
            "review_text": "So good I litterally can't turn it off, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Really fun Sonic game (not played the Wii U version) - runs at a solid 60fps, butter smooth.   Don't be put off by the difficulty factor, it takes some getting used to but once you've mastered it you can fly through stages and pull off some neat tricks &amp; combos. Hold RT a lot to ensure you're running the majority of the time and chain together attacks (double tap A or A then X on a 360 pad); etc.   Not finished it yet; although I already know this will be yet another Sonic game I won't be able to put down until I have obtained every single achievement :)  Recommended to any Sonic fan or platformer fan; for sure.",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game,ive played this on my Wii U and loved it,but on my sucky ♥♥♥ laptop, it plays really slow,(Sonic Lost FPS)Note to selfie &amp; everyone who views this,buy a better laptop(a gaming one)  2016 Update:  Ok, now that I have an Alienware laptop, this game runs and plays fine, but like I said before, you need a gaming pc/laptop",
            "review_score": "1"
        },
        {
            "review_text": "I don't see what the fuss is all about, its pretty great. :3",
            "review_score": "1"
        },
        {
            "review_text": "* Astoundingly bad and confusing controls that are never actually explained. * Bland, linear levels. * Terrible writing.  Avoid at all costs.  Pick a good 3D platformer instead, like Sonic Generations, Ty the Tasmanian Tiger, or Poi. Or a good platformer, like the early 2D Sonic games.",
            "review_score": "-1"
        },
        {
            "review_text": "I have played the game on the Wii U before, and in terms of port quality, I'd say this is a good start for future Sonic ports. It has your very basic graphics options, such as resolution, shadows, and grass, all of which are located in-game instead of in an external launcher, a Sonic PC first. I wish there were more, but for now it passes. For those wondering, the game has V-Sync enabled by default, and Anti-aliasing and Anisotropic filtering can be enabled externally using the NVIDIA or AMD applications. The Wii U buttons have been replaced by very low quality XBox buttons, and all of the Wisps can now be controlled without needing a touch screen (Yes!). Load times are quick, and the game maintains a solid, albeit locked, 60fps.  The graphics of this game are FANTASTIC, but I'm sure you've heard that already. No need to explain further! :P The cutscenes are mostly rendered in-game, for your information.  As for almost every Sonic game, this game has a soundtrack better than its' graphics. The stages all have music to fit their atmosphere, and it all just sounds SO GOOD! Plus, a few of the levels have TANGO as the music. Who can get away with tango in a platformer? Sonic, that's who (The song is called Midnight Owl in case you were wondering.).  Gameplay-wise, the game isn't as bad as I remembered it being. You essentially are playing a Sonic game that is heavily inspired by Super Mario Galaxy. The controls seem to have improved a bit from the Wii U version, being even tighter than before now that we have 60 frames to work with. The level design is overall alright. There are more good levels than bad ones, but those bad ones will be ones that you will remember for being simply too difficult or too gimmicky. The boss battles, on the most part, are a piece of cake, and overall do not add much to the game. I find this game to be enjoyable overall, but you really need a controller to do so. The keyboard feels too clunky.  A bit of a warning before purchasing: I don't know if this is just me or not, but this game has slowdown issues whenever there are more than 5 things on the screen. I look at my Task Manager as I'm playing and the game is hardly any using any of my CPU. What gives? Either way, take caution. I have and AMD CPU and GPU, for your information.  Overall, a very solid entry into the Sonic franchise. Do not listen to what the haters say. I would highly recommend purchasing this game. Just beware of slowdown if you are an AMD user!",
            "review_score": "1"
        },
        {
            "review_text": "I recommend it only because it's a decent game aside from that the 3DS version looks wayyy better than this.",
            "review_score": "1"
        },
        {
            "review_text": "*Be advised! This review is made with me only played the very first zone/stage of the game*  As a Sonic fans that have no consoles, any Sonic games released on PC is always a nice thing.  I find the control and stage environment is rather confusing at first, but after sometime playing it, the fun feeling started to emerge. Well, there is no tutorial whatsoever, you start a new game, got to see a beautiful cutscene and then straight to first zone without anything telling you what you can do in this game, not even an Omochao tells you what to do in the loading screen. Probably will be told later as I just played the very first zone/stage of the game.  Multilock homing attack is also kind of confusing as I still don't know how to properly multi lock on enemies, sometimes I lock one, sometimes two, sometimes almost every enemies nearby.  I don't know if this a con or a pro, but there is no rank system when finishing a stage, meaning there is no rank E,D,C,B,A, or S after you complete it. The bright side is that with this you can actually enjoy exploring the stage without worrying the time, instead of blasting through the stage and restart on even just one simple mistake like usual Sonic games before this game.  This review is made with me just playing the first zone and repeatedly playing it until I get all 5 red star rings in that stage, and my conclusion is : Sonic Lost World is fun, might not be the best Sonic game ever made, but I find it really fun to play. And FYI, I didn't get bored a single bit even I played the same stage like almost 5 times straight as there are many paths to choose from to finish the stage.  Definitely going to recommend it to someone, even if they are not a big fan of the blue blur.",
            "review_score": "1"
        },
        {
            "review_text": "Sonic Lost World is a frustratingly difficult mess of a Mario Galaxy rip-off. At first.  When playing through the game on the Wii U I found that I was so frustrated with how Sonic controlled around the tube-like structure, which is very similar to that of Mario Galaxy. Seeing as I don't even like how the structure of Mario Galaxy's levels, I don't like it here either. It's not that I don't think it's good design, and it is for the most part. However taking controls from Mario Sunshine or Sonic Adventure and putting gravity physics into the mix, doesn't always end well. You'll notice both Mario and Sonic had to incorporate some form of a double jump into the control scheme because the gravity physics can screw up the jump arc you might need. When taking that into consideration, you really can't be formulaic when making a gravity based game like this.   Now that's not saying that it's a bad game. I did have my fair share of fun with this game and I played it twice. Once on the Wii U (bought it day one) and once on Steam (pre-ordered it this time for the DLC). While both experiences were enjoyable, the Steam version was the most enjoyable. But why. First off, it's not because it's '1080p at 60fps!' No. This is a pretty ♥♥♥♥♥♥ port that only allows for windowed fullscreen mode. Meaning no anti-aliasing and no lower resolutions for people whose computers can't handle this game at full 1080p. The technical aspects of the game themselves don't make this the best version, what makes this the best version is because it's not on the ♥♥♥♥♥♥♥ Wii U. You don't need a heavy brick to play this game. You have any controller you want at your disposal, even the Wii U Pro controller, which you can't use to play this game with on the Wii U! Plus there's no Miiverse crap or other stuff, and I notice the hints and item bag a lot more because it's on the screen I'm looking at.  The next reason is because I have played the Wii U version 2 years ago. Was it that long already? ♥♥♥♥! Anyways, back when I first played this game on the Wii U I had no idea how to control Sonic and navigate the levels with parkour and crappy gravity physics. Now that I know how to handle it better, I actually had a much more enjoyable experience. With a bad experience under my belt (and the fact that I impulsively bought it like a little kid on a sugar rush), I thought that I made a mistake purchasing this game for PC, but I was wrong. Playing the levels with some more practice and skill than when I first did made me notice that this game is much better the second time around, and after Sonic Boom, I appreciate this game a lot more now.  Bottom line is this game is better the second time around. I can say that I enjoy this game a lot more than I first did two years ago, but that doesn't change the fact that I had a frustrating time trying to get used to the game's unusual control and level design, even if it does look good on paper.  Sonic Lost World get's a 7/10 And a reccomendation to play it twice. Not 'cause it's great, but you won't notice it's good until you start another new game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game, dont listen to the hate... I recommend you buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Alright so where do we start.   I bought this game when it was 75% off, I got this for 7 dollars, which this game is $40 for full price.   so just a reminder, if you have a low end pc and can't run games well, DO NOT BUY THIS, this game requires more from your pc/laptop, so if you want to buy this, please check the System Requirements,   The game is alright, the game was not that fun, only playing like 10 minutes of it before getting bored, so, this game, I wish there could be a maybe option for recommending a game, because that is what my review is, so no, I do not recommend this game to you.",
            "review_score": "-1"
        },
        {
            "review_text": "Sonic feels good when you go fast, this game dont fast very well",
            "review_score": "-1"
        },
        {
            "review_text": "It's Sonic Generations meets Sonic Xtreme (Google it).   THIS VERSION MEANS NO ♥♥♥♥ING STUPID PIECE OF GARBAGE WII U GAMEPAD.  10/10 WOULD AVOID PAD AGAIN",
            "review_score": "1"
        },
        {
            "review_text": "good game it is like they remade sonic xtreme gg very  A E S T H E T I C",
            "review_score": "1"
        },
        {
            "review_text": "I like playing Sonic games but this is a pretty bad Sonic game, I don't understand how we went from Sonic Generations (which was amazing) to Sonic Lost World.  Sure the graphics look nice but nowhere near as good as Generations and the controls in general feel ackward and there's less interest in speed or adventure in this game. The only good thing is probably the cutscenes since there an improvement over the original Adventure series or the murmuring that was done in Sonic Unleashed, I'm having a hard time tolerating the bad game mechanics to warrant completing the game because I really don't find this game fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Holy crap is this game amazing and the amount of detail in it is absolutly incredible  PROS: Everything  CONS: Nothing   100\\10 The second best sonic game ever",
            "review_score": "1"
        },
        {
            "review_text": "It's bad both as a Sonic game and as a platformer. No sense of speed, poor feedback between input and actions. Dull level design. It's not complete-disaster level bad but just really, really mediocre and dull.",
            "review_score": "-1"
        },
        {
            "review_text": "pros - classic look mixed with modern look - no touchpad controls -hd gameplay  -amazing graphics - amazing soundtrack -MODS  cons - lackluster story - no backstory to deadly six or the lost hex - originality of levels -boss fights to easy  overall it's a decent sonic game just not as good as generations or colors, just wished the story wasn't rushed like pontac said",
            "review_score": "1"
        },
        {
            "review_text": "The PC Version TOTALLY Makes The Wisp Abilities A Lot Easier To Function (Definetly Makes The Rocket Wisp Section A WHOLE Lot Better.) And The PC Version Makes The Game Easier To Play (And The Free Nightmare Zone DLC In This Game Is Great.) And It Is A Really Fun Game Where You Gotta Go Fast Before The Time Runs Out While Running On Spherical Terrain, Ice, Clouds, And The Cutscenes Are Amazing With Some Sillyness And Whatnot, And The Bosses Are So Fun To Fight, This Is The Best Game To Be On The PC.",
            "review_score": "1"
        },
        {
            "review_text": "why is this game so slow its like 1-10 fps like wth i like the game but why is it so slow",
            "review_score": "1"
        },
        {
            "review_text": "The game is great, but there's a main problem with this port: the bugs. They make the game unplayable most of the times, and some are game breaking, I highly recommend buying the Wii U version than this port. About the gameplay, it's simply Super Mario Galaxy, but instead of Mario is Sonic, instead of small planets is some fragments from the lost hex and some extra features, also horrible boss battles that are easier than the actual stage. I reccomend to you buy the generations instead of this. Only Sonic Boom is worse than this (excluding Sonic 06).",
            "review_score": "-1"
        },
        {
            "review_text": "It plays like Sonic Generations, but instead of all the levels being fun and creative, these ones are all horribly horribly uninspired.",
            "review_score": "-1"
        },
        {
            "review_text": "Should you play this game? No...  It is frustrating as hell, the game does a poor job to teach you how to play it and the level design has to many infuriating, choop layouts.   If you have a 3Ds, buy this version.  PS. I finished the game with all the Emeralds.",
            "review_score": "-1"
        },
        {
            "review_text": "I can only ask 'what is happening?' so many times before hitting the uninstall button.",
            "review_score": "-1"
        },
        {
            "review_text": "While graphically nice, thats about as much as this game has to offer. This game starts off very easy, and gradually gets harder. you know, like any other game. Well the way Sonic Lost Worlds executes it is wrong.  There is not a level you will not die in in this game, no matter how good at video games you are. You will die at least once. Why? There is a fine line for challenge in gaming. theres 'oh boy thats pretty challenging, I'll get it next time' and then theres ♥♥♥♥♥♥♥t challenge, where instead of being a challenge its just straight up near impossible, and requires quite a bit of raw luck. The first half of the game is straight forward. Run through the levels, die a few times, yada yada no big deal. Well the second half just screws you over 100% of the time. They introduce new gimmicky things on each level without even explaining what or how to do it. Towards the end of the game, the levels stretch out way too long, to the point where you just get bored and frustrated. On top of this a lot of things one hit kill you despite you having rings, which negates the point of even having rings in the first place. Then after you get game over, its back to the beginning of the level for you, wasting all that progress which took way too long, and you just straight up give up  Bosses: the bosses stir up quite a bit of controversy because theyre all 'way too easy'. Well, its true. I had more challenges with the regular badnicks you find in the level than the bosses themselves. They literally take only 2 hits to beat. Hell, some badnicks take more than 2 hits.  So overall, unless you like games that will make you want to snap your controller in half, no, I would not recommend this game to anyone.  Pros: -Good Graphics -Great optimization for a Wii U port -Bright colorful levels  Cons: -Difficulty level changes constantly -Bosses are too easy -Levels go on too long -Subpar music -Terrible [English] voice acting -No voice/language options in game -Awful plot -The game will make you want to gouge your eyeballs out in frustration",
            "review_score": "-1"
        },
        {
            "review_text": "dis game was great, i alreddy have supe da sonic :) 11/10",
            "review_score": "1"
        },
        {
            "review_text": "part of this game is pretty good.......   but to the parts which are not... ....................../´¯/)  ....................,/¯../  .................../..../  ............./´¯/'...'/´¯¯`·¸  ........../'/.../..../......./¨¯\\  ........('(...´...´.... ¯~/'...')  .........\\.................'...../  ..........''...\\.......... _.·´  ............\\..............(  ..............\\.............\\...",
            "review_score": "1"
        },
        {
            "review_text": "this game sucks",
            "review_score": "-1"
        },
        {
            "review_text": "how do you even go from colors and generations to this ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "this game just sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Game is completely broke. Sonic stuck in T pose and enemies spin around. Crashes 10 seconds in.",
            "review_score": "-1"
        },
        {
            "review_text": "Really fun and enjoyable game, I don't think it is as good as generations, so if you are looking for a really good sonic game to play on PC, I would reccmend Sonic Generations.",
            "review_score": "1"
        },
        {
            "review_text": "Over all so far this is a Pretty good Sonic game, with the lot of titles that are.. well... bad this is a welcome sight. it in of itself how ever is not with out its flaws.   the game itself if you come in to this expecting some Sonic adventure 2 / Genesis era speed you will be mistaken Gravity on the lost hex the world /area /thing the game takes place on has a neat gravity effect which seems to be strong enough to slow the blue blur down a few pegs  Walk as normal Right trigger to 'run'  its faster but not a ton faster  there ar w few levels later on that are just a pain to play one level in an icy zone has you play a giant snowball, yes you katamari th HELL out of some rings , but the problem lies in how slidey this massive snowball seems to be and how easy it is that EVERYTHING can bump you right off th stage. thankfully the game is generious with lives.  thee visuals are Pretty and bright which is nice to see, the level themes are plesent   another main qualm i have is that the story badguys in the game, the 'zeti' seem to be all bark no bite, they taunt you in the various levels but when you actually fight them they seems.. almost depressingly easy, and who knows mayb it changes later on in the game  the game does run quite well on my intel hd 4000 chip laptop i get a constant 30-60 fps it drops from around 50-60 to about 30-40 ish when theres a buncha stuff happening but ive never seen it hit lower than 30 so even my sub par system runs it nicely  over all as a long time fan of sonic th ehedgehog i do like the game and i can certinly recommend this to any sonic fan just dont go in to it expecting blazing fast speeds because a run at 200 mph game this is not keeping that in mind how ever it is a very lovely title.  ",
            "review_score": "1"
        },
        {
            "review_text": "Blue boy traverses the broken triangle in hopes for absolutely nothing. No poems are explained throughout this experience. Putting the tales aside, manuevering this rat is bretty good while it needs some experience to master but once you harness all your willpower it's fine and acceptable. Modulars are what really make this simulation shine. 1 chromosome in and we already have new skin to wear even completely new bodies! In the end don't acquire this to just listen to it spew trash at you. Purchase this to acquire new skin and ascend to new knowledge and elightment.",
            "review_score": "1"
        },
        {
            "review_text": "Its very colorful and easy game. Its fun and looks nice, but if you are looking for some actual speed go generations. This is just a game to tie you over if you've played everything else. This game is primarily platforming with only a little bit of speed. Story is crap, but dont focus on that. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "It's not bad, but it's also not very good. It had potential, but that was all wasted on bad level design and recycled gimmicks.  Pros: - The visuals are still beautiful despite being a huge step down from Generations. - The soundtrack is pretty great.  Cons: - Very hard to control, and gamepad mappings can't be edited. - Some levels feel very unfair. - Bosses are incredibly easy, some even being easier than the levels they appear in. - The new wisps are horrible, and they managed to make the returning wisps bad as well. - Bad level design; you can rarely actually go fast without being interrupted by an obstacle or spring, and when you do go fast without those it's most likely scripted. - THAT FREAKING SNOWBALL LEVEL. - 'Challenges' are way too easy, being simple things like 'jump 30 times' and 'collect 500 rings total'. - Pretty much the only challenge in the game is the level design.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a great game with a few flaws, but well worth a play :)",
            "review_score": "1"
        },
        {
            "review_text": "Always wanted to know first hand as to why people say this was a step backwards from Sonic Generations, and I can now see why and echo those calls. This game controls like a piece of ♥♥♥♥, a metaphor for Sega's everlasting reputation. I shouldn't be suprised, just when they got the formula right with Generations they go an ♥♥♥♥ it up for no apparent reason. Graphically the game is appealling, good colours, textures and all that. But the asthetics are probably the only appealling thing about this game. Controls are abysmal, its hard to navigate through levels and the whole parquor aspect is a bit clunky. The reason why generations worked was that the mechanics were simple and easy to navigate, it allowed a fluid flow of motion and gave simplified decision making in high speed parts. It was easy and fun. Here in Lost World, they try adding too many elements (parqour, wall running with homing attack, wall jump,etc) Its too much, allowing it to be more complex. That's no fun. Voice acting and story are your standard in any other Sonic game, nothing new there. In summary, a disappointing and frustrating game. To put things into perspecive, I always like to finish campaigns to get a sense of accomplishment and to finish the story. For this game, I switched it off after only half way, it is not worth the time.",
            "review_score": "-1"
        },
        {
            "review_text": "It's certainly not as entertaining as past sonic hits, but the modding community makes up for that, I mean really you can play as fricken Jimmy Neutron with mods, how hilarious is that, it also is very funny watching him zoom from level to level, but enough about Jimmy Neutron, let's talk about the main course, is the game good, well if your bored yes.",
            "review_score": "1"
        },
        {
            "review_text": "Pros- Looks Nice, music is pretty catchy, and it has some good level design.  Cons- Boss battles are really terrible, the controls ♥♥♥♥ing suck donkey ♥♥♥♥, and the game randomly lagged on my good pc m8",
            "review_score": "-1"
        },
        {
            "review_text": "Too many people hate on this game. They say '0mg 1t'5 ju5t m4r0 g4l4x3 0/10!!!!!!!!!!!!1!!!111', or 'CANT LOWER FRAMES 0/10'. They never give this game love and enjoyment. I mean seriously, if everyone were critical, the world would be boring. Boring isn't fun. I'm here to give it the love it deserves. But first, a lil history lesson!  Back in good ol' 1993, E3 revealed a game called 'Sonic X-treme' for the Saturn. Everyone was talking about it. SEGA forced it into all of our favorite magazines, E3 booths, and even our librarys. It was brilliant. The game was GOING to be released in Christmas of 1996, but due to technical and staff (One suffered severe medical issues) issues, the game was silently scrapped.  Now, here's where that's related. Look at some X-treme gameplay (Search up 'Sonic X-treme Gameplay' on the YouTubes). Now look at SLW gameplay. Pretty similar, aren't they? In fact, there's a bunch of X-treme textures that were leaked online. One of whch included a red, spherical flower with white in the middle. In SLW, look closely in Windy Hill. Boom. Same flowers, texture and all! Also, 'running up walls'? That's in X-treme! Also, I'm aware one of SEGAs devs for the game confirmed X-treme was not the basis, as no other devs knew about the game. I disagree based on these facts.  Also, Frame problems. Yeeaaaa-no. You can fix these easily, SEGA made a tool to limit frames. I can't link since I don't have it, but it's X-perimental (HAHAHAHAHAHA!...Anyone? Well?...*sniff*...*runs off the stage crying*), so BE WARNED!  Now, gameplay. It's X-treme--and I mean the game. That's an insta-+ in my book!  Story, it's good. Not really rememorable, and pretty cheesy at X-tremely (Now do you guys like it?...At...at all?...*sniff*...*runs off the stage crying again*) rare times. All in all, a +.  Levels. As far as I know, they're not too fair. I don't see why, but this is coming from someone who just got it.  Replayability, eh. Unless it's a mod.  Oh right, MODS!!! Mods can be model swaps, camera changes, reanimations, all that. There's a ton of 'em on a guide, so I reccomend you look at it. (One makes it look more like X-treme by making Sonics model Sonic from Sonic R, then combine that with the clean up HUD thing, and remove lines from going fast/homing attack path, and you get X-tremely Lost World!)  So all in all, 9.9/10. It's almost perfect, but a not-huge lack of replayability. And, X-TREEEEEEEEEEEEEEME!  TL;DR:9.9/10 for a bit of a lack of replayability",
            "review_score": "1"
        },
        {
            "review_text": "This sonic game just doesn't 'feel' like a sonic game. It's slow and clunky.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Could have been a nice game. Actually is if you forget the catastrophic port and the numerous bugs. But that's the point. A catastrophic port with too many bugs...",
            "review_score": "-1"
        },
        {
            "review_text": "This is essentially the wii u version but without the stupid wii u gamepad. If you thought the game would be better without the wii u gamepad than this game is for you. It is decent for the most part and is functional but lacks many options in terms of settings",
            "review_score": "1"
        },
        {
            "review_text": "Wasnt expecting too much from this, but I was plesently supprised, actually enjoy the cartoonish graphics and different style of play from previous sonic games.",
            "review_score": "1"
        },
        {
            "review_text": ":3",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game play. Different modes of view. Quick fast playing it on my Desktop, it is GREAT. No problems with graphics speed ect, in fact like other games, I will probably need to SLOW the FPS down because it's SO VERY FAST on my Dell with an MSI HD6450 win 7 machine. which obviously I have maxed the ram and other components. Enough to make videos of my game. Perhaps I will upload a few.  This is a very good game! It's just, not being able to play as tails, is a downer. Don't get me wrong I like Sonic the Hedgehog alot, and there is the presence of tails in the stock game. Guess I just got used to Genesis and Sonic 2 &amp; Sonic CD which I had bought long ago and because Tails was so darn COOL! Well, anyways this game is Totally worth it",
            "review_score": "1"
        },
        {
            "review_text": "Super Mario Galaxy at mach 4 and blue eh/10",
            "review_score": "-1"
        },
        {
            "review_text": "Ok ! Nice too see a sonic game like this ported on steam.I don't say it's a bad game or something like that it's a good game ! But sometimes it's lagging and I don't have this problem at generations which is 'bleahh..'  The Story is ok. In rest is super !   9.50/10 Go and throw cash on this right now !",
            "review_score": "1"
        },
        {
            "review_text": "Um I played it for 4 hours and then it just didn't let me on.... OK? Still a absolutely awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing like the 'Sonic Generations' game. Very poor graphics, bugs in controls, repetitive/exhausting gameplay without any artistry. It has some interesting stages, but that's it. I understand that is a lightweight platformer game but is also very expensive for this little effort that has been put in it. Sonic Generations from 2011 is a masterpiece compared to this.",
            "review_score": "-1"
        },
        {
            "review_text": "This game should be fantastic! It's got crazy colourful worlds, a kicking soundtrack, some neat boss concepts and a cool Mario Galaxy/Sonic Xtreme twist to the level design.  But, in true Sonic fashion, the problem lies in the excecution. Sonic's new controls are an unholy mishmash of the previous 3D games with a bunch of Assasin's Creed thrown in, and they are  garbage . Moves fail when they shouldn't, your speed and direction never feel like they match your inputs, that parkour is too sticky whenever it shouldn't be (and vice-versa) and otherwise clever movement tweaks like ice skating, rail grinding and a snowball thing feel even more half-baked. Previous 3D Sonics had some bad,  bad  controls, but they were consistent in their awfulness; they could be  learned . Lost World's inconsistent control mess is almost untameable, and they fail some enjoyable level design.  There's also a plot that could fit on the back of a small napkin, stretched far past the breaking point. Almost every level has a cutscene, and the vast majority of them don't need to exist. The cameo villians have no character (yet demand most of the story's attention) and a bizzare serious tone pervades an otherwise silly adventure. Colours handled its cutscenes and story suprisingly well, Lost World does the near opposite at every turn.  There's a great aesthetic and some fun worlds to run through, but this is ultimately not worth spending your money on. Give it a try if you got a copy in a bundle, otherwise just get Generations, now  there's  a good Sonic game!",
            "review_score": "-1"
        },
        {
            "review_text": "I would say that there definitely are some things about this game that make it really fun, but some things make it super anoying. for example sometimes you can be on a 3d map and get stuck in a place that you physically cant escape from. the controls are meh or slightly better but some platformers sections just make me want to chuck my controller at the wall. In 3d mario when you fall in the lava at least you don't die instantly, but in this game there is a part of it in which the lava randomly appears on the floor and if you arent carefull it instantly kills you. there are some other parts in which you instantly die too and it is soooooooooooo frustrating. what this game comes down to (in my opinion is if you looooooooooooove Sonic games if you do then this will probably be enjoyable, but for those of us that really hate to die instantly after having to memorize the exact way to get past one section i think i wouldn't reccomend this game. Don't get me wrong there are definitely some really cool parts of this game that should be continued in future sonic games, like the cool level looks and feel on many parts. However some of the really difficult platformers/ whatever in which you constantly die just kill the fun of the game. SEGA IF YOU ARE READING THIS PLEASE PLAY SUPER MARIO GALAXY AND SEE WHAT THEY DID TO MAKE THAT GAME GREAT. (also btw the random villan inserts in which they speak durring the level are kind of wierd)",
            "review_score": "-1"
        },
        {
            "review_text": "They added a run button.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "What can I say? Is this the game every 'true' Sonic fan says it is? Is it absoulte garbage and let us just throw it in the trash? God ♥♥♥♥ing no. I will admit there is a huge difficulty curve. I mean huge when it comes to the last world, but nothing you can't overcome. The game is absouletly amazing, and in a way goes back to its roots. This isn't a sonic 06 nor a Sonic Boom, but something many fans love! If you enjoy Sonic this is the game for you, the game that you will love! I ensure that and if you don't just refund, atleast you got to try it! I give this a 8/10 in the simplest sense and something I would recomend to sonic fans.",
            "review_score": "1"
        },
        {
            "review_text": "stable and fun. Kinda feels like an apology for the ♥♥♥♥♥how sonic boom was",
            "review_score": "1"
        },
        {
            "review_text": "I've wanted to play this game for a long time. I didn't care what others said about it that much. Now that I have it, I can tell whether it's good, bad or meh.  On my computer, due to some of its specifications, the game gets pretty laggy, and I've encountered few glitches.  Keyboard controls on games like this one aren't the most comfortable, so I recommend getting an actual controller. Heck, the game tells this to you right as you enter the title screen.  The parkour gimmick in this game requires a bit of getting used to.  Every Sonic The Hedgehog game has great music. Nuff said.  Graphically speaking, this game looks beautiful.  For those who don't know, there are mods for this game.  So overall, I don't think it's a bad game. Make sure your PC can handle it well tho, or else you'll have some ugly framerate issues.",
            "review_score": "1"
        }
    ]
}