{
    "app_id": 329490,
    "name": "Phantom Breaker: Battle Grounds",
    "release_date": "2015-01-23",
    "developer": [
        "MAGES. Inc."
    ],
    "publisher": [
        "Degica"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Online Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Anime",
        "Beat 'em up",
        "Action"
    ],
    "achievements": 46,
    "positive_ratings": 2220,
    "negative_ratings": 425,
    "price": 8.99,
    "description": "Phantom Breaker: Battle Grounds! Enjoy fast and frantic arcade-style beat 'em up gameplay with cute characters. Beat up hordes of weird enemies with awesome special attacks. Local co-op and PVP supported for up to 4 players!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/329490/header.jpg?t=1498185727",
    "minimum_requirements": "OS: Microsoft Windows Vista or newer Processor: Intel Core i3 2.0 GHz or better Memory: 3 GB RAM Graphics: nVidia Geforce 210 or better DirectX: Version 10 Storage: 3 GB available space Sound Card: DirectSound compatible Additional Notes: XBox 360 compatible game controller strongly recommended",
    "recommended_requirements": "Additional Notes:",
    "reviews": [
        {
            "review_text": "Whoever calls this an 8-bit game again will get slapped.  If you cannot tell by the pictures, do not worry, this is a 32-bit retro styled game.  This will bring you back to the great eras of the Arcade/Snes/Sega-Genesis beat-em-ups  If you have played games like Castle Crashers or Scott Pilgrim vs the World (for the consoles), this is highly similar. We are talking about a crossover between beat-em-up and rpg. However this game is a 2 laned beat em up, not a free moving one; so if you have ever played Guardian Heroes then the gameplay is basically like that. Its really cool and well done, and with some friends included, this game can take up a lot of your time. You start out with 4 characters, and you unlock more as you go (I believe 4 more). They are all female except one dude who you unlock all the way at the end, so if you do not like playing as female characters (you sexist ♥♥♥♥♥♥♥s) then this game is not for you.  I am very disappointed that the developers did not decide to implement the online feature such as in the console version (360). So yes, WARNING! THIS IS A LOCAL ONLY GAME. This still does not bring down the game, and I really do hope with the inclusion of the dlc at one point, developers will include online support.  TLDR: Is this game worth a buy? Depends, do you like Castle Crashers? Double Dragon? Final Fight? Anime School Girls with weapons? Then yes.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a beat em up with anime arcade retro style themed, this game is best for you. Phantom Breaker: Battle Grounds is a very fun game where you choose your waifu and beat up  many weird and creepy adults and otakus with your flashy combos.   The Good: Cute colorful characters Very good sprite graphics Sweet 8-bit BGM's Kuristina is here  The bad: Controls are a bit confusing in keyboard (I highly recommend using a controller) No online co-op  I own this game on my psvita and the game My God this is very fun to play and a PC release for it, Wow it woud'nt be much better :) i hope more games like this will come to steam.",
            "review_score": "1"
        },
        {
            "review_text": "Haven't got that much fun in a long time! lots of grinding, nice little brawler , i only wish that we could max everything (skills+stats), big plus for Kurisu!",
            "review_score": "1"
        },
        {
            "review_text": "Worst possible port ever.  Options don't save game freezes on start up unless you skip intro the options menu is so amazingly basic as to not have things like resolution options (seriously?) false advertising for online multiplayer no info for keyboard support unhelpful arbitrary controls manual (this was in the original but it's one of my gripes for it). The ending cutscene and credits even glitches out  It is a fun game once you actually play it (albeit samey in terms of character move sets), but in the garbage state it is in? It is not worth giving the money for the price they demand. Buy it on a 80% sale. Otherwise don't bother until they actually update for your money's worth.  Which by the impression I'm getting by the devs attitude towards this port, isn't a high priority unless the complaints are loud enough as to damage their projected sales.",
            "review_score": "-1"
        },
        {
            "review_text": "After like a year it's finally playable",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun and adorable!   I'm having so much fun even though I'm rather bad at arcade-style games like these. (Seriously, I never got past the second stage of the TMNT Arcade Game for the NES.)   You have a lot of heroines to pick from, they all come with unique weapons and powers. You can level them up, you can skill them, you can unlock new characters, you can pick color themes for your heroines (COLOR THEMES!!!) and I'm completely in love. You can get achievements rather easily and one play-through won't take too much of your time. This way you're able to explore and enjoy your new-found magical girl waifu's strengths and skills.   Bonus points for that one tentacle monster in the Demon Sphere stage.   ",
            "review_score": "1"
        },
        {
            "review_text": "3 ♥♥♥♥ing weeks later and still not even a single patch.  This PC port is just a waste. Black screen of death with Mikoto, 5-10FPS for most that actually got it running, botched controls and NO online multiplayer. It's sad that I was forced to buy the Vita version just to give the game a try. Don't get me wrong, the game is good but I would highly recommend the 360 or Vita version over this ♥♥♥♥♥♥ port any day of the week. The Kurisu DLC pack is also missing which adds her as a playable character and ups the level cap from 50 to 99.   Phantom Breaker Battle Grounds (Steam)= Flushing money down the toilet",
            "review_score": "-1"
        },
        {
            "review_text": "Good beat em up game with online multiplayer support for Co-op or PvP ' w')9 Controller issues has been fixed. Joypad can be easily remaped with x360ce program (32 bit ones).",
            "review_score": "1"
        },
        {
            "review_text": "Can't say how much I love this little indy brawler. Retro art style, side scrolling bashing. And a nice little sotry to boot. When I'm in the mood, I'll have a play through with another character.",
            "review_score": "1"
        },
        {
            "review_text": "Phantom Breaker: Battle Grounds is all of your anime beat-em-up dungeon fighter dreams come to life in a beautifully constructed retro world with matching music to accompany it. The game is incredibly fun and contains several modes to keep you busy. My only gripe with the game is that the pc controls have not been fully realized and are a little awkward (wasd for movement, g, h, and j for light, medium, and heavy attacks, t to change planes, and b for specials), which forces me to break out the dualshock 3 every so often. However, after playing the game for a little bit any gamer will find themselves at home - whether for casual or intense gameplay - playing Phantom Breaker: Battle Grounds.",
            "review_score": "1"
        },
        {
            "review_text": "Fun beat em up game, sadly can't play this iwth my PS4 controller, which makes the character feel the need to walk to the left constantly.  Update this, fix it, give us multiplayer coop for [Steamed] sake.",
            "review_score": "1"
        },
        {
            "review_text": "I'd say it should be 2 bucks less.  It's a neat lil game.  I'm doing Cons first so maybe you'd appreciate the finer points (or just hate it more, idk)  Cons -Needing DLC for max level cap (It's silly and you know it.) -No Online MP or Co-op, Only local -Move list could be a little less of certain button combos having the same attacks. -Controller button icons in the game look odd, since it doesn't adhere to A,B,X,Y which also corresponds with the combo issue. -The scripted parts when the protagonist goes to see the antagonist of the level is set to where you can't collect loot drops from finished enemies unless their bodies are in the direction the protagonist is walking to do the scripted scene.  Pros -The skill tree is able to be reset at any given point from what I have seen. -Even though most of the time you feel as though you are dropping combos, the mix-ups can pick enemies back up fairly easily if you time it right. -parrying -It has a nice art style in the sense it looks polished. -The story is awright-3/5 stars (Only did the one for the greatsword character) -The Greatsword wielding character was fun(see above) -The leveling does not feel as though you are in some grindhouse  My personal Judgement  Get it, if both the base game and DLC are on sale. Otherwise you'd probably hate yourself for paying full price and not getting those oh so important missing features in the cons list. It's a nice little time waster if you just want to take a break and mindlessly slaughter dudes in suits, gyaru girls or floating demon girls that shoot lightning. I'll probably max the characters and never pick this up again, but hey, maybe my interest will not fade so easily. Only time will tell.   Personal note: I would hope this game eventually updates and gives netplay, but I'm not holding my breath.",
            "review_score": "1"
        },
        {
            "review_text": "I ended up mashing buttons for 2 hours straight. This game is freaking awesome. Too bad that I won't be able to fap after this.",
            "review_score": "1"
        },
        {
            "review_text": "I don't think $12 is a fair price for this game. It doesn't really have that much straight content, by which I mean it has challenge modes and stuff but the campaign is really short. Each character doesn't seem that much different than the last since you are more or less mashing buttons.  There's a large amount of reviews already and I'm sure some of those are perfect or well enough, so I'll just say that i recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Although Phantom Breaker: Battle Grounds does lack multiplayer that was intended, I will still recommend this game to those who enjoy anime-based cute, chibi-style, beat 'em up and 8-bit graphic features. To be the first VIta game released worldwide by 5pb, it shows profound imbalanced characters but makes up for the stunning combos and techniques you can perform. All in all, it's a fast and frantic arcade-style gameplay with 8 chibi characters (+1 for extra DLC) to choose from for singleplayer. I would enlist this game onto your Library with a positive recommendation.  - Yuzuha/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game,this girls voice is so hot. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Generally an amazingly fun game, I have really enjoyed it and plan to get all the achievements because im that sad XD. Super fun, recommend to all who like the arcade type of game.",
            "review_score": "1"
        },
        {
            "review_text": "This game would be quite fun if it weren't for the fact that you cant map your buttons on either the keyboard or a controller. You are basiclly stuck with what you get. I hope they add in key mapping at some point the game has great potention and reminds me of when I was younger and played many games like it. I'll be looking forward to updates to see if they fix that and maybe add more stuff i personally havn't gotten very far in the game but thats because of the obvious that i just stated. On a good note the game looks great and has a great sound track.",
            "review_score": "1"
        },
        {
            "review_text": "This game is quick and easy to get into with lots of different characters to choose from. The story is short, but considering it was modeled after arcade style beat-'em-ups, that actually makes a lot of sense. Achievements are easy to pick up for the most part. If you see this game on sale (which is when I bought it), I would pick it up and give it a shot. I don't think it is worth full price of $12 because of how short it is.  The only other thing I can say that takes away from the game is how you can't get all the achievements unless you buy the DLC pack. Seems a bit underhanded to me. Is one character worth half the price of the full game?   I am eagerly awaitng online mode. I forgot this game was even in my library until I saw an announcement that the online mode is being developed. I'm glad to hear this hasn't been abandoned!",
            "review_score": "1"
        },
        {
            "review_text": "I ended up mashing buttons for 2 hours straight. This game is freaking awesome. Too bad that I won't be able to fap after this.",
            "review_score": "1"
        },
        {
            "review_text": "I like retro things, but still this game has limited setting. Fps lock on 60, can't use another native resolution with no problem.  But still love this game, if more setting available I'll love it.",
            "review_score": "1"
        },
        {
            "review_text": "This game would be quite fun if it weren't for the fact that you cant map your buttons on either the keyboard or a controller. You are basiclly stuck with what you get. I hope they add in key mapping at some point the game has great potention and reminds me of when I was younger and played many games like it. I'll be looking forward to updates to see if they fix that and maybe add more stuff i personally havn't gotten very far in the game but thats because of the obvious that i just stated. On a good note the game looks great and has a great sound track.",
            "review_score": "1"
        },
        {
            "review_text": "A nice beat'em up game with spot-on 16-bit visuals and music.  The 4 starting characters are unique and fun to use in their own way. The prologue in story mode is an ingenious way of showing off all of the character's abilities it has to offer before having your powers taken away by the end of the stage. However, you may have a difficult time with the first stage's boss especially at harder difficulties. The controller setting needs some refinement as you can only change 4 buttons as light, meadium, heavy, or special attacks. The pause, line change, and select buttons are fixed. I've yet to figure out how to modify controls for players 2-4. There are no online multiplayer co-op or battle modes but local ones.  The game is overall enjoyable and fun, solo or multiplayer, if you have a controller that works with this game.",
            "review_score": "1"
        },
        {
            "review_text": "How to train your 16-bit waifu by pixar animation",
            "review_score": "1"
        },
        {
            "review_text": "You NEED a controller to play this game! If you do have one and love Beat 'Em Ups, you'll enjoy this game.  There's a combo system and skills that you can use to mix and create fluid combos, making each character a joy to learn; Even if the combination is not infinite you are able to refine it, which will make fights a lot of fun. Of course, if you don't enjoy games that you have to button-mash, then this game is definitely not for you!  The soundtrack goes very well with the pixelated art. There are a few voice actors that are kinda annoying (I'm looking at you Waka) but if you raise the soundtrack and lower the SE you'll find it much more enjoyable.  Overall, it's a great way to spend time if you need to release your stress away! Do buy this game (specially if it's on sale) if the aesthetics appeal to you.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 Fun game but needs a controller. Can play as Makise Kurisu would buy again!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing side scrolling beat-em-up. If you're into anime and what-not, this is the kind of game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Game is really fun to play, just played the first 2 levels and already got hooked to it, easy to play, but at the same time very entertaining",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good beat'em up",
            "review_score": "1"
        },
        {
            "review_text": "Very good and dynamic game,but sadly there is no keyboard support.",
            "review_score": "1"
        },
        {
            "review_text": "It has that sick hype beat'em up feel to it along with awesome 8-bit art and music to correspond. Definitley one of my favorite games in my library. If you enjoyed the Scott Pilgrim game you'll probabaly love this too. 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": " Phantom Breaker: Battle Grounds  is a side-scrolling arcade beat 'em-up with a pixel-art, anime-ish art-style.  I didn't understand the story at all but that wasn't really a reason to stop playing.  The combat relies on three primary attack buttons which execute combos of different strenght and a 'special' button which has several moves based on the direction pressed. Additionally, it is very combo-heavy; you should try to combo all your enemies - especially as a higher combo rewards more experience. There are several more mechanics, one of which allows to prevent being combo'ed to death.  The game itself is relatively short but a has a nice difficulty progression and several difficulties. You will always have a challenge ahead of you.  As of writing this review, the Online-Co-op is in alpha-testing but the local Co-op works well.  And even though I am not one to usually play arcade games or beat 'em-ups, I enjoyed this game very much. So give it a try.  (Especially if it is on sale.) ",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun little brawler. The pixel art is cute and the controls are responsive. It isn't difficult, which may or may not be a negative.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of Scott Pilgrim vs the world streets of rage etc then 100% this game is for you. The only real downside is that Xboxone controller doesn't work well for it. When using Xbox one controller your character continuously jumps. If you don't own a wired xbox360 controller hold off on buying the game until the next update.",
            "review_score": "1"
        },
        {
            "review_text": "Well, look what finally came out with online multiplayer. I guess I could give this a try.  Visually, this looks absolutely amazing. the graphical/sound design is great, it's well done pixel art in beautiful 3D environments. The characters are cute, some of the sound choices are odd (there's a few enemy sounds that are literally just ♥♥♥♥♥♥ a mic). I haven't noticed much in the way of performance issues  The gameplay is... okay. I love how progression works, you go through the difficulties one after another through levelling, that's always neat. combat is fairly fluid and varied, but heavily flawed. They could have done with a little less stunlock in this title, and there is virtually no reason to not just spam your special move, which can be used infinitely, forever. The difference in difficulty between stages and bosses is massive, which makes for a fairly boring experience.  Do I recommend this game? ehh kinda. Get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This is a perfect example of a quality game in this title you will find one of the main characters 'Yuzuha Fujibayashi' she is all you will ever need in lyf i would even go so far as to say she is my Fujibaeashi. 10/10 Will be sure to buy all merchandise of her again (that isn't a lot sob sob) :pbbg_yuzuha:",
            "review_score": "1"
        },
        {
            "review_text": "overall that is good game, I hope dev could make it online also we wanna set the control keys by personally",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. It reminds me of Turtles in Time on SNES. I also purchased the Kurisu DLC. That character is so much fun. There are many characters and each has its own playstyle, so each character plays totally different.  At the beginning I died several times at the bosses on easy, and I thought WTF are you kidding me!? They do a 20 hit combo and I can't do anything, and this is on easy, so WTF, it is EASY, am I so bad??? Yes I was :P Just play and you get better and understand how it works. It is easy to understand :)  So far. God job, great game, I like it.",
            "review_score": "1"
        },
        {
            "review_text": "nice little beat em up game. not much to it besides that.",
            "review_score": "1"
        },
        {
            "review_text": "I got given this game in a bundle from humblebundle. I had wanted the bundle specifically for this game however after playing it I felt filled with regret.  Pros: - Nice soundtrack.  - Combos are easy to do when you button mash - Decent story line  Cons: - The buttons are very difficult to understand. At one point I needed to press 1, and found it wouldnt do what I wanted to until I pressed 2 - The game itself is difficult to understand, and while it has a decent storyline, it can be hard to follow, leaving you in the dark - The game's characters speak in Japanese, and the subtitles are in English.   I've heard rumor that this was a psp port, and it shows. Rather than being formatted to fit better with a pc style, it instead forces itself oddly into the pc world, not taking into account playability.  As such, I would not recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "like the concept but if you dont have a controller suggest dont buy",
            "review_score": "-1"
        },
        {
            "review_text": "Let me be open about this, my fetishes mainly consist of beating the snot out of legions of ganguro girls, fat asian men, mutant ♥♥♥♥♥ monsters, robots and other enemy types along those lines and training my 16-bit waifu to be a murder machine and I'm sure most of the community that plays this shares those kinky desires.   This game combines both of those fetishes.  It's hard to type out full paragraphs with one hand so I'll just list the pros and cons I've found.  -PROS- Beginner-friendly Fast-paced, good unless you get motion sick easily in which case you should stick with *pfft* Sonic Boom Most of the characters are fun imo Nearly fully voice-acted Many difficulty levels because you know I like to see my 16-bit waifus get knocked up ( ͡° ͜ʖ ͡°) Unique weapons(?) like a bullet hammer or whatever the Christ L/M uses You get to make a little anime girl wreck an otaku-looking guy m̶o̶r̶e̶s̶h̶i̶t̶i̶c̶a̶n̶'̶t̶r̶e̶m̶e̶m̶b̶e̶r̶  -CONS- I hear there are a few glitches in the game but I haven't really encountered any. Hearing your lil' waifu screaming for hours on end makes you start to question your life choices Story isn't diverse. All the stages and their orders are the same (with the exception of voice-overs) Speaking of the story-mode, only the starting 4 characters get cutscenes The second boss spams like nobody's business, put that thing on a leash  9/11 this game sucks, I recommend playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Rage of the waifu simulator 2015  11/10 beatdown too stronk",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty ok.",
            "review_score": "1"
        },
        {
            "review_text": "Y'all remember Guardian Heroes and how you wanted to play as that one female with a sword? Well in this game you can play as four different animu chicks including that one from Steins;Gate* who everyone loves. Annoying chiptune OST aside the combat is pretty basic but satisfying, some grinding may be necessary for an easier time with combat if you're not good at it. Would recommend if it was on sale for some mild weeaboo fun.     *£3.99 individual purchase. Pay up if you want that guest character.",
            "review_score": "1"
        },
        {
            "review_text": "Rukako apears in this game.  I'll just let that sink in for a moment there...  Other than that, Casual game, p chill.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun.  The combat is exciting, relatively fresh and greatly reminds me of one of my favorite Sega Saturn games, Guardian Heroes. The story is typical Japanese 'I don't understand', and sadly it doesn't help that this is a spinoff of a game that's not very well known outside of JP. ",
            "review_score": "1"
        },
        {
            "review_text": "A nice beat 'em up game in anime style. This game offers a story mode, arcade mode, VS mode and coop mode.   It has even a powerup bar where you can use stronger skills which reminds me of Street Fighter. The filesize of this game is suprisingly big: 2.5 GB for the animations and special effects. Don't know why this game has only female chars but I don't mind it. The combosystem is not hard to learn but it takes time to master it. You will get level ups and can use the skills points to unlock more skills or you can upgrade your stats which boost the replayability a bit.   Good",
            "review_score": "1"
        },
        {
            "review_text": "Top Tier Waifus 10/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10 has anime gurls  Would wank again.",
            "review_score": "1"
        },
        {
            "review_text": "While it looks good I can't say it's preferred. The game won't start and instead seems to get stuck on a black screen with audio playing. If you have Windows 10 it's just a waste of time and money buying it.",
            "review_score": "-1"
        },
        {
            "review_text": "Beat `em up with a great pace and switching between foreground and background wasn't annoying as I was expecting! The level up and skill tree system are a nice touch.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game as 8bit IM LOVING IT &lt;3 the online needs a littlebit changes i hate the split screen thing when you playing in online but after all ITS AWESOME GET THIS FREAKING GAME &lt;3333 :)",
            "review_score": "1"
        },
        {
            "review_text": "awesome sound effects :)",
            "review_score": "1"
        },
        {
            "review_text": "I would not recommend this game. The gamepad issues make the game more or less unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "No online, no peace.   We were supposed to get online back in the summer of 2015, it is 2016 and I still don't have any online, the vita version has online for pete's sake and that's the console that generally most people ignore. I purchased this game for the online, this is false advertisement!",
            "review_score": "-1"
        },
        {
            "review_text": "It's no Guardian Heroes, but if you can grab it for cheap... well, it still won't be Guardian Heroes. But that's ok sometimes.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game, the combo system is to die for. Those of you with fighting game experience will instantly understand what is going on within these mechanics. The rest of you will mash buttons and never see the hype packaged in this game. I haven't even owned this game for a whole day yet and my Mikoto is already level 99. This game is fun as hell and pretty challenging too. When online versus and online co-op is added this summer, it will be even better. Get it!",
            "review_score": "1"
        },
        {
            "review_text": "Do you like Beat'em ups? the likes of Final Fight and Streets of Rage? do you like Mahou Shoujo girls and over the top attacks? if yes this game is for you!  just be sure to you have a controller, because the keyboard controls are not good and you can't rebind the keys.  PS: beware that the game is LOCAL ONLY! no online multiplayer, although it seems the devs are thinking about puting internet multiplayer into it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great throwback to beatemups like Streets of Rage and Scott Pilgrim vs. The World, only with skill trees. And waifus. Many, many waifus.   8/10 Would be perfect if the controller support actually worked with this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great throwback to beatemups like Streets of Rage and Scott Pilgrim vs. The World, only with skill trees. And waifus. Many, many waifus.   8/10 Would be perfect if the controller support actually worked with this game.",
            "review_score": "1"
        },
        {
            "review_text": "The game itself is cheap but all the body pillows of the characters I bought weren't",
            "review_score": "1"
        },
        {
            "review_text": "It's a very good I had fun playing with friends but when I played online it was so buggy but I'm sure they fixed all the problems by now I recommend this game to people who can play with friends",
            "review_score": "1"
        },
        {
            "review_text": "Cant even start the game with keyboard/mouse   11/10 - My mom",
            "review_score": "1"
        },
        {
            "review_text": "Looks like it could be fun...too bad I mistook 'partial controller support' for 'do not play this with keyboard!'. You want the controls? WASD for movement...this is the only part that makes sense. GHJ for light, medium, heavy attacks. B and T for your special attacks. Y to switch lane. I and U are also apparently something, but honestly, I gave up trying to learn these unrebindable controls.",
            "review_score": "-1"
        },
        {
            "review_text": "Missing the online multiplayer component in other versions, local multiplayer is also completely broken as the game seems to absolutely hate multiple controllers",
            "review_score": "-1"
        },
        {
            "review_text": "Not much depth, and a story that is uncomprehensible to anyone ignorant of Phantom Breaker hedged my enjoyment.   A co-op mode that for some reason turns off all the story feels tacked on and unfortunately even more shallow.   I enjoy beat 'em ups. I wish I enjoyed this one more.",
            "review_score": "-1"
        },
        {
            "review_text": "Would I recommend this game on its original platform? Yes, yes I would. From what I've been able to play on the pc version I think this game could be rediculously fun. But here is where the game fails; it is a terrible port and for the many issues it has I have seen no fixes or news as to how further development has come along. I have no idea what sort of situation this studio is going through at the moment but that's no excuse to release a terrible port. Sure, you can say that I should get over and just use the wonky keyboard set up and get off my high horse. However, this was to my knowledge a console game, so, playing with a controller, any controller other than an xbox 360 one should be relatively problem free. Should be is the key word because it isn't. I'm either constantly jumping or walking left continuously. It's a dirt cheap game but I am still absolutely disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "Really can't recommend a game that is unplayable without using a third party program to fix the awful gamepad support.  Comparisons:  Xbox : X/A/B/Y Logitech: 1/2/3/4 The game: 4/3/1/2  The Xbox is just an example of where the buttons are, the Logitech is what I'm attempting to play with and the Game is what Phantom Breakers says is being pressed. While there is a way in game to change what button does what attack that's it. There is not a single way to actually remap the buttons themselves in game and literally all of my gametime is from attempting to fix it and not actual gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "why the ♥♥♥♥ this game have framerate issues is this cryengine engine?",
            "review_score": "-1"
        },
        {
            "review_text": "I think most people will not be satisfied with this game. I do enjoy it, but it has some severe problems:  - Tutorial is only in text form. This makes figuring some things out a bit more tricky, since you don't know if you did it right. Especially since I have not once been able to pull off one of those ultra moves you see in the trailer. I think I can only unlock them once I unlocked the Phantom Breaker. Which leads me to the next problem. - You have to unlock all the skills, from double jumps to special skills to the Phantom Breaker, which is the highest skill you can achieve. You achieve skills by level up through collecting gems which will be dropped by enemies. This seems okay, but I'd like to have the option to try out all the moves of a char before I decide to put a few hours into maxing it out. - The balance is completely off for at least one character, which is the girl with the cat ears and the claw. She is too overpowered, since her forward special will take out almost any normal enemy. I have spammed my way like this through to the last stage without any problems on hardcore difficulty, while being able to collect most of the gems and points since this makes her go a decent distance, so already now she is a higher level than the other girl with the sword who I used to play through normal. Maybe I get more levels due to the difficulty, that's also a possibility. There is a bonus stage in the train where you can smash a lot of eggs for bonus points and EXP. Due to that specific move it was easy getting everything in there. - No rebindable controls, and an annoying way of prompting inputs. By that I mean, the game does clearly show an X-Box 360 Controller in the settings, but the buttons are not A,B,X,Y, but 1,2,3,4, and not even in the same order. This seems like a lazy thing to do, especially since you can't rebind keys. If you play with keyboard, good luck figuring out the keys. There's a 'guide' on Steam which shows them. - Sometimes enemies will put you in a stunlock, since you're vulnerable the instant you recover from an attack. Maybe I just missed something, but I've had some trouble with that. - I think there's a story in there somewhere, but I'm not completely sure. - The story mode is rather short. If you're no completionist, playing through it once or twice will probably be enough for most players.  But there are also things I like: - The overall style of the game is neat, from graphics to sound. It all looks and sounds polished, the soundtrack is perfect for the game, the animations look smooth, and the chibi style is just too adorable! The characters each have their own unique look and abilities. Voice acting is standard anime quality; not bad, but not anything special either. - The enemies can be quite challenging when it comes to bosses on higher difficulties, but it's never unfair (except when said stunlock occurs). - It has a borderless fullscreen mode. - I can see some speedrun potential there. - Rule 34 may approve of this game.  I have not tried out coop. I imagine that will also put some more fun into that.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun, but can be boring after a while.",
            "review_score": "1"
        },
        {
            "review_text": "If only the online was better... without disconnecting...bugs...controller issues... sad",
            "review_score": "-1"
        },
        {
            "review_text": "While I am glad that this game got a PC port, Buy the SAME game on Xbox 360, for the SAME price the difference being, It has Online Multiplayer. People in this day and age don't go over to other people houses and play a game, they used Multiplayer to fill that void.   Moral of the Story: Same game, Same Price, No Multiplayer.  EDIT: They added multiplayer but its in beta and no one plays it so after ALL this crap we went through we still get gipped in the end.",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game , cute , lovely , anime....  yes I love it",
            "review_score": "1"
        },
        {
            "review_text": "Controller support is hilariously broken. With a madcatz fightstick/pad none of the directions work in the menus and once you start the game the character just jumps in the air repeatedly without any input on the stick.   There are reports of this problem on the forums in January 2015 so I doubt it will ever get fixed.  My normal XBox One controller works fine.",
            "review_score": "-1"
        },
        {
            "review_text": "Thought it was good.... It wasn't. ♥♥♥♥♥♥ controls ruined the game and the fact that it's only local Co-op. Refunded, 2.99 is still not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Thought it was good.... It wasn't. ♥♥♥♥♥♥ controls ruined the game and the fact that it's only local Co-op. Refunded, 2.99 is still not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy it until its fixed cant even star tthe game just freezes on a black screen with a character on it.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game, but I can't recommend it.  Quad Core AMD FX-4100 4.3 GHZ GTX 960 8 Gigs DDR3  15 fps. It's completely unplayable.   Edit: Disable Steam over-lay Opt into No_DLC beta fixed the framerate issue mostly. Still happens 50% of the time when starting up.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a little dissapointed, This game is a fun beat em up, the rest of the game is a big ehh... -_- for me. The Story is an Ehh. The soundtrack ehh... and come to think of it the game had me Spamming the same buttons at some point just so I could stay alive thanks to the millions of ♥♥♥♥ the game throws at me later on. I played the story mode once I wanted to do it again but I just couldn't. After that I searched for the multiplayer feature, to my surprise there was no Multiplayer for PC and don't try local splitscreen or whatever cause the binds take up like 80% of my keyboard. Anyway I totally would have spent more time on this game if there was an onlne feature but there sadly is not one yet. This game in its current state which is to be honest a decent state, aside from bad controls and no Online Multiplay gets a good 6/10 in my book But since I purchased this for like 1$ I feel a little better about how I manage money. This game would be 7/10 if there was Multiplay and it could even have been 8/10 if the story was somewhat improved. Just a little side note this game is not worth 12$ I did not have that much fun with the game, if you want this game add it to your wishlist and wait for a sale.  Next time Digica &amp; Mages finish your game ; )",
            "review_score": "-1"
        },
        {
            "review_text": "a great game pretty short but for this price it's worth it   game also includes   independent waifu's who need no man    ",
            "review_score": "1"
        },
        {
            "review_text": "I love this game and when I heard that it was came to the PC I was the first to countdown the days until it's release. I was egstatic to play with my firneds who didn't buy it for Xbox 360. The game is amazing and fun, YET this portt is false advertisment as it has no online co-op that the develpoers said would be in it. Co-op was the main reason that the game was fun. It was never in the PC port to begin with and felt as if the port was stripped of everything fun. Since its release in January the Devlepoer have said that they will incorprate Co-op. After backlash they told customers that co-op would be available in summer 2015. It is October 2015 and still no co-op and the developers should be held for the false advertisment on the store page and no co-op when the game released. Spread the word and voice your opinons against the Developers. I can't express how dissapointed I am at the games release.",
            "review_score": "-1"
        },
        {
            "review_text": "Been waiting for multiplayer for 9 whole months and not a update on it beyond the devs admitting they're focusing on the PS4 version.   Hell even the 360 AND Vita versions of the game have some form of Online!",
            "review_score": "-1"
        },
        {
            "review_text": "This game has a wonderful beat em up style that never grows old no matter how much you play, and its co-op if you have a controler for players 2-4! It was worth the pay.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a wonderful beat em up style that never grows old no matter how much you play, and its co-op if you have a controler for players 2-4! It was worth the pay.",
            "review_score": "1"
        },
        {
            "review_text": "Well since i almost 100% this time to review . Its you basic side scroller beat em up with not much to say really other then it has rpg elements animation and ost is good. the story is nothing to write to home about but its there. Once you beat the game once you can skip it.   Theres only 7 stages so it is not a long game.. they want you to play the different difficulties so i would. Just be ready for a challange. Multiplayer is coming soon as im typing this it is not implemented yet i hear they are ironing out bugs.",
            "review_score": "1"
        },
        {
            "review_text": "Ayyye, I've played this game enough to know that it's a pretty darn good arcade beat em up. Like every game it does start to lack in fun after some time, but you do come back to flail your damn swords towards everything in your path.  But sadly the worst part of the game would have to be.... Want to be lvl 99? BUY CONTENT PACK... I NEED TO SPEND MORE MONEY JUST TO BE LVL 99? INSTEAD OF 50? K...Uhm, No?",
            "review_score": "1"
        },
        {
            "review_text": "Fun game if you need to kill some time =)   It had everything I expect from a button mash game, the menu was a bit awkward at first but got used to how it worked fairly quickly.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game during the summer sale for $3.00 because why not. I played the local co-op with my girlfriend and had just 2 hours of fantastic beat'em up madness.  The comboing was fantastic and there's a decent blocking/counter system. The leveling system is interesting and allows you to freely do a complete respec of your character whenever you want.  The controls are a bit finicky in the sense that you don't know what they are. It's WASD and G H J for light, medium, and heavy with a few more keys sprinkled about. It took a about 10 minutes to figure out how to set the keys with my Logitech Controller. Apparently it needed me to press both triggers and both shoulders just so I can set the controls for player 2.  Overall, if you can get the controls set up they feel great and the gameplay is pretty good too. There's 3 more difficulty modes and a vs mode I have yet to play because we just finished the Normal mode and that by itself was well worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "This game really brings back some childhood memories so if you ever played something like Streets of Rage but tought that it could be more fast paced then this is the game for you. the art design is wonderfull and they did a great job at some of the 3-D backgrounds. (unfinished review)",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly good! Expected Double Dragon but with waifu material and got a solid 2-lane beat 'em up with waifu material. Might not be a Lobster-And-Wine dinner but a Chicken Rotisserie sided with Mashed Potato. Pretty dang good.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little beat'em up with cute graphics and nice soundtracks.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. The first boss absolutely destroyed us but had plenty of fun playing on the couch with friends once we all figured out how to beat her. Hooked on levelling right now.",
            "review_score": "1"
        },
        {
            "review_text": "4 female characters to play with... level up and spend the skill points to suit your style... best played with friends...",
            "review_score": "1"
        },
        {
            "review_text": "What else to review about this game?  Kemomimi - Check Kurisu - Check Free Kemomimi DLC for current users - Check (Ey its cheap either way!) Multiplayer - Check (Been waiting for a long time for this.)  Just be ready for some good 'ol 2D Platform fun! The comedy is incredibly good too.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a wonderful beat em up style that never grows old no matter how much you play, and its co-op if you have a controler for players 2-4! It was worth the pay.",
            "review_score": "1"
        },
        {
            "review_text": "Oh Damn, they finally added online multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "One of the most awesome brawler games I've ever played. So much fun!! Getting friends in the house for PvP battling or coop is sooo awesome.  In depth combat system, sick cancels, extreme pwnage, cute art style, kawaii bosses that will wreck you, extended skill tree, lots of characters, great amount of playstyle variation and exploration.  Edit: My review was originally negative for devs promising online multiplayer and not implementing it for over a year. But they finally delivered! So now this game is everything it needs to be!",
            "review_score": "1"
        },
        {
            "review_text": "Originally bought it to accompany my friend to play this as I bought it for him during the sales.  Totally got caught into its intense brawl, anime-style drawing. Got into the beta Network play with my friend, it got even more crazier.   Haven't got to the point where I am able to throw out combo accurately, but it was really fun just smashing out enemies with my friends. (My friend drag his friend into it as well LOL!! )  Things to note: Music are of the Mario type OST Drawings are cute and anime-style. 4 chars + 1 DLC char(this is a char from Steins;Gate) Chars can be leveled up, increase stats, learn skills from skill tree. Platformer style, moving left to right, and also dual lanes to fight. Controls can get hard to configure. There is a guide in this game's community site that tells you the default buttons. Hack and Slash, basically.   If you are up for the above, get this game by all means.",
            "review_score": "1"
        },
        {
            "review_text": "The online network is bugged. Sometimes, in about half an hour, the game will auto-kick me out of the Network, and quits the game! I know this online gamemode is NEW. But, it looks like there needs to be more bug fixes and issues. Also, there needs to be a chat system when going online. Also Your DLCs are too expensive for something so little. A character is already 5.99, FOR 1 character.",
            "review_score": "1"
        }
    ]
}