{
    "app_id": 329770,
    "name": "4089: Ghost Within",
    "release_date": "2015-01-09",
    "developer": [
        "Phr00t's Software"
    ],
    "publisher": [
        "Phr00t's Software"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "VR Support",
        "Partial Controller Support",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "RPG",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 57,
    "negative_ratings": 35,
    "price": 4.79,
    "description": "Sneak &amp; battle your way through a procedurally generated mothership in this stealth action RPG! Supports user content &amp; the Oculus Rift!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/329770/header.jpg?t=1447364383",
    "minimum_requirements": "OS: Windows 7+ Processor: Dual-core Memory: 1 GB RAM Graphics: Dedicated 3D acceleration (Intel HD etc. not supported) DirectX: Version 9.0 Storage: 200 MB available space Sound Card: OpenAL supported Additional Notes: Java 8 required (Java 7 might work, though)",
    "recommended_requirements": "OS: Windows 7+ Processor: Quad-core Memory: 2 GB RAM Graphics: NVIDIA or ATI (Intel HD etc. not supported) DirectX: Version 9.0 Storage: 200 MB available space Sound Card: Open AL supported Additional Notes: Java 8 required (Java 7 might work, though)",
    "reviews": [
        {
            "review_text": "The latest offering from Phr00t, 4089 has the player take control of an infiltration droid, sent to investigate a cube-shaped mothership that has begun orbiting the planet featured in 3079.  Gameplay involves investigating rooms for recharges, weapons, and other items, while dealing with various robots that serve as the ships defenses; these enemies may be destroyed or avoided as per your play style. There are skills the player character has relating to elements such as health, damage, energy, as well as skills for stealth, hacking, and construction tasks. These skills can be increased by collecting a particular type of consumable; each one provides an extra point that can be assigned to any of the available skills.  Difficulty is relatively high, although the player can choose whether to play in 'Challange' mode (Perma-death) or 'Adventure' mode (infinite lives, but lose a random skill point upon death). Enemies are fairly accurate, so dodging is a highly valued tactic; a quick-dodge can be obtained with enough skill points in Agility.  Pros: *Immediate action *Rogue-like difficulty; enemies and hackable devices do not scale to your level of power *Adjacent rooms can be on any side of any room (top &amp; bottom included), creating a 3-dimensional network *diversity of combat skills include creating decoys, phasing (time-warp dodging), and sticking to walls  Cons: *Music is good, but due to the pace of the game, it becomes repetitive *Jumping is over-simplified; jump height can not be controlled (as was an option in 3089) *Traversing the seams between rooms (doorways included) cause the player character to slow down (due to the angle being so acute)  ***The issue with the room seams can be solved by reintroducing the variable jump, or by flattening the angle of the seam edge.  NOTE: Be sure to read the information on the store page; 4089 is  not  meant to be an open-world experience like 3089 is. Also, the player character in 4089 is a robot designed for infiltration, where-as the player character in 3089 is an experimental  combat  robot; this is why the weapons system in 4089 is simplified when compared to 3089's.",
            "review_score": "1"
        },
        {
            "review_text": " What to expect  A procedurally generated FPS. Picking up yellow crystals will give you attributepoints, adding some RPG to the mix. Both the artstyle and the music has some rough edges, which makes it a very authentic experience. Check out the Steam Discussion pages for custom content by the community.   Plus     High replay value    Short games    Customisation options if you're willing to learn some Java,    Minus     Harsh changes in music when going from rest to action, and vice versa    Very hard lategame  ",
            "review_score": "1"
        },
        {
            "review_text": "4089 is quite a diffrent game from the prevouis games  its up to you to decided if that is bad for you this is a very distilled game, it does away with the open world, quests, large Inventories instead giving you three weapon slots, skills are based on pick ups instead it rewarding by killing or obejctives instead playing how you want to play as in if you want to sneak, if you want to fight, ect, and does have a perma death challange mode it is a challenging game and sometimes you can't win with your current stratagies and tatics instread of a randomly generated world that could hicup and produce some weird things (merging buldings, moutian buldings, trees in buildings, trees forming together, buildings with only one type of vender koisks but have five of them) instead uses hand crafted rooms (soon the Playerbase of 4089 can make) to shape the world  again its quite diffrent so does that make it bad? no it doesn't",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice Roguelike - FPS - Building mashup. Has a great deal of depth with your builds whether you want to go from full on destroyer of worlds mode with everything into health and damage to patient assassin builds with tons of stealth to the engineering tech savant and place blocks to keep from getting punished. It's very difficult for me, but I'm not the best FPS player so it may just be my lack of skill. I haven't found a secret room yet, but I know they are there, which is always a nice bonus. The graphics are going to be a turnoff for some, it's just how it goes in today's world of AAA releases with trash gameplay. Seems to have a bit of social commentary with the Ship's dialogue.   A quick note, the developer has already patched in mouse look sensitivity so he's clearly on top of things. A very big positive   The Quick Rundown -   Style - Roguelike FPS RPG   The Good Stuff   Gameplay - Has depth with character builds, allows for multiple styles of play. It's very hard for me so I am going to rate the challenge at just right for FPS players. ++  Replayability - It's a procedurally generated roguelike, so if you feel the need I'm sure you could put over 100 hours into it. ++  Story - Social commentary on the manipulation of humanity through fear and hatred. + (though some may not like it)  The Bad Stuff  Graphics - People are going to be turned off by them. They are functional, but don't seem very aesthetically pleasing. -  Sound - Again not too great. -  Overall Value - Well worth the cost of ownership. +++",
            "review_score": "1"
        },
        {
            "review_text": "i love the game, reminds me of some of the old school games except with better graphics. really fun and challenging. if you are having problems with the game starting up, visit the forums, the developer (Phr00t) is on the forums and is awesome and really helps you",
            "review_score": "1"
        },
        {
            "review_text": "This game is not exactly what i have expected. It is a great game and all, but i thought that it would have a few more similarities to previous games like 3079 and 3089, perhaps it would be better, The gameplay overall is fairly fun, it is a true fps roguelike. the only real bad things is that the respawning is random, and there is no minimap, so you can get lost easily.",
            "review_score": "1"
        },
        {
            "review_text": "i love the jumping in this game it is flued and fun to jump around and it has a lot of potental with more options but i love it already",
            "review_score": "1"
        },
        {
            "review_text": "I'm not keen on giving this game a negative review, because there's so much love poured into it! 4089 has heaps to offer, and that's why I made the purchase.  However, actually playing the game just doesn't  feel  good to me. The movement and shooting are essentially what makes a FPS enjoyable to my taste, and 4089 has a stiff, plastic quality that tars the experience.  Additionally, I realized I don't care for RPG elements in games. I thought this title would help me ease into the idea, but I can't help but wonder, 'At what point will my stats make this game fun?'.  I gave 4089 a few hours of play, but there was no breakthrough for me. I'm glad I tried, though!",
            "review_score": "-1"
        }
    ]
}