{
    "app_id": 329860,
    "name": "Catlateral Damage",
    "release_date": "2015-05-27",
    "developer": [
        "Chris Chung",
        "Fire Hose Games"
    ],
    "publisher": [
        "Chris Chung"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Cats",
        "Indie"
    ],
    "achievements": 34,
    "positive_ratings": 858,
    "negative_ratings": 98,
    "price": 6.99,
    "description": "Catlateral Damage is a first-person destructive cat simulator where you play as a cat on a rampage, knocking as much stuff onto the ground as possible.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/329860/header.jpg?t=1496773493",
    "minimum_requirements": "OS: Windows XP Processor: 2.0 GHz Memory: 2 GB RAM Graphics: NVIDIA GeForce 8600 GT Storage: 1 GB available space Additional Notes: Epilepsy warning: Some in-game effects may be problematic for some players. These can be disabled under the “Audio/Visual” tab of the “Options” menu on the title screen.",
    "recommended_requirements": "OS: Windows 7 Processor: 3.0 GHz or better Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 650 Ti or better Storage: 1 GB available space Additional Notes: Epilepsy warning: Some in-game effects may be problematic for some players. These can be disabled under the “Audio/Visual” tab of the “Options” menu on the title screen.",
    "reviews": [
        {
            "review_text": "   Catlateral Damage Review  ",
            "review_score": "1"
        },
        {
            "review_text": "You can unlock a cat that only farts instead of meowing.",
            "review_score": "1"
        },
        {
            "review_text": "I dig this game. It's not overly complex, it's just what it says on the tin. An arcade-ish destruction simulator.  Objective mode isn't terribly hard, but the time crunch does add a gentle challenge.  Litterbox mode is just a nice relaxing 'I'm gonna break stuff' game. No pressure, just smashing crap and blowing off steam.  The cartoony look is a good choice; between your slightly odd perspective and quick movement, any complicated textures could induce motion sickness, IMO.   I will warn you, though, if you have any epilepsy//seizure issues, this game has a couple of visual modes that will be super rough. Disco+Catnip is  particularly brutal. ",
            "review_score": "1"
        },
        {
            "review_text": "I can finally unroll the toilet paper without having to explain myself.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is exactly what it sounds like. Main objective: knock every single thing in site on the floor. Super adorable and easy going. Good time waster.",
            "review_score": "1"
        },
        {
            "review_text": "I was playing normal levels and enjoying myself knocking all sorts of things over until I unlocked a Christmas room with tons of knick knacks and presents and ornaments as far as my kitty eyes could see. It was an immediate rush of excitement and thoughts of what to knock over first.   It is then that I realized that I now know what it is like to be a cat. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun. Now I know why my Shadow feels the need to stand on the counter and swipe things off while I try to clean it. Best enjoyed with a gamepad/controller.",
            "review_score": "1"
        },
        {
            "review_text": "Simple, relaxing game with cats and a good Soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "game is extremely boring and empty. no where near worth the pricetag",
            "review_score": "-1"
        },
        {
            "review_text": "Even though the trailer seems ridiculous. It is very close to the truth. It's so different from just shooting bad guys. You can be the villain for one time! But in a innocent way.. or is it?",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, perfect for cat lovers that want to be a kitty or cat haters that want to prove that cats are jerks. The POV is kinda hard to adapt to and I don't recommend it if you get motion sickness. I can only play for about 15 minutes before I start getting sick. Fun for those 15 minutes though",
            "review_score": "1"
        },
        {
            "review_text": "Well, I only just started on this, as I bought it just a short time ago at random. But I very much enjoyed what I've played of it so far, so I figured I may as well do a quick review post.   If you dont get the drift by looking at the store page or the trailer (how could you NOT get the idea of what it's like by looking at that trailer?), you play as a cat, albeit one who is missing a few screws... well... missing more screws than, ahem, 'normal' cats are missing anyway (as if cats are ever normal.... not in my experience!)... and one who is very clearly bored, as this cat has decided to SWAT ALL THE THINGS.   Which is pretty much what you're doing; in each level, you're simply given a number of objects to knock over, and a time limit in which to do this. Fail to clear that number, and it's game over, as you'd expect. You're also given some specific objects to find that can give a bonus, and some that are worth extra in that particular level; the game will point these out to you each time, so make a note of that and keep an eye out for the thing.   Everything of course is all filled with physics, which means that stuff is just going to go bouncing all over the place, exactly as you'd expect. It's worth noting though that the objects have to hit the FLOOR to count; if they land on another piece of furniture, they dont do anything for you. The game makes it pretty obvious when things have properly connected with the floor.  Much of the game uses procedural generation, so you cant just automatically head into a level and already know where the highest scoring spots are; that wouldnt be very interesting and I'm glad the devs didnt do that. There are also random 'events' that might happen. You never know just what these might be. They could help you, or just confuse. You'll be running around, like 'Oh hey, here's another book shelf, time to swat these books, swat swat swat, hahaha, swat swat swa- OH GOD DISCO WTF?!?' and there'll only be confusion remaining. Or maybe the power in the house will go out. Or perhaps you're told to go catch a mouse, and if you do so, you'll get a free upgrade item or even something else. Upgrades are gotten usually by smacking around certain specific cat-related objects (like scratching posts) and will increase an attribute for your cat, like jumping or speed or whatever. So you definitely want those.  There are also bonus levels that can be found in each of the main levels (4 main levels in one run), there's a 'litterbox' mode where there's no objectives or anything and you just smack things around at your own pace, and about a bazillion cat (and dog?) photos to unlock, and who doesnt like those? Sad, irritating little jerks, that's who doesnt like those. There's alot of achievements to get, and many playable cats to unlock as well.   Overall, it's a very arcade-y game, since it's fast paced and scoring points is the entire, well, point of it, and it seriously feels ALOT like Katamari, actually; if you liked that series, this is definitely one to try. Not exactly a difficult game, but as with most score-focused games, the challenge comes from scoring high; not 'beating' the game.  I look forward to playing this quite a bit, it's definitely my sort of thing.  But for now, my arm hurts like heck from clicking the blasted mouse so much. Had to do it though. Those books wont launch themselves accross the room, after all.",
            "review_score": "1"
        },
        {
            "review_text": "I finally understand why my cat is such an ♥♥♥♥♥♥♥.  10/10 GOTY",
            "review_score": "1"
        },
        {
            "review_text": "Be the cat!   This 'Goat Simulator-esque' game takes a fun twist with the already familiar formula that Goat Simulator brought to the 'sim' scene and gives you the option to be one of many cats. It's a crazy cat person's cat paradise! Everything, and I literally mean EVERYTHING, has 'cat puns' written all over it (read the name of the game!). So if you hate cat puns that have cringe potential, this game is not for you. However, if you can get past that and actually play the game, you'll find it's a similarly enjoyable experience to Goat Simulator.  In short: Catlateral Damage = Goat Simulator for crazy cat people (but it's surprisingly fun!)   Get it for the beloved crazy cat person in your life, they'll love it!",
            "review_score": "1"
        },
        {
            "review_text": "Its a cat simulator! Basically you choose a variety of cats (some you unlock via achievements) and you destroy places by knocking them down! :D    There's a Museum level where you can knock down a T-Rex skeleton and watch it crumble! &gt;:D     What would make it better, is if it was multiplayer! Imagine four cats causing rampage! &gt;:D",
            "review_score": "1"
        },
        {
            "review_text": "What else can I say? Be a cat, knock stuff over. Become the ultimate annoyance and revenge being! Finally feel what your cats do themselves and bathe in the overwhelming joy breaking things gives. The gameplay is easy to understand and quickly catches on. It may seem repeatitive, but you have challenges and all new stages to explore.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with good art, lots of unlockables and plenty of stages! Worth it, especially on sale.",
            "review_score": "1"
        },
        {
            "review_text": "da kitty meowz as he ♥♥♥♥s up my house",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. I love to cat. I need to cat.  I are cat now forever 10/10 :D  No but seriously this game is stupidly addictive and I highly recommend it",
            "review_score": "1"
        },
        {
            "review_text": "This is the first game I've bought purely because of its trailer. It's a great game for letting off steam after rage-quitting something like Elite Dangerous.  Highly recommended, although the scene in the strip club seems a bit out of place?",
            "review_score": "1"
        },
        {
            "review_text": "This game is the most fun I've had in a long time. Everyone must play it!  Would knock TV on floor again.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Download game &gt;Play tutorial for free achievement &gt;Begin Objective mode &gt;Start knocking sh*t over &gt;Break stuff and make everything in the house my b*tch &gt;Get messed up on catnip &gt;Power goes out a couple times &gt;Kill a few mice &gt;Random Disco parties start &gt;Knock over sh*t at a dinosaur museum &gt;Cause millions of dollars worth of damage  10/10 Would Support Domestic destruction",
            "review_score": "1"
        },
        {
            "review_text": "Played this game a while back. Was sweet. Now still pretty sweet.  Game is Katamari Damacy. Actually it's Catamari Damacy. You are welcome. The only difference is you knock ♥♥♥♥ over instead of rolling it up.  The entire time I just say '♥♥♥♥ your ♥♥♥♥'. some good CATharsis in here.  Purrdy gud/10",
            "review_score": "1"
        },
        {
            "review_text": "Purrfect! =^.^=",
            "review_score": "1"
        },
        {
            "review_text": "Now you can cat!",
            "review_score": "1"
        },
        {
            "review_text": "  BEST CAT GAME in next update they should add splitscreen multiplayer then the best game on planet earth!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Needs more Developement but is very fun.",
            "review_score": "1"
        },
        {
            "review_text": "this game is amzing in vr",
            "review_score": "1"
        },
        {
            "review_text": "(Review of the VR Version) On paper it sounded hillarious, but after 10 minutes it just left me wondering what I was doing with my life and I requested a refund.  Among other things, the scale just doesn't work in VR - your cat paws are massive, but in a 2.5 x 2 meter real world room you will teleport next to an object you want to hit and STILL run out of room to hit it - at one point I whacked my desk in the real world because of how far I had to move to hit anything.",
            "review_score": "-1"
        },
        {
            "review_text": "Recommended !",
            "review_score": "1"
        },
        {
            "review_text": "More Reviews @  TheVideogameBacklog.com   Catlateral Damage is not what I was expecting when I booted it up. In all honesty, I wasn’t sure what I was expecting. Their video was pretty funny and definitely grabbed my attention. Ever wanted to be a cat and knock junk off of… well everywhere before your humans get home? Well, now there’s a simulator for that! It’s not a plain cat simulator, but it’s a cat carnage simulator for sure.  There is not much to Catlateral Damage. It’s simple premise of being a cat and knocking things off shelves pretty much describes the entirety of the game. There is an easy enough time-limit which does get a little hairy in the Museum (or Mewseum), but all things in time eh? That’s Objective Mode in a nutshell where as Litterbox Mode removes the time-limit on your destruction and lets you run rampant throughout the rooms knocking things over at your leisure. Remember to pick up the power-ups to help you knock things over with more ease!  There are also a lot of unlocks to … unlock (for lack of a better word there) if that’s your thing. You can get more cats to play as which basically gives you a different color paw to swat things with. There didn’t seem to be a stat difference so I guess it’s all up to color preference (I prefered Kratos I believe). Also, the pictures hanging off the walls are there for you to knock off and collect to keep in the out-of-game collection of funny cat pictures. It’s nice to be able to go back to and giggle at them.  Score: Meh...  Did you want a cat simulator in which you knock things off the shelves? This game will deliver. It’s a solid carnage simulator and seems to be created to just let the player have fun as a cat without breaking items in his/her own house. It’s not overly challenging and has smooth controls so it could be pretty good for kids to better their hand/eye coordination. There’s a lot of stuff to collect so if you’re a fan of collect-a-thons, you may also find a home here. Maybe it’s that it’s too simple or that I just don’t get it in its totality. Maybe I’m just looking too deep for something that the game wasn’t intended for, but I wasn’t 100% sold on this. Catlateral Damage is well made, but I didn’t have that much fun playing it. In the end, I would say this is more niche that I would have thought and I don’t think I fit into this particular niche.",
            "review_score": "-1"
        },
        {
            "review_text": "Wreck everything. Be a cat.   Purrfect game, Truly Pawesome!   10/10",
            "review_score": "1"
        },
        {
            "review_text": "I never thought being a cat would be so fun!!! Great game, endless destruction!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so freaking cute! It does get a bit repetative after a while, but it's thoroughly entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "Meow :3 Meow Meow Meow Meow, Meow Meow Meow. Meow Meow, Me-yow. (Great :3 I wish i was a cat and could do all this. Its just so much fun)",
            "review_score": "1"
        },
        {
            "review_text": "i get super markat to much, and i would like it if moon gravity were more often... but otherwise, great game! (meow rowr rowr. hiss fft!! yowl mew mew meow. :3)",
            "review_score": "1"
        },
        {
            "review_text": "Oh man! I tested this game before the Steam Greenlight release, I loved it so much and I am soooo happy to see it on Steam  Music: In different levels you can find different music tracks, and those are very nice! Gameplay: I know we are at the 1.2v but the recent updates make the game better, the controls are confortable to play with a First Person perspective Achievements: Most of the achievements are very creative and you can spend a lot of time playing to unlock them, I like that part of the game :)  A bunch of cats to select, lots of cute photos, LOTS OF LEVELS, you can finally live what your cat likes to do!! I totally recommend it :3 ",
            "review_score": "1"
        },
        {
            "review_text": "When my friend got me this game, i had no idea what it was. Then i played it. Then i played it some more. Then i had 2 hours on it. Best game. Ever.",
            "review_score": "1"
        },
        {
            "review_text": "This game... I can't believe the fun I had playing it. The music is pleasant, the levels are interesting, the cats are adorable, and I think I understand my cat's logic more now. There's even a few character models that resemble him, so I can kind of play AS him.  I think this will be my go-to for relaxation; just choose a cat, and destroy a house out of playful pettiness.",
            "review_score": "1"
        },
        {
            "review_text": "─────────────────▄▄▄▄▄▄▄▄▄▄▄ ────────────▄▄▀▀▀░░░░░░░░░░░▀▄▄ ────────▄▄▀▀░░░░░░░▄▄▄▄▄▄▄░░░░░▀▄ ──────▄▀░░░░░░░░░▄▄▄▄▄▄▄▄▄▄▄░░░░░█ ────▄▀░░░░░▄▄▄▄▄▄▄░░░░░░░░░░░▄▄▄▄▄█▄▄ ───▄▀░▐▌░░░░░░░░░░▀▀░░░░░░░▀▀░░░░░░█ ──█░░░▀░░░░░░░▄▀▀▀▄░░░░▄░░░░▄▀▀▀▄░░▐▌ ─█░░░░░░▄▄▄░░▐░░▄░░▌░░░░▀▄░▐░░▄░░▌░░█ ▐▌░░░░▀▀░░░░▄░▀▄▄▄▀░░░░░░░▌░▀▄▄▄▀░░░▐▌  █░░░░░░░░░░░░▀▄▄▄░░░░░░░░▐░░░░░▄▄▄▀░░█ █░░░░▄▀░░░░░░░▄▄░░░░░░▄▀░▐░░░▄▄░░░░░░█ ▐▌░░▀░░░░░░░▄▀░░░▐▀░░░░░░░▀▌░░░▀▄░░░░█ ▐▌░░░▐░░░░░▐▌░░░░░▀█░░░░░░░▌░░░░█░░░░█ ─█░░░░░░░░░░░░░░▄░░▀▀▄▄▄▄▀▀░▀▄░░░░░░░█ ─▐▌░░░░░░░░░░░▄▀░░░░▄▄▄▄▄▄░░░░▌░░░░░░█ ──█░░░░░░░░░░▐░░░░▄▀░░░░░░▀▄░░▌░░░░░▐▌ ──▐▌░░░░░░░░░▐░░░░▀░░░▀▀░░░▀░░░░░░░░█ ───█░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▐▌ ───▐▌░░░░░░░░░▄███████▄░░░░▄████████▄ ────▀▄████████████▀█████▄▄████████▀██ ───▄██▀▄░░░░░███▀▄██████▀▀██████▀▄███ ───▀▀───▀▀▀▀▀▀█████████▀▀▀▀█████████▀ ",
            "review_score": "1"
        },
        {
            "review_text": "It's a first-person cat game... what more could you ask for?",
            "review_score": "1"
        },
        {
            "review_text": "This game is such a nice stress reliever. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "So after wasteing a few hours here and there, i can say that while basic this game is pretty fun. It doesn't take a lot of thought, good for unwinding after work. And while the graphics are simple, there is some sastification with knocking everything on the floor.  PROS: - Easy to play - Lots of achievements if that's your thing - Fun 'hidden' levels keep things interesting  CONS: - I wish there were more levels to play. To only have 4 maps is a little boring. - Graphics are pretty basic and simple, which works for this game, but if you are looking for something as pretty as Fallout 4, this isn't it  I'd still recommend this though, just for the fun of it.",
            "review_score": "1"
        },
        {
            "review_text": "I can now totally understand why my cats keep on destroying my stuff - its awesome! Love this game.",
            "review_score": "1"
        },
        {
            "review_text": "SWAT! GET ON THE FLOOR!!! - Cat",
            "review_score": "1"
        },
        {
            "review_text": "Purrrrfect.~",
            "review_score": "1"
        },
        {
            "review_text": "The game is a pretty simple game that is just really relaxing and fun if you feel stressed or whatever. The game may or may not be wother $11 depending on why you're buying it, but I enjoyed trying to get the most powered up cat and getting all the unlockables. If you're looking for a very in depth game where the story line is great, the graphics are great, etc. Why are you looking at a game called Catlateral damage, did you even watch the trailer video?",
            "review_score": "1"
        },
        {
            "review_text": "very fun, love wrecking stuff",
            "review_score": "1"
        },
        {
            "review_text": "I give this a 9/10 for what it is. Don't come here expecting a story or anything, but this is some of the most relaxing, most fun gameplay I've ever come across, and the graphics are simple but very appealing. There are more than enough cats/levels/surprises to keep you entertained for a good amount of time. I played 30 seconds of this game and instantly bought 2 more copies of it as gifts, so yeah it's worth the money. If you want a game to just kick back and have a little fun with, you should definitely give this a look.  I would give this a 10/10 if there was multiplayer (co-op or versus.) I'd even pay extra for it. Please.",
            "review_score": "1"
        },
        {
            "review_text": "So fun to play, great way to relieve stress.",
            "review_score": "1"
        },
        {
            "review_text": "Catlateral Damage is a game about running around as a cat in a house swinging your little kitty arms as you try to knock down as much stuff as you can before time runs out. While doing this, you can unlock more cats, achievements, and photos.  Overall, its a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Be a cat. Live the life of a cat. Break everything you see. On the counter? Down it goes. On the table? Down it goes. On the wall? Down it goes. Wherever anything reachable is, everything goes crashing down.  Live your life stress-free and carefree as a cat that doesn't give a damn about what your human thinks and just wreck the house to your satisfaction.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, so this gameis fun and easy to waste time with but after a while it gets pretty boring. Its all just seeing if you can find a new object or picture and trying to beat a score. I think this game would really benefit from something you the cat needs to avoid doing. What if your owner walked in the room sometimes and you have to hide until they leave.Yes I would recomend this game but mainly because its one of the only cat games I know of. buy ut during a sale or hope for some future play modes.",
            "review_score": "1"
        },
        {
            "review_text": "This isn't what I would recommend for people who just play videogames to beat everyone else or to be the best. This game is more of a cute game, that you would want to play with your friends while you're drinking and just cutting up and having fun. Not a whole lot of competition, but I am perfectly fine with that. Much fun, must play, please enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "This masterperce is about going into the mind of a feline who hates his owner. The objective of Catlateral Damage, is to break everything in sight. Easy right? Wrong. The game is somewhat challenging, but I've never failed a level, yet. I havn't beaten the game, as it is somewhat endless, but I continue to play, as it is a fun game   7.75/10",
            "review_score": "1"
        },
        {
            "review_text": "I can now cat",
            "review_score": "1"
        },
        {
            "review_text": "Purretty fun in VR, wish I had a larger play area.",
            "review_score": "1"
        },
        {
            "review_text": "Kinda boring after playing 15 minutes since everything is so repetitive. Glad I got it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "I think I understand my cats just a little bit better for having played this game.  Even ignoring being a cat, there is something just a little special, liberating even, about taking a tidy, organised environment and making a mess. It could only be better if it was asymmetric multiplayer with the other player being a human who desperately try to tidy things as you mess things up.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the cutest game I have ever played. Totally recommend it :D",
            "review_score": "1"
        },
        {
            "review_text": "Why cant i destory the painting in the tutorial? no matter what i try it never breaks or works so i cant get pass the tutorial with this glitch. Somebody help.",
            "review_score": "1"
        }
    ]
}