{
    "app_id": 330180,
    "name": "Pix the Cat",
    "release_date": "2015-01-29",
    "developer": [
        "Pastagames"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Cats"
    ],
    "achievements": 11,
    "positive_ratings": 239,
    "negative_ratings": 60,
    "price": 6.99,
    "description": "Pix the Cat is a critically acclaimed intense arcade game that will challenge your reflexes and your wits, pitting you against your friends and the world in a race to the highest score!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/330180/header.jpg?t=1447364453",
    "minimum_requirements": "OS: WINDOWS XP/VISTA/7/8 Processor: AMD/INTEL DUAL-CORE 2.2 GHZ Memory: 2048 MB RAM Graphics: 256 MB 100% OPENGL 3.0 COMPATIBLE AMD RADEON HD 5000 SERIES/NVIDIA GEFORCE 9000 SERIES/INTEL HD 4000 SERIES OR HIGHER Network: Broadband Internet connection Storage: 1 GB available space Sound Card: OPENAL COMPATIBLE Additional Notes: INTERNET CONNECTION REQUIRED FOR THE GAME ACTIVATION",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Put Pacman DX+, Snake, ChuChu Rocket into a blender. Mix for 10 mins, and you end up with Pix The Cat.  The game is basically snake (old mobile game), with Chu Chu rocket style graphics and Pacman DX+ mechanics. Good for a quick 10/15 minute blast, the concept is simple, as Pix the cat you have to collect eggs which spawn chicks that follow you. Walk over the targets to deposit the chicks and score... Seems simple enough.. Except..  The only way to get a decent score is to collect ALL the chicks first BEFORE you deposit them. Deposit them too early, and the remaining shells crack and your combo multiplier drops. Run into your own tail of chicks and all the remaining eggs crack your combo multiplier drops. Run into various enemies and all the eggs crack, and your combo multiplier drops. The longer you can go without dropping your combo multiplier the higher score you can achieve, but also, the game gets quicker (hello pacman DX+). The game is played against the clock (arcade mode) so you have to choose the quickest path without trapping yourself. Get enough perfects in a row and it goes into fever mode, even higher scores can be obtained! (ps. scoring tip, in fever mode you can EAT the enemy monsters for even MORE SCORE).   Each level is inside the current level, a warp gate opens when you complete a level (successfully or not) to the next level. This allows two way acesss, which in some levels is needed to complete the next level.  Oh about controls, you only turn when Pix is directly on the center of a square. You can pre-turn before that for a slight speed boost (sparks appear). Keyboard or D-Pad is a must, analogue stick really isn't going to cut it.   The game have a lot of unlocks, to get you to come back and have one more go. You are contanstly chasing the high score, with high score tables for local, friends and worldwide to conquer.   There are other modes, I haven't got around to playing them yet. Including a local multiplayer arena mode, which appears to be a bit like bomberman.",
            "review_score": "1"
        },
        {
            "review_text": "This game has great visuals and music, but the gameplay is what breaks it for me. Moving Pix the Cat is way too slippery, especially when the game moves faster as you progress in the levels, causing you to easily break your combos. This, along with really long levels, makes restarting and succeeding in the game troublesome and irritating. I'd love to enjoy this game, but alas, it's not meant to be. Perhaps I would like it better if the damn cat wouldn't automatically move forward, making those many tight turns much more tolerable.",
            "review_score": "-1"
        },
        {
            "review_text": " The Pac-Man Championship Edition DX of Snake, but 3 fast 5 me",
            "review_score": "-1"
        },
        {
            "review_text": "Only played this for a few hours and its already very very addictive, Really enjoy this and i can see many hours in the future playing this game!!",
            "review_score": "1"
        },
        {
            "review_text": "A must have for anyone who love hardcore oldschool arcade games, or ducks.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun! it only takes a few mins at first but then you get addicited and an hour later you're wondering where the time has gone. Challenging short levels a struggle for perfectionist, if you drop off a duck before your suppossed to",
            "review_score": "1"
        },
        {
            "review_text": "this game is hard",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly good, very addictive, and a wonderful callback to the Snake series.",
            "review_score": "1"
        },
        {
            "review_text": "It's good!",
            "review_score": "1"
        },
        {
            "review_text": "It's like a mix of Snake and Pac-Man CEDX. Collect a chain of ducklings and deposit them on designated spots on the field, and then in a weird aesthetic twist, go to the next level by entering a portal in the walls that shrinks you down ever smaller. Collect all the ducks before depositing them for a bonus, but don't run into walls or the chain following you. Starts with just one field to play, and lets you unlock progressive fields once you've pretty much mastered the current one.  You can also unlock a couple extra modes: a puzzle mode where you try to get a perfect run on a single field while only moving in full rows or columns, and a 'nostalgia' mode that's basically straight up classic Snake, with some twists in the level design.  It's not quite the insane, perfectly designed adrenaline rush that Pac-Man CEDX is but it's a very interesting take on Snake and well worth a few bucks, i.e. as part of the Weekly Humble Bundle.",
            "review_score": "1"
        },
        {
            "review_text": "This game is not as fun as Pacman or Snake, but it tries to be both. It's a fun idea on paper, but it all comes down to controls and gameplay, and this game let me down. It's unforgiving and difficult, and the game has a somewhat sloppy feeling to the controls, so you need to use the arrow keys for best results. The limitations and high expectations of Arcade Mode leave you frustrated and dissappointed. The other game modes are boring. Once the novelty of the bells and whistles wear off of this game, you will find it to be a chore to play. This is not a good sign for a score attack game that is supposed to have good controls, and addicting gameplay that will keep you coming back for more. You won't find that here. I tried to like this game, but failed. This is a waste of money and time.",
            "review_score": "-1"
        },
        {
            "review_text": "Not bad. I once played it on iphone that was more fun and kind of like a different game.",
            "review_score": "1"
        },
        {
            "review_text": "Freakin awesome! Nuff said!!! :D",
            "review_score": "1"
        },
        {
            "review_text": "I need to write a review, good game.",
            "review_score": "1"
        },
        {
            "review_text": "Genuinely one of the most addictive games I have ever played. I have lost so much sleep because of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, but also really fast paced. Plays quite a lot like an arcade game.",
            "review_score": "1"
        },
        {
            "review_text": "bought this for my Girlfriend as she loves Pacman, great game - bloody frustrating but still enjoyable  Definately recommended for those who like the old style classic gaming (use a joystick with analog pad for fastest playability)  The one thing that stops us playing it for long is the facy if you die you go right back to the start of the original levles - thats crazy, just restart the last level is enough :(  Please fix this ^_^",
            "review_score": "1"
        },
        {
            "review_text": "I bought it because of cute cats.   This game turned out not disappointing me. It is Awesome and cute!!",
            "review_score": "1"
        }
    ]
}