{
    "app_id": 330350,
    "name": "Robotex",
    "release_date": "2014-11-19",
    "developer": [
        "YFYX GAMES"
    ],
    "publisher": [
        "YFYX GAMES"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Casual",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 286,
    "negative_ratings": 609,
    "price": 3.99,
    "description": "Life on Earth is unsustainable. Humanity must seek a new home but the only planet found is very hostile. You were sent on a expedition to slay the monsters inhabiting the surface of this planet. In this adventure you end up being the villain. Game contains two basic controls, many puzzles and lots of guns and enemies.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/330350/header.jpg?t=1447364471",
    "minimum_requirements": "OS: Windows 7/8/8.1 Processor: 2.0 GHz Memory: 2000 MB RAM Graphics: NVIDIA GeForce GT 240 (or better) DirectX: Version 10 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7/8/8.1 Processor: 3.0 GHz Memory: 4 GB RAM Graphics: NVIDIA GeForce GT 240 (or better) DirectX: Version 10 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "It boggles my mind, how a game can be so visually appealing, and yet its interface and controls to be made with foot scribbles. Make a redux version, and include this one in the price at most or remove this one from Steam. And get a bloody UI designer.",
            "review_score": "-1"
        },
        {
            "review_text": "The best time I had with this crap was when I uninstalled it.",
            "review_score": "-1"
        },
        {
            "review_text": "A fairly mundane platformer type game that was 19c.   Worth about that.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Flappy Bird except with the additional stress of having to kill enemies, and actually distinguish hazardous obstacles from the background environment. Nice graphics, but too frustrating to play.",
            "review_score": "-1"
        },
        {
            "review_text": "This godawful sh*t of a game took 9 hrs to drop cards.",
            "review_score": "-1"
        },
        {
            "review_text": "Very colourful, yet almost totally unplayable platformer. Maybe the fans of Super Meat Boy wanna new challenge, fighting gloomy interface and pointless gameplay? Otherwise, the only reason why someone buys this game, of course, it's the Steam cards! Although, they are not so high, so even with 90% discount you can't be sure that you'll be in the black.  'Don't buy if you can't to stress' - says one of the screenshots on the store page. Not sure what that means, but I think you got the message. Don't Buy. Even with discount. It is not worth your time, at all. Mark 2.5/10 - only for nice looking screenshots.",
            "review_score": "-1"
        },
        {
            "review_text": "Poor controls, inconsistant, unclear art, low quality audio and terrible level design combine to make this a game to avoid. There are some fun artistic desings and it has some interesting weapon variety that you can choose from the start. Its definitely not enough to save the game from being an overall bad product.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is only worth getting if the price of the Steam trading cards outweigh the cost of the game. Fortunately that is pretty easy to do during the large Steam sales as the game can be had for around 20 cents.  Gameplay is overly difficult but not because it has a high skill ceilling. There is practically zero information conveyed to the player about goals, objectives, or how to play. You have to just interpret what you think the game is asking of you based on the icons that show up on the various 'menu' pages. Nothing on this game has any polish. It actually looks like something made for a bet or a school project.  2/10 because it does technically work. Get your steam cards and move on.  Edit: I only started to receive the Steam trading cards after the 2 hour refund window had passed. YMMV.",
            "review_score": "-1"
        },
        {
            "review_text": "this Game Sux Dont Buy Zis game! Trust me",
            "review_score": "-1"
        },
        {
            "review_text": "I paid 5 American dollars for this game and I belive this should be considered one of the best games of 2015. This game features bug men, interface and audio support for 27 different languages, killer clouds, 2 buttons, claw mushrooms, awsome graphics, normal mushrooms, lightning, a slow tilting camera, pink haze, sweet kickin tunes, spooky flying electric bugs, rotating balls of electricity, meteorites, platforms, a long intro cutscene, blue skies, dense foliage, falling platforms, crystals, global warming, logs, trees, loud rocket noises, option menues, varying levels of difficulty, more bugs, rocks, trading cards, spinning logs, robots, lazers, buzz saw rockets, falling logs, more lazers, and clever popular culture references. My favorite robot to play as is that Globulus Grime character.",
            "review_score": "1"
        },
        {
            "review_text": "You can be stuck in the game because of bugs. Outside of that, it is like flappy bird with guns... It has colorful graphics, but not really interest!",
            "review_score": "-1"
        },
        {
            "review_text": "Clearly a mobile game twisted to fit on a full computer and it shows. Really not good gameplay at all. The opening sequence is made up of lovely rendering of the ship launches but this is sadly the last you will see of those awesome visuals.",
            "review_score": "-1"
        },
        {
            "review_text": "This is easily one of the worst games I played in my life. I bought it with a 75% off coupon, and it was still a waste of money. Pure garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "I like the part where you get to delete the game and then hide it in your library.",
            "review_score": "-1"
        },
        {
            "review_text": "For 20 cents, I got ripped off.  Not even worth the time to play if it was free -100/10. Awful.",
            "review_score": "-1"
        },
        {
            "review_text": "COMPELTE GARBAGE DONT BUY UNLESS YOU ARE INSANE",
            "review_score": "-1"
        },
        {
            "review_text": "Ok did you play flappy bird on your phone and get angry ?. You should play it once and get real rage 10/10. I would smash something again",
            "review_score": "1"
        },
        {
            "review_text": "horrible. never buy. dont waste your hard earned money.",
            "review_score": "-1"
        },
        {
            "review_text": "This should be a free flashgame. I did it for the cards, played for 10 minutes, and stopped because it wasn't worth my attention.",
            "review_score": "-1"
        },
        {
            "review_text": "seeing that this game is negative my friends got me it and told me to check the reviews. i didn't think it was that bad so i downloaded and after a few minutes it was done. I started it up hoping for a good chuckle and some bad gameplay so i can write a sarcastic review about how 'great the game was.' By god, I can't, I can't bring myself to do it. the game was horrible. I seriously want to uninstal my steam so i never have to look at the demon of a game again",
            "review_score": "-1"
        },
        {
            "review_text": "I don't remember how much i payed for this game but it was way too much",
            "review_score": "-1"
        },
        {
            "review_text": "It seems like a nice game. It's very pretty, and has simple mechanics. A bit to simple. I feel like this game would do well as a mobile app, on a PC it doesn't quite seem to flow correctly. Amazing intro however, but once I started playing... I would love it if this was a game on the play/app store or something.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty nice game, I liked it!",
            "review_score": "1"
        },
        {
            "review_text": "'i got cancer from this gaem soi soi 10/10' - IGN",
            "review_score": "1"
        },
        {
            "review_text": "This is a bad game, controls are bad, gameplay, bad, the only reason i got it was because it was 9 cents and i could profit of trading cards  this doesnt even work as a joke game",
            "review_score": "-1"
        },
        {
            "review_text": "Pro: + Cards  Cons: - Cheap graphic - Control bug. X says fly but doesn't do anything - cant change gamepad - full screen is still 1:1 - no music in level - annoying SFX - ugly character - ugly logo design - slow intro - wierd green dot - bad UI",
            "review_score": "-1"
        }
    ]
}