{
    "app_id": 330620,
    "name": "It's A Wipe!",
    "release_date": "2014-12-11",
    "developer": [
        "Parody Games, LLC"
    ],
    "publisher": [
        "Parody Games, LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Strategy",
        "Simulation"
    ],
    "achievements": 25,
    "positive_ratings": 87,
    "negative_ratings": 25,
    "price": 3.99,
    "description": "A game of fantasy guild management! In It's A Wipe! you assume the role of a guild leader within a fantasy game world. You must recruit other players, lead them to victory against increasingly difficult odds, and make sure that your group remains happy enough to stick with you!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/330620/header.jpg?t=1482468319",
    "minimum_requirements": "OS: Windows XP or newer Processor: Anything that should run windows should run this Memory: 2 GB RAM Graphics: Any Directx8 OpenGL Compatible card DirectX: Version 8.0 Storage: 200 MB available space Sound Card: Any OpenAL Compatible Card Additional Notes: The game is designed to be fairly light weight.  It should run on almost any system.",
    "recommended_requirements": "Storage: 250 MB available space",
    "reviews": [
        {
            "review_text": "UPDATE November 13th 2015: It has been over a month. (10/9 - 11/13) That I have been talking with the maker(s?) of this game discussing the issues I'm having getting it to run, and finally we got it working with the new 'debugging-' patch they added to the games betas list. Let that sink in for a moment, these people love their game so much, and are so willing to get it to work for those that purchase it, that even a single person like myself is worth that much time and effort. Now, once I've actually played the game a bit, I'll be reviewing it properly, but whether the game itself is good or bad now is now irrelivant to me; fun is subjective and will change from person to person, but dev(s) willing to put this much effort into fixing a game for you, that's the kind of work that deserves to be paid for.   Original Review: I don't want to give it a negative review because the developer has been nice so far; but the game simply won't run, even on different video cards. Will happily change when/if I ever get it working because it looks like a blast. :(",
            "review_score": "1"
        },
        {
            "review_text": "For anyone that's interested in a statistical single player version of an MMORPG then this isn't a bad option. I'd recommend waiting for a 50% off sale.",
            "review_score": "1"
        },
        {
            "review_text": "I was going to write a review, but then Leroy pulled the whole room",
            "review_score": "1"
        },
        {
            "review_text": "Recruited 3 members who Demand Attention. Guild spiraled out of control. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I would thumbs up this game but for what seems to be a game-breaking bug. You cannot control which tank tanks the enemies. Despite there being a Tank screen where you set up who tanks what, *and* a Tank Switch command once the raid starts, it does nothing, and the tank that the enemies decide to attack will be killed because of this. Shame.  EDIT: Dev reponded within hours of my review and fixed this bug. Impressive!",
            "review_score": "1"
        },
        {
            "review_text": "All i can say about this game is that i want more of it, perhaps a bit more developed and complex",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love it! It's a great game for such a price. Very humorous but also challenging. I can only recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I used to love World of Warcraft and was a hardcore 5 to 6 day a week raider for years...before it went to ♥♥♥♥ (around the time they decided to add panda people and pretty much give raid quality gear to any no-skill-having tool that payed their $15 a month). That being said, 'It's A Wipe' is a really fun game and takes me back to the times before World of Warcraft started sucking balls.",
            "review_score": "1"
        },
        {
            "review_text": "What a great time waster. Im really enjoying it.",
            "review_score": "1"
        },
        {
            "review_text": "This game really sucks. its just flat out ugly and boring. dont bother, even for 5 bucks.",
            "review_score": "-1"
        }
    ]
}