{
    "app_id": 330670,
    "name": "DiscStorm",
    "release_date": "2015-08-20",
    "developer": [
        "XMPT Games"
    ],
    "publisher": [
        "XMPT Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Multi-Player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Local Multiplayer"
    ],
    "achievements": 30,
    "positive_ratings": 28,
    "negative_ratings": 3,
    "price": 8.99,
    "description": "Fast-paced and furious arena combat, where split-second reactions are essential to dodge flying discs as they ricochet around at breakneck speed. Brave formidable single player adventures or meet up with your friends and challenge them to intense local multiplayer battles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/330670/header.jpg?t=1478551398",
    "minimum_requirements": "OS: Win XP / Win 7 / Win 8 / Win 10 Processor: 2.0 GHz Dual Core Processor Memory: 2 GB RAM Graphics: GeForce 8800 or equivalent. DirectX: Version 9.0c Network: Broadband Internet connection Storage: 2 GB available space Sound Card: DirectX 9.0c compatible. Additional Notes: Controller Highly Recommended. Please see supported list in the 'About This Game' section.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Seems to have a pretty fun single player mode...controls are smooth game has a qiuck pace and decent music. Can't wait to try it out mp.  11-4-2015 Upon further review I am not so excited about multiplayer. I tried it out vs the ai. It has a 3 star to win a match system where it swaps modes/maps each round. It randomly selects each, you cannot pick what mode/gametype you want. Game needs more options.",
            "review_score": "1"
        },
        {
            "review_text": "Towerfall is very similar, and better in all regards. The soundtrack is good.",
            "review_score": "-1"
        }
    ]
}