{
    "app_id": 330990,
    "name": "Demon Hunter: Chronicles from Beyond",
    "release_date": "2014-12-04",
    "developer": [
        "Brave Giant LTD"
    ],
    "publisher": [
        "Artifex Mundi"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Casual",
        "Hidden Object",
        "Adventure"
    ],
    "achievements": 28,
    "positive_ratings": 180,
    "negative_ratings": 105,
    "price": 6.99,
    "description": "Discover your true identity and face a mysterious entity from another dimension!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/330990/header.jpg?t=1530538766",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 1.5 GHz Memory: 512 MB RAM Graphics: 128 MB VRAM DirectX: Version 9.0 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 2 GHz Memory: 1 GB RAM Graphics: 256 MB VRAM DirectX: Version 9.0 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "I'll admit I went into this game having mixed expectations, while the reviews made me think it might be bad, having Artifex Mundi involved (they did not fully make this game) made me hopeful. So whil I expected the worse I was hoping for the best... It was some of the worst...  First off the sound effects. Someone's job must have been to find the most soul wrenching sound clips ever. I use a high-def headset so some noises I find discomforting while on normal speakers or headphones it might be fine but I would say 9/10 sound effects in this game made my ears cringe a bit. Even transition noises between screens were bad.  The voice acting, well let's be hoest most hidden obbject games (HOGs) don't have the best voice acting. This one hits a new low. It sounds like lines just read off paper with an odd accent. I can see them wanting to make the main character having an accent but they still could have picked a better voice actor. To top that off the lines that are not in grammatically correct english are some of the lines of text that is displayed as your character speaking. The other voice actors do a slightly better job.  Plot... Okay... Usually HOGs have bad plots or typical ones but at least they usually make sense!   One moment you're in a house fighting a so called demon and the next you're under water fighting a kraken, the next im finding golden eyes for an elephant statue that looks Indian...? To make matters worse there is no plot progression, you try to get into a house you meet a guy who vanishes like a demon in a cloud of black smoke (gee I wonder if he's actually a bad guy...) and then bam you're trying to distract a kraken in a whole underwater bit and then youput an amulet into a machine to shut down the stargate (serious it has the chevrons and everything turning!) and the only exposition to your character (which was proposed as a major plot point at the start of the game) is one book which should be called exposition 101! The premise was decent but the execution horrible. It would have been more interesting if it turned out that old lady at the start with the cat was the demon.    Hidden Object Scenes. Okay who in the world thought 'Hey, you know what'd be cool to add to a hog scene Jim?' 'What Larry?' 'Let's add things that shift form and you can only click it when it's in the form listed on the object list!' 'Wait Larry, wouldn't the shifting give away the items position anyway and just be annoying to wait for it to shift back to the correct item?' 'Yea! Let's do it Jim! And make sure the shift time is at laest 5 seconds long just in case it's the last item the player is searching for it can be extra annoying!' That has got to be the most annoying feature ever thought of in for a HOG (aside from single pixel objects) Another problem with HOGs is that the items are hidden mainly with clutter and usually never anything clever.  Puzzles. If you've ever played a HOG before, you've probably already solved most of these puzzles and they were probably better designed. Often times the back arrow is too sensative and you'll back out of a puzzle, othertimes the puzzle isn't fun it's just tedious (there's a maze one that ugh... it's one of those don't touch the sides or the walls thing but with a long linear maze...).   Logic. While not always the best place for logic... HOGs USUALLY follow some logic but this game loves having you find random items in random places. I can see getting a screw driver from a tool shed... I can see getting dog food from a kitchen... I cannot see how most of these items are placed! You find a pickaxe in some case after solving a puzzle that was like a picture frame! Basically any item you need will be uncovered by solving a puzzle towards the end game, no matter how little sense it makes.  Overall this game, while not a broken game (I didn't find any glitches) it's not really worth the money or time. The plot doesn't redeem the lack of good gameplay nor does the gameplay redeem the plot. It feels like whoever made this game asked Artifex Mundi for a plot premise and their animation team and scraps from their old games. So while it makes a playable game, it is by no means a good one. If you have to pick, skip over this game and get one fully made by Artifex Mundi. Don't let the pretty art fool you, there is little substance behind it. Final verdict 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "It is Artifex Mundi. 'If you played one, than you know them all.' which in this case is one of the few times in gaming where it comes to be the most positive thing about a point&amp;click 'slash' hidden object you might ever hear.  10/10 Artifex - You make me droll - Mundi  (Hint: I like them all)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, point and click, with of list of things to find and puzzles to solve tasks. If your not into puzzles then you wont like this game. So dont buy it and give it a bad rating. Its actually a great game. Great visuals and fun to play.",
            "review_score": "1"
        },
        {
            "review_text": " Demon Hunter: Chronicles from Beyond  Rating: 5/10  tl;dr; : Nice kitty, just don't feed it and play something else.  Hidden objects so search and find, decorated with minigames, collectables and Steam Achievements. Started it and finished it in about 4 hours. A weak one with a forgettable story, weak animations and morphing objects which really is annoying.  Better pick one with a positive rating.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty mediocre HOPA game with some not very bright design decisions and not great narrative.  What makes me recommend this is a bonus chapter which fits perfectly for HOPA genre narrative. Why don't people use it more? why not have complete HOPA game (or whole series) based on surreal imagery with all those puzzles and HO piles. It would make perfect sence, it would be some great gesamtkunstwerk.",
            "review_score": "1"
        },
        {
            "review_text": "My wife loves hidden object games so she plays them and she said this game is really good. puzzles are good and challenging, the graphics is really good and so is the story and the overall feel of the game  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Maybe get it on sale if you're really into hidden object games. Don't expect too much. Lots of bad English--misspellings, possible translation issues? Illogic past what's acceptable for the genre, like the poison gas another reviewer mentioned. Art is okay but nothing amazing, especially for Artifex Mundi-branded games, which tend to be quite lovely. Brave Giant seems to have just waved a hand and said, 'meh, good enough.' Hidden objects are sometimes easy to find simply because they stand out against the background art, like old cartoons where you knew something would move because it was drawn differently.  Worst offense: Multiple items in hidden object scenes that could respond to the keyword. E.g., 'lion' wants you to click on the lion face, not the full-body lion art.",
            "review_score": "-1"
        },
        {
            "review_text": "The main game included little sense and lots of walking back and forth. The story only started to make sense at the end. The bonus game however was nice. ",
            "review_score": "-1"
        }
    ]
}