{
    "app_id": 33100,
    "name": "Alien Shooter",
    "release_date": "2009-05-27",
    "developer": [
        "Sigma Team Inc."
    ],
    "publisher": [
        "Sigma Team Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "Shooter",
        "Indie"
    ],
    "achievements": 17,
    "positive_ratings": 815,
    "negative_ratings": 92,
    "price": 3.99,
    "description": "Your mission is simple: clear the base at all costs. You will be provided with explosives to help you gain access to the teleports from where thousands of pitiless creatures pour.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/33100/header.jpg?t=1552377105",
    "minimum_requirements": "OS:Windows 2000 / XP / Vista                      Processor: 400 MHz                     Memory: 128 MB                     Graphics: Direct3D compatible 3D graphics card with 32 MB RAM                     DirectX®: 7.0                     Hard Drive: 50 MB Free Space                     Sound: DirectSound compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A simple top down shooter with one goal, KILL, EVERYTHING,  You get 2 modes:  Campaign: Where you must beat level after level, it goes harder and with every level it comes more enemies, you get a shop at start to buy upgrades, items and weapons to get stronger.  Survival: Where you must fight against enemies until you die, stand how long as you can, with time it comes more and more enemies but weapons, upgrades, items and (only in this mode) powerups will come too.  (For newbies maybe the game is a little bit hard at start, just need a few trys)   The soundtrack is good and comes better together with this massacre of alien killing.  Before you buy this GET SURE your want a shooter where you just hold the mouse button to destory an alien army. (and at THIS point the game does all right) Nothing special but i think it makes fun, and is good for when you get bored or to kill time.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing Alien Shooter since I was a little kid. I always loved it.... Later in the game, it becomes nearly imposible to beat (without cheats), but I still use the game to kill time. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Alien Shooter, Zombie shooter, Shadow Warrior or Doom1-2-4 - the games in it's pure form. Simple but addictive, nearly no storyline, no tutorial, first enemy right after loading screen. You don't have to wait or learn anything, they are fun immediately.",
            "review_score": "1"
        },
        {
            "review_text": "This is a simpleton game, a monkey could play this but it's really fun I recommend you get it, it... you just need to get this f#cking game",
            "review_score": "1"
        },
        {
            "review_text": "Quiet easy after years of playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Exactly the same levels as the Zombie Shooter series. Avoid.",
            "review_score": "1"
        },
        {
            "review_text": "3/10",
            "review_score": "-1"
        },
        {
            "review_text": "There are better games out there than this",
            "review_score": "-1"
        },
        {
            "review_text": "Worst Alien Shooter part: Too simple, to repetitive, visually awful, not a huge selection of enemies but masses of them to keep you somehow entertained which doesn´t really work to be honest, gets WAY too hard after the first six or seven missions and I honestly can´t recommend this game, the other parts are SO much better.",
            "review_score": "-1"
        },
        {
            "review_text": "Highly reccomended. I have gotten many hours of entertainment out of the whole Shooter series. Not a lot of variation, and each game is basically like the other int he series, but it's always fun to shoot wave after wave of grotesque monsters for a few hours.",
            "review_score": "1"
        },
        {
            "review_text": "Great little arcady isometric shooter. Simple concept and low systems requirements make this retro game a must for any collection with a space for an almost casual game you don't need to take too seriously.",
            "review_score": "1"
        },
        {
            "review_text": "Short game comprised of running away while blasting aliens with increasingly more ridiculous weapons. It took roughly 3 hours for me to complete. I changed my review to recommend now that it is a more reasonable price.",
            "review_score": "1"
        },
        {
            "review_text": "Nice old-school gory isometric alien-splatter game. Painting the halls... in red.",
            "review_score": "1"
        },
        {
            "review_text": "i thought it was pretty good for a cheap time waster....its pretty generic and gets repetitive fast...but its really fun if you do a level at each sitting",
            "review_score": "1"
        },
        {
            "review_text": "Dated and completely unpolished...yet still simple fun. Play it for about 60 minutes at a time for a great adrenaline boost. The freeze cannon is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games EVA! ",
            "review_score": "1"
        },
        {
            "review_text": "Childhood memory.  It works.  It is fluent.  It is a good stress relief game. Just like the Postal series (1 and 2 that is).  Just buy yes?",
            "review_score": "1"
        }
    ]
}