{
    "app_id": 331190,
    "name": "Master Spy",
    "release_date": "2015-09-08",
    "developer": [
        "TURBOGUN"
    ],
    "publisher": [
        "TURBOGUN"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Platformer",
        "Stealth"
    ],
    "achievements": 0,
    "positive_ratings": 200,
    "negative_ratings": 47,
    "price": 6.99,
    "description": "Throw on your invisibility cloak and put your reflexes to the test in this brutal precision platformer brimming with espionage, intrigue, and betrayal! Featuring an Original Soundtrack by Grammy Award Winner RAC.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/331190/header.jpg?t=1541513728",
    "minimum_requirements": "OS: Windows 7 Processor: 2 Ghz Dual Core Memory: 2 GB RAM Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "First to review a game, so nervous ;-;  I streamed a full walkthrough of this on Twitch and this is what I have to say:  If you are looking for challenging precision platformer, with high quality pixel art backgrounds, fitting music, engaging retro-style cinematic cutscenes - this game is for you.  The game itself is really simple, you play as Master Spy, who can only jump(+double jump roll, which is important move) and clock/decloak to solve all your platformer needs. Every level consists of 1 or more screen where you have to find keycard/s to unlock the exit to the next level. Be warned, levels quickly become from easy to really hard and each new level tries to add a new mechanic to the enemies or environment. Cutscenes in this game will probably inspire you to play more and more to uncover what's going to be next in the game. And speaking of cutscenes, I strongly suggest look for 8 very well hidden secret areas in the game which also unlock even MORE cutscenes to the main plot. Not gonna spoil much, but consider engaging gameplay experience.  If you played games like Super Meat Boy, Boshy or any other action precision platformers, you will find this game quite similiar to your likings.  The only minor complaints I have is that game doesn't have at the moment configurable Audio, only disable everything. No sliders for music or SFX. So Windows Mixer is the only thing you can do besides using your hardware's sliders. No reconfigurable buttons and instead of classic PC platforming scheme of Z and X, game uses X and C buttons, 'C' for 'Cloak'. Expect at first to missclicks a lot to Z when you want to jump, which will fail for you, if you are used to classic Z/X controls. Alternatively, you can use Controller.   P.S. Press T while you are in game's level :P ",
            "review_score": "1"
        },
        {
            "review_text": "Wow wow wow. I enjoyed this game so much more than I thought I would. I'm rarely compelled to write reviews but this game deserves a lot more love than its getting.  When I think back on it, in every way this seems like a game I wouldn't enjoy. I'm not good at precision platformers and this is an extremely difficult one. But the incredible level design and instant refresh made it not only tolerable but enjoyable. I didn't get mad when I would die, it was just a puzzle I was figuring out and getting closer and closer with each attempt. And you will die a lot. For example, in the 5th and final act, I died a total of 863 times.  Even though I got an F grade on all 5 acts, I feel like a badass for finishing it.  The aesthetic is great, the cutscenes and soundtrack are absolutely incredible. I will be purchasing the soundtrack as soon as I finish typing this review.  This game certainly isn't for everyone, but I can't speak highly enough of it. I'll certainly be watching for what Turbogun does next. Thanks for making this great game TG!",
            "review_score": "1"
        },
        {
            "review_text": "The platforming never felt downright frustrating or unfair. The rooms never devolved into giant puzzles and I felt like I was getting through them as the Master Spy instead of sitting and analyzing a big multi screened puzzle. I can really think of only one sequence that required a lot of percision on my part, the rest of the game is just you and the Spy.   * The soundtrack is also fantastic, and if you like the old Ninja Gaiden Nes cutscenes then you'll love the ones in Master Spy.",
            "review_score": "1"
        },
        {
            "review_text": "My first encounter with Master Spy was its soundtrack, it was so good I picked up the game and played it and was not disappointed. The game is fast paced for a precision platformer, introducing elements like invisibility, double jumping and much more. The game not only demands you take in your environment but also be able to navigate it deftly and without getting caught. Don't think stealth game however, the game requires you to move fast and sometimes to improvise on the spot to avoid detection. That being said the game is not easy, in fact in a moment of desperation near the end I reached out to devs for some help and they were more than happy to oblige me, which was fantastic because the ending was amazing. That brings me to another thing, the cut scenes and story are another strong point for the game, the pixel animation is fantastic and the plot and characters are just kitschy enough to make you giggle at times. By and far one of the best indie games I've played so far this year.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played a platformer as challenging since Super Meat Boy.  Overall, a very fun challenge and a soundtrack worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game! Each room is a challenge, often in multiple steps that you have to figure out, it's got a nice puzzle/skill gameplay, it's challenging and it's very good looking, highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed the game!, amazing art and gameplay, I can't remember how many times I got caught. Addictive.",
            "review_score": "1"
        },
        {
            "review_text": "A real challenging game with a great soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "The game looks cool at a glance and it's fun and fair until you reach the third stage. From there things start to feel cheap or poorly thought out. There are a lot of bugs, like where you'll trigger a collapsing platform even though your guy passed through it without getting any footing, very annoying and you'll often find yourself dying for things that aren't your fault.",
            "review_score": "-1"
        },
        {
            "review_text": "this is fun and hard. There's a butt ton of cool art and animation. The music is dank af. would buy again 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Has much more in common with Super Mario Brothers than a modern stealth/espionage platformer. I won't pretend I gave this a fair shake, because I have no interest in that sort of game. That's on me, but I still don't want to play it, and I wouldn't recommend it to someone interested in a sneaking game.",
            "review_score": "-1"
        },
        {
            "review_text": "Art and music are great, but brutal platformer plus puzzle game?? Really?? I still like it, but...seriously??",
            "review_score": "1"
        }
    ]
}