{
    "app_id": 331160,
    "name": "Disney•Pixar Cars",
    "release_date": "2015-02-24",
    "developer": [
        "Beenox"
    ],
    "publisher": [
        "THQ",
        "Disney Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Racing"
    ],
    "tags": [
        "Racing",
        "Adventure",
        "Open World"
    ],
    "achievements": 0,
    "positive_ratings": 197,
    "negative_ratings": 73,
    "price": 15.49,
    "description": "Play as Lightning McQueen, a rookie racecar looking to win fame and fortune at the Piston Cup Championship, in the video game adaptation of Disney•Pixar's Cars.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/331160/header.jpg?t=1542762685",
    "minimum_requirements": "OS: Windows Me / 2000 / XP / Vista Processor: Pentium III 800MHz or higher Memory: 256 MB RAM Graphics: Any 3D 32MB DirectX 9 compatible graphics card (nVidia GeForce 2 or ATI Radeon 7500 or higher) Storage: 500 MB available space Sound Card: Any 100% DirectX 9 compatible soundcard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "My favorite video game from all games that i ever played in my entire gamer life.The nostalgia is just beautiful. The story is happening after the first movie.The gameplay is very good for a 2006 game.Great memories with this game.If you say ``You suck`` well,you don`t know the old games or the franchise of Cars.Bought with 5$ instead of 20$ in summer sale and i`m very happy i bought it on my b-day.The levels are good for beginner players of racing games.The free roaming is very interesting.Also you can play Versus mode with your friends Road Races,Mini-Games or Piston Cup Races.I will never forget this amazing game.Also this soundtrack is very nice. If you are looking for racing games you should give it a try to this game. Final note:10/10",
            "review_score": "1"
        },
        {
            "review_text": "So far no crashes. I have been running it in adim with the old compatablity mode. So if you are wondering does this work. Well mine does on a 4790k,980ti, 16gig ram, and Win 10.  Game play is good and is an upgrade to the consoles unlike Cars 2.   Graphics are older but ok However! This game runs at 30fps with no option to turn it off and crashing into things always gives a slight pause in the hub world. You should check out Mater National if you are interested in this. Most of the game is the same but it does not support widescreen. Though it is 60fps! with much better textures. More hub world and new tracks. I perfer over this older verion.  That being said the story and racing is all very good. The hub world is also a nice touch.   I still recommend this game because it is fun. And that is the most important thing.",
            "review_score": "1"
        },
        {
            "review_text": "i wanted to like this game because i played it as a child, however i bought it on sale and tried playing it. no matter what i did the game would not let me play, everytime i click play it would turn black and close out of the game with an error message, very dissapointed.",
            "review_score": "-1"
        },
        {
            "review_text": "its the most exciting and BEST game for pc of all timeright now! AND ONLY3.95!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "PLEASE FIX EVERY TIME I GO TO THE ARCADE IT STOPED RESPONDING WHAT DO I DO HELP?",
            "review_score": "1"
        },
        {
            "review_text": "7.9/10  Awesome game from my childhood New characters Music was fun and bouncy Races were intense Room to improve Overworld was huge  Animations weren't the best Voice actors weren't the best (But were the originals in the movie!) Driving controls felt sluggish",
            "review_score": "1"
        }
    ]
}