{
    "app_id": 331200,
    "name": "Grass Simulator",
    "release_date": "2015-04-01",
    "developer": [
        "Daniel Davies"
    ],
    "publisher": [
        "Daniel Davies"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Memes",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 491,
    "negative_ratings": 389,
    "price": 3.99,
    "description": "Strap it on and lock 'n' load in Grass Simulator, where you will Shoot, Loot and MOO! your way through multiple game modes revolved around...GRASS! Grass Simulator will revolutionize the way you look at grass.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/331200/header.jpg?t=1453810992",
    "minimum_requirements": "OS: Windows XP Processor: 2.4 GHz Quad Core 2.0 (or higher) Memory: 500 MB RAM Graphics: Intel HD Graphics 4000 Storage: 900 MB available space Sound Card: Yes",
    "recommended_requirements": "OS: Windows 7 Processor: 3.4 GHZ Quad Core 2.0 (or higher) Memory: 4 GB RAM Network: Broadband Internet connection Storage: 900 MB available space Sound Card: Yes",
    "reviews": [
        {
            "review_text": "This review is split into two sections; the first section lists pros and cons, and the second section features a short review.   Pros and Cons",
            "review_score": "-1"
        },
        {
            "review_text": "a buggy mess lacking in stuff to do. dont tinck this is like goat simulator as contet wise",
            "review_score": "-1"
        },
        {
            "review_text": "I spent more time on this game than the developers.",
            "review_score": "-1"
        },
        {
            "review_text": ":(",
            "review_score": "-1"
        },
        {
            "review_text": "This game is supposed to be a sarcastic game that mocks other low-effort simulators.  It fails.  The reason why it fails is because it's sarcastic,  BUT IT'S NOT A ♥♥♥♥ING GAME.  Surgeon Simulator is an amazing sarcastic game that mocks simulators. This works because it has the sarcasm, but it still has a game. This, however, isn't even worth a single cent (however if you get it free then you can idle it for steam trading cards and sell them. As long as you don't support the devs).",
            "review_score": "-1"
        },
        {
            "review_text": "My dear god why oh why did I waste my money on this game!!! I admit it's funny........ FOR THE FIRST 10 SECONDS!!!! But jesus H christ! I really am lost for words on how stupid and crap this game is.   Please for the love of god stay the hell away from this game please!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Why was this wishlisted for a half year? ... xD",
            "review_score": "-1"
        },
        {
            "review_text": "Why do i have this sh*t in my recomendations?!",
            "review_score": "-1"
        },
        {
            "review_text": "Very boring. The multiplayer is basically a normal fps. But NO ONE PLAYS IT!",
            "review_score": "-1"
        },
        {
            "review_text": "Spent too much effort on cow shooting. I wanted an HD grass-growing simulation. I did not get that.  -1/10",
            "review_score": "-1"
        },
        {
            "review_text": "this is not fun in any way",
            "review_score": "-1"
        },
        {
            "review_text": "I'd recommend this game over CS:GO.",
            "review_score": "1"
        },
        {
            "review_text": "  The worst game I have ever played in my life besides CSGO. At least CSGO has bombs.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok, so I thought this game would be fun just to mess around in but, this game sucks. You don't do anything other then kill cows in a field of grass, and most other modes don't even work, and it's not because of my computer, it's the game my PC runs the game smooth but the game will decide not to work. I recommend getting ORION: Prelude for $1 or 0.49 cents on sale way much better. This game is not worth $5, maybe 0.50 cents at the most.",
            "review_score": "-1"
        },
        {
            "review_text": "A friend bought me this as a gift so I knew it was going to be bad, but I ended up playing for a little while just to try and figure out what the point of it is.  I had a strange idea that there may be some competition with neighbouring blades for sunlight or something which (although being absolutely nonsense) would just about justify it's existence, but instead I got to float around a field with invisible barriers as a mystery being for no apparent reason.  There are a couple of weapons but all they appear to do is shoot noise that will eventually cause a cow to explode using what looks like the same explosion used on mega bomberman in 1994.  Fair play to the developer though because whether people are buying it as a joke or not, people are still buying it and that's about as close to selling fresh air as you can get.",
            "review_score": "-1"
        },
        {
            "review_text": "Thankfully I got this for free, because it sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "When yuo just wana 420 blaze it smoke weed every day, this is right gaem for yuo. I didnt knoe how to kill but thanke god there is RPG!!!!  MUSIK 5/5 SPINNINK COWS 5/5 MULTIPALY WORKIUNG !  Refund system test 5/5",
            "review_score": "1"
        },
        {
            "review_text": "I had lots of fun doing multiplayer with my friends ",
            "review_score": "1"
        },
        {
            "review_text": "i got the 4pack as a joke on sale like 80% off and gave it to sum radom frinds we got a kick outa it for like 15mins and had a good laf and now and then i launch it just so it will show up to my frinds im playing for loz.  for me the start menu is broken and half off the screen and its hard to click on things to start somfin outher then that it works...sorta.  not worth full price get it on sale 80% off or mor for a joke or its useles no real gameplay to it but i regret geting battle field 4 thru oragin (wich i refunded) more then i regret geting this 4pack on sale",
            "review_score": "1"
        },
        {
            "review_text": "+ You can watch growing grass! :) + A lot of cow, especially 'dubstep cows'. + Grass Graphics! + Multiplayer! - No black cow. (Its racist you know). - You cant play as grass. :( - No story:( I recommended this game for gamers who loves cows (and grass) and quality games, or graphics, whatever buy this! :)",
            "review_score": "1"
        },
        {
            "review_text": "  This is probably one of the best games I have ever experienced in my entire life. If you enjoy masturbating constantly for 4 hours, that kind of behaviour is normal for this game. There are many different ways you can play, there is a ear deafening Disco arena, the ear deafening DubSteap arena, and last but not least the ear deafening opening main menu.  I didn't know what was more important, playing this game or breathing.  ~  twitch.tv/LeftResponse ",
            "review_score": "1"
        },
        {
            "review_text": "    A good game to be the best MLG player in the Wolrd!",
            "review_score": "1"
        },
        {
            "review_text": "It's kinda fun to play",
            "review_score": "1"
        },
        {
            "review_text": "69/10 - Has multiplayer, Has Grass, Has Dank Dubstep",
            "review_score": "1"
        },
        {
            "review_text": "It's great!",
            "review_score": "1"
        },
        {
            "review_text": "I actually got more than I expected.  All i wanted was to watch grass grow but I also got guns n techno  10/10 compared to sunset",
            "review_score": "1"
        },
        {
            "review_text": "Killed cow, dropped slow motion power up. would do again!",
            "review_score": "1"
        },
        {
            "review_text": "I was once playing Team Fortress 2 and people usually told me drink bleach. Until I met this one guy and he told me try grass simulator, surprised I bought the game. The first minute I started it up I got virtual cancer and up to this day I have been trying to fight this grass simulator cancer. Please help and donate, great games to help stay alive.  10/10 would get cancer again",
            "review_score": "1"
        },
        {
            "review_text": "Well, considering this game was released April 1st, the grass simulation is not that bad hence it delivers what was promised, it's an 'OK' game.  And also considering i got this game as a gift and i sold some of the cards for money, i would say it was just profit.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what all these ungreatful ♥♥♥♥♥♥ bags have wrong with this game. It's epic! You've got exploding cows, epic guns, cocaine mode(aka fast mode) , slo - mo mode, realistic physics, real challanges, scoping in on a pistol, and there are a lot of game types! People are saying the textures are bad? Well, they aren't. They probably put it on the lowest setting so that their $5 computer didn't crap out. Don't listen to these guys. This game is pretty damn cool. I got it for free, but you should buy it. I'd be happy if I spend money on it. I'd feel like I used my money wiseley. This game is worth 10 dollars, and to those ♥♥♥♥♥♥♥s voting it down and crapping on it, get a better computer and appreciate that the developer made this. You probably couldn't.  Moral of the review -potential goty runner up, worth buying. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "no thank you",
            "review_score": "1"
        },
        {
            "review_text": "This isn't a game.  Nothing in this 'game' works. There is nothing for you to do or interact with. Please campaign to remove this title from Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is lit",
            "review_score": "1"
        },
        {
            "review_text": "My 29 year old younger brother bought this 'game' for me as a joke. Part of the 'joke' is that it is not a game. Games offer some sort of enjoyment to the human being interacting with them. There is no redeeming qualities for this title. Save your money, and if someone gifts it to you, return it to them. The 'game' Air Control is better than this. I would rather step in cat feces than have this in my library. If you have a steam friend, and this game is in their library with more than a few hours of game play, I would advise removing them from your list, and even blocking them entirely.",
            "review_score": "-1"
        },
        {
            "review_text": "Best game ever.. Congratulations on making what can only be described as an Indie Epic. Everybody should download this. You life will feel forever empty without it.",
            "review_score": "1"
        },
        {
            "review_text": "Ok let's be honest, this game sucks. I only bought it (on sale of course) just so I could say I had. It sucks",
            "review_score": "-1"
        }
    ]
}