{
    "app_id": 331440,
    "name": "bit Dungeon II",
    "release_date": "2014-12-15",
    "developer": [
        "Kinto Games LLC"
    ],
    "publisher": [
        "Kinto Games LLC"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Pixel Graphics",
        "Indie"
    ],
    "achievements": 15,
    "positive_ratings": 1599,
    "negative_ratings": 346,
    "price": 2.79,
    "description": "bitDungeon II is fast action-adventure game with a giant overworld to explore. You are a spirit in an undead world of demons. Your &quot;loved one's &quot; grave has been desecrated. Fight through these corrupted lands, and bring peace to her soul.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/331440/header.jpg?t=1547063443",
    "minimum_requirements": "Minimalne: System operacyjny: Windows XP, Vista, 7, 8 Procesor: 2.5 GHz Pamięć: 1 GB RAM Karta graficzna: Any with Hardware 3d Acceleration DirectX: Wersja 9.0c Miejsce na dysku: 100 MB dostępnej przestrzeni Karta dźwiękowa: On Board",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "bit Dungeon II reminds me of the original Legend of Zelda. The game board is layed out much the same way, has caves, dungeons which feel very Zelda-like; However, unlike LoZ, bit Dungeon II allows you to equip a variety of different weapons and armor, each with it's own stat and damage bonuses. You can collect different types of currency, to purchase weapons, armor, open chests, and more. bit Dungeon II may not look like much, but is actually a fun game that has a very 90's feel to it.",
            "review_score": "1"
        },
        {
            "review_text": "A great game with a lot of potential. Through there are a lot of things that are still missing and hopefully they will be updated. 1. Please make a more in depth description of what each stat does. Maybe just add a section at the start of the game where everything is being explained. I still don't know what intelligence really does? Boost the staff magic attack? 2. Please add the remaining life count to the campfire rest thing. 3. Sometimes, like for example with the eater boss you are stuck in a corner and not able to move out and die pitifully. sometimes also happens with normal monsters. probably only happens if you have a bow. 4. maybe a bit bigger inventory, or just being able to switch between two weapons and stuff. 5. also it would be cool if whatever dropped would stay a bit longer, for example if I mistakenly switched my weapon with an inferior one, didnt notice and then left the room, if I could just go back into the room and get the weapon would be cool. if I walk 2 rooms and then get back to the place where the weapon would have been its ok if it would be gone.  6. I guess its a bit too short considering that its very fastpaced. 7. bossfights ( every boss exept his wife? was that his wife? the lighsaber ghost at the altar^^) are very easy. Update: ok it depends on equipment - or so to say luck. still they are quite easy exept wizard take a sword and keep on slashing and the bosses and they die. 8. can we get hardmodes?  Vampiric shield of the Devil or whatever it was called was op :D well if it procs I still don't know how big the game really is but hopefully it will get even bigger. I think at the moment the game is not yet worth the 5 euro original price but it will definitely be worth it in no time. I still recommend this game because its really fun :)",
            "review_score": "1"
        },
        {
            "review_text": "Overall, this is a fun little game.  It's a 2d top down adventure game with a small RPG aspect. You kill monsters, level up, get equipment, slay bosses...the typical stuff. It takes some time getting used to the controls.  However, there are some downsides that can make the game frustrating at times:  - Block, attack, special attack are the same button - Some enemies are easy, while others are way too hard.  - If you run out of lives, you start from scratch - level 1 and no gear.  The game is rather short, completed it in 3 hours my first time, but you'll get faster in following playthroughs. For the low price that's okay.  You can always play NG+ once you beat the game.",
            "review_score": "1"
        },
        {
            "review_text": "nice little game. addictive.  Bows are so OP though. Get a bow, win the game.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game with a bit of frustration. I find myself playing this game for 10 to 20 minutes at a time. The loss of all progression as a character gives me an emptiness inside that has me quit the game after a good run and wait a week or 5 before I pick it back up again to play.   However, the story progresses despite of your deaths and the game is satisfying. Especially when you've really taken the time to grind your character up so you are an ultimate ba. But eventually that toon too shall die and therein lies the delima of this game.   Your character development moves kind of slowly. You have to grind your way up and really build on your character. However healing is a no no unless your in a temple. So you have to find the right places to grind and level up while also finding the right loot to really make the game fun and worthwhile. After that, you take on the temple, kill the boss, and eventually die. This starts you back a square one again. And while I enjoy this game, and I enjoy rouge-likes as a whole, there is something about grinding to build a character that doesn't last that makes me less prone to long play sessions over other games of this type.  However, as a whole, I recommend!",
            "review_score": "1"
        },
        {
            "review_text": "I think I write this as first hour impression. This game is a rougelike zelda that doesn't seems has many 'unique' things to offer like binding of isaac/our darker purpose, etc. but in my first hour it is quite fun until I found out that my extra lives can't be stacked (I think I received one from the soul near the spawn place and the second is after reaching lv 20 or 25 -- I don't really remember) I think there should be minimap or a button for map to help player exploring the area. I found it quite frustrating to find the dungeon.  My first 2 minutes -- about 2x play because I didn't understand the button (I use controller) and I don't know if we should pick the weapon from the room inside tree. but this game is very fast pace and you'll get the point after few minutes. I think weapon system in this game doesn't provide you a lot of different combination, after 4-6 tries I think shield + small weapon is balanced. I wonder why there is no slot for potion, I meant it doesn't have to be complicated RPG-like item menu, something simple like binding of isaac's/our darker purpose item would make this game more interesting than a lot of tries and error.  I'm not really into rougelike -- I'm rouge lite guy, permadeath is fine as long as their upgradeable thing, but that's my preference of genre. I'm Ok with rougelike as long as it's fun and not punishing. I thought people's rating for this game would be positive/very positive, but mostly positive is underrated. I think I might change my mind If I play much longer but up to this point I recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is very addicting; I've played for 4 hours straight. The maps are challenging yet manageable to get through and the game's goal is simple and straightforward. My only advice for new players is to keep the soul with you at all times. I have still yet to finish the game because of my rage quit, lol. Great game overall.  Pros: Challenging mobs and surprising settings Fair 'trade' system with NPCs NPCs have a sense of humor and say what they have to say Good chances of equip and item drops Fun method to acquire stat boosts other than the traditional need to level up Graphics are smooth and creative Good soundtrack and sound effects Different builds and equipment to go for  Cons: There is little description towards the game controls (I like mine to be more definitive and customizable) Barely any description on what the stats do The game reset is not really a full reset such that you keep your coins The items drops that have yet to be spawned interfere when attacking enemies when near it. Sometimes the mobs surrounds the character while you're standing on the item and only being able to do basic attacks will end up killing you  EDIT: Finished the game and enjoyed every single fun and agonizing moment. One of the achievements requires you to choose the 'beta-' version of the game. Also in this version, everything seems the same but the most noticable was the implemented map. Although the map is very helpful, the extra hand will only speed up this short gameplay even faster (unless of course if you enjoy fast and repetitive gameplays, and regardless of which version, each time you complete the quest, every mob increases in difficulty), taking out the challenging factor which is trying to figure out and remember the various dungeon and cave locations.",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually quite fun, though it can be difficult at times.  I've encountered no bugs, it's simple yet fun to explore and fight. Certain enemies are pretty strong and will kill you; remember you only have 2 lives (to start) before it resets your stats and level.  Definately reccomended during the sale.",
            "review_score": "1"
        },
        {
            "review_text": "Spam the spacebar ♥♥♥♥♥♥♥♥♥♥♥♥!  The arrow and magic weapons need a little work but pick up a shield and an axe and you've got good little game right here. The boss fights are also very underwhelming but attacking in this game is just so satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "QUICK REVIEW: Mix The Legend of Zelda: A Link to the Past with the Demon's/Dark Souls series :)  I love it, I have done one playthru in just under six hours, and will do more. Different ways to outfit and bring up your character make for good replay value :)",
            "review_score": "1"
        },
        {
            "review_text": "The trailer does a good job advertising this game like it's a darker version of Link to the Past. It had me so hyped I decided to put five dollars into my Steam Wallet to buy it. Big mistake. Once I got the game, I quickly realized that the gameplay doesn't live up to the polish of the trailer, and only resembles a Zelda game on the surface. While the world of bit Dungeon II looks visually interesting, there is little to no story or exposition to explain what's going on. I'm supposed to transport a dead woman's soul apparently...but why should I care about her? Who desecrated her grave? Where the heck am I supposed to be going? It's a shame there's not more background about the world of Bit Dungeon II, because I really would have liked to know more about the world.  Mechanically speaking, there are an abundance of collision issues with the game, especially with walls and destructible objects. Colliding with these objects makes the character sputter back and forth, to the point that you'll be pushed into the room you were previously in. The depth of the battle mechanics is woefully shallow. Point. Click. Kill. That's all there is to it. The puzzles are disappointing too...they consist of moving rocks over switches, and that's about it. I was hoping to acquire different tools to solve different types of puzzle challenges, but the game emphasizes action over puzzle solving.  TL:DR Bit Dungeon II looks awesome in the trailers, but doesn't live up to the hype.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a must get if you're into 8 bit style art and dungeon crawling gameplay, and the soundtrack of this game is amazing, sets you in into the 8 bit adventure mood.",
            "review_score": "1"
        },
        {
            "review_text": "The core gameplay loop is highly engaging if unoriginal, a fast-paced ultra-simplified knockoff of Zelda where positioning and reaction speed is measured while strikes are automated.  The aesthetic and the few scraps of story leave me craving for more. It feels like there's a whole weird and varied world that your character does not give a crap about, helped by the odd Gnostic name drop.  It's a bit of a shame that the stats are so opaque, or that in practice all the boss battles come down to 'either I have the numbers to just wail on the boss and have it fall over before I do... or not'. However with the simplicity of the controls and the high octane format there's a limit to the potential for deep tactical combat.",
            "review_score": "1"
        },
        {
            "review_text": "bit Dungeon II is a simple but enjoyable rogue-like adventure game.",
            "review_score": "1"
        },
        {
            "review_text": " A Short But Sweet Retro Rogue-Like Legend Of Zelda Inspired Game",
            "review_score": "1"
        },
        {
            "review_text": "A funny dungeoncrawler with a light rpg-system.  It saves at the point where you leave the game, so it's perfect for short gamingsessions.",
            "review_score": "1"
        },
        {
            "review_text": "I am not entirley sure what's happening in this game, but smashing things is fun and fun is good.",
            "review_score": "1"
        },
        {
            "review_text": "A game combine with dark souls and link to the past that makes a great piece of a game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A short game with simple mechanics, yet a very fun experience.",
            "review_score": "1"
        },
        {
            "review_text": "Thanks to the dev that giving over 50 free keys to people :D    Review",
            "review_score": "1"
        },
        {
            "review_text": "for $1, its worth it",
            "review_score": "1"
        },
        {
            "review_text": "I love dungen crawlers! and this game brings me back to the days when i payed the old Legend Of Zelda games! Now this game does have challange and a limmited life system witch keeps you playing, great fro the price but i would like to see some DLCs for it all in all its a great game",
            "review_score": "1"
        },
        {
            "review_text": "Dungeons, temples, desert,cursed forest-----------------Challenging Game maps. Swords, shields, dual wielding weapons, spells-----------Customize your own play style. 'Bonfire System' similar to Dark Souls series-------------Can it be the last time you come back?  If you like dungeons and slaying monsters with simple control settings. This is the game for you. ",
            "review_score": "1"
        },
        {
            "review_text": "SNES Souls. 9/10",
            "review_score": "1"
        },
        {
            "review_text": " bit Dungeon II  Rating: 7/10  Super retro game with modern mechanics. Easy running through screens.  Easy to get into, hard to quit. Fun!",
            "review_score": "1"
        },
        {
            "review_text": "A Diablo-esque type game with the forgiveness level of Dark Souls. The combat at first is something that must be discovered by itself, but after a few rounds you'll begin to understand the attack type and realize that it's not that difficult. Random luck-of-the-draw items appear from enemies, chests, crates, etc. could give you a much needed surviving chance. I've beaten one dungeon and had never replaced my weapon until the very last boss; just gives you an idea of how simple the game can be. For the price, I'd say it's worth it if someone is looking for some time to kill and enjoys games like Diablo. I suppose if that wouldn't be your cup of tea, then there wouldn't be much excitement found here besides a simple dungeon crawler.",
            "review_score": "1"
        },
        {
            "review_text": "This game is A S S but it's that kind of A S S that, despite cellulite, you love to spank.  I recommenBUTT this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is a pleasent surprise! It is a nice Action RPG Rougue-like that is very easy to get into, but provides a lot of depth. The graphics are great, the music is awesome, and the controlls are tight and responsive.  If you enjoy games like The Binding of Issac or even Dungeon levels in the Legend of Zelda games you should really pick this up!",
            "review_score": "1"
        },
        {
            "review_text": "Dont let other people who need their hands held fool you. This game may not have a tutorial or tell you where to go, but as someone who is almost done with it I can assure you, after about an hour you will understand a lot of it. Plus, its the fact that you are a wandering spirit without purpose at first that sold the game to me. Its amazing and the story is well done once you start hearing what bosses and others have to say. You can piece some stuff together and for me its just amazing. You never know what you are doing until after you have done it, which to me is amazing. No hand holding. I recommend this game and would easily pay double the amount asked.",
            "review_score": "1"
        },
        {
            "review_text": "tl;dr: It's like a mix between A Link to the Past and Dark Souls, but it's a glorified flash game that lacks documentation and polish. There's hope, still, as the game is still in development.  Feels like an Early Access game; weird menus, strange keybindings (return toggles between fullscreen and windowed mode), disabled options (Online mode?). This would be a really awesome flash game, which might be because it basically is, it's a flash game wrapped with Air to run natively.  No instructions or documentation is provided, Steam's Guides section has a bunch of guides in russian, none in english. The authors website is equally uninformative, featuring only links to the various marketplaces the game is available in, plus some screenshots of the game in development.  The gameplay is alright, and shows promise for more. Seems the game is still being developed, but I'd hold off right now on buying, unless you're OK with the pre-release state the game is in currently.",
            "review_score": "-1"
        },
        {
            "review_text": "Guy auto attacks(Who decided this?)........ thumbs down.....Could have been such a great game",
            "review_score": "-1"
        },
        {
            "review_text": "This game is alright, and it was certainly fun for the 2 hours it took to beat it. That's all it took though. I was looking for a lot more out of this game. It wasn't bad though... I don't know. The combat wasn't hard, just hit enemies faster than they kill you. If you get any items with 'regen' or 'lifesteal' your game gets so easy it isn't even a challenge, as long as you don't just stand still and get hit while waiting for stamina to regenerate. It just wasn't that great.  I just wouldn't buy it for $5 again. If it's on sale for $1, then you can pick it up. It's super short and very much a button mashing fest, so just expect that and you should be okay with the game",
            "review_score": "-1"
        },
        {
            "review_text": "doesnt even launch on linux, missing executable. I will change my review if its fixed or if I ever load it up on a windows pc and like it.",
            "review_score": "-1"
        },
        {
            "review_text": "49",
            "review_score": "1"
        },
        {
            "review_text": "A great little title if you have a few hours to burn and are quite happy just running around bashing monsters, dungeon delving and collecting some gear. It's fun to play and pretty simple. There isn't much depth here, so be aware that after a few hours you'll probably have seen most of the game.  Don't forget to go into the hut at the start to buy a weapon! :meatboy:",
            "review_score": "1"
        },
        {
            "review_text": "I don't know whether I approve of this game or not. So we're just gonna say no. But keep in mind I had a good amount of fun with this game for the roughly 2 hours I played.  First off, lemme get this out of the way, I can't get past the frozen maze. I dunno if my copy/version is just buggy or something, I'm going to uninstall and redownload and update this review. But, I follow the directions the dude in the cave tells me to exit the maze (ala, original Zelda), it won't let me progress. I simply keep repeating the maze never moving forward. I've restarted multiple times and there was no fix.  On the topic of replayability, once again I don't know if its an issue only effecting me, but the map just doesn't change at all. When I go into a rogue like game, I expect a big difference in the game on new playthroughs. I was expecting something closer to Binding of Isaac, but instead the only difference was (Possibly) slightly different dungeons, different item drops, etc etc. If you know where the caves are on the overworld, you're free to casually stroll and pick up all of your stat buffs before even walking into your first dungeon.  Not that you need to. Grab a bow or an axe, and you're going to rip right through the game like a hot knife through butter. I originally started off using a staff, and enjoyed the challenge of the game for a while... That is, until I walked into a dungeon room with very unfortunately placed enemies who immediately gangbanged me without a chance for me to fight. My next character had an axe, and every enemy died near instantly, including bosses. Just spam the quick attack and they get wrecked.  The enemies were incredibly similar in tactics. Waddle towards you, maybe shoot an arrow or magic attack. Charge them and they die, it doesn't make a difference. The bosses suffered the same fate. They looked different, but there were no differences in strategies for killing them.  The game was fun enough. But because I couldn't progress it's flaws became apparent super quick. It's not balanced, with some weapons providing an incredibly easy runs or a horribly unfair experience. It became stale quickly, wandering the exact same overworld moving down slow moving and easy enemies became boring fairly quickly.  Would I pay 5 dollars again? Nope. If it had multiplayer? Still probably no, which is a rare thing for me considering I absolutely LOVE co-op games. I'd rather spend a few extra bucks for increase replayability, such as Binding of Isaac.",
            "review_score": "-1"
        },
        {
            "review_text": "  U should put multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "Bitdungeon 2 is a hard game to review pretty much because the combat sucks. Like everyone is saying, you walk into the opponent to auto attack and you can do more damage by pressing RMB or A on the controller. You basically just spam it until your stamina is depleted. Killing bosses consists of literally standing in place and doing this over and over with very little moving out of the way of projectiles.   A few things I found annoying:  -When you enter a new room in a dungeon, you are facing the door and not the room, leaving you open to attack. -The same button is used for pretty much everything on the controller. A blocks, uses a special attack, and basic attack and picks up items. So, many times you will be spamming attack and accidentally pick up a new item and equip it when you didn't know what it was.  There is a map that was added and for good reason. BD2 desperately needs this as running around after you've cleared a few dungeons gets tedious. You are supposed to beat all the dungeons on two lives. So it's sort of a rogue-lite if anything. The developer pretty much took inspiration from Dark Souls as when you die, you have one chance to retrieve your soul. If you die again, game officially over and you lose all the levels and gear you've accumulated.   The major draw for me initially was the way the gear looks even in pixelated form. You can actually make your pixel avatar look pretty badass. Things like capes will show up on your toon after you equip them. Epic weapons look pretty unique too. You will pretty much always want to equip 2 handers as they do the most damage. 1 handed epic weapons usually only drop after killing a boss, but they're supposed to be random so that may've just been my terrible luck.  For a 5 dollar game...BD2 is worth it. It's a good lunch break game to just whip out if you're at home and play for 20 minutes. Other than that, it get's extremely boring as most playthroughs look the exact same. The dev claims each one is procedurally generated. I suppose this is true. But the level design is so uninspired that each corridor on each playthrough appears the same to me.",
            "review_score": "1"
        },
        {
            "review_text": "Took some time getting used to this game. Once I understood how to play it was okay. Controls are very limited. You can't see your stats when you have an opportunity to upgrade them. Skills and weapons are never explained, so it's all guesswork. Two life death system is very punishing and really frustrating. There are no maps, and when every area looks the same, it's pretty annoying. The item system is really hard to understand when stats aren't explained. I do like that it is simple and you can get going straight away, but I feel it is TOO simple. This game is more frustrating than fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Three words, One More Time",
            "review_score": "1"
        },
        {
            "review_text": "I feel robbed of $5. I could have used that money to buy another copy of Dark Souls.",
            "review_score": "-1"
        },
        {
            "review_text": "Ladies and gentlemen, Welcome to die!  This game is very cheap and pretty addictive. If you're a fan of Roguelike games then you pretty much have to buy this. It's very unique. Also I heard the sad tale behind the making of this game. If you love the children you have to buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, addictive gameplay, combat takes a little to get used to as it plays like YS if you never played YS then you just run into the enemy, but it takes a little art.   8/10 and worth your money.",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome!!!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game, feels like its from SNES era but has RNG gear elements. Seems like it has replay value, the game dificulty rises as you clear dungeons (I don't think it matters what order, I ran around and did them as I found them like I did on the old zelda games xD...) If you feel lost you can go to guides section and get a map if running arround isn't your thing.  Death has no penalty the first time, but if you can't make it back to where you died (kind of like darksouls) and die again, you have to restart. I personally like penalty for death so I think this is awesome.  I wish I could comment on boss dificulty but I got super lucky early and got a weapon that let me breeze through them so not sure how much variety is in there attack patterns.  All in all I think if older style of games is your thing, you should try this :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is definitely enjoyable! It's nice to see that there's different environments and the creatures are pretty unique. I think one irk of mine is that the boss I've fought so far are all from the first game. While it's honestly fine I hope there are quite a few different ones. I've spent so many black ball things on those gold chests and never got a good item but that's just bad luck. (you'll die a lot )  I've spent so many black ball things on those gold chests and never got a good item but that's just bad luck.  Another thing is that there are enemies that just instantly attack you when enter a new area which is obnoxious.   Pros: retro graphics very much pickup and play making yourself fashionable combat is sort of like the old ys games where you slap into them $5 is a very good/reasonable price.  Cons: randomly stop attacking when you're on an enemy getting lost very easily  ",
            "review_score": "1"
        },
        {
            "review_text": "I really hesitated before writing this, but I have to admit, that this game is a failure, even after taking under consideration it's price.    Game mechanics:",
            "review_score": "-1"
        },
        {
            "review_text": "Controls are pretty awkward, with the same button being used for attack, block, and special attack depending on how long you hold it down. For a game entirely focused on its combat, this is really unfortunate.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is definately worth purchasing, been playing for a few hours now and im hooked!",
            "review_score": "1"
        },
        {
            "review_text": "The is awesome and it's and very addictive, i bought it when it was on sale and i was curious about the game, it dose deserve to be played, think that you are playing  zelda  with  borderlands  that should summerize everything",
            "review_score": "1"
        },
        {
            "review_text": "The game is extremely fun to play and can be fairly entertaining to just run around and chop stuff up. There are a few things that make it kind of annoying:  - Lack of a determined 'difficulty' for enemies (I went through most of the game on one life without real complications until I faced a skinny dude with a sword near the end, the game became extremely difficult there, ending my streak) - Easy to become overpowered (RNG drops makes it too easy to gain extremely powerful gear early on) - Far too hard to navigate without a map.  - Rooms in dungeons didn't always 'architectually line-up' (Some rooms would appear to be through a door, but then you would be lead to a completely different area.) - Controls are somewhat difficult to master without a clear tutorial.  Apart from those, the game was a really neat twist. The Zelda/Dark Souls/Diablo mix was definately really interesting to see. This game is definately worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, the controls are a bit odd, would prefer different buttons for the block and charge. Other than the controls, the game itself is great, I can definately see the inspiration of Dark souls and Zelda perfectly merged into one game.  Keep up the great work, your style has peaked a lot of interests.",
            "review_score": "1"
        },
        {
            "review_text": "i like this game a lot because it has that legend of zelda feel to it, the first one, in my opinion this is one of my favorite games with the variety of equipment that none of the legend of zelda games have, this game is a freaking masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "How to Play bit Dungeon II 101:  1. Play for hours. 2. Level your character up over 9000. 3. Get killed by a small green slime.   Best game ever 11/10.",
            "review_score": "1"
        },
        {
            "review_text": "Here is a core concept for game designers everywhere: Don't kill your player and end their game while they have no ability to react or make choices.  I've been killed so many times just changing screens. I'd move to the next screen and be dead before I could even move because monsters were spawned right on top of me.  Seriously, who makes games where you can die while loading?  Also the gameplay got boring very fast. Other reviews cover this better than I could.",
            "review_score": "-1"
        },
        {
            "review_text": "It's like if someone turned Link to the Past into a Dungeons and Dragons campaign, but the Dungeon Master didn't balance the archer class",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty damn good game overall, If you were to take the dungeon and exploration of the old Zelda games an took the combat of something like Sega's Fatal Labyrinth this is what you would get.  The game has Perma-Death with a twist, at the start of the game you talk to a ghost which gives you the only real plot and gives you an extra life. If you died during the game a Blue heart would drop on the spot you died, If you die again before you can pick up the Heart you get a game over and lose all your items aside for your coins.The game has some RPG elements like random drops to increase your stats like Damage, Parry, Cleave, Dodge, etc. The combat can be quite difficult to get used to but once you get the hang of it the game can become quite easy by end game.  This game isnt without flaws though, sometimes I found the hit detection to be off a little bit and the game can require a bit of grinding at time. Also the game is really short and can be beaten pretty quickly if you know what to do, my second run through took me less then 30 minutes to beat.  Overall this game is a good time waster and for $5 it really is a good deal considering you can find far worse game for more than double the price.",
            "review_score": "1"
        },
        {
            "review_text": "Just play the flash game, no difference at all.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was first made for mobile so ignore all the reviews about the tapping and auto attack, its there because its made to be a tap and play game so dont but it looking for another diablo. Its a great time killer and I have enjoyed it on both mobile and pc.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Quite a lot of fun. It's pretty straightfoward once you get a hang for the controls, which are not entirely intuitive.  Figuring out what's going on, and what exactly all those stats do, is part of the fun of the game.  And then, of course, finding bigger and better loot is always the quest.  Only gripes are that it's awfully short to beat the first time, and the difficulty is rather low, after you have a few levels on you.",
            "review_score": "1"
        },
        {
            "review_text": "This game is extremely fun and addicting. Well worth the money and the time to review it. If you're looking for a new rogue type I would definitely suggest this game. If you're on the fence then search for the prequel online and play the flash game. Once you're done with that, come back and pay 99 cents for this one!",
            "review_score": "1"
        },
        {
            "review_text": "Its OK , for 4 dollars you cant complain much , its interesting and fun , basic.... Ending is Alright... not much of a story behind why the ending is the way it is tho..... No tutorials or hints, no background story-  (spoiler?not really?...) Only progression is when you beat game over and over you get high level loot- more rare items with more stats, thats really only real reason to beat game and play again almost like borderlands..... but weapons are still same types from what ive seen...",
            "review_score": "1"
        },
        {
            "review_text": "This is boring and irritating.",
            "review_score": "-1"
        },
        {
            "review_text": "Been playing for about 4 hours so far and I am very happy I took the time to start playing.   Tons of weapons to play with. There are different attack moves with the various weapons, some examples are a whirlwind attack with 2handers, a AOE stun when you have a shield, daggers that allow you to stealth and get a surprise attack for extra damage and staffs that allow you to charge-up a shot that you can fire across the screen.   I am playing with a controller(Logitech F310) and it makes controlling the character alot easier, especially when you are using ranged-attacks like with the staffs &amp; bows so I cannot comment on the M&amp;KB Controls.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the most fun I've had with a dollar game. Zelda-esque wih minor dungeons/mazes. Not tough to complete, but has some replay value if you enjoy these games. If you've got a dollar and some down time, this is worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I liked it, it was pretty fun with the cool armor and stats and weapons and enemies. Thing is, it wasn't hard. I was able to beat some bosses in 5 or 10 seconds. I also couldn't understand what was happening sometimes. I found myself questioning if I beat the game or not, as the game doesn't tell you much. It got a bit confusing. Fun, but a bit too confusing, and easy.",
            "review_score": "1"
        },
        {
            "review_text": "A very entertaining, simple and straight-forward hack n' slash. There is very little in the way of directions or guidance but such instructions are unnecessary except for the little tips on controls you can find by pressing the ESC key. In order to make it windowed, press ENTER. moves with WASD keys, attack with mouse, special attack with SPACE, hold down mouse to block. Simple.  I'm not exactly sure what my purpose in the game is other than killing enemies and defeating dungeons in different areas that are designed around a certain color palette and elemental theme (forest, jungle, nether, ice, desert, etc.). Thankfully there are no puzzles in this game when it comes to progressing forward in the dungeons, you just have to hit every button you find, pick up the keys, unlock the doors, and keep moving.   My first run through I got to level 3 before dying. Second time was similar, as was the third and fourth time. The fifth time, however, I got through the game once and then died at Lvl 83. As you can see, it's very easy to master and the only thing stopping you from progressing is failing to pick up stronger gear that are color-coded for your convenience in regards to overall rarity and strength. White -&gt; Blue -&gt; Green -&gt; Purple -&gt; Orange -&gt; Red. Funnily enough, White, Blue and Purple were the most commonly found in my fifth playthrough, while Green was just as rare to find as Red. Funny, eh.  Bonfires are spread throughout the lands and offer both a full restoration of health and a quick look at your stats. They have unlimited uses, which is awesome. Another thing to mention is that you will not lose all your accumulated moolah when you die as long as you don't delete your save. You do start from the beginning at Lvl. 1 with no armor or weapons, but you are seamlessly reintroduced to the beginning with some weapons being located right next to your respawn point, which allows you to get back into the action.  The bosses were fairly easy for me: Just get up close and keep wailing on them. As soon as I found a strong enough 2-Handed Axe, Hammer, or Sword I abandoned the shield in favor of pure power. I also avoided magic staffs and bows because they take up much more stamina/magic than simply swinging a sword, even if you have to get up close and personal with enemies. It's much like Hotline Miami where foes don't bother you if you just get in there quick and hit them before they hit you. They're also scaled to your level so you won't encounter the problem where you're getting barely anything for experience when you kill an enemy that you first met at the beginning of the game; everything is still a threat but much less so if you paid mind to upgrade your gear.  It's very fun and the achievements are very easy to get; in theory you could get them all in one persistent playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "Could be good, but it is not - it's actually confusing - I did not know what I had to do, so ended up doing all of the dungeons and getting to the 'final boos' in around 1.5 hours. Then, said 'final boos' was unkillable, so I went through a portal thingy, only to find that I had to start over...there is also no startagy involved: mash buttons and hope you don't die.",
            "review_score": "-1"
        },
        {
            "review_text": "I'ts fun game great for 100%achievemnt run Has Zelda feeling in it but diablo gameplay Despite the permadeath its not a hard game",
            "review_score": "1"
        },
        {
            "review_text": "I cannot recomend this game enough, i play bit dungeon alot, and i love both of these games, this one more sop, its a great game, and i have alot of fun playing it, esp[ecially because when you die everything resets, great game, i recomend it highly 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's Dark souls meets Link to the past. It's really really awesome, but not very long.",
            "review_score": "1"
        },
        {
            "review_text": "Aw man, I pretty rarely buy indie games so I was a bit disappointed by this. I would've felt okay about it if it were just an Early Access game or something. It's not awful at all, just needs 'more.' More content, more polish, more design consideration.  This game has a nice retro art style but the game feels a bit bare, and the formula got old very fast for me. Rogue-likes need to have a lot of interesting randomisations so that they're fun to play through again even after you just died the room before the final boss; I didn't see anything like that in this, so to get back where I was up to was just looking like work.   It feels like this game was ported straight from a mobile app, and noting that it's available on Android &amp; iOS, that's probably the case. The player is a slave of the One Button to Rule Them All: walk, attack, block, power attack/cast. All of this is 'click.' Yes, that does mean that you'll not irregularly walk face-first into enemies you're trying to attack from range.   Very little variety in enemy AI. Aside from the theme change in the few different areas (forest, snow, desert, dungeon), there's very little graphical variation between rooms. They all feel the same, so it's not interesting to try to explore whole areas.  The 2 bosses I fought were very easy and, I suspect, bugged. Giant Skeleton didn't move for most of the fight.  Level up system is uninspiring; just a few automatic stat increases, no customisation other than what gear you wear, so I didn't find myself even thinking about how much exp I was getting or if I should grind.  Noted that when I searched 'bit Dungeon,' I found the free-to-play Flash version, which actually looked more polished and controlled better, and that annoyed me after spending $5 on this.  So, in summary, here's what I think could use work: - Fix the control scheme so that it feels accurate and responsive - Work on the AI, especially of the bosses but also the behaviour of the little monsters so that they're uniquely challenging - Spice up the level up system - Add more graphics, interesting things, events into the world so that it's worth playing through again after dying. Otherwise, as someone else said, it doesn't work as a rogue-like and is better off having that element removed entirely!  Otherwise, congrats on the Steam release, and I'll be interested to see how this game evolves. :) Sorry if the review is harsh, but when you say you draw inspiration from games like Diablo &amp; Dark Souls, I expect to see some of those elements in the game other than just resting at fires, so it's a very bad point for comparison!",
            "review_score": "-1"
        },
        {
            "review_text": "At first a hesitated but it so cheap i decided to try it, DID NOT REGRETED IT. Finish it in one night . Really addicting , probly because of the fast pace, makes the game evolve quicker so even if its a simple game there always something new ( gear,boss, level, monster,). Worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game. An homage to 8-bit zelda . I just love the loot system in this game. It has some technical challenges currently but appears developer is working to address. I am finding it hard to put this game down.  Edit, have put another 15 hours in. Game is incredible and keeps surprising me. A must have if your a fan of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "I'm new to this type of genre of gaming, so please forgive me if I sound stupid I really want to like this game, but too many things hold me back. for instance: no tutorial no storyline/plot some types of controllers do not function (e.g. wired ps3 controller)  I mean seriously. I have seen games with all of those things  that don't cost a single penny for pete's sake. ",
            "review_score": "-1"
        },
        {
            "review_text": "It's a casual minimalistic 8bit rogue-like dungeon crawler. Game is fast-paced, unforgiving and random. You may become filthy rich and powerfull in 1 second and then, lose it all in another second. Explore the dungeons, look for more powerfull items, artefacts, weapons, solve puzzles, defeat bosses. It's pretty fun.  If you are into randomly generated levels and games like 'Hammerwatch' and 'The Binding of Issac', you are going to love this one. I'd say it's a solid 8/10 and I do recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "A quick and fun Legend of Zelda-like game. I got the game from humble bundle but the game is well worth buying separately.",
            "review_score": "1"
        },
        {
            "review_text": "Oh wow, I love this game. I love this game? I didn't even beat it when I died and got a game over, starting back at level 1 after advancing to level 41... but that's because I didn't know what I was doing, and I think that's easy to do in this game. If you do happen to figure it out, it's very pleasurable, albeit extremely challenging. Probably my favorite rogue-like at the moment.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game and with the addition of the map it is a lot more fun to play and i cant wait for bit dungeon III if of course it does get released. I highly recommned this to any one who love the legend of zelda!",
            "review_score": "1"
        },
        {
            "review_text": "Not worth. Get pixel hunter.",
            "review_score": "-1"
        },
        {
            "review_text": "It is a very good game. I like it very mutch",
            "review_score": "1"
        },
        {
            "review_text": "QuickRating: 7/10  First off, I love bit dungeon. I play it all the time. So when I saw BD2 i had to buy it of course. First impressions were good. It's not the same as the first game, but still enjoyable and much more varied.   My first problem is that other then in fortresses, i didn't find a way to regain your health, only by killing the purple demons who appear in rooms you already killed everyone in. If you are just running around outside as you most likely are, there is no way to replenish your health.  Another problem is that often you manage to click and change your weapon to one that's just laying around without noticing it.   The bigest issue though is that it's buggy.  Often when you walk around the screen keeps jutting and shaking as you go, and I'm not sure if it's only on my PC or everyone finds this, but often when you pick up a weapon, the associated special attack doesn't work well. (sometimes it works on one screen and stops working on the next)  This wouldn't be that big a deal, but I accidentally switched my ice hammer off for an ice cube. The ice cube didn't reside in the weapon slot, but still i couldn't carry it at the same time as I carried my weapon.   So i accidentally picked up the ice cube that was right next to the door and then left the room... Returning instantly I found my 25+ atk weapon has disappeared, and I was left with an icecube that had NO powers. I couldn'T even get out of the sewers/catacombs under the fortress as I had no means of attacking. This is a huge issue because of course i was forced to let the monsters kill me and go back from lv 19 or 20 to lv 1 and start the game over.  --------  So can I recommend it?  It is a really nice looking game if you like the art style. It is in the same style as Bit Dungeon, just way more varied, more in depth and less repetative. It has a nice variety of style through the overall map, and it's procedurally generated meaning you'll have different worlds every time you start a new game.  It is also kinda buggy, The controls are a bit weird, not very responsive, sometimes I click an enemy to hit it but my guy just walks there, or I am in the middle of a bunch of monsters, my special attack doesn't fire and even if I'm clicking I'm just changing my weapon to the one right next to me and just get mobbed and killed in seconds. Also I found no way to replenish your life outside of fortresses.  Honestly, If I wasn't such a huge fan of Bit Dungeon I probably wouldn't like it that much.  So I'll recommend it but only half heartedly. Only buy this if you really really like the style!  It's been out on steam for over a year now, I hope these bugs will get fixed soon so I could give it a higher score.  ---------- EDIT: ----------  I have to make a slight edit. After some more playing, I found that there is a way to heal, by finding campfires. Still the game did not explain this at all so I feel my mistake wasn't that big.   Also what is a huge no-no in these games, you don't even heal when reaching a new level.",
            "review_score": "1"
        },
        {
            "review_text": "While reminiscing certain games that this reminds me of, with the exact sames sounds used, it is a fun/addicting game to play.  Too much like Zelda Very repetitve Has a weird fighting style  5.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "If you imagine the original legend of zelda, a roguelike, and a hack and slash, you get this. It has a good variate of enemys and you have to learn what moves each has has when fighting. The minibosses are easy but I can see why they have made it this way (might have been my weapon). But on the other note, I have to say some of button lables are weird and the only way to know what to press is if you hit esc. when playing. Another complaint is that I don't know how to heal my self during battle. Over all I'd give it a 7.6/10, would miniboss again.",
            "review_score": "1"
        },
        {
            "review_text": "Super simple. Super fun. Super short. Lackluster world and music. Worth it if the game is on sale. I only logged 8 hours (with some long pauses) and played through 3 times. BTW heads up, there is no end to the game. You just keep replaying the same game with monsters at higher levels over and over until you die. I liked this though actually as it added some playtime to the game and I liked it.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun and easy to play. Zelda-style gameplay and graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Very worth the 3$. Could use a proper game guide tho",
            "review_score": "1"
        },
        {
            "review_text": "Looks like it could be NES Zelda with dark souls theme? Wrong!  Stomach churning buyers remorse. . . that's the only thing I got from this game, cause it's terrible.  I see it's 99 cents now and I still wouldn't recommend it. Not even if it were free. There are way better free games out there.  Aside from moving, everything else is controlled by 1 button and the combat is just running into the enemy. So mind numblingly dull, repetitive, lacking any real sustenance and depth. There are no useable items or strategic weapon combinations, you just equip what you find and contantly grind on every enemy you see. It's a bad port of an android game.   Wouldn't recommend to anyone, under any circumstances (aside from my enemies).",
            "review_score": "-1"
        },
        {
            "review_text": "Really fun game that has Legend of Zelda that feels like Dark Souls mixed with Legend of Zelda! 10/10 IGN Would recommend to a friend :3",
            "review_score": "1"
        },
        {
            "review_text": "Good for the price, fairly short however. It's a roguelike game but doesn't offer much to keep returning to. Ranged weapons seem to be overpowered which means you keep them despite finding much higher level melee weapons.",
            "review_score": "1"
        },
        {
            "review_text": "where the hell is the exit button? overall pretty good game",
            "review_score": "1"
        },
        {
            "review_text": "Let's keep this review short:  bit Dungeon II is a Rogue-Lite with retro graphics and Diablo loot system. Kinda like The Legend of Zelda on the SNES, but with instant death.  Best played with a 360 Controller. So much fun.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good overall.  First thing to note is that this game was developed with mobile in mind. Your character will auto-attack as you walk through things, but you can mash the space bar to attack faster. While the game can be played with the mouse, I'd recommend using either the keyboard or a gamepad for the best experience.  bit Dungeon II is really addictive, but sadly not a very long game. The entire game can be beaten in about three hours or less. There also doesn't seem to be a true ending, as the game just automatically jumps into a New Game Plus when you finish it.  In this New Game Plus, you keep all your gear and currency, while the enemies and loot scale up to match. You can play the game through many times while it continues to grow more difficult. The game rewards you with some powerful loot when you beat it though, so it's clearly intended that you play it a few times.  The game could use more randomly generated content. The overworld is static and while the dungeon layouts change, they're all picked from a small pool of predefined layouts. A few more 'Rouge-like' elements would take bit Dungeon II from a little replay value to a ton.  The loot is where it's at though. bit Dungeon II more or less boils down to a short but addictive loot grind. A lot of the replay value lies in trying out different character builds and the gear available to you.  If you can deal with a little repetitiveness, the game is worth the price, otherwise I'd grab it on sale. I got my copy through Humble Bundle a while back, so I can't really say much more on the price. It seems pretty fair, but people are likely to complain anyway.  With all that out of the way though, I'd have to say that bit Dungeon II is a commendable effort. Even with these downsides, it has the right spirit.  I feel like if the developer had more time or resources to spend on this game, it could have easily gone from 'good' to 'great'.  It is wicked addictive though. If their next game is a 'bit Dungeon III', I will definitely check it out.  (They've recently released a remake of the original bit Dungeon, formerly a flash game, to unfortunately mixed reviews, but I'll probably check that out too.)",
            "review_score": "1"
        },
        {
            "review_text": "It's like Dark Souls but pixels.",
            "review_score": "1"
        },
        {
            "review_text": "I love it. never played the first one thoe. but its awesome 8-Bit and just like zelda but with a lvl up system. i got it when it was on sale. not a bad game.",
            "review_score": "1"
        },
        {
            "review_text": "Its Zelda... Its Zelda...  Rate this:10/10 Add items so that there will be Comunity Market for dis... Add Multiplayer Pls :)",
            "review_score": "1"
        },
        {
            "review_text": "Respect, this game is funky rogue like game that I've been searching for. So many hack n slashes that you play for around 5mins each playthrough and then that save and all those items are lost forever. This one you grow with the game and playing your cards right you get to keep everything and have lotsa fun! Definitely worth its price, merry christmas xx",
            "review_score": "1"
        },
        {
            "review_text": "  Overall I say this is a great game, but the downsides shouldn't go unnoticed so I made a Pros &amp; Cons list.  Pros: - Simplistic - Easy to control - Great music - Fun (Most of the time)  Note - Before reading these cons just know that if the con has a * next to it, it means that's just my personal opinion and something that I would like to see in the game, it's not a downside it's just something I would want to see in the future.  Cons:  - *No multiplayer (I understand no online multiplayer, but it hasn't even got local co-op) - It can get repetitive so sometimes it isn't all that fun - The simple controls are great, but there is no controls setting so I can't configure them for myself (I had the most frustrating experience when I pressed space to hit someone, but it swapped my weapon for the one on the ground and I didn't notice until I exited that area, so I couldn't get it back, which brings me to my next point) - *Items on the ground despawn after you walk out of the area, an example of this is in the point above (It's so frustrating) - *The bosses are too easy (I die more from rondom enemies then from bosses, they just sit there and let you hit them while they occasionally hit back, I would like to see them move around and have loads more attack patterns, and not die within the first 2 seconds of fighting)  But like I said earlier I love this game, It reminds me of   The Binding of Isaac   because of the dungeon feel and how you run room to room fighting things and getting better items along the way (I don't actually have Binding of Isaac but my friends do and I watch them play all the time).  Get this game for some fun, but it's ultimately your decision...",
            "review_score": "1"
        },
        {
            "review_text": "A simple game for a casual game experience. That is what this game is, and that is what this game does well. Are you looking for a game you can sit down with for hours and comb through an engrossing storyline of epic scale, set in a sprawling open world of beauty and splendor? Well guess what folks, you won't find that here. Go in with the wrong expectations and you are going to be disappointed. See this game for what it is.  This game has a simple concept, simple gameplay, and a simple style. There is nothing groundbreaking or particularly innovative here. Go into the game with the expectation of a casual session of a few minutes to an hour where you can make progress and you will not be disappointed. When I say simple, it took me only a few hours to achieve 100% Steam Achievement completion, but that's what I expected. And you know what folks? I still go back and play this at times even after 100% completion because it is just simple fun. On the right sale, you can have a few hours of entertainment for less than the cost of a value menu taco... Sounds like more than a fair trade to me.",
            "review_score": "1"
        }
    ]
}