{
    "app_id": 331400,
    "name": "Luna: Shattered Hearts: Episode 1",
    "release_date": "2014-11-24",
    "developer": [
        "Daniel Gill"
    ],
    "publisher": [
        "Gillis LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Indie"
    ],
    "achievements": 18,
    "positive_ratings": 10,
    "negative_ratings": 37,
    "price": 1.99,
    "description": "Explore the infernal abyss of Luna in this action packed RPG Platformer. Confront your dark past and forge your own transformation from being a self-centered disaster to a hero that can change the world. As your party forms a courageous family of rejects you may even find love.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/331400/header.jpg?t=1447364719",
    "minimum_requirements": "OS: Windows 7, Windows 8 Processor: Intel Core I5 / AMD Athlon 64 X2 4800+ Memory: 3 GB RAM Graphics: Intel HD Graphics 4000 or equivalent DirectX: Version 10 Storage: 232 MB available space Sound Card: Sound Blaster or equivalent",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Ugh, I really wanted to like this, and I tried, I mean, REALLY tried to enjoy it. I was looking forward to its release after seeing it on Greenlight. I liked the look and the unique visual design, and it seemed like it had a lot of potential to be fun.   But it wasn't...  A lot of the problems seem to stem from the way it doesn't relay important information on how to progress to the player. It seems to be left to chance to try and figure out what needs to be done in order to get what you need to progress. I'm not saying things should be spelled out to the player; allowing them to discover things for themselves IS a good thing to do, but at the very least, you have to help them along in some way, like providing some kind of clue as to how they can obtain the resources they need. Other things to take into consideration is just the tediousness of combat. Maybe what you can do is make the beetle enemies significantly weaker, but provide more of them so its easier to make use of their carcass in order to actually get needed ingredients to drop from enemies, as its really hard to get some of the hive enemies in place.   Another thing that needs to be addressed are the loose physics. It feels like the chracter slides around too much from the momentum. Platforming needs to have precise control, otherwise the player will be constantly falling from ledges. Also, more control in jump height would be beneficial, like shorter taps of the button for smaller jumps.   I'm not sure if this was a bug, but there was a frustrating instance during the major boss fight (with Chumbo?) where I would take constant damage for no discernable reason when I was at ground level. At times I would get forced out of the room from the constant knockback after just entering it. It's also too easy to exit that particular boss room by accident mid-fight. Having the entrance/exit on an elevated platform would easily solve that issue.  As it stands, this still feels like its too early for release, and could really use more play testing. There's a possibility of a good game in here somewhere, but it needs a lot of work before it reaches that point.",
            "review_score": "-1"
        },
        {
            "review_text": "It seemed promising when under development and now I've finally gotten around to it I'm left with a bad taste of disappointment in every department.  The most important flaws are rubbish controls--unresponsive with a non-variable jump height, so you will always be jumping the same height and the physics are terrible for it making it feel like some awful low-gravity moon jump. With the animations seeming to have missing frames and lack of good indicators, you're never sure how well you're doing against an enemy until it dies. Everything is so terrible in this department, it feels so sluggish you'd think the inputs were delayed and lagging.  When it comes to sound, the only noticeable thing is the terrible voice acting with dialogue that can't be skipped so you're forced to listen to the stale, emotionless characters that don't even seem to try to get you to care about what's going on. Bad voice acting exists in a lot of things, yes, but when there are no means to skip or speed up the dialogue, it draws extra attention itself and it just seems to get worse each time it happens.   If the controls weren't so rubbish, I might have given game more time, but the terrible voice-acting that I couldn't skip really put me off. There's quite a bit of dialogue in the beginning which I'd have to repeat each time I died because of not having a clear indication of whether or not the enemy I fought was near death. It's annoying how terrible it is.   Don't even take a chance on this one. It's not a fun experience at all; it's a mess.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game from a Gem Auction during the Holidays from Steam because of all the negative reviews. I'll be honest, I actually green-lighted this game personally on Steam.  The art style personally I couldn't really care too much for- it reminds me too much of those fairy stickers from Hot Topic but it looked well executed in the screenshots. The story first impression seemed like 'Ok, two characters- love...drama...bonding...possible use of double players in the moves.' which by far isn't the most original thing out there. But hey who does anything original anymore right?  Despite that it wasn't stylistically my cup of tea- I love platform/rpgish/whatevergameswithsomekindahotchickonit that this thing was seeming to market itself as... before I played it and confirmed what a lot of reviews already said.  THIS GAME IS A HOT STEAMING MESS  First off, great backgrounds and yes while I'm not totally into the art direction I like to give credit where credit is due. Beautiful. I can even accept the simplifi-wait why are the sprites so copy and their animations are completely inconsistent? Why does my lil dude just seem like he pauses forever when he's attacking...   This game is bugged, unbalanced, the sprites are more or less seemingly rushed- it's like nothing was ever playtested. Ever. Did anyone of the Dev Team bother to even play this game? Better yet did anyone outside of the Dev Team bother to play this game to let them know that some major game design sins are being committed here?  WHY DOES SOMETHING IN THE FIRST LEVEL TAKE 15+ HITS TO KILL? No this isn't even about 'Difficulty' This is just downright negligence... there isn't any skill to fighting these things it's just walk next to them and...look frozen and stuck while this slug thing looks like it might be taking damage.  You have a partner from the beginning with the BEST dialogue that sounds as lifeless as some of those chat programs (hey I could go into detail about the voice acting, but I can't knock it for trying - voice acting is tough, I've personally failed out of a voice acting audition before for a cartoon because I wasn't British enough) and while she's cool in her own way I guess... she just kinda scurry around and gets in the way. Heck even if all she did was just Mirror your movement that would be an improvement. The partner system is more or less unpredictable and unreliable if you want them to do anything beyond rushing forward and taking damage when it's not necessary or just idling away while some monster has their way with you.  I don't understand some of the Interface, it's not anywhere near obvious or helpful whatever half of these meters are. There is two sets and I'm sure one is my partners health? Maybe? Oh geez they have health great now I can look forward to them being useless and dying with the exception of them remembering to heal or rez me from time to time.  BOTTOM LINE -  Bottom line, these are just a couple examples of just how broken this game actually is. I would have just been happy if it was just a mediocre game at this point. No wonder why many people can't get past the first level- it's not actually fun in any way shape or form and if this mirrors what the rest of the game is like...who would want to put up with it?  Dev Team, or Person(s) - You owe it to supporters to at least try to overhaul this game. You got the game completed as far as I can tell, hell even just tweaking the numbers of enemies and items will be a MASSIVE step up for this game. Animation Hold Times do not need to be as long as they are.   There is a gem in here waiting to happen.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the best game I have ever played. I give it 10 screaming dead babies out of 10.",
            "review_score": "1"
        }
    ]
}