{
    "app_id": 331500,
    "name": "Executive Assault",
    "release_date": "2015-07-17",
    "developer": [
        "Hesketh Studios Ltd"
    ],
    "publisher": [
        "Hesketh Studios Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op"
    ],
    "genres": [
        "Action",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 1180,
    "negative_ratings": 185,
    "price": 10.29,
    "description": "Executive Assault is an indie real-time strategy/first-person shooter where you can not only build your base and create armies, but also take control of your units and fight as one of them.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/331500/header.jpg?t=1538385755",
    "minimum_requirements": "OS: Windows 7 64-bit Processor: i3 Memory: 4 GB RAM Graphics: Pixel shader 3.0, Nvidia or Radeon Cards, 1024x768 resolution DirectX: Version 11 Storage: 2 GB available space Additional Notes: Make sure you have the latest drivers installed for your graphics card.",
    "recommended_requirements": "Processor: i7 Memory: 8 GB RAM Graphics: Pixel shader 3.0 DirectX: Version 11 Storage: 3 GB available space",
    "reviews": [
        {
            "review_text": "For once an early access game didn't rob us.  Now it might not look like much in it's current state, but I think just the supportive devs put this game up there. The makers behind executive assault is a small dev team, with only a guy and his friends, and for once he isnt a billionare greedy CEO of a company.  The gameplay is quite nice once you get used to the strategy and controls. It has a cool first person feature where you can control a soldier in a unit you sent out to defeat your enemies. From giant mechs, to small riflemen, there are tons of ways of defeating that rivaling company that threatens the toilet plunger market. (I don't know, I'm tired.) The game is a bit buggy and a bit unoptimized, but the devs are constantly giving feedback and supporting the players. They upload new concept art of new graphical changes and other things, so overall, good dev team.  Although the feeling of a regular FPS is cool, just imagine yourself charging in with just a rifle with your 10 story mech warriors and tanks beside you, and this game brings that. The game makes you feel so powerful charging in to the enemy base with your carefully planned out small army, charging through their maze of corridors and drone factories. Until, finally you place that one bullet into the CEO's head that is controlling all of his forces.   Overall, great game with alot of potential, and please, PLEASE support the devs. I would rate 9/10 for an early acess game, pretty low price, tons of potential, fun gameplay, and good devs.  Great job Hesketh Studios, keep it up.",
            "review_score": "1"
        },
        {
            "review_text": "I probably don't sound the most original here, but, I bought this game from watching Star_ and Jerma's video, though I found what I was watching to be really interesting. First off the soundtrack is unreal, this game shouldnt have a soundtrack of this extreme but it works so well in conveying the action that I dont even care, I really want this ost! The rts elements arent shockingly different or anything but they're solid and dont frustrate the player, also controlling your units is awesome and feels very good (save for the planes but I hope that gets reworked). The main gimmick that really makes Executive Assault what it is, is the fact that you are playing as the objective, basically if the other Executive kills you, it's game over, this makes for some really hectic wars just to get into the other player's base, and once you do there's nothing more intense. The game doesnt particularly look amazing or anything and the performance is frustrating at times but that shouldnt get in the way of a truly solid rts/fps that's a joy to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game, where to start. This game is what every RTS player/fan should want, a game where you build your base/units but can join them on the front lines in the heat of a battle. This game has some amazing ideas, and if this dev keeps up the work (which he is doing) then this game can become something more awesome than it is now.  This game does have some bug and problems, as do many indie/new games, non gamebreaking that I've found but some that do kill you/get rid of units, but you have to do something for that to happen.  In my personal opinion the good outways the bad. Yes it has problems but running with 30 soliders, tanks and aircraft into a hugh battle feels epic.   This game is best tried out for yourselfs.",
            "review_score": "1"
        },
        {
            "review_text": "You can control a robot and go kill yourself.  This is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Executive Assualt is a really fun and unique RTS/FPS game. You can control your troops in RTS just like in games such as command and conquer but you can also help turn the tide of battle and jump in the battle in first person.  +RTS and FPS blend +fun and complex base building options +MP is a blast! +Graphics are decent for this type of game  +few bugs so far  +Very helpful tutorials  +lots of tech research options  -Nearly unlimited weapon range when a human player takes over an AI soilder. (this can lead to you or your enemy destroying your defenses or armies from across the map). -game seems to take a lot of 'resourses' to run and my specs are pretty good. (I have a 6 month old alienware approx. $2000 and all games so far I can easily run on ultra). -MP should have more match customizations options. (such as what you see on a game like Rise of Nations). In this game for example all research is free and the research completes pretty fast. I wish there was an option to make research slow and expensive as well.  - Most maps seem pretty small. (and smaller still when you consider you can shoot all the way across the map if you take over any troop type in your army in first person mode).   Overall this is a very unique game and is definetly worth the money. I give it 6/10 stars!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games i have ever played and would like to explain why  1: First off just the vibe of this game is so great it combines the sense of The TF2 endless war therory and a fallout/apoccolypse vibe. 2: The gameplay itself it really smooth and addicting I nrecomend playing with a friend  3: The upgrade system is really cool and it is awsome how you can build from the building itself I really like this game and think it should get more credit than it gets  ALSO PS dev if you see this i think body gaurd would be a cool upgrade for your executive that are preaty powerful and that could have max upgrades but just an idea   anyways if you read this thanks and good luck on this",
            "review_score": "1"
        },
        {
            "review_text": "I am a very big fan of the game so far, so many times ive thrown my hands up and just laughed while getting destroyed or exclaimed praise at my units when winning...  Looking forward to further updates and more ridiculous battles. If you're looking for an early access to support with fps/rts elements, look no further.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty epic! I have been looking for a RTS and FPS mixed game forever and this is the first I have found and played. I think a larger selection of units and techs would be great, also more defense options for the CEO and a better multiplayer server would be much appreciated. The current base size limit for the main non-resource buildings is too small to have a nice defensive setup with walls and gates and everything. Other than those improvements I highly recommend this game and hope the developers keep working at it!",
            "review_score": "1"
        },
        {
            "review_text": "In its current status i don't recommend this game. Optimisation is poor, it crashes and there's a general feeling of unfinished product i was glad to support at first, expecting a better product. A sequel is on its way and a 'promise' that Executive Assault 1 will be improved.  With 25 000 copies sold according to steamdb this is a shame. Here is a short list of 1 (or 2) -man game that did finish their products with promises shaped through patches:  - Risk of rain - Teleglitch - Space Pirates &amp; Zombies - Void Destroyer - From the Depths - Hotline Miami ...  Goodbye Hesketh Studios ",
            "review_score": "-1"
        },
        {
            "review_text": "Couple glitches here and there, but overall one of the coolest RTS games I've played. The game is not very serious, which makes the game a lot more fun. The whole idea itself is silly. I mean, you are CEO of a corporation with a goal of taking over a planet. That's just plain amazing. Just stinks that no one ever does multiplayer. :P  Btw, do not be detered by the graphics. Sure, they aren't great, but that is not a big deal at all. This is really a classic example of that fact that you don't need good graphics to make a good game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is AWESOME. If you like RTS games with a big scale then you'll love this. Can't wait for the dev to add more stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome game, been looking for a game like this for many years a good RTS/FPS Hybrid. :)",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS A GREAT GAME! Let me say that the idea of it is just great Im a big fan of RTS and was always like 'I wish I could be in the action too'. This game is great for the price i hope in the furture there would be more upgrades to tanks cause armor core FTW. But if you got 13 buck dont hestaite to grab this. Good job devs you have made a MASTER PIECE!",
            "review_score": "1"
        },
        {
            "review_text": "Huge potential let down by a few game breaking flaws. If some of the following cons are addressed I will be sure to update this review. I'm not giving up on this game just yet.  Pros - First person mode in an RTS - Lots of variety with research trees - Indie game price - Easy to learn  Cons - Broken range in first person mode - AI is lacking in key areas - Hard to get multiplayer games - Random resource placement makes some games unfair - Not enough tooltip info to know what does what - Flying in first person mode is unpolished - Basic controls like shift to queue orders are missing",
            "review_score": "-1"
        },
        {
            "review_text": "i muda funkin love this game.... also i would really love destructble bases that would we the best thing..... thank you for making this game... its awsome ",
            "review_score": "1"
        },
        {
            "review_text": "i bet right now you just watched the trailer for this game and you're thinking 'this is too good to be true' so you've scrolled down here for a looksee at someone elses opinion well  the game is amazing end of review 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely the most fun I have had in a while, 10/10 give this a shot.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great for its price. It has a Age of Empires/Stronghold Legends feel with futuristic twist. What sets this apart from other RTS games is that you can chose any unit and control them first person. Multiplayer works great and it is very satisfying to destroy your friends. The game gets updated a lot and there isn't any game breaking bugs. Expect new features and bugs getting smoothed out often. If you like games like AOE, you need this game. the 12$ now is a steal for a game this good.",
            "review_score": "1"
        },
        {
            "review_text": "the games very fun untill you die and u have to restart. so if you add godmode in a future update i would be very gratefull",
            "review_score": "1"
        },
        {
            "review_text": "its something new to bad no campaign and the tutorial is so soft but the wiki can help all and all worth its 10 bucks",
            "review_score": "1"
        },
        {
            "review_text": "The idea of FPS and RTS is awesome. It's very well executed, and you dont feel useless being in FPS mode at all. This game has a monumental amount of potential, and can easily set the precedent for RTSFPS games.   While EX has a lot of glitches, bugs, and less than stunning graphics, I find the gameplay and economy to be superb; with a few tweaks I would definitely say this can be the best RTS i've played.  As far as I can see, the dev seems to be dedicated to making this game perfect, and he is working on fixing the issues with the game daily. I would definitely reccomend this game; it's a steal for the price they have it listed at.",
            "review_score": "1"
        },
        {
            "review_text": "I like how you can build loads of robots and control them to destroy your enemies, and researching technologies that give you the ability to discover high tiered robots. However, I really hate controlling the air vehicles (except for air cruisers), and i'm asking if the dev(s) can make the air vehicles easier to control in the future. Overall, I love this game and I can't wait for future updates :D",
            "review_score": "1"
        },
        {
            "review_text": "Great game... probably ought to be in early access mode. Lots of fun but feels unfinished and is desperately in need of some optimisation in the 1st person mode. LOVE it all the same.",
            "review_score": "1"
        },
        {
            "review_text": "YES,VBery rewarding gameplay.Although the game is hard to learn it is very rewarding to learn!",
            "review_score": "1"
        },
        {
            "review_text": "it is a good game especially beacause i get to die a lot and keep going in my giant robomechs",
            "review_score": "1"
        },
        {
            "review_text": "This is just such a cool game. I've only played it for a small amount of time but i can already see all the potential it has to evolve into an amazing new genre of mixed strategy and fps! Rob, the developer, made this almost by himself, that is just so amazing! If you want to play a really cool strategy game where you can see every detail of your troops, blast away robots, and self destruct your base when you have to make your final stand :). Verdict : amazing game.  Edit: Please pay the full price for this game and don't pirate it. He's just one man and doesn't have a huge company to support him, he needs this money. Keep up the good work Rob",
            "review_score": "1"
        },
        {
            "review_text": "no comliant exept (written in early acces) when you set a ai to 'the janitor' sometimes it will pile up so many pylons that it lags your game remove that and a few minor bugs that dont effect the game that much and bang instant 10/10 i recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Executive Assault is a poorly executed RTS/FPS hybrid. Playing the game for about 30 minutes, I suffered two bugs that made me have to force-close the game, first it was the create a server menu freezing and then my looking in Executive Mode (FPS mode) would not work. This was annoying to say the least, but when I even got to play the game, saying I was less than impressed would be an understatement. PS2-era graphics aside, the RTS mode and FPS mode are simply not very good. The RTS mode has a mediocre UI. The FPS mode feels unpolished with there being no iron sights and poor animations. Overall, I was disappointed with Executive Assault and sadly I was really looking forward to playing it. For $15, it's definitely not worth it and at $3.76, I will still be getting a refund. I love the concept, but the execution is not good.",
            "review_score": "-1"
        },
        {
            "review_text": "I love it, Played a couple of matches vs ai with friends, and it's hilarious fun.",
            "review_score": "1"
        },
        {
            "review_text": "Great game , sadly there arent much players in multiplayer .",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game with big ideas.  If you can get past the game's graphics and quirks, it's a game you'll appreicate if you're a fan of RTSs.  The game is buggy at times, mechanics not fully developed, but still a lot of fun and it's nice to see a game with bright ideas.  The game lacks polish, but the price fits well.",
            "review_score": "1"
        },
        {
            "review_text": "Very unstable game but also very fun once it starts to work. This needs workshop maps too.",
            "review_score": "1"
        },
        {
            "review_text": "Gather more recources.         Also please for the love of god make it so when I try building a building or defences and I dont have the spare parts, can you make it so it is qued to be built like the units are?",
            "review_score": "1"
        },
        {
            "review_text": "It has nice elevator music.   10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Best Simulator for Snipering.",
            "review_score": "1"
        },
        {
            "review_text": "If you could rate this I would rate it 10\\10",
            "review_score": "1"
        },
        {
            "review_text": "gud game, beat 2 scrubz and i win. gg no re.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game. My only wish is that when you take direct control of a unit, that you have the option to have all your other units do their own thing.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun with friends",
            "review_score": "1"
        },
        {
            "review_text": "this is just the best",
            "review_score": "1"
        },
        {
            "review_text": "it`s a good game but the ai is to hard they have a base and i hvent evan bulit a power stashon",
            "review_score": "1"
        },
        {
            "review_text": "Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "executive assault is a very unique hybrid of a rts and fps.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. Highly recommended. Brings in a new concept to RTS.",
            "review_score": "1"
        },
        {
            "review_text": "If this had modability, it'd be game number 1",
            "review_score": "1"
        },
        {
            "review_text": "Cool",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game to any fans of RTS and FPS, its really not my kind of game im not a fan of RTS but i can tell a lot of people will like this, buy it if you have the money it will be worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I really like the idea of this game, and barging into the CEO's office and blasting him with an energy rifle while a hundred robots fight downstairs is awesome, I really like it. But I can't seriously reccomend the game in it's current state to just anyone, this game has a few problems that are a deal breaker for most. I can work past the bugs and the hideously out dated visuals, but I can't say the same for everyone. But I can say, Dev, you must have sold over 400 copies by now, judging from the amount of user reviews, I did some math, and at a rough estimate I'd say something over 2 grand (but probably more because all I did was $10 x 400 - %50 (if Valve were ♥♥♥♥♥), which are all worst case scenarios in terms of sales), that should be enough to warrant further work on the games visuals and polish. I don't know the extent of the work being done, I'm just stating the obvious, that this game is, while a fantastic concept and it is really satisfying and fun (occasionally epic), it needs much more work before I can reccomend it to just anybody.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: -Fun concept to controll your units in a RTS in first person -Interesting objective to win games (Kill their Executive) -Lots of ways to upgrade (Units, Structures, Resource, Weapons) -Many weapon choices for your units. -The controlls on most units are fine  Cons: -The Resources were handled poorly, having no base income your priority is to get resource flow going immidetly by building resource nodes on few selected spots on the map -The Crystals that exist on the map is just snowballing, get alot of the research boost ones and you will just research everything and snowball. Get the Heskosium crystals that are dropped from meteorites and get access to stronger units. Its just a race to who can get the drone to the crystal first. -The AI version of your units will not destoy enemy drones. Only way to stop them is to go into 1st person. -Destroying a drone who picked up a crystal will not make the crystal aviable for you. -Alot of the weapon upgrades are pretty much useless unless you play in 1st person mode. The only weapons i seen the AI use with some effect are the basic machine guns and laser beams. Simply impossible for them to hit anything with a cannon. -A match can be won real quick if you buy one robot troop and send it to kill the enemy executive, honestly few people can afford putting out a defense so early on. (Once its inside the base you can rarely catch it before it reaches the CEO who dies so quick) -The AI version of my units tends to blindly shoot at walls as targetable objects are behind the wall. -The wall that lets you put units ontop of it is completly useless for AI can't shoot even if the target is right under them. Only useable for first person. -Once you get artillery, aiming them at the enemy's resource nodes will pretty much ruin their entire income and win you the game by simply having little to no threat left. -Sound can glitch out if its to many things making sounds at once. -Tends to bug out when selecting units   Overall: This game had potential but wasn't executed so well. Its more a race of which drone will reach the crystal first than it is a battle. The winner of the crystals is basicly the winner of the game. The only fun i had was messing around with a friend on this, and that was only for 1 hour of fun for us. This game had potential but changes needs to be made, it needs to be redesigned on its rules as this is a snowball RTS more than anything and it needs to have bug fixes for the sound glitches aswell as the bug that makes selecting a unit annoying. Ontop of that they need to improve the AI so more weapons are even useable for the AI units, making all my units use laserbeams since else they will miss everything if not is just not fun simply. The only way i can make use of the more hard hitting weapons like the cannons is to have a private aircraft with the cannon simply there for me to make quick assaults on incomming enemies. I shouldn't have to do that just to make the cannon useable.  This can be fun for some i can imagnen but i simply cannot recommend it unless it gets some patches that fixes some of theese problems.  (Theres not to much wrong with the AI players its just the non firstperson player units that are complete garbage)",
            "review_score": "-1"
        },
        {
            "review_text": "IMO there is not much to do and the maps are pretty small. It's also extermly annoying when right after you destroy a structure a repair bot rebuilds it in less than 10 seconds so you can never actually cut off the power to the enemy iron mines which they use to build more bots.",
            "review_score": "-1"
        },
        {
            "review_text": "Would not recommend, wait until full release.",
            "review_score": "-1"
        },
        {
            "review_text": "Lots of bugs!",
            "review_score": "-1"
        },
        {
            "review_text": "Dead game, don't even bother. The only lobbies people set up are all locked.   p.s. I have more hours in this game than anyone other reviewers so I know what I'm talking about. If you want to waste your money be my guest but not everyone has down syndrome. Shilling won't revive the game.",
            "review_score": "-1"
        },
        {
            "review_text": "👌👀👌👀👌👀👌👀👌👀 good ♥♥♥♥ go౦ԁ ♥♥♥♥👌 thats ✔ some good👌👌♥♥♥♥ right👌👌there👌👌👌 right✔there ✔✔if i do ƽaү so my self 💯 i say so 💯 thats what im talking about right there right there (chorus: ʳᶦᵍʰᵗ ᵗʰᵉʳᵉ) mMMMMᎷМ💯 👌👌 👌НO0ОଠOOOOOОଠଠOoooᵒᵒᵒᵒᵒᵒᵒᵒᵒ👌 👌👌 👌 💯 👌 👀 👀 👀 👌👌Good ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "I just got v1.0 and I like how it looks but I hit a bunch of UI bugs and its a clunky one. I think maybe v0.75 is more appropiate.",
            "review_score": "-1"
        },
        {
            "review_text": "Very unpolished with gameplay crashes, poor sound, poor situational awareness... My initial impression from the video's was that, 'Wow! This game looks really fun'. I actually wish, now, that i'd passed purchasing this title.  From the beginning, the developer has stated that he is doing all the program himself and that he needs the money... Granted.  However, from using the Unity Engine to complete the game, its obvious that this is a cash grab from the developer for a very very very unpolished title. Avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "graphics arent the best, but its in alpha and being develeoped by one person. gameplay wise, its a fun game, execpt for when it crashes, very commonly, poor directions in the tutorial but once you figure out the game, its very fun to play, and struggle againstg the easiest ai in the game because they got a single fighter to your base before you built any turrets 10/10 would leave base undefended while trying to find out wut the hell i was doing again.",
            "review_score": "1"
        },
        {
            "review_text": "Love the game, It has a few bugs here and there but that is to be expected from an indie game in such an early stage of development.  Totally playable and really fun :D  8/10, reminds me of my childhood &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Not unless you have a super computer,still cool game",
            "review_score": "1"
        },
        {
            "review_text": "This game is balls to wall amassing ive seen some game and this has to be one of a fav indie game, they guy who made this game you sir are a genus",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! It's something new and fresh. Props to the creator for making this!",
            "review_score": "1"
        },
        {
            "review_text": "Good game i like how you can close doors and if you get a lab you can teleport all of your troops anywhere in the game area.",
            "review_score": "1"
        },
        {
            "review_text": "THis game is the first good strategy game I have seen in a long time it comes in my first place category because who wouldn't like a strategy game with first person controlled units or even walking through your own base, but wait dont forget ther amazing graphics they are perfect.     Thanks Rob for creating this beautiful game! :)",
            "review_score": "1"
        },
        {
            "review_text": "This one's a gem. I play a lot of rts/fps hybrids, and I have to say, the base construction dynamic is what really makes this game unique. All the structures you build have a complete, fleshed out interior, and can be operated manually in first person mode. Astounding work. The combat in this game is also on a far grander scale than any other hybrid I have played. Its reminiscent of Warhammer 40K (tabletop, not dawn of war), in terms of the sheer number of units involved and the size of the battlefields. The tech tree is large and diverse. You will almost never complete it all. Specialization is a strategic factor, and I really enjoy that aspect. Over all, its a worthwhile purchase. I give it a 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "The most unique and interesting RTS I've seen since I played Earth 2160. It's core gameplay is fun, engaging, and challenging. I found myself developing my own tactic for eliminating my enemy, as have other players I've fought. The singleplayer lacks some of the challenge a human player can provide, even at the highest AI difficulty, but is still worth battling it out with up to 3 enemies!  I'd like to see more variation in map design, possibly including maps for more than 4 players, which would allow for more varied and interesting gameplay. There are also some minor bugs, some hilarious, some just annoying. The game could also do with some careful balancing, as certain stratagies far outshine other, not-as-viable ones.  Overall I recommend the game to anyone that enjoyed games like Supreme Commander, Red Alert, or any of the old classic RTS games. All in all, very worth the small price for hours of Executive Assault fun!",
            "review_score": "1"
        },
        {
            "review_text": "This review was made 7 days after release so I know some things will have changed :) PROS - Beautiful mix of FPS, RTS and pretty much the supreme commander games with a first person abillity. - Disabling the reactor coolant is just F**KING amazing. - Being able to design your own robots and vehicles etc gives a superb sense of this is your own personal touch. - Robot armies are 2 kool 4 skool. - The sense of scale when you look around in first person. CONS - Slight fps drops during combat with huge fps drops in larger bases during longer games and i'm running i7 4770k 3.50 GHz paired with 16 gb ram and a gtx 780ti. - Graphics are not the best in the world. - Some of the enemy ai don't react when you are in their base. - Missiles and artillery are overpowered - Matches need to last longer somehow, its too simple to win rush units at the start and win win win  I hope that this game continues to be updated because by lord gaben iv'e never played a game like it before :D 100% worth the price it is at now.",
            "review_score": "1"
        },
        {
            "review_text": "Played as executron  Killed the janitor Lost  Would kill the janitor again 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Its a great mix between an RTS and an FPS and i have never seen anything like it. It could use a bit more detail and other such things but its good.   8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is AMAZING. I would definitely give this game 4 thumbs ups considering it is made by only one person. Really can't wait for more updates with new units maybe.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun so far, pretty intense but very enjoyable. Definitley worth how much he charges for the game. Ive always wanted to be able to actually explore the battlefields in an RTS and this game allows that. Very cool. Props for the execution.",
            "review_score": "1"
        },
        {
            "review_text": "the world needs more FPS/RTS",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game with a better PC, I can recommend it. its a lto of fun and worth of playing. Sadly there are barely players who play online. I hope that it will change in the future. Great game my rating of it is 9\\10",
            "review_score": "1"
        },
        {
            "review_text": "A great game it just need more content like maps and mods",
            "review_score": "1"
        },
        {
            "review_text": "has all the elements i've been wanting in an rts for years. good job to the one man team. i cant wait to see the next installment.   only thing ill say is even though this game is quite playable just be aware that this game does have perfomance issues, but i beleive that might be a unity engine limitation. as long as you dont have too many units on the screen you'll be right (more than 200 units in my case drags to a crawl)   i5 2500k gtx 660ti 16gb ram",
            "review_score": "1"
        },
        {
            "review_text": "One of the best PC games ive ever played! 11/10 but needs graphical improvements",
            "review_score": "1"
        },
        {
            "review_text": "4/5 very good indie game its EXTRIMLEY FUN getting an army to assasinate the enemy leader its very cool. I started having Hitman 2146 flashbacks",
            "review_score": "1"
        },
        {
            "review_text": "this game is an absolute gem i love it so much and rob is a shining example of a A1 developer good job on creating such an amazing game and so actively improving on it and actually patching the game when we report a bug to all other developers please try to be rob now moving onto the game   the game is an rts with a twist you start with an office a ceo and a building plot it is your job to protect your ceo by building defences and units it is also your objective to assassinate your opponents ceo the units are desighnable you can add armor weapon and a special there is infantry artillery and air all more or less customisable in the same way not only that but you can actually control them and partake in these massive battles raging in the game its such a cool feeling to be fighting off hoards of robots and see your fighters and tank backup rolling over the competition from down on the feild as a unit yourself it feels great not only that but the interior combat while buggy is so cool you can have a skirmish raging in your drone factory and be one of your units attempting to hold off hoards of robots trying to bust into this facility while the machines are still making drones! you can see your unit production queue finishing as your repelling invadors out of your factory this game all areound makes you feel like a boss and does a great job of incorperating one great genre into another one also the tanks are controllable to so if you enjoy any form of rts and you wish you could play as one of your comandors or one of your tank drivers or fighter pilots or even just sit up from your desk so you can witness orbital lazer death falling on your opponents base with your own eyes this is definantly the game for you  11/10 would comand lazer artillery from the feild again",
            "review_score": "1"
        },
        {
            "review_text": "GREAT GAME!!!!!!!!!! Would play anyday fun with bots but even more with Friends",
            "review_score": "1"
        },
        {
            "review_text": "This is the game most games wish to be like.  This game is amazing and the only bad thing about it is the lack of publicity. This game is a blend of FPS and RTS, if you wanna play tactical you can play top down or if you want to play commando select a unit and join the battle down below. This is one of those games you have to play to believe, words don't do enough justice.",
            "review_score": "1"
        },
        {
            "review_text": "A fun Hybrid game thats a fps and rts. Sometimes no one will be playing but is fun to play with a A.I.s but friends is ever more fun. it might look bad but is very fun to play",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game. All there is to say. GLORY TO ARSTOTZKA!",
            "review_score": "1"
        },
        {
            "review_text": "This is the first game I have been exrited about in the last 8 years.  10000000000/10",
            "review_score": "1"
        },
        {
            "review_text": "the world needs more FPS/RTS",
            "review_score": "1"
        },
        {
            "review_text": "This is a solid game to play with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game though in a unfinished state is a amazing game. the idea is bright, and new. only proble is that there are some bugs, but the gameplay out shines them 9/10 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "Grand. So amazing.... It really is.",
            "review_score": "1"
        },
        {
            "review_text": "Me and my nephews (ages 7 and 10) had a blast with this in multiplayer. I could build and research, and they could gawp at the increasingly larger mechs they could commandeer and march into oblivion.  It's wonky and screams Unity 3D, but I actually found that kind of quaint. It's not something I'd really play on my own, but as a most-ages LAN game it's great for the price.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game",
            "review_score": "1"
        },
        {
            "review_text": "If you research and build vehicles and a laser of some sort you tend to do very well. Stats shown at the end of a battle seem to be wrong, wish the maps were bigger. No real AI difficulty selection, though from some of the games I've played one tends to be very aggresive, one defensive, and the other a balance. Pretty decent game for ~$4 (sale price). Don't have any friends so can't review multiplayer, sorry. Good solo play, though. 8.5/10",
            "review_score": "1"
        }
    ]
}