{
    "app_id": 331790,
    "name": "Data Hacker: Reboot",
    "release_date": "2015-04-17",
    "developer": [
        "New Reality Games"
    ],
    "publisher": [
        "New Reality Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Indie",
        "RPG",
        "Adventure"
    ],
    "achievements": 40,
    "positive_ratings": 107,
    "negative_ratings": 65,
    "price": 3.99,
    "description": "Time, Space and Parallel Universes collapse and merge, tethered to threads of reality and sustained by a paradoxical power source. Nothing is impossible - it is time to become a Data Hacker.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/331790/header.jpg?t=1447364772",
    "minimum_requirements": "OS: Windows XP or above Processor: Intel Pentium 4 2.Ghz or above Graphics: Minimum 960x540 Desktop Resolution Storage: 700 MB available space Sound Card: Stereo Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you are curious about my review, please read it along  In the first map, I don't have a single clue of ♥♥♥♥ about what I have to do. I fought for a million times, got something from it like xp and some items. For the first time this was really exciting -- as I said, for the first time. This was like 5 minutes. I played 40 minutes overall, don't think I am gonna play any more about it. Back to the thread -- It went downstairs from exciting. Every second step, I dropped into a fight. This made it boring, and even annoying. But, I continued searching along because I saw the story exciting. For now, I don't even have any clue about what I have to do. I am stuck in the first part of the game with that Mohawk guy and the another at the first part. I can't do anything with the dark guy in one of the rooms, I can't get any further from there.   But here's some compilating from me  Pros: - Really good music, it is nice and chilling -- sometimes - I love how the game itself looks, the anime characters are nice, but could have been better - The story plot looks fine for the time I have played it   Cons: - The game doesn't give you a single hint about where you should go - The battle system is annoying as hell - Poor menu - The settings tab is terrible (it takes a year to take down the volume ingame) - I can't even use my cursor even if I see it  Maybe I am gonna give it another try sometimes in the future - but thats probably not now.  Even if I had mentioned so much cons with only a few pros, I recommend it. If someone knows anything better about RPG games than me (and that's probably everyone, I don't really play RPGS, but I enjoy them) then s/he can probably enjoy the game a lot more than I. As I said, I am going to give it another shot in the far future.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game, and got into it. The class system is fun and I enjoyed the time throwback to old school JRPGs.  That being said:  There were a lot of small glitches that made things weird at times, walking through walls comes to mind immidiately. I've been unable to access a good part of the game, and I'm not sure why. The developer has spotty response to the forums. I'd like to reccommend this game, but I can't. There's no reason I shouldn't be able to get further in the game, but since I have no idea why not, the game is done. It may be a limit of the engine used to create the game, it was frustrating, and the major reason that I can't reccommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Data Hacker: Reboot is awful. There is no sense of direction and the balancing needs massive rehauling. The first hour of the game I'm sleeping at the keyboard with tutorial minions following the character's chore of a game day, only to be lead a lie when the 'first mission' comes into play. The minons jumped having twice the damage and stunlock my party to death! This isn't a game its a test to see if you like wasting hours grinding only to be ground into the dirt yourself.",
            "review_score": "-1"
        }
    ]
}