{
    "app_id": 331720,
    "name": "Survivor Squad: Gauntlets",
    "release_date": "2015-11-16",
    "developer": [
        "Endless Loop Studios"
    ],
    "publisher": [
        "Endless Loop Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "Indie"
    ],
    "achievements": 86,
    "positive_ratings": 119,
    "negative_ratings": 31,
    "price": 3.99,
    "description": "Command your Squad of Survivors in a game where Line of Sight is extremely important, you cannot shoot what you cannot see. Develop your formations, move as a unit and cover every corner. Leave no man behind!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/331720/header.jpg?t=1447798670",
    "minimum_requirements": "OS: Windows XP Processor: 1.7Ghz Core 2 Duo Memory: 1 GB RAM Graphics: Radeon 4850 or equivalent Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A clever little tactical game. At first I was a little concerned that the control scheme wouldn't be quite poewrful enough to pull off all moves with all the finesse I was hoping for, but I was pleasently surprised: The controls are exceedingly simple and easy to use, but powerful enough to give you as much control as you need over your little Zombie killers. Add on top of that one of the best implementations of user generated content I've ever seen, and you've got some twitchy-tactics to keep you busy for a good long time.",
            "review_score": "1"
        },
        {
            "review_text": "Survivor Squad Gauntlets is a decent strategy game with good gameplay elements and is only $9  Pros: - Fun Strategic Gameplay - Really good editor - Lots of options in editor and is really in depth - Some great levels from the devs  Cons: -Game is up to the community so there might be some not on par levels. - There should be a longer campaign  - graphic style is a bit messy - More tutorials needed for editing parts!  Despite some flaws, this game is still very fun and one you should check out.  Rating: 6/10  ",
            "review_score": "1"
        },
        {
            "review_text": "The game was developed and published by Endless Loop Studios. The game was released 1st May 15. I don't have any experience with the former 'Survivor Squad' title  I was provided a copy by Endless Loop Studios, for making feedback suggestions and write a honest review and would like to thank them for that.  The main setting of the game is set in a post apocalyptic world where you can chose between different scenarios called 'gauntlets', these scenarios are either connected with each other or single scenarios.  The missions are various and can reach from search and evacuate to collect enough materials and leave the area.  I found the game very basic and the graphics are nothing special which was not expected and which is not necessary. The combat is pretty fun but repetitive as the rest of the game. The controls are based on left mouse select and right mouse order controls. The game is pauseable with space.   The game functions well and nothing is broken or buggy, which is really good since it's like that from the launch.   If you expect a game like 'Doorkicker's' with Zombies you wan't be satisfied because you can barely call the game tactical.  If you enjoy games like 'The Masterplan' and other squad based shooter games then I would recommend this to any hardcore fan of the genre. However, if you're not familiar with the genre then you may find the repetitiveness of the game off putting.  The price is fair enough.  Thanks for reading :)  PS:The game got Steam Workshop integration.",
            "review_score": "1"
        },
        {
            "review_text": "Haven't played alot but i can see that it is a great game and has alot of potential.  One thing I would like to point out wether this will change or not is I would love to see more levels made by the developer.",
            "review_score": "1"
        },
        {
            "review_text": "NOTE: i was given a free copy of the game for reviewing purposes, but lets not worry about that shall we?   survivor squad: gauntlets is, simply put, survivor squad + improvements, and most of what i have to say about survivor squad has already been said in my review of the first game. but rather than talking about the first game, lets go into what this game has done to improve and change what survivor squad has already established.   first off, a rather minor thing at best, is the charactors and voice acting, its generally better here, but it is, again, a minor detail.    the aiming machanic is greatly improved (or something i hadn't noticed in the first game due to lack of tutorial*). aiming in this game works better here due to 2 good features, locking aiming direction and moving while looking a specific direction. these 2 abilities allow you to better secure areas and check corners. good things to have in squad based game play.   the inventory system as been reworked a bit, but i hardly noticed due to not having to pick up everything i needed like in the first game.   where the first game was procedural generated, gauntlets allows for user created maps, and knowing how creating some users can be, great things can come from it. but this comes with a slight downside, there was only a few non user created maps (last time i played), meaning that most levels have to be user created. but then again, the map editor is built in, so, get bored, build your own level. simple...  other than that, i've run out of things to say about the game in the rather short time i've played it, it was as simple as the first game and in the end, it felt almost the same in most aspects   *another improvement the devs added was the inclusion of a basic tutorial for basic controls, whereas the first game has a brief opening sceen that allows you to move, nothing more",
            "review_score": "1"
        }
    ]
}