{
    "app_id": 33180,
    "name": "Zombie Shooter 2",
    "release_date": "2009-11-18",
    "developer": [
        "Sigma Team Inc."
    ],
    "publisher": [
        "Sigma Team Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "Zombies",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 291,
    "negative_ratings": 85,
    "price": 7.19,
    "description": "Zombie Shooter 2 is a unique blend of two game genres - Action and RPG. Every player can choose a character to the liking, get experience to develop skills, earn money and spend it at weapons, medications and useful devices. All of this will be used against thousands of enemies.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/33180/header.jpg?t=1552378660",
    "minimum_requirements": "OS: Windows 2000 / XP / Vista Processor: 1.7 GHz Memory: 512 Mb Graphics: DirectX compatible video card with 128MB video memory DirectX®: 9.0 Hard Drive: 1.5 Gb Free Space Sound: DirectSound compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Zombie Shooter 2 is a fun game that builds on the first one. There is definitely more of an RPG feeling as you get to choose from quite a few perks to make the gameplay more interesting. There is more of a story, and the graphics look less arcadish and more gritty. Definitely stronger than the first title. This is a fun game to play when you want to kill zombies and relax while doing it. I have had fun playing this with family multiple times",
            "review_score": "1"
        },
        {
            "review_text": " A missed opportunity",
            "review_score": "-1"
        },
        {
            "review_text": "[Pros]  -Three modes availiable: Campaign, Survive and Gun Stand mode. Play first the Campaign mode, then the others.  They extent the gameplay time significantly. Only the Campaign Mode took me 5 hours to complete it.  -When you start playing the Campaign mode of the game and you are ready to select a character......READ THE BIOS OF ALL THE CHARACTERS!!! The Bios are the best part of the game!!! I'm joking of course, but please read them. They are the most wtf, weird, unbelievable, hilarious, background stories I ever read!!!! Pure gold!!!   -You start the game with a special perk for your character. I wanted to say all the perks are good, but..........select the Vampire perk right away. Killing millions of zombie/mutants hordes and getting health for each kill is the best way playing this game [for me at least].  -The gameplay is a pure action shooter with some RPG elements on it. You get levels after you killed enough enemies and you can update your character by putting point in different skills. Also you can change the weapons/items you are using depend how useful/powerfull is for you.  -The weapons are indeed the biggest part of the game. Nearly all the weapons you are using in the game are perfect and enjoyable murdering the endless waves of enemies you meet. Also they are so many of them that I finished the Campaign mode without using them all!!! Every single time I found or bought a weapon, I acted like a little kid trying my new awesome toy.  -Many secrets you can find in the game and gladly nearly all of them are actually worth find. Find a secret a get a powerfull armor/weapon is always welcome.  -Big Variety of enemies to fight from a simple zombie rat to giant mutants with rocket launchers!!! My favourite enemy are the wing naked ladies you fight :3  -The story is hilarious, classic ,cliche B-Movie style and ridiculous. Even the dialogs are cliche as f*ck.  -The enjoyment of killing thousands or enemies in a sigle room after a hard day at work......Aaaaaaaaa the feeling is good. I suggest you to buy the Minigun and a giant Multi-Rocket Launcher as soon as possible.   -Controlling a Tank and a FlameThrower Robot is a nice break and relax a little for worring about dying.   [Cons]  -The graphics are VERY outdated and look indeed like a 10 years old game, but let face it, they serve their purpose and the gore look good. Personalty not a con for me, but for others it might be.  -Before start playing, go in the Graphics options and turn of three things:  Film Effect, Vsync and Bw/Color. Two reasons why: 1.If the Vsync is on, the game surprisingly lag REALLY bad. I hope this not happen to others, but test it first to be 100% sure. 2.The Film Effect and Bw/Color make the game look like a black n' white Horror B-movie. However this didn't worked for me.... I prefer to see the things as it is in this case.  -Problem with the screen resolution. I tried many times to fix it for a 16:9 monitor, but again the screen doesn't fit.   -The unpleasant feeling when you try to move around to small places and get stuck from small objects.  -At some point you will drive a car with a giant gun on top of it. Sound great but sadly the driving is terrible...  -It is a Zombie game. Yes, in our days the Zombie Theme is a negative and I will admit, I am sick of it as well a little myself.  Final Thought  If you want to have a relaxing day by killing a massive hord of zombies with a giant variety of weapons, this game is for you.  However I suggest you to seek for guidance on Forums if you have technicals problems with the game. Also if you are sick of Zombies, then this game isn't for you.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "I have to say I liked Zombie Shooter 2 more than the Alien Shooters, but I think that is personal preference. Is it much different from Alien Shooter 2? Not really, the music is the same, the graphics (and environments) are the same, the characters you can play are the same- same for the gameplay. The three survival missions are the same as in the other games, too.  Only difference- you shoot zombies instead of aliens.  So why do I like this one more than Alien Shooter 2? I like the layout of the screen, start screen and the menu more- they are more sombre and better fitting the the theme of the apocalypse. I also like the 'storyline' more- although you won't get any Shakespearian plots here. The campaign and missions are different from Alien Shooter 2,so you are playing through different levels- although the environments are basically the same as in Alien Shooter 2. Oh, and this time round you have also the option to play the game in black and white- with only the blood as red (or green). Quite atmospheric.  Should you buy this? If you liked Alien Shooter 2 and like more of the same, I can recommend this, I had quite some fun with this one.",
            "review_score": "1"
        },
        {
            "review_text": "Delivers what it says on the tin: there are zombies and you can shoot them. There's a bunch of upgrades and such, but this is not a genre of game I enjoy.",
            "review_score": "-1"
        },
        {
            "review_text": "Shooting Zombies can't get boring right? Well this game will test that. At first there aren't too many and you take your time and enjoy every kill. However as you progress more and more zombies are trying to eat you. Near the end it's almost endless. While this was not a complete bad thing it did start to get a little boring and tiring on my trigger finger. However I did enjoy enough of the game to recommend it and I'd definitely play again with different stats for my main character.",
            "review_score": "1"
        },
        {
            "review_text": "The first was OK, but this one looks terrible and doesn't improve at all.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the game that came before Alien Shooter 2 reloaded. If you are familiar with the Zombie/Alien Shooter games and liked them then you will like this one. Major draw back about this game is your forced to play in a sort of black &amp; white screen color. Only blood,explosions,weapons,gfx effets are in color everything else is in black n white. Annoying and odd move by the dev but I always play with nightvision goggles so eh.  I recommend getting it in a pack that has the other shooters in it or when its on sale for 75% off. Do not know if I would pay $10 for it (no offense to the dev) but the screen color is to big a turn off.",
            "review_score": "1"
        },
        {
            "review_text": "attempts to improve the first game force a nosedive in quality. the first zombie shooter was entertaining for its lighthearted feel and solid gameplay. zombie shooter 2 tries to hamfist a story and nigh desecrates its pacing with heavier and uneeded rpg elements. not a single person on earth is going to take this game's story seriously. I say that because I'm not either. the difference between an excuseplot of the original to the sequel's full-on b-movie feel isn't very enjoyable because the game's artstyle and music do not coincide with the scenario. this would only be a minor complaint if the game delivered on its gameplay but sadly it does not  on the positive side, stats and perks actually matter. on the negative side, because now they do matter, it is possible to have a character that really isn't equipped to face the final levels (I recommend cash perk if you're going to play). cash is MUCH more important so save for the bigger weapons and only the big weapons. you see, instead of having fps weapon bar with everything at your disposal, you have only 3 weapon slots: small, medium, and large. this more or less means you use a pistol, machine gun, and rocket launcher... the whole game. being that the enemies are generally idiots the lack of interesting guns until very far in contrasts with the pacing of the original. the insistance on rpg elements makes the early half of the game a sort of a grind and, really, I just wanted to shoot zombies, not deal with half-arsed progression  so there is equipment now, but it is just armor that functions like old fps (and the previous game) and implants that raise your stats. changing implants for your situation can supply depth, but it is marginal. sometimes I wanted more hp, sometimes I wanted to move faster. the OPTIONS! anyway it's stupid expensive to repair armor so you're further punished for just playing the game. if you take damage in a level run through then you're digging yourself into a hole unless you're wearing cheap or no armor - and then why is there even armor? ammo for powerful weapons is also expensive, so yeah. have fun with your pea shooters  the game is an exercise in poor resource management. the enemies and environments are varied enough to warrant a good time, but instead of being a jump-in action game, it's some kind of frustrating survival shooter. hordes of zombies with rediculous amounts of life aren't really how survival games operate. the inventory system, story, and rpg progression are a step back from the original, basically. I must praise the game's so-called film filter though, it gives the game a unique feel that was somewhat lacking from the original. I'd turn off the black&amp;white option though - what's so fun about black blood. the soundtrack is on par with what sigma puts out, so play your own music gents.  or don't play this game, it's not worth the aggravation. did I mention there are points in the game where you can get stuck in the environment? totally stuck, movement will get you walking into the walls. it's possible to leave the way you came out, but it may take minutes to figure out the precise angle, and many people find that they need to restart the levels. if you, for some godawful reason, really need more zombie shooter, try alien shooter. if you have to play this game, give easy mode a shot. I did not play on easy mode but I wish I did. the modal difficulty does not excuse the game's flaws  to quote the game's villian, 'farewell... and let the progeny... understand me...'",
            "review_score": "-1"
        },
        {
            "review_text": "Garbage game trying to take advantage of the 'I love zombie rpg games!!' thing going on.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game this is the only game on steam my old PC can play and I got it for $0.99",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, really interesting but it is too short... only for few hours. ofc if you dont want play survivors",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. I love both Zombie Shooter games, and this one just adds to the first. If i recall this one does get a little harder at times than the first game. Very entertaining isometric horde shooter. Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Got it for a few cents, worth! :P",
            "review_score": "1"
        }
    ]
}