{
    "app_id": 331920,
    "name": "Airline Tycoon Deluxe",
    "release_date": "2014-11-14",
    "developer": [
        "Spellbound AG"
    ],
    "publisher": [
        "HandyGames",
        "Black Forest Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Management",
        "Retro"
    ],
    "achievements": 0,
    "positive_ratings": 155,
    "negative_ratings": 63,
    "price": 6.99,
    "description": "Airline Tycoon Deluxe is a funny economy simulation proceeding in realtime and assigning you the complete responsibility for an airline.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/331920/header.jpg?t=1534405467",
    "minimum_requirements": "OS: Windows 98/ME/2000 or XP Processor: 133 MHz Processor Memory: 32 MB RAM Storage: 600 MB available space Sound Card: Sound card (100% Soundblaster compatible)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's a classic. Got the game on sale for 1,99€. Worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "A real classic Tycoon game with a suprinsing deep economic system and fun gameplay. Everything a Tycoon should be. The original is much better than the remake",
            "review_score": "1"
        },
        {
            "review_text": "This is a really enjoyable game, however I have noticed one bug where my character keeps needing the toilet every five mintues. It's pretty damn annoying as it makes it difficult to get anything done. I don't know if anything specifically causes this but it sucks.",
            "review_score": "1"
        },
        {
            "review_text": "My screen remains black, what ever i tried. Couldn't find any solutions on the web, only two other people on some forum's with the same issue. From the date, of the posts that i have seen on it, they are waiting for over a year for an answer. Im ain't gonna wait for that, so i requested for the first time in my life a refund, hope that they are fare in there refunds:)  Bassicly i chekced the reccomendations from people on steam, i noticed that there where some lags and issues here an there. I asumed that it wouldn't bother me with my new pc, but i seems not to.  So you are warned it seems to be a fun game but there are a lot of issues from what i have noticed and seen.   Update: 22-07-2015/ Got the refund i reqeusted. Verry nice from steam thumbs up for that!",
            "review_score": "-1"
        },
        {
            "review_text": "The enjoyability of this game is pretty much ruined by the absence of support for it. Some of the controls aren't easy to figure out and you're pretty much required to know up front about collectible items, advisors, routes, etc. Meanwhile, there is no useful website or manual to be found anywhere, nor is there an active community. So basically, unless you already know how to play the game from back in the day, don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": " You're a manager that buys cheap airplanes that can drift, sets up flights and stalks your passengers.  What the f**k did I just play?  0/10",
            "review_score": "-1"
        },
        {
            "review_text": "This edition is much better than later editions (AT 2,...) and it is fun, if you like good tycoon game this one is for you. Lot of features, competition, missions/campaign. I still love playing this game even after all these years.",
            "review_score": "1"
        }
    ]
}