{
    "app_id": 331980,
    "name": "Last Inua",
    "release_date": "2014-12-11",
    "developer": [
        "Glowforth"
    ],
    "publisher": [
        "Wired Productions",
        "THQ Nordic"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Casual"
    ],
    "achievements": 17,
    "positive_ratings": 97,
    "negative_ratings": 80,
    "price": 5.99,
    "description": "Last Inua is an immersive and emotional platform adventure game developed by Glowforth. A captivating experience, Last Inua tells the tale of an Inuit family’s fight for survival in the harsh elements of the mythical Arctic. The Tonrar, a demonic trickster, has awoken in the arctic.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/331980/header.jpg?t=1541171293",
    "minimum_requirements": "最低配置: 操作系统: Windows XP SP2 处理器: Intel Core 2 Duo 2.1 GHz or equivalent 内存: 2 GB RAM 图形: 2nd Generation Intel Core HD Graphics (2000/3000), 256MB DirectX 版本: 9.0 存储空间: 需要 600 MB 可用空间",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "+ Two entirely different characters + Good graphics  +/- Not terribly hard but...  - ...some frustrating solo levels (played with the son) - The story didn't manage to impress - Short - Slow paced  [Rating: 67/100]",
            "review_score": "1"
        },
        {
            "review_text": "Last Inua has a pretty artstyle, boring-ish story, okay puzzle platforming, but the controls are frustrating. The animations are slow moving and the controls are slow to respond, but it did not ruin the platforming for me, what did were the flying levels with Hiko. Those were marred with shoddy controls that are difficult to handle. It's a one hit instant death with a full restart each time, not like rest of the game, where if you died you started where you left off. The narrow corridors with spikes, shoddy controls and instant death back to the beginning are frustrating and ridiculous! Why do this devs? Its a fun little game to a point, then it gets frustrating and loses much of the fun factor. 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "It is quite a nice game, it is a small and nice game. It has a few flaws, especially with controls.. But, not enough to make it bad. Worth buy it, when on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game was really great up until the floating level which is just down right annoying. That level literally ruined the game for me and made me turn this game off. They ruined what could have been a brilliant game.",
            "review_score": "-1"
        },
        {
            "review_text": "Cool little game. Got it in a bundle and was surprised at how much I enjoyed it. Great job Glowforth. Different.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty wierd game, I got this game in a bundle, but I wonder who literally just buy this game! XD",
            "review_score": "-1"
        },
        {
            "review_text": "Great visulas and great story but controls are little clunky, definitly not the best platformer but looks and story make it up for me. I think some frustrating parts could be little easier so I could focus more on exploring and discover story than repearing over and over some parts. Not for everybody but I kinda like it :)",
            "review_score": "1"
        }
    ]
}