{
    "app_id": 332410,
    "name": "Moonchild",
    "release_date": "2016-04-22",
    "developer": [
        "Aldorlea Games"
    ],
    "publisher": [
        "Aldorlea Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "RPGMaker",
        "Indie"
    ],
    "achievements": 23,
    "positive_ratings": 96,
    "negative_ratings": 20,
    "price": 5.99,
    "description": "What kind of danger can a mother face to rescue her child? Moonchild is a unique and enthralling 16-bit style RPG adventure featuring 9 amazing characters, plenty of sidequests and countless items and spells.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/332410/header.jpg?t=1487172290",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8 Processor: 1.6 GHz Memory: 128 MB RAM Graphics: DirectX 9.0 Compatible DirectX: Version 9.0 Storage: 150 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Moonchild from Aldorlea is an exciting quest involving a mom (Queen Calypso) to save her daughter (Moonchild) from a vague, but likely terrible ritual that seems to be involving female royalty across the land. The action begins immediately with the kidnapping as Calypso leaves her castle via a secret dungeon-like path and goes from there as she and her assorted party members search a vast land for various people and items to assist in the search. The story is excellent, and quite involved, but the goals are always clear, and the tale is revealed in a straight forward manner. Although there are a ton of things to do, see, and explore there is always a sense of urgency to find the child.   The key is exploration. Everywhere you go, there is a dungeon/maze type path to travel through to reach the immediate goal. You will need to search everywhere and everything as there are treasures galore, bountiful secrets. and a host of characters to talk to. Some have side quests for you to add to the list of things to do. It may sound a bit involved, but it all holds together perfectly.   The artwork and music are very nice, adding greatly to the enjoyment of the game.   Battles are nicely conceived, and, depending on the level of difficulty chosen, can be quite a challenge.   The characters are very likeable, and there is quite a bit of emotion in this game that is not always found in rpgs.   It adds up to a really good rpg for fans of this type of game and should be on the must-play list. Highly recommended. ",
            "review_score": "1"
        },
        {
            "review_text": "Another one of Aldorlea's games. This Steam version has some new unique art. While the story in the game is not too compelling, it has enough pace to make you want to see how it unfolds. The game has a few really powerful and, in my opinion, unbalanced spells that could potentially spoil the whole game for you if you get them early on(one of which is possible to get right at the beginning of the game). Those aside, if you are looking for a few hours of fun, go ahead and buy it!",
            "review_score": "1"
        },
        {
            "review_text": "[Neutral Review]  Firstly, I must say that I like RPG maker games and my first impressions of Moonchild were pretty good. The characters had strong and captivating personalities and the plotline was intriguing.   But as the game progressed, the massive grinding and the unbalanced levelling system made me drop it at some point. I really felt unmotivated, even though I wanted to see how the plotline would evolve.   If you really like RPG maker games and is looking to play a new one, this is a 'ok' one and you should give it a try - even with all it's flaws. I hope you won't get bored as I did.",
            "review_score": "1"
        },
        {
            "review_text": "Epic fights, good story, and character development with nice Graphics! If you like this kind of RPG games there is nothing to think about..... Buy this game! :P          YouTube™ Video:  Moonchild gameplay HD - Classic RPG - [1080p - 60fps]&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I don't mind mazes. I like them(mostly) to be honest. But walking in a specific direction for 10 minutes only to realize it was a dead end all the time is frustrating. Especially when some towns REQUIRE you to go through these mazes.  The game does not tell you what enemy is weak to what element. Some powerful looking skill will deal pathetic damage, making you wonder WTF just happened.   This game made me avoid all RPGMaker games because of the ♥♥♥♥ I went through to complete it. I honestly don't get the positive reviews. I hate to write a negative review. But I cannot recommend the bloody mazes, poorly explained battle system and a subpar story to anyone.   I got this game on a sale. And even I want a refund. Do NOT buy.",
            "review_score": "-1"
        }
    ]
}