{
    "app_id": 332490,
    "name": "Battle Fleet 2",
    "release_date": "2014-11-20",
    "developer": [
        "Mythical City Games"
    ],
    "publisher": [
        "Mythical City Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Leaderboards"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Naval"
    ],
    "achievements": 17,
    "positive_ratings": 213,
    "negative_ratings": 65,
    "price": 11.39,
    "description": "Welcome Admiral! Select your fleet, assign weapons, and sink the enemy fleet by controlling each of your ships down to setting the aim and range of each weapon's shot. Features include full open world Pacific &amp; Atlantic campaigns, cross-platform multiplayer and awesome turn-based naval battles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/332490/header.jpg?t=1552592669",
    "minimum_requirements": "OS: Windows XP Processor: 1.5 ghz dual core Memory: 2 GB RAM Graphics: 128 mb Video Card DirectX: Version 8.0 Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows 7 or 8 Processor: 2 ghz dual core Memory: 2 GB RAM Graphics: 256 mb Video Card DirectX: Version 9.0 Network: Broadband Internet connection Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "Hey, Harpoon it's not. But then again who has the time to invest ina game like Harpoon. Battle Fleet 2 is a mix of fun, some light strategy, a little bit of tactical thinking and the satisfaction of watching your salvos hit the mark. It isn't for someone that wants total immersion, but it does give us elements of everything that one needs to to lose themselves in the S Pacific or Atlantic while waiting for the kids to get home from school or on that boring flight to Tampa for business.   Historically accurate, up to a point and interesting enough to hold the attention of a military history student such as myself, I think that the developer has hit the right mix to appeal to someone who otherwise might not purchase or be inclined to play a war game on any level. Furthermore, the developers do care about what the customers say...more than I can say for some companies.   Pros:  Fun  Decent Enough Graphics and Sound Some Good History  Engaging, but not demanding Has replayability  Cons:  Not deep enough to appeal to real military hounds Feels a little 'appy'   Overall, This gets my thumbs up for the way it can fill in the void of stupid apps to a pretty darn serious PC gamer like me. Like I said before: Fun, Engaging enough and fills the niche left between dumb apps and super serious strategy.",
            "review_score": "1"
        },
        {
            "review_text": "Simpler version of the old SNES classic PTO 2 this game should bring any TBS gamers many hours of fun. Battle Fleet 2 definitely has that 'just one more turn feel to it'.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished sitting down with this game for the first time, that was 4 hours ago that I started. While some mechanics get a little tedious ( what game doesn't have that! ) The visuals and major mechanics of the game are outstanding! Highly recommend, if you are one of those people who go for the gameplay per $$ value this one has some great replayability to it!",
            "review_score": "1"
        },
        {
            "review_text": "Only played for an hour so far but at this price how could you not like it?  Graphics are OK for this type of game although it would be nice if you could get up even closer during the action. It's got a pretty basic control system and is easy to learn, it could become pretty adictive if you like these kind of games. I've not tried the multi-player yet but will be doing soon.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great and fun game.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 : One of the best naval combat simulations, I recommend it to navy combat fans.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun naval combat game. The shooting is skill based. The better you get at range estimation the more hits you get. I recently sank two IJN ships without receiving a single hit to my units. Recommended game.",
            "review_score": "1"
        },
        {
            "review_text": "The games keeps getting better and better. Constant updates keep you coming back for more!",
            "review_score": "1"
        },
        {
            "review_text": "Solid if simple play. Wish there were more ship options. Carriers should be able to launch more than one airstrike on a turn and should avoid ship to ship combat.",
            "review_score": "1"
        },
        {
            "review_text": "Truly excellent game! Have been playing the Battle Fleet series since day one and each new version is so much better than the previous one. For all who like turned-based and real time strategy games, Battle Fleet is a must! Thanks JJ!",
            "review_score": "1"
        },
        {
            "review_text": "Battle Fleet 2 is a fun and addictive game. There are lots of ships including various battleships, cruisers, aircraft carriers, destroyers, frigates and submarines for both side of conflit: US and Japan. For the single player campaign mode, the AI is very competent during the tactical battles, but I find it lacking in strategic layer, the strategic AI is too passive.   For those unfamiliar with this type of game, players take in turns shooting at each other by setting the angle and power for each shot, seeing where that shot lands and then adjusting their next shots until they hit and destroy their opponent's ship. Battle Fleet 2 has detailed shot and damage modeling, including the altitude of the shells are modeled during their firing arc. The graphic are crisp and clean, interface is simple to learn and pick up, the sound effects and the damage modelling bring the fights to life.  There’s not much to fault this game on, except no save during tactical battles and the campaign mode lacks depth, also one can argue it is entirely too easy to use smaller caliber gun to get bearing and distance, then obliterate the opponent with bigger guns. But this is really fun and addictive game, highly recommanded.",
            "review_score": "1"
        },
        {
            "review_text": "Great game !!!",
            "review_score": "1"
        },
        {
            "review_text": "This is comparable with Kantai Collection but with more calculation skills, strategy, plans and no more annoying RNG. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "A very simple, very fun game. Not much depth, but you get to blow things up real good.",
            "review_score": "1"
        },
        {
            "review_text": "good game short tho.",
            "review_score": "1"
        },
        {
            "review_text": "The original was light fun. The revision messes that up. Maybe once I understand what to do with the transports it will feel better, but for now this game will not be played much.",
            "review_score": "-1"
        },
        {
            "review_text": "I must say that does not is worthwhile, I mean the price is hight for the quality of the game. It's so simple. There isn't even a voice and the game. Needless to say that I regret have been buying it.",
            "review_score": "-1"
        },
        {
            "review_text": "HOw do i play against someone i create a game and my friend cant find it",
            "review_score": "-1"
        }
    ]
}