{
    "app_id": 332580,
    "name": "Mimpi",
    "release_date": "2015-01-20",
    "developer": [
        "Dreadlocks Mobile",
        "Silicon Jelly"
    ],
    "publisher": [
        "Dreadlocks Mobile",
        "Silicon Jelly"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 174,
    "negative_ratings": 26,
    "price": 2.79,
    "description": "Explore strange new worlds and enjoy unique adventures in Mimpi! Mimpi is fantastic new adventure, puzzle, and platformer game.  The game is like a psychedelic illustration come alive.  Mimpi the dog is searching for his master in eight diverse worlds. The environment is seldom repetitive, the puzzles are always new.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/332580/header.jpg?t=1532037737",
    "minimum_requirements": "最低配置: 操作系统: Windows XP 处理器: 1 Ghz Single Core 内存: 512 MB RAM 图形: DX9 Compatible (Shader Model 2.0) DirectX 版本: 9.0 存储空间: 需要 512 MB 可用空间 声卡: Integrated audio interface 附注事项: Notice that the game does not run on most of the integrated video cards such as Intel GMA. It also requires at least 256 MB of video memory to run smoothly.",
    "recommended_requirements": "推荐配置: 操作系统: Windows 7 SP 1 处理器: 1 Ghz Dual Core 内存: 1024 MB RAM 图形: GeForce 8 series, ATI Radeon 9xxx DirectX 版本: 10 存储空间: 需要 512 MB 可用空间 声卡: Sound Blaster Compatible 附注事项: Notice that the game does not run on most of the integrated video cards such as Intel GMA. It also requires at least 256 MB of video memory to run smoothly.",
    "reviews": [
        {
            "review_text": "This game has good art, music, and an interesting concept, but is pure torture to play. The controls are unresponsive and imprecise. Mostly that doesn't matter. It does matter in the two underwater levels. Everybody hates underwater levels so let's make two. Some of the puzzles require perfectly timed precision jumps, these will take dozens of frustrating attempts to get through. The puzzles can best be described as everyone's least favorite puzzles from any puzzle game you have played. The hint system is sometimes useful and sometimes not. You have to play Tetris to get your hint. When I didn't want to play Tetris I'd watch walkthroughs. All the walkthroughs I could find were people playing the game for the first time. So, apparently, nobody plays this twice.",
            "review_score": "-1"
        },
        {
            "review_text": " An Abstract Adventure Platformer",
            "review_score": "1"
        },
        {
            "review_text": "This game is short, but it's very artistic and beautiful! It can be very hard and frustrating at times (which is good) and it's very easy to die. There's only two cutscenes (at the beginning and the end) but that doesn't change anything. It's a simple, yet fun game. I love it! :&gt;",
            "review_score": "1"
        },
        {
            "review_text": "idk why i have this game, it is trippy af like ur on some sick sheet of acid honestly... but somehow hella fun cause the puzzles are fuxking trippy.. not too expensive just check it out",
            "review_score": "1"
        }
    ]
}