{
    "app_id": 332800,
    "name": "Five Nights at Freddy's 2",
    "release_date": "2014-11-10",
    "developer": [
        "Scott Cawthon"
    ],
    "publisher": [
        "Scott Cawthon"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Horror",
        "Singleplayer",
        "Survival Horror"
    ],
    "achievements": 0,
    "positive_ratings": 8032,
    "negative_ratings": 851,
    "price": 5.79,
    "description": "Welcome back to the new and improved Freddy Fazbear's Pizza! As always, Fazbear Entertainment is not responsible for death or dismemberment.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/332800/header.jpg?t=1447364947",
    "minimum_requirements": "OS: XP,Vista,Windows 7, Windows 8 Processor: 2 GHz Intel Pentium 4 or AMD Athlon or equivalent Memory: 1 GB RAM Graphics: 1 GB Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "'Welcome to the Salty Spitoon, how tough are you?' 'How tough am I, I went to Freddys last night.' 'So?' 'Without any doors.' 'Right this way sir sorry to keep you waiting.'  (Post your version of this review in the comments below)",
            "review_score": "1"
        },
        {
            "review_text": "I have only played a very tiny portion of the game, but i can tell this'll be an awesome experience.  Things similar to original game: -Evil robots wanting to kill you -Ability to look at cameras  -Helplessness in a single office chair -Lights to help you see in the darkness  Things DIFFERENT to the original game -New robots, along with the old robots (Not sure how many exactly, heard anything from 8-11 of them) - No doors -Unable to run out of power (Flashlight is able to run out of power) -Flashlight to see in dark corners of rooms. -More rooms -New sounds -Added mechanics.  So far, i LOVE the game, and i can't wait to beat the first night. Ok, MAYBE i panicked, but don't judge meh :3",
            "review_score": "1"
        },
        {
            "review_text": "Bought the game, got no courage to play it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "*buys and installs game*  *plays game*  *Clown jumps me*  *quits and uninstalls game*  10/10 Great for those wanting to be Nocturnal.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely not the same feeling as jumping into your office chair for the first time, not knowing what is going on and then losing all power before 5am. Despite this it is still an excellent game. Scott made the right decision by altering gameplay and removing the doors; Five Nights at Freddy's began to see many uprising strategies to easily beat the game without much to worry about, but with 11 animatronics running around, attacking from 3 directions this time, strategies have become almost useless. Five Nights at Freddy's 2 began much differently than it's predecessor. I was there, with many others, the minute it was released on steam, but the first Five Nights at Freddy's only began to see popularity after youtube playthroughs such as Markiplier's. Although I cannot get past night 4, this is a great game, I have had a lot of fun in the short time I have played and I plan to have a lot more. I rate this game 20/20/20/20/20/20/20/20/20/20! But in all seriousness,   10/10!  ",
            "review_score": "1"
        },
        {
            "review_text": "The beloved prequel to FNAF, Five Nights at Freddy's 2 is MUCH harder than the first,  PROS - Good atmosphere - Intense gameplay - Keeps you coming for more - Story CONS - Winding the box on one of the cameras renders all of the other cameras useless, thus not making you able to search for animatronics. - When the old animatronics come in, you have very VERY little time to react. rating: ???/10",
            "review_score": "1"
        },
        {
            "review_text": "Now that i've had some time with this game i'm gonna write a review, if you live under a rock and don't know wat FNAF is i'll explain it. it's basiclly the horrer boom on the internet of the late 2014 period, it's a game where you take a night shift at a chuck E cheese like pizzeria. the animatronics though work at night and want nothing more than you in a robotic exoskelaton, so you know, gotta stay away from them hey, but how? Well the game used a unique system which required some stratigic skill and planning, you can't actully move and you don't have a weapon, instead you look at security cameras scattered throughout the facility. When an animatronic is outside your door you need to close it, but at the expense of your oh so precious power. This game is scary because of it's atmoshere and the inability to move or fight and because of the silence in the backround with weird noises playing with it. It's mysterious and strange story filled with mythos was also highly welcomed. This game made a massive boom of popularity across the internet [ specificcly youtube ] with let's plays and reaction videos everywhere.  about a season later in the year we're already back at freddy fazbears pizzeria, but are you getting a warm childrens tune or a fox [ or a puppet ] lunging at us instead? We have unlimited power in this sequel but I still say it's a harder game, how? Well first of all there are no doors, instead there are 2 vents next to you and a massive passage to a hallway in front of you. Also there are 6 new animatronics, 5 of which want you dead snd the other will make you vulnerble to the rest. So how do escape from their terrible grasp. You have a mask. This mask will fool most of them into thinking your one of them and will keep them at bay, but as I said there are other animatronics that you need to keep away [ conveniently the most dangerous ones ] and their own ways of being tricked seems like a hard chore. Sometimes you'll be caught in a situation where you'll never make it out alive.  This game is way harder than the original and will rquire more of your freddy fazbear skills. Overall though you should be more entertained by the mysterious story [ and substory ] and setting that ulimately fuels the game.  7.9 really good PROS:  - mysterious and cool story with a great horrer setting  - new gameplay mechanics are good....  CONS  - ....but some are a chore  - really, really hard",
            "review_score": "1"
        },
        {
            "review_text": "A very fun, family friendly game that is sure to bring your loving family even closer together! Both the cheap price of the game and next gen graphics leaves this game a must buy for all 1st world citizens! i rate this 8/8 and believe this game is especially good for those with heart conditions.  Thank you",
            "review_score": "1"
        },
        {
            "review_text": "Bought it, but have no courage to play.  10/10 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "Worst thing to happen in this game: Dying on night one because you didn't listen to the phone guy and you learned the hard way to keep the music box winded.",
            "review_score": "1"
        },
        {
            "review_text": "Step 1: Get game.   Step 2: Beat Night 1 on first try.   Step 3: Die from foxy 300 times on night 2 and never play again.  Step 4: The end.   Step 5: Like this review.",
            "review_score": "1"
        },
        {
            "review_text": "Bonnie is blue Chica is yellow  Freddy pops out 'Won't you be my fellow :D'  10/10",
            "review_score": "1"
        },
        {
            "review_text": "-Beat 20/20/20/20 in FNaF 1 -Stuck in night 5 in FNaF 2 -Not ready for Freddy -I hate this game...  11/10 I can't sleep anymore",
            "review_score": "1"
        },
        {
            "review_text": "Chica looks like a stripper now. 11/10 would get stuffed in a fazbear costume again.",
            "review_score": "1"
        },
        {
            "review_text": "Clear hall way-Weee woooo weeee woooo  Sees old foxy and new foxy in hall way-WEEEEEEEEEEEE WOOOOOOOOO WEEEEEEEEEEE WOOOOOOOOO!!!!!!!!!!!!!!!!!  11/10 would fap to toy chica again :3",
            "review_score": "1"
        },
        {
            "review_text": "Flashlight Simulator 2014",
            "review_score": "1"
        },
        {
            "review_text": "Fast ESC press simulator 2014  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Bought 10 full pack of underwear and put them all on Had 3 layers left after playing the game 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Definitely reccomend this game to both fans of the first game and also players looking for a very excellent horror experience. This game will make you multitask to the point where you will be freaked out every time your view is taken away from the hallway in front of you. I enjoyed all of the nights of this game and I know anyone who reads this review will too",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it. If you loved getting stuff violently into a suit, you will love it again.",
            "review_score": "1"
        },
        {
            "review_text": "Esc key simulator is right.. 10/10 is right",
            "review_score": "1"
        },
        {
            "review_text": "Tighten your sphincters'. It's gonna be a ♥♥♥♥♥♥ ride!!!",
            "review_score": "1"
        },
        {
            "review_text": "The first game made me jump after a few nights. This one made me screech during the first night.",
            "review_score": "1"
        },
        {
            "review_text": "The first game started out scary and ended up more than a little frustrating, but I recommended it because it was a unique experience that I was glad to have had. Unfortunately for me, Five Nights at Freddy's 2, feels like the exact same game with only minor differences that do little to change the experience. The jump scares seemed more predictable, and thus were not remotely scary, and the mechanics came down to once again pressing buttons and clicking the mouse in the right places as fast as possible without making a mistake.   If you loved Five Nights at Freddy's, you will probably love this game as it really is more of the same. But for me, it is one to miss.",
            "review_score": "-1"
        },
        {
            "review_text": "██╗████████╗███████╗ ███╗ ███╗ ███████╗  ██║╚══██╔══╝██╔════╝ ████╗ ████ ██╔════╝  ██║ ██║ ███████╗ ██╔████╔██ █████╗   ██║ ██║ ╚════██║ ██║╚██╔╝██║██╔══╝   ██║ ██║ ███████║ ██║ ╚═╝ ██║███████╗  ╚═╝ ╚═╝ ╚══════╝ ╚═╝ ╚═╝ ╚ ﻿   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Watch out, it's an actual review instead of yet another joke review for this game!  The first Five Nights at Freddy's, while overhyped, is still a pretty solid game. Barely over two months later, this sequel was released. That right there should ring some alarm bells. It certainly is rushed and shows some signs of the creator jumping on to the hype train while the series is still popular, rather than taking his time with a worthy sequel.  Two of the strongest aspects of the original game's horror were how good the atmosphere was and the spooky sound design. The latter is mostly gone in the sequel, with the former pretty much missing. The first game did a good job of making the pizzeria look frightening, while still matching with the description of a place that is joyous in the day. It doesn't seem like a whole lot of time was put into recreating that feel for the sequel, as the pizzeria is simply bright and colourful this time around, with no spookiness to the appearance of the diner. The only exception is the parts and services room, but of course kids aren't supposed to be there, so no attempt to blur the line of friendly and frightening was needed.  The sound design isn't even close to matching the quality of the first game's, however some of it shows promise. With some more time testing what does and doesn't work (read: not rushing the game out in barely over two months) the sound design could have been absolutely fantastic. For example, the animatronics Balloon Boy and Mangle have their own unique sounds, which excellently use common horror techniques. Balloon Boy has creepy childish sounds and Mangle pretty much is a ghost box, constant white noise and distorted voices, showing the fear behind chaos. Unfortunately there isn't really a whole lot more special going on in the sound department. The atmospheric sounds are sadly far inferior. They do their job of indicating something dangerous is nearby and that's it. Especially lazy is the sound indicating an animatronic passing through the main hall. It took me a while to realise the sound was indicating an animatronic was so close, since, well... I'm having a hard time figuring out how 'extremely repetitive alarm-type noise' ties into someone being in front of you? Somehow the loud footsteps from the first game conveyed that expression better. Additionally, you may know an animatronic is close to you by the sounds of someone moving through the vents. Even this isn't without its flaws however, as the sound has to keep looping if multiple animatronics are active at once, and thus the sound very noticably gets cut off and resets commonly on future nights.  Oh yes, the vents... there are many more animatronics in this game than the previous one and most of them travel through the vents. This means there can be more than one in the exact same spot at one time and the only way to really be aware of this oftentimes is to simply guess. Fake difficulty, which doesn't make a whole lot of sense. This was present to a small extent in the first game, although it made more sense as those areas weren't cramped vents.  The gameplay is much less satisfying than the first game's. This installment requires manic activity from the player. While later nights in the first game certainly required the player to be on their toes, there were still brief pauses while the player had to conserve power, and observation of multiple cameras was necessary to keep an eye on the more active Freddy.  This game seems to be confused in what it's trying to do, in its attempts to be different, it actually amplifies what it may have been trying to fix. There is no longer a limit to the building's power usage, so cameras can be viewed freely. At first I assumed this meant the player could spend more time checking all the cameras instead of constantly switching back to the office to conserve power, which is a neat idea. However, it's necessary for there to be a vital reason to view the cameras. But oh dear, is that vital reason a drag in this game. There's a music box in the prize corner video feed that needs to be wound up remotely, which for some reason is only possible while looking at that camera. This means the only camera that actually ever needs to be looked at is the prize corner. This becomes MORE repetitive than looking at the office. A mechanic where at least one animatronic needs to be followed camera-to-camera would not only fill the criteria of making camera viewing a necessity, but add some variety. This was achieved with Freddy in the first game, unfortunately not the case in the sequel.  Speaking of the nonsensical remote music box winding that somehow requires looking at a video feed, there is also a flashlight in this game. You're not just restricted to using it in the office, however. The flashlight can also be used in other rooms to light up dark corners. However, you're still only viewing these rooms on a camera. How can a flashlight light up something you're only viewing on a video feed? Huh? What?  As for difficulty, this game is even harder than the first, which was not a step in the right direction. The horror also fades much more quickly this time around due to having to go through the same things over and over. There isn't a whole lot of horror in the sequel, so cue falling back on jumpscares harder than ever. Some of the jumpscares are actually pretty good, aside from being overused but then there's laughable ones like Toy Freddy and Toy Bonnie just kinda jumping around being colourful, which is supposed to be scary because a loud noise is playing at the same time.  One thing I was really looking forward to, even as my opinion on this game got more negative, was unlocking the 'custom night.' With even more animatronics to choose from than last time, I thought that'd mean even more customisation. Nope. Foxy is locked to being active even on 0. The music box winds down extremely quickly, maybe even faster than it did on night 5, and there's no setting to change this. It might seem silly bringing up an unlockable mode in a serious review but the fact is that the mode got ♥♥♥♥ed up so badly that I feel it deserves a mention. There is the nice addition of presets in the custom mode to try, which reward the player with some cute bonuses, but I'd rather have a custom night that actually feels fully customisable.  I still sort of enjoy the game, to an extent, maybe as a guilty pleasure. It's however very disappointing, and I can't say I got much substantial enjoyment out of it. The next installment in the series is apparently very close to release, so that one's getting rushed out too. I'm kind of wary about buying it. Should that one be a rushed jumpscare fest as well, it may be safe to say that Five Nights at Freddy's was a pretty good horror game that got way out of hand and spawned nothing but bad sequels that don't use any scare tactic other than jumpscares.",
            "review_score": "-1"
        },
        {
            "review_text": "Five Nights at Freddy's 2 and 1 were possibly the most well known and most trending games of 2014.  Recommended for playing during down time  Recommended for gamers who play short games  Recommended for gamers who look for secrets and lore  Recommended for youtubers who want a fanbase  Recommended if you want to be cool in school",
            "review_score": "1"
        },
        {
            "review_text": "Opens up laptop Opens up Steam Searches 'Five Nights at Freddy's 2' Buys Five Nights at Freddy's 2 Starts up Five Nights at Freddy's 2 Gets the super rare Dark Freddy screen Clicks 'New Game' on the title screen Gets the super rare Dark Foxy screen Finally starts Night 1 Gets jumpscared by Toy Bonnie Gets the super rare Dark Bonnie screen Throws laptop in furnace  10/10 I burned down my house",
            "review_score": "1"
        },
        {
            "review_text": "This is so much scarier then the first game, i love the fact that instead of hidding behind the doors, you are face to face with your impending death with them waiting in the vents and doorway. The first game didnt even make me flinch, it was too easy and not scary because like my prevous point, you were hiding behind a door nothing could hurt you, but in this game even when there is a enemy infront of you, the game forces you to take your eyes off them to do other things. it really does work on your heart strings. the only thing i have a problem with is how does this follow the lore, it may be fully explained later in the game, but for now i cant understand, if the old animatorics are haunted by the spirts of the dead cbildren, why do the new ones move ?. if the body of the children are in the suits why cant you see anything the old bonnie smashed head. and the most important thing WHY IS THE PHONE GUY STILL IN USE HE DIED IN THE ORIGINAL?. Disprite these unawnsered questions this game seems promising.",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 2 is an Indie Point and Click horror survival game that does what it says very well. It has a much steeper learning curb than the previous game, making it look like college compared to preschool. It also has better jumpscares! This game has gotten me more than any other with annoying jumpscares that you expect to some that scare the living daylights out of you. This game, although not seeming like it, has a geat story about vengeance and hatred. Sure the story ingame is vague, but the theories are OVERWHELMING! Sadly I have no face, but that's fine, since you have a Freddy Fazbear Head to defend yourself without doors! Here's my opniion of the nights Night 1! Allright, let's go! AH GOD, BONNIE! PUT ON THAT MASK! AH, FREDDY'S IN MY OFFICE! PUT IT ON! Night 2! More Prepared... Flashlight isn't that useful, since I can just pu--- Wait Foxy isnt fooled by the mask! FLASH FLASH FLASH! Night 3! Okay so the old ones move..... OH GOD BONNIE IS TERRIFYING, but I still like her. (I'm so lovable! :3) In the vents huh? What about the blindspo- NOPE! PUT ON THAT MASK! Night 4! OH GOD THEY'RE SO ACTIVE! MASK ALL NIGHT! MUSIC BOX ALL DAY! Night 5! This is Hell's dimension. They're everywhere and there's nexy to nothing you can do. Dammit. Night 6! WAIT A YELLOW SUIT!? AH GOLDEN FREDDY! WOOOOP NO NO NO NO SO HARD! Night 6 is hell. Legit hell. Night 7! Ooh pretty dolls! 10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite FNAF games, probably my favorite. FNAF 2 brings back old days, its like Stressed Out says 'Ever remember that 1 smell that brings ya back?' or something like that. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Alright first of all from what I played thus far, it is the most terrifying game I've ever played in my life. This WON'T LET YOU BE CALM OR COLLECTED. It is difficult that's for sure, and this game constantly gets you stressed, worried, and always fumbling about the cameras, flashlight, and music box, so many times I literally minimize the game by accident sometimes when an animatronic is at my office, like Old Bonnie and made me flip out so much. That's what clinches this game over the first, in the first, after awhile you'll get a strategy down and after awhile you'll find it less scary. In my opinion, this game doesn't have that luxury. Due to all the animatronics after you, there are so many things on your mind you'll never be calm and be constantly worried by the presence of the animatronics.   The gameplay of this game is very similar to the first, so of course it's easy for old players to jump back into, but of course the most obvious changes come that there are at least 10 animatronics after you by the end, which includes: -The New Animatronics  -The Old Animatronics -Balloon Boy -The Puppet (or Marionette) That enough is already a handful to deal with, but also you're responsible for rewinding the music box, in which everytime I do so I literally flippin out since I know someone's in the hallway or something's in the vent, and it's stressful as crap since you'll have to do it fast (but it's so god dang slow). And also, no doors. Yep, that enough got me terrified. I find myself most of the time wondering when to put it on whenever I saw something in the hallway as I worry when they'll get into the office. All of this alone, to add with the same mechanics as the first, feels like a different game, although it shouldn't. You're just too worried about everything after you, that you just think of it as a new experience.   I really only have one minor complaint, and that is with a no 'Options' tab, mainly to level audio or to maybe configure a different key for the flashlight. I found 'Control' as the flashlight button a bit annoying only because for some keyboards using Windows computers, it is right next to the Windows Start Menu button, so you may accidentally exit the game, or if you are recording this like I am, it'll end the video. It's a minor annoyance, but the game has me regretting me ever playing because it's so scary.   Now I won't say that everyone will find it as scary as me, but I think most will agree it has the horror right on. I do highly recommend it for any fan of the original, newcomers, or really just the general horror fan. Just be warned of heart attacks while playing, Fazbear Enterainment is not responsible for death or dismemberment.",
            "review_score": "1"
        },
        {
            "review_text": "For all those people saying 'OMG IT2 SU NUT SKURRRY' playing the game and watching it on youtube is two very differnet things, i have literally choked on a burrito and had a nightmare because of this game. I have not played much to be honest but i know alot of it and it has a incredbile story and it tricks you into believing one thing in the story while you're wrong. Overall its a dang good game and i highly recommend this game for a scare and some thinking, I hope you buy this game, as the creator, Scott Cawthon derserves awards for this game of how good it is, and i'm 94% sure that you'll love this game.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ my pants in the first 5 minutes    10/10 - IGN",
            "review_score": "1"
        },
        {
            "review_text": "there is now 10 animatroonics to quickscope as opposed to 4 9.8 ign review fazeclan approved",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 2 is a great game, and I really like how it jump scares you. (I'm all about them Horror Games!) FNAF2 is very different from the first game, and I highly recommened it.",
            "review_score": "1"
        },
        {
            "review_text": "Well...well..it has come and was it dissapointing?   NO!  UPDATED REVIEW ------------------------------------------   They are back once again...but with a brand new set of animantronics. These new animantronics are called, Toy Chica, Toy Bonnie, Toy Freddy, Balloon Boy, Mangle and finally the puppet! 'I never really liked the puppet...it's always....thinking....' - Phone Guy.     Is the game better/worse?    If you want more of have a challenge from FNAF 1 then you should really try this. You need to focus on more things such as the music box that you need to wind every so often to keep the Marionette/The Puppet Master away. In FNAF 1 all you really need to focus on was the doors, pirate cove and the blindspots. On the other hand in FNAF 2, you need to focus on the music box, vents, corridors, making sure you put on the mask quick enough. Sounds easy? It's not.       Do you like/hate the game?    FNAF 2 has improved in some areas. The only thing is Scott has slighty rushed this game due to the lots of people begging Scott for it to come out. The game does it justice but not that well as in FNAF 1. I would not say I hate it or I even love it. FNAF 1 has a more creepier feel. The ambience is more creepier then FNAF 2. But if Scott didn't rush FNAF 2 all the negatives would be postive. So I don't hate or love this game, guess you could say I am in the middle. (like)     What do you think of the new Animantronics/Do you think it is a Prequel or a Sequel?    The new animatronics do look nice, very kid and adult friendly. Only if they were like that in the actual game. Toy Chica's dead black eyes will always give someone the nightmares. Toy Freddy is not even that scary. Balloon Boy is just a HUGE PAIN. Mangle is spiderman but instead spiderfox. That basically sums up the new animantronics...Oh did I forget someone....the Marionette? I never talk about him...his always listening...always watching. I personally think FNAF 2 is a prequel since the Phone guy never mentions the Bite of 87. The animantronics are allowed to move around in the day but in FNAF 1 the phone guy said they aren't allowed to move around in the day. I think FNAF 2 is set before FNAF 1 and before the bite of 87.    Overall?    Overall, the game is great fun to play. The first time playing is always the most scariest since you don't know what is going to happen. It's the unknown that scares you. FNAF 2 as I said, could be improved but hey.....Scott is only working all by himself, it's amazing how he can create a game like FNAF 2 in 2-3 months.   I hope FNAF 3 will improve from FNAF 2 and is not rushed. Looking forward to FNAF 3!  Thanks for reading my review!",
            "review_score": "1"
        },
        {
            "review_text": "This one is way better than the first, more jumpscares, the game is harder and overall its fun.  On The First Night I listened to the phone guy, and he said 'Keep the music box on!' and i was like 'what will that do?' so I didnt and the pupet jumped at me, At first i was like 'WHAT THE HECK WAS THAT!' Then I replayed and got to 6 Am  The Second night however was diffrent.  Phone guy said 'I Never Trusted that pupet' Which i assumed ment the crazy pupet thing. And then i was like 'AH THE MUSIC BOXXXXX' I got that quick. But i remembered that baloon guy. and he was right there and all i could hear was Chica 2.0 as i would call her laughing and saying 'Hi'. I thought I could Hide from it in freddys mask, but I forgot that the mask Atracks Foxy, And Foxy 2.0 so they got me.  Theres a lot of 'Diffrent' and cool things about the game. Such as this 8bit Easter Egg i was told about or when I got the game and played it and I was Fredy Fazbear At the Old Freddy Fazbears Pizerria.  Anyways. I still have a lot to find out about the game but, honastly a great game and in my opinion btter than the first. Thumbs Up!",
            "review_score": "1"
        },
        {
            "review_text": "GUY OMG, I FOUND A CHEAT SO U PUT UR CURSER ON FREDDYS NOSE (on Poster) AND TYPE IN cd+ AND U WILL SEE WHAT HAPPENS ",
            "review_score": "1"
        },
        {
            "review_text": "11 animatronics : -Old Freddy -Old Bonnie -Old Chica -Foxy -Golden Freddy -Toy Freddy -Toy Bonnie -Toy Chica -Mangle -Puppet And Ballon Babe Good Luck ! ^^",
            "review_score": "1"
        },
        {
            "review_text": "I love It I totaly Recomend it to people that like horror games I finally made it to custom night SO HARD",
            "review_score": "1"
        },
        {
            "review_text": "Furry dressup simulator 20/14 happy new year. (sorry freddy told me to do dis he needs dem friends ya know)        Anyway this game made me lose my last bit of sanity and i thank the game for it.. praise our lords and saviours jukebox and flashlight",
            "review_score": "1"
        },
        {
            "review_text": "This game just might be the hardest FNaF game in the series by far.If you could please buy this game. If you don't like this game, that's fine i respect your opinion. But this game isn't for the weak hearted, nor is it for Casual Players. So i recommend this game for Intense Players. this game is a 9/10 for me. Update: I was wrong. Compare to FNaF 4, this is a cakewalk.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 I absolutley LOVE this game! The characters,the easter eggs,and even Balloon Boy! My personal favorite in the FNaF series!",
            "review_score": "1"
        },
        {
            "review_text": "2xTheFreddy 2xTheReady",
            "review_score": "1"
        },
        {
            "review_text": "Billy Balloon is a ♥♥♥♥♥.   10/10 Hypertension and anxiety is kicking in.",
            "review_score": "1"
        },
        {
            "review_text": "Got my Anal virginity taken by foxy and balloon boy Loomynarty/10 need more doritos and dew",
            "review_score": "1"
        },
        {
            "review_text": "Definitely the hardest FNaF game, many animatronics, lots of stress, but not the scariest, FNaF 4 is that by a landslide. Good if you like a challenge and getting jumped a bit, but if you want a true fright, I suggest the fourth game. But this is one of your best games, Scott.",
            "review_score": "1"
        },
        {
            "review_text": "i fear chuck E cheese. not ready for freddy",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS THE BEST GAME IN THE SERIES, and that says a lot. It has a lot more content than FNAF 3, expands FNAF 1 in a good way, and to be honest, FNAF 4 is terrible",
            "review_score": "1"
        },
        {
            "review_text": "The other decent one.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME I SWEAR HAS GIVING ME 50 HEART ATTACKS AND JUST ABOUT 100 NIGHTMARES... THIS GAME IS JUST TOO HEART ATTACK 500000000000/10",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and scary",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. really addictive and scary! The game is very challenging but its not too hard. Would definetely reccomend this game because it is one of my favourites!",
            "review_score": "1"
        },
        {
            "review_text": "When this game came out, the hipe was immense. And it lead up to it! Fantastic game!",
            "review_score": "1"
        },
        {
            "review_text": "*Opens game*  -play til night 3 -See shadow freddy -Scream  Now remove shitbricks from pants",
            "review_score": "1"
        },
        {
            "review_text": "The fox is back and this time...He'll do anything for the car fax! 10/10 great game :D",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful. Just wonderful. The lights are better since they turn off by themselves. When there are animatronics at your door, and you need to turn that music box. The adrenaline rush is REAL. That weird marionette thing and that freaky little balloon kid, really freak me out. Big dissapointment that foxy doesn't run down the hall anymore though. Only real gameplay problem I have found, is that when using the flashlight to look down the hall, it doesn't always work. That's the ONLY real problem though. 10/10 for me.",
            "review_score": "1"
        },
        {
            "review_text": "This one is my favorite xD Must be played, pretty scary!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Love the story line! Great work Scott!",
            "review_score": "1"
        },
        {
            "review_text": "Best way to test the refund system!  10/10! Great work Scott!",
            "review_score": "1"
        },
        {
            "review_text": "You can't not get this game.",
            "review_score": "1"
        },
        {
            "review_text": "oh,,,my,,,,god THIS IS THE BEST GAME TRAILER.  THOERY (if the chracters in the Parts and Service room cause of tthere design then how did it happen FUZIONZGAMER PLZ SOLVE THIS!!!!)",
            "review_score": "1"
        },
        {
            "review_text": "Nightmare Bonnie: 'FREDDY! My f*cking chest is gone!'  fnaf 1 Bonnie: 'FREDDY! My f*cking eyes are gone!'  old Bonnie: 'FREDDY! My f*cking head is gone!'  toy bonnie: 'FREDDY! My f*cking head is back, but I'm a chick!'  Springtrap: 'FREDBEAR! There's a Fu- *Looks at empty freddy suit* 'Oh... right.'",
            "review_score": "1"
        },
        {
            "review_text": "Haven't played much yet, the reason? Well it's ♥♥♥♥ing scary and stressful game :D In my longest playthrough which was about 15 minutes I managed to evade the blue rabbit and survive until I took the mask of and this ♥♥♥♥ing clown just jumps out of ♥♥♥♥ing nowhere. I didn't even get which of the animatronics it was...  Anyhow I really like this game so far and plan to play it much more when I get my self together and prepare...",
            "review_score": "1"
        },
        {
            "review_text": "Stressful as ♥♥♥♥! This ♥♥♥♥♥ amazing good thing I bought it. xD ",
            "review_score": "1"
        },
        {
            "review_text": "The most compelling and satisfying game I have played since Antichamber",
            "review_score": "1"
        },
        {
            "review_text": "This game is like the last five nights at freddy's yet WITH EVEN MORE ROBOTS TO LOOK OUT FOR! Awesome!",
            "review_score": "1"
        },
        {
            "review_text": "I did not know that animatronics had facial recognition software in 1987",
            "review_score": "1"
        },
        {
            "review_text": "This Game Made Me The Bestest Guy Around Stuck On Night 6 /)-.-) to Be A MLG Scrubtastic Lord Like Me I'd Reccomend This Game Since It's Sick AF I've Dont My Work Here. GOOD DAY!",
            "review_score": "1"
        },
        {
            "review_text": "Although the second game of the Five Nights at Freddy's franchise, FNaF 2 is hard, and requires you to know how things work,. All in all, it's a very good game, good work Scott.",
            "review_score": "1"
        },
        {
            "review_text": "Double the freddy, Still not ready",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥ing ♥♥♥♥ i cant believe this is out. Its very scary but i think the 1st one was a bit better but scott did put alot of improvment into this!",
            "review_score": "1"
        },
        {
            "review_text": "Better than the first game...",
            "review_score": "1"
        },
        {
            "review_text": "Don't get me wrong this game is amazing. It is probably one of the scariest things I have ever seen. Playing it was a nightmare. The jumpscares, the sounds, and the amount of ♥♥♥♥ that can attack you! HOLY ♥♥♥♥ DUDE THERE IS LIKE 10 THINGS THAT CAN ATTACK YOU. Overall this game is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "I actually did review FNAF 3 before this even though I got the 3rd game far after the second. Long story short, this review is far overdue, but now it's finally here because it's summer and I'm bored.  Anyways, I like how there's the most animatronics out of any game in the series, including FNAF 3 (I do not include 4 because this review was written before the fourth game came out). It's really good since you have to have variety in dating sims such as these. In this game, you have the choice of Freddy, Bonnie, Chica, Foxy, Golden Freddy, Puppet, BB, Toy Freddy, Toy Bonnie, Toy Chica, or Mangle. The only negative thing I have to say about this dating sim is that it's challenging when you want certain animatronics to give you some lovin. For example, on Night 6, I tried to hit on Golden Freddy (sorry sonic99rae), but Foxy came for my booty instead. Although it can be a negative experience not getting the animatronic you want, at least somebody in the game loves you and wants to get real dirty with you. That is the charming thing about Five Nights at Freddy's 2.  Overall, I give this game 7.8/10 because there's no Springtrap in this game (as everyone should know from my FNAF 3 review, Springtrap is my Senpai) and sometimes you just cant get that animatronic that has a crush on you off your back. Otherwise, this a good dating sim, and I'd recommend it to those who aren't picky about their animatronic boyfriend (or girlfriend).",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the more scarier games, but the thing is that after hours of the same old jumpscares, it starts to get boring ,and it turns from a heart racing game, to a game that you just play through. When I played the first game for the first time, I could only stand playing 1 night at a time, then I finished that game. But when 2 came out I just had to buy it. I played it and I still could barely play it. When I got to night four, I failed ALOT. After Playing night 4 for about 40 minutes, it didn't really seem scary anymore. Foxy was always in your hallway, toy bonnie was always in your vent. Mangle was always near you, and cheeca showed up a lot too. Even though you can get used to this game's scariness, I still play it because of how deep the story goes. Even though I'm sure there are millions of theories, I dont really believe them. The reason for theat is that Scott Cawthon left sooooo many questions un-answered, so many easter eggs, it kept people playing. And that is why I loooove this game so much because of all of the secrets within. I definitly recomend playing either the first or second game. They both have so many un-answered questions, keeping the minds of people thinking.",
            "review_score": "1"
        },
        {
            "review_text": "hi scott i love your work its scary and fun also i cant beat night 6 can you tell me how ps keep up the good work on the sister location bye",
            "review_score": "1"
        },
        {
            "review_text": "This FNAF 2 Game is AMAZING. BUT SO HARD!!!",
            "review_score": "1"
        },
        {
            "review_text": "OMG THANK U SCOTT!",
            "review_score": "1"
        },
        {
            "review_text": "now is the sequeal better than the 1st one.......nah it couldn't possibly be better *music box runs out and puppet attacks* AAAAAAHHH GOOOD LORD IN A HAY STACK.........*sigh* anyways......5N@F'S 2 is by far an amazing sequeal its got alot of jumpscares alot of danger more cameras more music more terror and of course more Fan......the game has made me scream or jump even more than the 1st one (not that the 1st one is bad) and its actually got me thinking if number 3 will be after both of these games, nevertheless 5N@F'S 2 is a great Prequal sequal and worth the money. 8/10 would still come back to enjoy (to be shaking on the spot) playing this good game",
            "review_score": "1"
        },
        {
            "review_text": "Five nights at Freddy's, an amazing franchise simply made, but holds so many stories hidden within, it's truly a good work of a story, I may not own the original or the 3rd or 4th game, but I find sources to try to solve the story as well. It's jump scares gets old though, I get tired of it really.   SPOILER ALERT, DO NOT CONTINUE READING IF YOU DO NOT WANT SPOILERS     If you are reading this Scott, I do have a puzzling question that may sound insane to many and embarrassing if I've been thinking too deep about it and I'm really not wanting to ask anyone else but you, I've recently taken a look at the picture of the 'Bad Ending' in the 3rd game, and I looked at the fifth head (the one at the back) and it reminded me of something I saw somewhere in one of these 4 games, and I suddenly remembered it from the first game, you know the flashing animatronic that plays the music when your power goes out? It resembled it so much! I always thought it was Freddy though...so here's my question...am I correct to say that the animatronic flashing is not Freddy?...I mean...many say that the fifth head is golden Freddy and just leaves it as that, but I see a big similarity between the first game's flashing head and this glowing head which if my theory is correct, it is impossible for it to be Golden Freddy...Or is it just Freddy in the first game as it wasn't drawn properly...?",
            "review_score": "1"
        },
        {
            "review_text": "YOU WILL GET SPASTIC!",
            "review_score": "1"
        },
        {
            "review_text": "One day freddy walked up and said, hi jeff. I said thats not my name and then he said, aghhhhh!!!",
            "review_score": "1"
        },
        {
            "review_text": "And so, an old and wrinkly Mark Griffin laid in his death bed. BulletBall had actually become an olympic sport and he managed to get a lot of money from it. Life was slowly draining from his body, but he was calm, because his dream had come true. With his last breath he said...                 'Mah point'",
            "review_score": "-1"
        },
        {
            "review_text": "It's a gaem.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the better of the two honestly. Much more different dynamics and constantly having to watch either the halls or vents.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. It's got all you want in a horror game and more!",
            "review_score": "1"
        },
        {
            "review_text": "Buys the game cause hot girl recommends it. Opens it up starts seeing the freddy mask on quits instantly. opens again and walks 10 foot away from screen and standing there for like 10 mins after getting closer starting the game hearing phone guy and after he stopped talking im like Welp the game has just begun :) esc and quit forever 10/10 you spooked me 4 life scott",
            "review_score": "1"
        },
        {
            "review_text": "ok this game should be in the top ten scary games because i did die alot but worth it at the end of the night 7 you get the toys on your desk... my best toy is golden freddy.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutly love this game, it makes me get scared everytime I play it, it's much scarier and much better then the last game, Now that we have to look out for 10 animatronics, its makes the game much more thrilling. 10/10 would play again and again and again",
            "review_score": "1"
        },
        {
            "review_text": "Right off the bat this game comes after you with all new game mechanics. There are no doors now ( instead of two entrances there are three) and have been replaced by a freddy suit. However some animatronics will ignore this suit and you will have to use other means to distract and survive them. On top of those two changes a music 'Jack in the box' type of thing has been added in. This needs to be checked every so often.   I would not recommend this game to a newcomer, I would however buy the first game and if you like it try this one.  Thank you scott for keeping the 'squeeing' nose on the Freddy poster! :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! Yeah, it can get boring after a while but it's still really fun! It has that feeling when at first it's scary, but then it turns into a game you want to beat! Overall, it's a great game and I definitely!",
            "review_score": "1"
        },
        {
            "review_text": "Did not think it was humanly possible to ♥♥♥♥ my pants that fast while playing a game -Tom  You thought four animatronics hunting you down was bad? Honey, just wait till you get your hands on this game. It makes the first game look like a relaxing stroll through a park. Run by animatronics.  -Sab",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "this game proved to be 2spooky4me",
            "review_score": "1"
        },
        {
            "review_text": "I Love The 2nd Game Alot More Than The First One! No Doors = Awesomeness!",
            "review_score": "1"
        },
        {
            "review_text": "This game is FUN for people who like a good scare and like a good chalenge. This game has a VERY interesting background with interesting details that you have to pay attention to when you play. The mini clips have interesting background too if you can understand what characters are which. Have fun playing .WARNING THIS GAME IS FULL OF JUMPSCARES AND FLASHING LIGHTS HAVE FUN PEOPLE!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game to anyone who likes psychological horror genre games. Five stars!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would ♥♥♥♥ myself to again.",
            "review_score": "1"
        },
        {
            "review_text": "i just think that fnaf2 and fnaf1 is just completly amazing scott from making kids games to making a huge game that is now a huge hit so well done scott well done ",
            "review_score": "1"
        },
        {
            "review_text": "You need a job. You need it fast. After studying medicine for 7 years.... YOU GET A JOB AS A NIGHT GUARD AT A RINKY DINK PIZZERIA, WITH ROBOTS TRYING TO KILL YOU! :D  10/10 would ignore medical skills again",
            "review_score": "1"
        },
        {
            "review_text": "FNAF 2 is a little overwelming at first, but after a while, its very fun and actually takes skill/luck.  Pros:  - Lots of new animitronics (although you may not like that) - New features like the music box, vents, flashlight, mask, and more (although you may not like that) - Faster paced (although you may not like that) - Looks nicer and more cleaned up that FNAF 1 - Extra modes and things  Cons:  - A lot of animitronics to deal with (although you may enjoy that) - Lots of extra features (although you may enjoy that) - Fasterpaced (although you may enjoy that) - There's no real reason to look at any cameras except to re-wind the music box so its just in the way pretty much   Overall: 8/10  Although it may seem boring/ unuaslly for a FNAF game, it gets a little more challenging in the extra modes and night 5",
            "review_score": "1"
        },
        {
            "review_text": "it keepz crashin on windoze 10",
            "review_score": "1"
        },
        {
            "review_text": "Ok so I never really got past night 1 without my cousin playing it, but here is what went down 12:00 AM 1st Night *phone guy talking his ♥♥♥♥* Me: I'm freaking out..... *phone guy's conversation ends* Me: OH ♥♥♥♥! TOY BAHNNIE IN PARTY ROOM 4!!! Me: oh I gotta wind the box *toy bonnie about to enter right vent* OH ♥♥♥♥! *toy bonnie in vents* Me: Oh ♥♥♥♥, he's in the vents and the box is halfway! And then I exited it. 10/10 second scariest of the series (noise makes ANYTHING scary) If I had the courage I would play again. This game is ment to scare you. This series is ment to scare you. This world is ment yo scare you.",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 2 is a bit scarier and harder than the first in my opinion because for this one you have to worry about 11 creatures in the night coming to shove you into a suit instead of 4! Plus you have no doors, ouch. If you want creepy, horror, mystery, and stress, I would play this game. I do recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "For those people who say that this game isn't scary: Step 1: Force them to sit down at a computer Step 2: give them headphones Step 3: turn the volume up Step 4: turn the lights off They will probably come out of the game, having dies at lease 100 times by Foxy and the Marionette. ENJOY!",
            "review_score": "1"
        },
        {
            "review_text": "Way more scarier and tense than the last one.",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 2 is a huge upgrade from the first one. Updated Graphics and intense gameplay. Playing the game can just stress you out because of no doors and the only defense you have is a freddy head. Now there is eight animatronics after you in this game trying to kill you at all costs. Also keeping track of a music box which you have to wond up all the time giving you the intesity and stress of it all into one pile. All in all, a great sequel to a great game.",
            "review_score": "1"
        },
        {
            "review_text": "never felt my heart pound like that ",
            "review_score": "1"
        },
        {
            "review_text": "To be honest this is hardy than the last but i'm up to night 6 also if you like horror or a challenge you should get this also i play it without the volume it it's hard but other than that it was great but the bad bit is i should play a bit less beacuse it look over my like and i'm loving ;) thanks scott for one of the best games ever!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome JumpScary Game The Graphics Not that Bad And The Charecter so sexy And The Game so scary so Much",
            "review_score": "1"
        },
        {
            "review_text": "I Love The 2nd Game Alot More Than The First One! No Doors = Awesomeness!",
            "review_score": "1"
        },
        {
            "review_text": "Like the first game except there's more robots to deal with, more lore added to the story, much faster than the first game, no doors cause of new hiding freddy mask, there's a music box you have to wind up or else you die in the game from the marionette, jumpscares, and trial and error. Lots and lots of trial and error.",
            "review_score": "1"
        },
        {
            "review_text": "Good scary game. makes my hands quite cold. The jumpscares are PHENOMINAL. Me and my sis got scared the crap out of. I recomend playing it.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game full of jumpscares this is Better than the first FNAF but with more animatronics and more Objectives. Its still a cool game :D",
            "review_score": "1"
        },
        {
            "review_text": "Fuc me, this is fuced up! I almost $hit myself when playing night 3! Soooo... basically... AMAZING!!!  Steps To Success: 1. Buy Game  2. Play Game  3. $hit on Self  4. Repeat  (Sorry about spelling and gramar... cencores)   This has been a timey wimey review!",
            "review_score": "1"
        },
        {
            "review_text": "This is FNAF 1 more action, Michael Bay version. The original was more tense. this one is more stressing.  Buy it if you're ready for to get teamed up against far too many Animatronics than there needs to be.   Still great game though.",
            "review_score": "1"
        },
        {
            "review_text": "Cant cant past night 4... Im thinking of quiting.",
            "review_score": "1"
        },
        {
            "review_text": "This game is scary as hell and twice as much fun. I'd buy this game even at 20 dollars let alone 8.",
            "review_score": "1"
        },
        {
            "review_text": "I have two thing to say, 1.Screw Ballon Boy 2. This game is really fun",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, everything about this game is so much better than the original one! I love how much mystery there is surrounding these games...",
            "review_score": "1"
        },
        {
            "review_text": "gg my pants were scare 9 out of 8 m9 was edgy would jive with again.",
            "review_score": "1"
        },
        {
            "review_text": "You're so scared, you wanna quit, but the addiction to win overrides you.",
            "review_score": "1"
        },
        {
            "review_text": "Thank this game if you are my freind because IT MADE ME",
            "review_score": "1"
        },
        {
            "review_text": "its very cool better graphics than the first game also the freddy mask is cool the time is faster and the gameplay is mor challenging",
            "review_score": "1"
        },
        {
            "review_text": "Its v ery cool. When someone says ' THAT SO SCARY, I NEVER PLAY ' is a Baby. When i was a scary boy i never wanted to play this. But than i buyed FNAF 2 and the first 10 Minutes i never was scary. Very Recommend for scary boys, like me from the past. I think i buy FNAF 1 too!",
            "review_score": "1"
        },
        {
            "review_text": "best game ever im telling you i love it same as number one",
            "review_score": "1"
        },
        {
            "review_text": "I found this very hard to masurbate to... but i finished. Thanks toy chica :3 11/10 would ♥♥♥ shot on pc again.",
            "review_score": "1"
        },
        {
            "review_text": "Creates tense moments with friends and always fun alone. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "my friend gift me this game and it doesnt show on my homescreen, i can only play it if i go on steam library what do i do? ",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed playing this game because i love how challenging it can be",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights At Freddys 2, is a fun,scary, extremely hard game. I suggest it for all who like horror games, fast games, or strategic games. It has many easter eggs, an interesting backstory, and finally JUMPSCARES. LOTS AND LOTS OF F@$#ING JUMPSCARES. Otherwise, its an okay game. It is definently worth the $7.99, and i personally love the suspense. and nervousness of playing. IMPORTANT NOTE. DO NOT PLAY IF PRONE TO EPILEPTIC SEIZURES. YOU MOST LIKELY WOULDNT MAKE IT PAST NIGHT ONE. IM NOT JOKING, LOTS OF FLASHING LIGHT, AND SCREAMS!",
            "review_score": "1"
        },
        {
            "review_text": "This game scared me because the characters looked too much like animatronics  ...  ...  ...  Seriously great game though, cant wait for a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Even Speedwagon is afraid of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Scott Cawthon did a very good job on making these games, it is just a bit of a shame that the Five Nights at Freddys games are done for.. :( Well, that isnt bad, but I give Scott Cawthon a 10/10 on all these games because he did SUCH a great job on these game! Goodjob Scott and Goodbye Freddy Fazbear!  2014 - 2015   -Eddmania",
            "review_score": "1"
        },
        {
            "review_text": "I don't see whats so hard, just wear the mask while looking at the camera and bring spare batteries to work.",
            "review_score": "1"
        },
        {
            "review_text": "10/10  ♥♥♥♥ this game",
            "review_score": "1"
        },
        {
            "review_text": "It's good but not as scary as 1 ",
            "review_score": "1"
        },
        {
            "review_text": "This game, man it is 10x scarier than the previous FNaF game! No doors, just a flashlight, a mask and a monitor to save you now. This game is just so much scarier. More rooms and vents as well. Toys as well as broken down versions of the original mascots? Yep, well I'll tell you, this game is much scarier than just watching a youtuber like Markiplier or Jacksepticeye play it. Go play it if you love the game, trust me, it'll be awesome!",
            "review_score": "1"
        },
        {
            "review_text": "cool.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this is THE BEST horror I've played yet, great gameplay, nice gaphics, and awesome suprises. If you took sometime to get used to FNAF 1, you'll have more trouble with this one. I still on the night 3, but on a grade between 0 - 100, gets 100",
            "review_score": "1"
        },
        {
            "review_text": "The game could be better. The original horror aspect is lessened by the threat of power (Which in this game means Foxy is going to get you, but others can be avoided easily.) The puppet is more of a pain in the rear than anything. It does give you more of a jump the first time the music box runs out, or the first few times that old Bonnie or Chica appear when you put the camera down, but after that there is a decrease in the scare factor. I have made it all the way to night 3 so far without dying, but the game was already as challenging as night 3-4 of the original. I wish there would have been more of a haunting atmosphere, which I will admit is hard to pull off with this being a (SPOILER ALERT) prequel. I still want to know what is up with Toy Chica losing her beak when she moves around, makes her look more like a round faced Pikachu than anything, but it is still creepy when you see it. There are some glitches in the game, such as Foxy jumping out from the walls when your not looking directly down the hallway, or him popping out of your camera from time to time. These really need to be fixed, maybe by having a slightly longer cut scene for it where it forces you to look down the hallway. It wouldn't hurt as well to give the animatronics some slightly different death animation and attack screams. Just like at Chuck E. Cheese, the animatronics each have different voices so that needs to be brought out more. That's why it was hard to tell in the first game whether Bonnie was a boy or a girl at first glance. And don't even get me started on BB.  Overall, the scares are still there and are hightened by the ammount of things that are going on, the number of animatronics, and the new mechanics. The only issue is that gameplay is interupted by the music box mechanic, but it redeems itself by adding time constrainted suspence. Do you go for the music box or make sure that Foxy doesn't jump you?   Mechanics -8/10 Scares - 8/10 Gameplay - 9/10 Design - 10/10 Challenge - Very Challenging if you do not have a good strategy Rage - Minor Raging early on, but get over it. Glitch Fixes - Foxy coming from walls and cameras, Toy Chica's beak dissapearing(?)  Overall - 8.5/10  I Highly Recommend this game and I hope you all enjoy it.   IF YOU HAVEN'T PLAYED THE ORIGINAL, GO PLAY THAT ONE FIRST I RECOMMEND PLAYING THE DEMO VERSION FIRST BEFORE YOU DECIDE TO BUY (Night 1 and 2 on demo)",
            "review_score": "1"
        },
        {
            "review_text": "I killed my friends ears when the chicken came 9/9",
            "review_score": "1"
        },
        {
            "review_text": "This game is lovely think of foxy fangurls THINK OF HIM!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Much harder and way scarier than the first!  *Spoilers below*  FNAF is a prequel (proven by the paycheck of 1987 to your character) to FNAF 1 , and this game is much bigger and goes deeper into the tragic history of Freddy Fazbear's Pizza.   The new features (like the mask, flash light, air vents, little atari death mini games and new animatronics) help create a creepier atmosphere for our night shifts. The 'phone guy' even goes into detail about the murdering of the five children, which occur while you're the night guard.   This game is really enjoyable and if you have not bought it yet, do so!",
            "review_score": "1"
        },
        {
            "review_text": "Hello? Hello Hello?  This game is the best 'startle you and bang your knee on the underside of your desk' simulator I've ever played.  Otherwise, this is game is a noticeable imporvement from the first game, the devolper has obviously listen to the fanbase while also implementig his own ideas and innovations. The first FNAF could be broken down into a simple algorithm to stay alive, but this game requires a much more involved process, which makes this game all the more terrifing.  11/10 Would Bang",
            "review_score": "1"
        },
        {
            "review_text": "Fnaf 2 is a game where you play as a guy who thinks its a fantasic idea to work at a place where he will most likely die a horrible and painful death by a bunch of animal robot things that are most likely possesed by spoopy ghosts.  pros +The villager makes a cameo +you get paid 100 bucks a week +mangle has two heads which isnt terrifying at all  cons -not gluten free -too much water -you get paid 100 bucks a week -no waluigi Overall i have to give it a 420 out of -600 But really this game is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "am i da first its an awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "9/10 Needs more scare I was to pro.",
            "review_score": "1"
        },
        {
            "review_text": "The game is vividly similar to the previous game, 'Five Nights at Freddy's', however, in this game you have to be faster, smarter, and do not let that music box run out of music If you do Then all of everything goes and burns.",
            "review_score": "1"
        },
        {
            "review_text": "Im not going to ♥♥♥♥♥♥♥t this review like everyone else does. But i only bought this game bacause i wanted to ♥♥♥♥ new chica. It was worth the 5 dollars btw",
            "review_score": "1"
        },
        {
            "review_text": "Let me explain this game very simply: I quote, 'My fear of this game is stronger than my desire to have sex.' Context: my friend had to choose between playing this game and not having intercourse.",
            "review_score": "1"
        },
        {
            "review_text": "I was greeted by a black static filled screen with muffled children's laughter playing faintly in the background.  Best esc key mashing simulator ever.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "is gud buy it",
            "review_score": "1"
        },
        {
            "review_text": "Best game for playing while on the toilet! POOP/69",
            "review_score": "1"
        },
        {
            "review_text": "Nope Nope .... Taking Nope Train to Nope ville   10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "I played the IOS on my phone first part 10/10 now part 2 is out i give 12/10 i test it the demo 2 nights good now the full game very nice :]",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great that makes an already scary game terrifying and the god damn music box mechanic makes this game even mor stressfull",
            "review_score": "1"
        },
        {
            "review_text": "Can't beat night 6. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "So cool",
            "review_score": "1"
        },
        {
            "review_text": "I think I've developed a 1000 yard stare from this.",
            "review_score": "1"
        },
        {
            "review_text": "This game is too edgy for me!",
            "review_score": "1"
        },
        {
            "review_text": "Listen 'ere lads; this game is great for the late mates of fate. It is not for the feighn of heart or weak of spirit. 'nd ta all ya p##sy's out ther', take ya' balls of of ye purse and gently apply to skin.  10/10 makes me want to do meth.",
            "review_score": "1"
        },
        {
            "review_text": "it sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Use a mask against a robot, use flashlight against a furfag fox,and ♥♥♥♥ing wind up a random music box?  Worst game ever.",
            "review_score": "-1"
        },
        {
            "review_text": "Is good. You play. Yes.",
            "review_score": "1"
        },
        {
            "review_text": "I have been waiting for this game to come out since i heard about the sequel. plus i like the idea about it being a prequel as it as a sence of mystery to the game. with 11 guys trying to kill you it adds more to the game when old and new come togeher to kill you it's ever so sweet! and with no doors, a flashlight and a mask what could go wrong? this game is amazing and is a new type of game to play that is fun to watch or play (especialy when your mate plays it and they screem like a little girl! he he he) and I would rate it 5 stars for the game as i think scott has done a great job with it. P.S - Toy Chicka is HOT! and she brings you food in the night so all is ok! *killed by golden freddy*",
            "review_score": "1"
        },
        {
            "review_text": "i like this one out of all of them, but it is still a ♥♥♥♥♥♥ game.",
            "review_score": "-1"
        },
        {
            "review_text": "Lost within minutes, ghost animatronic crashed my game, made me scream like a girl 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Here I go better prep for 12 year old rage  Fanbase level : Autism (worst then meinkraft)  Game mechanics : Autism  Creator : Autism   Characters : Foxy ♥♥♥♥s alot  Horror : Not even scary   To be honest this game HAD alot of potential but then the Keemo Sadbus of an Autistic Fanbase came around and made everything Sex or Foxotron sometimes both Id rather spend my $8 on Golden Eagles on War thunder cuz' they actually do ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Hi guys it's me again with another 10/10 top notch game review.  This game is great to play, but the horror aspect is worse than the first one. The tension is seriously high when you play this game. Below i am going to have a step by step walkthrough for this game.  step 1) Buy game and install it.  step 2) Launch the game thinking to yourself yuo are ready.  step 3) Start night 1 listen to the guy on the phone who was meant to have died in the first one but apparently is jesus and has been resurrected.  Step 4) Realise that there is new animatronics that you would hope dont hunt humans on a night time  step 5) Realise how horribly wrong you were when you thought they wouldn't hunt you down  step 6) See that Bonnie has moved because she is more active than a 15 year old girl on instagram  step 7) Think to yourself how good it is not to run out of building power  step 8) Realise chica has moved and that she will most likely go to the toilet or just want to come and hug you straight away  step 9) Put your mask on as you realise that bonnie is in the airvent to your right  step 10) Now that Bonnie has gone you decide to check the hallway and the vents to then realise that chica is at the end of the hallway   step 11) 4am now you are still fine until you realise that the old animatronics are in the parts cupboard and that there is a lot more animatronics than you once thought  step 12) Almost forget about the music box that will inevitabely screw you over at one point.  step 13) realise i used a big word then  step 14) 5 am the tension has became so high that you are actually floating out of your chair.  step 15) 6 am you finished the first night, but have had to stop playing because of a heart problem that has developed in the time you have played that game and that you have been advised to delete the game by a doctor  step 16) play one more night for the final time, get jumpscared and die because that heart problem was affected by the scare and cause your heart to stop almost instantaneously.  Thank you for reading this review, yes i have played this game and i have became just like the man on the phone and resurrected just like jesus as well i guess it just goes to show i must be related to jesus.",
            "review_score": "1"
        },
        {
            "review_text": "Meh, It's overated",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME IS SO GUD if u have the money to buy this game U BETTER GET IT yea it may be hard REALLY REALLY HARD but that's y it's fun to begin with",
            "review_score": "1"
        },
        {
            "review_text": "In comparison to other games in its genre, Five Nights at Freddy's generally presents itself well and uses its minimalistic presentation to haunt the player further. Beyond simply a jumpscare festival, as some would dismiss it as, all of the small details come together to create a true experience of anxiety and tension with each play. Interestingly, it is a game that shifts from a straight horror experience into a challenge, presenting the player with more play time through the challenging gameplay that, although somewhat random, feels very rewarding when you execute properly.  In comparison with the firse Five Nights game, this game has much more polish and mechanical diversity than the old one, including the unique challenge presets in custom night, beyond simply cranking up everyone's difficulty all the way. This game keeps the tense atmosphere of the first and adds so much more. I fully recommend this to any horror fan, even if you didn't really like the first game. The pacing is quicker and more frenetic in this one, so this should be right up your alley.",
            "review_score": "1"
        },
        {
            "review_text": "Just as nerve-racking as the first game! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is WAY bettter than the last one!the building does not run out of power,there are more robots,and it's was more easy to survive!",
            "review_score": "1"
        },
        {
            "review_text": "want to ♥♥♥♥ your pants play this game",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Buy this game in a franchise pack, 4 games for 8 dollars, what a deal! &gt;Start this one up first &gt;Ease myself up, I'm confident &gt;I watch the cameras, nothing bad &gt;Phone man tells me to wind up music box &gt;I start doing so &gt;I remember to watch the main stage &gt;Only freddy is there &gt;Soil my pants &gt;Start rapidly changing cameras &gt;Chicken lady in hallway cam, staring right at me &gt;Escape key  Wonderful game.",
            "review_score": "1"
        },
        {
            "review_text": "Started Game. Used Cheats To Custom Night. (CD2) Set Balloon Boy Only One Active Watched Cameras And Wind Music Box Put camera down to check vents. Shadow Bonnie. Either Crashed Or Really Quickly hit Escape. 10/10 Would Have Nightmares Again ",
            "review_score": "1"
        },
        {
            "review_text": "Love This game, Very hard and intense also scary, It is my favorite out of them all :)",
            "review_score": "1"
        },
        {
            "review_text": "*Welcome to Freddys Pizzapit, were animals rip you in to a suit for Club Penguin.Chica likes to eat the brain, while Freddy chews on the hand.Old Bonnie likes to find a face,Old chica want plastic surgery.   10/10 would eat a hand.",
            "review_score": "1"
        },
        {
            "review_text": "This game, and the entire series, is amazing. Scott Cawthon, please continue to improve in skill and succeed in gamemaking. We know you will.",
            "review_score": "1"
        },
        {
            "review_text": "Scariest game I have ever played",
            "review_score": "1"
        },
        {
            "review_text": "This is a very SPOOKY game... If you like getting scared, this is for you. Jump scares ,freedy,*cough* Mangle *cough*. kbai",
            "review_score": "1"
        },
        {
            "review_text": "I think this game is the best one so far... I like the fact that you have 11 characters coming after you,that you have a flash light and a empty Freddy Fazbear head to put on when the characters enter your office.",
            "review_score": "1"
        },
        {
            "review_text": "LOL NOT SCARY BUT SO FUN",
            "review_score": "1"
        },
        {
            "review_text": "Not scary but good game, good way to spend 10 mins of a day or so",
            "review_score": "1"
        },
        {
            "review_text": "'We're not scary, we just want to say Hi!. So come and play with us, Don't be shy!'. 'There's 11 of us, and only 1 of you. Are you sure you're ready, for round 2?'. ",
            "review_score": "1"
        },
        {
            "review_text": "The fan base is scarier than these games.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, it definitely scared me. Still confused on the story of it.",
            "review_score": "1"
        },
        {
            "review_text": "dis is a good game good work scott butt there ar some mistakes.",
            "review_score": "1"
        },
        {
            "review_text": "there is a cheat hold in this order c d + ",
            "review_score": "1"
        },
        {
            "review_text": "2spooky4me 10/10  Gotta play this game man its harder and scarier then the 1st game. SCOTT YOU DID A GOOD JOB 1 CUPCAKE FOR YOU. If you make Five Nights At Freddy's 3 i know its gonna be even harder and scarier than the 2nd one.  Best horror game ive ever played. And i the story is so amazing and everyone wants to know the secrets of this game.   Scott i love this game. You are amazing, you get 2 cupcakes for being awesome :3            boo",
            "review_score": "1"
        },
        {
            "review_text": "1. bought and downloaded game 2. started up game 3. Bonnie's gone... ok 4. BONNIES IN MY VENT 5. PUT ON MASK NOW PLS 6. Death 7. Uninstall 8. Ends up installing again Repeat.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS SO AWESOME U NEED TO PLAY IT ITS FUN AND SCARY",
            "review_score": "1"
        },
        {
            "review_text": "I SWEAR TO WITHERED CHICA I WILL BEAT NIGHT SIX IF IT KILLS ME!!! But seriously. Play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Twice the Freddy Less the ready",
            "review_score": "1"
        },
        {
            "review_text": "The Best horror game series I know",
            "review_score": "1"
        },
        {
            "review_text": "today i got an eyeless toy bonnie death screen saw the endoskeleton 4 times in 4 gameplays and got a death minigame all of this happend today wow",
            "review_score": "1"
        },
        {
            "review_text": "Just play it. Get ready to have the ♥♥♥♥ scared out of you.",
            "review_score": "1"
        },
        {
            "review_text": "Brings a whole nother level of fear to the game... Get ready to fear Freddy once again...",
            "review_score": "1"
        },
        {
            "review_text": "always loved this game firstly played on ios loved it got it on pc even better",
            "review_score": "1"
        },
        {
            "review_text": "Its a good game to play on the toilet",
            "review_score": "1"
        },
        {
            "review_text": "Best laxative I've had in years.",
            "review_score": "1"
        },
        {
            "review_text": "Well...this game is AMAZING! The game is more challenging then the first one, I don't really know if it would sound right with me saying the graphics look good (Which they do!) because they're pre-rendered, but who cares! The animations are amazing especially with the new animatronics, easter eggs, (Good job on the Easter Eggs, Scott!) animations and mechanics! I really love this game, but i'm too scared to get past night 2! Dx The atmosphere is beautiful, the sounds and jumpscares really get you! Even there are some secret animatronics that are never mentioned! (Except Golden Freddy.) Like the endoskeleton, the ghost animatronic, etc. (Don't know if there's more that I didn't mention, please tell me.) I also love it how you brought back the nose and I love the hiding system. Though it gets annoying...ALOT, it's still cool. The fact how you had the older ones too is awesome, and especially the mini-games and secret little sequences when you're in the old reseraunt. Those are creepy and cool as hell! I honestly have no negative things to point out. Except, that the wind up box pisses me off and when there's an animatronic outside the hall and I have to wind it up and I know i'm gonna die, is really annoying. But besides that, beautiful creation, Scoot. Beautiful, if you're a fan of the first this is a MUST get.",
            "review_score": "1"
        },
        {
            "review_text": "This game is bland and boring dont waste your money on it, Like I did. also ♥♥♥♥ fnaf fanboys this game ruined gmod moding community.Deal with it",
            "review_score": "-1"
        },
        {
            "review_text": "This game reminds me of the WW2, how there was so much genocide. Genocide of my brain cells because there is no scariness in this game.",
            "review_score": "-1"
        },
        {
            "review_text": "It'll scare you a couple times, but they're just cheap scares that even the lowest budget B movie would be embarrassed to have to resort to.",
            "review_score": "-1"
        },
        {
            "review_text": "A very worthy follow-up. Exchanges the tense paranoia from the first game with an overwhelming onslaught of animatronics. Still quite terrifying too. If you're a fan of the first, you'll be right at home here.",
            "review_score": "1"
        },
        {
            "review_text": "This one was ok i guess but not worth the money.",
            "review_score": "-1"
        },
        {
            "review_text": "it is just plain trash ",
            "review_score": "-1"
        },
        {
            "review_text": "More scary then a 3rd term of Obama.",
            "review_score": "1"
        },
        {
            "review_text": "If you thought the first was bad. OMG! This one makes you s*** your pants. This one makes you appreciate that you had doors in the first one along with the phone guy.",
            "review_score": "1"
        },
        {
            "review_text": "I only have an hour played so far, and I have come to the conclusion that this game is the ultimate scary-stress management game. As the nights advance, you find yourself doing more and more things, keeping an eye out for not just four characters, but up to 10 along with the music box for the puppet/jack-in-the-box. I was playing with some friends one night and I was the only one to make it through night two (we all tried twice). I was practically playing russian roulette with foxy, leading to a fight or flight panic attack.  FNaF2: 8/10 Scary: 10/10 Panic attack: 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Better then the frist one Cant wait for the next one",
            "review_score": "1"
        },
        {
            "review_text": "Sequel to an amazing game! Fnaf 2 is more fun, is more difficult and well. Scarier than the first! I reccomend it to well...anyone who likes games!",
            "review_score": "1"
        },
        {
            "review_text": "First three nights good. I thought I was ready for freddy. Then the stripper chicken wearing panties showed up and killed me... 10/10 would die horribly many more times",
            "review_score": "1"
        },
        {
            "review_text": "I didn't enjoy it as much as I enjoyed the first one but still a pretty okay game. Its not as scary as the first one. The child screams from the animatronics been replaced with a less scarier goofy noise. The cameras has gotten more useless when the only camera I had to look at was the frustrating music box room. The new designs of Chica, Freddy and Bonnie looks great. Foxy in this one is disappointing. The animatronic that used to run down the hall scaring the player. He now only appears in the center of the room so no idea where he came from to appear in that spot. There is many moments where its impossible to even pass the night when you have a animatronic like Old Freddy and Old Bonnie cutting you off from winding the music box and having new bonnie coming in the room dragging more time away from you winding the frustrating music box It seems more like a stress simulator then anything else. I hope this music box stays away from Five nights at freddy's 3",
            "review_score": "1"
        },
        {
            "review_text": "If your looking for a review on this game you've come to the wrong place, but if your looking for an outstanding pie recipe you've come to the right place.  Ingredients: 1. 6 tablespoons unsalted butter 2. 1/2 cup white sugar 3. 1/2 cup brown sugar 4. 1/4 cup water 5. 1/4 teaspoon cinnamon 6. 1 pinch salt 7. 5 apples - peeled, cored and sliced 8. 1 pastry for double-crust pie   Directions: 1. Preheat oven to 425 degrees F (220 degrees C). 2. Combine butter, white sugar, brown sugar, water, cinnamon, and salt in a saucepan over medium heat. Bring to a boil, remove from heat and set aside. 3. Roll out half the pastry to fit a 9-inch pie plate. Place bottom crust in pie plate; pour in apple slices. 4. Roll out top crust into a 10-inch circle. Cut into 8 (1-inch) wide strips with a sharp paring knife or pastry wheel. Weave the pastry strips, one at a time, into a lattice pattern. Fold the ends of the lattice strips under the edge of the bottom crust and crimp to seal. 5. Pour butter-sugar mixture over top of pie, coating the lattice, and allowing any remaining sauce to drizzle through the crust. 6. Bake in the preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C), and bake until the crust is golden brown, the caramel on the top crust is set, and the apple filling is bubbling, 35 to 40 more minutes. Allow to cool completely before slicing.",
            "review_score": "-1"
        },
        {
            "review_text": "'See's old chica' 'Screams like a little girl' 'Press'd ESC'  FNAF 2 is the offical ESC Simulator - IGN",
            "review_score": "1"
        },
        {
            "review_text": "pros +good for waking up people in the morning with loud noises +decent gameplay +half decent graphics cons -repetetive -the fandom -too many fnaf sequels like this",
            "review_score": "1"
        },
        {
            "review_text": "Better than Alien Isolation",
            "review_score": "1"
        },
        {
            "review_text": "This One Is Better Not The First One.",
            "review_score": "1"
        },
        {
            "review_text": "The fan is more interesting than the actual game.",
            "review_score": "-1"
        },
        {
            "review_text": "Why is it not for apple?",
            "review_score": "1"
        },
        {
            "review_text": "Are you Freddy for Ready? If not inhale my dong enragement child",
            "review_score": "1"
        },
        {
            "review_text": "Please make this series compatable with mac and imac devices. it would make my week if you did.",
            "review_score": "1"
        },
        {
            "review_text": "-starts game -opening cutscene -eats some potato chips -realises im eating my reletives -♥♥♥♥ life -starts game -sees toy chica -doesn't want to fap to an animatronic bird -does it anyway -dies from toy bonnie since i was an idiot -♥♥♥♥ life,and this game                                           -plays again  21/21 would probably die again",
            "review_score": "1"
        },
        {
            "review_text": "best pee pee pants simulator ever",
            "review_score": "1"
        },
        {
            "review_text": "This game, as with the last game, is simple but effective. It doesn't just go for tension and then the big release when the jumpscare happens, it goes for frustration and pressure too. Reason? The Puppet. That isn't a particularly bad thing, and in fact I think it makes the jumpscares that follow more effective due to the game forcing you to either put the mask on if an animatronic is in the room OR wind up The Puppet's music box. Can't do both. It leaves you with a bit of helplessness, even more so than in the first game. It's a step up both in execution and difficulty from the first game- play it if you want a challenge.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "i got scared and peed myself and stayed up til release and ya dont tell mommy",
            "review_score": "1"
        },
        {
            "review_text": "Great Job Scott! Its a great game! I got jumpscared by foxy a few times! lol",
            "review_score": "1"
        },
        {
            "review_text": "Scott when is Third Game Out ???",
            "review_score": "1"
        },
        {
            "review_text": "this is the best game.",
            "review_score": "1"
        },
        {
            "review_text": "they dont want to kill you they want a hug am i right Cuz everyone says That And i Hate Chicas they Like Pizza And they Are Pizza And They Say Pizza and pizzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzza XD again pizzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzza And Agar.io Masters Fav is toy bonnie Cuz he goes first and he im night 3 Again Pizzzzzzzzzzzzzzzzzzza pizza pizza pizza pizza i want to play night 4 not 5 no five nights now four nights at freddys pizzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzza",
            "review_score": "1"
        },
        {
            "review_text": "This sequel is much better than the origanal. For those of you that don't know, they added a ton of new animitronics (toy bonnie, baloon boy) and new gameply elements. Now there is now power meter, only a light meter that you need to use to see not only the 3 open spots by your doors but also in the camera, and a Freddy mask that prevents use of the camera but will make many of the animitronics go away.",
            "review_score": "1"
        },
        {
            "review_text": "Way better than FNAF 1. I also love the little minigame when Freddy 2.0 or Chica 1.0 kills you. Although, the game over screen and jumpscares could use some work.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game and a music buy with a great community!",
            "review_score": "1"
        },
        {
            "review_text": "4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Great - just like the first one. The only downside is that after you play like an hour the game is not that scary anymore. Still, it's a must have for horror lovers.",
            "review_score": "1"
        },
        {
            "review_text": "Its a very good game, though its very scary. I mean in the first game there were five of them, now there is ten, not counting the puppet. Overall this game is really good and is a great game to get for those who love to be scared on a weekend in the dark...with a closet next to you...closed...Its a good game.",
            "review_score": "1"
        },
        {
            "review_text": "my game wont work :( i open it and it minimizes and wont open. how do i fix this? anyone else got the same problem",
            "review_score": "1"
        },
        {
            "review_text": "All i can say is, Night 3 = impossible",
            "review_score": "1"
        },
        {
            "review_text": "make this available for mac users",
            "review_score": "1"
        },
        {
            "review_text": "YES 3 STARSS NEVER TOUCHING THAT AGAIN 10\\10 DEFINATLY BUY THIS",
            "review_score": "1"
        },
        {
            "review_text": "a boy bear,bunny,chicken,and a fox get red rosey cheeks can this game get any scaryer plus the five children who got killed re on a PICTURE in your office ",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and scary",
            "review_score": "1"
        },
        {
            "review_text": "lol i got ♥♥♥♥ed hard in the ♥♥♥ 0/1 it's not garfield 2.6",
            "review_score": "1"
        },
        {
            "review_text": "this is an excelent game! its very fun too and a bit scary it makes me jump alot but there is one thing i am a bit confused about... foxy in the first game he is a bit broken but in the second game he is more broken but the weird thing to me is that his mouth also looked like a comepletly different shape than it was in the first game and the bottom part is broken,i know that all the older animatronics are broken and stuff like that i just think that its weird how foxy's mouth shape and form is different in the seccond game, but overall its a fantasic game i highly recomment this game!",
            "review_score": "1"
        },
        {
            "review_text": " Screen Tearing Simulator 2014. ",
            "review_score": "1"
        },
        {
            "review_text": "I liked the large number of unlockable plushies/figurines in this game, it really gave me a reason to keep playing! Much better than the first game!",
            "review_score": "1"
        },
        {
            "review_text": "Very spooky cant play it",
            "review_score": "1"
        },
        {
            "review_text": "Great game! The mechanics are really cool at first i didnt understand how the no doors thing would work but it works out fine for me. This game is much harder than the 1st one. although chica attempted to rip my face off xD 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is so freaking awsome more animatronics and the mask you guys really need to play this game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Played Game. Got jumpscared. Never played again. 10/10 IGN     Foxy pls don't hurt me   ",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play with my jumpy friends :)",
            "review_score": "1"
        },
        {
            "review_text": "WELCOME TO THE NIGHT SHIFT, heres what will happen: you'll die in a matter of seconds with bonnie the chicken, chica fazbear, and freddy the bunnie. you've been given a smelly mask from which a sweaty fatman wore back in 1966. the cameras are 1977 vintage, so feal free to break the cameras cuz their really expensive! were also not responsible for your untimley death and will be cleaned up in exacly 90 miliseconds.  we hope you get fired on your first day here :D",
            "review_score": "1"
        },
        {
            "review_text": "I loved the game",
            "review_score": "1"
        },
        {
            "review_text": "Started playing the game, No clue what to do. I see a fox. Its starts running at me yelling out freedom, He tries to jump on me. I super kicked him out of Freddy Fazbergs pizzaria.   10/10 Would super kick that fox again",
            "review_score": "1"
        },
        {
            "review_text": "The game itself isn't bad! actually and is quite a challenge for players who want a challenge!  10/10 would recommend it           But get it at low price",
            "review_score": "1"
        },
        {
            "review_text": "...    O HELL NO!!!    jumpscares my butt... ;w;",
            "review_score": "1"
        },
        {
            "review_text": "it's great but by night 2 it's too hard to keep track were the animitronics are!",
            "review_score": "1"
        },
        {
            "review_text": "The game itself isn't bad! actually and is quite a challenge for players who want a challenge!  10/10 would recommend it           But get it at low price",
            "review_score": "1"
        },
        {
            "review_text": "great i finished night 1 in 5 seconds",
            "review_score": "1"
        },
        {
            "review_text": "its pretty good",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite games of 2014, FNAF 2 (Five Nights At Freddy's 2) is a unique horror game and a amazingly succsesfull sequel to FNAF (Five Nights At Freddy's)!!! My favourite characters are Foxy, Freddy, Golden Freddy and to be honest... BB the most hated animatronic. Anyway's FNAF 2 is a brilliant game and I recommend you purchase it!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is an awesome game. You put on the Freddy head they go away. Don't the die. Highly recomended.",
            "review_score": "1"
        },
        {
            "review_text": "duuuuude I saw Bonnie in my vent, then he was at my desk and flippin hell, he got no face or arm! He jumpscared me and i flippin fell out of ma damn chair! 0_o. U want a scary game? here's ur damn scary game jeezzus! Thumbs up for days, well done Scott! :)",
            "review_score": "1"
        },
        {
            "review_text": "This is such an awsome game. Its scary, fun to play and just addictive.  I Played the first Five Nights at Freddy's and that was scary enough with 4 animatronics, but now with 10 or 11 animatronics is just insane. I love this game and I wouldn't trade it for anything! ",
            "review_score": "1"
        },
        {
            "review_text": "I recommened this game because its hard and scary xD",
            "review_score": "1"
        },
        {
            "review_text": "I did not like the game i didn't think it was scary at all because you get their patterns down when they get you by surprise then it could startle you the only reason i kinda like the game is when the first game came out i wanted to know the plot i kinda got a theory identical to the game therorist video on it before the video came out and when the video did come out i wasn't alone on my theory but i still had some questions left and when fnaf 2 came out it solved the last questions but it brought in a lot more questions im still working out whats going on i do know its a prequel though and i do recamend this game if you are a theorist :-]",
            "review_score": "1"
        },
        {
            "review_text": "Nearly ♥♥♥♥ myself when i failed to put on the freddy mask after Withered Chica got into my office on Night 3  69/69 would nearly ♥♥♥♥ myself again.",
            "review_score": "1"
        },
        {
            "review_text": "how to be an idiot in 12 easy steps  1. buy game 2. ask person to decide to play the game or not 3. wait for them to say yes 4. open game 5. get spooked by the menu 6. play game 7. check the cameras for 3 minutes 8. realise toy bonnie and toy chica move 9. ship it 10. panic 11. talk to friend during gameplay 12. accidently close game because you're used to pressing esc to close menu  11/10 would panic again",
            "review_score": "1"
        },
        {
            "review_text": "Are you looking for a job? yes! well come to freddy faz bears pizza to be a security guard. i cant wait for my new job!  NIGHT1 12am:whats with the animatronics? 1am:the frickin rabbit moved! 2am:why are there scary ripped up ones in th back? 3am:the chicken is in my room*puts mask on* 4am:hey kid shut up and get out the vent 5am:the chicken and the rabbit are in the vents! 6am: tommorow ill be prepared   NIGHT2 12am:those animatronics wont know what hit them! 1am:*foxy prepares to jump* NOT THIS TIME ♥♥♥♥♥!*gets rifle and murders him* 2am:*goes on rampage killing all animatronics* 3am:hahahahahah! 4am:muhahahahahahaha!! 5am:muhahahahahahahahahahaha!*starts coughing* 6am:well that went well  NEXT MORNING gets fired for 'tampering' with the animatronics    READY FOR FREDDY 10/10",
            "review_score": "1"
        },
        {
            "review_text": "FNAF 2 Has its ups and downs. I personaly think the game was a little to rushed, there are many glitches i incountered. Such as Foxy jumping out of a wall instead of the hallway.Although in the short time frame he made the game it is made very well in that short of time.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10  Every aspect of this game is truly amazing. The amount of thought put into this game is insane, and there's a little of everything in this game. You have the intense atmosphere for the thrill seekers. Non-stop jump scares for the Horror gamers. You have 10/20 mode for the over achievers. You have an amazing, solid, back story to it, that leaves just enough for you to start making your own crazy theroies, for the Lore crazy and the try hard theorist.  You have endless hours of gameplay for the determined. You have the ESC key for the first time horror gamer. You have a unique, original genre of gaming, for the guy who will play any game other then Call of Duty. You have 9 cute little plushy collectables via night 7, for the 'gotta get 100%' gamer. So to summerize, just because the concept of being stalked and horrifically murdered by 10 animatronics and a possessed marionette doesn't scare you, there's still something in this game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Nowhere near as good as the original. Disappointed",
            "review_score": "-1"
        },
        {
            "review_text": "What game program did scott use?!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best and worst game I have ever played in my life. Period. I played the original Five Nights at Freddy's. It was great, but it got really repetitive after a while. This game.. it's just too much. First of all, in FNAF 1, you only have five animatronics attacking you. In this game, you have 11. This gets reaaaally hard in your final nights, when you have to defend against all of them at once. This game improves on the controls on the first game; it's a lot harder to make mistakes. However, this comes at the price of having to use every tool at your disposal i.e. the flashlight, the camera, the Freddy mask. And the reason this game doesn't have a lot of rage-quit dislikes is because pretty much every time you die, it's your fault.  10/10  PROS +Over 10+ hours of gameplay +Doesn't get boring super fast +Great graphics and art style +Lots of plot details and secrets, if you're into that stuff +Bonus unlockables on the custom night +Really satisfying when you actually win  CONS -Gets super hard after the first few nights -Game strives on perfection or death -Can get SUUUUPER tense -Jumpscares. Lots and lots of jumpscares -Messes with your head",
            "review_score": "1"
        },
        {
            "review_text": "no thank u",
            "review_score": "1"
        },
        {
            "review_text": "Bob was only 23 years old. He loved FNaF so much. He had most of the Games And Merch. He prayed to Scott every night before bed, thanking him for the Pizzaria he's been given. 'FNaF is love,' he says, 'FNaF is life.' His Outlast Brother Sees Him And Calls Bob A baby. He knows his elder is just jealous of his son's devotion to Scott. He calls him a console peasant. He slaps him and sends him to sleep. He's crying now and his face hurts. He lays in bed, and it's really cold. He feels a warmth moving towards him. He looks up. It's Scott! He's so happy, Scott whispers into Bob's ear, 'Brighten Up The  Scottgames.com  Pic....There May Be A 4.' Scott grabs Bob with his powerful hands and puts him on his hands and knees. He's ready. Bob opens his photoshop for Scott. Scott puts his hands on the mouse, and raises the brightness on the image. It blinds him so much, but Bob does it for FNaF 4. Bob can feel his Theory coming together as his eyes water. He creates a Youtube theory. Bob wants to please Scott. Scott lets out a mighty roar as he fills Bob's computer with brightened  scottgames.com  images. Bob opens all the images and finds the number 4 on every image.  FNaF is love... FNaF is life... ﻿ ",
            "review_score": "1"
        },
        {
            "review_text": "I think my ESC button is getting worn out....",
            "review_score": "1"
        },
        {
            "review_text": "This game is so scary way scarier than five nights at freddys 1. 9/10 it isnt 10/10 only because of how hard it is",
            "review_score": "1"
        },
        {
            "review_text": "is game is good but so hard so if you don't like hard game deal with it and play 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I'ts great! I love it so much. I would recommend it to players that have played the first game, as it is not the easiest game I have played.",
            "review_score": "1"
        },
        {
            "review_text": "Thanks old bonnie for ruining my headphones 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Hey Guys! Wolfb0i here, I just wanted to point out that most of my friends thought that 'The Big Buildup' for this game was all for nothing. I for one, LOVE this game! There are no flaws! (Besides it being really hard.) Maybe they think that this game needs a bit more tweaking. Like more things to add that 'Horror Flavour'! Maybe fixing the Jumpscares, adding some creepy audio things? I dunno. Anyways, love this game! Making a series on my channel, and Peace out! Wolfb0i out. *END TRANSMISSION*",
            "review_score": "1"
        },
        {
            "review_text": "Umm... This Game is better than the 1st one... I Love how the game is and Freddy and the chicken.. But most i like bout this game is it scares me xD LOL So ya i actaully sended someone a gift and it was this game. So ya they really wanted it i have gifted 10 people this game Tbh.",
            "review_score": "1"
        },
        {
            "review_text": "I reccomend this game to anyone who likes a good scare or anyone whohas played the original one, can get a bit frustrating but amazing storyline (if youve figured it out already)",
            "review_score": "1"
        },
        {
            "review_text": "I love the new characters and the whole game overall, thanks so much Scott!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awsome !",
            "review_score": "1"
        },
        {
            "review_text": "beat it already, very scary and would take about 1 hour and 10 minutes to beat in one day...",
            "review_score": "1"
        },
        {
            "review_text": "I had to get a new pair of shorts.. twice",
            "review_score": "1"
        },
        {
            "review_text": "  cool game",
            "review_score": "1"
        },
        {
            "review_text": "Kwel. Not scary, but cool. You know, the only reason I like this game is the theorizability and the secrets, there are just SO MANY!",
            "review_score": "1"
        },
        {
            "review_text": "When i 1st time i saw fnaf i had two nightmarses i saw all jumpsceres i am not scerd of this game BUT i can't get past the 1st night! chica wont let me wind the music box the new chica! so you shod play it i made it 5AM the puppet master got me plese play it!    IT'S ME!!!  fnaf3 is crfrmod i thick scott is going to make it? go to  scottgames.com  so you can see it ;-)",
            "review_score": "1"
        },
        {
            "review_text": "The only reason I have this monstrosity is because some... 'friends' I know kept pestering me to get it. I don't care for it, but that wont stop the dev from cranking a new one out every three months. It's youtube LP fodder, and not even a worthwhile 'horror' game.   If you keep making the same game over and over again, do you really learn anything? ",
            "review_score": "-1"
        },
        {
            "review_text": "This game brought down my self-esteem faster than the World Trade Center. Rate 9/11",
            "review_score": "-1"
        },
        {
            "review_text": "Do you want cancer? No? Then don't buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "It feels like shiting out needles and pins 10/10",
            "review_score": "1"
        },
        {
            "review_text": "My personal rating: A fantastic, freaky prequel!  10/10 !  Persuasion to buy this game: If you thought that Five Nights at Freddy's wasn't a challenge, this is a new flavor for you! Defend yourself against Bonnie, Freddy, Chica, Foxy, Bonnie #2, Freddy #2, Chica #2, Foxy #2 (Mangle), Balloon Boy, and Golden Freddy. Golden Freddy is now a part of this game (if you did not already know), and is now a character to avoid. Your goal is to take the Night Shift which is from 12:00 to 6:00 AM without parishing a horrible death, and avoid the 'music box' from stopping. You'll know what happens soon if you don't know what the Marionette is. The same engine used to make the first game aswell as this one, and the graphics compared to the last game is unbelievable! It's very difficult to survive at time, so be extremely cautious. Discover more clues about the Five Nights at Freddy's theory, thanks to the animatronics. Now that I think about it, this wasn't really a persuasion, but if you liked the first game, you'll like this a whole lot more! HOVER YOUR MOUSE OVER THE BLACK BARS FOR SPOILERS!    A little bit about the enemies Bonnie, Chica, and Freddy all have the same actions and behaviors. I'm talking about the 1.0 animatronics of course. What I mean by the same actions and behaviors is that at any random moment sometimes on some certain nights, one of the old animatronics appear in your office with a spooky position. Freddy has his arm reaching towards you, Chica is kind of in the position where you're playing Prop Hunt on Garry's Mod, and when you're the old man stoff-posed prop, and Bonnie has nearly the same action. Foxy stands very distant in the hallway and will kill you at any random moment if you don't check in on him. *Cough*'FLASHLIGHT!'*Cough* Anyways, this 'Mangle' character was supposed to be known as Foxy 2.0. Upon building this animatronic, the employees didn't have enough parts, so they scrapped Mangle and left it as a toy that you could mantle and dismantle. I'm not sure if anyone knows why Mangle is known as Mangle. But let's continue. Freddy 2.0, and Chica 2.0 can appear in the hallway aswell. Just keep checking in on them and you'll be safe(r). However, Bonnie 2.0 can only appear in the bottom-right vent if he's coming to you. If you're in your office, and you hear things rattling around like someone's in the vents, check there. If you see an animatronic's face in the vents, put your mask on until you hear more vent noises, in which case, the entities will flee. Now let's get to the Marionette. No one knows how this puppet came to be, but he was the first one that came to be a member of the restaurant. If you have seen the minigame, you play as the marionette and you revive the kids which are known as the 4 animatronics that you know and love today. Did he revive Golden Freddy? No one knows. Anyways, the Marionette is one of the most important entities you'll ever encounter in Five Nights at Freddy's 2. Why, you may ask? Because you have to wind up the box every single few seconds or so to keep him from questioning why the music stopped. Why does the Marionette come to your office after you 'forget' to wind up the box, you may ask. It's because if there's no music in the room he's in, so in which case, he searches for some, in which case, your office. I don't understand why, but okay. 2 more lovely animatronics to go! Let's get onto Balloon Boy. This is for people on night 2, 3, and up. Balloon Boy is the one of the most hated enemies. I have not encountered him ever, but I'd know how it'll feel if I did. He permanently disables your flashlight, which will cause Freddy 1.0 to jump out of the hallway and kill you. And now the most lovely animatronic who you though started it all. Golden Freddy. He is a menacing, devilish little fiend, and I assure you he will give you a heart attack. There's no real reason why he appears in your office, but encountering him will make you sh*t enough bricks to build the Wall of China. If you see his face in the hallway when you enable your flashlight, I'm pretty sure he appears in your office afterwards. No one knows why he's there, but you have to be as fast as equipping your mask as you are when the old animatronics are in your office.  Now the 2 easter egg entities you will hardly ever see This entity is known as ' Shadow Bonnie '. As my friend told me, you have a 1 out of a 5000% chance to encounter him, and it's pretty believable considering he is pretty rare and unexpected to find. He has no reason to be in your office at the time, but you will notice him. People say that he may even be a creepy enemy that will appear in Five Nights at Freddy's 3. The theory of the game hasn't been solved yet, so it may be possible that Scott will wrap it up in another sequel.  Now for the final enemy which is pretty difficult to see, and has no reason of being there. This wierdo is known as ' Balloon Girl '. When you see the table of plushies that are the animatronics in your office, how about looking under the table. Pretty creepy, huh? Balloon Boy and Balloon Girl are like a spitting image, as which they look very alike. The only difference I saw was the eye color.  Time to wrap this up with a sappy ending. This put a lot of time and thought into making, and if you read it all, thank you. If you never knew about some of this stuff, feel free to comment on this review. It would support me a lot.  ",
            "review_score": "1"
        },
        {
            "review_text": "I liked the first game but this one. This one definately takes the cake of the series. It introduces new animatronics and new gaming mechanics as well, this game gave me more of a spook than the first one did, good job Scott!!",
            "review_score": "1"
        },
        {
            "review_text": "Don't Buy This.",
            "review_score": "-1"
        },
        {
            "review_text": "I really like this game! It is a big upgrade from the first because this time their is 11 of them, new ones, old ones,bb,puppet and golden freddy. Some might say that it only makes it more challenging but to me it just makes your heart beat faster and makes it more fun. I honestly like it that they didnt make it the same difficulty, what I mean by that is there is more things you need to keep aware for example: musicle box, no doors, 3 entrances, more camera spots and put on the freddy mask at ther right timing. Also, you have unlimited power just not unlimited flash light witch you use for the middle hall way and cameras. The 'anamatronic' that I think is most annoying is balloon boy so if you get the game you should be aware of that guy. Now I honestly love this game and they are improving it on christmas, it just keeps geting better. Now if you asked 'would you recomend this game........HECK YA!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is garbage. Hate me I could care less, this game if nothing more than suspence and tacky jumpscares. I get it, the markipooper and poodepoi and jookspoktic i played it but they do it for views and because people recommend it for them, please spend 8 dollars else where. Just, please for the love of god and satan ( if you're into that) don't buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Opened Game Saw some ******* scary animatronics Started Night 1  Beat Night 1 Started Night 2  Beat Night 2 Started Night 3 Faceless bonnie scared me Used hammer to destroy my pc with 6700K GTX 980 Ti and 16 GB RAM #rekt 11/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is probably the best horror game i have ever played it has a good balance of scare and agrivation.",
            "review_score": "1"
        },
        {
            "review_text": "'Fnaf dosen't suck, it's just the fanbase that sucks'  ",
            "review_score": "-1"
        },
        {
            "review_text": "Ruined every other game with all of these fnaf ♥♥♥♥tards",
            "review_score": "-1"
        },
        {
            "review_text": "Billy Bob from Showbiz Pizza Place wants his likeness back.",
            "review_score": "1"
        },
        {
            "review_text": "Billy Bob from Showbiz Pizza Place wants his likeness back.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone In a nutshell  Toy Freddy - no one like you Toy Bonnie - no one like you Toy Chica - (INSERT PORN HERE) Mangle - Litterally Scrap metal W. Freddy - No mercy W. Bonnie - No face W. Chica - Still fat Baloon Boy - NO ONE LIKES YOU Marrionette - YOU STARTED ALL OF THIS Golden Freddy - Well dammit  Game's amazing, though 4.5/5",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly Terrifying started 10 mins ago already on night 3 :) ",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome and i was surprised that it was a... nevermind",
            "review_score": "1"
        },
        {
            "review_text": "Same thrill. Better story.",
            "review_score": "1"
        },
        {
            "review_text": "im loveing this game it took me 3 and a half hours to beat night 4 though i dread night 5 and now i got to do alot of editing",
            "review_score": "1"
        },
        {
            "review_text": "Dude This game is amazing 10/10 100% up to night 4 ",
            "review_score": "1"
        },
        {
            "review_text": "the trailer dosent even show the toy vers. but only shows toy bonnie and also the old ones only come in night 3 but its still AWSOME",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best ♥♥♥♥ inducer ever.",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to give an honest review, that many of you deciding whether or not to buy the game can trust. I would give this game 3.5 stars. It's more or less the same game as FNAF 1, with a few extra features/robots. 3 or so of the robots, I wouldn't even consider enemies/characters, as they only jump up occasionally to test your reaction time. Night 3 &amp; 4 were good, a nice level of challenge without it being too hard. Night 5, very hard, but doable after a bunch of tries. Night 6, get ready to rage. I tried it at least 20, times, and eventually had to resort to cheat engine and slowing the game down to .5, and even then, there was still too much going on. A challenging game is good, but not to the point like this where it becomes an annoying waste of time that makes you want to punch your monitor.  The custom night is a fail. 2 screens are blocked out the whole night, you cannot disable or slow down the marionette (the most annoying part of this game), and even if you seemingly disable a robot entirely, it still remains very active (as active as it would be on, say night 3).  I think it was rushed. It could have been leveled better and more balanced, and could have had a few more features. There really isn't any reason at all to look at the other cameras (besides prize center) other than for fun and exploring. I wish he had added an element where you actually NEEDED to check the cameras to survive/strategize.",
            "review_score": "-1"
        },
        {
            "review_text": "- logs into computer - sees fnaf 2 is out - buys fnaf 2 (with gmod) - sees title screen - 12:00 am night 1 - bonnie appears in vent - ESC - uninstall - uninstall steam - smash computer - destroy the 4 terrabyte harddrive - throw through window into the snow - pay for window - ♥♥♥♥ pants because sees fnaf 3 is out on new computer other than that 10/10 best ♥♥♥♥ pants sim ever helped with constipation",
            "review_score": "1"
        },
        {
            "review_text": "Gotta watch out for dem scary robits!",
            "review_score": "1"
        },
        {
            "review_text": "It's better on an iOS device.",
            "review_score": "1"
        },
        {
            "review_text": "it was good at first though then on custom night it wouldn't let you really choose, i mean i set it from 20 20 20 20 to 2 2 2 1 and they still were 20 20 20 20, unless you just wanna play through it I don't recommend, scott if you see this please change so then it is FULLY customizable, kapeesh?",
            "review_score": "-1"
        },
        {
            "review_text": "fun and challenging refunded though bc i didnt want it anymore",
            "review_score": "1"
        },
        {
            "review_text": "When I lose in fourth night I click in the button continue but it says me continue first night, what can i do?",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, this is one of my favorite games... Well franchises, the game gets boring after a while but the story is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS THE BEST GAME OF THE YEAR AMAZING GRAPHICS AMAZING GAMEPLAY NOT CLICHE JUMPSCARE haha jk this game sucks lol",
            "review_score": "-1"
        },
        {
            "review_text": "Fnaf 2 was rushed if you dont know scott said it would release in 2015 but because markiplier and others played and there was no problems he released it BUT it had problems like the music box or the mask system and it felt rushed. None of the animatronics felt unique the only 2 that did were the puppet and withered foxy. The camera system to is a waste the only room you had to check was the music box but in fnaf 1 you actually were able to look around the place without looking at 1 room. This game is rushed and should have stayed in development until 2015 NOT 2014. I have to say the game isnt quite as good as the first one. Like i said about the first one it lasts for a few hours and thats it unless you want to go for the plushies.",
            "review_score": "-1"
        },
        {
            "review_text": "....................../´¯/)  ....................,/¯../  .................../..../  ............./´¯/'...'/´¯¯`·¸  ........../'/.../..../......./¨¯\\  ........('(...´...´.... ¯~/'...')  .........\\.................'...../  ..........''...\\.......... _.·´  ............\\..............(  ..............\\.............\\..F#CK FNAF 2 AND F#CK EVERY OTHER FNAF GAME!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 great game will buy if 3rd one comes out.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but gets boring. Buy it if its on sale, but prepare to have a heart atack ",
            "review_score": "-1"
        },
        {
            "review_text": "This is awful. If you had to choose two games and one of thee options were this game, DON'T PICK THIS ONE. Very boring and bassicly a huge waste of time. And believe me, its not worth it at all.",
            "review_score": "-1"
        },
        {
            "review_text": "this one dont buy at all this one really is gay every toy animatronic is a damn girl",
            "review_score": "-1"
        },
        {
            "review_text": "In the year 2020, scientists will extract the autism from FNAF, burn the remains, and weaponize the autism for combat.  War will change.﻿",
            "review_score": "-1"
        },
        {
            "review_text": "Eh... It just doesnt really have anything to it. The story is just pretty much a basic revenge story. This game had potential, but failed for me in the end.",
            "review_score": "-1"
        },
        {
            "review_text": "A COLOSSAL BUCKET OF NOPE!!!!!!!!!!! (its scary) GOOD GAME. (i'll never sleep ever)",
            "review_score": "1"
        },
        {
            "review_text": "i would rather buy winrar",
            "review_score": "-1"
        },
        {
            "review_text": "Cams are useless, not a challlenge and boring The game is to easy.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS SCARES THE ♥♥♥♥ OUT OF ME, it is waaaay scarier then the first game",
            "review_score": "1"
        },
        {
            "review_text": "(Before I start, don't get me wrong... I like this game.) In FNaF1 the main object of the game is watching the cameras, but now the cameras are only used to wind up the Marionette, then right when you put your camera down you slide on the Freddy mask. The Marionette ruins the object of watching the cameras to protect yourself from the animatronics. Now that there is 9 moving animatronics (not including Golden Freddy and the Marionette.) you have to watch the vents and the hallway while playing with the Marionette. When watching the cameras you have to flip to the Marionette then slide down to find Chica or Bonnie staring at you after sliding on the Freddy mask and learning its too late. Without the Marionette this game would be a lot better, having to watch the Marionette, check the vents and look in the hallway ruins your chance of being able to watch the cameras without dying.  With all the animatronics constantly popping up its stupid because you could not see them in the hallway or vents then you flip up the cameras then they're there, and with Chica and Bonnie if you take and extra second longer than the other animatronics you're dead.   The Multitasking is Real. When trying to deal with 11 glitchy animatronics, you have to constantly check vents and the hallway( like I already said) while playing with the music box you will become a MLG multitasker. The point of the Freddy mask if to save you from the OP animatronics, Scott is training us for FNaF3, where there is 30 animatronics you have 30 different masks to wear. I'm kidding, but all in all you have to learn to multitask on this dissapointing prequel. Yes its a prequel, tell me what you think of this review and i'll try to respond as fast as I can.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible game! It lagged out my Steam account and now it broke my steam. I exited Five nights at freddy's 2 after accedently pushed play and everything closed except It says I'm still playing the game. Even when I'm playing other games. That's why it says I played this for a long time. Can anyone help!?",
            "review_score": "-1"
        },
        {
            "review_text": "I wish I knew about steam refund when I bought this game",
            "review_score": "-1"
        },
        {
            "review_text": "not good to play!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks for the following reasons 1.7 dollars for sitting at a desk and doing ABSOLUTELY NOTHING but watching cameras and flashing yo flashlight 2. point and click, the name stands for itself 3.Scott barely even put effort into this. 4. community (why wouldn't I put that there) and 5. The fnaf series is repetetive, and it's pretty much a money printer in itself rating: 3/10 I wouldn't recommend this",
            "review_score": "-1"
        },
        {
            "review_text": "Scott works hard.",
            "review_score": "-1"
        },
        {
            "review_text": "Horror game? more like educational game.  too over rated fanbase makes me want to jump infront of an oncoming lorry jumpscares are so childish the stupid animals scream as if they won the annual barbie doll competition i rate this game 0/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "While this may be the best game out of this god awful series, that doesn't mean it's worth the money. The gameplay is so repetetive and boring that you'll probobly stop caring about the game before you even finish it. It's only scary for about 10 minutes, then you get used to it, and then when you die, you just want to smash your computer and drink 5 gallons of bleach. And I'm not even going to start on the fandom...",
            "review_score": "-1"
        },
        {
            "review_text": "Reporter: Hey random steam user, are you exited for Fnaf 2?  Pegtheprince: No! the first game sucked! the tralier is footage from the old game mostly and like no doors! kids do not  buy a game that you will keep on failing at!",
            "review_score": "-1"
        },
        {
            "review_text": "its a really bad game, dont buy it, its a waste of your money buying the same game over again. the fanbase is cancerous. If you disargree, who cares, you dont even get to move around in all four games. Dont tell me you can in the fourth one, YOU CANT move in Five nights at Freddys 4. How come you can't leave the house in fnaf 4? Or move to Canada. WASTE OF TIME. Get up out of your seat you autistic fat fedora ♥♥♥♥. I can smell the Doritos and Mountain Dew a mile away, I think its the Five nights at Freddys fanbase that smells like it. Get out of your basement, stop ♥♥♥♥♥♥ your crusty  Toy Chica body pillow. Move on to life.",
            "review_score": "-1"
        },
        {
            "review_text": "If I was trapped in a room with Scott Cawthon, the creator of Huniepop, Hitler and a glock from CS with 3 bullets left i would shoot Scott 3 times and hug the creator of Huniepop and Hitler.",
            "review_score": "-1"
        },
        {
            "review_text": "Why the f*ck do i own this sh*t?",
            "review_score": "-1"
        },
        {
            "review_text": "No thank you.",
            "review_score": "-1"
        },
        {
            "review_text": "Night 1 feels like it's already 4/20 mode. Well, it'd be 11/20 since there's 11 of them. Anyways, it's just a huge hassle. It's full of jump scares and some parts have made me jump but because of the new music box aspect of it, the only camera you really have to focus on is the Puppet Man's lair. I'd prefer that the music box didn't exist and the Puppet Man worked like Foxy. If some aspects were changed, then yeah, I'd recommend it. But for now, gonna have to say no.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is so boring you cant move all you do it turn on lights like who the fu.k made this are drunk guy?",
            "review_score": "-1"
        },
        {
            "review_text": "I shot BB with a BB gun.   ♥♥♥♥♥ had it coming.",
            "review_score": "1"
        },
        {
            "review_text": "This has got to be one of the scariest games ive ever played this is a totally recomended indie horror game",
            "review_score": "1"
        },
        {
            "review_text": "This game made me ♥♥♥♥ and/ or ♥♥♥♥ myself O-O.. I had my volume at 75% and the room is dark... I'm taking the nearest ♥♥♥♥ that train to nope vill...",
            "review_score": "1"
        },
        {
            "review_text": "i complete night 6 now so i kind of like this game BUT i have bonnie plushies too and its so cute and its my fav animatronic",
            "review_score": "1"
        },
        {
            "review_text": "Perfect example of how to do a sequel correctly",
            "review_score": "1"
        },
        {
            "review_text": "(Minor spoilers ahead)   A Great step up from the first game- It takes a formula and turns it into something fresh. Love the set up, the characters, the atmosphere, and new use of lighting mechanics.  However don't play for long priods of time as it can get a bit too frustruating, especially on the sixth night where It gets a bit too much to handle. I look forward to the custom night however, as there you can set the challenge of each anamatronic to your liking.   Great game, but very challenging.",
            "review_score": "1"
        },
        {
            "review_text": "This game is Scary",
            "review_score": "1"
        },
        {
            "review_text": "Installed game, beat night 1 and thought I had the system beat. Night too foxy made me ♥♥♥♥ my pants.....haven't played since!",
            "review_score": "1"
        },
        {
            "review_text": "I've heard some people say that FNAF 2 isn't as scary as the first game, I've heard some people say it's scarier than the first game, and I've heard quite a few trolls in between as well... Me? I don't care whether it's more or less scary than the first! After all, we have so much more to look out for in the second installment that we can't afford to get scared. The first game was in essence just 'watch your sides and don't forget about Foxy,' which is pretty scary in itself. But here we have a game where you can't just wall yourself into your office: Your only defence is a mask and a flashlight. Yes, the building can't run out of power, but if your flashlight dies then Foxy will quite literally eat you up. Some have complained that all the new animatronics makes this game too 'crowded' to be scary. That's nonsense! If just one animatronic got to you in the first game you were dead, and it was hard enough to keep four of them out of your office with security doors! Now we have 11 of them, and no doors! Where the first game made you use up a bit too much power, this game simply needs to distract you for one second to let one robot inside. Sure, you can fool most of them with the mask, but can you put it on the same second you spot the animatronics in your office? If not, then I advise you to get Quick or Be Dead. Think you've got what it takes? Well, you won't know you're wrong until it's too late... And then there's the constant task of winding the music box... FNAF 2 isn't just a horrifying game and it's not just a hard game: FNAF 2 is a game that'll test both your restraint and your quickness, and treat you to some lovely images of yourself screaming if you fail. I personally can't wait until the third game comes out! And yes, there will be a third, just as certain as your screams are when you lose yourself to this excellent sequel! Now excuse me, I have to wind up the music box...",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 2 is a very unique game. It is super stressful and has plenty of scares but is a great play.  This game has a certain aspect that makes you addicted to it. You want to continue playing to see how far you can go. If you are a fan of scary games or just want a fun play pick this up during the christmas sale.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "its good and all but it crashes when i start it, please fix this!",
            "review_score": "1"
        },
        {
            "review_text": "how to beat night 6.  1. YOU CANT ",
            "review_score": "1"
        },
        {
            "review_text": "Holy crap, the game machinics are amazing. If you want a good horror game with good game machinics, this is the game for you. In total there are ten animatronics after you, but if you count the puppet then thats eleven, but since it's a puppet and not a robot, then no theres ten animatronics and one puppet. In my experiance, it was pretty damn scary, but if your not easily scared, give this a try. I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "this game is fun if you need a good scare see how loung you survive Freddy Fazbear's Pizza Place a fun place where kids have fun or die",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 2 definitly brings a chill to my spine. The story is very well thought out and the jumpscares are fantastic. The animatronics are creepy, crawling through the vents and all. Each night that game definitly gets more challenging!  As the game was made very quickly, there are a few bugs here and there but all in all the game is great. Apart form the few bugs, the game is very good and I highly recommend you buy it. Especially as it is so cheap! :D",
            "review_score": "1"
        },
        {
            "review_text": "If you've played the first game, chances are you're tempted to buy this, if you are going to buy this, you might want to consider looking at the pros and cons;  Pros: -Fun new gameplay mechanics to play around with. -Challenge increased quite a bit (I'm not even joking, it is REALLY hard, get ready to die again and again and AGAIN). -All the animatronics from the first game are back (including Golden Freddy) and look a lot scarier, especially Chica. -All the animatronics in this game sound way more intimidating than the first game, rather than high pitched screams, they roar with voices quite a bit deeper this time around. -A lot more backstory, you're probably aware of the bite of '87, the five missing children, etc. In this game you get a better look at what's going on, it answers some questions, and leaves some unanswered.  Cons: -Jumpscares aren't quite as scary as the first game, sure the animatronics sound like more of a threat in this one, but you get a little too much time to prepare yourself for the most part, unless Foxy jumps at you. -Not quite as nerveracking as the first game, while you have a little bit more multitasking this time around, you don't feel as vulnerable. if anything wanders nearby, you simply put on your Freddy head to disguise yourself until it leaves. This doesn't ruin the game, but it subtracts a little from the scariness.  Overall: I'm a huge 5NAF fan, and this game is amazing, if you're a fan you should download this now, I promise you won't regret it. I look forward to what Scott may bring us in the near future.",
            "review_score": "1"
        },
        {
            "review_text": "great game!!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would press ESC Key again",
            "review_score": "1"
        },
        {
            "review_text": "Pretty sure my vocal cords hit the highest note I can hit.",
            "review_score": "1"
        },
        {
            "review_text": "funist game ever super hard i have it on ios and pc i could play forever",
            "review_score": "1"
        },
        {
            "review_text": "It provides creepyness, tension, and is not for the weak hearted, it provides a thrilling experience, yet theres one thing that I don't like about it, the story is too short, and there is pretty much NO reason to start the game over again. Unless you want eastereggs. Its pretty much just 4 hours of gameplay before you complete nights 1-6, and the challenges will take atleast another 4 hours and thats it. So my final rating is 9/10, ",
            "review_score": "1"
        },
        {
            "review_text": "Get ready to jump out of your skin playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Such a good game, played it and I practically screamed the first time.",
            "review_score": "1"
        },
        {
            "review_text": "Managed to make it to night 3 before I broke down sobbing. 10/10 We need more horror games like this!",
            "review_score": "1"
        },
        {
            "review_text": "the game is realy REALY hard depending on the person they might like it give it a shot maby youll like it",
            "review_score": "1"
        },
        {
            "review_text": "I recomend this amazing and fun filled game!(and by fun i mean scary as hell... well not for every user) This amazing game is the second one. The first one... well it wasnt as big as this one our hard as this one but both games are cool. I seriusly recommend this amazing game!",
            "review_score": "1"
        },
        {
            "review_text": "There are no words to describe this game, it is THE best game i have ever played! im sure you all heard, seen, or watched the trailer so i wont say the things in the trailer, but now there are 11 animatronics: balloon boy, meronette, toy chica, toy bonnie, toy freddy, the mangle (toy foxy), dismantled bonnie, dismantled chica, dismantled freddy and dismantled foxy!    Best game i have play and always will be: 20/10  #Neverreadyforfreddy",
            "review_score": "1"
        },
        {
            "review_text": "More horrifying than the first one, which I thought was the most horrifying game I've ever played. This game is for all horror game lovers that doesn't have any heart disease.... (ready a 911 dailed on your phone just in case you get a heart attack though)",
            "review_score": "1"
        },
        {
            "review_text": "so scary i swear and nice job im hopeing you will make five nights at freddys 3 if u do i bet it will even scaryer then five nights at freddys 2     #FNAF",
            "review_score": "1"
        },
        {
            "review_text": "It's no secret that Five Nights at Freddy's was a complete success. The game was like none other I nor anyone else in the gaming community had seen before. As for the second game, much of the same thing can be said. This time around, the animtronics from the old location have been replaced with all new and improved versions. However, you will have to face the familiar four from the first game (now old and dismantled). To be honest, the old animtronics are what really sell the game for me. The new toy animtronics are not creepy at all. (Exept maybe mangle) The old animtronics however, Freddy is just plain creepy, bonnie's face is ripped off, Chica's jaw is hanging open, and foxy... well, he's just foxy. In this new installment, you have a freddy mask that you can put on and fool the animtronics into thinking you are one of them. This works quite well and works an all but two animtronics: Foxy and the Puppet who all talk about later. You also have a flashlight that can be used to shine into the hallway and can even be used to shine...light...in..the...cameras... ok am I the only one who questions the logic of the flashlight being able to be used in the cameras? Really, how does that even work? Anyway, speaking of cameras, you need to go into the cameras alot and I mean ALOT on account of a music box that you need to wind up to avoid being killed by the puppet that I mentioned because once it gets out, there's no stopping it. This is the one major problom that I have with FNAF 2. You don't need to look in any other camera exept the one with the music box. Sure in the first game pirates cove was the only thing you really needed to look at to check on foxy, but you only needed to check that for a second or two. Here, you need to sit there and wind the music box untill it is full. Also, for some reason there are vents in your office and animtronics can crawl through said vents and get into your office that way. Who the heck thought that having large gaping vents in your office was a good idea anyway? I mean it addsto the challange and al but it just seems a bit silly. Overall, I give Five Nights at Freddy's 2 a 9/10 for amazing gamplay, scary and cute and cuddly animtronics, and a boatload of other things. I just wish the camreas could be used for more than just winding a music box. I can recommend this game to anyone who is brave enough to play it.",
            "review_score": "1"
        },
        {
            "review_text": "Its cool but on night 2 foxy jumps at you but if you slow it down he's saying freedom.And mangle the new foxy and she has a type of radio call.And if you look on your left in the office and click on fredy's nose it honks.so you should get it. ",
            "review_score": "1"
        },
        {
            "review_text": "AWSM GAME how annoyed i am of how it IS A FREAKING PREQUEL!!!!!! AND NO MULTIPLAYER. How come they said it was coming next year? -L- IT HAS PROBLEMS OF HOW TO INTERACT WITH FOXY BECAUSE NO INGAME MECHANICS WILL WORK ON HIM!!!!! -",
            "review_score": "1"
        },
        {
            "review_text": "five nights at freddys story explained. you play as a night time watchmen named jerry you must save your self from mickey mouse if you dont wind up the music box a cave spider from minecraft will jump at your face like a facehugger and you wont survive night 2 at all",
            "review_score": "1"
        },
        {
            "review_text": "Best Game Ever 10/10 And part 3 has been confirmed Awsome",
            "review_score": "1"
        },
        {
            "review_text": "Hears Fnaf 2 Is Out Freaks  Night #1:  12am: Checks Cameras 1am: Sees Toy Bonnie and Toy Chica Is Out Freaks Out  2am: Sees Toy Chica Near By Freaks Outs and Puts Mask on  3am: Sees Toy Bonnie In Vents Puts Mask on  4am: Same Thing As 2 and 3 am 5: Ok almost there almost there  5 1/2 am: Gets Jump Scarred by Toy Bonnie POIASHFIUGHFWAUYGFES HOLY ♥♥♥♥ING ♥♥♥♥  10/10 BEST JUMP SCARE SIMULATOR EVER 10/10 BEST HEART ATTACK SIMULATOR EVER 10/10 BEST BREAK YOUR KEYBOARD MOUSE MONITOR DESKTOP SIMULATOR EVER",
            "review_score": "1"
        },
        {
            "review_text": "its good and cool",
            "review_score": "1"
        },
        {
            "review_text": "I can't sleep with the lights off anymore.",
            "review_score": "1"
        },
        {
            "review_text": "very fun game i recomend it! only one problem with it is that it gets repetative when you theres a jump scare and when you learn the patterns of them.... but none the less i recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "1) *starts night 6* 2) *See's Golden Freddy* 3) Haha. Nope. GG. Game over. 4) *Clicks ESC x1000000* 5) *Uninstalls*   Best horror game 40/20 Hardest extra 1000000/20",
            "review_score": "1"
        },
        {
            "review_text": "Got it as soon as it came out. Done every challange except for fazbeaar fever and golden freddy, there are a few glitches every now and again but they cant distract from how fun this game is. LOVE IT, good work Scott. one problem. i feel as the first one was a little scarier but the images you see in this are disturbing but awesome. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "love these games nearly gave me a heart attack once...♥♥♥♥A YOU PUPPET!!!!!!!!!!!!!!!!!!!!!!!!! but seriosly buy this game now i now you want",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 2 LOL Play  Night 1: 12 AM: Alright so I'm working but i dont wanna get up Oh a Phone is Ringing 1 AM: So Yeah Tutorial 2 AM: Still Talking Boring Man!! 3 AM: Finally Shuts up Oh s**t the dudes moved 4 AM: Um whats up with Chica She had Eyes and a Beak But No More 5 AM: What the F**k Toy Bonnie Why do you dis Im am Your Father Freddy D: 6 AM: Finally I win :D   Night 2: 12 AM: Ok i'm Back Phone Guy Will you not talk as long 1 AM: Ok He finally shuts up What the Foxy is in my Hall 2 AM: Good Foxy is Gone and Wind The Music Box What the f**k a another Foxy hanging in Prize Corner 3 AM: I'm Looking through the cams and What The SDFHFSDHDSHF HH HDFAHAF HD FH Broken animatronics?!?!?!??! 4 AM: *Boring* 5 AM: Ah .. What kid in the vents foxy back and says 'I knew this wasn't a Good Idea' 6 AM: YASSSSSSS I WIN :D   Night 3: 12 AM: Way too many attempts im using a stragey 1 AM: Allright i'm in total focus mode *music box winded* 2 AM: Foxy again *sighs* 3 AM: WTHSFDHUGHFHH Broken animatronic Bonnie Mask On 4 AM: YESSSSSS IT F****KING WORKED 5 AM: I can do this *Actviates MLG Mode* 6 AM: GFDSJHFH HF H YES ALLLLL HAILL!!!!!! I'M THE MASTER!!   Night 4: Not attempting till i get over all over that scares",
            "review_score": "1"
        },
        {
            "review_text": "So this game is amazing. They did fix all the bugs.If the game was a potato it would be a good potato .",
            "review_score": "1"
        },
        {
            "review_text": "well i dont have so much information about my story about this game and comments but its really awsome i myuct say that it made me jump by first time :D but whoever the name of the developer who made this good job ;) can you make more of this kind of games and more challenging please :D like five nigths at freddy 3 that would be great if you could!!!! :D",
            "review_score": "1"
        },
        {
            "review_text": "really hard and night 6 dang foxy always got me but   10/10 musicbox simulator",
            "review_score": "1"
        },
        {
            "review_text": "why does fritzz smith say it is summer and he speaks english ?",
            "review_score": "1"
        },
        {
            "review_text": "It is a Fun Strategy horror game.",
            "review_score": "1"
        },
        {
            "review_text": "Not as bad as the fandom  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Night 1:  12:00: :I   1:00: :P   2:00: Huh? Bounie and Chicker are gone...  3:00: Bounie and Chicker...Halp.  4:00: *Feels like he's gonna fail and die in the game* NOPE *presses ESC*  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Double the Freddy clears my colon real fast, but then you get used to it.",
            "review_score": "1"
        },
        {
            "review_text": "This Was Super scary i liked it alot and i hope soon that scott makes five nights at freddys 3.",
            "review_score": "1"
        },
        {
            "review_text": "the most intense RPG you can buy on the steam store or somthing like that.",
            "review_score": "1"
        },
        {
            "review_text": "pure gold and that all she wrote",
            "review_score": "1"
        },
        {
            "review_text": "even better than the first!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Remove Balloon Boy he makes it so i have to keep the mask on for a long time so when i take it off foxy gets me! But other than that the game is good :)",
            "review_score": "1"
        },
        {
            "review_text": "Why do I recommend this game you ask? Well let me tell you! it is fun to get scared, and it is also very addicting, In my opinion you should get this game, it is deffienttly worth 7.99 ",
            "review_score": "1"
        },
        {
            "review_text": "The Game is made by Scott Cawthon. Everything you see in the game is made by Scott himself. Five Nights at Freddy's 2 is challenging, it's fun, and Scott is personaly my favorite game creator of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, so this about sums up why everyone was scared of the dark when they were kids. Immensly terrifying jumpscares. Lots of stress. Very interesting back story. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played the game that much, but I absolutely love it. It's slightly less frightening until the jumpscares, in my opinon, but that's because there's more to do while you're trying to protect yourself. There's more distractions from the looming threats, so it's not as paranoia-inducing as the first installment to the series.  9/10 would buy, but that's because the 10th is too much of a ♥♥♥♥♥ to handle jumpscares.",
            "review_score": "1"
        },
        {
            "review_text": "i like this game and i saw something cool on the main menu when they open there mouths they look like the old ones and i saw ballon boy was under my desk!",
            "review_score": "1"
        },
        {
            "review_text": "I saw the title...  Now I am falling 20,00 feet out a window. ",
            "review_score": "1"
        },
        {
            "review_text": "This game right here...is a hear att-i mean a really well thought out game, having to wind up the box and keep an eye on the animatronics, Scott my man you have made the best horror game i have ever played",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome once you get passed the creepy animatronics then its just a gravy train from there",
            "review_score": "1"
        },
        {
            "review_text": "Spooks so bad can't play with volume ESC key simulator also 17/3",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty darn good, and is a definite sequel (or prequel) to the first game, but this does have some of faults.  First of all, I think the music box mechanic wasn’t a good idea, as it reduces the monitor’s usage from a tool to keep track of what’s where to a big obscuring button to wind some music box. The box also winds down faster on later nights, making it sometimes impossible took keep it wound as the time it takes for the animatronics to leave the office and the vent openings becomes greater than the time it takes for the music box to wind down.  The Freddy Mask wasn’t a bad idea in my opinion, but the margin for error when using it is very thin (in the first game, you had quite a bit of time to react before something enters the office. In this, you have about a split-second to put on the mask before the game deems you were too slow).  Graphics-wise, this game doesn’t look bad, but for a 2014 game I’d expect something more. There are a lot of weird things involving light. All rooms viewed by the cameras seem to be lit by a dim, cool spotlight that seems to have no real source and the hanging lamp in your office lights everything EXECPT the vent openings and part of the hallway that it realistically should be lit. Although this doesn’t take away much from the gameplay, it would have made it more atmospheric if, for instance, rooms were lit by ambient light from windows and the office were lit by a small desk lamp.   Again, this game isn’t a bad game, but it could have been a lot better. I hope the next game both looks and feels better than this one. I hope to see possibly a new engine (Source 2.0?), better atmosphere, a more dynamic environment, and maybe a little voice acting wouldn’t hurt. ",
            "review_score": "1"
        },
        {
            "review_text": "I've only played for 8 minutes but.. BEST GAME EVER.",
            "review_score": "1"
        },
        {
            "review_text": "Why isnt it on Mac? People Can Get New Mouses Like I Did... ",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 2, the game that gives you, like the first one, a free jumpscare whenever you lose!",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is AMAZING but im gonna give it 7/10 the only negitive thing i can find is that it is not full 1080p not even 720p its extremely low res making it impossible to record for when i watch the clips from fraps the video has a huge black border around the video. but other then that if you dont record I extremely encourage you to buy this game so much scarier then the last game the gameplay is so much better the game mechanics are way more complicated but so much better i just started ♥♥♥♥♥♥ing as soon as i opened the game. if you compare this to the lest FNAF the last one is just a demo or beta where this is like a full game its like slender vs slender the arival",
            "review_score": "1"
        },
        {
            "review_text": "FNaF 2 is a fun game, although extremely challenging, I would recommend to a friend.",
            "review_score": "1"
        },
        {
            "review_text": "FNaF 2 is possibly the best game I have ever seen in my life (well, so far) it has great graphics, spooky backstory and is a very fun and challenging game. Over all I would give it 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A great game to put on the big screen with a group of friends. Have fun crapping your pants.",
            "review_score": "1"
        },
        {
            "review_text": "Night 5 has been the trickiest night i have ever experienced and Night 5 has a pattern to it :l",
            "review_score": "1"
        },
        {
            "review_text": "Nice, fun and scary game well made.",
            "review_score": "1"
        },
        {
            "review_text": "I really want to play but everytime I'm about to beat night one my game freezes... Any ideas for help?",
            "review_score": "1"
        },
        {
            "review_text": "When i beat The First Five Nights at Freddy's I couldnt get scared anymore. watched Ouijia nothing scared me. Sat in the dark listening to Lavender Town. I wasnt scared anymore. I went to the store to get Dead Rising 3 and saw Five Nights at Freddy's 2...then i ♥♥♥♥ my pants. I decided to man up and buy it. Big mistake  1 am: Looking around getting use to the new controls. 2 am: Staring at Parts and Service. 3 am: Bonnie is gone. 4 am: Staring at Bonnie. 5 am: Cameras blackout. 6 am: First one was scarier.  2nd Night 1 am - 5am: Fuggin Foxy. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is just amazing. Every jumpscare got me. It's so crazy, i love it.",
            "review_score": "1"
        },
        {
            "review_text": "'Just another horror ' I THINK NOT! FNAF2 is highly loved game by me ( of course ) one bad thing though Balloon boy -_-",
            "review_score": "1"
        },
        {
            "review_text": "So when you open the game and the menu pops up, here is what you do: 1.) Go out to your driveway. 2.) You take a rock. 3.) You rub it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Did anyone else see a shadowy figure in the left corner with glowing white eyes and a mouth?    10/10 WTF WAS IT",
            "review_score": "1"
        },
        {
            "review_text": "Thanks to five nights at freddy's, I am guaranteed no sleep and a letter grade down in every class! Thanks Freddy!",
            "review_score": "1"
        },
        {
            "review_text": "I thought the first game was hard. This game makes the first one a walk in the park with the Carebears! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great fun for the entire family.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing I love how Scott made the story kinda hidden that it wasnt just laid out infront of you like most games.The amount of details this man put in the is awesome I just wish I was better at horror games.Scott if you read this I hope you make a third one there is a big following for this game and I give this a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Got murdered. A lot. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Screamed so loud fell out of my chair  11/10-Ign ",
            "review_score": "1"
        },
        {
            "review_text": "Horrifying as heck, Really scary and i hate bb.",
            "review_score": "1"
        },
        {
            "review_text": "Strategy  wind up music box for 10 seconds (half this for every animatronic you see) check lights put on freddy mask for 2.5 seconds if you see 1 animatronic (double for each one you see) Check on balloon boy reapeat   the bare endoskeloton and balloon boy are passive don't count them if you wind up the music box and balloon boy is laughing you get jumped foxy",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. very spooky, lots of jump scares, and i like how they can go on the walls a celling... its very fun!",
            "review_score": "1"
        },
        {
            "review_text": "this game is the best",
            "review_score": "1"
        },
        {
            "review_text": "CREEEEEEPY AND FUN AND SCARY AND MY RATING OUT OF 10 IS 20/10 THATS MY RATING OF THE CREEPINESS AND SCARINESS OF THIS GAME AND THE SEQUEL",
            "review_score": "1"
        },
        {
            "review_text": "If you are asking yourself, 'Should I buy this?' ask yourself this question instead, 'Have I played/beat FNaF 1?' If you answered yes, go for it. If no, I hope you are used to a lot of tension because if not, dont waste your cash. Only buy this if you want to be scared or want to get your blood flowing.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best dating sims i have ever played. On night 4 things get real between foxy and old bonnie it's really hot. The customization option is the best by far who wouldn't want the characters fighting for your attention as senpai.",
            "review_score": "1"
        },
        {
            "review_text": "Death Simulator 2014",
            "review_score": "1"
        },
        {
            "review_text": "This game dosent look scary at all.  Finished night 1.  Checked my seat and saw a gigantic brick.",
            "review_score": "1"
        },
        {
            "review_text": "Duuuuuude. That part where the old bonnie was standing in your office was so crazy. I thought he was dismantled and deactivated.",
            "review_score": "1"
        },
        {
            "review_text": "Very tense game, you have to have great reactions from night 3 onwards. 10/20 was a pain but I beat it nevertheless.  very great game.",
            "review_score": "1"
        },
        {
            "review_text": "no shrek sex scene 0\\10",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game. Its very educational, I finally know what the fox says. Its not 'A dum dum day dum', the fox actually says 'FREEDOM!!!!' 10/10 A++",
            "review_score": "1"
        },
        {
            "review_text": "This sequel to Five Nights at Freddy's is amazing. Phone guy revealed some surprising things, along with alot of shocking moments. Anyway, this is my review for the game  GAMEPLAY This game functions I think like the 1st one. The no door mechanic works really well, you can't run out of power like in the 1st game, all that happens is your flashlight dies. You can still try and continue to play, but it's nearly impossible most of the time to survive with Foxy right in the hall. You are given a Freddy Fazbear head to hide from animatronics. It dosen't work on Foxy and Mangle, aka New Foxy.  Overall, this game, I don't know how to speak for the rest of it, it was amazing and insanely hard. For those of you planning to get it, get the 1st game, I made the mistake of starting with this game, having alot of trouble with it. You will have a chance to get used to it before you start the second game.  Tags that I feel should go with this game: Family Friendly, Anime, Dating Sim, Cute, Fun For All Ages, Horror, Psychological Horror, Singleplayer (easy to take turns with), Indie, Fun, Scary, Funny, Nightmare Fuel.",
            "review_score": "1"
        },
        {
            "review_text": "Ok i dont know for sure but did i get the real game?  1. the word 'Demo' Is nowere to be seen 2.I baught it for $7.99 3.Im on the 3rd night   So if this isn't the demo i'll be suprised  Eeevee_Minecrafter_Dude",
            "review_score": "1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "This game is hands down the most terror filled game I have ever played. The suspense and shock value make the first game look like an MS paint flash game. This is the best horror game ever made. But since this is a proffesional review I will make a pros and cons list.  Pros Its hard and fun. Very original compared to the first one. Amazing considering it was a couple months work. Full of mystery and hard to follow AI. Great cutscenes.  Cons I guess it kinda gets too hard?   ",
            "review_score": "1"
        },
        {
            "review_text": "Spookier than the last one.",
            "review_score": "1"
        },
        {
            "review_text": "really hard and scary ",
            "review_score": "1"
        },
        {
            "review_text": "10/20 Mode! THAT PUPPET AND THE MUSIC BOX!!!! Better Than The First!!! BUY AND MAKE SCOTT HAPPY!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "So I've been diagnosed with cancer of the lungs and I'm so excited to say that this game saved my life. I was lying in bed at the hospital when i saw that this game was only 8 bucks. I was soon to discover I made the best choice of my life right there in that bed. I started the game up and was extremely scared but also transfixed at the creepy atmoshere and the horrible noises coming from the halls and vents. Now I had no idea what the guy on the phone ment by, 'keep the toy box wound up' or whatever he said. Seconds into the game I here a toy box playing and I think nothing of it. This is when the mircale happen. THAT STUPID DIRTSUCKING PUPPET TOY THING POPPED OUT because I DID NOT WIND ITS FRIGGIN BOX UP! However, despite my anger it did scare the cancer right out of me! Even though it caused me to have a heart attack and the doctors say I will have to have my heart monitored the rest of my life, it was still a miracle and the game still saved MY LIFE! 10/10 best friggin game in existence",
            "review_score": "1"
        },
        {
            "review_text": "Lovelovelove it! The atmosphere... creepy, dark, perfect! I'm glad I can use the camera a bit more, but WOW! Don't let your guard down... Eleven animatronics to deal with. E-lev-en. Foxy, Chica, Freddy, Golden Freddy, Bonnie, plus the new versions of the main gang- and two more! The Marienette and the Balloon Boy are both sure to mess with your head. You've got to play the game, you've just got to.",
            "review_score": "1"
        },
        {
            "review_text": "buy it!! worth the money!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Do not like this game one bit 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is one scary game, well worth the money for a good scare but to really enjoy it play the first one to understand it",
            "review_score": "1"
        },
        {
            "review_text": "its a great game make sure to WIND THAT MUSIC BOX (cam 11) and flash the hallway every now and then",
            "review_score": "1"
        },
        {
            "review_text": "OMG BETTER AND SCARIER THAN THE FIRST GAME, NO QUESTIONS ASKED!!!!!! :O",
            "review_score": "1"
        },
        {
            "review_text": "What I liked about the game is, You don't have to be good to beat it. What I disliked about it is, You HAVE to have fast reflexes to play.   I reccomended EVERYONE to play this.",
            "review_score": "1"
        },
        {
            "review_text": "Scott Cawthon does it again with this amazing sequel to his first game 'Five Nights At Freddy's' I highly sugjest playing the first game before playing this game if you want to understand the story.  This indie horror game comprised of only multiple series' of gifs and images still manages to be one of the most unique and terrifying horror games you can get. In this game, you play as Jeremy Flitzgerald, a security guard who takes the night shift at Freddy Fazbears Pizza (Basically Chuck E Cheeses) and must moniter and defend against about 11 animatronics, armed only with an empty mascots head (Freddy head) and a flashlight.   This game definitely left my feeling very hopeless, exposed, and over all terrified.  This game definitely has more pros than cons  PROS:  Terrifying atmospere Unique take on the horror genre Many eastereggs and secrets for you to discover Intruiging plot and storyline Most of fanbase is awesome Hard difficulty  CONS:  Little to none replay value Cheap jumpscares do get old after awhile Hard difficulty ",
            "review_score": "1"
        },
        {
            "review_text": "this game rules!!!",
            "review_score": "1"
        },
        {
            "review_text": "This one is the Smash Bros. Melee of the three games.",
            "review_score": "1"
        },
        {
            "review_text": "recommend this game for anyone who needs poop inconspicuously placed inside your pants. IGN 10/10",
            "review_score": "1"
        },
        {
            "review_text": "i think its a great game but its a little scary sometimes ",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 2 is great and you can make it even better using Oculus Rift as you feel like you're the security guard",
            "review_score": "1"
        },
        {
            "review_text": "This Game is the sensation of horror ",
            "review_score": "1"
        },
        {
            "review_text": "HElp Me I NeED HElP *Dies* MUM BE LIKE *licks lips* NN NOM",
            "review_score": "1"
        },
        {
            "review_text": "1337/420",
            "review_score": "1"
        },
        {
            "review_text": "Audioque the game.  10/10 would figure out how to beat night 6 again.     YOU SAID THERE WERE 5 NIGHTS YOU LIED!  ",
            "review_score": "1"
        },
        {
            "review_text": "OMG if you hold down on the home screen CD2 you get to night 7 not lying just did it!",
            "review_score": "1"
        },
        {
            "review_text": "It's an awesome game really scary and fun to play. It's really challenging and can som time drive you over the edge but i recommend this game 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, 10/10! I loved it. Really scary. Made me jump out of my seat. Stupid foxy.",
            "review_score": "1"
        },
        {
            "review_text": "im the only person to NOT get a death minigame! other than that this game is awesome i cant wait for the third one!",
            "review_score": "1"
        },
        {
            "review_text": "Night 1 12 AM: Ok. New job. I better get paid for this. Uh ok the phone is ringing. 1 AM: Ok I got a camera and flashlight but WHAT ELSE!?? 2 AM: Got info on this music thingy and a mask. OK wait, wind that thingy. 3 AM: Wait. Where's Toy Bonnie? Oh wow. He likes to stare at me in CAM 4. Toy chica is out there. Oh man I am dead. 4 AM: Well Chica is gone but oh dude. Toy bonnie is in the vents. 30 minutes later... OMG He is looking at me! Get that stupid mask on! 5 AM: Phew. He's gone but.. COME ON! TOY FREDDY IS OUT IN THE HALL! After a bit.. WTH Toy freddy is in here! MASK MASK MASK MASK MASK MASK!!! 6 AM: Woah that was easy and put on mask in time. OK better wait for next night.  All I got so far but will try beating Night 2.",
            "review_score": "1"
        },
        {
            "review_text": "*opens game    *sees toy animatronics    *thinks chica is cute   *wishes you where mobile  *  ♥♥♥♥s[/spoilier] chica in dreams  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is scary and fun but it is seriously HARD AS BALLS. Be prepared to die a lot.",
            "review_score": "1"
        },
        {
            "review_text": "This is AWESOME!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "'Welcome to the Salty Spitoon, how tough are you.' 'How tough am I, I went to Freddys last night.' 'So.' 'And I hugged the old Chica...' 'Right this way sir sorry to keep you waiting.' ",
            "review_score": "1"
        },
        {
            "review_text": "even scarier than the last however i disliked the freddy fazbear suit it can be good at times but very annoying casiue you can't see the timer running out or know when the animatronics are gone. good points, everything else.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is Amazing But Annoying. Finished Night 6 still not ready for freddy!",
            "review_score": "1"
        },
        {
            "review_text": "This game is the bast game and i wold recommend it to everone",
            "review_score": "1"
        },
        {
            "review_text": "Fiove nights at freddy's in a nutshell 'you, a night gaurd have to wind-up a music-box or a puppet wilst 4 old animals 4 new ♥♥♥♥♥[anoynig ones] a ballon kid trying to stop you from keeping the puppet at bay'",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game! Its definitely harder than the first, but is a little bit freakier! If you loved or just liked the first Five Nights At Freddy's, you'll love (or like) this one too!! By the way, if you wanna go to  scottgames.com , its currently offline because of FNAF3!",
            "review_score": "1"
        },
        {
            "review_text": "made me fell off my chair that wasn't cool scott! cool game though",
            "review_score": "1"
        },
        {
            "review_text": "How the mighty have fallen.  Five Nights at Freddy's 1 was incredibly terrifying and quite difficult, but the reason why it was terrifying is that it went to great lengths to build up atmosphere and made it hard for you to know if an animatronic was coming for you until the last minute, and the reason it was difficult is because it would scare you into making frequent mistakes just because you're so nervous. The basic game was actually rather simple, but the framing device made it made it seem hard.  Five Nights at Freddy's 2 seems to have forgotten how to be scary. Where FNAF's animatronics evoked the unintentional creepiness of shoddily-made Chuck E Cheese characters, FNAF 2's new animatronics are shiny and cute and the only thing remotely frightening about them is their malevolence. Meanwhile, the old animatronics have been turned into mangled messes, abandoning the unintentional creepiness for deliberately freakish appearances, but this loses its fear factor very quickly because it just feels like it's trying too hard. What's more, the fact that the Freddy Fazbear head is a trump card against all but two animatronics -- and a trump card you can never ever not have available -- means that the two animatronics you can't use it against are the only ones that really matter, and everyone else is just annoying.  Now, FNAF 2 is certainly very difficult -- that part hasn't been lost. But it's difficult in the wrong way. FNAF 1 was hard because it stressed you out into making mistakes. FNAF 2 is hard because it gives you so many different things to manage and pure luck alone will determine whether or not you can manage them. A charitable interpretation of this might suggest that it's trying to evoke a different kind of horror: the futility of our illusion of control in a world where so little actually is in our control, a world where any one of us could do everything right in life and still get killed by a drunk driver or something out of nowhere tomorrow. But I'm not feeling charitable, I'm just feeling frustrated, and besides that kind of horror doesn't fit well with anything else in the atmosphere of the game, so no, it's just making the game hard for the sake of being hard because it wasn't scary.  Get this game only if you REALLY want to know the story of the series, because the one good thing it does is expand on the lore. Outside of that, it's a pretty bad sequel (or prequel, as the case may be) to the original.",
            "review_score": "-1"
        },
        {
            "review_text": "The game shoots itself in the foot by adding the music box into the mix. There is no need to check the other cameras, just wind up the box, than focus on the two vents/door. You will notice yourself repeating the same process over and over again... This WILL put off some people. It personally killed all the tention for me.   Other than that, the game does exactly what it wanted to acheive. Visuals and all are on point. The addition of the other animatronics/hidden mini games is also a nice touch.   I just wish Foxy wasn't so lame in this game...",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is One Of The Best Games I Have Ever Played, Please Make A Sequel, Scott! 11/10",
            "review_score": "1"
        },
        {
            "review_text": "i have this game on a other computer but the story is awesome and its has great gameplay cheap and scary :D ",
            "review_score": "1"
        },
        {
            "review_text": "awesome game !!!!! i just made trough the first night in 1 try !! whoooo!!!! ps : i would like if the animatronics come more a life, like foxy in Five Nights At Freddys 1. anyway its a awesome game Well done scott !!!",
            "review_score": "1"
        },
        {
            "review_text": "Stress and tensions doesn't come through scares and atmosphere like the first FNAF. With all the extra animatronics thrown in, this game feels more like a time managment game than its intended horror genre.",
            "review_score": "-1"
        },
        {
            "review_text": "Scott Again Thanks For Fnaf",
            "review_score": "1"
        },
        {
            "review_text": "I got the game after reading only 3 reviews so i didn't run into any spoilers. the new game style is so much more difficult than the original, the fact you have to use your torch battery to see certain places within the cameras, otherwise you cant complete it, on top of that the juke box you need to wind up, and the 2 foxys?! the thing that makes this game so amazing, is the fact that you are scared by the jumps because you are concentrating on the actual game so hard, not expecting one of the countless enemies to attack you while you are checking the cameras, or winding up the juke box. this game seriously suprised me, its difficult yet so fun.  if you want a game that suprises you with many jumpscares so much that you cant sleep at night without a light and makes you avoid your teddy bears for life. and a game that makes you naturally lean backwards from your computer when you load it. You found it.  Looks like I'm not bringing my kids to Chuck E' Cheese when i get kids.",
            "review_score": "1"
        },
        {
            "review_text": "*honks poster's nose*  For being a franchise that has gone on a bit too long (seriously, and RPG game is coming out now?) this game still stands out. Its not easy nor hard, creepy nor holy balls scary. It has a very good balance, and in my opinion, is the best in the whole series. If your a fan of horror, or like curling yourself up in a ball in fright, this is a game you should try out.",
            "review_score": "1"
        },
        {
            "review_text": "i think the game is amazing for the price  scott has done an amazing job",
            "review_score": "1"
        },
        {
            "review_text": "even though it has a 2 slapped on it this game is a prequel to it's predecessor Five Nights at Freddy's 1 and takes place in the year 1987 a few days before the bite of 87 that phone guy talks about and in terms of animatronics there are the five original animatronic's: Freddy Fazbear, Chica, Bonnie, and Foxy in addition to a few new animatronics: Toy Freddy, Toy Bonnie, Toy Chica, Mangle, BB (also known as Ballon Boy), and The Puppet (also known as the Marionette) and like the original game you have to keep an eye on the animatronics and with the Puppet you have to wind up a music box via the camera on Prize Corner. The game is probably at least 5 times harder then it's predecessor and the only difference other than the animatronics and game mechanics: freddy fazbear mask, and four different flashlights and no doors. the game is a great game even though it is harder than the predecessor. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥ game, can't believe I bought it. But I was glad it was during a sale or I almost paid full price for such a ♥♥♥♥♥♥ game. Bought it to see what was all the hype about. Overrated as hell. Only good thing is it's unoriginal and it a pschological horror.",
            "review_score": "-1"
        },
        {
            "review_text": "A bear,,chicken,bunny walk around and you're suposed to put the mask on 10/10 best game ever!!",
            "review_score": "1"
        },
        {
            "review_text": "I reccomend this game and the story unless you don't want to waste a lot of time on the game like I did......................... BUT ITS AMAZING",
            "review_score": "1"
        },
        {
            "review_text": "i really like fnaf 1,2 and 3 but it won't let me play 2 and three. so whoever is reading this plz tell how to fix fnaf 2 and 3 thx.",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 2 is a fantastic prequel yes prequel to a fantastic game and at $8.00 you couldn't ask for better than that now it is pretty luck based especially on later nights BUT it's not entirely luck based there is a lot of skill needed to but it's not just the gameplay that makes this great its also the story too.",
            "review_score": "1"
        },
        {
            "review_text": "Guy looks around on steam store sees fnaf2. And decides to buy it but logic says don't, he says f***k you logic. Gets game plays it, forgets to wind up music box, puppett kills him causes heart attack. 10 years later sees it in library says eh i can take it this time. puts down camera only to see an anamatronic fox jump in his face and rek his s**t. great job Cawthon can't wait for fnaf4!",
            "review_score": "1"
        },
        {
            "review_text": "it's a game where you can't physically blink and also must be really quick. blink once and you're dead  10/10 for more nightmares",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddys 2 improves on the first game in everyway, except for the fear factor. This game is much more challenging than the original considering there are 10 animatronics to look out for as well as the removal of the doors. The lack of doors will make the game more challenging however that wears off once you memorize all the patterns you are supposed to know. If the original game did not scare you chances are this won't leave you with a feeling of dread as you play. Despite the fact that the game is not very scary it is still a damn fine game which is marginally scarier than the original. I can reccomend this title to everyone except for people who did not enjoy the first game. I'd say it is a 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "this game is a good indie game not like iny other horror indie games you might get scared a first,like me but you'll get used to it",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game if you can buy it right now do it!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 i was redy 4 freddy and also redy 4 not freddy  wasnt redy 4 bb rip in peices  random persons last will and testiment  kill bb no mattr whut -Person  i need to get a life",
            "review_score": "1"
        },
        {
            "review_text": "just the best game ever",
            "review_score": "1"
        },
        {
            "review_text": "So this game is amazing. They did fix all the bugs.If the game was a potato it would be a good potato .",
            "review_score": "1"
        },
        {
            "review_text": "What an impressive game. Although I do not have this game via Steam, I have it on mobile. This game greatly adds to the story line and will not disappoint.",
            "review_score": "1"
        },
        {
            "review_text": "did anyone notice it's the same phone guy from the first game but he died on night 4 (confused much)",
            "review_score": "1"
        },
        {
            "review_text": "GREAT improvement to the franchise. new animatronics, new jumpscares, and even more STORY is revealed throughout the gameplay.fnaf 2 is love. fnaf 2 is life.",
            "review_score": "1"
        },
        {
            "review_text": "████ ████████ ███████╗ ███╗ ███╗ ████████╗  ██║ ═██╔══╝ ██╔════╝ ████╗ ████ ██╔════╝  ██║ ██║ ███████╗ ██╔████╔██ █████╗   ██║ ██║ ╚════██║ ██║╚██╔╝██║ ██╔══╝   ████ ██║ ███████║ ██║ ╚═╝ ██║███████",
            "review_score": "1"
        },
        {
            "review_text": "AWSEOME JUMPSCARES",
            "review_score": "1"
        },
        {
            "review_text": "I AN STUCK ON NIGHT 3! IT IS SOOO ANOYING",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you wanna try out the new refund policy.",
            "review_score": "-1"
        },
        {
            "review_text": "why does fritzz smith say it is summer and he speaks english ?",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, but very hard.",
            "review_score": "1"
        },
        {
            "review_text": "Is very stressful. I'm stuck on Night 3, keep getting killed by Foxy or the Puppet by BB. I think I see why everyone hates him now.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pure evil and i love it!!! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "i know i only have 0.2 hours of gameplay, but this is a great game! i extremely recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Better and more terrifying than the first! Great job!!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a great sequel to the first game. The only issue I have with the game play is that having the music box forces you to look at only that camera and removes any chance of checking any of the others because of how fast it goes out in the later nights.",
            "review_score": "1"
        },
        {
            "review_text": "I RECOMMEND THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "Great game but the book was better.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best indie games i have seen and played in a very long time (including FNAF1) very creative and unique, love all the animitronics and suspense! i recommend this game to Anyone and Everyone!",
            "review_score": "1"
        },
        {
            "review_text": "Scary and difficult! Old Bonnie keeps killing me on night 3! He'll be in the hall, I'll put my mask on, he'll go away when I take the mask off, I'll get on the cameras to wind up the music box, and when I exit the cameras, he'll be IN MY OFFICE! Then, I put the mask on RIGHT AWAY, and he attacks me anyway!",
            "review_score": "1"
        },
        {
            "review_text": "There is 8 plushies on the table - 5 because of old animatronics 8-5= 3 FNAF 3 COMFIRMED!!",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME WILL SPOOK YOU MORE THAN IT'S PREDECESSOR. TOO MANY ANIMATRONICS TO LOOK OUT FOR. 11/10  Just a warning though, this game does have a lower resolution. So you will see back bars to your left and right.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed the first game, it's most likely you'll enjoy this one. More animatronics, more rooms, and interesting backstory that's sure to fuel the fan-theories. However, it suffers the same problem as the first. Once you figure out the pattern, it's very easy to win.",
            "review_score": "1"
        },
        {
            "review_text": "Played this game while on Skype with my girlfriend, she heard me scream very high",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 2 welcomes you to the grand re-opening of Freddy Fazbear's Pizza! It's new, improved, and more stressful than ever...  Being a prequel, the establishment has some substantial differences to the first games venue.  The company has created new, smarter versions of the classic Fazbear cast members, the building has more floor space and attractions to keep an eye on, and an open-concept layout with no thick metal doors to hide behind and feel safe.     Gameplay",
            "review_score": "1"
        },
        {
            "review_text": "This game is for autistic ♥♥♥♥♥♥s.",
            "review_score": "-1"
        },
        {
            "review_text": "This Game is Great There Are Many Things To Do in The Game Play the nights custom the nights collect plushies there are many things to do in this game and thats why i am recomending this game",
            "review_score": "1"
        },
        {
            "review_text": "I like this game ever sine it came out but im having some issues on the game where the game is not fully covered on the screen. Also it takes me out automatically during the game. please fix :(",
            "review_score": "1"
        },
        {
            "review_text": "It was very creepy in it's own unique way, and scared me each time. I love it!",
            "review_score": "1"
        },
        {
            "review_text": "2 SPOOK 4 ME  NIGHT 6 OP",
            "review_score": "1"
        },
        {
            "review_text": "great indie game. if you like inmanimate objects coming to life with a few jumpscares this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Doors? Who needs doors? Vents are all the ra-GETTHEF***OUTOFMYOFFICEYOUSTUPIDDUCK  And yes I know! Chica is a chicken.",
            "review_score": "1"
        },
        {
            "review_text": "This game ♥♥♥♥ing sucks",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing. If you are thinking of getting this, get it. Right now. Go on, do it. It's one of the best horror game AND sequels of all time. If you thought the first was good, you'll love this.It is definetely the best Indie game of the year, in my opinion that is. 9.5/10 I rate it. It would be 10/10 if the camera didn't glitch so you couldn't put it down sometimes. But other than that, it's brilliant!",
            "review_score": "1"
        },
        {
            "review_text": "Best Game Ever Since Slender Man. FNAF 1 Was Good But This One Is So Much Scarier If You Dont Have It I Recomend It Because It Is Amazing.",
            "review_score": "1"
        },
        {
            "review_text": "OMG I LUV this game but 1 thing was removed - THE hold mouse on nose than c d + - ITS GONE I think mario would be - ohh very scary-",
            "review_score": "1"
        },
        {
            "review_text": "It's a very good take on the horror genre, like most people say it reminds them of Night Trap, and it does. It puts you in position of a Night Gaurd in watch of the Pizzeria from 12am to 6am. The main thing is though, the animatronics (those character's/robots you'd see at Chuck E Cheese's) move around at night.  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ In this addition to the FNAF series, you are left with no doors and 3 areas in which a character may get to you. The Hall, and 2 Airvents on your left and right, and you only a have lights to use. And if one of those characters may get to your office or by a vent, it's best to throw on that mask that they give you to fool them. You have a flashlight, which is the only thing that can run out of power, but it may not seem crucial, but trust me, it is VERY crucial to have power for it. In all, it's a great game, it is just very frustrating, especially Night 6, which I can't pass...",
            "review_score": "1"
        },
        {
            "review_text": "awesome game !!!!! i just made trough the first night in 1 try !! whoooo!!!! ps : i would like if the animatronics come more a life, like foxy in Five Nights At Freddys 1. anyway its a awesome game Well done scott !!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is hands down the most terror filled game I have ever played. The suspense and shock value make the first game look like an MS paint flash game. This is the best horror game ever made. But since this is a proffesional review I will make a pros and cons list.  Pros Its hard and fun. Very original compared to the first one. Amazing considering it was a couple months work. Full of mystery and hard to follow AI. Great cutscenes.  Cons I guess it kinda gets too hard?   ",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ myself on the first night 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Stress Simulator 2014   But seriously doe this game is so ♥♥♥♥in stressfull can't even get trough night 1 lmao  Edit: Managed to get trough night 1.......barely alive",
            "review_score": "1"
        },
        {
            "review_text": "best scary games ever  ",
            "review_score": "1"
        },
        {
            "review_text": "The new anamatronics make the game have a lot more variety, and enjoy to kill time(not be killed i hope).",
            "review_score": "1"
        },
        {
            "review_text": "Played about 11 minutes (2-3 mins after initial phone call) and had something jump at me... 10/10 Will play again....in morning",
            "review_score": "1"
        },
        {
            "review_text": "Im gonna build a house with all the bricks I ♥♥♥♥ out!",
            "review_score": "1"
        },
        {
            "review_text": "For every Fnaf game they make a piece of humanity disappears into the mist the fnaf♥♥♥♥ have made.  Learn, and stop buying these milked series.",
            "review_score": "-1"
        },
        {
            "review_text": "He comes back...he always does....",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. I screamed and scared my Mom when Foxy got me :P",
            "review_score": "1"
        },
        {
            "review_text": "I'm frightened. I'm very frightened. New BOnnie has scared the ♥♥♥♥ out of me already. Chicka has got a hot new bod and it's kind of intimidating. And that jack in the box. I have jumped several times already. mommy. ",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot of BOOO's - phone guy",
            "review_score": "1"
        },
        {
            "review_text": "As a person who enjoyed parts of the first game but found it to be overall lacking in actual horror, I am glad to say Five Nights 2 exceds the original in almost every way. While I still don't think the game is true horror, it is still fun to play and does a good job of creeping you the player out.   READY FOR FREDDY...  To those who played the original game and enjoyed it, you will be glad to know that much of what made the first game so popular is present in its sequel. You will once again find yourself as a security guard working the night shift at the newly re-opened Freddy Fazbears's Pizzaria. Much of the gameplay from the first game has been carried over, but with enough changes to make it feel new and not just a rehash of the original. You have a little tablet thing you use the check cameras and keep track of the animatronics as well as a few lights to check the area around you. The first thing you will notice right off the bat is you have no doors this time around, this time you are sitting in front of a wide open hallway and you must use a flashlight you have to light it up in order to check for enemies. There are also two air ducts on either side of you that you must check, giving three possible ways to get in in total. Another thing to note is that there are now six animatronics. Double the Freddy, still not ready. The last new addition is a music box that you have to make sure does not run out.   WHO GOES THERE?  As fun as the game is, it does have a few problems. For example, after night one the charge on the music box begins to drop faster and faster which adds to the tension. The problem is, because you have the music box to deal with as well as checking the vents and the hallway in front of you, you might as well keep your camera set on the room with the music box. The rest of the cameras become pretty much useless. And then there is the damn balloon boy, who will enter your room and start laughing without end thus rendering your lights useless and calling the attention of all of the animatronics (mainly Foxy). As of this moment I have no idea how to deal with the balloon boy, but he is super annoying and only serves to frustrate me instead of making the game more scary. The moment he appears in your room you might as well start over, because there is just no way of dealing with him that I am aware of. Not only that, but the game suffers from problems that the first game had as well. Because you're pretty much doing the same thing over and over again, there is a lack of replayability for you can only do the same thing over and over so many times before it gets dull.   DARK DESCENT...   All in all, Five Nights 2 is a fun game that surpasses the original in almost every way and should offer a few good jumps to those that play it. It might not be the best horror game ever, and it doesn't even come close to such masterpieces as Silent Hill 2 or Amnesia, but it does show that the horror genre still has life left in it and I will take it over games like Resident Evil 6 any day.  Peace and cupcakes,  Pyrin",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend this game im on night 6 its hard but soon i will be able to beat it :P",
            "review_score": "1"
        },
        {
            "review_text": "love tf2 so much tf2 5/5 play it play it play it",
            "review_score": "1"
        },
        {
            "review_text": "scary!",
            "review_score": "1"
        },
        {
            "review_text": "cool cool",
            "review_score": "1"
        },
        {
            "review_text": "Okay my full review!  Fetures : -Scary game! -Runs okay -More animatronis, more nightmares! -Hidden secrets   Things that didn't work out : The jumpscares were okay but they could've been better.  Why you should spend your money on it : If your trying to not sleep for the night and you're a little freaked out play this game, it's sure to give you the creeps for a little while.  What I enjoyed : The scares in this game are way better when you go through the story. When you see a halusonation, if you stare at it for too long your game with crash. -Animatronics were very balanced. The freddy mask was a good idea, i also liked how some animatics wouldn't be affected by it.  What I think should be added : You should still need to check up on Foxy. I mean, in the first game everyone is checking on foxy, in the sec. everyone is winding the music box. We need some kind of challenge. :P  Difficulty : 5/10 Rating : 9/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Night 1: 12 AM: Wait a second did Phone Guy say Summer Job its november. 1 AM: okay... quite boring no one moved 2 AM: BORRINNGGG 3 AM: OH GOD SOMEONE MOVED DDDD: Wait no one did... OH NO SOMEONE DID 4 AM: BONNIE STAY AWAY FROM THOSE VENTS 5 AM: FREDDY GO AWAY!!! 6 AM: omg that was easy (not)     Night 2: 12 AM: More blabber from Phone Guy 1 AM: Balloon Boy Moved, I can't use my flashlight to look in the hallway because toy chica and maybe foxy were in the hallway  (jammed esc key and scarequit)  10/10 would do 20x20 mode when I beat night 7",
            "review_score": "1"
        },
        {
            "review_text": "I saw markiplier play this said it can't be that bad.... got to night number 2 gets worse night number 3 even worse.... can't get past night 4",
            "review_score": "1"
        },
        {
            "review_text": "this game is much better than the first game thanks scott for this wonderfull games ",
            "review_score": "1"
        },
        {
            "review_text": "Again we got another game!. Now its time to ♥♥♥♥ your pants harder",
            "review_score": "1"
        },
        {
            "review_text": "I quit because bonnie made it into my office and I was worried so I quit the game. ",
            "review_score": "1"
        },
        {
            "review_text": "its very scarey even though its old it still scares me",
            "review_score": "1"
        },
        {
            "review_text": "still cant sleep since the first one. IGN 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I CANT RUN GAME  ",
            "review_score": "1"
        },
        {
            "review_text": "Harder than the first game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Nothing new, srsly. The new content of FNAF2, 3 or 4 do not justify a new game to get released - this is more of a waste of money than buying all the new CoDs.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game! It's freaking scary and freaking hard! If you like jump scares then get this game!",
            "review_score": "1"
        },
        {
            "review_text": "stupid. its the same thing.",
            "review_score": "-1"
        },
        {
            "review_text": "This job is still better than working night stock at a supermarket.",
            "review_score": "1"
        },
        {
            "review_text": "Great horror LOVE IT!! INtense But Fun to play in the dark. Just remmeber Focus Is Key To 6 A.M.",
            "review_score": "1"
        },
        {
            "review_text": "Scott you have done it again!",
            "review_score": "1"
        },
        {
            "review_text": "its a grate game....if it wouldnt lag on my alienware laptop. why does it do this? it shouldnt do this",
            "review_score": "1"
        },
        {
            "review_text": "It is the best game i every seen thank you, your awsome :) thank you and i was waiting so long for the this",
            "review_score": "1"
        },
        {
            "review_text": "okay okay there is nothing that makes me ♥♥♥♥♥ more than a panty wearing duck that comes into your face and kissies you making you almost have a heartattack",
            "review_score": "1"
        },
        {
            "review_text": "AWSM GAME how annoyed i am of how it IS A FREAKING PREQUEL!!!!!! AND NO MULTIPLAYER. How come they said it was coming next year? -L- IT HAS PROBLEMS OF HOW TO INTERACT WITH FOXY BECAUSE NO INGAME MECHANICS WILL WORK ON HIM!!!!! -",
            "review_score": "1"
        },
        {
            "review_text": "I never made it past night 1. when one of them move i quit, but if I was brave enough I will quit when all of them move, or when one is outside of my vent, or in the hall way. when Chica killed me I was so scared that I didn't leave the chair for 20 minutes.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "hi scared ♥♥♥♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Play The Tualin",
            "review_score": "1"
        },
        {
            "review_text": "BEST LAVATIVE I HAVE EVER USED!!! 11/10 WOULD CRAP AGAIN!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "it is so ♥♥♥♥ing fun!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game, what can I say about it... I love it, the first night, like the first game is easier than the rest, due to those nights being tutorials, and as the nights progress, it gets harder, and those old animatronics are just scary when they pop out, especially Bonnie... no face. The Toy animatronics are creepy as hell even in their jumpscares.  I highly recommend this game for people who need to have lightning-fast reflexes!  Yet again Scott, you have surprised me, thank you so much.",
            "review_score": "1"
        },
        {
            "review_text": "1. Buy game 2. Find spongebob quote in reviews 'How tough are you?' 'I will have you know that I went to freedy faz bears pizza and back... with no doors.' 'Come right in sir!'. 3. Passed night one think I am the bomb 4. Were did old bonnie go? 5. NOPE NOPE NOPE NOPE nope NOPE NOPE nope nope nope NOPE NOPE. little nope.... BIG NOPE... little nope. 6. Go hide in a hole untill my man hood is regained.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "The first game scared me when I watched a video on it. I vowed to never play it, but I did. Oop. It ended up being my favorite game of all time. Everything about it was perfect! Then a sequel was announced. I was a bit worried because I know how they can be. After playing this game I can safely say it's better than the first. The gameplay is smoother and the mechanics make it really interesting. My only issue (same with the first game) once you hit Night 5 or 6 it's not scary anymore. Really FNAF2 is a strategy game. Anyone who loves horror or strategy games in general you will love it  100 red pikmin/12",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as the first. But still a good game. Controls are haywire, but might be to the player advantage. A lot to handle but the game might be pushing the envelope. Good to play.",
            "review_score": "1"
        },
        {
            "review_text": "It was decently scarey and erie but it's pushing us way to hard  other than that it was arealy good game",
            "review_score": "1"
        },
        {
            "review_text": "i can't get past the 4th night",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have ever played! Its an awesome and addicting game to play! I recommend this game to everyone!",
            "review_score": "1"
        },
        {
            "review_text": "Hello! Welcome, one and all to the new and improved, Freddy Fazbears Pizza!! We hope you enjoy your stay! What can go wrong? Five Nights at Freddy's 2 is a fantastic sequal to an already amazing game! You, a security guard, are joined by the new cast of Freddy, Bonnie, and Chica, all new, and super kid friendly...by day. But, by night, these characters get a bit quirky. They think you are a metal endoskeleton, without it's costume on. Since thats against the rules, they only want to get you dressed up in your suit and get you ready to play on stage...in the process, killing you. The solution? Fazbear Entertainment has given you, an empty Freddy Fazbear head! Also armed with a flashlight to keep any intruders out. But, The new characters are not alone...They are joined by their old counterparts. Can you survive five nights at the new Freddy's?",
            "review_score": "1"
        },
        {
            "review_text": "This game runs smoothly and it does add some challenge. Definitely recommended for anybody who likes scary games :)",
            "review_score": "1"
        },
        {
            "review_text": "Requires the holy bible and holy water to properly play this game.",
            "review_score": "1"
        },
        {
            "review_text": "20 minutes in and I almost cried",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME WILL SPOOK YOU MORE THAN IT'S PREDECESSOR. TOO MANY ANIMATRONICS TO LOOK OUT FOR. 11/10  Just a warning though, this game does have a lower resolution. So you will see back bars to your left and right.",
            "review_score": "1"
        },
        {
            "review_text": "Played for 5 minutes. Won't be playing again for 5 months. Fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "This prequal-sequal was even better than the first game. Harder, scarier, but better. There are more rooms, more animatronics, and NO DOORS. Along with the music box you have to wind and the hallucinations you have to avoid, it is over all more difficult than the first game. But, I do highly recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "Thought this wasnt scary till fox jumped to hug me.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Alot more stressfull then the previous one! 8/10",
            "review_score": "1"
        },
        {
            "review_text": "wow, i though there wasnt gonna be that much different from the first, boy was i wrong, double the charecters, double the scares, double the s****, its great, worth the £5, oh and you can defo tell chica is female, just sayin",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, scary for the first moments but eventually I got used to it. Really fun can be frusterating at times, but all goes well eventually.",
            "review_score": "1"
        },
        {
            "review_text": "Most defintly. After playing 25 minutes of it, it is so more nervracking then FNAF has ever been, More better and lots of goosbumps and chills up my spine! Gameplay, absolutley amazing, and i'm soooo happy they added (spoiler) fReDdyS pArTy NoSe! On the poster to your left, click freddys nose then, POP! And no doors have made people very frustraded and angry, but whats the diffrence between (spoiler, again) a flickering light to keep foxy and foxy 2.0 away, plus the Freddy mask gaurding you from others, ya, also the music box is the biggest worry in the WHOLE GAME (Atleast what  I think) it is very overwhelming, and yes, its very diffrent, but let Scott have his own mind! He can do, what he wants to do with his games, of course if he gets a good suggestion, he'll probably put it into a update. But I like changes with new sequels, and prequels. And SOOOO many people are like 'ITS NOET A SEQUOOL!' Yes it is people, Scott said so on his own website! (  www.scottgames.com  ) But, if you are finnaly ready for Freddy, (of course no one is) then here you go! ($8) I reccomend it, and good job Scott!",
            "review_score": "1"
        },
        {
            "review_text": "Introducing Five Nights at Freddy's 2! All the fun of the original with even more nope! Including classics like: -'Where did the bunny go?' -'The duck is gone too!' -'Seriously, where are they?' -'OH MY GOD THEY ARE IN THE ROOM!'  -'BRRRRRAAAAAAAAAAAAAAAAAAA' and of course: 'Crying' Order now and we'll throw in the free cardio exercise DVD: 'Get me the ♥♥♥♥ out of here!' while supplies still last! Order online at:  ijustshitmypants.com  or call our toll free number: 1-800-ARE U RDY. ",
            "review_score": "1"
        },
        {
            "review_text": "I thought I would be ready for Freddy this time. I was wrong.",
            "review_score": "1"
        },
        {
            "review_text": "*honks poster's nose*  For being a franchise that has gone on a bit too long (seriously, and RPG game is coming out now?) this game still stands out. Its not easy nor hard, creepy nor holy balls scary. It has a very good balance, and in my opinion, is the best in the whole series. If your a fan of horror, or like curling yourself up in a ball in fright, this is a game you should try out.",
            "review_score": "1"
        },
        {
            "review_text": "No Doors, No Lights, No place to run, But one place to hide.  Five nights at freddy's 2 is a amazing action packed fast paced horror game that has you working five nights as a night security gaurd at a chucky chese style resturant, but the animotronics are out for blood.  Theres Freddy, Chica, Bonnie, Foxy (or mangle), and there broken counter parts, Withered Chica, Withered Bonnie, Withered Freddy And Withered Foxy The Pirate Fox. There are also side animotronics such as, Balloon Boy, The Puppet, and the ghostly golden freddy (or fredbear).  As you start the game, you are greeted to a long hallway in front of you, and two vents on the left and right. You can use the cameras, and you need to wind up a music box, or the beforte metioned puppet will come and decapatate you, to keep the rest of the animotronics at bay (excluding Foxy) you have a head that belongs to the mascott of the pizzarea, Freddy Fazbear. That fools the animotronics into thinking your one of them.  Comes night 2, you flash your light into the hallway to see Foxy. To take care of this pirate ♥♥♥♥♥♥♥, you have to flash your light at him when he appears in your hall, easy enough right? Thats when Balloon Boy comes in, if he gets into your office (witch he can do fairly quickly) he disables your light, witch lets foxy lunge at you and remove your brain.  Story Spoliers Ahead, this is your warning  In this resturant, a man found a unused golden freddy suit in the back room. The man lured five innocent children into the back room using the suit, only to kill them. to hide there bodies he uses the animotronics in the backroom, and the golden freddy suit. After this, the toy animotronics (having facial reconition systems) reconize the criminal and try to kill him, but the man messes hacks the toy animotronics into thinking the night gaurd commited the crime, the children in the suit think your the killer as well, now all of them want your head.  The puppet however is a kid that was murdered at the first ever resturant witch was closed down after.  My opionion: Get this game!",
            "review_score": "1"
        },
        {
            "review_text": "at the end can you make it 11/13/2015 instead of 11/13/1987 it doesn't make sence the old animatronics look like they aged 35 years and its new not old improved but still I love the gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Heart Attack Simulator 2015",
            "review_score": "1"
        },
        {
            "review_text": "I love how the full game is out already! I'm still trying to develop my strategies, and I'm stuck on night 2. BUT BUY THIS GAME! HOLY COW IT IS WORTH IT!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Most defintly. After playing 25 minutes of it, it is so more nervracking then FNAF has ever been, More better and lots of goosbumps and chills up my spine! Gameplay, absolutley amazing, and i'm soooo happy they added (spoiler) fReDdyS pArTy NoSe! On the poster to your left, click freddys nose then, POP! And no doors have made people very frustraded and angry, but whats the diffrence between (spoiler, again) a flickering light to keep foxy and foxy 2.0 away, plus the Freddy mask gaurding you from others, ya, also the music box is the biggest worry in the WHOLE GAME (Atleast what  I think) it is very overwhelming, and yes, its very diffrent, but let Scott have his own mind! He can do, what he wants to do with his games, of course if he gets a good suggestion, he'll probably put it into a update. But I like changes with new sequels, and prequels. And SOOOO many people are like 'ITS NOET A SEQUOOL!' Yes it is people, Scott said so on his own website! (  www.scottgames.com  ) But, if you are finnaly ready for Freddy, (of course no one is) then here you go! ($8) I reccomend it, and good job Scott!",
            "review_score": "1"
        },
        {
            "review_text": "Introducing Five Nights at Freddy's 2! All the fun of the original with even more nope! Including classics like: -'Where did the bunny go?' -'The duck is gone too!' -'Seriously, where are they?' -'OH MY GOD THEY ARE IN THE ROOM!'  -'BRRRRRAAAAAAAAAAAAAAAAAAA' and of course: 'Crying' Order now and we'll throw in the free cardio exercise DVD: 'Get me the ♥♥♥♥ out of here!' while supplies still last! Order online at:  ijustshitmypants.com  or call our toll free number: 1-800-ARE U RDY. ",
            "review_score": "1"
        },
        {
            "review_text": "I thought I would be ready for Freddy this time. I was wrong.",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is So Scary And SO HARD AT THE SAME TIME AGH MY HEART HURTS.",
            "review_score": "1"
        },
        {
            "review_text": "I loved the first one even though it was considered it too easy. This game however is quite hard but the mechanics of the game are much improved as well as the 'scare' factor. It's simply amazing for exactly what it is!",
            "review_score": "1"
        },
        {
            "review_text": "'Sent a guard to watch all night,  Watch all night,  Watch all night,  Send a guard to watch all night,  My fair night guard~'    My sick twisted fascination for Five Nights at Freddy and a friend daring me to play this game have brought me here to play this game...  and what I must say to those who are thinking of playing FNAF 2 instead of the first one know this: THIS GAME IS MUCH MORE HECTIC AND DIFFICULT THAN IT'S PREDECESSOR, NIGHT ONE LEFT ME IN A SHIVERING STATE OF PANIC, CLICKING EVERYWHERE IN THE VAIN HOPE OF KEEPING THEM OUT!   GO AWAY CHICKA!  BONNIE! BONNIE? BON BON! DON'T YOU DARE GO INTO THAT VENT  FREDDY? OH WOULD YOU FAZBEAR OFF?  NO, GOTTA REWIND THAT MUSIC BOX!  GAAAAAAAAAAAAAAAAAAH!!!  *6 AM jingle plays*  oh hey it worked!  *Night 2*  ....  *closes game to write this review*",
            "review_score": "1"
        },
        {
            "review_text": "Have never experienced anything more stressful in my life.  Worth the soon-to-be broken esc key and tears 10/10",
            "review_score": "1"
        },
        {
            "review_text": "That's like fun horror Really Scary me 0o  ^^ ",
            "review_score": "1"
        },
        {
            "review_text": "I have been following Markiplier on YouTube for quite some time and was really interested in this Five Nights at Freddy's, then I saw he loaded up FNAF2, which seemed to hold more ominous and unsettling tones...Well, I downloaded the game last night and EVEN though I KNEW what was going to happen; anxiety set in moments after playing the game.  Midnight: Answer the phone...guy goes on his spiel. 1am: Everything is still where it needs to be... 2am: Oh no, where'd the bunny go?! Why can't I flick my lights down the- OH HII!! *starts having seizure flashing light at Foxy* 3am: Okay...he's gone. Wait, what's in the vents!? Oh HE'S ALREADY HERE!! *throws down Freddy face as Bonnie passes through; anxiety increases; music box alert flickering* 4am: Oh c'mon! Two more hours, oh the music box! Noo! *winds up music box; put down screen, sees Foxy and Chica* OH NOO! OH NO!! *flashes flashlight; down to one bar* 5am: Almost there...The balloon kids in the vents...I can hear you! *starts freaking out* OH! FOXY'S BACK!! *freaks out; hits alt-tab; frantically brings the game back up; clock ticks to 6am*  Me: OHH! I did it! I did it! Now...I can't play anymore. *cries to friend and makes him take over*  Long story short: Even though I knew what to expect, the noises and unsettling animatronics meandering the empty halls really gives this game a wonderful feel. I ended up making it to the 3rd night...but old Bonnie doesn't seem to like me very much. A game worth playing if you want to freak out yourself or your friends.",
            "review_score": "1"
        },
        {
            "review_text": "Didnt think it was possible, but they made Foxy an even bigger D***",
            "review_score": "1"
        },
        {
            "review_text": "I think I need another cup o coffee... I can't sleep... My reaction to this game... BEST GAME EVAH!!!!!!!!!!!!!!!!! KEEP UP THE GOOD WORK ",
            "review_score": "1"
        },
        {
            "review_text": "i love it scot is not paying me weed to say this thumbs up yaaaaaaaaaaaaa",
            "review_score": "1"
        },
        {
            "review_text": "Ok i never got past Night 3 on the FNaF 1, but after playing 20 minutes of this new installment i can say IT'S SOOOOO MUCH HARDER.   It may say i have 3 hours of gametime, but most of that is sitting in the menu reading guides about the game.  WHY IS IT SO HARD YOU MAY ASK?  1. There are waaaayyyyy more things to worry about such as: Music Box to keep the Marionette from owning your booty. 2. It starts out the same except that Freddy can leave on night 1. 3. BB STOPS you from using any kind of lights. 4. Revert to three. Foxy only stays away if you FLASH him with lights. 5.No Doors(This isn't that bad because of the freddy mask)",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome it. No game has even come close to the amount of sweat this game has put on my Logitech G700! I have never played a horror game that has given me this much stress. Thank you for this amasing game.",
            "review_score": "1"
        },
        {
            "review_text": "you have to get this game its amazing packed with horror and thriller",
            "review_score": "1"
        },
        {
            "review_text": "Installed game, beat night 1 and thought I had the system beat. Night too foxy made me ♥♥♥♥ my pants.....haven't played since!",
            "review_score": "1"
        },
        {
            "review_text": "DISCLAMER : THIS REVEIW IS FOR THE FIRST FNAF GAME!!! NOT THE SECOND. Five Nights At Freddys is a game that will have you bitting your nails as soon as start your first nightshift as a secrurity guard at the fictional Freddy Fazbear Pizzaria. The games controls are simple, and easy to pick up, and ulike Five Nights At Freddys 2, (which i will talk about soon) You only use the mouse. This keeps things extremely easy, and makes i so that you don't have to mash keybored buttons and look down from your moniter at the same time, which is something i hate to do in horror games! The overall enviornment of the Pizzaria is nice, detailed, and creepy at the same time. (like if you were to walk into a chuck-e-cheese during a thunderstorm at night). This sets the whole tone of the game and really makes you want to get up and explore. This brings me to my next point, as far as we know now, Five Nights At Freddys 3 (which at the moment is in steam greenlight) will maintain the same formula as the last 2 games, the game is a point and click game, wchich means you cant get up and move around. Yes, your stuck sitting down and the mouse is your only way of exploring, by checking the cameras in the pizzaria of course. Is this such a big deal anyway???? In most other popular Horror games that have been a major hit over the years, have been a point and click, but given you the option to move around in a 3D enviornment. An exapmle could be Slenderman. I think the formula of the game works well, and that you dont have to worry about what is behind you! it also just kind of lets you focus on whats around you in your inviornment, and for me boosts my consentration knowing that i dont have to worry about something chasing me or me having to move around to collect things or explore different places. Anyways enough about the machanics, Now to the big point : Is it worth the 5 $ it is for sale at now??? Ok yes, the price was around 3 $ at some point late last year but they didnt raise it so much that it is ridiculus. For the quality and detail packed into the game, and the replayability, Annnnnnnnnnd the fact that it is super creepy and frightining at times, i beleave its worth the five dollars, unless you're just getting the game to use that new cheat Smike from youtube was talking about, Thumbs up! definitly a great buy and play! i really reconmend you ty it out soon!",
            "review_score": "1"
        },
        {
            "review_text": "its was more glitchy than i expected i would like a refun",
            "review_score": "-1"
        },
        {
            "review_text": "yeah scott when fnaf 3 coming out ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game!  Pros:  Long Game Hard Game Creepy Game BEST STORY EVER!",
            "review_score": "1"
        },
        {
            "review_text": "Great game. By far this is one of my favorites. Great job and i hope to play more of your games Scott. Great work!!",
            "review_score": "1"
        },
        {
            "review_text": "Hold down toy freedys nose on the poster on the right and press CD+ at the same time!",
            "review_score": "1"
        },
        {
            "review_text": "Such a good game, played it and I practically screamed the first time.",
            "review_score": "1"
        },
        {
            "review_text": "2SPOOKY 4 ME very scary and has a really weird fanbase and don't forget that laughing little ♥♥♥♥ ballon boy or should i call him ballon ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "this game is fun and scary but more scary then i thought",
            "review_score": "1"
        },
        {
            "review_text": "This game is gud ",
            "review_score": "1"
        },
        {
            "review_text": "To be honost,I just feel like it's not as scary as the first one,mabye because the popular and effective way of completing nights is VERY easy,but that's just me,it's a great game,and that 'Not scary' thing just makes it easy to play without getting scared,Wich makes it a great game. The fact that it's like that certain animatronics are unlocked on the nights,(Unlike Mr. FNaF 1 over there)it's perfect. I like this game a lot.",
            "review_score": "1"
        },
        {
            "review_text": "fnaf 2 is the best and im unlocking plushees on my desk. :D",
            "review_score": "1"
        },
        {
            "review_text": "NOPENOPENOPE simulater   Esc key breaker simulater  9999999999/1   *WARNING DO NOT PLAY THIS GAME OF YOU'RE SPOOKY*",
            "review_score": "1"
        },
        {
            "review_text": "My underwear is forever brown  10FNAF fan boys/10",
            "review_score": "1"
        },
        {
            "review_text": "It very cool! How about I will make video in the future... I told my brother wait to I make video. Hes 7. He wants first time to play Five Nights at Freddy's 1-4. Lol. I loves this trailer!",
            "review_score": "1"
        },
        {
            "review_text": "A great prequel, can't wait for fnaf 3!",
            "review_score": "1"
        },
        {
            "review_text": "This Game has an amazing lore!!!! The game has simple mechanics, and a simple way to play. If you want to play this game and you haven't gotten any of the games,wait untill the third game to come out so you get a sale!!!",
            "review_score": "1"
        },
        {
            "review_text": "Scott Cawthon put alot of work into this game good work scott cawthon take a 1 year brake if you want but I NEED FIVE NIGHTS AT FREDDY'S 3 I NEED IT but i recommended this game for you and i have the game made it to night 4 and you are just awesome man I LOVE YOUR FIVE NIGHTS AT FREDDY'S 2 GAME (and five nights at freddy's i love that too) and yeah so keep up the awesome cool good amazing good work k :) long live horror games :)",
            "review_score": "1"
        },
        {
            "review_text": "will be more updates",
            "review_score": "1"
        },
        {
            "review_text": "Step 1. Play game   Step 2. Get killed.   Step 3. Have A Heart Attack   Step 4. Get Revived By Doctors.   Step 5. Repeat   10/10 would die again",
            "review_score": "1"
        },
        {
            "review_text": "Extremely scary, challenging, fun, and addicting! I would highly recommend this game to people who love horror games. I have beaten the whole game except Golden Freddy mode, which seems nearly impossible. The strategy for the game is very vague, and that's what makes the game so difficult. This game is definitely worth getting; I paid for the both the PC and iPhone versions.",
            "review_score": "1"
        },
        {
            "review_text": "this is one of the best games i've ever played",
            "review_score": "1"
        },
        {
            "review_text": "great game that eveyone plays great job maker sorry i forgot your name",
            "review_score": "1"
        },
        {
            "review_text": "If Your looking for a game that good to play thats scary and has a good story its five night at freddy. use headphone cause their noises that you can only hear with headphones on the jumpscares that is really good it will scare you alot. so on this game i would rate it 10 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a bit better than the first one, there are more animatronics if you wanted that, there is a hidden 8th night, and it is realy hard! If you are playing this game for the first time it can be very scary but after a while it will get boring and the jump scares are not afective any more. Like the first game you feel acomplished when you have beeten a realy hard night. This game in my opinion is pretty good and I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is the funnest scaryiest and best story line ever!!!!",
            "review_score": "1"
        },
        {
            "review_text": "it amazing i love it it cool",
            "review_score": "1"
        },
        {
            "review_text": "A sequal that didnt suck.",
            "review_score": "1"
        },
        {
            "review_text": "██████████████████ ███████▀▀▀░░░░░░░▀▀▀███████ ██████▀░░░░░░░░░░░░░░░▀████ █████│░░░░░░░░░░░░░░░░│████ ████└┐░░░░░░░░░░░░░░░┌┘░███ ███░░└┐░░░░░░░░░░░░░░┌┘░░██ ███░┌┘▄▄▄▄▄░░░░░▄▄▄▄▄└┐░░██ ██▌░▄██████▄░░░▄██████▄░▐██ ███─┘░░▓▓▓▓░░░░░▓▓▓▓░░└─███ ██▀▓▓▓░▓▓▓▓░░░░░▓▓▓▓░▓▓░▀██ ██▄▓▓▓░▓▓▓▓▄▄▄▄▄▓▓▓▓░▓▓▄███ ████▄─┘█████████████└─▄████ █████░░▐███████████▌░░█████ ██████░░▀█████████▀░░▐█████ ███████░░░░▓▓▓▓▓░░░░▄██████ ████████▄░░░░░░░░░▄████████awesome game███████████▓▓▓▓▓███████████ ███████████▓▓▓▓▓███████████",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic game!!! I love it!!",
            "review_score": "1"
        },
        {
            "review_text": "This Is The Best Horror Game Yet!",
            "review_score": "1"
        },
        {
            "review_text": "lel cant beat night 6",
            "review_score": "1"
        },
        {
            "review_text": "its a realy good game but their is some lag in my gamei dont know why it gust needs fixed",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth it for the lore alone, the story gets deeper and deeper the more you look into it and it's just facinating. It's a game I rarely play on my own but when hanging out with a few friends, it's a good laugh. Better than the first game in quite a few aspects and plays quite a bit differently due to the changes in some mechanics such as the power usage and the additional animatronics.",
            "review_score": "1"
        },
        {
            "review_text": "Game is great. Creepyiest Game Ever",
            "review_score": "1"
        },
        {
            "review_text": "This game is mainly for the players who played the first game but anyone who has played the original game you know this game is MUCH harder then the first game 10 animatronics to deal with BB coming to REKY REK you letting foxy to go and ♥♥♥♥ your corpes.",
            "review_score": "1"
        },
        {
            "review_text": "To easy to impossible this game is amazing! The aspect of getting jumpscared in a little kids pizzaria is amazing love the design Scott Cawthon worked really hard on this game and we all are grateful keep up the good work. I rate this game 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome more than fnaf 3 i wish toy chica could stare at u when u have the mask on but Scott Cawthon is sweg",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great mixture of scary, great gameplay, and curiousity. These games together have a story and everyone wants to know what it is! I totally recommend ths game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome it. No game has even come close to the amount of sweat this game has put on my Logitech G700! I have never played a horror game that has given me this much stress. Thank you for this amasing game.",
            "review_score": "1"
        },
        {
            "review_text": "This game may not be as scary as the first, but's its still as chanllenging as F%$#. With new bots to keep an eye on, including the old ones, there's no such thing as 'Safe'. I give this game 5 stars, one for each night of hell.",
            "review_score": "1"
        },
        {
            "review_text": "ITS THE BEST GAME IN THE WORLD! ",
            "review_score": "1"
        },
        {
            "review_text": "i need some holy water next time i enter this place",
            "review_score": "1"
        },
        {
            "review_text": "*Was told that withered animatronics only started to attack on night 3* *Makes it through night 1 no problem* *Starts night 2 everything is going fine and then Bonnie and chica leave the stage* *I flip through the cameras, I find Bonnie but not Chica* *I turn on my flash light and find Chica in the hallway, I put on my mask for a while* *I take my mask off, wind the music box and find Mangle in the hallway, I pull up my mask* *I take it down to rewind the music box, then I put my mask back on* *I take my mask down to turn on the flashlight, Mangle is still there* *I put my mask back on* *I still think Mangle is in my hallway, but I don't know that he left the hallway* *I get jumpscared by withered foxy*  10/10 would get lied to again",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you wanna try out the new refund policy.",
            "review_score": "-1"
        },
        {
            "review_text": "Everytime Old Foxy Appears When I Try 0/0/0/0 On Custon Night I Always Press Escape Because I Always Think He Will Jumpscare Me :'(",
            "review_score": "1"
        },
        {
            "review_text": "a much more scarier game than the previous one FNAF or (later one I should say becuase of it's own story plot saying this is a prequel not a sequel)",
            "review_score": "1"
        },
        {
            "review_text": "it hard :3",
            "review_score": "1"
        },
        {
            "review_text": "I definitely recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a review of the entire series. No I will not review all of them, because, no, I don't want to buy all of them and waist a good $30 on games I don't like.  Five Nights at Freddy's blew up over the past year. And for no good reason other than Markiplier played it. Though he plays a lot of games that don't get the same attention as this one. So why was this so popular, I mean every body and their mother made a video about the game and it's hidden story, that's just that, hidden. And I think that's what made this game so popular. Five Nights played on that fear of the unknown, until you quickly figured out that games mechanics.  I hate when people call this game the best game of 2015, it really isn't. I couldn't even really name one, though the Early Alpha Sandbox for Yandere Simulator (another game being made by a single person as an independent developer) has much more innovation put into it than all of the Five Night's games put together.  Five Nights at Freddy's uses jump scares, and that's all it uses. There isn't anything else that makes this game 'scary' and at that the game isn't even scary, it's startling. The only time that the game is ever name stressful is when you're watching another person play it. And you can pick up the patterns that the animatronics use.  And the story is hidden. You shouldn't have to look for the story in a game that has one. There are plenty of games that just push you into the world without any explaination. And those don't need stories to them, a cryptic story is better than what Scott did. When you have to have the internet explain your story for you, you aren't doing your job correctly.  Age Rating: E 10+, For mild violence. The game is harmless, it couldn't hurt a fly if it tried to.  Overall Rating: 3/10 The game is not good, I paid money for a game that's made with the same quality as a free flash game on newgrounds. Hell Kiwi 64 had a better production quality and they don't charge a cent.",
            "review_score": "-1"
        },
        {
            "review_text": "Hello my name is Hypershadicguy64 Scott you did a awsome job on making Five Nights at Freddy's 2 I just want to give the following that I LOVE about Five Nights at Freddy's 2:no doors,artstyle,you made the game all by your SELF(teach me plz i'm trying to make a game myself),10/20 mode,GOLDEN FREDDY,foxy(DO WHAT YOU WANT CAUSE A PIRTIE IS FREE YOU ARE A PIRTIE),AND FINALY WHAT YOU HAVE BIN WANTING TO HEAR THE GAME IT'S SELF. Scott you have made a great game but I flaw and IT IS:theres no doors wich makes the game harder wich I do not like at all. I rate this game a 9.9 for now intil Five Nights at Freddy's 3.",
            "review_score": "1"
        },
        {
            "review_text": "To be completely honest this is a really good game. Your surroundings are really atmospheric while you have the numerous animatronics coming at you from all angles exluding the marionette. I believe Scott has a really good talent for making horror games and if you dont believe me then just play it for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "SCARED THE POOPS OUT OF ME ERMERGEREDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD!!!!!!!!   so many youtubers over react to get dem views tho... ♥♥♥♥♥s  10/10 ign THIS GAME IS FOR DEM ♥♥♥♥♥S THO",
            "review_score": "1"
        },
        {
            "review_text": "Great game! It took me 2 weeks to complete night 3, and my escape key is already broken! 10/10 :)",
            "review_score": "1"
        },
        {
            "review_text": "This is the game I make anyone new in my life play, especially if they haven't played it before. Like the original...except worse. Now you have to look left, right AND straight ahead, as well as wind up a music box now and again. When I first played, I didn't know about the music box and the puppet ripped my spine out. I made my wife play and she was killed by Foxy, my favorite. Then I made two friends play it because I ran out of anxiety pills, and they forced me to play night 3. I survived and haven't played any more since. Um...I need batteries...yeah...",
            "review_score": "1"
        },
        {
            "review_text": "A great game where a bunch of killer animatronics come and get you but you have 'tools' to survive such as cameras and flashlights to defend yourself. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 2 LOL Play  Night 1: 12 AM: Alright so I'm working but i dont wanna get up Oh a Phone is Ringing 1 AM: So Yeah Tutorial 2 AM: Still Talking Boring Man!! 3 AM: Finally Shuts up Oh s**t the dudes moved 4 AM: Um whats up with Chica She had Eyes and a Beak But No More 5 AM: What the F**k Toy Bonnie Why do you dis Im am Your Father Freddy D: 6 AM: Finally I win :D   Night 2: 12 AM: Ok i'm Back Phone Guy Will you not talk as long 1 AM: Ok He finally shuts up What the Foxy is in my Hall 2 AM: Good Foxy is Gone and Wind The Music Box What the f**k a another Foxy hanging in Prize Corner 3 AM: I'm Looking through the cams and What The SDFHFSDHDSHF HH HDFAHAF HD FH Broken animatronics?!?!?!??! 4 AM: *Boring* 5 AM: Ah .. What kid in the vents foxy back and says 'I knew this wasn't a Good Idea' 6 AM: YASSSSSSS I WIN :D   Night 3: 12 AM: Way too many attempts im using a stragey 1 AM: Allright i'm in total focus mode *music box winded* 2 AM: Foxy again *sighs* 3 AM: WTHSFDHUGHFHH Broken animatronic Bonnie Mask On 4 AM: YESSSSSS IT F****KING WORKED 5 AM: I can do this *Actviates MLG Mode* 6 AM: GFDSJHFH HF H YES ALLLLL HAILL!!!!!! I'M THE MASTER!!   Night 4: Not attempting till i get over all over that scares",
            "review_score": "1"
        },
        {
            "review_text": "there are even more spoop! like 2x the spoop!! incredible!!",
            "review_score": "1"
        },
        {
            "review_text": "my journey through fnaf 2: 1:buys game 2:opens game 3:plays till night5 4:cant beat it 5:finds out theres a code to skip the night and uses it 6:uses it for all of the nights and gets all of the plushys",
            "review_score": "1"
        },
        {
            "review_text": "this is one of the hardest games i have ever tried to complete. definately worth the 8 dollars",
            "review_score": "1"
        },
        {
            "review_text": "I was killed by foxy on New and Shiny mode on night 7. Spit mountain dew at screen. 9000/10 would spit again",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun game to play, but once you get through it it gets kinda boring.",
            "review_score": "1"
        },
        {
            "review_text": "As much as I like the story concept, the gameplay can be challenging and at times... 'blah'. Why 'blah'? Being the second installment in the series, the game felt more stressful than terrifying, and by the time I finally played it, every YouTuber was done with this and spilled the beany secrets in the game. It was because of this that I didn't enjoy it as much as I could've.  Also, I want to express this opinion of mine that I've held for quite long: These FNAF games are meant to be strategic and make you think in a survivalist's situation, and the scares are only meant to keep you off focus. If you get past the horror aspect, it's nothing more but strategy. Think about it, will ya?",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as 1 and 4 but definitly better than 3.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game to all gamers out there. Scott Cawthon created the scariest, creepiest, most best game ever. I don't know anybody who hates this game.",
            "review_score": "1"
        },
        {
            "review_text": "Same thing as all of the games don't copy and paste.",
            "review_score": "-1"
        },
        {
            "review_text": "How do you get mods for it?",
            "review_score": "1"
        },
        {
            "review_text": "This game made me come to terms with my furaffinity.",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 2 is my favourite one of the trilogy. More characters, cooler music, scarier settings, and just a better game all around. Number one is a unique horror game, and the third is a disappointment. This was the best game, and one I play every day.",
            "review_score": "1"
        },
        {
            "review_text": "Woah it's scary you're in a room alone nothing but a mask a camera no doors no seals on the vents and the main thing that will stay with you in the halls your buddy Foxy and the creator did a great job with the jump scares if you want a horror game buy it!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Great game, hardest of all of them. Chicken Bunny and a Teddy Bear come at you and you put on a mask to keep the woodland creatures from attacking. Genius.",
            "review_score": "1"
        },
        {
            "review_text": "GREAT BUT SCOTT GOLDEN FREDDY IS WAY TO HARD ",
            "review_score": "1"
        },
        {
            "review_text": "inturupting freddy wh *fnaf 2 scream. fna series awsome ",
            "review_score": "1"
        },
        {
            "review_text": "Great game. By far this is one of my favorites. Great job and i hope to play more of your games Scott. Great work!!",
            "review_score": "1"
        },
        {
            "review_text": "FNAF 2 is AWESOME and scarey. THE END. I recomend it too u! U cood Noscope this game so much its b8! I rate this 8/8!",
            "review_score": "1"
        },
        {
            "review_text": "Well what an overrated game  Pros Nothing  Cons The game is boring all you do is open doors check rooms and shine light at creatures Scott Cawthon is being pushed to hard by these '18 year olds' on the fanbase because all they say is make a new game The fanart is horrendous just go look at sonic99rae's channel and then you will see why It is not even scary One of the reasons why it is not scary is because of the ugly unrealistic graphics The fans are autistic 8 year olds The lore and plot is ♥♥♥♥♥♥♥♥ and unrealistic The only people who play the game are ♥♥♥♥♥♥♥♥ 8 year olds who have no taste in horror games, and YouTubers trying to get views    I wish I could refund this but I got brainwashed for 14 DAYS and wasted almost 2 hours of my ♥♥♥♥ing life  Give me my 2 hours back Scott Cawthon  This is why kids FNAF sucks   *Grabs Popcorn* Come at me FNAF fanboys",
            "review_score": "-1"
        },
        {
            "review_text": "I don't like horror. I am not sure why i bought this game the day it came out on steam. Not played it much. Got too scared. :( But not a bad game. :|",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite game out of the whole series! :)",
            "review_score": "1"
        },
        {
            "review_text": "This is nothing compared to Spec Ops: The Line. Nothing.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is very repetetive and it's just no scary.",
            "review_score": "-1"
        },
        {
            "review_text": "i liked it real good #FazbearNecesities",
            "review_score": "1"
        },
        {
            "review_text": "Played it,Failed it XD Loved it :D  *************************** MissWonderlandX3",
            "review_score": "1"
        },
        {
            "review_text": "This game lives up to the FNaF Hype! With no doors, but this time a mask, and a flashlight! It just makes the game more fun and challeges! the jumpscare will get ya, and the mecanics are good!  11/10 game I HIGHLY recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "Pro tip: Keep your laptop battery low so it'll go off when you unplug it to avoid a jumpscare.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 scared the ♥♥♥♥ out of me.  #NOPENOPENOPENOPENOPENOPENOPENOPE",
            "review_score": "1"
        },
        {
            "review_text": "Very scary but at the same time a fun game to play. It is recommended not to play after dark 😂",
            "review_score": "1"
        },
        {
            "review_text": "i love this game i have done all the modes it's so fun to play golden freddy mode",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddys 2 is a horror game and a prequel to FNAF This game is much less scary than FNAF1 but is alot harder. Its not the best or the worst FNAF game  6/10",
            "review_score": "1"
        },
        {
            "review_text": "Rushed and incredibly primitive, Super boring after a solid 30 minutes, and just plain not scary  3/10 'Rushed, with a flavor of non-horror'",
            "review_score": "-1"
        },
        {
            "review_text": "Good developer good game  10/10 best fanf! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "when i first saw this game i was like omfg cant wait :D ",
            "review_score": "1"
        },
        {
            "review_text": "The Best Game Ever Also The Reviewer on the bottom of my ARE YOU THE ONE WHO KNOWS RYE-RYE99?",
            "review_score": "1"
        },
        {
            "review_text": "Argueably the game in the series with the most replayabilitiy, Five Nights at Freddy's 2 has a lot of content compared to the rest of the games.",
            "review_score": "1"
        },
        {
            "review_text": "If youve read my review from the first game, thats what i say to this game too. FNaF 2 is a bit more of a challenge because of many more animatronics than the first one. i recommend this if you have a brain like mine",
            "review_score": "1"
        },
        {
            "review_text": "I Love This Game And Series As A Whole. I First Heard Of This At School, Where I Thought My Buds Were Talking About A Person At Their Friends House 'Freddies' And Ducks, Foxes, And Bunnies Attacked You. Until I Got On Youtube And Saw It. I Bought The First 2 Games Cause I Wanted To. I Spent 5 More Hours On This Than FNAF1 Trying To Beat 20/20/20/20. I Love This Game REALLY Hard. I Ignore The Cancerous Fans Of FNAF Also. Plus, Since I Want To Make Undertale People In The Fandom Angry, Undertale's Fandom Is Worse Than FNAF.",
            "review_score": "1"
        },
        {
            "review_text": "FREAKIN AWESOME! Keep up the good work Scott!",
            "review_score": "1"
        },
        {
            "review_text": "Brother came in as BB and tryed to scare me, I punched him     13/10 Would kick his ♥♥♥ again.",
            "review_score": "1"
        },
        {
            "review_text": "PLAY IT CAUSE WHY NOT",
            "review_score": "1"
        },
        {
            "review_text": "I really like the freddy mask comes useful in situation",
            "review_score": "1"
        },
        {
            "review_text": "The game is AMAZING! But... what would make it even more amazing, is if each character with the exception of foxy and the puppet had a position on EACH camera! (Excluding The show stage, prize corner, parts &amp; service, ect.) For example: Toy freddy and BB only have one camera location. I think it would be even cooler if after you finish the FNAF series, you go back  to this or one of your old games and update it to make it even better! This is Just a reccomendation, thanks for reading! :)  Rating: 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Why did i buy this when it came out w t f",
            "review_score": "-1"
        },
        {
            "review_text": "This is really a GREAT game! The gameplay is fun and challenging. The only thing I hate is Enragement Child (Balloon Boy).",
            "review_score": "1"
        },
        {
            "review_text": "night 8 it not the good night for me ",
            "review_score": "1"
        },
        {
            "review_text": "I used to love these, now they're alright. Most of the fandom is one of the things that ruined this series, a fandom that I was sadly apart of at one point.",
            "review_score": "1"
        },
        {
            "review_text": "Good game :P ",
            "review_score": "1"
        },
        {
            "review_text": "Too easy to get to the 7th night and boring only bought for the story just look up the story on the internet since this is jus too easy and boring",
            "review_score": "-1"
        },
        {
            "review_text": "it so fun to play",
            "review_score": "1"
        },
        {
            "review_text": "One word. Terrifying. To be honest, I knew when the jmpscares are going to happen so it didn't scare me that much. But everything else did. The stress. The setting. Old Bonnie and Old Chica(I freaking hate those two). I made it to night 5. If you like a stressful but fun and terrifying in a game, this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Unlike FNAF 1, there is much more to do this time. You now have to flash lights, wind up the music box, and put the Freddy head on. This game has a lot of easter eggs that are cool. Some of them are annoying. The only problem I have with this game is Balloon Boy who is annoying. Like the first game, the jumpscares become less scary, but they are more scary than the first. I forgot to mention that there are minigames if you die sometimes. Also the price isn't bad and I would even buy this game if it was at $10. Overall, this is a big improvement compared to the first game.",
            "review_score": "1"
        },
        {
            "review_text": "why did scott rerelease FNAF? is it some marketing thing i don't get? it's weird",
            "review_score": "-1"
        },
        {
            "review_text": "It wont let me go in the game",
            "review_score": "1"
        }
    ]
}