{
    "app_id": 333290,
    "name": "Mos Speedrun 2",
    "release_date": "2015-09-03",
    "developer": [
        "Physmo"
    ],
    "publisher": [
        "Physmo"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 58,
    "positive_ratings": 15,
    "negative_ratings": 1,
    "price": 2.89,
    "description": "Mos is back, in her biggest and most exciting adventure ever! Wall-jump to victory through 30 mysterious, action packed levels!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/333290/header.jpg?t=1447365069",
    "minimum_requirements": "OS: Windows XP+ Processor: 1.4 ghz Memory: 2 GB RAM Graphics: DirectX9 (shader model 2.0+) / OpenGL 2.0+ Storage: 300 MB available space Sound Card: DirectX9 Compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Briefly:   Graphically it looks deceptively simple but I was surprised to find that Mos Speedrun 2 is actually a very enjoyable, challenging platformer. It has a nice amount of levels with lots of secrets to find and an amazing soundtrack!   After seeing the store page, I thought  Mos Speedrun 2  was one of those simple and perhaps lame platformers but I was happy to note I was wrong. Despite (or perhaps because of) its simple presentation it packs with quite a lot of high-quality content.  Game has 30 levels placed in groups of six through five worlds with their own distinct graphics styles and soundtrack (that fits the game very well), with enemies and traps going with that. In that it strikes a similarity with Super Mario Bros 3 and its diverse worlds. Of course  Mos Speedrun 2  totally lacks a story and  doesn't have weird suits  Mos' suits are merely visual.   Jumping through the ages",
            "review_score": "1"
        }
    ]
}