{
    "app_id": 333350,
    "name": "Cults and Daggers",
    "release_date": "2015-02-12",
    "developer": [
        "Chaphat"
    ],
    "publisher": [
        "Chaphat"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Turn-Based Strategy",
        "Grand Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 30,
    "negative_ratings": 18,
    "price": 22.99,
    "description": "Cults and Daggers is a strategy game set in the time between the death of the Buddha and the birth of Christ. You create your own religion and fight a secret war for the soul of the world. The game includes, spies, assassinations, double dealing, occult forces, martyrs, prophets and blasphemers.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/333350/header.jpg?t=1457318618",
    "minimum_requirements": "OS: Windows XP SP2 or later Processor: 1.5 Ghz CPU Memory: 2 GB RAM Graphics: OpenGL 2.0 compatible 3D graphics card with at least 256MB of addressable memory. Must support 1024 by 720 or better Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It looks like there could be a great game hidden in this however hidden is the key word. The most basic problem is that the UI is a mess and it is hard to figure out what happens each turn. This is a shame because following the results of what your disciples do each turn is the coolness that should drive this game. Also, lots of basic things like no way of figuring out what the special abilities of your disciples actually do and a manual that is incomplete in this and many other respects. For a strategy game, you need facts (for example, how many disciples you can have in each age after the 1st, etc.)  There is another big reason why you should not buy this game, though. Some people like early access games. That's cool. But releasing a game without disclosing that it is in early access state is dishonest. Don't feed the liars. Don't buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "EDITED  I'm going to be frank and say this game is not perfect. It's far from it, and it really should be labelled as Early Access. Putting this game on an arbitrary ten point scale, I'd score it around a 3. I originally gave this game a down vote, and I do strongly urge potential buyers to do their own research and know what you're getting in to.  However, the concept alone is something fresh and is a breath of fresh air on Steam. The developer also keeps a close ear on the forums and is taking the criticism and suggestions offered to heart. As long as the developer keeps putting in the effort to fix things, they'll have my confidence.",
            "review_score": "1"
        },
        {
            "review_text": "Really amazing game, especially on hard difficulty, I just love it",
            "review_score": "1"
        },
        {
            "review_text": "I can't recommend this game as it is. The idea is good but the UI and gameplay needs more work. Even some simple enhancements like a more user friendly event report would lift this game a lot. The occult powers are bizarre and seem to have no attempt to balance out effort vs reward yet they could have been a really fun element of a game like this.  I hope the developer would spend more time working on this game but reading his recent online post, he feels the game is complete. Shame because the idea of the game is great.",
            "review_score": "-1"
        },
        {
            "review_text": "takes some time to get into, not great but good",
            "review_score": "1"
        }
    ]
}