{
    "app_id": 333660,
    "name": "Towers of Altrac - Epic Defense Battles",
    "release_date": "2015-01-05",
    "developer": [
        "Jsmael Stieger",
        "Manuel Stieger",
        "Andreas Stieger"
    ],
    "publisher": [
        "Cybertron Design Studios"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Strategy",
        "Action"
    ],
    "achievements": 82,
    "positive_ratings": 63,
    "negative_ratings": 44,
    "price": 2.09,
    "description": "Towers of Altrac is a 3D Tower Defense cooperation game for up to 4 players with an innovative A.I. system “S.A.D.”, which makes your enemies intelligent . Fight against the horde of Goblins, Orcs, Dragons and other monsters on 62 unique maps. The game is for every level of player experience.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/333660/header.jpg?t=1493497196",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8.0, Windows 8.1 Processor: Dualcore 2.0 GHz CPU or higher Memory: 1 GB RAM Graphics: ATI Radeon X700, NVIDIA GeForce 7600 or higher Storage: 5 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I will never forget the time when Drat the goblin Lord strolled, without a care, through both my defences and my heart. His stoic nature, and his patient aura followed him onto the battlefield, even as thousands upon thousands of arrows peirced his soft green hide. He would even pause every few feet, just to look around at his surroundings (and seemingly into my soul) and then begin giving birth to 10-20 of his smaller clones, each of which also held his manly nature, though to a smaller degree. Even casting ice on his path would not douse the fire in his heart, as he continued to wade slowly towards both legend, and a place in my dreams.  Pros: - Drat the Goblin lord, who lives eternal in the depths of this game - you do not have to put a password on your multiplayer games, due to small player-base - You can zoom in all the way. Inspect the Rocks! the Trees! The Grass! Sometimes the CASTLES! - Some towers throw nuts! Nut EVERYTHING! - A whole bunch of campaign missions! Like a whole bunch! so many! - Can be played in russian, german AND ENGLISH!  Cons:  - Cannot be played in any other language - The textures can look a bit blurry if you look at the screen - no fast forward button    This game is like the dark souls of tower defense games. You either feel like you are breaking the game when you are winning, or you have a bunch of friends that make the game absurdly easy.  Thank you Drat, the rock of my life",
            "review_score": "1"
        },
        {
            "review_text": "Not bad but also not amazing TD ive played can suddenly become difficult it also doesnt warn of upcoming air levels. Just expect if a new air tower unlocks the next map will have air mobs. Graphics are old seems like this td was made with empire earth 2's engine. Build spots are limited to areas of these blue puddles which can be good and bad wave direction is also random at times. that factor can be costly youve built all your towers over on these puddles but these mobs turned left instead destroyed a rock barrier and are now unchallenged walking tot he end goal.  pick it up if its a few dollars and you like td i expect to waste time in this game seeing all the new stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game with good defensive type graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Quite possibly the worst game I've ever had the opportunity to play. Don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "Junk! I bought this game at 2.50$ and I think I got ripped off. Grafix are horrible, Gameplay is chunky and uninspiring, I would not give this to a friend even if they asked for it. This game would be a beta at best, but no it's a finnished game. Three siblings made it so it probably had no buget to speak of when making it. It could be a cool game but it requires alot more polishing.",
            "review_score": "-1"
        },
        {
            "review_text": "Uninspired and tedious Tower Defense game with subpar graphics and very boring towers.",
            "review_score": "-1"
        }
    ]
}