{
    "app_id": 333970,
    "name": "A Druid's Duel",
    "release_date": "2015-02-25",
    "developer": [
        "Thoughtshelter Games"
    ],
    "publisher": [
        "Surprise Attack "
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Strategy",
        "Multiplayer"
    ],
    "achievements": 49,
    "positive_ratings": 76,
    "negative_ratings": 27,
    "price": 5.79,
    "description": "A Druid's Duel is a fast paced turn-based strategy game set in a world of Celtic lore where players can create and destroy the board by harnessing the power of nature.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/333970/header.jpg?t=1447365200",
    "minimum_requirements": "OS: Microsoft速 Windows速 7+ Processor: 1.4GHz or faster Memory: 1 GB RAM Graphics: Any from the last 4 years Storage: 1 GB available space",
    "recommended_requirements": "OS: Microsoft速 Windows速 8+ Processor: 1.6GHz or faster Memory: 1 GB RAM Graphics: Any from the last 4 years Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "This is a great fun little game that I love playing, I play it to kill time between classes at school, and at night to relax, it should have an app version, but it still a really good game, so if your looking for a smiple light game, that still has deep strtagy involved in the game you should really check this game out really soild game great buy.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. The only problem is one of variety once you've played for a while. Druids in this game come in 4 flavors: wolf, eagle, bear, and turtle. This plays like an electronic game, winning is based on controling the board and gaining momentum. Had a hard time finding other live players, so I've mostly played the AI campaign.",
            "review_score": "1"
        },
        {
            "review_text": "Woeful! Feels like a free flash game!",
            "review_score": "-1"
        },
        {
            "review_text": "A different kind of tactics there should be more games like this, the mecanics are fluid even in a tabletop it would be fun",
            "review_score": "1"
        },
        {
            "review_text": "It reminds me of one of those games you'd find at a bar that was overpriced and the only reason you were allowed to play it was because your dad took you there on his weekend to keep you distracted so he could go drink and pick up a random stranger. It's fun, and just about as cute as the squids on the bar version but offers little. So buy it cheap and all will work out, unless you want to reminisce of all the weird moments in your life with your broken family, then buy it at whatever price. There is a lot of stratedgy to this game though so it is worth it.",
            "review_score": "1"
        },
        {
            "review_text": "PRO: - Human vs. Human multiplayer. - Solid gameplay. - Good music, sound, graphics and consistent theme of Nature and Druids. - Easy to pick up and play, short and simplistic gameplay.  CON: - Short and simple can be both good and bad thing, depending on whether you want more complex and large scale strategy. - Self-repeating and boring single player Campaign. - Disgustingly poorly made Boss fights in Campaign. I mean absolutely disgusting.  RESULT: Good and quick paced terratory control and unit management strategy game. Fun with friends, just steer away from the single player experience.",
            "review_score": "1"
        },
        {
            "review_text": "A great strategy game. I would highly recommend this to anyone who likes these kinds of games. Wholly underrated.",
            "review_score": "1"
        }
    ]
}