{
    "app_id": 334040,
    "name": "Down To One",
    "release_date": "2016-01-07",
    "developer": [
        "Gadget Games"
    ],
    "publisher": [
        "Gadget Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Steam Trading Cards",
        "Stats"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Survival",
        "Open World"
    ],
    "achievements": 0,
    "positive_ratings": 868,
    "negative_ratings": 1357,
    "price": 0.79,
    "description": "42 Players Start. Only 1 will survive.Down to One is a competitive survival shooter in a large, interactive, open-world environment. Start out with nothing, and use anything you can find in the environment to survive, and eliminate other competitors over the course of a brutal round.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/334040/header.jpg?t=1520162783",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 64 bit Processor: 2.4 GHz Intel Dual Core Processor Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX460/ATI Radeon HD 5850 DirectX: Version 11 Network: Broadband Internet connection Storage: 4 GB available space Sound Card: Direct-X compatible sound card Additional Notes: Minimum spec assumes user runs the game at 1280x720 resolution with low graphics settings.",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: Windows 8.1 64 bit Processor: 3 GHz Intel Quad Core Processor Memory: 6 GB RAM Graphics: ATI Radeon HD 7970/Nvidia GeForce GTX 660 DirectX: Version 11 Network: Broadband Internet connection Storage: 6 GB available space Sound Card: Direct-X compatible sound card Additional Notes: Recommended spec assumes the user runs the game at 1920x1080 resolution with &quot;Very High&quot; graphics settings",
    "reviews": [
        {
            "review_text": "Bought in at $15 a while back because I saw potential in it during 'early access'. I've now come to check on it again to find it is out of 'early access' and dropped down to $1 but still has all the issues early supporters spoke of at the time. Honestly, it's kind of a slap in the face to early supporters but it happens. However, I can't recommend it at all, not because I was shafted, but because it's literally unplayable still. Code is still buggy, waiting time for games is longer than actual gameplay time, hitboxes are bad, players literally 'teleport' through objects. Honestly they should've done a price drop earlier or more bundles to promote the game because the early cost of $15 is a big buy-in considering you could get CS:GO for that price and an insanely active community.",
            "review_score": "-1"
        },
        {
            "review_text": "Down To One is a military survival game where 42 players battle it to become the final person alive.  This game is a massive disappointment. I wanted to like this game a lot and without a doubt for a dollar this game is not bad, but it's plagued by so many problems I can't recommend it.  As stated before the game is a 42 player survival game where you go around a map and find supplies so you can become the final person alive.  The massive problem with this game is no one plays it. Now I only tried this game twice and once I waited an hour for a game and got nothing and then a second time I waited another hour and played a game which ended in 4 minutes.   I had a fun time even though it lasted for that short, but the fact is I didn't want to wait another hour to play another game so it could end in 5 minutes.  The game also has a lot of glitches and bugs which could easily be ironed out by the devs.   Texture popping, character models glitching, items clipping through items are just some of the issues that plague this game.  I really want to say more about this title, but sadly I can't say a lot. My honest suggestion is either find a community to play with or play with friends otherwise skip this title.  Final Rating: 3/10 - Don't Bother  If you liked this review please consider giving it a thumbs up and if you disliked post in the comments on what you disliked about this review.  For more reviews follow Snort's Review curator page  here  - follow for regular updates on reviews for other games! ",
            "review_score": "-1"
        },
        {
            "review_text": "BROKEN LANGUAGE ALERT! I'm not a native English speaker, but I'll try my best to make my thoughts clear and literate.   Well, it seems that Down To One is being criticised for it's animation, optimisation, some bugs, that spoil gaming experience, and that is a problem. But still, this game has some interesting features and ideas, which, anyway, need to be polished and refined.  For those, who don't know - Down To One is a game with a conceps similar to one in a japanese movie 'Battle Royal', and it's the closest one to it. 42 men start a survival deathmatch with only one to be victorious.  Here are some things, that I think are good + Concept of matches is clear and easy to understand for a novice: you start at one location (or near a random one, if it is a server feature), get to any location to get some loot to start. Then, it's a weapon crate drop in a random location and playable area starts to decrease, making players move to a final location. Not speaking of survival part, which is obvious nowdays. And this is good. + Terrain of a map sometimes make sense. Snakes spawn near the rocks, waiting for players, There is a mine field, that is laid... well... tactically correct, if you ask me. Sometimes you can find water under trees in desert. But finding a pistol or an axe in a basket is a bit strange, but still rewarding. + Skill set is well-balanced, but not perfectly. You can't make an OP combination of perks however you try. But some game features make some skills not so effective (for example, 'Play Dead' is irrelevant, as you get a message about a person died if he dies for real). This is easy to be fixed, and I hope developers know how to do it better. + There are enough weapons for a game released 11 days ago. I've not got tired of shooting this weapons as I haven't tried all of them. But I hope there will be more of it. And by the way, it's a pleasure for me to shoot with all this guns. I feel all the guns more realistic, than guns in Call Of Duty: Black Ops 3 *smiley face*.  I know, thet there are some bugs, problems with optimisation, animation and graphics, but I won't tell a thing about it as I'm OK with it and play on 'Maximum FPS' settings. So it's not me to tell you about the graphics, but still it's not too bad.  The real problems are: - Hit detection system is too random. It seems bearable if you shoot guns, but in melee you shall pray Tzeentch or any other god of Random to land a punch or get a target with an axe (especially snakes. If you meet it without a gun - you are 80% dead). The problem is that you can go through you enemy while fighting, and so can your fist/melee weapon, so hit will not be counted (I don't really know how to explain it). Just make player models solid, and it will be easier. - Snakes. Snakes! SNAAAAAKES! Oh god I never thought that i will hate this creatures so much. They are way too dangerous here They bite as strong as a US soldier punch you in the face (according to logic of a game). And they decrease your hunger and thirst bars every time they bite. And they bite really frequent. And you think they are easy to be killed, huh? HELL NO! You will be 3\\4 dead, thirsty and hungry when you will finally get it. And it seemed to me, that I spend as much bullets to kill a snake as to kill a player. Nerf them or make them easier to hit. GG FIX PEASE! - Ladders. The thing is you don't reach the top of a ladder as you climb, so you have to jump to get to the roof. But that's a minor one. As some other minor ones I won't be wasting time here. - Servers. There are too few of them and they restart after evey match. and it's a bit hard to hit 42 men on one server. Or maybe it's so because of my time zone. Make some less maximum players on servers and make more servers themselves. This will be great. Really.  To sum up... This game is good. Not great, but playable. something '7.1/10' if you ask me. Good for an indie. And of course, I recomend it to survival genre fans wwho are tired of zombies and all fans of 'Battle Royal' concept.  I hope developers from Gadget Games read this reviev. You do great now. Don't give this game up. You still can make it better and better and I look forward content patches in future. Good luck with Down To One. Do your best.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AWESOME, BUT NEEDS MORE UPDATES!  WHY GUYS?  Down To One is a promising battle royale game, but it needs urgent new updates, before is too late!   This is a highly bugged game and incomplete... But... This game is an indie game, and for an indie team this is a big work! The gameplay works well, is solid, the game is very funny, but it needs a lot of improvements and some additions. The variety of weapons is very good, and the foods, survival, system is good too (better than H1Z1)! A lot of bugs (some are serious) needs to be fixed because the gameplay and fun is seriously compromise.   FOR THE DEVELOPERS: I'm a developer too, I can understand the sorrow for an empty game and for a lot of negative reviews, but this is your fault. Down To One is promising, the gameplay is solid, all bugs and gameplay mechanics can be and needs to be fixed and improving a lot, before release other projects, because other future projects sales will be damaged compromised for this conduct. Please do not abandon this project, because it is solid and needs only finishing touches. This is an indie project i can understand!  The players are angry because they feel abandoned without news of game developments..   FOR SAVE THE GAME FROM THE ABYSS AND REGAIN THE PLAYERS CONFIDENCE IS NEEDED:   1) Return to Early Access, the game isn't finished!  2) Update Unity 5.4 beta in 5.4.1 Stable, many crashes!  3) Write news to explain the development state of the game (regular news)  4) Updates every month (1.3, 1.4, 1.5...)  5) Fixed various serious bugs as:  5.1) Players can see through walls  5.2) Transition from walking, running etc.. needs to be very quick  5.3) The animations and the walking is too slow, it needs more balance  5.4) Some wrong collider can block you from walking  5.5) The 'waiting arena' is boring, enlarge it and make more aesthetic objects  5.6) Main menu buttons not respond well at mouse click  5.7) Set Static Server list to default if this is to set every time  5.8) The server list doesn't show number of player and ping (?/42, ?)   5.9) Exit Game button doesn't work  5.10) Some video options (as shadow quality) miss its settings     6) Features needed for a modern and fun Battle Royale game:  6.1) Player/weapons customization skin/accessories with a 3d model preview  6.2) The Skill needs to be reworked  6.3) After death you can give some skin/player customizations rewards, based on match rating  6.4) Team play, to play better with friends  6.5) Add more weapons (or same weapons but with different scopes/accessories)  6.6) Add accessories for weapons (scope, silencer etc..)  6.7) Rework and Enlarge the map  6.8) Armors and helms to find  6.9) backpack for increase items slots (start with only 3, 4 ,5)  6.10) Add some vehicles (quad, motocycles, jeep?)  6.11) 2 start match spawn: 1) random, 2) parachute  6.12) Add more sounds, enviroment, player, weapons  6.13) Add a portable map (optional with dome system) without player position and dome  6.14) Planes Bombing Raid  6.15) The Graphics and Textures need improvements (some are good, other are very bad)  6.16) The Players Animations need improvements   I trust in you guys, please make one of the best Battle Royale game! Down To One can become better than H1Z1, the gameplay is more complex and various, only needs some tweaks.   Let's Develop Now!",
            "review_score": "1"
        },
        {
            "review_text": "Sorry, but no. Please dont waste your dollar on this game. Just don't. I would give an actual review of the game but i cant even play it. I can't even join a server.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a lot of die &amp; retry but then you learn the map &amp; where the good stuff is, then you learn how to use perks in a smart way, then you realize this is a game of patience &amp; definitely not one where you can win a round by going around shooting everyone like Rambo. You will die. I love the natural terrain cover, crouching behind a small dirt bank &amp; moving along the hill lines is very satisfying. Everything else is pretty much standard battle royale with food management, but it's simple &amp; fair. Add me if you want someone to invite in a server to start a game",
            "review_score": "1"
        },
        {
            "review_text": "The idea isnt bad- its the execution if there were more building in the world the whole game would be way more interesting the menu is pretty buggy, and i have to try multiple times to click a button",
            "review_score": "-1"
        },
        {
            "review_text": "  The only game I've ever removed from my account for existing.",
            "review_score": "-1"
        },
        {
            "review_text": "it's pretty good game for a dollar but nobody plays it",
            "review_score": "-1"
        },
        {
            "review_text": "Has much potential. the concept of the game is very fun and enjoyable especialy with friends but the glitchiness of the game like slight cliping problems are annoying but seem to be minor. the game is very well optimised and has pretty good netcode, i have bad internet but i am still able to play it with next to no connection issues and there is almost always a server with people to play with on. things that i think would make for a better game is better animations for the guns so they arent always in the way and things like a score board and a few other minor things but over all for the price and small download size it is a fun game to kill some time on.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly the worst game I have ever played. I didn't even buy it. First person to find a gun wins.",
            "review_score": "-1"
        },
        {
            "review_text": "I would not recommend this game at all, I bought this when it was £10 and it was a mess with a barely working multiplayer, And now they reduce the price to £0.79? If you actually want to play a game with working multiplayer and a Battle Royal game mode I'd suggest: Rust, H1Z1 or arma 3. Not this garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "Saw all the reviews, wanted to try it myself, just to see if people are over reacting. Nope. Game is trash, near non-playable, there is like 8 servers, only 3 works... Don't buy even if it's less than 1$  EDIT  Came back, 2 months later and game is more playable but still need a lot of work, will keep on coming back tho! I did 2-3 games today and finally it's playable.",
            "review_score": "-1"
        },
        {
            "review_text": "I would not recommend this game at all, I bought this when it was £10 and it was a mess with a barely working multiplayer, And now they reduce the price to £0.79? If you actually want to play a game with working multiplayer and a Battle Royal game mode I'd suggest: Rust, H1Z1 or arma 3. Not this garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "Kicked a soccer ball around, break danced, joined, froze for 20 seconds, found a pistol and pineapple juice, almost died to a snake that can walk through cliffs and died to a man that can teleport 10/10 best game I've ever played forget Insurgency and and Rainbow Six Siege, this is by far the most immersive survival shooter with a tactical feel. Definitely worth the $65 usd pricetag.",
            "review_score": "1"
        },
        {
            "review_text": "Well, this game is basiclly a recreation of h1z1 but cheaper in a bigger way.  The game itself can sometime be boring, but its just an early access game but not early access.  Even though its kinda ♥♥♥♥, its price is okay so i guess its good?         Nah just kidding its ♥♥♥♥ so i will put it on recommended",
            "review_score": "1"
        },
        {
            "review_text": "had high hopes for this game ... sadly enough the longer i kept the game and the more i tried, the more disappointed i got...  the game itself is a great idea; but when there is no one to play with, and the occasional play is just a 1V1 then the game is dull and not fun at all... the marketing department for this game made some big errors ...  also about the pricing; some people paid 15 on greenlight, others paid 1 after the greenlight period; that's not fair; that's just jackpotting the greenlightsers. Also, a few months ago the game was in a bundle sale for even less money...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so bad but so fun it just needs a player base back.",
            "review_score": "1"
        },
        {
            "review_text": "Please turn down your graphics to more people playing the game I have good computer and runs 20 fps on laptop and low .... When Repair that you will get positive review...;)",
            "review_score": "-1"
        },
        {
            "review_text": "Ok so 11 minuets into the game, lots of bugs and glitches. For example, I hit this guy with a sledgehammer 6 times, and this guy with a water bottle hit me 3 times. Who won? The shotto c*nt with the bottle. Nice job, full health for both of us. Also Optimise the game a bit more plz. Goot game tho",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic. Among all the great things in this game, I'd say the absolute highlight of it all, is that glorious, gleaming, beautiful, fantastic uninstall button. By far, the best feature in an already great game. But seriously though, the uninstall button, is legitimately the ONLY button that even works.. My frames are down to one, boys!  11/10. best gane. best game. ♥♥♥♥ me.",
            "review_score": "-1"
        },
        {
            "review_text": "It's OK",
            "review_score": "1"
        },
        {
            "review_text": "this game is a masterpiece more people should buy it. this game would be amazing if more people bought it. this game is so broken its fun",
            "review_score": "1"
        },
        {
            "review_text": "Cool concept, poorly executed",
            "review_score": "-1"
        },
        {
            "review_text": "Steven Hawkings run better than this game",
            "review_score": "-1"
        },
        {
            "review_text": "Wow, my friend and I bought it each for $15 and now it's down to one dollar? Shouldn't have even bought this garbage in the first place.",
            "review_score": "-1"
        },
        {
            "review_text": "EPIC FANTASY REBORN  The next chapter in the highly anticipated Elder Scrolls saga arrives from the makers of the 2006 and 2008 Games of the Year, Bethesda Game Studios. Skyrim reimagines and revolutionizes the open-world fantasy epic, bringing to life a complete virtual world open for you to explore any way you choose.   LIVE ANOTHER LIFE, IN ANOTHER WORLD  Play any type of character you can imagine, and do whatever you want; the legendary freedom of choice, storytelling, and adventure of The Elder Scrolls is realized like never before.   ALL NEW GRAPHICS AND GAMEPLAY ENGINE  Skyrim’s new game engine brings to life a complete virtual world with rolling clouds, rugged mountains, bustling cities, lush fields, and ancient dungeons.   YOU ARE WHAT YOU PLAY  Choose from hundreds of weapons, spells, and abilities. The new character system allows you to play any way you want and define yourself through your actions.   DRAGON RETURN  Battle ancient dragons like you’ve never seen. As Dragonborn, learn their secrets and harness their power for yourself. 10/10 game.",
            "review_score": "1"
        },
        {
            "review_text": "down syndrome to one",
            "review_score": "-1"
        },
        {
            "review_text": "even with these 'optimization updates' it still runs like poop.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is really good for the current price!",
            "review_score": "1"
        },
        {
            "review_text": "Very bad, can not even connect to a single server...",
            "review_score": "-1"
        },
        {
            "review_text": "Very bad",
            "review_score": "-1"
        },
        {
            "review_text": "This is game is what dreams are made from.",
            "review_score": "1"
        },
        {
            "review_text": "optimization is kind of garbage :(",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great game. Expecially for the price. The game is dead but that isnt the developers fault, so you cant necessarly leave a bad review for that reason alone. The ladders are a bit glitchy as well but overall this is a great game worth getting if you have an extra dollar lying around.",
            "review_score": "1"
        },
        {
            "review_text": "This game is dead, can i have mine €1 back?",
            "review_score": "-1"
        },
        {
            "review_text": "Spent 15 minutes running around in an ugly world with alot of bugs and glitches only to get backraped by a guy that was no clipping through a mountain. 10/10",
            "review_score": "-1"
        },
        {
            "review_text": "BY far one of the worst attempts at a game I ever saw.   The list of issues is clearly visible by anyone with eyesight, on top of the fact I am pretty sure the makers never even played it once before sending it out to us.  This is not even an alpha, its more like when you brainstorm in a room when you are about 12 years old using visual basic trying to code hangman.   You die most of the time trying to find something, and you die so fast from no food or water (2-3min?)    Anyway , don't waste your time ever",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted this $1 game to be good  It would be pretty enjoyable, but there's not enough players.  So if you're reading this, stop being a cheap-♥♥♥ and buy it!!!!  It's kinda bad, but it's sorta fun in a ♥♥♥♥ed up way.",
            "review_score": "1"
        },
        {
            "review_text": "Life changing experience, am I now a better FPS games player and have mastered real life skills needed to survive in the wilderness. 10/10 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "lol i bought it for 59 cents if u paid 15 kys",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥iest game ever. Do not buy, UNLESS, you need a game in steam, just because You bought Valve pack on ♥♥♥ and you need game for selling/buying skins InGame CSGO",
            "review_score": "-1"
        },
        {
            "review_text": "Got the 4 pack on sale so spent less than $0.50 on this game, first server I joined once I figured out for to invert mouse beat someone to death with my fists (they may have been afk). Ran around eating chips and drinking gatorade for $15, found a gun, ran around hidding from a guy with an axe until it was just me and him left, shot him in the face and won the round. Pretty happy, may never play it again :P",
            "review_score": "1"
        },
        {
            "review_text": "it took me only one game to realize that this game is not finished. when you need to have an optimization update after the game has been released then you know just how un-polished this game is. I had about 1-10 fps max while playing and the game had my mouse outside the screen. After the optimization update was released i tried to play again but found that there were no servers to play on that i could find (something that could be improved is the server browser) during the game i did play though with low fps, i did not find a single player in a full game and could not find out how to exchange my weapon or pick up any other supplies. i ended up winning this game and then never played it since.   conlusion: this game is not that good so i bought the 4 pack",
            "review_score": "-1"
        },
        {
            "review_text": "  screw this game.",
            "review_score": "-1"
        },
        {
            "review_text": "hi id like to start off in saying i bought this game for 47p cause i thought the concept of the game was good. so i played it and it ran 20 fps max (if there is a way to increese that please tell me because i changed the ingame settings and nothing changed) but if you was to fix that this would be a great game at a great price but at the moment its unplayable for me. (i get a perfect 60 fps when no one is in the game or 5-10 ppl are in the game but when 40 ppl are in im looking at 20 fps)",
            "review_score": "1"
        },
        {
            "review_text": "This game... it's not worth 59 cents... just don't do it. I would rather drink bleach than play this game.  I wouldn't play this game if it was free-to-play. Developers... I hope you die for making this atrocity.",
            "review_score": "-1"
        },
        {
            "review_text": "It'll be better eventually.",
            "review_score": "1"
        },
        {
            "review_text": "They need to fix a lot of ♥♥♥♥ for it to be any good. And by the time they do, the fanbase will probably be dead. But you get what you pay for.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely the WORST purchase I have made on Steam to date, the game looks terrible, the engine feels worse than anything I have ever played on. While the developers may be working on this game and updating it frequently, I quite frankly will never play this again. The price should have been a hint but I was the sucker who bought it anyway. Without a doubt if you are looking for a good battle royale game do NOT buy this, even if you have next to no expectations, you WILL leave disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has a lot of potential. I just bought it and it's really bugy. Hope that developers will fix those big bugs like movement,and respawn.",
            "review_score": "1"
        },
        {
            "review_text": "running around as the master chief killing the covenant then realising this isnt halo  3rd graders using kidspix could make better animations  59/10",
            "review_score": "1"
        },
        {
            "review_text": "No servers at all.",
            "review_score": "-1"
        },
        {
            "review_text": "This game causes cancer,and yes i played it long enough to know",
            "review_score": "-1"
        },
        {
            "review_text": "how fun to enter a match then die everytime you do so oh and i agree it's a survival cause you have to survive how horrible it is",
            "review_score": "-1"
        },
        {
            "review_text": "This game is ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "complete shit, worth less than one cent only good for the trading cards",
            "review_score": "-1"
        },
        {
            "review_text": "i waited 15-20 min waiting to join this sever andi would rather go outside in the snow then playing this game",
            "review_score": "-1"
        },
        {
            "review_text": "Didn't feel like posting a review until I saw all the negative. This game is ♥♥♥♥ing great. They've been saying that there are many game breaking bugs, however I have not noticed any. I only have one issue with this game, and that would be optimization. This game runs about as well as ArmA 2 did, Great for godly PC's, decent for good PC's, and ♥♥♥♥ for everyone else. With some optimization updates and more content this game could be one of the best Battle Royale games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Lmao the ♥♥♥♥ did i just play",
            "review_score": "-1"
        },
        {
            "review_text": "This is what happens when ♥♥♥♥♥♥♥ make counter-strike, It's so bbad I can't even stomach this",
            "review_score": "-1"
        },
        {
            "review_text": "I would rather bathe in period blood for 2 hours then waste another dollar on this.",
            "review_score": "-1"
        },
        {
            "review_text": "My powerpoint presentation get more fps than this.",
            "review_score": "-1"
        },
        {
            "review_text": "&gt;Spend 10 hours loading &gt;Spawned &gt;Followed a guy with a G18 &gt;took it from his hands &gt;punched him to death while VOIPing 'im a slippery little snake' &gt;enemy player never saw me, and died from a mysterious source &gt;found air drop &gt;walked up on 2 players fiddling with a gas canister &gt;picked up triple barrel shotgun and killed them both &gt;got a sniper rifle &gt;sudden loading screen &gt;4/20 would buy again -ign",
            "review_score": "1"
        },
        {
            "review_text": "asked people this game vs big rigs. everyone answered big rigs is much better. i agree too",
            "review_score": "-1"
        },
        {
            "review_text": "NOT h1z1 NOT good gameplay  thank god for steam refunds",
            "review_score": "-1"
        },
        {
            "review_text": "I love how the servers are empty. But Idling for cards is fun too 11/10 would try again",
            "review_score": "1"
        },
        {
            "review_text": "Nope",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 whould play again best game ever better than all the elder scrolls and te fallouts etc",
            "review_score": "1"
        },
        {
            "review_text": "It's so ♥♥♥♥ing bad it's not even funny do not buy it",
            "review_score": "1"
        },
        {
            "review_text": "Game seems really early in development. In a sea of online FPSs there isn't much that makes this stand out.",
            "review_score": "-1"
        },
        {
            "review_text": "No servers, you can find server like 2/40 people abd thats it but if you join the server you spawn in center and do nothing (that happened to me)",
            "review_score": "-1"
        },
        {
            "review_text": "survival of the fittest. plain and simple you have no allies. unless you invite a couple of friends, but in the end there is no friends only the sole survivor. there is only one rule (exept hacking the game of coarse) there are no rules. only one man will live and tell the tale.  if you like this kind of game i can reccomend the game.  expect no csgo but it can be fun.  i havnt won a single game yet but i like it anyway  less than a euro its a bargin.  no revolution. just fun with other gamers. ",
            "review_score": "1"
        },
        {
            "review_text": "Don't usually write reviews but when a game isn't even worth 60 cents i feel i have to. The game although it is version 1.0 has no optimization, the servers lag with only a few people on them. The game locks up and crashes randomly, and unless you use the join feature server option, chances of actually getting into a game are slim. If you join a game in progress and spectate till the next round a message pops up saying 'round is over please join another server' and kicks you out.  I like the concept of a pure battle royal game but this game is not the one to deliver it. The servers are crap the player base is small and something as simple as aiming down your scope is broken and might crash the game. If your looking for a good battle royale style game look elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "First off I want to say that I am entirely truthful about everything I say in this review. I joined a server (Which are slim to none for a game)! I then was instantly blown away by the lag. My computer is a mid-level computer that can handle most gaming usually depending on the game. I got 8 frames, but since I joined a game in progress and was forced to spectate others the entire time I wrote it off as 'Im spectating them in first person maybe thats it!'. Wrong, I joined a match shortly after and here's what happened: got in( lag was unbearable but did it anyhow), foundak-47 aimed and my hand went through the barrel of the gun, died to snake because I couldn't shoot cuz of the lag. 3/10 Looked good at least and had alright survival and perk system.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought two games get refunded for this one now I'm down to 1 thank God I got a refund this game is horrible broken do not buy this game its not worth the $0.59",
            "review_score": "-1"
        },
        {
            "review_text": "I dont thing this is cool game but the idea is good.",
            "review_score": "-1"
        },
        {
            "review_text": "Love it. Runs like Friggin bull**** but its still bette then DayZ. Cheap, fun little game, 7/10",
            "review_score": "1"
        },
        {
            "review_text": "dont work  the online comunity on my sucks no one is playing this game",
            "review_score": "-1"
        },
        {
            "review_text": "In short: Good Battle Royale game, has some nice mechanics, but it should not have been released this early.  What happened here:  During the time the game was in early access, the development was exceptional. If you had any issue with the game, the developer would immediately help you out as he could. Any suggestion, criticism, etc, he was there to listen.  The updates were extremely frequent. At first, the focus was on content, from weapons and locations to gamemodes and mechanics, and more recently, the focus shifted towards the bugfixing.  What is perhaps the cause of one of the big problems with this game, is the fact that when in early access, the servers never got to fill up with the serverlist often being completely deserted (people who wanted to play, logged in and upon seeing 0 online players, they naturally closed the game instead of waiting on the lobby area for someone to show up). This situation basically hid many latency/performance problems that would only become apparent on the day of release. It certainly wasn't for lack of trying though as the developer motivated it as much as he could by organizing and recording weekly tournaments. But still, people (like me) would only show up for the tournaments as that was a time where we were certain that we would be able to play the game (still, they rarely went above 15 players)  Game development is not easy at all. It is an extremely exausting line of work that as the added bonus of producing something potentially subjective to the worst types of criticism. I am not saying that no game is above criticism, but I can assure you that the best efforts were being made here. Whatever reason the developer had to release this game, I am sure that it was a least desired choice that had to be made.  But in the end, when people buy a game, they buy the final product, not the story behind it's conception.  Down to One has been an enjoyable and competent game, but it is extremely buggy, has some game-breaking glitches and (as many report) has some severe performance issues. As difficult as it must have been to keep this game going in early access, releasing it in this state will most likely hurt this game in about a month or two as the playerbase may very well go down again.",
            "review_score": "-1"
        },
        {
            "review_text": "Got at ♥♥♥♥♥ Cheaper!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Played 15mins and its terrible",
            "review_score": "-1"
        },
        {
            "review_text": "This game is absolute GARBAGE. You may be tempted to buy it for the $0.65 it is, DON'T. It is beyond BROKEN and borderline UNPLAYABLE. The animations almost NEVER work properly and easily become disjointed, there are BUGS GALORE, I couldnt even spawn in without it killing me instantly, LAUGHABLY BAD ANIMATIONS (If they work!), AWFUL optimization, ugly generic graphics, boring gameplay.  These are just a few reasons you SHOULD NOT BUY THIS GAME. If I can prevent 1 SINGLE PERSON FROM BUYING THIS, I am happy. As gamers, we shouldnt allow this kind of crap in game development to happen. It has been in early access since 2014, and it is just as broken as then.   0/10 just no. ",
            "review_score": "-1"
        },
        {
            "review_text": "Game is nowhere near 1.0 glitches and ♥♥♥♥♥♥ optimization galore",
            "review_score": "-1"
        },
        {
            "review_text": "Game isnt fun to play because movement doesnt work properly but game is updated frequently so I reccomend it to people that likes to watch game evolve :)",
            "review_score": "1"
        },
        {
            "review_text": "This game sucks so much",
            "review_score": "-1"
        },
        {
            "review_text": "Saw the game for 59 cents, saw the mixed reviews and thought, how bad could it be for a couple of cents? Considering I haven't even played the game because every time I've tried to launch and play it, it has crashed. Very bad would be the answer. This game looked liked it would be fun to waste some time on but in all honesty I wouldn't recommend the download if it was a free game. After the third attempt at trying to get into a match I unistalled the game and got my 59 cents back as a refund because I will not support devs/games that are 100% unplayable. What's sad is that there are games in alpha/early access that run a ton better than this game and are actaully playable.",
            "review_score": "-1"
        },
        {
            "review_text": "Yes, very good it is quite indeed. Thank you",
            "review_score": "-1"
        },
        {
            "review_text": "The games idea is very good, although it needs improvement. The bad thing is, the game is dead. So, i thought that evryone whos interested at playing this game, add me on steam and we could play together sometimes.",
            "review_score": "1"
        },
        {
            "review_text": "back when this game had some players... It was VERY fun... Game was fun as hell... But poorly made... Now as of when this review was released zero people are on servers... Decided to reinstall after a year and launched to see zero people on servers... This was worth 0.99 cents way back when but dont waste ur money on it at this moment... game cant be any deader hopefully a miracle comes through and the game is revived...",
            "review_score": "1"
        },
        {
            "review_text": "I Have purchased this game through steam, but after installation if i opened the game and click on play button nothing happens after a while the game closes and i can't do anything,. ,.. I didn' played this game watching the game trailer and price for the game i purchased this. But this game just shows some options play,find a match, report bug etc,. Help me to fix this bug or my money back I am going o delete this soon,. if you not able to fix this bug ..",
            "review_score": "-1"
        },
        {
            "review_text": "I remember when this game came out, it was optimized awfully, now I read the reviews and see the playbase is dead, there's your reason why no-one played this game. OPTIMIZED POORLY ON RELEASE.  Not sure now.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is fun to play with friends because of how overly derpy ith is.",
            "review_score": "1"
        },
        {
            "review_text": "  The Game is awesome but a little paintful with the glitches",
            "review_score": "1"
        }
    ]
}